{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I completed the course over nine days, one module each evening after work. The way the instructor connected non-self to cognitive science (predictive processing, attention tests, even the rubber hand illusion) made the ideas stick. The guided prompts at the end of each unit gave me something concrete to bring into a 20‑minute sit, and the “what to watch” checklist helped me notice sensations instead of chasing thoughts. By the final week I had a tidy set of notes and a clearer framework for how craving loops pull attention.",
        "source_2": "Focusing only on the quizzes: the questions often used terms that never appeared in the videos, like Abhidhamma categories in Week 2. Several items were multi‑select with ambiguous wording and all‑or‑nothing scoring, so I couldn’t tell which parts I understood. Explanations after submission were one‑liners like “review lecture 3,” without pointing to timestamps. I had to rewatch entire modules just to figure out why an answer was marked wrong.",
        "source_3": "Zeroing in on the selflessness section: the lesson that breaks experience into sight, sound, body sensations, and thought tags finally gave me a handle on “no owner” without getting mystical. The instructor’s example of catching the “I” thought as just another event changed how I label during meditation—now I note “planning, warmth in hands, pressure on chair” instead of telling myself a story. After a week of trying that, my sits had fewer long detours, and I could catch the urge to check my phone as a bundle of sensations rather than a command.",
        "source_4": "As an overall take, the course felt more like a light survey than a study plan. Videos are short and repeat slogans, citations are sparse, and the “scientific foundation” usually stops at naming a concept without showing data or discussing limits. The meditation guidance leans on general reminders rather than step‑by‑step instructions or troubleshooting for pain, sleepiness, or rumination. I finished the material but kept looking elsewhere for depth on dependent origination and practical drills beyond basic noting.",
        "source_5": "Concentrating on production quality: audio levels jump between clips, with occasional mic clipping that makes it jarring on headphones. Slides are low‑contrast and small on a phone, so graphs about attention networks are hard to read. Captions contain frequent misspellings of Pali terms and sometimes desync with the video by a second or two. I ended up pausing constantly to decipher terminology.",
        "source_6": "Overall, the structure worked well alongside my daily sits. Week 3’s look at craving as prediction error nudged me to write down urges during the day, and that journaling made evening meditation steadier. The community forum was mostly quiet in my session, so peer discussion didn’t add much, but the pacing kept me moving and I actually finished the sequence on schedule. I came away with a workable checklist for what to observe on the cushion and a clearer way to explain these ideas to friends."
    }
}