{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I bought the 11 Prime for my parents and tested it on our Airtel Fiber 100 Mbps connection with a TP‑Link Archer C20. On 2.4 GHz, the phone shows 3–4 bars in the bedroom (two walls from the router), but Speedtest bounces between 1 and 6 Mbps. Play Store downloads sit at 0%, and YouTube refuses to start unless I’m practically in the hallway outside the router room. My old Moto G5 and a Fire TV Stick in the same spot pull 40–60 Mbps. I reset network settings, turned off MAC randomization, assigned a static IP, and even changed the router channel—no real change.",
        "source_2": "Using the 11 Prime as my daily for a week: calls on Jio are crisp, battery comfortably lasts from morning to night with around 5–6 hours screen time, the camera is fine for casual snaps, and the display is readable in sunlight. I’m usually on mobile data; at home I connect to my 5 GHz SSID and stream YouTube at 1080p from the sofa without hiccups. Picked it up during a sale, and it’s been a dependable carry.",
        "source_3": "My headache has been app installs. On Wi‑Fi (2.4 GHz), Play Store shows “pending” for ages, and YouTube buffers unless I sit near the router. The same network on my laptop and an older Redmi downloads in seconds. On the 11 Prime, Speedtest rarely crosses 5 Mbps from the next room, but the moment I switch to mobile data, apps download immediately. I cleared cache for Play Services, tried safe mode, and installed the latest update—no change.",
        "source_4": "I followed Amazon’s process: requested a replacement first, then a return. The first unit had sluggish Wi‑Fi; the replacement behaved the same—status icon shows good strength, yet Google Meet drops and Drive sync crawls unless I’m within a few feet of the router. Support had me reboot the modem, forget/rejoin the network, and rotate through channels 1/6/11 on 2.4 GHz. After the second handset mirrored the issue, I sent it back.",
        "source_5": "I got the 11 Prime for my nephew during the festival sale at 8,999. He mostly uses it for classes on Zoom, WhatsApp, and some BGMI on mobile data. Build feels sturdy, the fingerprint reader is quick, and the screen is large enough for reading notes. We haven’t relied on Wi‑Fi much since their broadband is inconsistent anyway, but as a budget buy it covers the basics and keeps up with schoolwork."
    }
}