{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I’m writing only about the battery. With dual SIM (Jio + Airtel), 90 Hz on, brightness around 60%, and a routine of two hours of YouTube, some Instagram, and WhatsApp calls, the phone hits 20% by about 4 p.m. I’m averaging 3.5–4 hours of screen-on time before I reach for the charger. Overnight standby drops 8–10% even with Wi‑Fi off. On a day with Google Maps for a 45‑minute drive and a half-hour Zoom call, I had to plug in twice.",
        "source_2": "Focusing just on touch and unlocking: the screen tracks swipes cleanly in BGMI and Asphalt; I can pull a 4‑finger claw without missed inputs. The fingerprint reader on the side wakes the device almost instantly, and even after adding a tempered glass + case, edge gestures register without those “dead zones” I’ve seen on other budget phones. No phantom touches so far, and typing feels accurate with Gboard at default sensitivity.",
        "source_3": "My notes are only about the camera. Daylight shots are fine for quick posts, but indoors the focus hunts, and moving kids or pets turn into smeared frames. HDR takes an extra beat, so bright windows blow out unless I tap to meter. Night mode brightens the scene but textures look like watercolor. 1080p video wobbles when walking—no stabilization to save it—and the mic picks up wind easily. Scanning documents works best near a window; under warm bulbs, text edges fuzz.",
        "source_4": "Overall take after two months: used as a work phone with Gmail, Slack, Teams calls, and Bluetooth earbuds connected most of the day. Starting at 7 a.m., I usually end around 10 p.m. with 15–25% left, charging from 20% to full in about 1 hour 45 minutes with the in‑box charger. Calls are clear, GPS locks quickly for Uber rides, and the speaker is loud enough for podcasts at my desk. The camera is okay for receipts and whiteboard notes, and I haven’t hit any app freezes that slowed me down.",
        "source_5": "I tried relying on it for field visits and office errands. With hotspot on for my laptop and Google Maps running between client sites, the battery slid from 100% to 38% by early afternoon, forcing a power bank stop. Scanning multi‑page contracts under fluorescent lights needed several retakes to get readable edges. During a 45‑minute Teams meeting on 4G, the phone warmed up near the camera bump and the percent ticked down faster than expected. By 6 p.m., I was under 10% and hunting for an outlet.",
        "source_6": "Another perspective on the battery: single SIM on Vi, 60 Hz enabled, mostly Wi‑Fi, and light use—email, Kindle, Telegram, and an hour of YouTube at night. I’m seeing 6.5–7 hours of screen‑on time with 2–3% overnight drain, so I charge every other evening. A weekend train trip with offline Spotify and an hour of photos still left me at 35% by bedtime. I keep adaptive brightness on and disable background activity for a handful of apps, which seems to help."
    }
}