{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I bought this mainly for capturing a cousin’s wedding. In the banquet hall, the rear camera kept exposing for the stage lights, so everyone’s faces came out two shades darker. HDR was on auto; I also tried tapping to raise exposure, but highlights blew out while faces stayed in shadow. Portrait mode clipped ears and smeared hair strands, and 1080p/30 video showed dancing grain on darker curtains. The front camera’s beauty filter was on by default and wiped away skin texture. My sister’s older sub-8k handset produced brighter, clearer group shots under the same lights.",
        "source_2": "I spent an afternoon testing the camera in a park around 4 p.m. With tap-to-focus and exposure lock, the shots had crisp leaf veins, even skin tones, and a sky without banding. I turned off the AI filter and got photos I posted to Instagram without editing. Printed a 5x7 from one image and the text on a signboard stayed legible. Night scenes still require steady hands, but daytime results looked consistent for family albums and travel notes.",
        "source_3": "After two weeks, the phone makes everyday tasks feel like wading through mud. App switching stutters, the keyboard sometimes misses letters, and people on calls say my voice sounds distant. Battery drops from 100 to around 70 by lunch with just WhatsApp, two email accounts, and a short Maps session. Indoors, the camera hunts for focus and produces flat-looking photos, so I started carrying my older device for pictures and a power bank for longer days.",
        "source_4": "I only care about endurance, and this holds up. With two SIMs active, constant Slack notifications, and about 90 minutes of YouTube, I routinely see 6.5–7 hours of screen-on time. Overnight drain is 2–3% with Wi‑Fi on. The included charger takes it from 15% to full in just under an hour, and even on a train commute with patchy signal, it reaches bedtime without a low-battery warning.",
        "source_5": "As a daily driver, it’s been dependable for me: dual-SIM calls stay clear on Jio and Airtel, GPS locks quickly for Uber, and the screen is readable in midday sun at around 75% brightness. Bluetooth audio in the car doesn’t drop, and the side fingerprint sensor unlocks on the first try most of the time. The camera isn’t the showcase feature, but for receipts, class notes, and daylight snapshots, it covers my needs while the rest of the phone handles streaming and banking without fuss."
    }
}