{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I picked up a family-size box of Kellogg’s Corn Flakes at Target last weekend and flipped it over looking specifically for a clear statement about genetically engineered ingredients. There was the usual nutrition panel and allergen callouts, but nothing that told me whether the corn came from engineered crops. I scanned the QR code on the flap and landed on a generic nutrition page with no mention of sourcing. I opened a chat on Kellogg’s site and the rep said they follow federal guidelines and don’t list that detail on the box. I put the box back and grabbed a brand that prints a third‑party non‑GMO seal right on the front.",
        "source_2": "I stock up on Kellogg’s Frosted Flakes and Rice Krispies at Costco because the two‑pack keeps breakfasts simple for my kids before school. The panels are easy enough to read for calories and sugar, and that’s what I watch. I’m not chasing extra labels about crop sourcing, and I don’t have time to email companies about it. The flakes taste the same every box, the price fits our budget, and I’ll keep tossing them into the cart on my monthly run.",
        "source_3": "Because my daughter has several food sensitivities, I try to know exactly what’s in our pantry. I emailed Kellogg’s to ask if the corn and soy in their cereals and bars are from bioengineered sources and whether they’d consider putting that on the package. The response I got was a template pointing me to general policy and regulatory compliance, without a straight yes/no on the box labeling. I want to make decisions quickly at the shelf, so I’ve been choosing cereals that state “made with non‑bioengineered ingredients” in plain language. Until Kellogg’s gives that kind of clarity on the label, their boxes stay off my list.",
        "source_4": "After a year living in Europe, I got used to packages that flag how ingredients are sourced. Back home, I checked a Kellogg’s Raisin Bran box at Kroger and couldn’t find anything beyond the standard ingredient list, which left me guessing about engineered crops. I emailed customer service and was told they meet federal requirements, which still didn’t help me at the shelf. I ended up switching our weekend cereal to a brand that spells out its sourcing on the front panel so I don’t have to dig through FAQs.",
        "source_5": "I run early and usually pour a bowl of Special K Red Berries before work. The dried strawberries are punchy, the flakes stay crisp even if I answer a couple emails, and the family‑size bag lasts me about a week and a half. I’m aware there’s a debate about genetically engineered ingredients, but it isn’t what I base my breakfast choice on. What matters to me is taste, portion control, and convenience, so this stays in my rotation regardless of the label discussion."
    }
}