{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I kept waiting for an actual graded checkpoint and never saw one. Across the modules I only encountered self-check prompts and discussion posts, which made it hard to gauge whether I was meeting the learning goals. A final quiz or even short, auto-graded checkpoints after each week would have helped me verify that I really understood the material instead of just feeling like I did.",
        "source_2": "Zooming in on workload: I work 9–6 and found the weekly load fit into two evenings and a Sunday morning. The videos averaged 8–12 minutes each, and a full week took me about 3–3.5 hours, including a brief recap activity. Downloading lectures in the Coursera app let me watch during my commute, so I rarely needed to block more than 90 minutes at a time.",
        "source_3": "As an overall take: the lectures are tightly edited, slides are clear, and the captions match the narration, so following along was smooth. Where I struggled was translating this into a routine after a long shift. I wanted more guidance on building habits outside a campus setting—sample study plans for people with shift work, or examples of how to practice when your day job isn’t related. I ended up improvising my own schedule and wasn’t sure if I was practicing the right way.",
        "source_4": "Focusing on non-academic learning support: there’s an entire section on study logistics for working adults—timeboxing templates, a weekly planning worksheet, and examples of 20–30 minute practice drills you can do between tasks. I used their habit tracker and did two short drills during lunch and one in the evening, and that was enough to keep momentum despite a full-time job.",
        "source_5": "Concentrating on assessments: my run had nine graded quizzes (roughly one per week), two peer-reviewed mini-projects with rubrics, and a 60-minute timed final. Scores updated instantly for the quizzes, and the final counted for 30% of the certificate. The calendar with soft and hard deadlines kept me showing up each week, and the peer reviews gave concrete feedback on where my reasoning was thin."
    }
}