{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I bought this mainly for home Wi‑Fi use and it’s been rock solid on my Archer AX73 router. On the 5 GHz band (channel 36, WPA3), Speedtest sits between 280–320 Mbps down and ~40 up from my sofa, about 10–12 meters and two walls from the router. I ran a 45‑minute WhatsApp video call to my sister in the UK with no freezes, then streamed a 4K documentary on Netflix for two hours while browsing Instagram on split‑screen. Roaming from living room to balcony keeps throughput over 200 Mbps, and a 1.5 GB game update finished in roughly six minutes.",
        "source_2": "I loaded it with around 70 apps on day one (banking, Slack, Teams, Instagram, YouTube, Prime Video, and BGMI). App switching feels instant—YouTube resumes the exact frame when I jump back from Gmail, and Instagram Reels doesn’t stutter while music plays via Bluetooth. On my 100 Mbps fiber, YouTube defaults to 1080p and holds steady; even during a Telegram voice call and a Play Store download in the background, there’s no buffering on the video. After a week, app launch times are still snappy and nothing crashes on resume.",
        "source_3": "My unit struggles to stay online over Wi‑Fi. It connects to 5 GHz for a minute or two and drops to 2.4 GHz with speeds falling under 5 Mbps, and WhatsApp calls sound like a walkie‑talkie. I contacted support through chat and phone—both had me repeat factory resets and APN toggles, then scheduled a home visit that got cancelled twice. The ticket was closed as “resolved” even though no one inspected the phone; I had to reopen it and send screenshots of speed tests to get any movement.",
        "source_4": "After two weeks as my daily driver, I’m sticking with it. The screen is easy on the eyes for long reading, the battery gets me from 7 a.m. to late night with maps, two email accounts, and an hour of streaming, and call quality on LTE is crisp. Wi‑Fi on the 5 GHz band works fine in most rooms; the guest bedroom is the only dead spot in my apartment. I retired my older phone and haven’t felt the need to carry a backup.",
        "source_5": "This phone and my mesh network (Deco M5) don’t get along. It clings to the hallway node even when I’m next to the living room unit; Wi‑Fi Analyzer shows RSSI around −78 dBm and WhatsApp voice calls chop every few seconds. Toggling airplane mode restores decent speeds for a bit, then the sticky roaming issue returns. My Pixel 4a and an iPad roam cleanly between nodes under the same conditions, so it looks like the phone’s roaming aggressiveness is off.",
        "source_6": "My first handset had a quirky Wi‑Fi radio that wouldn’t see 5 GHz channels above 100. I reached support through the app; the agent verified logs, asked for a short video of the Wi‑Fi scan, and arranged a doorstep swap within 48 hours. The courier handed me a sealed replacement and took the old one. The new unit detects all 5 GHz channels, holds 300+ Mbps on my ISP plan, and I got a follow‑up call a week later to confirm everything was working."
    }
}