{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I used this in place of my usual Joico for two weeks on shoulder‑length wavy hair, washing every other day. I apply a quarter‑size amount, leave it on for about three minutes, and rinse thoroughly. By midday my ends look wiry and I’m chasing flyaways with a drop of argan oil, which I don’t normally need. On the third wash I noticed that squeaky feel when rinsing, and by the end of the workday my hair feels light but not in a good way—more static than shape. I’ve had to add a leave‑in to get the same slip I was getting before.",
        "source_2": "Zeroing in on scent only: the fragrance hits as soon as I flip the cap—powdery floral with a hint of vanilla—and it hangs around. After an evening wash, I could still smell it in my car the next morning, and it competed with my usual perfume. My partner asked what I’d sprayed because the smell lingered in the living room a full hour after my blow‑dry. If you’re sensitive to fragrance, it’s not subtle.",
        "source_3": "I’m focusing just on scalp feel. After the third use (two‑minute leave‑in, cool rinse), my temples and crown felt tight and itchy. I spotted small flakes along the part line that I don’t get with my regular conditioner. I tried using less—nickel‑size, kept away from the roots—but the tightness came back the next day. Switching back to my old bottle cleared it up within two washes.",
        "source_4": "Single aspect: detangling and slip. I have thick 3A curls and comb through in the shower. This spreads evenly and gives enough slip that my wide‑tooth comb glides without that snag‑and‑snap feeling. I can section faster, and fewer hairs end up on the drain cover. Rinses clean without a waxy coating, so styling cream grips better afterward.",
        "source_5": "Strictly on scent again, from a different nose: I’m into lighter fragrances, and this reads fresh and clean to me. It doesn’t overpower my body spray, and by lunchtime it fades to a faint whiff when I move my hair. I appreciate that it doesn’t morph into something overly sweet after heat styling.",
        "source_6": "Overall take after a month, soft water area: two to three washes per week, palm‑size amount mid‑length to ends. My hair dries smooth without weighing down my layers, and I can air‑dry and still get a soft bend without crunchy ends. No tight feeling on the scalp, and I’m not seeing residue on my brush. The pump bottle dispenses a steady amount, and I’ve barely made a dent, so it seems to last."
    }
}