{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I knew I was in trouble the first weekend. Starting at 100% at 9 a.m., the battery hit 19% by 6 p.m. after Spotify during a 40‑minute walk, Maps for a quick errand, and some Instagram. The camera smeared faces under restaurant lighting—our group photo looked like it went through a watercolor filter. At work, the phone kept dropping the office Wi‑Fi every few minutes and would randomly ask me to “sign in” again even though it’s an open network. I carried a power bank just to get through dinner, and I missed an upload because the Wi‑Fi stalled mid‑send.",
        "source_2": "I’ll speak only about battery life. I charge to 100% overnight, unplug at 6:30 a.m., and by 10 p.m. I’m usually at 25–35%. My routine is Slack all day, two 20‑minute calls on Bluetooth, an hour of YouTube during lunch, and some web reading on the train. Screen‑on time averages around 6–7 hours according to the built‑in stats. Adaptive Battery is on, brightness at about 40%, mostly LTE with Wi‑Fi at home. I haven’t needed to carry a charger since the first week.",
        "source_3": "Focusing just on the camera: outdoors it’s been fine for me. I shot my kid’s soccer game in burst mode; the frames were sharp enough to catch a goal mid‑kick, and 4K clips didn’t stutter. Colors look natural in daylight, and QR codes scan instantly. Indoors at night is where it struggles—faces look soft in my living room and there’s visible grain under warm bulbs. For daylight errands (documents, receipts, quick food pics), it does the job without much fuss.",
        "source_4": "My issue is strictly with Wi‑Fi. At home on a TP‑Link Archer C7, the 5 GHz network shows “Saved” but won’t grab an IP unless I toggle airplane mode. The 2.4 GHz band connects but drops to 1–2 Mbps after a few minutes. In cafés with captive portals, the browser hangs on the login splash and never completes. My laptop and my partner’s phone stay connected, so it seems device‑specific. I’ve tried forgetting networks, resetting network settings, and installing the July patch—no change—so I lean on mobile data when I’m out.",
        "source_5": "As an everyday device, it’s been straightforward: calls are clear, notifications come through promptly, and I move between home Wi‑Fi, subway LTE, and office without interruptions. The battery gets me through a 12‑hour shift with podcasts, messaging, and a few photos of whiteboards. The camera won’t replace a dedicated shooter, but daylight snaps of documents and outdoor scenes are crisp enough for work chats. For what I paid on discount, it fits my needs without extra accessories."
    }
}