{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I enrolled knowing almost nothing about Jewish communities in China, and the first week’s timeline helped me situate Kaifeng, Harbin, and Shanghai within the late Qing and Republican periods. The lectures tied migration stories to events like the Opium Wars and the opening of treaty ports, with old maps and photos that made it easier to follow. The readings included diary excerpts and a short piece from the North China Herald, which pushed me to think beyond names and dates. By the final quiz, I could explain why Harbin became a hub and how 1930s Shanghai shaped communal institutions.",
        "source_2": "I’m focusing only on the peer review system: the grading sheet had seven checkboxes—argument mapping, source triangulation, counterclaim, structure, citation, tone, and originality—that didn’t always match the essay prompt about synagogue architecture in Shanghai. One reviewer docked points under “methodology” because I didn’t include a hypothesis, even though the prompt was interpretive. Another flagged me for using footnotes when the instructions allowed Chicago or APA, so I got contradictory messages. I spent more time guessing what boxes my peers wanted ticked than revising my argument.",
        "source_3": "Just on grading: the rubric made my life easier. The Week 2 “example essay” walkthrough matched each rubric line to a paragraph, so when I graded peers I could point to the exact descriptor (e.g., “Level 4: clear thesis with contextual framing”). When I drafted my own assignment, I literally labeled sections—thesis, evidence, counterpoint—and my three reviewers gave almost identical scores. It felt consistent enough that I could predict my mark before submission.",
        "source_4": "As an overall take, the content and production quality were fine, but the grading system shaped the whole experience. I kept getting comments that prioritized box ticking over analysis, like losing marks for not having a separate methodology header in a 1,000-word humanities essay. One reviewer penalized me for Chicago footnotes even though the guidelines said Chicago or APA were acceptable, and my final average dropped despite strong narrative feedback. After Week 3, I noticed myself spending more energy decoding the rubric than engaging with the lectures.",
        "source_5": "I’m zooming in only on the historical material: the module on treaty ports clarified why communities formed around rail lines and customs offices, and the segment on the Kaifeng steles was especially clear about what is known versus conjecture. The instructor contrasted missionary accounts with municipal records, which helped me see how sources disagree. The Shanghai unit’s look at refugee aid committees in the late 1930s connected policy to everyday life with photos and short memos from the Municipal Council archives. I left with a much sharper picture of China’s 19th–20th century shifts and how those changes shaped communal institutions."
    }
}