{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I signed up specifically for the scientific content, and weeks 3–5 went well beyond intro material. The lectures unpacked reconsolidation and source monitoring errors with references to lab studies, and one segment walked through signal detection theory using d-prime and ROC curves. The quiz after the encoding lectures required calculating hits and false alarms from a small dataset, which took me a few tries on scratch paper. The instructor linked to a 2010 Journal of Neuroscience article, and I paused the video to read the abstract before continuing.",
        "source_2": "Focusing only on the film clips: they broke up the flow for me. Many were 20–40 seconds long and cut off before the crucial dialogue, so I couldn’t see how the scene actually illustrated memory biases. A couple of clips looked compressed and grainy on my laptop, and the timestamps didn’t match the framing in the lecture. I would have preferred a still frame with annotations or a diagram rather than short montage-style inserts.",
        "source_3": "As a first-time learner in psychology, the pacing worked for my schedule. The videos were usually 8–12 minutes, so I watched two during lunch and finished a module by the end of the day. By week 2 I could explain the forgetting curve to my partner using the course’s napkin-style graphs. I didn’t buy the companion book and still managed to complete the weekly quizzes on the first attempt, using only my notes and the downloadable slides. The discussion prompts nudged me to reflect on everyday memory slips, which kept me engaged.",
        "source_4": "Zeroing in on assessments: most quizzes asked for straight definitions or to match terms to short descriptions. In week 4, for example, there was a question that simply paired “encoding,” “storage,” and “retrieval” with one-sentence summaries. The mid-course checkpoint pulled multiple items word-for-word from the slide titles. I was hoping for scenario-based items or brief dataset analyses beyond the occasional recognition/recall example.",
        "source_5": "I took this alongside a graduate seminar on learning, expecting to use it as a supplemental deep dive, but it leaned toward high-level summaries. My interest dipped after week 4 when several lectures recycled the same examples of flashbulb memories. The film clips did help me look at two movies differently—especially the way unreliable narration was linked to reconstruction—but the lectures themselves didn’t add much beyond what I’d seen in undergrad. I suspect the companion book would have supplied more nuance; on its own, the course didn’t shift my understanding."
    }
}