{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I’ve had this phone for six months and it’s become my daily carry. Typical day: unplug at 7 a.m., tons of messaging and email, maps on a 45‑minute commute, Spotify for a few hours, Instagram/Twitter scattered through the day, and 30–40 minutes of COD Mobile. By 9 p.m. I’m usually sitting at 20–30%. The camera has been a surprise—video from my kid’s school play looked crisp and stable even from the back row. Apps open instantly and I haven’t noticed slowdowns. Topping up from near empty to about half takes roughly 30 minutes, and a full refill lands around an hour and a half, which I just do before bed.",
        "source_2": "Focusing only on charging: my workdays are built around short windows to juice up. On the stock brick, I consistently see about 30 minutes to climb from roughly 10% to 50%, which helps before a meeting. But getting from there to 100% is slow—about 90 minutes—and I rarely have that much uninterrupted time. I’ve twice had to leave for the airport with the phone stuck at 82%, and ended up babysitting it at the gate.",
        "source_3": "Camera-only take: I film a lot of handheld video for marketplace listings and family clips. Indoors under warm lights, skin tones look natural and the footage doesn’t wobble much when I’m walking. Outdoors, it handles backlit scenes without turning faces into silhouettes. Autofocus locks quickly on moving pets, and panning across a street scene keeps detail in signs and textures. For this price range, I didn’t expect video to look this clean right out of the phone.",
        "source_4": "Battery life perspective: I’m not a heavy gamer—mostly calls, WhatsApp, banking apps, and a lot of reading. With brightness around 60% and Wi‑Fi most of the day, I routinely get more than 10 hours of mixed use before needing a cable. On weekends I binge games, and I can run about 4 to 5 hours of continuous play before it dips into the teens. That pattern has stayed consistent across six months.",
        "source_5": "Overall, from a heavy-gaming angle: performance is snappy in titles like Genshin and Apex, and temperatures stay in check, but two long ranked sessions plus Discord voice will pull me from 100% to single digits by late afternoon. Since a complete charge takes roughly 1.5 hours, I often tether to a power bank between scrims. The camera footage looks good for highlight reels, yet on travel days the slow top-off makes me plan around outlets, which gets old fast."
    }
}