{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I’m focusing just on battery here. My routine is 90 minutes of YouTube during my commute, Slack and Gmail all day, about an hour of calls, and Maps for 30–40 minutes. With 5G on and brightness around 60%, I average 6–7 hours of screen time and usually plug in at night with 10–15% left. On days packed with video calls, I need a 20-minute top-up around 6 p.m. Overnight it drops 3–4% on standby. Using a 20W brick, it hits roughly 50% in about half an hour. Compared to my last Android that stretched closer to 8 hours SOT, this lands a bit short but still gets me through most days without anxiety.",
        "source_2": "As an overall take: I moved from Android for the first time and the day-to-day feel caught me off guard—in a good way. Animations are fluid, haptics feel tight, and apps pop open instantly. Airdrop to my iPad is now my default for moving files, and the keyboard accuracy has saved me from a bunch of typos in emails. The camera has been reliable for family clips; stabilization makes even hurried kid videos look intentional. I typically end the day with a few percent to spare after 6-ish hours of mixed use. I paid 62k during a sale and, considering the build, performance, and the ecosystem sync with my work laptop, the buy made sense for me.",
        "source_3": "Strictly camera notes: I shoot a lot of 4K video for work demos, and the footage comes out steady and clean even while walking. Skin tones look consistent, and the microphones pick up voice clearly in busy streets. Indoors under warm lights, faces retain detail without that waxy look I used to get on my previous phone. Still photos are a mixed bag: daylight shots are sharp, but distant leaves and fine textures sometimes smear when you zoom in, and digital zoom softens quickly. If your priority is video, it’s a treat; if you obsess over stills at high zoom, it may leave you wanting.",
        "source_4": "Software and customization only: Coming from Nova Launcher on Android, the rigidity takes getting used to. I can’t place icons exactly where I want, third‑party launchers aren’t really a thing, and changing default apps is limited. I miss being able to set a custom dialer and recorder, and file transfers to non‑Apple devices feel clunky unless I fall back to cloud links. Shortcuts helps a bit, but some automations throw confirmation prompts, which breaks the flow. Even small stuff like ringtone setup feels more involved than it should be.",
        "source_5": "Price perspective: I grabbed the 128 GB variant at 62k. Performance is stellar, but with only a cable in the box I had to buy a charger, and iCloud becomes almost mandatory once photos and videos pile up, so the real cost creeps up. For the same money, Android options in my office offer faster charging and higher refresh displays. I’m sure this will hold up for years and resell well, but strictly on what you unwrap on day one, it didn’t feel like a bargain."
    }
}