{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I used the Westin in Beijing as my base for a week of sightseeing and meetings. Check-in took about five minutes at 9 p.m., and my room faced a quiet side street with blackout curtains that actually blocked the morning light. The nearest metro entrance was about a two-block walk; I timed 22 minutes door-to-door to the Forbidden City with one transfer. After long days out, I ate inside the hotel twice: a bowl of hand-pulled noodles and a beer set me back roughly 85 RMB, and a grilled fish with rice came to about 120 RMB, which felt in line with what I paid in nearby neighborhoods.",
        "source_2": "I booked the Westin mainly for the metro access, and I’m focusing only on that. The station isn’t directly connected; you have to cross two wide intersections and one of the approaches has stairs with no ramp, which made rolling a suitcase awkward. In the evening rush, the platforms were shoulder-to-shoulder, and getting back with shopping bags took longer than expected—about 35 minutes for what was 18 minutes in the morning.",
        "source_3": "My only feedback is about the spa. I reserved a 60‑minute massage at 7 p.m.; the therapist stepped out twice to fetch items, and the actual table time was closer to 50 minutes. The steam room had a maintenance sign, so I was redirected to a dry sauna that wasn’t fully heated yet. At checkout, there was an extra line for aromatherapy I hadn’t requested, which staff removed after I pointed it out.",
        "source_4": "I didn’t stay overnight; I met a colleague at the hotel’s Cantonese spot for lunch because it was convenient to his office. We ordered two dim sum baskets, a clay pot rice, and jasmine tea. There was a weekday set that reduced the total—about 168 RMB for both of us. For a hotel dining room with table service, that bill landed lower than a couple of chain restaurants we use in the nearby mall.",
        "source_5": "Two-night stay for a conference. The lobby looked impressive, but the front desk queue stretched past the bar at 3 p.m., and elevators were packed before and after sessions, so getting to the room sometimes meant waiting through two cars. Housekeeping knocked at 8:30 a.m. despite the do-not-disturb light, and room service rang twice before picking up. The location worked for my meetings, though if I were coming for sightseeing I’d consider a smaller place to avoid the convention traffic."
    }
}