{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I bought it mainly to play Call of Duty, and the battery drops fast when I’m in long sessions. With brightness around 75%, Wi‑Fi and Bluetooth on, and voice chat enabled, it went from 96% to 52% in roughly two hours, and after another 90 minutes I was down near 20%. If I game on my commute and again in the evening, I have to carry a power bank; on light use it stretches further, but shooters chew through it.",
        "source_2": "After two months, the battery has been good enough for my routine. I top it up to 90% in the morning, keep Wi‑Fi and Bluetooth on all day, and play COD during lunch and late afternoon. Four hours of matches takes me to around 30%, which still leaves enough for messages and maps on the way home. Charging overnight and a quick 20‑minute boost before dinner keeps me from worrying.",
        "source_3": "Focusing just on the cameras: the rear shooter is great for landscapes and food—street photos came out sharp, and the display preview matched what I got. The front camera, though, is rough indoors; selfies under restaurant lighting look soft and a bit washed out, and on video calls my face gets blown out near windows. Outdoors at noon it’s fine, but any dim room adds grain.",
        "source_4": "As an overall package, I wouldn’t repeat the purchase at this price. The screen feels cramped for movies and typing, and the front camera struggles in the exact situations I use most (cafes and evening hangouts). Games glide and the display panel itself is crisp, but after paying this much I expected a larger canvas and more consistent selfies out of the box.",
        "source_5": "I was after a compact phone, and this nails that. The display panel is punchy, text is razor‑clear, and COD runs smooth without stutters. Face ID unlocks instantly even when I’m wearing a cap, and I haven’t hit any odd app crashes. For me, the balance of speed, screen quality, and the pocketable size makes the price feel justified.",
        "source_6": "I care mostly about day‑to‑day smoothness: opening big apps, swapping between chat and games, and unlocking on the go. It’s been rock solid—COD loads quickly, frame pacing stays steady during firefights, and touch input feels immediate. Face ID has worked every single time, including in dim trains and bright sun, and I haven’t run into any glitches so far."
    }
}