{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I ordered an iPhone 13 on Amazon during the Republic Day sale and got it in two days. The box was sealed, the IMEI matched the invoice, and setup from my old iPhone 8 went smoothly. I’ve been using it for work calls, Maps, and a lot of Instagram. A 25-minute walk recording 4K video followed by scrolling Reels didn’t cause any hiccups—battery went from 92% to 82% and the back felt only mildly warm through the Apple silicone case. Shots from a dim café looked clean enough for my blog, and the delivery/returns section in my account showed the full return window without any seller restrictions, which reassured me about the purchase.",
        "source_2": "Focusing only on the camera: my iPhone 13 (purchased in May) gives soft-looking photos. In bright daylight, grass and brick textures smear when I zoom in even 2x in the Photos app. Indoors under tube lights, faces take on a watercolor look and the autofocus hunts for a second, so people move and I get slight motion blur. I cleaned the lens, reset camera settings, and even compared the same shot with my friend’s iPhone 11—hers showed crisper edges on hair strands. Night mode often stretches exposure and amplifies hand shake, so I’ve stopped using it for low‑light get‑togethers.",
        "source_3": "Only commenting on heat: I can get the phone warm within 8–10 minutes just by scrolling Instagram Reels and switching between Stories and the camera. The top-right near the lenses gets hot enough that I shift my grip, and battery drops around 5–6% in ten minutes. This is in an AC room at 24°C with a thin Spigen case. Fifteen minutes of BGMI leads to a noticeable dip in frame rate, and opening the camera right after causes stutter in the viewfinder for a few seconds.",
        "source_4": "My experience with customer support was straightforward. The first unit had a faint bright spot on the display. I contacted Amazon chat at 9:40 pm, uploaded photos of the issue, and they booked a doorstep pickup for the next evening. The replacement arrived 36 hours after pickup, factory-sealed, with the IMEI updated on the invoice automatically. I didn’t have to visit a service center or argue about diagnostics; the return window handled it end to end.",
        "source_5": "On the buying platform itself: I chose an Apple-authorized seller during Prime Day. Packaging was tight with a tamper-evident seal, and the invoice had GST details. The Apple Support app showed the warranty starting from activation, not an earlier date. I paid Rs. 60,499 after a card offer, checked the serial on Apple’s site, and the device showed as new with standard coverage. No signs of open-box or refurbished stock, which matters to me when ordering electronics online.",
        "source_6": "Zeroing in on the camera again, but my experience differs: I run a small food page and shoot mostly handheld. The iPhone 13’s sensor-shift stabilization lets me get sharp shots at evening markets around 1/15–1/20s if I brace my elbows. Portrait mode keeps utensils and table edges well separated from the background, and Skin tones look consistent under warm café lighting. I also record 4K30 clips while walking; stabilization keeps signage readable. I clean the lens before shooting and tap to focus—unless the subject is moving, I don’t see the smear others mention."
    }
}