{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I enrolled for the study strategies but focused mainly on the weekly quizzes, and they didn’t land for me. Most items were recognition-based multiple choice, and after two attempts I was just remembering the placement of options instead of recalling the ideas. The Week 2 quiz repeated the same definition three different ways, and the “retry until you pass” setup meant I advanced without ever feeling challenged. If the point was to model retrieval practice, these assessments felt like checkboxes rather than actual practice.",
        "source_2": "I signed up purely to learn how to build better flashcards, and that part delivered. I took the examples from the lesson and created a small Anki deck with cloze deletions for chemistry mechanisms, splitting each reaction into three prompts. Two weeks in, I could run through 30 cards during my bus ride, and the spacing schedule kept me from cramming. The guidance on avoiding “kitchen-sink” cards and writing one-idea prompts made my deck manageable.",
        "source_3": "As a working parent with limited time, I watched one or two short videos each night and finished in three weeks. The breakdown of focused vs. diffuse thinking and the section on illusions of competence changed how I review: I now rotate topics and close my notes to test myself at the end of a session. Using 25-minute timers and interleaving topics cut down my evening burnout, and I’ve already noticed smoother handoffs during my weekly team briefings.",
        "source_4": "I went through every module and quiz and kept waiting for the deeper dive that never came. Much of it echoed what I saw in an intro psych course—broad metaphors, light anecdotes, and high-level tips—with interviews that felt like padding between concepts. I would have liked more references to actual papers and a clearer bridge from the catchy stories to rigorous technique, especially around memory claims.",
        "source_5": "Zeroing in on delivery: the video pacing was slow, with long pauses and looping stock animations that drew my attention away from the narration. I had to keep the playback at 1.5x to stay engaged. The captions on the mobile app occasionally lagged a line behind, and twice the app auto-advanced before I finished reading, which made note-taking awkward on my commute.",
        "source_6": "I took the course mainly for the quizzes and actually found them useful once I changed how I approached them. I’d watch a video, close the tab, and try the quiz cold without notes; missing an item forced me to restate the idea out loud and write a one-sentence summary before retrying. The end-of-week cumulative quizzes stitched concepts together—like mixing spacing, interleaving, and chunking in one set—which helped the material stick more than the videos alone."
    }
}