{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I took the full Global Health program over two weekends, and it felt thoughtfully sequenced from basic epidemiology into systems thinking and policy trade‑offs. The interviews with practitioners from Kenya and Brazil gave the lectures some lived context, and the vaccine rollout case study in Week 3 tied the threads together. Pacing was steady enough that I could pause and take notes without falling behind, and the reflection prompts nudged me to connect the material to my local clinic. I finished feeling grateful to the team and already set a reminder for the next part.",
        "source_2": "Focusing only on presentation quality: on my 13‑inch laptop, several slides packed tiny text and footnotes that were hard to read, and the grey-on-grey palette in Week 2 made charts blend into the background. The audio swings from soft to clipped between segments, especially when switching instructors, and there’s a faint hiss in the interview clips. A couple of animations stuttered in the health systems lecture, so arrows didn’t align with the boxes. Captions were missing for two videos in Week 4 when I watched, which made it tough to follow during a noisy commute.",
        "source_3": "As an overall take, I finished the program but kept waiting for it to move beyond surface coverage. Week 2 and Week 4 rehashed the same social determinants framework with slightly different graphics, and the discussion boards were mostly unanswered prompts. Assignments leaned toward short reflections rather than applied tasks, so I never had to build a needs assessment or budget scenario. For something labeled interdisciplinary, there wasn’t much integration across methods; it felt more like a sampler platter than a deep dive.",
        "source_4": "Zeroing in on assessments: the quizzes often used murky phrasing like “least likely” and “except,” which tripped me up even when I understood the concept. The peer‑graded task had a rubric line that said “addresses equity considerations,” but didn’t specify what counted as sufficient evidence, so feedback varied wildly. I had to resubmit after one reviewer docked points for not including citations even though that wasn’t in the instructions. Also, the deadline timer seemed to default to Pacific time without a clear note, and I missed a cutoff by an hour.",
        "source_5": "Strictly about how the material is presented: the instructors layer clean diagrams over case photos so you can see pathways from clinic to ministry decisions in one view. Colors are high‑contrast and consistent across weeks, figure numbers match the references, and every chart comes with a one‑sentence takeaway beneath it. Voiceovers are steady and paced like a radio segment, so it’s easy to jot down the key term before the next point arrives. The transcripts are downloadable and searchable, which helped me jump back to the section on financing flows."
    }
}