{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "Battery-only: I start at 6:30 a.m. with 100% and end around midnight without plugging in. Typical day is 45 minutes of Spotify over Bluetooth on the commute, an hour of YouTube during lunch on 5G, 30 minutes of Maps with GPS, and about 2 hours of MLBB in the evening on Wi‑Fi at 70% brightness. After seven days of this routine, I’m consistently finishing with 30–40% left, and the overnight drop is about 3–4%. I’ve switched to charging every other morning.",
        "source_2": "As a daily driver, it’s been rock-solid for me. PUBG and Apex at the “HD/High” preset hold steady over 90-minute sessions, and I don’t notice stutters or touch latency. I binged two episodes on Prime and one on Hotstar; despite not being AMOLED, the picture looks fine and the audio sync is tight. The plastic back actually feels lighter and less slippery than my old glass phone, and the rear camera covered my weekend city trip just fine. Selfies in daylight are perfectly usable for me, and the battery gets me through long shifts.",
        "source_3": "Front camera-only: If you rely on the selfie cam, take note. Indoors under warm LEDs, facial details get smoothed out so much that beard stubble looks like a blur. On Zoom at arm’s length, focus breathes in and out, and as soon as the room gets dim, noise crawls across the image. Instagram Stories tend to blow out windows behind me, and skin tones lean oddly pink. I end up using the rear cam with a mirror when I care about quality.",
        "source_4": "Screen-only: I came from a Super AMOLED device and expected to miss the deep blacks. After a week, with Vivid mode on and brightness around 80%, Netflix and Prime look crisp, subtitles stay razor-sharp, and outdoor visibility at noon is readable without cupping the screen. In a dark room the blacks are more gray, sure, but touch response in MLBB is snappy and there’s no weird color shift at angles. For reading and bingeing, it’s been perfectly fine.",
        "source_5": "After a week as my main phone, I boxed it up. The back panel has that painted-plastic look and even gives a tiny creak near the SIM tray when pressed. Watching movies in bed, dark scenes turn muddy because the blacks sit gray, and the selfie camera makes indoor shots look soft and pasty. It tears through Apex and battery easily covers a full day, but the feel in hand and the media experience didn’t click for me, so I went back to my older device.",
        "source_6": "Back camera-only: Took it on a zoo trip and shot everything with the rear cam. Daylight photos at 1x and 2x hold detail—fur texture and text on signs remain legible when cropped. Portrait mode did a neat job around glasses and flyaway hair. At night under street lamps, shots are usable if I brace for the second-long exposure. I printed two 8x10s from the set, and they look clean on paper."
    }
}