{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I enrolled in Finance for Non‑Finance: MBA Insights with a marketing background and, by week two, I was reading balance sheets, building a simple NPV model in Excel, and finally understood why depreciation affects cash but not profit. The instructor ties ideas to everyday examples—grocery inventory, gym memberships—and the coffee cart case made the numbers feel concrete. I spread it over three evenings per week and stayed on track with the weekly rhythm. The forum mentors chimed in within a day, and I finished feeling ready to ask sharper questions in our next budget review.",
        "source_2": "Focusing only on difficulty: the curve jumps early. The first quiz mixes WACC, DCF, and payback period in the same timed block, and several questions assume formulas that haven’t been derived yet. A few problems layer taxes and salvage value without a worked example, so I paused every minute to rebuild the cash‑flow timeline from scratch. If you don’t already speak the vocabulary, the challenge level can crowd out comprehension.",
        "source_3": "Only about the instructor: he keeps a steady rhythm, sketches cash‑flow timelines by hand, and revisits definitions like margin vs. markup until they stick. I appreciated the two‑minute recap at the end of each lesson with a single takeaway to remember. I took his other class last year, and the same habit of using simple analogies—like comparing discount rates to choosing between a savings account and a store coupon—made a stubborn concept click for me.",
        "source_4": "I completed the full course but felt the modules skimmed topics and moved on before real practice happened. Ratios and capital budgeting show up, then the graded work leans on multiple choice with careful wording rather than building an actual spreadsheet. The final project is a short reflection instead of a model, so I went hunting for outside exercises to get hands‑on. The certificate was easy to earn, but I wanted more structured drills and feedback to cement the methods.",
        "source_5": "Only on production quality: several videos jump in volume within the same lecture, the auto‑captions miss finance terms (I saw “cost of capital” become “castle capital” more than once), and a few slides use fonts so small they blur on a laptop. On the Coursera mobile app, playback speed kept resetting between clips, and one quiz wouldn’t render the embedded charts, which turned a calculation item into guesswork."
    }
}