{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I’ve used the Lenovo phone for a month and it keeps acting up as a daily driver. Instagram and Gmail freeze on scroll, and I end up going to Settings > Apps > Force stop several times a day just to get notifications flowing again. Overnight I see 12–18% battery drop on airplane mode, and twice it warmed up sitting idle on the desk. I tried clearing cache partitions and even a factory reset; the first two days seem fine, then the stalls creep back. I raised a return with Flipkart, got a call back, and then the ticket was closed as “meets policy” because it was past the 7‑day window, so I’m stuck taking it to a service center.",
        "source_2": "Focusing only on battery life: I charge to 100% at night, and with two SIMs and Wi‑Fi on, I’m finishing the second day with around 20–25% left. My usage is mostly WhatsApp, an hour of YouTube, and calls; screen‑on time sits around 6.5–7 hours per full cycle. Standby drain overnight is 2–3%. Using the bundled 18W charger, it goes from 15% to full in about 95 minutes. For long commutes, I don’t carry a power bank anymore.",
        "source_3": "My take on the software/app side: I installed banking apps (SBI YONO, GPay), ride apps (Ola, Uber), and heavier ones like Lightroom and Canva. App launches are quick, and I can jump between YouTube in picture‑in‑picture and Chrome without reloads. The phone keeps 3–4 apps in memory with around 2–3 GB free (6 GB RAM model). No random force stops so far; even after a 45‑minute Maps session, coming back to Instagram doesn’t trigger a refresh.",
        "source_4": "On the buying platform experience: I ordered during a sale and the first unit had a faint dead pixel. Raised a return the same evening; a Flipkart technician visit was scheduled for the next day, he verified the issue and approved it on the spot. Pickup happened on day three and the replacement arrived on day four. No back‑and‑forth or rejection messages—pretty straightforward.",
        "source_5": "Overall value after two weeks: I paid 10,999 during a weekend offer for the 6/128 variant. The 90 Hz display makes scrolling look crisp, the build feels sturdy with no creaks, and there’s enough storage for my offline playlists and photos. The main camera is decent in daylight and just okay indoors; the single speaker is loud enough for podcasts. For this price bracket, it covers the basics well without making me juggle what to delete or which app to avoid."
    }
}