{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I bought this mainly for long days on the road, and the battery surprised me. With 120 Hz on, dual SIM on 5G, and auto-brightness around 60%, I stream Spotify for 2 hours, take about an hour of calls, snap a few dozen photos, and do constant WhatsApp. I leave home at 7 a.m. and usually plug in around 10 p.m. with 20–30% still left. Screen-on time averages 6.5–7 hours. The 30W brick tops it up from 15% to 80% while I eat dinner. Even Google Maps for a 90‑minute drive didn’t nuke it the way my last phone did.",
        "source_2": "Picked it up during a festival sale for 28,999 with a bank offer, and it felt like a well-rounded package. The size is easy on my hands, the curved back doesn’t dig into my palm, and one-handed reach is manageable. I moved from a 60 Hz screen and the smoother scrolling is noticeable. Apps open quickly, switching between Instagram, Gmail, and a PDF in Drive doesn’t force reloads, and the camera yields clean daylight shots for my kid’s school events. Face unlock is instant and the fingerprint reader hasn’t failed me yet. For what I paid, I didn’t feel shortchanged.",
        "source_3": "I care most about the camera, and this one hasn’t worked out. On a weekend hike, the sky kept blowing out while the trees turned muddy; HDR seems overzealous. Indoors at my café, focusing hunts for a second and I end up with soft faces. Portrait mode loves to erase strands of hair, and low light night shots smear details unless I stand perfectly still. Video stabilization introduces that jelly wobble when I pan, and the mic picks up wind too easily. I carry a compact camera now when I know I’ll want usable photos, which defeats the point.",
        "source_4": "Paid full retail at 39,999 a couple of weeks ago, and I expected more polish. After the first few days, the battery started dropping 10% per hour with light use—mostly email and Slack, no gaming. Using Maps for a 45‑minute ride with screen at 80% and music over Bluetooth took me from 72% to 48%. No charger in the box, so that was another expense. The phone warms up near the camera bump while navigating, and I’ve had to dial the refresh rate down to get through a workday. For this price, I was hoping to forget about battery anxiety, but I carry a power bank again.",
        "source_5": "The design looked great online, but in hand the flat edges bite after 20 minutes of typing. The glass back is slick; twice it slid off my couch armrest onto the rug. Without a case it’s a fingerprint magnet, and with a case it becomes just bulky enough that reaching the top corners is a stretch. The camera ring also catches lint in my pocket. I like slim phones, but this one’s width makes one‑handed swiping awkward on the metro, and the weight sits top‑heavy so it tips when I prop it against a cup at my desk for video calls.",
        "source_6": "Performance and navigation have been smooth for me. I run Telegram, Outlook, Sheets, and Spotify all day, jump into Chrome with 12 tabs, and it doesn’t reload apps when I bounce back. Genshin Impact at medium stays around a steady frame rate for 30–40 minutes without stutter. GPS lock happens within a couple of seconds, and rerouting in Google Maps is instant when I miss an exit. After turning off a couple of animations and uninstalling the bloat that came preloaded, the UI feels snappy, and I haven’t seen the keyboard lag that plagued my old device."
    }
}