{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I bought this mainly for its battery endurance, but my unit behaves oddly: after a full charge, I unlock the screen and watch the percentage tick down almost every minute while scrolling through messages. During a 10‑minute news read over Wi‑Fi, it went from 66% to 65% and then to 63% before I even opened any heavy apps. Overnight idle (airplane mode on, Bluetooth off) still drops around 12–15%. I tried wiping cache, disabling auto‑sync, and turning off Always‑On Display; the drain pattern barely changes.",
        "source_2": "Using it as my daily driver for three weeks, the overall experience stands out. The screen is fluid at 120 Hz, calls are clear on both VoLTE and Wi‑Fi calling, and the speakers handle podcasts on my commute without distortion. I average about 4.5–5 hours of screen‑on time between email, Slack, Instagram, and maps, and I typically plug in at midnight with around 25% left. No random reboots, no stutters, and the camera switches lenses quickly when I zoom.",
        "source_3": "Focusing on the battery alone: after the most recent software patch, standby performance improved noticeably on my device. I left it on my desk from midnight to 7 a.m. with Wi‑Fi and notifications on; it dropped just 2%. On a mixed day—YouTube (1.5h), Maps navigation (45 min), and Reddit—AccuBattery reports 6.5–7 hours of screen‑on time. In light use, the percentage moves roughly 1% every 4–5 minutes instead of every minute, and there are no sudden dips when unlocking.",
        "source_4": "As a whole package, this feels compromised for me because of power behavior. A typical workday starts at 8 a.m. with 100%, and by lunch it’s hovering around the mid‑50s with only light messaging and a few photos. On a 20‑minute bus ride with the screen off and music playing over Bluetooth, I’ve seen a 6–8% drop. I carry a power bank to make it through evening meetings. Performance, display, and camera are fine, but the constant top‑ups define the experience.",
        "source_5": "Zeroing in on charging and thermals: the bundled brick takes it from 20% to 80% in about 38–40 minutes, which is handy before heading out. However, after reaching 100%, it tends to sit at 100 for a minute, then fall to 97–98% just from unlocking and checking emails, even with brightness at 30%. The phone also warms up near the camera bump during charging and the first few minutes of gaming, after which the temperature settles and the drain slows."
    }
}