{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "Picked this up for ₹12,999 and after a week I started noticing quirks: during a 20–25 minute WhatsApp video call the top-left near the camera gets toasty, battery can drop from 78% to around 60% on a short walk while streaming Spotify, and at night the screen looks so faint that I have to tilt the phone to catch the letters on the keyboard. Indoor shots of my kids come out smeared, so I’ve ended up using my old point-and-shoot for birthdays.",
        "source_2": "Battery-only note: my usage is two email accounts syncing, Bluetooth on all day for a smartwatch, 90 Hz enabled, about 1 hour YouTube, 30 minutes Maps, and lots of messaging. I leave at 7:30 a.m. and get home around 10 p.m. with 22–30% left, usually 7–8 hours of screen time. Overnight drain is 1–2% in airplane mode, 3–4% with data on. No tweaks beyond disabling a couple of preinstalled apps.",
        "source_3": "Camera-only impression: outdoors this shooter does well for me—leaf textures in the garden are crisp, sky isn’t blown out at noon, and 2x digital zoom is usable for my dog’s portraits. Indoors it softens, but Night mode pulls back enough detail for dinner-table pics without everything turning orange. 1080p clips while walking are steady enough to post without edits, and the mic picks up voices clearly over traffic.",
        "source_4": "The display at night is my headache. Even with adaptive brightness off and the slider maxed, texting in a dark room looks dim, like there’s a gray film over the panel. The keyboard blends into the background and I miss taps. Extra brightness and reading mode don’t help much, so I installed a third-party app to nudge gamma or I can’t comfortably read threads before bed.",
        "source_5": "Thermal note: 25 minutes of Genshin Impact pushes the back near the camera ring past 44°C (read via CPU-Z), and the frame rate stutters as it warms. Using Google Maps on the dashboard while charging for just 10–12 minutes makes the phone hot enough that I pop off the case. Browsing and chats are fine, but gaming or navigation plus charging turns it into a hand warmer.",
        "source_6": "As a daily driver it’s been smooth for me: dual SIM (Jio + Airtel), lots of Slack/Teams, two hours of calls most days, and some Netflix on the commute. No heat spikes on long calls, the screen is easy on the eyes in the car at night, and the camera covers school events without fuss. I plug in every evening and don’t think about battery during the workday."
    }
}