{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I bought the 6GB/128GB variant three weeks ago mainly for long trips. With just light use—WhatsApp, two short calls, and reading news for 30 minutes—the battery drops from 100% at 8 a.m. to around 30% by 7 p.m. Overnight idle (Wi‑Fi on, SIM inserted) still loses 10–12%. I’ve started carrying a 10,000 mAh power bank because it rarely makes it through a full day for me.",
        "source_2": "Focusing only on performance: after installing my usual 45 apps, the launcher takes a second to redraw when returning to home. Scrolling through Twitter stutters, switching between Google Maps and Spotify causes a brief freeze, and the camera app takes about two seconds to open on first launch. Even with Performance mode enabled and animations reduced to 0.5x, the UI never feels consistently smooth during multitasking.",
        "source_3": "I care mostly about the camera, and this one surprised me in a good way. I shot a birthday party in low light; Night mode pulled out clean detail with accurate skin tones and minimal grain. 4K 30 fps clips look steady thanks to EIS, and portraits separate hair strands without the usual halo. Compared with my friend’s Redmi Note model, indoor shots avoided the yellow cast, and I could post to Instagram without heavy edits.",
        "source_4": "As an overall package, this has worked well for me over a month. Calls are clear, GPS locks quickly on morning runs, and the display is readable under noon sun. The battery easily covers two days with email, banking, and an hour of YouTube daily, and I haven’t noticed hiccups jumping between apps. The earbuds worth 2k and the Rs 1000 bank offer applied at checkout, and the seller delivered the next day.",
        "source_5": "My experience is only about the deal and service: I ordered during the festival sale for the bank cashback and bundled earbuds. The parcel arrived without the earbuds, and the cashback never posted even after two billing cycles; support said my UPI payment didn’t qualify, which wasn’t stated clearly. Return pickup took three attempts, with two cancellations from the courier. I wouldn’t count on the promotional terms being honored.",
        "source_6": "Taking the phone as a whole, it hasn’t fit my routine. It feels heavier than expected, the display shifts toward blue at slight angles, and the camera often misses focus on moving subjects indoors. The battery gets me through a workday but not beyond, and topping up from 20% to 100% takes roughly two hours with the included charger. If I were buying again, I’d choose a different model."
    }
}