{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I only care about battery life, and this one holds up for my routine. I unplug at 7:00 a.m., stream around 2.5 hours of YouTube, scroll socials for another 2 hours, 45 minutes of calls, plus 30 minutes of Google Maps with Bluetooth on. By 11:00 p.m. I’m usually at 25–35%. On a light day with mostly Wi‑Fi, it stretches into the next evening. Gaming (BGMI ~60–75 minutes) pushes it closer to 15% at night. The 80W brick takes me from 10% to full in about 35 minutes, with the first half done in roughly 12 minutes; it gets a little warm near the camera bump but not uncomfortable. Overnight standby drops around 2–3% with 5G off.",
        "source_2": "Focusing just on the camera: outdoors at noon, landscapes come out crisp and you can read distant signage without zooming in. Faces look fine in shade, but highlights blow out when the sun is behind the subject. Indoors under warm lights (living room, around 7 p.m.), the shutter hesitates and my toddler ends up blurred unless I switch to burst. Night mode brightens the scene but smears skin texture if you zoom; streetlights have a glow around them. Video at 4K30 looks sharp when standing still, but walking introduces noticeable wobble; 1080p with stabilization crops in and sometimes hunts focus when panning from a person to a window.",
        "source_3": "Storage-only take: I bought the 128 GB variant and after the initial setup plus system updates, I had about 105 GB free. I migrated roughly 12 GB of photos and videos via cable in about 10 minutes. Installed my usual set—Instagram, WhatsApp, Spotify with 6 GB of offline playlists, and a couple of games—and still have over 80 GB remaining. Large app installs don’t hang, and extracting a 1.5 GB file in the file manager finished in under a minute. No “storage full” warnings yet even after a week of 4K clips.",
        "source_4": "After two weeks as my primary phone, it feels like a balanced package for the price. The frame is slim and easy to grip, and I don’t mind using it without a case. I typically keep 8–9 apps in memory (Chrome with multiple tabs, Instagram, WhatsApp, Maps, Spotify, Photos), and switching between them is smooth without reloads. Battery gets me through a full workday plus the commute; the included 80W charger is handy for a quick top-up before heading out. Daytime photos are social-ready, and storage hasn’t been a concern. For someone shopping under 20k, it checks the everyday boxes.",
        "source_5": "Broader take after a month: it looks neat on the desk and the fast charger is convenient, but day-to-day use feels inconsistent. Typing in Gboard stutters when a few apps are in the background, and Instagram drops frames while recording a Reel. Google Maps sometimes redraws slowly when hopping between it and music controls. Indoors, the camera softens faces and takes an extra beat to focus; moving subjects are hit-or-miss. With 5G on and brightness at around 70%, I’m down from 100% to the low 30s by early evening, and I’ve seen 8–10% disappear overnight. The charger occasionally heats up and after two weeks I’m seeing 50–100% take longer than on day one."
    }
}