{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I’m focusing on battery endurance here. Starting at 100% at 7:30 a.m., I’m usually down to around 35% by 3 p.m. with light use (WhatsApp, Gmail, a few calls, brightness on auto). Screen-on time hovers near 4 hours, and I see about 10–12% drop overnight even in airplane mode. I’ve toggled battery saver and limited background apps, but the percentage still dips faster than I expect during basic texting and browsing.",
        "source_2": "Strictly about charging speed: with the included brick, I timed 0% to full at 29 minutes using a stopwatch, and a quick 10-minute plug adds roughly 40%. The phone gets a bit warm but never uncomfortably hot. This has been consistent over a week of daily top-ups, and I like that a short coffee break is enough to refill before heading out.",
        "source_3": "I’m only evaluating the camera. Night mode keeps street signs readable and faces clear under yellow street lamps, and the shutter doesn’t lag when I snap multiple shots in a row. I also tried Ultra Sound mode while recording a friend playing guitar near traffic; it toned down the background rumble and kept voices understandable. Focus locks quickly on moving subjects, and indoor photos look clean without excessive smearing.",
        "source_4": "As an everyday phone, it feels fluid: the keyboard keeps up with fast typing, and switching between Instagram, Maps, and Spotify is immediate with no jitter while scrolling long threads. Night photos are perfectly usable for social posts, and the Ultra Sound option in video makes voice notes clearer outdoors. The charge shoots back to full in about half an hour, which makes quick pit stops easy. I do notice the percentage sliding faster on 5G days, but the refill speed means I don’t plan around it much.",
        "source_5": "After two weeks, my take on the whole package is mixed. The interface glides through chats and emails, and the camera’s night shots look surprisingly clean for city walks. However, my routine (9 a.m. to 7 p.m., constant messaging and maps) has me hunting for an outlet before the commute home. The rapid top-up is convenient, but the mid-day dip means I carry a power bank on longer meetings and travel days, which undercuts the convenience I wanted in a daily driver."
    }
}