{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I timed three full charges with the bundled 65W brick and cable: 12% to 100% took 39 minutes, 7% to 100% took 41 minutes, and 15% to 100% took 38 minutes. The phone warmed up near the camera ring but never felt hot. Brightness stayed on auto, Wi-Fi and 5G were on, and I didn’t use airplane mode. A 15-minute top-up adds roughly 45-50%, which has been enough for me to get through the evening commute.",
        "source_2": "After two weeks, I’m happy using it as my daily driver. The frame feels slim in hand and the matte back looks tidy on a desk. Apps open without hesitation, and bouncing between Spotify, Maps, and Chrome is snappy. Genshin Impact holds around 50-60 fps on medium. Daylight photos look crisp and battery easily lasts a workday; the 5000 mAh pack gets me from 7 a.m. to 11 p.m. with 6-7 hours of screen time. The only head-scratcher is charging: from 5% to full takes about 58-65 minutes with the 65W charger, which is longer than I expected from the spec sheet.",
        "source_3": "I only care about the camera. Outdoors at noon the shots are fine, but indoor scenes give faces a waxy look and textures like fabric lose detail. In dim restaurants the autofocus hunts and the shutter hesitates, so moving subjects blur. Night mode brightens the frame but adds speckled noise in dark corners. Shooting 4K while walking shows micro-jitter, and exposure pulses under streetlights when I pan.",
        "source_4": "I bought this mainly for speed. It feels quick on day one, but after installing around 80 apps I notice hiccups pulling down the notification shade and switching from the camera to messages. Asphalt 9 starts at 60 fps and drops into the low 40s after 15-20 minutes; the top area gets warm and frame rates dip. Face unlock occasionally sits for a second before the home screen appears.",
        "source_5": "Design-wise, the glossy back picks up fingerprints within minutes and is slippery without a case. The camera bump is tall enough that the phone rocks while typing on a table. The top bezel looks thicker than the bottom, and the chin stands out compared to my older device. The blue color in person is more muted than the marketing photos."
    }
}