{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "मैंने इस फोन को फ्रंट कैमरे के लिए लिया था, पर दो हफ्ते के इस्तेमाल में पता चला कि ट्यूब लाइट या ऑफिस की पीली रोशनी में चेहरा ज्यादा स्मूद और फीका दिखता है; पोर्ट्रेट मोड बालों के किनारों को साफ अलग नहीं कर पाता; सामने से आती धूप में भी एक्सपोज़र ऊपर-नीचे होता है, जिससे स्टोरी और वीडियो कॉल में ब्राइटनेस अचानक बदलती हुई दिखती है।",
        "source_2": "रियर कैमरे पर फोकस करके बोलूँ तो दिन में पार्क में ली गई तस्वीरों में पत्तों की बारीक नसें और ईंटों की बनावट साफ आई; ऑटोफोकस चलते बच्चों पर भी तेजी से लॉक करता है, 10 में से 7 शॉट्स शार्प निकलते हैं; शाम को स्ट्रीटलाइट के नीचे नाइट मोड से दुकान के बोर्ड के छोटे अक्षर भी पढ़े जा सके, और डॉक्यूमेंट स्कैन करते समय किनारे सीधे पहचानकर क्रॉप हो जाते हैं।",
        "source_3": "हीटिंग को लेकर मेरी चिंता बेकार निकली—मैं रोज़ लगभग 1 घंटे की Teams कॉल के बाद 30–40 मिनट YouTube 1080p देखता हूँ, कमरे का तापमान करीब 30°C रहता है और फोन कवर के साथ भी सिर्फ हल्का गुनगुना महसूस होता है; थ्रॉटलिंग से फ्रेम ड्रॉप नहीं दिखे और बैटरी करीब 15–18% तक ही घटी।",
        "source_4": "कुल मिलाकर रोज़मर्रा के काम—पेमेंट, सोशल ऐप्स, कॉल—बिना अटक चल जाते हैं, पर लगातार लगभग 45–50 मिनट BGMI खेलने पर कैमरा मॉड्यूल के पास गर्मी साफ महसूस होती है और चार्ज भी जल्दी गिरता है; इनडोर में रियर कैमरा सॉफ्ट आउटपुट देता है जबकि फ्रंट कैमरा से वीडियो कॉल साफ दिखती हैं, इसलिए बाहर फोटो खींचने से पहले दो बार सोचना पड़ता है।",
        "source_5": "मैं कंटेंट रिकॉर्डिंग के लिए फ्रंट कैमरा ही यूज़ करता हूँ—दोपहर की धूप में स्किन टोन नैचुरल रहती है, HDR में पीछे का आसमान जला हुआ नहीं दिखता और 1080p पर इलेक्ट्रॉनिक स्टेबलाइज़ेशन चलते-फिरते क्लिप्स को संभाल लेता है; फेस अनलॉक भी कम रोशनी में तुरंत काम कर जाता है, जिससे ट्राइपॉड सेटअप के दौरान बार-बार पिन डालने की जरूरत नहीं पड़ती।",
        "source_6": "पूरे डिवाइस पर राय दूँ तो सेटअप के बाद से ऐप स्विचिंग फुर्तीली लगती है, एक घंटे की Netflix स्ट्रीमिंग और आधे घंटे की ब्राउज़िंग के बाद भी बैक पैनल बस हल्का गर्म रहता है; आउटडोर में रियर कैमरा रंगों को ज्यादा उभारने के बिना संतुलित दिखाता है और क्लोज़-अप में टेक्सचर ठीक पकड़ता है, इसलिए छुट्टी की ट्रिप पर अलग कैमरा ले जाने की जरूरत नहीं लगी।"
    }
}