{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I enrolled for the “21-point editing checklist” and ended up using it every session. I printed the PDF, pinned it above my desk, and ran through items like “cut filter words” and “replace vague verbs” on a 3,200‑word chapter. Step 7 alone (hunting for “just,” “that,” and “really”) trimmed 280 words without losing meaning. The before/after samples in Module 3 made it easy to see what each step looked like on the page, so I could copy the approach in my own manuscript.",
        "source_2": "As someone who’s already taken a few craft classes, this felt like a skim. Most lectures rephrased advice I’ve seen in free blog posts—tighten prose, watch adverbs, vary sentence length—without digging into tricky decisions like balancing line edits with developmental changes. I wrapped it up over a weekend and didn’t walk away with techniques I hadn’t already tried.",
        "source_3": "I joined mainly for the peer‑review assignments, and that’s where it fell short for me. I submitted my first chapter and got three reviews: two were one‑line comments like “nice pacing,” and the third was a checklist with every box marked but no examples. Turnaround took nine days, which missed the suggested revision window for the next module. I spent more time giving detailed feedback to others than I received in return.",
        "source_4": "I came back to writing after a long break, and this course gave me a routine I could actually follow. The weekly prompts nudged me to tackle one pass at a time—dialogue tags in Week 2, clutter in Week 3, rhythm in Week 4—and by the end I’d cleaned up a 5,000‑word short story. The instructor’s short case studies (original vs. revised paragraphs) helped me see what to aim for when I opened my draft.",
        "source_5": "I focused on the delivery: videos run 6–8 minutes, mostly bullet slides with the instructor talking through each point. Captions were accurate, and the transcripts were formatted cleanly enough that I often read them on my phone during my commute. The downloadable summaries matched the slides, so I could skim the steps quickly without rewatching, though the visuals were pretty bare bones."
    }
}