{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I mainly bought this to record travel vlogs, and the stock camera app only gives me up to 1080p at 60 fps. I tried clearing cache and even reinstalling the app, but no 4K toggle shows up. Indoors, faces look smeary and the autofocus pumps when I walk toward the lens. Panning introduces micro‑jitters that are obvious when I cast the clip to my 55-inch TV. The audio also clips in street scenes, so my quick walk‑and‑talks take multiple takes.",
        "source_2": "I’m focused on still photos, not video. In bright daylight, the 108MP sensor bins to 12MP and produces crisp leaf textures and brick patterns that I can crop into without them falling apart. Portrait shots at about 2x keep hair strands separated and skin tones look natural without that waxy look. Coming from a Nokia 6.1 Plus, I’m seeing better detail in backlit scenes and cleaner shadows at ISO 800; night mode handheld at around 1/10s is usable for prints.",
        "source_3": "As a daily driver, it’s been solid for me overall. The 120 Hz screen feels smooth scrolling through Reddit, the chipset keeps Genshin running around 45 minutes before I notice any warmth, and I finish most days with roughly 25–35% battery left after Slack, Spotify, and Maps. The cameras are fine for quick Stories and document scans. With the festival discount I paid, the whole package feels like a good value for my use.",
        "source_4": "I specifically tested video because I film my kid’s soccer games. On my unit, the stock app offers 4K at 30 and 60 fps in good light, and VLC shows 3840×2160 at 59.94 fps with HEVC around 50–55 Mbps. Motion looks clean on a 27-inch 4K monitor, and rolling shutter is controlled during sideline pans. “Ultra Steady” locks things down well, though it crops quite a bit. So the 1080p cap some people mention doesn’t match what I’m seeing.",
        "source_5": "After two weeks on a road trip, I ended up returning it because the camera kept coming up short. Landscapes look fine on the phone screen, but at 100% on my laptop, grass turns into watercolor and edges smear. Indoors at a café, the video hunted focus during slow pans, and the 1080p files fell apart when I tried to grade them in DaVinci Resolve for YouTube. My older Pixel 3a gives steadier clips with less fuss, so I went back to that."
    }
}