{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "After two weeks with the OnePlus, I’m impressed as a daily driver. I restored from my Pixel 5, loaded 70+ apps, and kept the display locked at 120 Hz. Jumping between Slack, Chrome (about 20 tabs), and Lightroom Mobile stayed fluid, and Genshin Impact on medium at 60 fps ran without hitches during a 40‑minute session. The back got mildly warm near the camera island but never bothered my grip. Starting at 7 a.m., I usually end around 11 p.m. with roughly 20–25% left. A 30‑minute top‑up with the inbox charger takes me from about 18% to just under 80%. The main camera pulls crisp detail in daylight with consistent HDR, and the speakers are punchy enough to watch a full movie without reaching for earbuds.",
        "source_2": "I bought this mainly for the “108MP” promise, and the rear camera hasn’t matched my expectations. In the high‑res mode, files are huge but the shutter is slow; moving subjects blur and the phone often hunts for focus. Daytime shots show crunchy edges from oversharpening, and bright skies get halo artifacts around buildings. Low light introduces watercolor smearing even with Night mode, and indoor white balance leans yellow. Video in 4K looks fine when static, but walking introduces micro‑jitters and rolling shutter wobble. The front camera actually looks cleaner and more reliable for quick snaps.",
        "source_3": "Focusing only on battery and charging: with dual SIMs, Always‑On display, and 120 Hz enabled, I leave home at 8 a.m. around 100% and hit 15–20% by 5 p.m. on a normal office day (email, Teams calls, Spotify, maps for a 30‑minute commute). Standby drain overnight is about 7–8%. Using the supplied charger, 0–100% consistently takes around 1 hour 35 minutes, and during summer afternoons I’ve seen a “charging paused due to temperature” message while the backplate felt toasty. For longer train rides I’ve started carrying a power bank because the last 30% seems to drop quickly when tethering.",
        "source_4": "As someone who does daily video calls and a lot of selfies, the front camera has been a pleasant surprise. In mixed indoor lighting, it keeps exposure on my face without blowing out windows behind me. Skin tones look natural, autofocus locks fast at arm’s length, and portrait mode cuts around hair strands better than I expected. Selfie video at 4K/30 stays stable during a brisk walk, and the mic picks my voice clearly over street noise. I turned off the beauty filters on day one and haven’t felt the need to tweak anything since.",
        "source_5": "I want to highlight the brand experience rather than the device itself. My first unit had a speck of dust under the rear lens; OnePlus chat support arranged a pickup the same day and a replacement reached me in 48 hours. They followed up with email confirmations at each step, and the new device was spotless. I’ve already received two OTA updates in the first month—both installed smoothly and included detailed changelogs. The community forum thread I posted in actually got a moderator response with a workaround within a few hours, which made setup a lot less stressful."
    }
}