{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I took the course to understand what my spouse actually does in infosec, and it finally gave me a way into those dinner-table conversations. By the end of week three, I could follow his chatter about threat models and “least privilege” without glazing over. The pacing let me squeeze in a full module during my bus commute, and the transcripts made revisiting new terms easy. The mini-project where we diagrammed a simple network forced me to connect the lectures to something concrete, and our group’s feedback session helped me ask smarter questions at home.",
        "source_2": "I’m only going to talk about the quizzes: they’re short (10–12 questions) but packed with trick wording. Several questions seemed to have multiple acceptable answers based on the lectures, yet only one was marked correct. The 10-minute timer felt tight, especially when they included calculations. There’s no partial credit, and if you miss the threshold, it locks you out for 24 hours. I started writing my own crib notes just to decipher which phrasing they prefer, which didn’t feel like I was learning the material itself.",
        "source_3": "Narrowly on lecture examples: the instructor’s analogies did the heavy lifting for me. Week 2, video 3 uses a kitchen workflow to explain pipelines, and the whiteboard sketch of “ingredients → prep → cook → plate” finally clicked why each stage needs its own checks. In week 4, the traffic intersection metaphor for concurrency—with lights, lanes, and turn signals—made race conditions less abstract. The hand-drawn diagrams, not the slides, are what I replayed before the homework, and the time-stamped summaries under each video helped me jump straight to those bits.",
        "source_4": "As an overall experience, the course left me doing more scavenger hunts than learning. The first week speaks at a high level, then week two drops formulas without explaining where they come from. The “no prerequisites” claim didn’t match the jump into calculus notation during the second assignment. Peer reviews felt random; one detailed critique, two one-liners. The forum was quiet in my time zone, so I ended up on YouTube to fill gaps. I finished, but the certificate didn’t change much—recruiters still asked for projects that weren’t really developed here.",
        "source_5": "Only about captions/transcripts: the auto-captions frequently mangle domain terms—“Kubernetes” became “Cuba net is,” and “idempotent” showed up as “I’d depend it.” On several videos, the captions lagged the audio by a few seconds, which made note-taking messy. The downloadable transcript had odd character encoding, so searching for specific function names didn’t work. I rely on captions to study quietly at night, so I ended up pausing every few lines to cross-check the glossary. If the captions were manually corrected, the videos would be far easier to follow."
    }
}