{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I completed the four-week Coursera intro while getting ready for my MPH. Each week ran about 2–3 hours with short WHO/CDC readings and a quiz. The epidemiology segment refreshed incidence vs. prevalence, and the health policy module showed how to read a simple cost-effectiveness table. I saved the downloadable checklists on literature search and basic study design and used them during my clinic orientation. As a whole, it gave me structure and the vocabulary I needed before classes start.",
        "source_2": "I’m commenting only on practical application. Most “case studies” were narrated slides about hypothetical hospitals, with no files to manipulate and no walkthrough in Excel or Google Sheets. At my clinic in Oaxaca, I manage vaccination logs; I couldn’t map their examples to that workflow. I was looking for a hands-on demo to build a line list and compute coverage rates, but the tasks stayed abstract and ended as multiple-choice questions.",
        "source_3": "Focusing strictly on clarity of instructions: the capstone asked us to “critically analyze a study” without a transparent rubric. The prompt mentioned “contextualize external validity” but didn’t spell out the depth or structure expected. Different forum posts from staff cited different word counts, and the sample submission contradicted the grading notes. I rewrote my piece twice because I couldn’t tell what would meet the criteria.",
        "source_4": "Overall take after finishing: I moved through the content in about 10 days, and much of it repeated material from my undergrad methods course. Several quiz items matched the practice questions word for word. The discussion board felt quiet, and the final reflection drew minimal peer feedback. When I met my MPH advisor, I couldn’t point to a new analytical technique beyond a refresher on basic study designs, so I signed up for another prep course for more depth.",
        "source_5": "Zooming in only on practicality: Week 3’s outbreak investigation sequence was directly usable. I printed the worksheet, followed the steps to define a case, built a simple line list, and plotted an epidemic curve in Google Sheets. The video paused at each decision point—case definition, tally counts, stratification—so I could mirror the steps with my own sample data. I applied that process in a local training the next day.",
        "source_6": "Commenting solely on how explicit the explanations were: in the biostats segment, the instructor wrote out the incidence formula, substituted real numbers, and labeled units in three worked examples. The subtitles matched the narration, and the PDFs summarized each step in numbered order. I bookmarked the confidence interval walkthrough because I could replicate the calculation on paper without pausing."
    }
}