{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I took the ASU MOOC this spring to refresh my ESL toolkit, and the overall flow worked well for me. The weekly modules moved from needs analysis to lesson planning, then into phonology and assessment, and the sequence made sense in my day-to-day teaching. The video lectures mixed real classroom clips with whiteboard walkthroughs, and the short quizzes kept me on track without feeling like busywork. I finished the capstone by drafting a full PPP lesson for A2 learners and got helpful peer notes that I could apply the next morning. The certificate arrived within a week, and I’ve already reused the downloadable templates in two different courses.",
        "source_2": "I enrolled mainly for the instructors, and they delivered in terms of presence and clarity. The lead faculty showed how to set up boardwork for controlled practice, then modeled the same routine with a live class so you could see timing and transition language. In the forums, they jumped in with examples—like how to scaffold a role-play for shy students—and pointed us to specific timestamps when our questions overlapped with the lectures. During office hours, they gave concrete alternatives when I described my mixed-level adult group, and their follow-up posts included sample prompts I could copy straight into my plan.",
        "source_3": "Focusing just on content depth, parts of the course felt thin for experienced teachers. The phonology unit repeated basic IPA definitions I’d seen in the pre-course reading, with only a couple of minimal pairs and no real practice diagnosing learner accent issues. The grammar section skimmed tense-aspect contrasts and offered few authentic examples; it leaned on multiple-choice items rather than analysis of learner errors. Several resource links were dated or broken, and the lesson plan rubric stayed very generic, so it was hard to pinpoint how to improve beyond “add more practice.”",
        "source_4": "From a whole-course perspective, my run-through was bumpy. Deadlines tended to cluster on weekday mornings in my time zone, which created a scramble, and the peer-review system stalled when not enough classmates submitted on time, leaving my capstone unscored for days. Discussion boards got crowded, so answers to common questions (like download locations for transcripts) were buried under duplicate threads. I appreciated the crisp audio and clear slides, but the administrative side—announcements, grading cadence, and assignment unlocks—pulled focus from the learning for me.",
        "source_5": "Zeroing in on the grammar explanations, the course helped me untangle tense and aspect in a way I could teach immediately. The instructor used timelines and corpus examples to contrast present perfect and past simple, plus a short segment on L1 transfer that finally explained why my Spanish-speaking adults default to “I have gone yesterday.” The practice included error analysis with teacher-style feedback, not just answer keys, and the downloadable chart fit neatly into my A2 class handouts. After trying their sequence—guided discovery, controlled drills, then a freer interview—I saw fewer fossilized errors in the next lesson."
    }
}