{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I took this on Coursera with a humanities background and was nervous about equations, but most lessons relied on pictures and simple ratios rather than calculus. The balloon and raisin‑bread analogies made expansion and redshift click for me. We touched on the Big Bang, dark matter, and the CMB without pages of symbols, which kept me from getting stuck. I could follow the videos on my commute and finish the short quizzes in one sitting.",
        "source_2": "I came in as a physics undergrad hoping for a rigorous track and found it more like a sightseeing tour: inflation, structure formation, dark energy, gravitational waves—each visited briefly. The Friedmann equations were stated but never derived, and the FRW metric was mentioned without working through it. The inflation module in particular felt like an overview rather than an analysis with potentials or perturbations. If you’re looking to write out calculations, you won’t find much to chew on here.",
        "source_3": "Focusing only on Hitoshi Sir’s explanations: his walkthrough of redshift and distance measures stood out. He drew clear plots of luminosity distance versus redshift and tied them to spectra examples so I could see how the numbers map to observations. The raisin‑bread model for expansion and the CMB power spectrum sketch helped separate dark matter from dark energy without drowning in jargon. I kept pausing to copy his diagrams into my notes because they lined up exactly with the quiz questions.",
        "source_4": "As an overall experience, the four‑week structure felt organized: short videos, a recap at the end of each week, and quizzes that mirrored what was emphasized in the lectures. The sequence from early universe basics to the CMB and then to dark energy made sense, and I didn’t need to hunt for outside material to keep up. I liked that the math stayed light while still naming the key models people read about in popular science. I ended up sharing the course link with two relatives who are curious about space but haven’t taken physics.",
        "source_5": "From an overall standpoint, I was looking for a mathematical cosmology class—Einstein field equations, the FRW line element, growth of perturbations—something to practice with problem sets. Instead, the assessments were definition‑level multiple choice, and I never saw a derivation carried to completion. By the end of Week 2, I realized it wasn’t going to move past conceptual summaries, so I stopped and switched to a textbook and some YouTube lectures that work through the algebra.",
        "source_6": "Zeroing in on the instructor’s delivery, I had trouble following some segments because the audio mix fluctuated and terms appeared before being defined. In the expansion unit, the jump from scale factor to comoving coordinates happened mid‑slide with no setup, and I had to rewatch it several times. The explanation of the CMB power spectrum skipped why certain peaks matter, which left me guessing during the quiz. The forum threads that week were full of similar clarifying questions, so it wasn’t just me."
    }
}