{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I’ve been carrying this phone as my main device for about half a year. Calls are clear, apps open fast, and the UI hasn’t crashed on me, even with a bunch of social and banking apps running. The only habit I’ve developed is plugging it in for a 20–30 minute top‑up around lunchtime; it shoots from roughly 15% to full in that one coffee break. If I stream a full 40‑minute show at 75% brightness, the battery dips from 100% to around 50–55%, so I plan around that. Outside of the power drain, nothing else has tripped me up.",
        "source_2": "Focusing on the battery only: the charging speed is the standout. With the stock fast charger, I regularly see 10% to 100% in about 27–30 minutes, confirmed a few times with AccuBattery. The flip side is how quickly it empties—Google Maps with Bluetooth and data on eats roughly 1% per minute on my commute, and a 30‑minute YouTube session drops me from full to the mid‑60s. I’ve tried lowering refresh rate and turning off 5G, which helps a little, but I still carry a power bank.",
        "source_3": "My experience runs a bit differently from what others describe about the battery. I leave at 7 a.m. with around 95% and usually get home close to 9 p.m. with 20–30% left after messages, an hour of Spotify, and some photos at lunch. I rarely need to fast‑charge midday, though I like knowing it can refill quickly if I forget overnight. Performance and signal have been steady, and I haven’t noticed unusual warmth or background drain after the last update.",
        "source_4": "Battery life has been the main headache for me. From 100% to roughly 70% in 30 minutes of Instagram Reels at 60% brightness is typical, and I see about 8–10% go missing overnight in airplane mode. I reset the phone, disabled background refresh for most apps, and even swapped the SIM to rule out network issues—no real change. On the upside, a dead phone climbs back to full in about half an hour with the in‑box charger, but it empties so fast that I’m tethered to outlets.",
        "source_5": "As an overall package, the phone has behaved well: clean interface, smooth app switching, and reliable GPS for runs. I’ve used it for work calls, Slack, and a couple of VPN sessions without slowdowns or random reboots. On a weekend trip I shot a few dozen photos, navigated for two hours, and then did a quick 25–30 minute charge at a café before dinner to top it off. I don’t obsess over the battery anymore because topping up is quick, and the rest of the device doesn’t get in my way."
    }
}