{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I bought this mostly to film my kid’s soccer practices, and the camera hasn’t held up the way I hoped. Shooting 4K at 30 fps, the area around the lens gets noticeably hot around the 17–20 minute mark, and the live preview starts to jitter. I’ve had to stop recording, let it cool for a few minutes, and then resume, which breaks up the footage and misses plays.",
        "source_2": "Focusing just on battery: my routine is LTE all day, email and Slack, two hours of Spotify, Google Maps for a 40‑minute drive, and a handful of photos. With the screen at about 60% brightness, I’m seeing roughly 6.5–7 hours of screen‑on time, ending most nights around 25–30%. Standby drain is minimal overnight (2–3%). No games, and I keep Bluetooth and Wi‑Fi on.",
        "source_3": "Picked it up during a weekend promo for $379, and as an everyday device it’s been steady. Setup took 20 minutes, the UI remains snappy switching between Chrome, banking, and Messages, and the display is bright enough for outdoor use. Quick 10–20 second clips and photos at the park come out fine, and I haven’t noticed any warmth with casual shooting. After a full workday of calls and chats, there’s still enough charge to stream a podcast on the commute home, so the price felt reasonable for what I’m getting.",
        "source_4": "I stress‑tested the camera during a band rehearsal: one continuous 1080p/60 recording for 25 minutes, indoors with AC and the case off. The phone warmed up but never threw a temperature warning or lagged, and the clip stayed smooth from start to finish. Still photos in the break turned out clean, with no slowdown opening the gallery.",
        "source_5": "I bought this specifically for travel vlogging, and it hasn’t matched the plan. Filming 4K for about 15 minutes makes the back plate uncomfortably warm and the camera app starts dropping frames; the battery level plunges during these sessions, and by late afternoon I’m hunting for an outlet. At $449, I expected to record longer without fuss and to get through a day of heavy shooting."
    }
}