{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I picked this phone up during a festival sale with a bank cashback and a $180 trade‑in for my two‑year‑old model. The final bill came to $529, and it shipped with a 65W charger and a case in the box. Compared with the sister brand’s version, I’m getting wireless charging, a brighter 120 Hz screen, and on‑site pickup for repairs in my city. On a 12‑month EMI, it works out to less than what I pay for broadband, so the numbers made sense to me.",
        "source_2": "I’m only here to talk about battery. My day starts at 6:30 a.m., and by the time I plug in around 11 p.m., I’m usually sitting at 30–40% after about 2 hours of Spotify over Bluetooth, an hour of Google Maps with screen on, Slack pings all day, and 20–30 photos. The 0–80% top‑up takes roughly half an hour on the included brick, and the phone doesn’t throttle or get toasty when I run a 45‑minute Call of Duty session on Wi‑Fi.",
        "source_3": "After a month of daily use, the overall experience has been smooth: apps open quickly, the fingerprint reader unlocks reliably even with slightly damp fingers, and call quality is crisp on both SIMs. The camera isn’t flashy but it’s consistent, and the haptics feel tight, not buzzy. The migration tool moved my messages and app data from the sister brand’s device in under 25 minutes, and the first security patch arrived in week two without me having to hunt for it.",
        "source_4": "I paid full sticker price at launch—$699—and that’s where it stung. The chipset and the main camera sensor are the same ones in the sister company’s model that sits at $499. No charger in the box either, so I had to buy a 45W plug separately. The warranty terms are identical across both lines, and the case I liked only comes as an added bundle. If there are extras justifying the gap, I couldn’t find them on the spec sheet or in day‑to‑day use.",
        "source_5": "Focusing strictly on the cameras: daylight shots are punchy but tilt warm on skin, and the ultrawide doesn’t match the main camera’s color. Night mode pulls out exposure but smears fine detail around street signs if I zoom in. 4K60 video looks sharp until about the 8‑minute mark when the phone throws a heat warning and drops to 4K30. On the plus side, OIS makes walking clips look steady, and the selfie cam nails focus at arm’s length without hunting."
    }
}