{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I enrolled mainly to figure out how to make my reading sessions less passive, and this course gave me a concrete routine. By Week 2, I was using the “question the author” prompts while leaving notes in the margins of the provided PDFs, and the examples pulled from Woolf and Orwell made the approach feel grounded. The final project asked for an annotated article plus a short reflection, which pushed me to connect my scribbles to actual arguments. Prof. Bazanova’s walkthroughs of sample annotations were clear enough that I started applying them to my work documents, not just literature. I finished with a binder of printouts covered in arrows, questions, and summaries that I still reference.",
        "source_2": "I’m commenting only on Prof. Bazanova’s delivery, since that mattered most to me. The lecture pacing felt uneven, with long stretches of text-heavy slides read verbatim, and the mic occasionally clipped consonants so I kept rewinding. The on-screen text was small on a laptop, and the lighting changed mid-video in two modules, which made it tiring to watch at night. Office hours landed at 3 a.m. in my time zone, and the forum replies under her name tended to be one-liners without examples. I got through the material, but it took extra time to fill the gaps with community posts.",
        "source_3": "Focusing on the course structure itself: the syllabus promised a step-by-step path from note-taking to argument analysis, but topics looped back without signaling why. Week 2 reintroduced the same “ask the text questions” checklist from Week 1 with only minor tweaks, and then Week 4 jumped into synthesis and citation without bridging activities. Deadlines shifted twice due to “session updates,” which threw off my planning, and the rubric for the mid-course essay left key criteria (like evidence weighting) undefined. Quizzes leaned on trickily worded items rather than application of the methods, and peer reviews varied wildly—one gave a top score with no comments, another demanded sources we hadn’t been taught to cite.",
        "source_4": "This is just about the margin-writing technique taught in the first half. The simple system—circles for claims, arrows to evidence, and a one-sentence paraphrase at the bottom of each page—made dense readings manageable. I tried it on a 26-page research article and cut my rereads from three passes to one, because my questions and mini-summaries pointed me back to the right paragraphs. It even worked on a Kindle by exporting to PDF and using a stylus; when I couldn’t, I kept a half-sheet “gutter” taped beside the page. That single method changed how I approach unfamiliar authors.",
        "source_5": "As an overall experience, the ideas landed, and Prof. Bazanova stayed active on the forum—she recorded a short Q&A clarifying how to move from marginal notes to a thesis, which solved a sticking point for me. That said, the platform got in the way: subtitles went out of sync on multiple videos, the iOS app crashed during two quizzes, and peer-graded assignments came back days after the posted return window. I had to build my own schedule because the “reset deadlines” toggle didn’t update all modules, leading to a missed checkpoint. I still completed the capstone by compiling an annotated mini-portfolio, but it required more workarounds than I expected."
    }
}