{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "Four months in, the phone heats up specifically during charging. I only use the stock 33W brick and the bundled USB‑C cable with the original wall adapter—no third‑party gear. From 15% to around 70% in about 25 minutes, the top-left of the back gets hot enough that I take it off the couch armrest and set it on a ceramic coaster. The charging speed also dips mid-way, and the screen brightness auto-dims even though I’m not using it. I took the case off and tried two different outlets; same result.",
        "source_2": "I’ve been using this as my main phone for six months, with two SIMs, a lot of Slack/Teams calls, maps, and YouTube on my commute. I usually top it up on the nightstand with a slow 10W charger, and it stays cool enough that I don’t notice any warmth. App switching is fluid, and I haven’t had to reboot unexpectedly. The screen responds well and the speakers handle podcasts fine. For my day-to-day, it just gets the job done without fuss.",
        "source_3": "Performance is where I’ve run into issues. Opening the camera from the lock screen sometimes freezes for 5–10 seconds, and touch input stops registering until it catches up. Scrolling through Instagram after a long call has caused two full lockups this month where I had to hold the power button for a forced restart. I’ve got 40 GB free and default background limits, so it shouldn’t be overloaded. The last update helped a little, but the hiccups still show up when jumping between apps.",
        "source_4": "I only care about battery life, and this phone has been solid in that department. With Bluetooth music, two hours of maps, and a handful of photos, I regularly finish a day with 35–40% left and 7–8 hours of screen-on time. A full charge with the included charger takes about an hour, and the back gets just slightly warm—about what my palm feels like. I keep it in a thin TPU case and charge on a wooden desk. I haven’t seen any drain spikes or slowdown while plugged in.",
        "source_5": "After four months, the device gets noticeably hot whenever I plug it in, even with the original brick and cable. I tried three different wall sockets and removed the case; the area near the camera module becomes uncomfortable within 10–15 minutes, and the charging graph shows a plateau like it’s pulling back. While it’s on the charger, typing in WhatsApp lags and the keyboard skips letters, and once a week it locks up long enough that I just put it down and wait. Service staff ran diagnostics and called it within range, but in the hand it doesn’t feel right. I’ve started topping up in short bursts to avoid the hot backplate."
    }
}