{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I finished this course last month while working full-time. I treated it like a light routine: 30–40 minutes on weeknights and a longer stretch on Sunday kept me ahead. The videos were concise, and the quizzes matched the examples without surprises. Forum mentors merged duplicate questions quickly, so I rarely had to dig for answers. A guest Q&A with a data scientist gave me a fresh way to frame a client churn issue that I applied the same week.",
        "source_2": "Focusing only on the time commitment: the weekly tasks ballooned. Week 2’s case study had three sub-prompts plus peer reviews; I spent roughly 10–12 hours just to meet the rubric. Discussion participation was graded, so I had to wade through long threads to leave the required comments. By Friday I was still finishing Monday’s material, which squeezed out other commitments.",
        "source_3": "On relevance of the examples: the hospital staffing case mapped directly to my shift-coverage problem. I copied the bottleneck analysis template into our team’s playbook and cut our swap approval time from days to hours. The retail inventory scenario mirrored our seasonal stockouts, and the way they framed safety stock vs. service levels clicked immediately. I wasn’t watching abstract theory; it felt like someone had been in my meetings.",
        "source_4": "About the discussion format: I liked that it wasn’t over-policed. The open threads let niche topics spin up fast—someone started a deep dive on Bayesian A/B pitfalls, and the back-and-forth surfaced resources I hadn’t seen. It took some sifting, but the serendipitous finds made the time worthwhile. I bookmarked a dozen conversations I still revisit.",
        "source_5": "Big-picture take: the lectures were fine, but the community side ate my schedule. Instructions shifted after release, and I kept chasing clarifications across scattered posts. Between mandatory forum activity and long peer-review queues, I was spending entire evenings just navigating the course. I tapped out after week two and looked for something less chaotic.",
        "source_6": "On guest speakers only: the sessions felt tacked on. One marketing exec dialed in with choppy audio and read bullet points off a deck we never received. The startup founder’s story was inspiring in tone but light on actionable detail; Q&A ran out before we got past high-level anecdotes. I skipped the last guest session and stuck to the core videos."
    }
}