{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I paid close attention to battery and charging the first week. Unplugged at 6:30 a.m., I did an hour of Maps, constant Slack and email, Spotify on my commute, a few short calls, and about an hour of YouTube. By 10 p.m. I still had 25–30% left with 7+ hours of screen time. On a lighter Saturday I didn’t charge until the following afternoon. The bundled charger takes it from roughly 15% to 80% in half an hour, and 0–100% is under an hour. Overnight on Wi‑Fi it drops maybe 1–2%. So for my routine, I’m not hunting for an outlet.",
        "source_2": "I bought this mostly for video calls and selfies, and the front camera hasn’t been kind to me. Indoors, even with decent room lighting, faces look smeared and skin comes out plasticky. Outdoors at noon, the sky blows out and my hair turns into a soft blur no matter where I tap to focus. I’ve disabled all beauty filters and even tried third‑party camera apps; portraits still leave halos around ears and glasses. Low‑light selfies are the worst—lots of blotches and a waxy look that makes LinkedIn photos a chore.",
        "source_3": "As an overall package, it’s been solid for me. Coming from a K20 Pro, this feels snappier in day‑to‑day use—apps open instantly, scrolling is buttery, and games like PUBG run without hiccups. The screen looks sharp for reading and streaming, and the speakers have good presence for podcasts. I don’t carry a power bank anymore because a full workday with Slack, calls, and some camera use isn’t a problem. The cameras are dependable for school runs and weekend photos, and I haven’t had to fuss with settings to get shareable shots.",
        "source_4": "Display‑only take: after years on AMOLED, this panel feels a bit off. In a dark room, blacks never quite go black—there’s a grey veil over night scenes in Netflix, so movies lose depth. Tilt the phone slightly and whites warm up; switch back and they cool down. Motion is smooth, but on dark UI elements I notice a faint smearing while scrolling. Outdoor brightness is serviceable for maps, yet colors look flatter than what I’m used to, and photos don’t have that punch.",
        "source_5": "I’m into mobile gaming and performance has been a highlight. Genshin Impact on high settings holds 60 fps for a 45–50 minute session; it gets warm but doesn’t throttle. I can jump between the game, Discord voice chat, and Chrome without the game reloading. App installs are quick, file transfers fly, and touch response in shooters feels tight. Even after a long play session, the UI stays snappy and there’s no random stutter when I return to the home screen.",
        "source_6": "I care a lot about color accuracy on the rear camera because I shoot crafts for Etsy. With window light, kraft paper looks the right brown instead of orange, and skin tones don’t skew pink. I tested against a small ColorChecker and the greys lined up better than my previous phone. Under my kitchen LEDs it can shift a bit warm, but outside and near daylight bulbs, product colors match what I see in person. Auto mode has been consistent enough that I rarely tweak white balance."
    }
}