{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I bought it mainly for endurance, and the battery has held up well for my routine. With two SIMs (Jio + Airtel), high refresh rate on all day, Bluetooth connected to a smartwatch, and brightness around 50%, I’m getting about 7–8 hours of screen-on time. A typical day for me includes an hour of YouTube, 30–40 minutes of BGMI, lots of WhatsApp, and roughly an hour of Google Maps. Overnight standby drain is 2–3%. Fast charging takes me from roughly 15% to full during dinner. I don’t carry a power bank anymore, even on commute-plus-gym days.",
        "source_2": "I’m picky about displays, and the 120 Hz behavior hasn’t matched my expectations. The phone ramps down to 60 Hz in several third‑party apps (Instagram reels, YouTube comments, Reddit scrolling), and Chrome sometimes drops frames on long pages. There’s no reliable way to force 120 Hz everywhere; it toggles back during video playback and some games’ menus. Edge touch rejection feels a bit inconsistent when typing at speed, and I’ve noticed slight smearing on dark text over gray backgrounds while scrolling. Outdoors readability is fine, but the adaptive brightness overcompensates under shade.",
        "source_3": "After two weeks as my daily driver, the overall experience has been smooth. Apps pop open quickly, app switching is snappy, and I haven’t run into random ads or spammy notifications after the initial setup. The camera handles daylight scenes better than my previous mid‑ranger, and the photos look social‑media ready without much editing. Calls on VoLTE sound clean on both Airtel and Jio in my area. Haptics feel a bit faint on default, so I bumped them to the strongest level in settings to feel keyboard taps. I paid 24,999 during a sale and didn’t feel the need to look for another option.",
        "source_4": "Focusing only on software behavior: out of the box there were a bunch of preloaded apps, and even after disabling a few, some kept nudging me until I manually revoked permissions. After the 1.0.3 update, the keyboard started dropping characters occasionally, and I noticed short hangs when pulling down quick settings. The system also gets aggressive about background tasks—Spotify pauses when I open Maps unless I whitelist it, and Telegram sometimes reloads when I return after a few minutes. App launches are fast, but the inconsistencies in animation timing and task retention break the flow.",
        "source_5": "On cameras, daylight shots look crisp, but the HDR can be hit or miss—bright skies sometimes clip, and indoor shots trend warm. In low light, the dedicated night mode smooths skin too much, and textures on jackets or hair lose detail. Video at 4K 30 fps shows decent detail, yet stabilization crops heavily and still leaves a slight wobble while walking. Close-up focusing hunts on small subjects like flowers, and the shutter occasionally lags, causing me to miss quick moments. The front camera ships with beautification toggled on by default, which I had to dig through settings to fully disable.",
        "source_6": "As an overall package at 25k, my experience has been mixed. With 120 Hz kept on and 5G active, the battery drops faster than I expected—on office days with a couple of Teams calls and constant Slack, I’m at 20% by early evening. Callers have told me I sound muffled in the car unless I switch to wired earphones, and Wi‑Fi calling flips off on its own on my home network. The vibration motor is subtle enough that I miss notifications in jeans pockets. The screen looks fine indoors, but nothing stands out in bright sun. For the price I paid, I was hoping for fewer trade‑offs."
    }
}