{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I picked this up during a festival sale and paid 22,499 after a bank offer. After three weeks, the 120Hz panel makes scrolling through Twitter and Reddit feel seamless, and the chipset holds 60fps in BGMI with balanced graphics. I went with the 8/256GB version; app switching is snappy and calls stay clear even in crowded stations. Dual 5G works on Jio and Airtel without random drops, and GPS lock is quick on MapMyIndia. For what I paid under 25K, the package feels complete for my daily routine.",
        "source_2": "I’m focusing only on battery here: with dual SIM 5G on, auto brightness, and the refresh rate at 120Hz, I’m seeing about 4.5 hours of screen-on time in a typical workday (Slack, Gmail, Chrome, and a bit of YouTube). Standby drain overnight hovers around 8–10% with Wi‑Fi and Bluetooth left on. The bundled 67W charger takes roughly 45–50 minutes from 15% to full, but the area around the camera gets warm during the last 20%. I’ve tried dark mode and disabling background sync for a few apps; the numbers didn’t shift much.",
        "source_3": "Strictly about the price tag: I bought the 8/128 variant at 23,499 without any bank or exchange offers, and the “flagship under 25K” label set my expectations high. The unit I received has a plastic back, no formal water resistance rating, and mid-tier storage speeds, which doesn’t match that label in my head. The haptics feel light compared to models I tried in-store, and a delivery fee nudged the final invoice to 23,789. If the claim means top-tier everything, the hardware mix here doesn’t really fit.",
        "source_4": "Camera-only impressions after a week: daylight shots look natural with good detail in leaves and brick textures, and HDR isn’t overly punchy. Night mode avoids the usual waxy look; streetlights don’t bloom badly, and faces stay recognizable. Video at 4K30 is steady while walking, with minor jitter when panning fast. Indoor tungsten lighting keeps skin tones reasonable, though the ultra-wide softens edges. Macro is more like a close-focus trick and isn’t something I’d rely on.",
        "source_5": "Overall after two months: the phone came with a handful of preloaded apps, and the app installer pushed recommendations until I toggled them off in settings. Two OTA updates landed; the first improved touch response, while the second introduced a brief keyboard freeze that shows up once or twice a day. The screen stays readable under harsh sun, and the speaker gets loud enough for podcasts in the kitchen. I did notice occasional stutter when dozens of photos are syncing to Google Photos, but it clears after a minute. Network hold is solid in my basement, which is usually a dead zone for my older device.",
        "source_6": "Build quality focus: the back panel flexes slightly near the SIM tray, and I can hear a faint creak when pressing that area. After a week of pocket time with keys, the camera bump picked up hairline scuffs, and the included TPU case started yellowing fast. The power button has a tiny wobble that you notice when playing games in landscape. The USB‑C port feels a bit loose with my Anker cable compared to the bundled one, and there’s a visible gap around the top edge that catches dust."
    }
}