{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I’m going to focus strictly on battery life because that’s the one thing I care about. With my routine—two hours of Spotify streaming over LTE, 45 minutes of Maps navigation, a handful of WhatsApp video calls, and email all day—I average around 4.5 to 5 hours of screen-on time and I’m reaching for the charger by 6–7 p.m. Overnight drain sits at about 8–10% with the always-on display disabled. My previous Z6 routinely pushed past 7 hours of screen-on time and could idle for two days without touching a cable, so the drop is noticeable for my use. Fast charging gets me from 15% to 80% in about 30 minutes with the included brick, but the phone seems to lose that top 20% quicker than I’m used to.",
        "source_2": "After two weeks of daily use, I’m impressed by how cohesive the whole package feels. The processor keeps everything snappy—apps pop open immediately, multitasking between Slack, Gmail, and Chrome never stutters, and Call of Duty Mobile holds 60 fps at max graphics during 30-minute sessions without getting uncomfortably warm. The camera pulls clean 4K30 footage with a steady look indoors, and portrait shots after the latest update show improved edge detection around hair. The software skin is uncluttered, and I’ve already received a security patch that added lockscreen options I actually use. Battery is enough for a full workday with about 6 hours of screen-on time for mixed social, maps, and music, and I plug in before bed out of habit.",
        "source_3": "I evaluate phones mostly on the camera, so here’s my take. In dim restaurant lighting, the main shooter keeps noise under control, but moving subjects pick up smear unless I brace the phone; there’s a half-second pause after tapping the shutter that makes catching candid moments tricky. Outdoors at noon, auto HDR sometimes pushes highlights too far—white shirts and bright sky can look a bit blown unless I dial exposure down. Stabilization is good for standing shots, but 4K walking clips show a subtle micro-jitter that I see when panning. On the plus side, skin tones lean natural and the 2x crop looks cleaner than I expected, while the macro can lock focus around 5–6 cm reliably. If you’re coming from the Z6, you’ll notice different processing—less sharpening, more restrained contrast—which some people will prefer.",
        "source_4": "The phone arrived stable, but the June firmware (build 1.2.3) changed a few things I wasn’t expecting. Bluetooth audio began dropping twice on my morning commute in a 2018 Civic, and battery drain increased by roughly 6–8% during the same usage pattern. July’s patch fixed my Wi‑Fi handoffs between 2.4 and 5 GHz, and the camera’s low-light processing improved—less waxy faces under tungsten. I appreciate that updates land quickly, yet each patch feels like a dice roll: a bug is squashed, another quirk appears. I had to clear the cache for a couple of apps after the latest update to fix notification delays. If you value new features—like the added lockscreen widgets—you’ll probably enjoy the cadence; if you’re after a set‑and‑forget device, you might prefer slower changes.",
        "source_5": "Strictly on the processor and performance front, it’s a workhorse. Switching between Teams calls, Slack threads, and a 20-tab Chrome session doesn’t force reloads. Genshin Impact on High at 60 fps holds steady for about 25 minutes before dropping to the mid‑50s, with the back getting warm but not uncomfortable. I exported a 5-minute 1080p clip in CapCut with a couple of color and text layers in 2 minutes and 40 seconds, which beats my last phone by nearly a minute. File encryption and indexing after a 60 GB restore completed in under an hour while I was actively browsing, and thermal throttling only showed up after a 40-minute gaming session, shaving about 10% off peak clocks.",
        "source_6": "I travel a lot for work, so my view is more about the whole experience. Dual SIM plus eSIM support made switching between my local carrier and a Japan eSIM painless, and VoWiFi finally works reliably in hotel basements where LTE doesn’t. Call quality is clean on the subway, and the haptic motor feels precise—typing is satisfying rather than buzzy. Battery varies with roaming: on a week in Tokyo with constant map use and photos, I got one day comfortably but not two; at home, I can stretch to late the next evening if I’m mostly on Wi‑Fi. The Z series I used before ran longer on the same itinerary, but this phone adds better stabilization for quick clips, smoother system animations, and a cleaner settings layout, which makes the trade-off worth it for my kit."
    }
}