{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I bought this mainly for the camera, and spent the weekend shooting my niece’s birthday indoors. The photos kept skin tones natural and didn’t blow out the candles, and in the park the HDR kept the sky blue without turning faces grey. Portrait mode cut around flyaway hair cleanly, and the 4K clips didn’t wobble while I walked. Coming from a Vivo Z1X, I’m seeing better dynamic range and more detail in dim restaurants.",
        "source_2": "Two days in, the only thing bothering me is how warm it gets anytime I’m taking photos or recording. After about 6–8 minutes of 1080p video, the top-right of the back near the camera island gets noticeably hot to the touch. Even snapping 20–30 pictures in a row makes the frame warm. I tried turning off AI enhancements, dropping to 30 fps, removing the case, and updating to the latest build—still feels hotter than my old Vivo Z1X ever did.",
        "source_3": "As a daily driver, it’s fine for calls and WhatsApp, but the camera feels inconsistent. Outdoors at noon the shots are crisp, yet indoor evening photos look mushy and the shutter hunts for focus. Recording a 4K video in my kitchen made the phone warm up and the battery dropped 10% in under ten minutes. I like the screen and the speakers are loud enough, but the rough edges around the camera and heat make it hard to recommend to friends.",
        "source_4": "Focusing just on battery behavior: my usage is mostly Instagram, Maps, and a lot of photos. Starting at 100% at 8 a.m., I end up around 25–30% by 10 p.m. A single 15‑minute video recording session eats close to 12%, and the back warms near the volume buttons. Standby overnight drops 3–4%. Using the bundled 33W charger, it goes from 20% to full in about 70 minutes. No gaming, lots of camera.",
        "source_5": "I’m more into mobile gaming than photography, so I ran Call of Duty Mobile and Genshin Impact for about 40 minutes each on medium settings. Frame rates stayed steady and the phone barely warmed, even with a slim TPU case on. After that I shot a few casual photos in the garden; didn’t notice any heat, and the app didn’t stutter. Compared to my old Vivo Z1X, the gameplay is smoother and load times are shorter.",
        "source_6": "For an all‑round view: after a week of commuting with it, the signal holds in the metro, face unlock is quick, and the UI animations are fluid. I recorded my kid’s school recital in 4K for about 12 minutes; the video came out clean and the mic picked up voices clearly, though the phone warmed enough that I used two hands. I charged overnight, used the camera for roughly two hours that day, and still made it through dinner. If you want a simple point‑and‑shoot experience, this fits unless you’re sensitive to warmth near the camera."
    }
}