{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I bought this Redmi flagship mainly for the battery, and mine has been holding up better than expected. Typical weekday: off the charger at 6:30 a.m., Bluetooth on all day for earbuds, two email accounts syncing, about 90 minutes of YouTube, an hour of maps with GPS, plus Slack and WhatsApp notifications flooding in. By 10:30 p.m. I’m usually at 25–35% with around 6–7 hours of screen-on time; on lighter days I’ve hit midnight at 40%. I keep 120 Hz and AOD on, and I only charge once overnight using the stock brick.",
        "source_2": "I care most about the back camera in bright light because I shoot product photos for listings. In mid‑day sun, the main sensor has been crisp with fine texture in fabrics and wood grain, and edge detection in portrait mode kept hair strands intact better than my older device. I took about 200 shots at a park—green leaves retained detail without turning into mush, and the sky didn’t blow out. 4K clips walking on a sidewalk looked steady enough for quick reels, with natural skin tones right out of the camera.",
        "source_3": "After two weeks, I’m carrying a power bank because my unit dips under 20% by late afternoon even on office days with mostly email, Teams calls, and some browsing. I’ve also noticed small stutters when swiping through the app drawer and the phone warms up around the camera bump while scrolling Instagram for 10–15 minutes. The back camera struggles with indoor shots under bright office lights, where text on posters looks soft unless I take multiple tries. For the price I paid, I expected to plug in less and fiddle less with settings to get a clean shot.",
        "source_4": "Focusing on performance and heat: mine has been stable. I ran 25 minutes of Call of Duty Mobile at high settings and the frame rate held without visible drops; I checked with a simple FPS overlay. Using a temp gun, the back peaked at around 37–38°C near the top after gaming and quickly cooled once I returned to messaging. Day-to-day—banking apps, Chrome with 10 tabs, switching between camera and maps—transitions feel immediate and I haven’t had random freezes.",
        "source_5": "As a daily driver for a month, it has been reliable for me. A typical day is 1 hour of calls, 2 hours of documents and mail, 30 minutes of navigation, and a few short videos; I unplug at 7 a.m. and usually plug in around 11 p.m. The main camera turns out clean daylight photos for family outings, though the ultra‑wide can be softer at the edges. I’ve seen an occasional hiccup when launching the camera from the lock screen, but it clears up fast. The phone gets a touch warm during long video calls, nothing that forces me to stop using it."
    }
}