{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I signed up during a hectic quarter and worked through the 4-week schedule on my lunch breaks. The videos are bite-sized (8–12 minutes), and each week ends with a values reflection worksheet that nudged me to put “well-being” next to money and time when weighing options. By Week 3 I’d built a simple habit—no-phone dinners and a Sunday walk—that actually stuck because the capstone asked me to track it for 7 days and log obstacles. I watched most lectures at 1.25x with transcripts on and found the prompts easy to plug into my mornings before email. The whole arc helped me reframe how I make choices at home and at work.",
        "source_2": "I’m only commenting on the peer-graded project. The rubric lists four criteria, but the feedback I got was two one-liners with no reference to the rubric, and the score swung wildly between attempts (92% on one, 68% on another) for essentially the same submission. The assignment opens for review at a fixed time, which meant my peers in different time zones didn’t see mine until the window was nearly closed. I asked for clarification in the forum and was told to resubmit, but that reset the clock and pushed my certificate by a week. I never received instructor feedback, just peer notes that contradicted each other.",
        "source_3": "I took this mainly for the science, so I focused on the sources. In Module 2, “hedonic adaptation” is explained with a line graph but there’s no citation on screen, and the linked reading is a blog post rather than the primary paper. Claims like “gratitude journals raise well-being by 25%” are presented without confidence intervals or effect sizes, and the reference list leans on older studies (2003–2005) with little discussion of replications after 2015. A section on mindfulness quotes a TED talk but skips recent meta-analyses; the only DOI I could find was buried in a PDF appendix.",
        "source_4": "I completed all four weeks and came away feeling like the same points were retold with different stories. The quizzes are mostly recall (e.g., “Which term did the instructor use for X?”), and the daily journaling felt like busywork after the first week. I paid for the certificate expecting a branded statement of accomplishment, but the badge only displays the platform logo and a generic title. On the plus side, the audio is crisp, and the slides are clean with high-contrast text that’s easy to follow on a phone.",
        "source_5": "I’m reviewing just the discussion forums. The “Share your value ladder” thread hit 900+ replies by the time I posted, and a mentor pinned a template that made it easy to map “family,” “health,” and “career” into concrete choices. I received three thoughtful replies within 12 hours suggesting measurable tweaks, like blocking 90 minutes on Tuesdays for a device-free activity. I barely touched the lecture videos that week, but the peer exchange alone pushed me to rewrite my weekly plan.",
        "source_6": "As a mid-career manager, I used the Week 3 decision journal template at work to weight “team well-being” alongside revenue on a product roadmap choice. It slotted neatly into our Monday stand-up: 15 minutes to list options, values, and trade-offs. I finished the course in three weeks at roughly three hours per week, mostly on an iPad. The reflections led to a small change at home—moving a recurring late-night meeting—without blowing up deadlines. The certificate linked to my LinkedIn profile without any hiccups, which helped me share the project write-up with my team."
    }
}