{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I picked up an iQOO Neo 7 specifically for BGMI and Call of Duty Mobile, and I’ve been playing 90–120 minutes a night. With graphics on HDR and frame rate set to Extreme, the phone holds 60 fps steadily. I log temps with the “CPU Monitor” app; it hovers around 38–41°C in a room without AC. The Game Assistant blocks notifications and frees RAM before matches, which helps. Even after three months, I haven’t seen the frame rate collapse mid-game, and the only tweak I made was capping the refresh rate to 90 Hz to avoid overdraw. I don’t see the performance dipping after the first week; if anything, the last OTA tightened touch response.",
        "source_2": "I’m only commenting on battery life for my iQOO 9. During the first week, I got roughly 7 hours of screen-on time with mixed browsing and maps. After day 8, standby drain jumped; I lose 10–12% overnight with Wi‑Fi and Bluetooth on, no SIM in slot 2. Fast charging still hits 100% in about 32 minutes, but the second half of the day now requires a top-up. I track usage in AccuBattery, which shows capacity at 96% after two weeks, but real-world endurance feels closer to 4–5 hours SOT with Instagram reels and YouTube shorts. I haven’t changed my app set, so the shift is noticeable.",
        "source_3": "Switched from a Poco to an iQOO Z7 and kept it as my daily driver for a month. The 120 Hz panel makes scrolling in Chrome feel silky, and the stereo speakers are loud enough for Netflix without a Bluetooth speaker. Cameras are solid for my needs; the 2x digital crop in daylight produces clean faces, and the night mode pulls out building details without turning everything into mush. Call quality on Jio is stable—VoLTE handoffs don’t drop my podcasts. I removed the preinstalled bloat in one go, and iQOO pushed two OTAs that improved fingerprint unlock speed. I don’t game much; for work chats, banking apps, and a couple of Meet calls, it’s been reliable.",
        "source_4": "My experience is about support. The mic on my iQOO 8 went flaky in week two—people said I sounded underwater. I took it to the authorized center in Indore, and they marked it as “physical damage” without explaining why, which meant no warranty. I escalated via email and the toll-free line; the callback took 9 days, then another 10 to “assess.” The repair quote was nearly half the phone’s price for a mainboard swap. Staff asked me to sign a waiver that any future issues wouldn’t be covered if I declined the fix. I left with the same mic issue and a ticket marked “resolved.”",
        "source_5": "I’ve used an iQOO Neo 6 since February, and it hasn’t done that early honeymoon drop-off I feared. The UI still feels snappy—app launches for WhatsApp, Photos, and Gmail are quick, and animations don’t stutter. The battery behavior is consistent: about one charge a day with 5–6 hours of maps, email, and music. The AMOLED hasn’t developed green tint or pink shift, and the camera glass hasn’t scratched despite pocketing it with keys. Buttons have the same click as day one, and monthly updates kept the security patch current without breaking banking apps. No sudden “after a week it turns messy” moment for me.",
        "source_6": "I bought the iQOO 9 Pro purely for Genshin Impact and expected it to be a set-and-forget device. For the first ten minutes it’s fine at 60 fps on high settings, then the frame rate dips into the mid-30s during Inazuma fights and the back gets hot near the camera bump. Performance mode in Game Assistant helps for a bit, but after two domains the throttle is obvious—inputs feel sticky and the visuals tear when panning. I tried a clip-on cooler and clearing the cache before sessions; still stutters on world bosses. The store wouldn’t take a return after 7 days, so I ended up reducing settings to keep it playable."
    }
}