{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I bought this mostly for long days at work, and I’ve been watching the battery closely. With light use—calls, WhatsApp, and a couple of emails—starting at 7 a.m., I’m around 15% by 9 p.m., and twice it powered off before midnight even though battery saver kicked in at 20%. Overnight I see an 8–10% drop with no music or games and background refresh limited; Battery usage shows Screen and Android System as the top consumers. I don’t have social apps auto-syncing, and I keep brightness on auto, but it still doesn’t stretch to a full 24 hours.",
        "source_2": "The charging speed is the standout for my routine. Using the stock fast charger, I go from 10% to 90% in roughly 25 minutes and to 100% in about 35, which makes quick coffee-stop top-ups practical. A 15-minute plug-in during a train change takes me from “almost dead” to enough for the rest of the afternoon, and the battery temp hovers around 36–38°C while charging. I’ve shifted to short, frequent top-ups during the day instead of planning a long charge at night.",
        "source_3": "After two weeks, the phone runs snappy and feels smooth; apps open quickly, the 120 Hz display makes scrolling easy on the eyes, and the speakers handle podcasts in the kitchen without me turning them all the way up. I game most evenings for about an hour and stream YouTube during lunch, and I still only plug in at night before bed. The software has the knobs I use: per-app notification categories, gesture sensitivity controls, a way to switch refresh rates via performance profiles, and a simple Do Not Disturb schedule tied to my calendar. Cameras give steady indoor shots and GPS locks fast when I start a run.",
        "source_4": "I’m picky about software settings, and this phone’s menu left me short on a bunch of basics I used on my previous device. There’s no dialer call recording toggle, no option to schedule battery saver for specific hours, and I couldn’t find per-app refresh rate or a global switch to disable animations. Notification controls feel stripped down—several apps only offer a single on/off instead of channels—and the back-tap gesture I relied on isn’t present. I even dug through developer options and still couldn’t enable these.",
        "source_5": "I bought it as a gaming model and pushed it with Genshin Impact and PUBG at high settings. Starting at 100%, about two hours of play leaves me around 45%, and the battery graph falls fast while the frame rate holds steady. Standby isn’t great either: overnight with everything closed I still drop 6–7%, and with 5G on, the drain is steeper even when the phone sits on my desk. I disabled background sync on Instagram and Maps, turned off always-on display, and I still need a late-afternoon charge.",
        "source_6": "I travel for work and use maps, email, and Slack throughout the day. On a typical schedule I see 3–4 hours of screen-on time and plug in once at night; on longer days I do a 20-minute top-up midafternoon and I’m fine to get home. Performance stays steady on video calls, the screen is readable outdoors, and the fingerprint reader hasn’t missed much. The settings covered what I needed—performance mode, notification badges, gesture navigation—so I didn’t feel like I was missing any controls from older phones."
    }
}