{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I’m focusing purely on the display here. In a pitch-dark room with the lights off, I set a pure #000000 wallpaper and used the RGB test app to show a full-black screen. At 10–20% brightness, there’s a faint glow along the left edge and a small crescent near the bottom-right corner; it’s less obvious at 60% but still there on the YouTube AMOLED theme and Netflix letterbox bars. White and gray test patterns look uniform, so it’s specifically a black-level uniformity quirk. I can reproduce it every night, and a long-exposure photo picks up the haze easily.",
        "source_2": "Strictly on performance: I recorded 40 minutes of Genshin Impact at the highest settings while screen recording at 1080p; the frame counter stayed near 60 fps and the CPU monitor app showed temps peaking at 43°C with no obvious stutters. A 5-minute 4K clip exported in KineMaster in about 6 minutes, and Lightroom batch edits applied to 60 RAW files without hangs. App switching between Slack, Chrome with 20 tabs, and Maps felt instantaneous, and the 120 Hz animations stayed consistent during multitasking.",
        "source_3": "After a month as my daily driver, I’ve leaned on it for calls, work chats, navigation, and taking photos at evening events. The battery gives me around 7–8 hours of screen-on time and the stock charger gets it from 20% to full in roughly 45 minutes. I tested the panel with Display Tester and a pure-black PNG in a dark bedroom; blacks on my unit are even at 5–15% brightness with no bands near the bezel, so reading with dark mode at night has been fine. The camera’s night mode picks up street signs and faces without needing to retake.",
        "source_4": "I bought mine online and only noticed the light spill along the bottom edge on day 11 while watching a movie with black bars. I took it to the service center with photos from an RGB app showing a full-black screen and the halo, but they called it panel variance and wouldn’t swap it since the return window had passed. Their only option was a paid display replacement. To work around it, I keep the brightness above 50% after dark or switch to gray wallpapers so the spill isn’t as obvious.",
        "source_5": "As an overall take, the processor chews through Lightroom exports and 4K playback, and heavy apps open without hesitation while the 120 Hz UI stays smooth. In dim rooms, though, a strip of light shows along the right bezel on pure-black screens—Spotify’s now playing page and system dark theme make it easy to spot at around 15% brightness. I verified with the RGB Color app using a full-black image, so it’s not the content itself. I missed the exchange window, so I avoid pure-black themes and stick to dark gray to keep it from catching my eye."
    }
}