{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I’m a GP in Edinburgh and took the course over two weekends. The role‑play clips gave me concrete phrasing I now use in 10‑minute consultations, like how to introduce the DASH questions without escalating risk. After week 3, I added a safety‑planning checklist to our EMIS template and shared it at our practice meeting. The quizzes referenced NHS pathways I recognise, and the printable referral map for local IDVA services now sits on my desk. This felt directly usable on a busy surgery list.",
        "source_2": "As a social worker in the Highlands, I enrolled because the description said it covered the full landscape of GBV. The legal sections barely touched the Domestic Abuse (Scotland) Act 2018, and there was nothing step‑by‑step on MARAC in Scottish boards. LGBTQ+ survivors were a quick case mention rather than a module, and there was no depth on immigration‑linked barriers or working with interpreters beyond a single slide. I finished the course still needing to source those gaps elsewhere.",
        "source_3": "I want to comment only on delivery clarity. The instructors spoke at a steady pace, acronyms like DASH, MARAC, and IDVA were spelled out the first time and then revisited with simple diagrams, and each vignette ended with a summary flowchart I could screenshot. The on‑screen captions matched the audio, and the slides used consistent colour coding for risk levels, which made note‑taking straightforward during night shifts.",
        "source_4": "I’m an emergency consultant in Aberdeen with a decade of safeguarding work. The first three weeks repeated definitions I teach to new registrars, and the scenarios stayed in primary care settings rather than acute presentations. The discussion boards were quiet, so there wasn’t much peer exchange on complex cases, and the reflective assignments rewarded length rather than nuance. I drifted off by week 4 because I wasn’t getting new approaches for the ED environment.",
        "source_5": "I focused on the assessments and scheduling because I was on a 1:4 on‑call rota. Deadlines were set to 00:00 UTC, which landed mid‑shift for me; missing one quiz locked the certificate path, and there was no late window. Peer reviews arrived days late, and two of the three comments I received were copy‑pasted. The rubric asked for “actionable reflection” but didn’t define criteria, so grading felt inconsistent. The videos being 6–8 minutes did fit my bus commute, but the logistics made completion harder than it needed to be."
    }
}