{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I met a friend at the lobby bar around 9:30 p.m. and ordered the house burger with fries. The bun had a light crackle on the edges, just enough to keep the sauce and tomato from soaking through, and it held together right to the last bite. The patty came out medium, cheese fully melted, and nothing slid apart when I picked it up. No shredded roof-of-mouth feeling, just a clean bite and a stable sandwich. If I’m in the area again, I’d drop in for that burger alone.",
        "source_2": "I stayed two nights in a king room (1214) facing the interstate and couldn’t get comfortable. The bed sat on a firm platform and the pillows were so inflated that my neck was sore by morning. The wall AC kicked on with a clunk every twenty minutes and blew a cold stream straight across the bed, so I kept waking up chilled. The curtains didn’t close all the way, leaving a stripe of light across the floor. Earplugs and a hoodie got me through the second night, but I was counting the hours.",
        "source_3": "I arrived close to midnight with two roller bags and parked in the attached garage, assuming it would be straightforward. The signs sent me to the wrong elevator bank for my tower, dropping me at a service level where I had to backtrack. My key card demagnetized twice, and the closest help desk was across a skybridge, so it turned into a long, awkward loop with luggage. By the time I reached the room, I’d ridden three elevators and climbed two stairwells. If you’ve got mobility issues or heavy bags, the route to the room is a maze.",
        "source_4": "I booked a standard queen for the rivalry weekend and everything clicked into place. Check-in took about five minutes, the digital key worked on the first try, and the elevators kept moving even with the post-game crowd. My 9th-floor room stayed quiet despite being near the lift, water pressure was steady, and the thermostat held 70 without drifting. I grabbed a burger downstairs; the bun was toasted but not brittle, and the plate came out in under ten minutes. I turned in early and slept straight through till morning.",
        "source_5": "On paper this place has what I needed—attached parking, a sports bar, and easy ride-share pickup—but the stay felt uneven. Our room on the 6th floor had warm lighting and a soft throw that made it feel snug, yet the check-in line snaked into the lobby and elevator waits stretched past ten minutes after the game. I grabbed a burger at the bar and the bun’s edges were so hard they scraped my gums; the replacement wasn’t much different. Hallway chatter carried well past midnight. We checked out at dawn to beat the congestion."
    }
}