{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I signed up mostly for week 4 after a colleague said that’s where the measurement framework lives, and that module delivered for me. The instructor walked through mapping objectives to KPIs, setting up UTM parameters, and building a simple channel-attribution table in a spreadsheet. The case study on a nonprofit campaign showed how to collect baseline metrics before a push and compare lift afterward. I ended up copying the dashboard template from that week to brief my manager, and I largely skipped the earlier weeks after sampling them.",
        "source_2": "The Google+ assignment threw me off. I spent an evening trying to revive my old Google+ login, then hunted for active communities to complete the “engagement tracking” task. My test post got zero interactions, and the rubric still talked about +1s and reshares as if they were common. Even the instructions referenced “Ripples,” which I couldn’t find anymore. I ended up taking screenshots of a profile that looked abandoned just to meet the submission requirements.",
        "source_3": "I came in with a marketing minor and no hands-on experience with social tools, and the overall structure worked for me. The early modules spelled out basic terms like impressions, reach, and engagement with clear examples, and the vendor demos helped me understand what a listening dashboard looks like without buying anything. The quizzes were short but made me articulate definitions, and by the end I felt comfortable explaining a simple social report to my boss.",
        "source_4": "I’ve been in social analytics for five years, and the course felt like a series of vendor walk-throughs with thin methodology. Several examples leaned on 2014–2015 case studies, and there were slides labeled “new features in 2016.” I was hoping for sampling strategies, significance testing on lift, or even API extraction tips, but most of the time was spent clicking through interfaces. Week 4 had a useful structure for reporting, but it couldn’t carry the rest.",
        "source_5": "Focusing purely on how current the materials are: multiple readings led to 404s, the screenshots showed an older Twitter layout, and one activity still referenced Google+ as a required platform. The “emerging platforms” section mentioned Vine and linked to a blog post dated years back. The certificate date was recent, but the examples and links suggested the content hadn’t been refreshed in a long while.",
        "source_6": "I only cared about workload and pacing because I took this alongside a full-time job. Most videos were 5–8 minutes, total weekly time came out to around two and a half hours, and the peer reviews took me about 15 minutes each. There was no coding or heavy math, and the assignments could be done in one sitting. For scheduling purposes, it was easy to slot into lunch breaks without feeling rushed."
    }
}