{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I enrolled after a family argument about a headline went off the rails, and this course gave me a routine I could actually use. By the end of week 1, I was practicing lateral reading instead of sitting on a single article. In week 2, the instructor showed how to trace an image back to its origin, and I applied it that night to a protest photo my uncle posted; a quick reverse image search showed it was from 2012, not last week. The weekly quizzes mirrored real feeds—screenshots of tweets and cropped Facebook posts—so I wasn’t memorizing definitions, I was clicking through sources. I finished in two weekends, and now when a link drops into the family chat, I have a checklist and a way to keep the conversation from spinning out.",
        "source_2": "I only want to comment on the video accessibility. On the mobile app (Android), the English subtitles consistently drifted by about two seconds, so the text lagged behind the instructor’s voice. Proper names were mangled—“lede” was transcribed as “lead,” and “NewsGuard” appeared as “newsguard”—which made note‑taking tricky. When I downloaded the transcript for week 3, the figures and charts referenced in the talk weren’t labeled in the text, so without the on‑screen visuals, I couldn’t tell which claim matched which bar in the graph.",
        "source_3": "Narrowly on transcripts and search: on desktop (Chrome), the transcripts were clean and searchable. I could type “lateral reading” in the search field and jump to every mention across all four weeks. The time‑stamped lines synced perfectly; clicking 07:43 in the transcript took me to the exact moment the instructor demonstrated checking a domain’s “About” page and cross‑checking with WHOIS. I ended up copying specific lines into my workshop notes, and the references stayed accurate even after I adjusted playback to 1.5x.",
        "source_4": "As an overall impression, the material felt like an orientation talk stretched into a course. Many segments circled the same two or three anecdotes, and I was hoping for deeper tool work—real WHOIS digs, EXIF checks on images, or a hands‑on walkthrough of evaluating funding disclosures beyond a quick glance. The “sandbox” exercise was so guided that it was hard to make mistakes and learn from them, and the final quiz recycled earlier question stems almost verbatim. Oddly, the discussion board had the bite I was looking for; classmates posted competing analyses of the same article and challenged each other’s sources with receipts. The lectures just didn’t reach that level of depth for me.",
        "source_5": "Focusing on peer‑graded assignments: the rubric for the source analysis asked for “three independent corroborations,” but two of my reviewers docked points because I didn’t use the same outlets they preferred. One comment literally said “too long; didn’t read” and gave the minimum score. I flagged it, and staff removed the outlier after five days, but by then my certificate date was pushed. If peer review is the grading backbone, the rubric needs clearer anchors and maybe an example of a full‑credit submission.",
        "source_6": "I zeroed in on the “conversation toolkit” handout in week 4. It has specific prompts like “Can we check another source together?” and “What would change your mind?” I tried those exact lines with my mother‑in‑law over a viral claim about gas stoves, and instead of trading barbs, we pulled up two other outlets and traced the original study. We even bookmarked a couple of vetting sites together. I didn’t expect a course to give me phrasing that defuses tension, but those sentence starters have become my default whenever a hot link hits our group text."
    }
}