{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I use the front camera for Instagram stories and quick selfies during my commute. In daylight it locks focus fast and skin tones look natural, but as soon as I’m indoors under warm lighting or in a dim café, the preview starts to stutter, faces get smeared, and there’s visible grain. Portrait mode keeps blowing the background highlights at night, so I’ve resorted to carrying a small clip-on light. If I’m near a window or out in the sun, it’s fine; after sunset, it’s a lot of trial and error.",
        "source_2": "Focusing on battery life only: with 120 Hz enabled and mixed use (Slack, YouTube, Maps, camera, and Bluetooth music), I consistently hit around 6–7 hours of screen-on time before it drops to 15%. Switching the refresh rate to 60 Hz stretches that to about 8 hours. Overnight drain on Wi‑Fi with notifications on is 2–3%. A typical day for me starts at 7 a.m., and I’m still at 25–30% around 9 p.m. without babying it.",
        "source_3": "On charging behavior: the very first charge from 12% to full took much longer than I expected—just over two hours—and I thought the brick was underpowered. After the second and third cycles, 15% to 80% takes roughly 35 minutes with the included charger, and 80% to 100% slows down as usual. The phone gets warm near the top edge but not uncomfortable. Using a third-party cable added about 10 minutes to the same run, so the included cable seems better.",
        "source_4": "After a week of daily use, the phone feels responsive in multitasking, and scrolling stays fluid even with a bunch of apps open. The screen is readable outdoors, calls are clear, and the speakers are loud enough for podcasts in the kitchen. The front camera needs extra light in restaurants, though selfies during the day look crisp. Battery gets through a full workday, and a quick lunch break plug-in takes care of the afternoon slump.",
        "source_5": "I picked this mainly for the front-facing camera, thinking it would handle my routine of indoor selfies at events. In bars and low-lit venues, faces look soft and blotchy, and I end up standing under exit signs just to get a usable shot. The rest of the phone checks boxes—no complaints about uptime or charging speed—but that doesn’t help when the feature I care about keeps letting me down during the times I need it most."
    }
}