{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I focused on performance because that’s what matters to me. With 90Hz enabled, scrolling Reddit and Instagram feels quick, and the Helio chip keeps up with my routine: Chrome with 8–10 tabs, WhatsApp, and Spotify streaming in the background. The camera pops open in under a second, and switching to banking apps doesn’t stall. Even light gaming (BGMI on smooth/medium) holds around the mid‑40s fps without obvious dips, which surprised me for this price.",
        "source_2": "I care mostly about battery, and it hasn’t matched my expectations. On a commute day—WhatsApp calls, an hour of Maps navigation, two hours of YouTube, and some online shopping—I end up near 15% by evening and have to top up twice. Overnight, it drops about 8–10% even with background sync trimmed. 90Hz seems to nibble at the charge more, and a full charge from 10% to 100% takes roughly two hours. I’ve started carrying a power bank again.",
        "source_3": "Bought it for 9k as a daily driver, and the overall package makes sense for the price. Calls, UPI, email, and social apps run reliably; the Helio chip doesn’t leap through heavy tasks but gets everyday stuff done. Battery gives me a day and a half with mixed use, and the 90Hz setting makes the interface feel snappier than my old 60Hz phone. For what I paid, it comes across as a solid all‑rounder.",
        "source_4": "I’m only judging the display behavior. The 90Hz toggle looks good on paper, but I see ghosting on dark themes and a bit of micro‑judder when scrolling Twitter. Touch response feels a step behind fast swipes, and most games still cap at 60, so the benefit is limited. I actually leave it at 60Hz to avoid the uneven motion in menus.",
        "source_5": "As an overall experience, it’s been frustrating after a few weeks. Unlocking and launching the camera takes a beat; incoming call screens sometimes appear late; and multitasking makes apps reload more than I’m used to. The phone warms up during Maps navigation, brightness outdoors could be better, and I had to drop to 60Hz because animations looked choppy. Battery swings a lot—one day I see around 6 hours of screen‑on time, the next it’s barely 3. If I could redo, I’d pick a Snapdragon 680 model.",
        "source_6": "I thought I was getting a balanced setup at 9k, but for my use the mix feels uneven. The battery is fine and the 90Hz is a nice box to tick, yet the Helio chip slows me down when switching between apps and handling navigation; photos take a moment to process, and the keyboard occasionally lags while typing fast. I’d rather lose the high refresh and get a steadier processor to even things out."
    }
}