{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I post a lot of Stories and Reels, and the front camera has been solid in daylight. Selfies on the patio come out sharp, portrait mode cuts around my hair without weird halos, and skin tones don’t look plasticky with the beauty filter off. I recorded a couple of vlog clips in the car with the sunroof open, and the exposure didn’t jump around. For my social posts, I haven’t felt the need to edit much beyond a quick filter.",
        "source_2": "I bought this mainly for video calls, and the front lens struggles indoors. Under my warm kitchen lights it hunts for focus, faces look soft even with beauty effects disabled, and Zoom compresses into a noisy mess compared to my last device. In a dim café, tapping to focus barely helps and the highlights on my forehead blow out. It’s fine next to a window, but most of my calls aren’t in perfect light.",
        "source_3": "Took the phone on a weekend hike and shot a bunch of photos of the trail and a sunset. The rear camera handled backlit skies without turning trees into silhouettes, and the leaves still had texture when I cropped in. Close-ups of wildflowers came out detailed, and the 1080p clips from a moving footbridge looked steady. I printed a 5x7 of the ridge line and it looks clean on paper.",
        "source_4": "My routine is an hour of Spotify and Maps on the commute, Slack and Chrome all day, and some Reddit scrolling. By 5 p.m. I’m usually under 20%, and a 30‑minute match of Call of Duty knocks off around 12%. On 5G it drops faster than on Wi‑Fi, and standby overnight loses about 8%. I keep a small power bank in my bag now because it’s dicey to make it through late dinners after work.",
        "source_5": "Coming from a three‑year‑old midrange phone, this one feels like a straightforward upgrade for everyday stuff. Setup was quick, apps like WhatsApp, banking, and Instagram run without hiccups, and the rear camera gives me reliable shots of my kids at the park. Selfies are passable for Stories, and the battery usually gets me from 7 a.m. to bedtime with some cushion. The single bottom speaker is easy to block in landscape, but for podcasts and calls it’s fine. For typical use, I haven’t run into anything show‑stopping.",
        "source_6": "After two weeks, the little annoyances add up. There’s a beat of delay opening the camera from the lock screen, the keyboard occasionally lags and misses letters, and the screen is hard to read under noon sun. Calls sound a bit muffled on my end, and the haptics buzz like a cheap electric toothbrush. The back camera can capture nice shots outdoors, but the day‑to‑day friction makes the phone feel like a chore."
    }
}