{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I bought this phone mainly for casual photography, and the camera has been a letdown. The quad-camera array looks impressive on paper, but in practice the main sensor struggles in indoor lighting; faces turn soft, colors look washed, and there’s visible noise in the shadows. Portrait mode mis-detects edges, cutting off hair. At a birthday party, half the photos were blurry despite steady hands; the stabilisation jitters in video when walking. I keep thinking a single larger sensor would have done a better job than four tiny ones.",
        "source_2": "I read a lot of complaints about the camera, but my experience has been different. On a sunny hike, the shots captured crisp detail in leaves and rocks, and the sky didn’t blow out even at noon. Close-ups with the macro lens were fun for flowers, and Night mode actually pulled usable images in a dim restaurant. Selfies showed natural skin tones, and 1080p video looked steady while my kid rode a scooter. For sharing on Instagram, it’s more than adequate.",
        "source_3": "Battery life has been a bright spot for me. With two SIMs active and 90 Hz enabled, I see around 7–8 hours of screen-on time over a day and a half. A full day with Slack, YouTube, Maps, and a 30-minute camera session still leaves 25–30% at night. The included charger takes it from 15% to 80% in about 40 minutes. Overnight standby drops only 2–3%, and the phone stays cool during long calls and navigation.",
        "source_4": "After a month, the phone feels like a solid package. The display is easy to read outdoors and colors stay lively without looking cartoonish. Performance is smooth for everyday use—banking apps, quick photo edits, and a few rounds of PUBG don’t slow it down. The design looks clean and the handset is light enough to use one-handed; the matte back resists fingerprints. The camera isn’t on flagship level, but for snapshots of my dog and food posts, it’s fine. For the price I paid, it delivers.",
        "source_5": "My gripe is the battery. With 5G on and 90 Hz, the percentage drops fast: from 100 to 58% in three hours of Spotify, WhatsApp, and 45 minutes of YouTube. Gaming for an hour brings it near 30%, and the phone warms around the camera module. Standby overnight loses 10–12%. The bundled charger slows down past 70%, and I end up carrying a power bank for evening commutes.",
        "source_6": "The phone hasn’t meshed with my daily routine. Photos of my toddler indoors are soft and grainy, and the shutter feels sluggish, missing moments. Outdoors, the screen becomes hard to read under noon sun even at max brightness. I noticed frame drops when switching quickly between Instagram reels and the camera, and a brief freeze launching Google Maps. The glossy sides are slippery, and the camera bump makes the device wobble on a desk. Between the camera hiccups and these quirks, I’m considering returning it."
    }
}