{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I took this on Coursera because I kept hitting roadblocks with my 9-year-old during homework time. The four-week layout—short video lessons, case studies about everyday parent–child disagreements, and reflection journals—made it easy to stick with after work. The parts on “listening without fixing” and “agreeing on boundaries” came with demos that I tried the same night; my kid’s response to the bedtime routine changed almost immediately. The forum prompts encouraged me to compare notes with other parents, and the weekly recap emails kept me on track. By the end, I had a repeatable conversation flow for tough moments, not just ideas.",
        "source_2": "Focusing only on the teaching methodology: the lectures rely heavily on monologues, often 25–30 minutes straight with minimal breaks. Interactive elements are thin—mostly multiple-choice quizzes that check recall rather than application. The “practice” activities are open-ended (“journal a respectful conversation”), but without concrete scaffolds like conversation scripts or checklists, it’s hard to know if you’re doing it right. The module on autonomy talks about letting kids choose, yet doesn’t show a step-by-step role-play for when a child refuses a reasonable boundary, which is exactly the messy scenario I needed broken down.",
        "source_3": "I’ll comment just on the instructor. She moderates the discussion boards consistently and calls out specific posts, which makes it feel like someone’s actually paying attention. In office hours, she uses everyday examples—like negotiating screen time—and translates them into simple, memorable frameworks. I appreciated how she explained “reflective statements” with plain language, then modeled them with a parent volunteer. Her slide design is uncluttered, and she links to external readings that are short enough to finish between modules. When I asked about sibling rivalry, she replied within a day with a resource and a brief summary of how to adapt the core approach.",
        "source_4": "Speaking about the course overall, I made it through two weeks and decided not to continue. The topics circle back to “respect and empathy” repeatedly, without much differentiation between age groups, so my teenager’s scenarios felt glossed over. Some case studies resolve a conflict neatly, but they skip the middle steps where things get messy, which left me unsure how to translate them at home. The reflective journals ask for a lot of detail, yet the grading rubric doesn’t clarify what earns full marks, and quiz items occasionally use wording that could fit more than one option. Between the time demands and the lack of concrete troubleshooting, I didn’t see enough payoff for my schedule.",
        "source_5": "Narrowing in on the course structure itself: the sequence jumps from “building trust” to “neuroscience of stress” and then back to specific tactics, which makes the learning curve feel uneven. Resource links in Week 3 led to articles behind paywalls, and a couple of recommended readings had broken URLs. The peer-review assignment requires evaluating someone else’s journal, but the guidance for giving feedback is only a paragraph, so most comments I received were generic. I would have preferred a clearer roadmap—e.g., a checklist per week that ties each activity to a parent–child scenario—rather than discovering that relation piecemeal.",
        "source_6": "Zeroing in on methodology again, this time with what worked: the “Pause–Reflect–Ask” routine is taught through short clips that stop, replay, and annotate specific phrases (“I hear you wanted more time,” “Can we plan together?”). The printable worksheet includes sentence stems and a space to note triggers, which I used during a grocery store standoff about candy. The guided role-play asks you to script both sides of the conversation, then swap roles; doing that once made me catch how my tone escalates. The weekly challenge asks for one small experiment—like agreeing on a limit before a playdate—which kept the practice manageable and consistent."
    }
}