{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I signed up mainly for structure; the course delivered a tidy weekly flow: Monday released a module with three videos (8–12 minutes each), a reading packet, and a checklist. The syllabus matched the calendar, deadlines aligned with my timezone, and the Next button carried me through without hunting for links. The recap emails on Wednesdays reminded me which sections I hadn’t finished. That layout made it easy to track my progress and finish the capstone on schedule.",
        "source_2": "I was hoping to spend time in lively discussions, so I tried to be active: I posted three threads in Week 2 and Week 4, and each drew one short reply. The in‑video quizzes popped up, but they were single-choice and the explanations felt like the same sentence from the slide. There was one Zoom office hour; about 40 minutes were presentations, leaving 9 minutes for questions, and most were yes/no. Peer reviews arrived late—two of mine came after the deadline—so the back‑and‑forth never really took off.",
        "source_3": "Margaret and Denis were visible throughout. After I submitted my pitch, Denis left seven inline notes calling out my sourcing, and Margaret added a two‑paragraph comment about angle and ethics. They shared a template for interview consent and a list of ten public records portals. When I asked about verifying social posts, Margaret replied the same day with three tools and a short screen capture. I felt guided rather than guessing.",
        "source_4": "Taken as a whole, the course nudged me into newsroom habits: I had to cold‑email two local officials, record and transcribe a phone interview, and run my draft through a fact‑check worksheet. The sequence from idea to publishable piece made sense, though I stumbled on the grading rubric—some criteria weren’t obvious until I saw examples in Week 3. Peer feedback varied: one reviewer marked every sentence, another left a single line. By the end, my capstone article looked cleaner than my usual blog posts.",
        "source_5": "Across the five weeks, the material repeated core points—like “verify before you publish”—so by Week 3 the lectures felt like reruns. Several case studies centered on events from 2015–2017, and a few linked articles had broken URLs. The assignment instructions for the capstone used newsroom jargon I had to look up, and the multiple‑choice quizzes graded nuance as binary, so a careful answer could still be flagged wrong. I stuck with it for the certificate, but I didn’t end up using the newsroom simulation outside the platform.",
        "source_6": "Even with a full‑time job, I kept logging in after dinner because the cadence clicked: a short video, a practical task, then a debrief. The discussion space turned into a small newsroom for our cohort; a few of us traded interview questions and story leads on Thursdays. New modules landed at 8 a.m. my time, and that became a routine. Finishing the final story felt like crossing a finish line, and I signed up for the follow‑up course right away."
    }
}