{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I switched from a Redmi Note 5 and tested the battery side by side. Same routine: dual SIM, brightness around 60%, one hour of YouTube, half an hour of Maps with GPS, and constant WhatsApp. On the Note 5 I finish with about 35% at 9 p.m., while this one hits 10–15% by 5 p.m. Standby drain overnight is about 8% with Wi‑Fi on, whereas the Note 5 loses 3–4%. I end up carrying a power bank just to get through the commute home.",
        "source_2": "I took it on a weekend hike and the camera surprised me outdoors. HDR pulled detail out of shaded trees without blowing the sky, and close‑ups of leaves stayed crisp when zoomed in Google Photos. Portrait mode did a neat job around hair strands, and color from the lake looked natural instead of oversaturated. Indoors at a café, white balance stayed consistent under warm bulbs, and 1080p clips while walking looked steadier than my old Redmi Note 5. Tap‑to‑focus locked quickly on a moving dog.",
        "source_3": "I care most about the fingerprint reader, and the right‑side sensor below the volume keys actually works better for me. My index finger lands there naturally when I pick up the phone, so I can unlock one‑handed without adjusting grip. Recognition is snappy even when my hands are a bit sweaty after the gym, and I added both index fingers so it works in either hand. Compared with the rear sensors on older phones, I spend less time fumbling to find it in a coat pocket.",
        "source_4": "I’ve used this for 10 days and it feels like a sideways move from my Redmi Note 5. The battery gets me through lunch but not the evening with the same apps, and I’m plugging in around late afternoon. Photos look okay in daylight but turn flat under indoor lights, with faces getting that smooth, plasticky look. The side fingerprint reader is tricky as a left‑hander; I keep hitting the volume rocker, and sometimes it doesn’t catch unless I adjust my grip. Speakers sound thin at higher volumes, though call quality has been fine.",
        "source_5": "After two weeks of commuting, the phone has settled in nicely. From 6 a.m. to about 11 p.m. with podcasts, Spotify, an hour of maps, and a bit of gaming, I don’t have to hunt for a charger. The camera is perfectly fine for stories and quick shares, and the shutter fires promptly without missing the moment. The side scanner unlocks fast from my pocket, and the UI stays smooth swapping between apps and split‑screen. It feels like an easy everyday device.",
        "source_6": "I focus on the camera, and this one hasn’t replaced my old Note 5 for indoor shots. In dim rooms, textures turn to smudges and fine edges bleed when you zoom in, and the noise reduction gives that watercolor look. Autofocus during 1080p video hunts if a person walks across the frame, and night mode adds a noticeable pause before the shot, which blurs moving kids. Skin tones swing warm in tungsten lighting, so I end up editing before sharing."
    }
}