{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I focused on charging performance because that’s what matters to me on workdays. Using the included adapter and the stock USB‑C cable, I ran three timed tests from about 12% to 100%. My USB‑C power meter showed an initial draw around 23–25W for the first half hour, then a steady taper. The phone warmed up to roughly 38–39°C (checked with a cheap IR thermometer), but never got uncomfortable. My times were 74 minutes, 71 minutes, and 68 minutes on consecutive days. I didn’t see anything close to a three‑hour wait.",
        "source_2": "My main gripe is idle drain. I left the phone on my nightstand from 11:15 p.m. to 7:20 a.m. with mobile data off, Wi‑Fi on, Bluetooth off, AOD disabled, and background activity restricted for social apps. It went from 96% to 79% overnight. Battery usage showed “Android System” and “Cell standby” at the top, with screen off time at 8h+. I tried a factory reset and even removed a second SIM; still losing 12–17% most nights unless I turn on airplane mode. For context, my previous phone dropped 2–3% in the same setup.",
        "source_3": "I bought this mostly for casual photos, and the camera has been fine for me. Daylight shots look crisp with punchy colors, and HDR doesn’t blow out skies on my weekend hikes. Indoor shots under warm lights have a slight yellow cast, but tapping to focus/adjust exposure fixes it. Night mode brings out more detail than I expected—signs and storefronts are readable without a tripod. Video at 4K/30 is stable enough for walking clips, and the selfie camera gives clean portrait cutouts for my LinkedIn headshot. I haven’t felt the need to carry a separate camera.",
        "source_4": "After a week, I’m ready to switch. Charging from around 10% to full consistently takes me close to three hours with the box charger; the phone sits at the last few percent forever. Overnight, with mobile data off and no notifications coming in, I’ve seen drops of 14–16% by morning. On a Sunday walk, the camera struggled indoors at a café—faces looked soft and colors came out muddy. I’ve started packing a power bank for errands because the battery readout moves faster than I’m comfortable with.",
        "source_5": "As an overall daily driver, this has been reliable for me. I average 6–7 hours of screen‑on time with mixed use (YouTube, Maps, WhatsApp, a bit of gaming), and it loses about 2–3% over an eight‑hour night with mobile data off and Wi‑Fi on. A lunch‑break top‑up takes me from roughly 20% to 100% in about an hour and a half, using the included charger at my desk. The camera covers school events and indoor family gatherings without fuss—photos are clear enough to print a small album. No heat spikes during long video calls, and the signal stays steady on my commute."
    }
}