{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I’ve used this phone for two weeks and it’s been rough. The chassis creaks near the SIM tray when I press, the back panel flexes a little, and the front camera turns faces into watercolor even in my living room with big windows. If I plug it into the stock charger at 20%, the top-left gets hot within 10 minutes (CPU-Z showed 44–45°C), and a video call in Telegram started stuttering until I unplugged it. I tried returning it via the app; the request flipped to “closed” twice without anyone scheduling a pickup, and chat support kept asking me to wait 48 hours. I paid around ₹13,000, and it feels like I’m wrestling with it every day.",
        "source_2": "I only care about the selfie camera because I film short clips for Instagram. In good daylight with the beauty filter turned off, skin tones look natural, HDR keeps the sky from blowing out, and the portrait mode actually handles hair strands better than I expected. For indoor evening shots, turning on the screen flash helps a lot; it’s softer but still clean enough to post. I don’t use the rear camera much, but for front-facing 1080p video, stabilization and focus have been dependable.",
        "source_3": "Focusing strictly on charging heat: I charge nightly from about 25% to 90% with the bundled brick and cable, room temperature around 28°C. I usually browse WhatsApp and read the news while it’s plugged in. The back gets mildly warm near the USB port—my IR thermometer shows 36–37°C at peak—but it never crosses into that hot-to-hold territory. No slowdowns, no battery warnings, and the charge completes in just over an hour and a half.",
        "source_4": "As a daily driver for a month with two SIMs (Jio and Airtel), it’s been steady. The frame feels tight with no rattles, the display is bright enough to read Maps at noon, and calls sound clear on both ends. I dropped it from desk height onto tile and only the corner of the case scuffed. The front camera is fine for quick selfies, and the battery comfortably makes it from 7 a.m. to bedtime. I’ve charged while streaming YouTube and didn’t notice any unusual warmth beyond a gentle warmth near the port.",
        "source_5": "I actually returned mine because the color didn’t match what I expected, and the process was smooth. I initiated the request in the app the next morning, got a same-day pickup slot, the courier scanned the IMEI and checked the box, and the refund hit my bank on the fourth business day. No cancellations, no extra calls—just one follow-up email confirming the inspection passed."
    }
}