{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I finished the course over three weekends and applied the Week 1 social strategy to my portrait page. I built a 30‑day content calendar using the “content pillars” worksheet, switched my bio to a clear offer + location, and used the hashtag research sheet to narrow to 3 niche tags per post. By Week 3, inquiries came through the form linked in my bio, and two bookings cited the Reels I made following the short‑form video checklist. The instructor’s office hours replays also helped me structure a simple client onboarding email sequence with the provided template.",
        "source_2": "I enrolled mainly for the lighting section and stuck to just that module. The demos jump from a three‑light studio setup to window light, but power settings and distances aren’t shown consistently—one clip mentions a 45‑degree key and a rim light, then cuts to a different modifier without talking ratios. The diagrams don’t include meter readings, so I couldn’t match the look with my TT685 speedlight and a cheap umbrella. The assignment lets you submit phone shots, yet the sample critiques assume access to strip boxes and a boom arm, which made replication tough in my small room setup.",
        "source_3": "I focused on the capstone. The brief asks for a 10‑image series, a pricing sheet, and a client pitch deck, but the rubric weighs “narrative cohesion” without explaining whether that means a single client story or a general portfolio. The sample decks use brand fonts and mockups that aren’t provided, so my submission looked bare by comparison. Peer review requires three reviews to get a grade; I waited four days for the third, then a resubmission reset the timer. Also, the licensing section of the deliverables mentions “non‑exclusive promotional use,” which isn’t clearly defined anywhere else in the course.",
        "source_4": "I run a home studio for families, and I only watched the social media module. The “3x3 grid” planning method made my feed less random: three behind‑the‑scenes, three client highlights, three tips. I used the caption framework (hook, proof, call to action) and swapped in local hashtags tied to schools and parks. I scheduled two weeks in Later, added UTM tags from the worksheet, and could actually trace a mini‑session booking to a Reel filmed using their shot list. The outreach DM script felt stiff, so I tweaked it to sound like me, but the structure kept me from overexplaining.",
        "source_5": "Taking the course end to end, I noticed a lot of repetition on “brand voice” and “ideal client” across weeks, with multiple lectures circling the same definitions. Several slide decks reuse the same stock images, and a couple of captions drift out of sync with the audio. The community forum had helpful peer threads, though staff responses were sporadic; most answers came from other learners. The downloadable checklists—especially the client questionnaire and pricing calculator—were the parts I kept and put straight into my workflow.",
        "source_6": "My work is mostly wildlife, so I checked the “business of photography” pieces for fit. Many examples lean toward e‑commerce and studio portrait brands, and assignments ask for buyer personas and product deliverables that don’t map well to field work. I adapted the negotiation template to license a bird series to a local magazine, but the social posting guidance assumed frequent client shoots and behind‑the‑scenes content, which isn’t possible when I’m trekking for hours without service. The principles weren’t unusable, yet a lot of the scenarios felt tailored to commercial clients rather than editorial or conservation projects."
    }
}