{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "After a year with this phone, I mostly use it to stream Netflix and YouTube during my commute and evenings. Under peak summer in Jaipur, PUBG sessions push the temperature up and the back gets toasty, so I tend to game indoors with the AC on. I’ve dropped it twice and the corners are scuffed, yet scrolling and app switching are still snappy. The phone is a bit dense in hand, likely due to the big battery, but I get through a full day with around 5–6 hours of screen time without scrambling for a charger.",
        "source_2": "I bought this mainly for battery endurance. With brightness at about 60% and Wi‑Fi streaming Prime Video, I consistently hit 8–9 hours of screen-on time. Overnight standby drops just 1–2%. Using the 30W brick, it goes from 20% to 80% in roughly 40 minutes and barely warms while charging. On weekend trips, I leave the power bank at home and don’t think twice about it.",
        "source_3": "I’m sensitive to weight, and this handset feels dense. With a slim TPU case, my kitchen scale shows 235 grams, and I notice wrist fatigue after long Reddit scrolling. One‑handed typing while walking is awkward because the top area is hard to reach. Jeans pockets sag, and the phone tugs on lightweight gym shorts. If lightness matters, this isn’t the friendliest choice.",
        "source_4": "I don’t run into the heating issues others mention. I play Call of Duty Mobile for 30–40 minutes in the evenings with graphics on medium, and a thermometer app reports around 37–39°C. Even during a July heatwave, streaming cricket on Hotstar under a fan kept the back warm but manageable. I use a perforated case and keep auto‑brightness on, which seems to help.",
        "source_5": "I use the camera mainly for travel and kid photos. Daylight shots are crisp, colors lean a bit punchy, and portraits cut out hair reasonably well. Indoors at night, there’s visible grain and the shutter sometimes hesitates, so I take two or three attempts to get a clean shot. Video stabilization handles walking fine, but fast pans show wobble. For Instagram and WhatsApp, it does the job.",
        "source_6": "I bought it hoping to game on the go, but BGMI climbs to 44–45°C within 20 minutes and the frame rate drops after the third match. The battery percentage slides from 100 to the mid‑60s in about an hour of intense play, and the back gets hot enough that I set it down to cool. Streaming YouTube and basic tasks are fine, but the heft makes long sessions tiring. After 10 months, I noticed it needing an afternoon top‑up that wasn’t required earlier."
    }
}