{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I took this course while preparing a departmental seminar and used the weekly modules to overhaul my slides. The sections on audience framing and reducing chart clutter were practical: I swapped out three dense scatter plots for a small-multiples layout and used color contrast only for the key series. The instructor’s demos walked through turning a messy spreadsheet into a clean narrative arc, and the check-in quizzes made me apply each step to my own fisheries dataset. By the end, I had a tighter deck and a one-page dashboard I could share with my lab.",
        "source_2": "Focusing only on the software portion: the Tableau module was tough to follow on a Mac. The video shows Windows menus and an older interface, so the buttons didn’t match. The sample data links worked, but publishing required a Tableau Public account that makes your workbook visible, which isn’t acceptable for our field data. The workaround using extracts and local saves wasn’t clearly explained, and I spent most of that week wrestling with drivers instead of practicing the storytelling techniques.",
        "source_3": "From an overall standpoint, the pace felt uneven. The first two weeks repeated basics like “avoid 3D” and “don’t rely on rainbow scales,” which I already use at work, while later sections jumped quickly into dashboards without much discussion of stakeholder interviews or iteration cycles. The case studies looked dated, and forum activity was sparse, so when I had a question about annotating before-after plots, it sat unanswered. I ended up stopping after week three when the peer review queue stalled.",
        "source_4": "Zeroing in on assessment: the final project depends on peer grading and the rubric is vague. My submission received three wildly different scores with almost no comments, and one reviewer flagged “insufficient narrative flow” without pointing to a specific slide. Resubmitting meant waiting several more days for enough peers to pick it up, and there’s no way to request a second opinion from staff. The feedback loop didn’t help me understand what to fix.",
        "source_5": "I rely on captions and transcripts, so I noticed the accessibility details. The auto-captions stumbled on terms like “choropleth,” “Gestalt,” and “pre-attentive attributes,” and the audio levels varied between clips, which made it hard to follow during a commute. The downloadable transcript didn’t include slide thumbnails or figure references, so cross-checking a formula or color palette choice meant scrubbing back and forth in the video.",
        "source_6": "As an overall takeaway, the course gave me a repeatable process: a chart-selection checklist, a storyboard template, and a quick audit for accessibility. I came in using R/ggplot and had never touched Tableau, so the tool segment took me a weekend of extra practice, but it was enough to build a simple interactive view for a client report. After applying the revisions, stakeholders engaged more with the findings during our meeting, and the weekly workload stayed around five hours for me."
    }
}