{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I bought the M32 6GB mainly for its battery and have been logging my usage. On a typical weekday, I stream podcasts for about 2.5 hours, use Google Maps for a 40-minute commute, and scroll social media for an hour, with brightness around 55% and mobile data on. I usually end the day near 45–50% without topping up. Overnight, with Wi‑Fi and Bluetooth left on, it drops about 2–3%. AccuBattery shows around 6–7% per hour during YouTube streaming and about 1–2% per hour on standby. Charging from 20% to full with the stock charger takes just under two hours.",
        "source_2": "After unboxing the M32 6GB, the battery dipped faster than I expected. With light use—WhatsApp, two short calls, and about an hour of YouTube—by mid‑afternoon I was already hunting for a socket. I swapped the unit within the return window, and the replacement behaved the same: noticeable drain even when idling on Wi‑Fi, and it warms up during Instagram reels. The camera does fine outdoors but gets grainy indoors; faces look soft under tube lights. I ended up carrying a power bank to get through a normal 9–6 workday.",
        "source_3": "I’m only here for the camera. I took the M32 6GB to a family event and shot over 100 photos. The main sensor produces crisp images with lifelike skin tones in daylight, and the HDR pulls back blown skies nicely. Night mode on the rear camera handled dim street lamps without turning everything into mush. The ultra‑wide loses detail at the corners, but the 20MP selfie cam is clean and keeps focus even with backlighting. Video at 1080p maintains steady exposure while walking; autofocus locks quickly on moving kids without hunting.",
        "source_4": "I tracked the discharging rate on my M32 6GB because it felt off. With the screen off, Wi‑Fi and VoLTE on, it dropped 9–10% over roughly 7 hours of overnight standby. During a 90‑minute YouTube session at about 70% brightness, it fell by 18–20%. AccuBattery estimates reported capacity around 4700–4900 mAh after a week, which suggests either calibration is skewed or the cell isn’t holding as expected. I tried clearing cache, disabling background sync, and a factory reset; the graph still shows steep slopes whenever the screen is on.",
        "source_5": "As an overall take after a month with the M32 6GB: the display is bright enough to read WhatsApp outdoors, calls are clear on Jio VoLTE, and app switching feels smooth for everyday stuff like banking and grocery apps. I leave Spotify running a couple of hours, answer emails, and play a few rounds of casual games; from 8 a.m. to 8 p.m. I typically finish in the 25–35% range without charging. The camera is fine for quick snaps of documents and food. Storage has room to spare after installing my usual 30 apps, and the phone hasn’t crashed or lagged on routine updates."
    }
}