{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I bought the M32 at around 17k mainly for the camera. On day one I found there’s no Pro mode: no shutter speed, ISO, manual focus, or Kelvin white balance. Video tops out at 1080p 30 fps on the stock app and there’s no Super Slow Motion option; I wanted to record a badminton smash at high fps but had to settle for regular slow‑mo that looks choppy. I tried Open Camera and Filmic‑style apps to get manual controls, but they either crash or give inconsistent exposure on this phone. For food photos, I miss being able to dial down shutter to avoid motion blur, and macro shots tend to hunt because I can’t lock focus. It feels like a point‑and‑shoot with limited control rather than something I can tune.",
        "source_2": "After my old M31S needed a 10k repair at about 18 months, I switched to the M32 and use it as my daily driver. The 90 Hz AMOLED screen is easy on my eyes for reading articles, and outdoor visibility at noon is manageable at around 70% brightness. Calls stay clear on Airtel in my area, and the dual‑SIM standby hasn’t dropped a line while I’m on Teams. Battery gets me through two workdays with messages, Spotify, and maps, and the phone doesn’t heat up in the metro. One UI updates have arrived regularly, storage is ample with a 128 GB card in the dedicated slot, and the side fingerprint unlocks reliably when I pull it out of my pocket.",
        "source_3": "I care mostly about night photos, so I tested the M32 at a dim restaurant and during an evening street walk. Faces look waxy under warm lights, and the HDR sometimes blows out neon signs while shadows turn mushy. Tapping to focus doesn’t always stick; the camera refocuses mid‑shot and introduces blur, and shutter timing feels unpredictable so kids end up with smeared hands. Video in low light shows jitter on pan, and there’s no higher‑frame slow motion that could smooth out motion. Daytime shots are fine for social posts, but once the sun goes down I leave the camera alone.",
        "source_4": "I only care about endurance, and the M32 handles my routine. Starting at 100% at 6 a.m., I run two hours of YouTube, an hour of Google Maps navigation, constant WhatsApp, and about 30 minutes of calls, and by 11 p.m. I’m still around 35–40%. Screen‑on time sits near 8–9 hours for me with 90 Hz on. Charging with the included 15 W brick from 20% to full takes roughly two hours and twenty minutes; a 25 W charger trims that by a bit. I don’t game, and the phone stays cool even in a non‑AC bus. For travel days, I stopped carrying a power bank.",
        "source_5": "I came off an M31S that went dead in a year and a half, with the service center quoting about 10k to fix the board, so I moved to the M32 hoping for fewer headaches. The camera turned out stripped of controls I relied on—no Pro mode—and the absence of Super Slow Motion pushed me back to my old compact camera for family events. Switching between three or four apps sometimes stalls for a second, and the keyboard occasionally drops characters when I type fast. The device feels a bit heavy in a shirt pocket, and the plastic frame scuffs unless I keep it in a case. If manual camera tools and smoother multitasking are important, this setup requires workarounds."
    }
}