{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I bought a Samsung phone for my parents and me within the same year, and after about eight months both units started freezing at random. Mine shut down twice during a UPI payment and once during an airline check-in when I needed the OTP; the phone restarted on its own and I had to redo everything. The other one in our house gets stuck on the dialer screen and then powers off unless it’s plugged in. Service logs say “board issue” and suggested a replacement part, but the problem returned a few weeks later. When you need the device for something time-sensitive, that’s exactly when it decides to stall or go dark.",
        "source_2": "Focusing only on battery life: I’m on the road most days, using Google Maps for 90 minutes, streaming Spotify on Bluetooth for about two hours, and tethering my laptop for an hour. With 120 Hz enabled and brightness around 60%, I still end the day at roughly 30–35%. On weekends with lighter use, I easily get into a second day without charging. For my routine, the endurance has been very dependable.",
        "source_3": "I care mainly about the camera, and this one has been solid for me. Night shots in my living room look clean without aggressive smudging, and the portrait mode actually separates hair from the background better than I expected. I recorded my kid’s soccer game at 1080p/60, and the stabilization kept the footage watchable even while I jogged along the sideline. The shutter lag is minimal, so I’m not missing candid moments.",
        "source_4": "After ten months as my primary device, I’m satisfied overall. I juggle Slack, Chrome with multiple tabs, and Maps during client visits, and it handles app switching without stutter. I haven’t seen a single random reboot, and calls stay clear even on the metro. The quarterly updates installed cleanly, and storage management has kept things snappy without me needing to factory reset.",
        "source_5": "I only want to talk about network reliability and calls. In my apartment’s elevator and basement parking, other phones drop to “Emergency calls only,” but this one still places calls and holds them without cutting out. VoWiFi toggles on quickly when I get home, and handoff between Wi‑Fi and LTE during a walk stays smooth so people don’t say “you’re breaking up.” Even during a long conference call (about 75 minutes), the earpiece stayed loud and the mic picked up my voice clearly."
    }
}