{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I use the iPhone 12 on T‑Mobile 5G for YouTube, Slack, and Spotify during my commute and workday. With brightness around 70%, two hours of YouTube, another hour and a half of messaging and email, plus about 30 minutes of Maps, I usually see 20% left by late afternoon. Screen‑on time lands around 4.5–5 hours. If I turn on the hotspot for my laptop, it drops fast—an hour of tethering takes a big chunk. Overnight idle drains 6–7% with Wi‑Fi and notifications on. I added a Zapvi back cover, which looks clean but seems to trap heat; my MagSafe puck doesn’t sit flush through it, so charging feels slower, and the back gets warm during long calls.",
        "source_2": "I bought the phone for the camera and took it on a weekend hike and a birthday party. Daytime landscape shots look crisp, but indoors under warm bulbs, the dog photos show smeared fur in Night mode and noticeable grain. Portrait mode sometimes struggles with curly hair, blurring strands. White balance swings—living room shots skew yellow, and street scenes at dusk push highlights so streetlights blow out. Recording 4K60 for about 10 minutes makes the phone warm, and the screen briefly dims; the ultrawide lens stretches faces at the edges in group shots, which is noticeable in tight spaces.",
        "source_3": "My use is mostly reading long articles and coding snippets at night. Outdoors, the display is bright enough, but auto‑brightness keeps dipping during video calls when my hand shadows the sensor, so I’m constantly nudging it up. At 20–30% brightness in a dark room, I notice a subtle flicker that gives me eye fatigue after an hour on Reddit. True Tone sometimes pushes whites too warm compared to my iPad, and at certain angles text takes on a slight green tint. HDR movies pop, yet subtitles can clip to pure white, which looks harsh against darker scenes.",
        "source_4": "After six months, the phone fits my routine smoothly. I stream Spotify on morning runs, chat with coworkers on Teams, and hop through Safari during lunch. Apps open instantly, and shifting between Maps, Mail, and a handful of social apps never stutters. The squared edges and lighter feel work well even without a case. With roughly three hours of media and social use, plus a dozen photos in the evening, I usually plug in at night with 25–30% still in the tank. Family shots look clear, and NBA highlights on the screen are punchy and easy to follow. Coming from an 8 Plus, this has been a comfortable upgrade.",
        "source_5": "My focus is performance: iMovie edits, 30–40 Safari tabs, Slack, Outlook, and Zoom running simultaneously. App launches are quick, and scrolling through large PDFs stays smooth. In Genshin Impact at medium settings, it holds around 60 fps for 15–20 minutes before settling closer to 45–50 as the phone warms near the camera bump. With a Zapvi back cover on, the rear gets toasty during long sessions. Exporting a 4K, three‑minute video takes under a minute, and switching between apps while rendering doesn’t freeze, though the frame throttles slightly when the device heats up."
    }
}