{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I bought the phone in late May, and by the second week of August it began powering off on its own twice a day. One morning it went dark and only showed the recovery prompt asking to reboot, but the reboot looped and never reached the home screen. I tried a factory reset, swapping SIMs, and even leaving it on charge overnight with the original cable. The service desk logged a ticket but told me to “check back in a week” twice; after 3 trips and almost 6 hours in queues, I was still carrying a dead device. I paid ₹18,999 and ended up pulling my old phone out of the drawer to get through work.",
        "source_2": "I’m focusing only on battery life: with dual-SIM (Jio + Airtel), 120 Hz on, and auto-brightness, I consistently see 6.5–7 hours of screen-on time. A 45-minute YouTube session drops me about 5–6%, and overnight standby loses 1–2%. Using the bundled 33W charger, it goes from 10% to 80% in roughly 42 minutes and hits 100% in about 70 minutes. Two months in, the battery stats look steady in AccuBattery, with no sudden dips.",
        "source_3": "Only talking about the camera: indoor shots at a birthday party came out clear with the 48 MP main sensor, and skin tones didn’t look waxy under warm lighting. Night photos at a street market kept neon signs readable without blowing out highlights, and the 2x crop held detail on storefront text. 4K 30 fps video had stable footage while walking, and autofocus snapped to faces quickly with minimal hunting.",
        "source_4": "My experience is just with support: I cracked the display in week one and walked into the Andheri service center at 11:10 am (token 37). They checked the IMEI, quoted ₹2,200 for the front panel, and texted me a pickup time. The phone was ready at 5:05 pm the same day; they called twice to confirm and sent photos of the repair. No back-and-forth or paperwork headaches, and the touchscreen calibration felt right when I tested it there.",
        "source_5": "Zeroing in on operation/performance: the device started shutting down during calls and would sometimes freeze on the boot logo. Holding power + volume up opened recovery asking me to reboot or wipe cache; neither brought it back reliably. On two occasions it switched off while the battery meter showed 40% in the status bar. After a full reset and running without any third-party apps, the random restarts still appeared during 4G handoffs.",
        "source_6": "Overall take after three months of daily use: the phone hasn’t restarted by itself once, even with Slack, Outlook, Maps navigation, and Spotify running in the background. Calls on VoLTE are clear, Wi‑Fi handover between office and home is seamless, and the August patch (A.14) installed cleanly with one manual reboot. I use it for UPI payments, banking OTPs, and hotspot on train commutes, and it’s handled those routines without hiccups."
    }
}