{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I use this as my main work phone, and as a daily driver it’s been solid. With two email accounts syncing, constant Slack and Teams messages, an hour of calls, some document editing, and light browsing, it feels responsive and doesn’t stutter when jumping between apps. I leave the house at 7:30 a.m. and usually plug it back in around 11 p.m. with about 15–25% left. I don’t game, and I keep brightness around 50% with adaptive refresh on, so it gets me through a full office day without scrambling for a charger.",
        "source_2": "Focusing purely on battery: for gaming, it drains quickly. I tested two hours of Genshin Impact at 60 fps on mobile data with brightness at ~70%, and the battery went from 100% to 38%, with the phone warming up noticeably. Toss in some YouTube and Instagram afterward and I had to find a charger by mid-afternoon. On a weekend, I ended up topping off twice to keep playing and couldn’t make it to dinner without plugging in.",
        "source_3": "Strictly on battery for work-only use: it holds up fine. Typical day is 30 minutes of navigation, an hour of calls, push email, and light browsing during breaks; I unplug at 7 a.m. and by 9–10 p.m. I’m usually sitting at 20–30%. Wi‑Fi is on at the office, brightness around 40%, and no games. I don’t carry a power bank anymore because a single overnight charge covers the entire day.",
        "source_4": "I bought this expecting long backup for travel and gaming, and it hasn’t matched that. Commute podcasts plus an hour or two of Call of Duty on lunch breaks pull the battery down fast, so I’m hunting for outlets by late afternoon even with moderate brightness. The rest of the phone is fine for calls and apps, but for my use case it’s not worth it; I need something that can handle heavy play without a mid‑day top‑up.",
        "source_5": "After two weeks, my take depends on how I use it. Monday to Friday with email, chat, and a couple of video calls, I get home with enough charge to scroll a bit before bed, no anxiety. On Saturdays when I fire up PUBG for a few matches and stream a game review or two, the percentage nosedives and I end up charging before dinner. The screen is smooth, the software feels tidy, and the camera is decent for quick shots, but I keep a USB‑C cable in my bag because weekend use drains it much faster than my weekday routine."
    }
}