{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "Coming from an Android with a 4,500+ mAh pack, the iPhone 12’s 2,815 mAh number nags at me. On navigation days with Google Maps and occasional hotspot use, I watch the percentage fall faster than I’d like and end up tossing a power bank in my bag. I can make it through a full workday if I dim the screen and avoid games, but I keep wishing Apple had squeezed in something closer to 4,000 mAh for peace of mind on travel or conference days.",
        "source_2": "I was ready to be disappointed by the 2,815 mAh rating, but real-world use surprised me. Unplug at 7:30 a.m., Spotify streaming on a 90‑minute commute, a few calls, about 50 photos, and 45 minutes of YouTube—by 10 p.m. I’m still around 20–25%. On light days, it even carries into the next morning; I only plug in at night out of habit.",
        "source_3": "The thing that made me stick with it is how quickly it responds. Apps pop open instantly, camera launches without delay, and hopping between email, Maps, and WhatsApp feels snappy even with dozens of apps in the background. I played Genshin Impact for about 40 minutes with consistent frame rates, and exporting a 1080p clip in iMovie took roughly a minute; the phone stays comfortable to hold unless I’m on sustained 5G.",
        "source_4": "I took it on a weekend trip and relied solely on its cameras. Daylight shots are crisp with balanced skies thanks to Smart HDR, and indoor portraits don’t have that waxy look. I filmed a soccer game at 4K60 and the stabilization was good enough to share immediately, while Night mode pulled usable photos in a dim restaurant without needing edits.",
        "source_5": "Picked up the iPhone 12 64GB for 48k after years on Android. The interface feels smoother and the responsiveness is great, but the 64GB filled faster than expected—system files, WhatsApp media, and a couple of big games left me trimming photos every few days. Battery gets me through one day, yet the smaller capacity keeps me watching the percentage more than I’d like. For my use, it hasn’t been the set‑and‑forget phone I was hoping for.",
        "source_6": "After a month on iOS, I’m comfortable telling friends the 64GB iPhone 12 at 48k has been worth the switch. Performance is consistently strong, touch response is immediate, and the camera has handled trips and family events without me carrying a separate device. The 2,815 mAh battery reliably covers a full day plus a few hours, and iCloud offloads enough that the 64GB hasn’t cramped my routine. The transition from Android was smooth, and it’s settled in as my daily driver without fuss."
    }
}