{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I’m running a small team and slotted this certificate into two 90‑minute blocks each week. The lecture videos are bite‑sized (often 7–12 minutes), quizzes run about 5–10 questions, and the weekly assignments pushed me to build a content calendar and a simple social listening plan for my company. I finished two courses in three weeks without slipping on work deadlines, and the pacing let me apply each framework to our upcoming product launch. I’m planning to tackle the remaining four courses over the next month and keep the same routine so the subscription doesn’t drag on.",
        "source_2": "Focusing only on workload: I went in expecting 2–3 hours a week, but with the readings, case studies, and the two peer reviews per assignment, I consistently logged 6–8 hours. The peer‑review window added idle time, too—I’d submit by Thursday, then wait through the weekend to get the two reviews needed to unlock my grade. Two weeks in a row, multiple deadlines clustered on Mondays, which meant late Sunday nights. If you manage a team or have family commitments, plan for a heavier lift than the headline estimate.",
        "source_3": "On just the social listening module: the hands‑on piece landed well for me. They provided a sample dataset plus a short free trial to a third‑party tool, and I practiced writing Boolean queries, filtering by language, then exporting a CSV. I calculated share of voice in Google Sheets and mapped the top complaint themes for our brand. The assignment asked for a short memo with screenshots, and I used it in a Monday stand‑up to justify shifting our content calendar toward more how‑to posts.",
        "source_4": "Looking at the program as a whole after three courses, I decided to pause. Several examples repeated across modules, so I kept seeing the same coffee brand scenario with small tweaks. Paying monthly made the slow weeks feel costly, and the capstone outline expects a full campaign plan that, by my estimate, would take 12–15 hours in one week if you include research and mockups. The job guidance felt light—mostly links to resume tips and a generic portfolio checklist—so I’m weighing whether to resume next quarter.",
        "source_5": "Zooming in on the social listening assignment quality: the instructions referenced a tool that wasn’t available in my region, and the alternative path linked to screenshots from an older interface. I spent an evening trying to match the filters and ended up submitting generic dashboard images to meet the rubric. The forum thread about this had a few “workarounds,” but the links were stale, and the mentor reply arrived after grading closed. I didn’t get the depth of practice I wanted with query building or sentiment categorization on real data."
    }
}