{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I moved from an iPhone 8 to the iPhone 12 last winter and it’s been my daily device for everything from Slack and Outlook to photos and Apple Pay. The squared edges give it a secure grip, and MagSafe has actually changed how I carry it—I snap on the wallet when I’m out and use a charger next to my desk. Camera Night mode has been handy for dim restaurants, and 5G speeds are snappy on my commute. Most days I’m off the charger at 7 a.m. and land around 25–35% by 10 p.m. If I play Genshin Impact for 40 minutes, the top-right of the phone gets warm and the screen dims a notch, but outside of heavy gaming it stays stable.",
        "source_2": "I bought the iPhone 12 for remote work and filming short reels, and over a year the combination of heat and battery drain has become a real hassle. A 20-minute 4K/60 recording warms the back near the cameras, my case traps the heat, and brightness drops mid-shoot. On days with back-to-back Zoom calls over 5G, I’m reaching for a power bank before lunch even with Low Power Mode and reduced background refresh. I’ve ended up toggling off 5G, dimming the display, and setting app limits just to get through a full workday, which isn’t how I expected to use it.",
        "source_3": "Focusing strictly on battery life: my iPhone 12 leaves the charger at 6:30 a.m., and with Instagram, Maps, Spotify streaming, and a couple of Teams calls, I’m down to 15–20% by 2 p.m. Battery health shows 89%, and even after a fresh iOS install and disabling background refresh for most apps, the midday drop persists. I travel between cell towers and keep 5G on, which seems to draw more power; I now keep a compact power bank in my bag and do a 30-minute top-up before afternoon meetings.",
        "source_4": "Just talking battery: mine comfortably covers a full day. I unplug around 6 a.m., run push email, about 90 minutes of phone calls, constant iMessage, a half hour of photos, and some light navigation. I’m on LTE most of the time, battery health reads 96%, and by 10 p.m. I’m usually sitting at 30% without a mid-day charge. On a cross-country flight I watched three hours of downloaded shows with Bluetooth earbuds and still landed with over 40%.",
        "source_5": "My main concern is heat under intensive use. If I play Asphalt 9 or record longer clips—say 25 minutes at 4K—the top half near the camera bump warms noticeably. The phone throttles enough that frame rates dip and the display dims, which makes it awkward to continue. Removing a thick case helps a bit, and keeping brightness at 50% reduces how quickly it warms, but anything sustained like augmented reality demos or extended video shoots still triggers it.",
        "source_6": "Hardware-wise, my iPhone 12 has handled a lot of abuse. I’ve carried it for almost two years, tossed it in a backpack with keys, and had a waist-height drop onto tile that left only a scuff on the aluminum frame. The front glass has a few micro-scratches but no cracks; buttons are still crisp, the Taptic Engine feels tight, and the Lightning port has survived countless cables without wobble. It’s been splashed during a rainy run and used as a GPS in a hot car mount, and it just keeps chugging without weird creaks or loose parts."
    }
}