{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I bought the base iPhone 13 in late 2022 and I’m writing this only about battery behavior. On a typical weekday, I start at 8 a.m. with 100%, do 30–40 minutes of BGMI over lunch on Wi‑Fi (Extreme/60 fps), and I’m down to ~55% by 2 p.m. The game alone eats around 15–18% per 20 minutes if the room is warm. If I’m in an AC room set to 22°C, the drop is closer to 10–12%, and the phone doesn’t heat up as much. With 5G on, I see the percentage tick down faster; switching to Wi‑Fi helps. Overnight standby from 11 p.m. to 7 a.m. loses about 7–9% with notifications on. I now carry a small power bank because a second BGMI session in the evening can push it under 20% before dinner.",
        "source_2": "Using an iPhone 14 Pro for the past 10 months, my overall take is that it feels effortless day to day. App switching is instant, the keyboard never lags, and editing a couple of 4K clips in Photos while screen recording for a tutorial didn’t make it hiccup. BGMI at 60 fps stays steady in team fights, and I can keep Discord running in the background without slowdowns. The display is bright enough for midday sun, and AOD hasn’t been a nuisance for me. With 5G enabled, I do charge earlier in the evening, but if I keep it on Wi‑Fi, I finish most days between 25–35% remaining after 5–6 hours of screen time.",
        "source_3": "I picked up the iPhone 13 mainly to shoot family videos, so I’ll stick to camera and display. Indoors at night, 4K at 30 fps preserves faces without that waxy look I used to get on my older Android, and the stabilization keeps handheld clips watchable when I’m walking behind a toddler. In daylight, HDR pulls sky detail without turning everything neon. The display shows what I filmed accurately—skin tones don’t shift when I tilt the phone, and outdoor playback at full brightness is fine for checking focus. Cinematic mode is hit‑or‑miss around hair, but regular video looks consistently clean.",
        "source_4": "Strictly about gaming on a base iPhone 14: in BGMI, I run Graphics on HD with Frame Rate set to High/Extreme. In hot‑drop situations (School, Bootcamp), frames dip from 60 to the low 40s when smokes and grenades are everywhere. Ping holds around 30–40 ms on my 100 Mbps fiber, so it doesn’t seem like network jitter. After 20 minutes, the back gets warm near the top right, and the dips become more frequent. Clipping on a small phone cooler keeps it near 60 for longer, and lowering anti‑aliasing helps. A friend’s 14 Pro Max doesn’t show the same dips in the same lobby, so I’d lean Pro if your priority is sustained frames.",
        "source_5": "Focusing only on battery endurance on my iPhone 13 Pro (purchased early 2023): with 5G off and brightness around 50%, I consistently get around 7–8 hours of screen‑on time. A day for me looks like 2 hours of YouTube, 1 hour of BGMI at 60 fps, an hour of Maps, plus the usual messaging and email. The BGMI hour costs me about 9–12%, and the phone stays comfortable unless I’m outside in direct sun. Standby overnight drops 3–5% with two email accounts and Slack notifications active. I usually plug in before bed at roughly 30–40% without feeling tethered to a charger during the day."
    }
}