{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I wrapped up the cybersecurity psychology course this week, taking about an hour a day for five days. The instructor frames topics with short stories (e.g., a phishing simulation at a regional bank) and ties them to concepts like anchoring and authority bias. Week 1 focuses on threat perception with 6–9 minute videos and a 12‑question quiz, and Week 2 moves into human factors in incident response. Where it felt light was social engineering: two slides on pretexting and a quick anecdote, but no role‑play or call breakdown. Coming from outside the field, I came away looking at security work differently; if you’ve already spent time in a SOC, much of it reads like an introduction.",
        "source_2": "I enrolled specifically to study social engineering, so I zeroed in on that. Module 3 (“Human Attack Vectors”) spends roughly 35 minutes on pretexting, tailgating, and the structure of phishing calls. There’s a recorded vishing breakdown with timestamps marking compliance triggers, plus a peer‑graded assignment where you draft a pretext and annotate which cognitive biases you’re invoking. The rubric calls out reciprocity, scarcity, and authority cues. The provided checklist for pretext validation is detailed enough to run a small internal awareness exercise, and there’s an interview segment where a practitioner walks through building a backstory step by step.",
        "source_3": "I approached this as a SOC analyst looking for depth. The first hour covers the CIA triad, definitions of threat vs. vulnerability, and general heuristics without tying them to frameworks we actually use. I kept looking for ATT&CK mappings, detection playbooks, or even a simple lab with simulated alerts; instead, the only hands‑on piece is a one‑page reflection about decision pitfalls. Case studies stay high level, the quiz questions lean on recall, and there’s no capstone that forces you to test a hypothesis or design a control. For someone brand new, that structure probably works; for day‑to‑day defenders, it’s mostly review.",
        "source_4": "I’ve been a security architect for eight years and took this to sharpen the human‑factors side. Several ideas translated directly to work: the section on cognitive load during triage mapped cleanly to our on‑call fatigue, and the “nudges” segment led me to change our phishing runbook (tweaked subject lines in internal campaigns and added a post‑report micro‑survey). The social engineering module includes a hospital case study and a vishing call deconstruction with clearly marked escalation points. Quizzes aren’t just definitions; a few scenarios required choosing tradeoffs under time pressure. I finished with a checklist that now lives in our IR playbooks and a short list of experiments for the next tabletop.",
        "source_5": "I’m brand new to cybersecurity and took this to see how psychology ties in. From a beginner’s stance, the course layers terms carefully: each idea (heuristics, cognitive bias, risk perception) comes with a plain‑language definition, a one‑screen diagram, and a short example. The glossary sits under each video, and acronyms are unpacked before moving on. Quizzes are low stakes—unlimited attempts, immediate explanations, and links back to relevant timestamps. There’s no coding or math; everything is framed as scenarios and decisions. Judged only on accessibility for first‑timers, the pacing (6–8 minute videos, weekly recap, optional readings) makes it straightforward to follow without getting lost."
    }
}