{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I’m a heavy user and the battery just doesn’t keep up with my day. With 5G on, two hours of YouTube during lunch, constant Slack and email, and an hour of maps while driving between client sites, I hit 30% by midafternoon. I end up topping it off around 3 p.m., and then again in the evening if I have a late Zoom call. I now carry a 20W charger in my backpack because I can’t reliably make it from breakfast to bedtime on one charge.",
        "source_2": "I bought it mainly for the camera and it’s been a solid pocket shooter. Portrait shots of my kids have clean edges, skin tones look natural in daylight, and the video stabilization kept my daughter’s school play watchable even from the back row. I’ve taken indoor photos under warm kitchen lights and the colors stayed accurate without needing to tweak anything before sharing.",
        "source_3": "Face unlock has been a headache with masks. In the grocery store or on the subway, it fails more often than not, so I’m punching in the passcode constantly. Glasses fog up, I pull the mask down a bit, it still doesn’t register, and by the time it lets me in I’ve already missed the turnstile. A fingerprint reader on the power button would save a lot of time in these situations.",
        "source_4": "For my usage, the phone works out fine overall. I make a few calls, stream a podcast on my walk, scroll through news, and it still has plenty left when I plug in at night. Face ID opens the phone quickly at my desk, and with the watch unlock setting, it gets past the mask at the office door without me thinking about it. The camera has handled weekend hikes and a windy beach day without fuss, so I’ve stopped carrying my old point‑and‑shoot.",
        "source_5": "As a remote worker who also takes evening classes, I’m on video calls for hours and hop between documents, messaging, and maps. By noon I’m scrambling for an outlet, and I usually have to plug in again before my night lecture. On campus I’m masked most of the time, so I’m typing the passcode dozens of times a day, which slows down quick checks between classes. The camera is fine for notes on the whiteboard, but the constant charging and unlock dance overshadow everything else for me.",
        "source_6": "I focus a lot on indoor photography, and the camera hasn’t matched what I expected under dim cafe lighting. Faces look a bit soft unless I hold perfectly still, and I notice grain in the darker areas of the frame. During a friend’s birthday dinner, the autofocus kept hunting when candles were the main light source, and the video from that night came out with noticeable shimmer when I panned across the table."
    }
}