{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I picked up the phone for work and the battery hasn’t kept pace with my day. Starting at 100% at 8 a.m., it’s usually down to about 20% by 3 p.m. after email, Slack, and two 20‑minute calls. A single Netflix episode trims roughly 15%. Overnight idle drops 8–10% with only Wi‑Fi and Bluetooth on. I’ve started keeping a charger at my desk to survive late meetings.",
        "source_2": "My experience with Wi‑Fi has been rock solid. It latches onto my 5 GHz network instantly and pulls 290–320 Mbps on Speedtest. I can walk through two brick walls during a 45‑minute Google Meet without a hiccup. Roaming between office access points doesn’t stall Spotify or Maps, and the hotspot kept my laptop online for a two‑hour train ride without a single drop.",
        "source_3": "I’m impressed with the camera at night. Using the built‑in Night mode, handheld shots of street signs and storefronts came out clean, with readable text and steady edges even under dim lamps. Indoors at a café, the chalkboard menu was sharp and colors looked natural. In bright noon sun though, skies blow out unless I tap to pull exposure down, and foliage shows a crunchy, over‑processed look.",
        "source_4": "The touch response has been inconsistent for me. Swipe‑back from the left edge fails about half the time, and while typing I see double letters and random spaces as if the screen is picking up phantom taps. I removed the tempered glass and rebooted; no change. After 20–30 minutes of gaming, the panel warms up and missed gestures become more frequent.",
        "source_5": "As an overall package, it’s handled my routine well. Battery covers a 7 a.m. to midnight day with roughly a quarter left after Maps, messaging, and some YouTube. Calls stay clear, and both Wi‑Fi and LTE hold steady even in the elevator at work. GPS tracks accurately on my bike ride, photos are fine for social posts, and the fingerprint reader usually unlocks on the first touch.",
        "source_6": "After a month, the device hasn’t been dependable for me. Cellular drops to zero bars in spots where my old phone held a call, and Wi‑Fi will randomly gray out and reconnect mid‑meeting on Teams. The camera hunts for focus indoors, so I miss candid shots of my toddler unless I stand under a bright lamp. The battery gets through the day, but the connection hiccups and app reloads slow me down enough that I now carry a backup phone."
    }
}