{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I use the phone for long navigation drives with Spotify and call recording in the background, and the area around the camera bump gets noticeably warm after 15–20 minutes on 5G. I even checked with an IR thermometer out of curiosity and saw it hover around 40–42°C. Turning off background refresh delays it a bit, but when I switch to recording 4K video or do a quick photo burst, the frame near the volume buttons heats up again enough that I take it out of the case to let it breathe.",
        "source_2": "I upgraded mainly for the camera and spent an evening shooting my kid’s school play in a dim auditorium. Using 48MP ProRAW, I could crop into faces without blockiness, and the stitching on costumes stayed clear when viewing at 100%. Daylight cityscapes held fine detail even after a 2x crop, and I printed an 8x12 for the grandparents without visible blur. I haven’t run into any odd scatter or mushy textures in my shots so far.",
        "source_3": "After moving from a 2016 model, I’ve tracked a full week of use: battery from 7 a.m. to midnight with roughly 6–7 hours of screen time, Teams calls during commutes, and nightly photos of the kids. The phone stays cool in my daily workflow, the photos are predictable, and the screen is crisp for reading dense PDFs. I got it during a festival sale for around 65K with card offers and a trade-in, and setting it up with my old data took under an hour. Day to day, it feels like a steady upgrade.",
        "source_4": "I pre-ordered at about 80K, and within a few weeks the official price dropped to 65K. My retailer had no price protection, and trade-in quotes fell in line with the cut, so I couldn’t recoup the difference. I’m on an EMI plan, which ruled out returning it. That swing in pricing has me rethinking whether I’ll buy at launch next time.",
        "source_5": "This is my third iPhone, and the experience has been rough overall. During 40–50 minute WhatsApp video calls, the upper back gets hot and the other side starts hearing my voice cut in and out. Indoor photos of my dog often look smeared, like the noise reduction jumps in too aggressively, and a lot of gallery thumbnails appear low-res until I open them. Apple support walked me through resets and a fresh restore, but the behavior returned as soon as I loaded my usual apps.",
        "source_6": "I care mostly about display clarity because I read for hours and review photos. On my unit, tiny serif fonts in Kindle remain crisp, and 4K YouTube looks detailed with clean edges and smooth gradients. I did a side-by-side with a midrange Android, and the iPhone panel showed tighter subpixel rendering and less color banding on skin tones. I’m not seeing pixelation or scattered artifacts in photo viewing."
    }
}