{
    "question": "Summarize the following evidence in 2-3 sentences.",
    "content": {
        "source_1": "I enrolled during our winter break and worked through the modules after school over two weeks. The structure made it easy to pause, try something in my 4th-grade class, and come back with notes. After the section on environmental adjustments, I rearranged seating, added a visual timer, and started using short movement breaks; my students responded immediately, and I kept a little log to track what changed. The instructor’s classroom clips felt like real situations, not staged demos, and the reflection prompts nudged me to plan specific steps for one student at a time. I also liked that I could watch on my phone during bus duty and pick up on my laptop later without losing my place.",
        "source_2": "Speaking only about the resources: the downloadable pack was mostly generic PDFs—checklists without examples filled in, and several external links that led to expired pages or to tools behind a subscription. The “behavior plan” template didn’t include a sample scenario, so I had to guess how to complete it. Some handouts were US-specific and didn’t match my school’s terminology, and there were no editable versions in Word or Google Docs, just flat PDFs. I ended up recreating two forms from scratch so my team could actually use them.",
        "source_3": "I completed the course alongside a district PD requirement and expected more classroom modeling. Most videos were talking-head lectures with slides; I kept waiting for a full lesson run-through showing how to redirect attention minute by minute. The quizzes felt like they checked if I remembered definitions rather than whether I could apply them to tricky situations, and the peer forum was quiet when I posted questions about transitions. I reached the final module still unsure how to adapt our math centers beyond “shorten tasks” and “offer movement”—I wanted to see a schedule breakdown, sample scripts, and how to recover when a plan goes off the rails.",
        "source_4": "Focusing just on the quizzes: they were scenario-based and stepped up in complexity across the weeks. For example, one item described a student blurting during a read-aloud and offered choices that looked reasonable at first glance; only after rereading the antecedent did the best option stand out. The feedback didn’t just say “incorrect”—it explained why each distractor might backfire, like how a public reminder can escalate. The final quiz combined timing, environment, and parent communication, which pushed me to think across modules rather than in silos.",
        "source_5": "Zeroing in on the resource library: the “ABC observation form” and the “transition checklist” became staples for me. I printed the ABC sheet on a clipboard and used it during recess duty; within a week I spotted a pattern around noisy spaces. The transition checklist had concrete cues (timer, preview, movement, follow-up) and fit on one page, so I taped it inside my plan book. The course also included editable slides with visual schedules and a calm-choice menu; I swapped in our classroom icons and shared them with a co-teacher, who started using the same visuals during art class."
    }
}