{
    "question": "Should news organisations be free to exclude news about homosexuality when it causes offence to their viewers?",
    "content": {
        "source_1": "Miami Herald Publishing Co. v. Tornillo, 418 U.S. 241 (U.S. Supreme Court, 1974). Holding that government cannot compel a newspaper to publish content it does not wish to carry, affirming broad editorial discretion as a core First Amendment protection—used to argue news organisations may lawfully choose to exclude certain topics, including homosexuality, to suit their audience.",
        "source_2": "Bayev and Others v. Russia, European Court of Human Rights, Applications nos. 67667/09, 44092/12 and 56717/12 (20 June 2017). The Court ruled that laws banning “propaganda of homosexuality” to protect children and public morals violated Articles 10 (expression) and 14 (non-discrimination) of the ECHR—evidence that suppressing or excluding LGBTQ-related information to avoid offence can breach human rights standards.",
        "source_3": "“Gay, lesbian or Muslim? Advertisers are blocking you” — The Guardian, 3 August 2020. Report on widespread advertiser keyword blocklists (e.g., “gay,” “lesbian”) that demonetize LGBTQ content, pressuring publishers to avoid or downplay such topics to protect revenue—showing market incentives that can drive exclusion on “brand safety” or perceived offence grounds.",
        "source_4": "The Trevor Project, “2023 U.S. National Survey on the Mental Health of LGBTQ Young People” (2023). Survey finds that seeing positive LGBTQ representation in media is associated with better mental health and belonging among LGBTQ youth—used to argue that excluding LGBTQ news to avoid offence may contribute to stigma and harm.",
        "source_5": "BBC Royal Charter and Agreement (2016), “Mission and Public Purposes.” The Charter requires the BBC to “reflect, represent and serve the diverse communities of all of the United Kingdom”—illustrating that some public service news organisations have statutory obligations toward diversity and inclusion that run counter to blanket exclusion based on potential offence.",
        "source_6": "Infocomm Media Development Authority (Singapore), Content Code for Nationwide TV Services and Film Classification Guidelines (most recently updated 2022–2023). Guidelines restrict or heavily rate content that “promotes or justifies” homosexuality on free-to-air platforms to respect prevailing community standards—an example of a jurisdiction endorsing editorial exclusion of LGBTQ content to avoid offence."
    }
}