{
    "question": "Should governments introduce a flat tax?",
    "content": {
        "source_1": "Hall, Robert E., and Alvin Rabushka. The Flat Tax (Hoover Institution Press, 2nd ed., 1995; updated eds. later). Foundational proposal arguing a single-rate tax on a broad consumption-like base would greatly simplify filing, cut compliance costs, eliminate many distortions (especially the tax bias against saving and investment), and thus raise long-run growth.",
        "source_2": "Ivanova, Anna, Michael Keen, and Alexander Klemm. The Russian “Flat Tax” Reform (IMF Working Paper WP/05/16, 2005). Case study of Russia’s 2001 shift to a 13% flat personal income tax finds personal income tax revenues rose substantially, with evidence pointing to improved tax compliance rather than large labor-supply effects—suggesting a flat tax can boost collections in high-evasion settings. https://www.imf.org/external/pubs/ft/wp/2005/wp0516.pdf",
        "source_3": "Urban-Brookings Tax Policy Center, Briefing Book: A citizen’s guide to the federal tax system (ongoing). Reviews flat tax proposals and distributional tables, concluding that typical flat taxes (with broad bases and few preferences) would reduce progressivity—cutting taxes for high-income households while raising or not lowering burdens for many middle- and lower-income taxpayers—raising equity concerns. https://www.taxpolicycenter.org/briefing-book",
        "source_4": "Diamond, Peter, and Emmanuel Saez. The Case for a Progressive Tax: From Basic Research to Policy Recommendations (Journal of Economic Perspectives, 2011). Using modern optimal tax theory and empirical elasticities, the authors argue that progressive rate structures—often with high top marginal rates—are welfare-maximizing; a uniform flat rate is generally not optimal given heterogeneous abilities and behavioral responses. https://www.aeaweb.org/articles?id=10.1257/jep.25.4.165",
        "source_5": "Ostry, Jonathan D., Andrew Berg, and Charalambos G. Tsangarides. Redistribution, Inequality, and Growth (IMF Staff Discussion Note SDN/14/02, 2014). Cross-country evidence finds that high inequality is harmful for sustained growth and that, on average, redistribution through taxes and transfers is not growth-damaging—undercutting the claim that flatter (less redistributive) tax schedules are needed to foster growth. https://www.imf.org/external/pubs/ft/sdn/2014/sdn1402.pdf",
        "source_6": "OECD. Tax Policy Reforms 2018: OECD and Selected Partner Economies (2018). Documents a policy shift in several countries away from flat personal income taxes—e.g., Slovakia reintroducing a higher bracket in 2013 and Latvia moving to progressive rates in 2018—citing revenue and equity considerations, which suggests practical sustainability challenges for flat taxes. https://www.oecd.org/tax/tax-policy-reforms-2018-9789264304510-en.htm"
    }
}