{
    "question": "Should term limits be enforced on the legislative branch of government?",
    "content": {
        "source_1": "Gallup polling on institutional reforms: Large, bipartisan majorities of Americans consistently say they favor congressional term limits, indicating a strong public mandate for change. Source: Gallup, “Americans Broadly Support Term Limits for Congress” (multiple waves; e.g., 2013, 2020).",
        "source_2": "U.S. constitutional law constraint: The Supreme Court ruled that states cannot impose qualifications (including term limits) on members of Congress; implementing congressional term limits would require a federal constitutional amendment. Source: U.S. Term Limits, Inc. v. Thornton, 514 U.S. 779 (1995).",
        "source_3": "State-level evidence of unintended consequences: Term limits in several U.S. states reduced legislative experience and capacity, increased reliance on lobbyists and staff, and shifted power toward governors and bureaucratic agencies. Source: National Conference of State Legislatures (NCSL), “The Effects of Legislative Term Limits” (ongoing reports); Thad Kousser, Term Limits and the Dismantling of State Legislative Professionalism (Cambridge, 2005).",
        "source_4": "Entrenched incumbency argument: Incumbents in the U.S. House routinely win reelection at very high rates, reflecting substantial incumbency advantages (name recognition, fundraising, districting) that can dampen competition; term limits are proposed as a structural counter. Source: OpenSecrets (Center for Responsive Politics), historical congressional reelection rate data.",
        "source_5": "Comparative cautionary case (Mexico): For most of the 20th century, Mexico banned consecutive reelection for legislators; research links this to weaker accountability and stronger party/control-center influence over lawmakers. Mexico’s recent reforms allowing reelection aimed to improve responsiveness—suggesting strict legislative term limits can backfire. Source: Oxford Research Encyclopedia of Politics; scholarly literature on Mexico’s no-reelection rule (e.g., Joy Langston; Diaz-Cayeros & Magaloni).",
        "source_6": "Mixed policy and representation outcomes: Cross-state studies find term limits increase turnover and alter career paths but show limited, inconsistent effects on spending, corruption, or descriptive representation (women/minorities), raising doubts that term limits deliver promised policy improvements. Source: John M. Carey, Richard G. Niemi, and Lynda W. Powell, Term Limits in State Legislatures (Michigan, 2000); NCSL syntheses."
    }
}