{
    "question": "Should the EU significantly reduce its spending on agricultural production subsidies?",
    "content": {
        "source_1": "European Commission — CAP budget 2021–27: The CAP totals €386.6 billion for 2021–2027, accounting for around 31% of the EU budget, indicating large opportunity costs versus other priorities. https://agriculture.ec.europa.eu/common-agricultural-policy/financing-cap/cap-budget-2021-27_en",
        "source_2": "OECD (2023), Agricultural Policy Monitoring and Evaluation: OECD recommends countries reduce and repurpose the most production- and input-linked forms of support—identified as among the most market-distorting and environmentally harmful—towards investments and public goods; this guidance applies to the EU as well. https://www.oecd.org/publications/agricultural-policy-monitoring-and-evaluation-2023_63fe468a-en.htm",
        "source_3": "European Court of Auditors (2021), Special Report 16/2021 — Common agricultural policy and climate: Despite substantial CAP funds labelled as climate spending, agricultural greenhouse gas emissions in the EU did not decrease 2010–2018, indicating limited effectiveness of current subsidy structures for climate goals. https://www.eca.europa.eu/en/publications/sr-2021-16",
        "source_4": "World Bank (2006), Agricultural Trade Reform and the Doha Development Agenda (Anderson & Martin, eds.): Analyses show that agricultural support in high-income economies depresses world prices and reduces incomes for developing-country farmers; cutting such subsidies (including in the EU) would yield global welfare gains. https://openknowledge.worldbank.org/handle/10986/7236",
        "source_5": "European Commission (2022), Communication COM(2022) 133 — Safeguarding food security and reinforcing the resilience of food systems: The Commission underscores the CAP’s role in ensuring food availability, farmer income stability and crisis resilience (including a crisis reserve), arguing for maintaining robust support amid shocks like the war in Ukraine and input price spikes. https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:52022DC0133",
        "source_6": "European Commission — Voluntary Coupled Support (VCS): Production-linked aid in the EU is capped (generally up to 13% of national envelopes, plus 2% for protein crops) and targeted to “specific sectors or types of farming that are particularly important for economic, social or environmental reasons,” implying deep cuts could disproportionately hit vulnerable sectors. https://agriculture.ec.europa.eu/common-agricultural-policy/market-measures/voluntary-coupled-support_en"
    }
}