{
    "question": "Is homework a waste of time?",
    "content": {
        "source_1": "Kohn, A. (2006). The Homework Myth: Why Our Kids Get Too Much of a Bad Thing. Da Capo Press. Argues that research provides little to no evidence that homework boosts academic achievement (especially in elementary grades) and contends it can undermine intrinsic motivation and displace meaningful family and leisure time.",
        "source_2": "Cooper, H., Robinson, J. C., & Patall, E. A. (2006). Does Homework Improve Academic Achievement? A Synthesis of Research, 1987–2003. Review of Educational Research, 76(1), 1–62. Meta-analysis finds small-to-moderate positive effects of homework in grades 7–12, negligible effects in K–6, and diminishing returns beyond moderate amounts—supporting a “10-minute per grade level” guideline rather than blanket rejection.",
        "source_3": "Maltese, A. V., Tai, R. H., & Fan, X. (2012). When Is Homework Worth the Time? Evaluating the Association Between Homework and Achievement in High School Science and Math. The High School Journal, 96(1), 52–72. Using national datasets and controls for background factors, time spent on homework showed little to no link with course grades and only modest associations with standardized test performance—suggesting quantity of time is a poor proxy for learning gains.",
        "source_4": "OECD (2014). Does Homework Perpetuate Inequalities? PISA in Focus, No. 46. Across countries, students from advantaged socioeconomic backgrounds spend more time on homework; greater average homework time is associated with wider performance gaps, and the marginal benefit of additional hours is limited once socioeconomic status is considered.",
        "source_5": "Galloway, M., Conner, J., & Pope, D. (2013). Nonacademic Effects of Homework in Privileged, High-Performing High Schools. The Journal of Experimental Education, 81(4), 490–510. Surveys link heavy homework loads (often >3 hours/night) to elevated stress, sleep problems, and reduced time for extracurriculars and family, with students reporting limited educational value from excessive assignments.",
        "source_6": "Education Endowment Foundation (EEF) Teaching and Learning Toolkit (most recent update). Homework (Secondary; Primary). Synthesis of trials indicates homework can yield substantial gains in secondary school (around five months’ additional progress) at very low cost when tasks are purposeful and feedback-rich, but produces low impact in primary settings."
    }
}