{
    "question": "Should junk food be banned?",
    "content": {
        "source_1": "Schnabel, L. et al. “Association between ultra-processed food consumption and risk of mortality among middle-aged adults in France.” The BMJ (2019). https://www.bmj.com/content/365/bmj.l1949 - Evidence: Higher consumption of ultra-processed foods was associated with increased all-cause mortality. This supports strong restrictions (up to bans) on “junk” foods due to substantial health risks.",
        "source_2": "Colchero, M. A. et al. “Beverage purchases from stores in Mexico under the excise tax on sugar sweetened beverages: observational study.” The BMJ (2016). https://www.bmj.com/content/352/bmj.h6704 - Evidence: Mexico’s soda tax led to significant reductions in purchases, especially among low-income households, indicating targeted fiscal measures can curb unhealthy consumption without outright bans.",
        "source_3": "Nuffield Council on Bioethics. “Public health: ethical issues.” (2007). https://www.nuffieldbioethics.org/publications/public-health - Perspective: Introduces the “intervention ladder,” arguing outright bans are among the most intrusive policies and require strong justification; raises concerns about autonomy and paternalism in banning junk food.",
        "source_4": "Allcott, H., Lockwood, B., Taubinsky, D. “Regressive Sin Taxes, with an Application to the Optimal Soda Tax.” Quarterly Journal of Economics (2019). https://academic.oup.com/qje/article/134/3/1557/5484905 - Evidence/Perspective: Sin taxes are financially regressive even if welfare-improving when internalities are considered; a blanket ban could have even more regressive effects and harm consumer surplus, particularly for low-income groups.",
        "source_5": "Taber, D. R. et al. “Association Between State Laws Governing School Snack Foods and Beverages and Student Body Mass Index.” Pediatrics (2012). https://publications.aap.org/pediatrics/article/130/6/1102/30941/ - Evidence: Strong state restrictions on “competitive” junk foods in schools were linked to smaller increases in student BMI, suggesting targeted, context-specific bans can improve health outcomes.",
        "source_6": "UK Department of Health and Social Care. “Government delays restrictions on multibuy deals and advertising on foods high in fat, salt or sugar.” (2022). https://www.gov.uk/government/news/government-delays-restrictions-on-multibuy-deals-and-advertising-on-foods-high-in-fat-salt-or-sugar - Evidence/Perspective: The delay of HFSS restrictions highlights political, definitional, and implementation challenges, suggesting that broad junk food bans may face significant feasibility and enforcement hurdles."
    }
}