{
    "question": "Should the African Union create a standing army?",
    "content": {
        "source_1": "African Union Constitutive Act (2000) and Protocol Relating to the Establishment of the Peace and Security Council (2002), African Union — The AU’s founding law (Article 4h/4j) and PSC Protocol give the Union a legal mandate to intervene in grave circumstances and to conduct peace support operations, a pro–standing army argument that a permanent force would operationalize these obligations with faster, more credible responses. (au.int/en/treaties/constitutive-act-african-union; au.int/en/treaties/protocol-relating-establishment-peace-and-security-council-african-union)",
        "source_2": "Policy Framework for the Establishment of the African Standby Force and the Military Staff Committee (2003), African Union — The AU deliberately chose a regionally based standby model (via RECs/RMs) rather than a centralized standing army, reflecting member states’ preference for decentralization and sovereignty safeguards; this suggests political resistance to creating a single AU standing army. (peaceau.org and AU ASF policy documents)",
        "source_3": "AMISOM/ATMIS record, African Union Peace Support Operations — AU-led forces in Somalia helped push Al‑Shabaab out of major urban centers and enabled political processes when adequately resourced, cited by proponents as evidence that African troops can deliver results and that a standing AU force could scale such successes. (AU Peace and Security Department/PSO mission pages and communiqués on AMISOM/ATMIS: peaceau.org)",
        "source_4": "UN Security Council Resolutions 2320 (2016) and 2378 (2017), and the 2018 UN–AU Joint Report on Financing AU-led Peace Support Operations (A/72/808–S/2018/574) — These documents underscore that AU operations lack predictable, sustainable financing and explore using UN assessed contributions; they imply that without a reliable funding mechanism, an AU standing army would face severe feasibility and burden‑sharing challenges. (undocs.org/S/RES/2320(2016); undocs.org/S/RES/2378(2017); undocs.org/A/72/808)",
        "source_5": "Reuters, “West Africa’s ECOWAS lifts sanctions on Niger, rules out military intervention,” 24 February 2024 — Even at the regional level, political consensus to deploy force can falter; ECOWAS backed away from threatened military action after Niger’s 2023 coup, illustrating the political divisiveness and authorization hurdles an AU standing army could also face. (reuters.com/world/africa)",
        "source_6": "Paul D. Williams, Fighting for Peace in Africa: African Union Peace Operations (Oxford University Press, 2018) — A comparative analysis showing AU missions have been ad hoc, heavily donor‑funded, and that the African Standby Force has not been fielded as envisaged; this scholarship cautions that structural, political, and financial realities—not just capability gaps—impede any move toward a continental standing army. (Oxford University Press)"
    }
}