{
    "question": "Should we make New Year’s resolutions?",
    "content": {
        "source_1": "Norcross, Mrykalo, & Blagys (2002). “Auld Lang Syne: Success predictors, change processes, and self-reported outcomes of New Year’s resolvers and nonresolvers.” Journal of Clinical Psychology. Evidence: About 46% of New Year’s resolvers reported continued success at six months, and resolvers outperformed comparable “nonresolvers,” suggesting resolutions can aid behavior change.",
        "source_2": "Dai, Milkman, & Riis (2014). “The Fresh Start Effect: Temporal Landmarks Motivate Aspirational Behavior.” Management Science. Evidence: Temporal landmarks like New Year’s Day spur increased goal pursuit (e.g., higher gym attendance and goal searches), indicating that the New Year can be an effective catalyst for resolutions.",
        "source_3": "Polivy & Herman (2002). “If at First You Don’t Succeed: False Hopes of Self-Change.” American Psychologist. Evidence: Describes “false hope syndrome,” where overly ambitious resolutions lead to repeated failure, discouragement, and lower self-efficacy—arguing that New Year’s resolutions can backfire.",
        "source_4": "Lally, van Jaarsveld, Potts, & Wardle (2009). “How are habits formed: Modelling habit formation in the real world.” European Journal of Social Psychology. Evidence: Habit automaticity took on average about 66 days and depended on consistent cues/repetition; a single calendar-based resolution without ongoing habit design is unlikely to succeed.",
        "source_5": "DellaVigna & Malmendier (2006). “Paying Not to Go to the Gym.” Evidence from economics of self-control. Evidence: People overpay for gym memberships due to optimism about future attendance (with January spikes), implying New Year’s resolutions can lead to costly, unused commitments.",
        "source_6": "Deci & Ryan (2000). “The ‘What’ and ‘Why’ of Goal Pursuits: Human Needs and the Self-Determination of Behavior.” Psychological Inquiry. Evidence: Goals aligned with autonomous (intrinsic) motivation show better persistence and well-being; suggests New Year’s resolutions help only if they reflect personally meaningful, self-endorsed aims rather than external pressure."
    }
}