{
    "question": "Should people have a right to private education?",
    "content": {
        "source_1": "Universal Declaration of Human Rights (1948) Art. 26(3) and International Covenant on Economic, Social and Cultural Rights (ICESCR, 1966) Art. 13(3)-(4) — Establish that parents have a prior right to choose their children’s education and that individuals and bodies have the liberty to establish private schools, subject to minimum standards; supports a rights-based foundation for private education without implying a duty to fund it.",
        "source_2": "Pierce v. Society of Sisters, 268 U.S. 510 (1925), U.S. Supreme Court — Struck down a law mandating exclusive public-school attendance, affirming parents’ liberty to direct their children’s education, including through private schooling; cited as constitutional support for a right to private education and educational pluralism.",
        "source_3": "European Court of Human Rights: Konrad v. Germany (2006) and Wunderlich v. Germany (2019) — Upheld Germany’s restrictions on homeschooling and short-term child removal to enforce school attendance, finding no rights violation; illustrates that any right to private education can be limited by states’ interests in socialization, common standards, and child welfare.",
        "source_4": "UNESCO Global Education Monitoring Report 2021/2, “Non-state actors in education: who chooses? who loses?” — Finds that unregulated or lightly regulated private provision tends to increase socioeconomic segregation and uneven quality; cautions that recognizing or expanding rights to private education without strong regulation can undermine equity and the right to quality education for all.",
        "source_5": "Andrabi, Das, and Khwaja (2008), “A Dime a Day: The Possibilities and Limits of Private Schooling in Pakistan” (World Bank Policy Research Working Paper) and LEAPS studies — Document that low-fee private schools in rural Pakistan often deliver higher test scores at lower per-pupil cost than nearby public schools and expand choice, especially for girls; empirical support that a right to private education can enhance efficiency and outcomes in low-capacity public systems.",
        "source_6": "Hsieh and Urquiola (2006), “The Effects of Generalized School Choice on Achievement and Stratification: Evidence from Chile’s Voucher Program” (Journal of Public Economics/AER Papers) — Show that broad private-school expansion via vouchers increased sorting by socioeconomic status without raising average test scores; evidence that expanding private options can trade off equity for choice, challenging an unqualified right to private education."
    }
}