{
    "question": "Should the Grand Inga Dam be built?",
    "content": {
        "source_1": "African Development Bank Group (AfDB) — Grand Inga Hydropower Project overview (various briefs, 2018–2021). Evidence: Estimates Grand Inga’s ultimate capacity at roughly 40 GW, framing it as a continental backbone for low‑carbon power, industrialization, and regional power trade via interconnectors across Central, Southern, and West Africa.",
        "source_2": "World Bank Group — Press release: “World Bank Group Suspends Financing for the Inga‑3 Basse Chute Hydropower Project in DRC” (July 2016). Evidence: The Bank halted support citing governance and implementation concerns and divergence with the government’s approach, signaling high risks of cost overruns, procurement problems, and weak safeguards.",
        "source_3": "International Rivers (NGO) — Reports on Inga 3/Grand Inga risks (2018–2020). Evidence: Warns that Inga 3 would displace tens of thousands in the Bundi Valley, prioritize exports and mining loads over household access, and repeat past failures of Inga I & II, which left most Congolese without electricity despite large expenditures.",
        "source_4": "Winemiller et al., Proceedings of the National Academy of Sciences (2016) — “Balancing hydropower and biodiversity in the Amazon, Congo, and Mekong River basins.” Evidence: Finds that large mainstream dams in the Congo Basin could cause outsized losses to globally significant freshwater biodiversity by disrupting sediment transport and fish migrations; urges careful siting and limits on mega‑projects.",
        "source_5": "South Africa Department of Mineral Resources and Energy — Integrated Resource Plan (IRP) 2019. Evidence: Allocates 2,500 MW of hydropower imports by 2030 (widely understood as Grand Inga), indicating an anchor offtaker and long‑term demand that could improve project bankability and regional integration.",
        "source_6": "International Energy Agency (IEA) — Africa Energy Outlook 2022. Evidence: Projects that more than half of new electricity connections to 2030 will come from decentralized solutions (mini‑grids and solar home systems), which can deliver access faster and at lower cost than large grid megaprojects, suggesting Grand Inga may be ill‑suited for near‑term access goals."
    }
}