{
    "question": "Should the right to trial by jury be limited in some criminal cases?",
    "content": {
        "source_1": "Baldwin v. New York, 399 U.S. 66 (1970); Blanton v. City of North Las Vegas, 489 U.S. 538 (1989) — The Supreme Court held there is no Sixth Amendment right to a jury for “petty” offenses, generally those with a maximum authorized sentence of six months or less, unless additional statutory penalties make the offense “serious.” This supports the view that the jury-trial right is limited in some criminal cases (e.g., misdemeanors punishable by ≤6 months).",
        "source_2": "McKeiver v. Pennsylvania, 403 U.S. 528 (1971) — The Court ruled that juveniles in delinquency proceedings do not have a constitutional right to a jury trial. The plurality emphasized the rehabilitative goals of juvenile court. This is a categorical limitation of jury trials in a class of criminal-law adjudications.",
        "source_3": "Williams v. Florida, 399 U.S. 78 (1970); Ballew v. Georgia, 435 U.S. 223 (1978) — The Court approved six-person juries in noncapital criminal cases (Williams) but set six as the constitutional minimum (Ballew). Even when a jury is required, its traditional features (e.g., 12 members) can be reduced, reflecting a qualified scope of the jury-trial right.",
        "source_4": "Apprendi v. New Jersey, 530 U.S. 466 (2000); Alleyne v. United States, 570 U.S. 99 (2013); Hurst v. Florida, 577 U.S. 92 (2016); Ramos v. Louisiana, 590 U.S. ___ (2020) — These decisions expand and reinforce the jury’s role: any fact increasing a statutory maximum or mandatory minimum must be found by a jury beyond a reasonable doubt (Apprendi/Alleyne), key capital-sentencing facts must be found by a jury (Hurst), and state criminal juries must be unanimous (Ramos). This perspective conflicts with the claim by emphasizing a strengthening, not a limiting, of the criminal jury right in serious cases.",
        "source_5": "National Association of Criminal Defense Lawyers, “The Trial Penalty: The Sixth Amendment Right to Trial on the Verge of Extinction and How to Save It” (2018); see also Lafler v. Cooper, 566 U.S. 156 (2012) and Missouri v. Frye, 566 U.S. 134 (2012) — Empirical and doctrinal sources highlighting that the vast majority of U.S. criminal convictions result from guilty pleas (often 90%+), with steep “trial penalties” discouraging trials. This presents a practical limitation: while the formal right to a jury exists, systemic plea bargaining pressures substantially curtail its exercise.",
        "source_6": "Criminal Justice Act 2003, s.44 (England & Wales); R v Twomey and others, [2009] EWCA Crim 1035 — English law permits judge-only criminal trials where there is a real and present danger of jury tampering; the Court of Appeal in Twomey ordered a juryless trial after multiple attempts were compromised. This comparative example shows jurisdictions limiting jury trials in specific criminal cases to protect the process."
    }
}