{
    "question": "Should children do part-time and summer work?",
    "content": {
        "source_1": "U.S. Department of Labor, Wage and Hour Division — Fact Sheet #43: Child Labor Provisions for Nonagricultural Occupations under the Fair Labor Standards Act. Evidence: Federal law permits part-time work for 14–15-year-olds but strictly limits hours (e.g., no more than 3 hours on a school day, 18 in a school week; only between 7 a.m.–7 p.m., extended to 9 p.m. in summer) and prohibits hazardous occupations for minors. Perspective: Work by minors is acceptable only within tight safeguards to protect schooling and safety.",
        "source_2": "CDC/NIOSH — Young Worker Safety and Health. Evidence: Adolescents and young adults experience higher rates of work-related injuries than older workers, with common hazards in food service, retail, and agriculture; many lack adequate training and supervision. Perspective: Significant safety risks argue for caution about encouraging teen employment without strong protections.",
        "source_3": "Sara B. Heller (2017), Science — “Summer Jobs Reduce Youth Violence.” Evidence: A randomized controlled trial of Chicago’s summer jobs program showed sizable reductions in violent-crime arrests for participants for more than a year after the program, suggesting structured paid work can yield social benefits for disadvantaged youth. Perspective: Summer employment can improve public safety and youth outcomes.",
        "source_4": "Jeremy Staff, John E. Schulenberg, Jerald G. Bachman (2010), Developmental Psychology — “Adolescent work intensity, school performance, and problem behavior.” Evidence: Working long hours during the school year (often >20 hours/week) is linked to lower grades and more problem behaviors; light-to-moderate hours show little harm and sometimes positive attitudes toward work. Perspective: The impact depends on intensity—moderate work may be fine, but heavy work is academically and behaviorally costly.",
        "source_5": "Jeylan T. Mortimer (2003), Working and Growing Up in America (Harvard University Press). Evidence: Longitudinal research indicates that high-quality, moderate part-time jobs can build responsibility, time management, and occupational skills, and are associated with smoother school-to-work transitions. Perspective: Properly structured part-time work can foster developmental and early-career benefits."
    }
}