{
    "question": "Should those diagnosed with terminal illnesses be granted the right to access treatments that have not completed clinical testing?",
    "content": {
        "source_1": "Public Law 115-176 (Right to Try Act of 2017/2018) — Establishes a federal pathway allowing patients with life-threatening conditions to seek investigational drugs that have completed Phase I trials and remain under active development, with limited FDA oversight and liability protections for manufacturers and physicians. Cited by proponents as affirming patient autonomy and timely access when no approved options exist. Source: 115th Congress, S.204; Public Law 115-176 (2018).",
        "source_2": "FDA Expanded Access (Compassionate Use) program performance — FDA reports authorizing more than 99% of expanded access requests, with emergency single-patient requests often authorized immediately by phone and non-emergency requests processed quickly via a streamlined form. This suggests patients already can access unapproved therapies under oversight, calling into question the need to bypass FDA review. Source: U.S. Food and Drug Administration, “Expanded Access (Compassionate Use): Information for Patients/Physicians” (FDA web guidance; regularly updated).",
        "source_3": "Adverse outcomes from unproven interventions — Case series of three women who suffered severe, permanent vision loss after receiving intravitreal injections of autologous “stem cells” for age-related macular degeneration at a clinic outside rigorous trial oversight, illustrating the substantial risks of accessing inadequately tested treatments. Source: Kuriyan AE et al., “Vision Loss after Intravitreal Injection of Autologous ‘Stem Cells’ for AMD,” New England Journal of Medicine, 2017;376:1047–1053.",
        "source_4": "No constitutional right to investigational drugs — The D.C. Circuit held that terminally ill patients do not have a fundamental constitutional right to access investigational drugs, affirming the government’s authority to regulate access through the FDA. This legal precedent counters claims of an inherent “right to try.” Source: Abigail Alliance for Better Access to Developmental Drugs v. von Eschenbach, 495 F.3d 695 (D.C. Cir. 2007).",
        "source_5": "Ethical allowance with safeguards — The World Medical Association’s Declaration of Helsinki (Paragraph 37) permits physicians to use unproven interventions in clinical practice for patients with life-threatening conditions when proven interventions do not exist or have failed, provided informed consent is obtained and the intervention is subsequently studied. This supports conditional access, emphasizing ethics and data collection. Source: World Medical Association, Declaration of Helsinki (2013, as amended), Paragraph 37.",
        "source_6": "Oversight need and industry concerns — GAO found FDA approved nearly all expanded access requests and reported that adverse events from expanded access are rarely used to negatively affect approval decisions, suggesting companies’ fears about jeopardizing development may be overstated. This supports structured, overseen access rather than unregulated pathways. Source: U.S. Government Accountability Office, “Investigational New Drugs: FDA Has Taken Steps to Improve Expanded Access Program but Should Further Clarify How Adverse Events Are Used,” GAO-17-564 (July 2017)."
    }
}