{
    "question": "Should the use of performance-enhancing drugs in professional sports be permitted?",
    "content": {
        "source_1": "Savulescu, J.; Foddy, B.; Clayton, M. (2004). “Why we should allow performance enhancing drugs in sport.” BMJ. — Argues that permitting PEDs under medical supervision would reduce harm, increase transparency, and align with other accepted enhancements, proposing regulated thresholds rather than blanket bans.",
        "source_2": "World Anti-Doping Agency (2021). World Anti-Doping Code. — Lays out the formal rationale for prohibition (athlete health risk, fair competition, and the “spirit of sport”) and the criteria by which substances are banned (any two of three criteria suffice), providing the institutional case against permitting PEDs.",
        "source_3": "Baggish, A.L. et al. (2017). “Long-Term Anabolic-Androgenic Steroid Use Is Associated With Left Ventricular Dysfunction.” Circulation. — Presents clinical evidence that prolonged AAS use is linked to impaired heart function and cardiovascular risk, underscoring significant health harms that weigh against legalization.",
        "source_4": "Ulrich, R. et al. (2018). “Doping in Two Major International Athletics Competitions Assessed by Randomized-Response Surveys.” Sports Medicine. — Using anonymity-protecting survey methods, estimates that roughly a third to nearly half of athletes doped in the prior year at major events, suggesting current prohibition/detection regimes underreport and may be failing—an argument some use to consider harm-reduction or regulated use.",
        "source_5": "Bhasin, S. et al. (1996). “The effects of supraphysiologic doses of testosterone on muscle size and strength in normal men.” New England Journal of Medicine. — Demonstrates substantial, dose-dependent gains in muscle mass and strength from testosterone (even without exercise) with manageable short-term adverse effects, supporting the view that medically monitored enhancement can be effective and potentially safer than black-market use.",
        "source_6": "Murray, T.H. (2018). Good Sport: Why Our Games Matter—and How Doping Undermines Them. Oxford University Press. — Philosophically argues that permitting PEDs would coerce reluctant athletes into drug use and erode the meaning and integrity of sport, offering a values-based counterpoint to legalization."
    }
}