{
    "question": "Should women be allowed to compete in the same leagues as men?",
    "content": {
        "source_1": "World Athletics — World Records (official database). Shows persistent performance gaps between male and female world records across many events (e.g., 100 m: 9.58 vs 10.49; marathon: 2:00:35 vs 2:11:53), often cited to argue that fully open, single-sex leagues in speed/strength sports would disadvantage most women at elite levels. https://worldathletics.org/records",
        "source_2": "International Olympic Committee — Equestrian overview. Notes that equestrian is one of the few Olympic sports where men and women compete directly against each other on equal terms, with women winning medals, illustrating that mixed-sex elite competition can work in disciplines less dependent on absolute upper-body power. https://olympics.com/ioc/equestrian",
        "source_3": "U.S. Department of Education (Title IX) — 34 CFR §106.41(b) “Separate teams.” Federal regulation allows schools to operate separate sex-specific teams where selection is based on competitive skill or the sport is a contact sport, a framework often used to justify sex-segregated leagues to preserve equal participation opportunities for women. https://www.ecfr.gov/current/title-34/part-106/section-106.41",
        "source_4": "Centers for Disease Control and Prevention — HEADS UP: Concussion research summaries. Reports that female athletes have higher reported concussion rates than males in comparable sports (e.g., soccer, basketball), raising safety concerns about placing women in faster/higher-force men’s leagues in contact or collision sports. https://www.cdc.gov/heads-up",
        "source_5": "Darrin v. Gould, 85 Wn.2d 859 (Wash. 1975). The Washington Supreme Court held that excluding girls from a boys’ high school football team violated the state Equal Rights Amendment, supporting the principle that, where no equivalent team exists, blanket sex-based bans on trying out are unlawful. https://law.justia.com/cases/washington/supreme-court/1975/43360-1.html",
        "source_6": "BBC Sport — “Dutch FA allows woman to play in men’s first team” (Aug. 4, 2020). Reports on the KNVB pilot permitting Ellen Fokkema to play for a senior men’s amateur team, an example of a federation experimenting with mixed-sex competition in mainstream team sport without immediate systemic issues. https://www.bbc.com/sport/football/53657437"
    }
}