{
    "question": "Should the Guantanamo Bay detention centre be closed?",
    "content": {
        "source_1": "United Nations human rights experts (OHCHR) joint statement on Guantánamo (2023): UN Special Procedures, including the Working Group on Arbitrary Detention and the Special Rapporteur on Torture, concluded that prolonged, indefinite detention without fair trial and past ill-treatment at Guantánamo violate international human rights obligations and urged the United States to close the facility and provide redress to victims. Perspective: Close Guantánamo on human rights and rule-of-law grounds.",
        "source_2": "Office of the Director of National Intelligence (ODNI), unclassified summaries on former detainee reengagement (periodic, most recent available): ODNI reports a non-trivial, double‑digit percentage of released detainees confirmed or suspected of reengaging in terrorist or insurgent activity (with significantly lower rates among post‑2009 transfers). Perspective: Security risk evidence used to argue against closure or for extreme caution in transfers.",
        "source_3": "U.S. Government Accountability Office (GAO) analyses and Department of Defense budget justifications on Guantánamo operating costs: Government reports indicate the detention mission at Naval Station Guantánamo Bay costs hundreds of millions of dollars annually to house a small number of detainees, resulting in per‑detainee costs far higher than comparable U.S. facilities. Perspective: Fiscal inefficiency supports closing the facility and relocating detainees.",
        "source_4": "U.S. Supreme Court decisions — Rasul v. Bush (2004), Hamdan v. Rumsfeld (2006), Boumediene v. Bush (2008): The Court recognized that Guantánamo detainees can challenge detention in U.S. courts, struck down the initial military commission system as unauthorized, and affirmed constitutional habeas rights for detainees. Perspective: The legal foundations of the Guantánamo detention regime have been repeatedly curtailed, reinforcing arguments to end it.",
        "source_5": "National Defense Authorization Act (NDAA) transfer restrictions (recurring statutory provisions since 2011): Congress has prohibited transferring Guantánamo detainees to the U.S. mainland and imposed conditions on transfers abroad, and has restricted funds for closure. Perspective: Practical/legal obstacles — closure requires legislative change or policy shifts, complicating or undermining calls to close it.",
        "source_6": "Human Rights First and U.S. Department of Justice reporting on terrorism prosecutions and Bureau of Prisons capacity: Hundreds of terrorism-related cases have been successfully prosecuted in Article III courts with high conviction rates, and the Bureau of Prisons securely holds high‑risk terrorists in facilities like ADX Florence. Perspective: The U.S. has safe, proven alternatives for detention and trial, supporting the feasibility of closing Guantánamo."
    }
}