{
    "question": "Should persistent bullies be expelled?",
    "content": {
        "source_1": "National Academies of Sciences, Engineering, and Medicine (2016), “Preventing Bullying Through Science, Policy, and Practice.” Evidence: Synthesizes research showing bullying causes significant, lasting harm to targets (anxiety, depression, absenteeism, lower achievement) and undermines school climate. Perspective: Prioritizes victim safety; in cases of persistent, severe bullying that resists intervention, removal of the perpetrator can be justified to protect others.",
        "source_2": "American Psychological Association Zero Tolerance Task Force (2008), “Are Zero Tolerance Policies Effective in the Schools?” Evidence: Reviews find suspensions/expulsions do not improve school safety or student behavior, provide little deterrent effect, and are linked to worse academic and behavioral outcomes. Perspective: Opposes expelling persistent bullies as a default; recommends tiered, evidence-based responses over exclusionary discipline.",
        "source_3": "U.S. Department of Education, Office for Civil Rights, Civil Rights Data Collection (various years) and IDEA discipline provisions. Evidence: Documents disproportionate use of suspensions/expulsions on students of color and students with disabilities; IDEA requires manifestation determinations and limits expulsion when behavior is disability-related. Perspective: Warns that blanket expulsion policies for persistent bullies risk unlawful discrimination and inequity; emphasizes legal safeguards and individualized consideration.",
        "source_4": "Ttofi, M. M., & Farrington, D. P. (2011), Campbell Systematic Review of school-based anti-bullying programs. Evidence: Meta-analysis shows whole-school anti-bullying programs (e.g., clear rules, staff training, increased supervision, parent engagement) reduce bullying perpetration on average by roughly one-fifth. Perspective: Presents effective alternatives that can curb repeat bullying without resorting to expulsion.",
        "source_5": "Council of State Governments Justice Center (2014), “The School Discipline Consensus Report.” Evidence: Finds frequent use of suspension/expulsion correlates with lower achievement, higher dropout, and greater justice-system contact; recommends reserving expulsion for the most serious, ongoing safety threats, coupled with due process and access to alternative education. Perspective: Conditional stance—supports expulsion only for persistent bullies who pose continuing safety risks after documented interventions, with safeguards to mitigate collateral harm."
    }
}