{
    "question": "Should Joe Calzaghe be recognized as one of the greatest boxers of all time?",
    "content": {
        "source_1": "International Boxing Hall of Fame — “Joe Calzaghe (Class of 2014 Inductee)” (2014). https://www.ibhof.com — Official Hall of Fame biography noting Calzaghe retired 46-0 (32 KOs), held the WBO super middleweight title for a decade with a record number of defenses, unified titles, and won the lineal championship at both super middleweight and light heavyweight—evidence for all-time-level career achievement.",
        "source_2": "BBC Sport — “Calzaghe outclasses Lacy” (5 March 2006). http://news.bbc.co.uk/sport2/hi/boxing/4776428.stm — Ringside report of Calzaghe’s dominant unification win over the then-unbeaten, heavily favored IBF champion Jeff Lacy, framing it as a masterclass that elevated Calzaghe’s standing with a signature victory over a prime opponent.",
        "source_3": "ESPN — Dan Rafael, “Calzaghe stays perfect, wins split decision over Hopkins” (20 April 2008). https://www.espn.com/sports/boxing/news/story?id=3356536 — Fight recap emphasizing that Calzaghe’s win came via a close, often ugly split decision against a 43-year-old Bernard Hopkins, highlighting a common critique that some marquee wins were over aging legends rather than prime elites.",
        "source_4": "The Ring — “The 10 best super middleweights in history” (feature list; author Lee Groves). https://www.ringtv.com — Historical ranking placing Calzaghe at or near the top of the all-time super middleweight list, supporting the view that he is among the greatest ever at his weight and, by extension, worthy of broader all-time consideration.",
        "source_5": "The Guardian — “Calzaghe beats Roy Jones Jr on points — but questions remain over legacy” (9 November 2008). https://www.theguardian.com/sport/2008/nov/09/boxing-joe-calzaghe-roy-jones — Post-fight analysis noting Roy Jones Jr.’s advanced age and decline, Calzaghe’s late arrival on the U.S. stage, and a résumé padded with WBO mandatories—arguments used by skeptics to downplay his all-time standing."
    }
}