{
    "question": "Should handguns be banned in Washington, D.C.?",
    "content": {
        "source_1": "Loftin, McDowall, Wiersema, Cottey (1991) — Effects of Restrictive Licensing of Handguns on Homicide and Suicide in the District of Columbia (New England Journal of Medicine). Using an interrupted time-series design, the authors found DC’s 1976 handgun ban was associated with significant declines in firearm homicides (about 25%) and firearm suicides, with no offsetting rise in non-firearm deaths. This is evidence that sharply restricting handgun availability in DC can reduce gun deaths. https://www.nejm.org/doi/full/10.1056/NEJM199103213241206",
        "source_2": "District of Columbia v. Heller, 554 U.S. 570 (2008) — U.S. Supreme Court. The Court struck down DC’s handgun ban, holding that the Second Amendment protects an individual right to possess handguns in the home for self-defense and that a categorical ban on handguns is unconstitutional. This creates a direct legal barrier to any renewed handgun ban in DC. https://www.supremecourt.gov/opinions/07pdf/07-290.pdf",
        "source_3": "ATF Firearms Trace Data — District of Columbia (2021). ATF trace reports show a large share of crime guns recovered in DC originate from out-of-state sources (e.g., Virginia, Maryland, Georgia, North Carolina), reflecting interstate trafficking. This suggests that a local handgun ban may be undermined by cross-border supply unless coordinated with broader regional controls. https://www.atf.gov/resource-center/firearms-trace-data-2021",
        "source_4": "Rudolph, Stuart, Vernick, Webster (2015) — Association Between Connecticut’s Permit-to-Purchase Handgun Law and Homicides (American Journal of Public Health). A difference-in-differences analysis found Connecticut’s handgun purchaser licensing law was associated with a roughly 40% reduction in firearm homicide rates. While not a ban, it provides evidence that tightening access to handguns can substantially lower gun homicides, supporting the rationale behind strong restrictions. https://ajph.aphapublications.org/doi/10.2105/AJPH.2015.302703",
        "source_5": "Bureau of Justice Statistics (2019) — Source and Use of Firearms Involved in Crimes: Survey of Prison Inmates, 2016. Among prisoners who possessed a gun during their offense, about 90% did not obtain it from a retail source; many acquired guns via the underground market or from friends/family. This indicates that banning lawful handgun possession may have limited effect on criminal access to guns. https://bjs.ojp.gov/content/pub/pdf/suficspi16.pdf",
        "source_6": "FBI Crime Data (e.g., Crime Data Explorer; Expanded Homicide/SHR data). FBI data show that most homicides in the District of Columbia involve firearms, and among identified firearm types, handguns are the most commonly used. This supports the view that targeting handguns specifically addresses the predominant weapon in DC homicides. https://cde.ucr.fbi.gov/"
    }
}