{
    "question": "Should torture be used to obtain information from suspected terrorists?",
    "content": {
        "source_1": "United Nations General Assembly — Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (1984). States an absolute legal ban on torture with no exceptions for war, terrorism, or public emergencies; adopting torture as policy would violate binding international law.",
        "source_2": "U.S. Senate Select Committee on Intelligence — Committee Study of the CIA’s Detention and Interrogation Program (Executive Summary) (2014). Concluded, based on internal CIA records, that coercive techniques did not yield unique, actionable intelligence, frequently produced false or misleading information, and that the CIA overstated effectiveness to policymakers.",
        "source_3": "High-Value Detainee Interrogation Group (HIG) — Interrogation: A Review of the Science (2016) and related meta-analyses (e.g., Meissner et al., 2014). Empirical research finds rapport-based, information-gathering methods are more effective than coercion at eliciting reliable, detailed, and verifiable information, while coercive methods increase error and false confessions.",
        "source_4": "Alan M. Dershowitz — Why Terrorism Works: Understanding the Threat, Responding to the Challenge (2002). Argues that in rare “ticking time bomb” scenarios, tightly regulated “torture warrants” might be justified to prevent mass-casualty attacks, proposing judicial oversight to constrain abuses.",
        "source_5": "Central Intelligence Agency — “CIA Comments on the Senate Select Committee on Intelligence Report on the Former Detention and Interrogation Program” (2014). Contends that enhanced interrogation produced critical, otherwise unobtainable intelligence that contributed to disrupting plots and targeting al-Qa’ida leadership, disputing the SSCI’s conclusions.",
        "source_6": "U.S. Department of the Army — FM 2-22.3 (FM 34-52) Human Intelligence Collector Operations (2006; rev. 2015). Prohibits torture on legal, ethical, and strategic grounds, asserting that coercion yields unreliable information, undermines U.S. legitimacy, fuels enemy recruitment, and endangers forces."
    }
}