{
    "question": "Should the government be required to obtain warrants to access data that can be used to track an individual?",
    "content": {
        "source_1": "Carpenter v. United States, 138 S. Ct. 2206 (2018) — U.S. Supreme Court held that accessing historical cell-site location information (CSLI) is a Fourth Amendment “search” and generally requires a warrant, recognizing that long-term location data is “deeply revealing” of a person’s life. https://www.supremecourt.gov/opinions/17pdf/16-402_h315.pdf",
        "source_2": "Smith v. Maryland, 442 U.S. 735 (1979) and United States v. Miller, 425 U.S. 435 (1976) — The “third-party doctrine”: individuals lack a reasonable expectation of privacy in data voluntarily shared with third parties (e.g., dialed phone numbers, bank records), enabling government access without a warrant; a framework that continues to inform arguments for non-warrant access to certain tracking-adjacent records despite later narrowing in Carpenter. https://supreme.justia.com/cases/federal/us/442/735/ and https://supreme.justia.com/cases/federal/us/425/435/",
        "source_3": "18 U.S.C. § 2703(d) and 18 U.S.C. §§ 3121–3127 (Stored Communications Act and Pen Register/Trap-and-Trace) — Federal statutes authorize compelled disclosure of non-content records (e.g., subscriber information, IP logs, routing metadata) under standards lower than probable cause (e.g., “specific and articulable facts” or agency certification), which can facilitate government tracking or pattern-of-life analysis without a full warrant. https://www.law.cornell.edu/uscode/text/18/2703 and https://www.law.cornell.edu/uscode/text/18/3122",
        "source_4": "Kelsey Smith Act (state laws) — Dozens of U.S. states require wireless carriers to disclose a phone’s location to law enforcement without a warrant in emergencies involving risk of death or serious physical harm, reflecting a public-safety argument for warrantless access to tracking data under exigent circumstances. National Conference of State Legislatures overview: https://www.ncsl.org/telecommunications-and-information-technology/kelsey-smith-act",
        "source_5": "de Montjoye, Yves-Alexandre et al., “Unique in the Crowd: The privacy bounds of human mobility,” Scientific Reports 3, 1376 (2013) — Empirical study shows that just four spatio-temporal points can uniquely identify 95% of individuals in an anonymized mobility dataset, underscoring the extraordinary sensitivity of location data and supporting warrant requirements for access. https://www.nature.com/articles/srep01376",
        "source_6": "Tau, Byron, “Federal Agencies Use Cellphone Location Data for Immigration Enforcement,” Wall Street Journal (Feb. 7, 2020) — Reporting that DHS components purchased commercially available smartphone location data (e.g., from Venntel) to track movements without court warrants, highlighting a loophole that some argue should be closed by requiring warrants even for government purchases of tracking data. https://www.wsj.com/articles/federal-agencies-use-cellphone-location-data-for-immigration-enforcement-11581078600"
    }
}