{
    "question": "Is it worth voting?",
    "content": {
        "source_1": "Downs, Anthony (1957). An Economic Theory of Democracy. Harper. Core argument: In large-scale elections the probability that any one vote is pivotal is vanishingly small, so, on strictly instrumental cost–benefit grounds (absent civic duty or intrinsic benefits), voting is not “worth it.”",
        "source_2": "Edlin, Aaron; Gelman, Andrew; Kaplan, Noah (2007). Voting as a Rational Choice: Why and How People Vote to Improve the Well-Being of Others. Rationality and Society. Finding: Even with extremely low pivot probabilities (e.g., around one-in-millions in competitive races), modest altruism and high social stakes can make the expected social benefit of casting a vote exceed the personal costs—making voting rationally “worth it.”",
        "source_3": "Schneider, Gregory S.; Vozzella, Laura (Dec. 20, 2017). Virginia House race ends in a tie, leaving control of chamber up in the air. The Washington Post. Evidence: The Virginia House of Delegates District 94 election finished 11,608–11,608 and was decided by drawing lots; control of the chamber hinged on that seat. One additional vote would have changed the seat—and the balance of power—illustrating that a single vote can be outcome-determinative in specific contests.",
        "source_4": "Fowler, Anthony (2013). Electoral and Policy Consequences of Voter Turnout: Evidence from Compulsory Voting in Australia. Quarterly Journal of Political Science. Result: Using Australia’s adoption of compulsory voting as a natural experiment, higher turnout increased vote shares for left-of-center parties and shifted policy toward greater public spending/redistribution—showing aggregate voting behavior alters policy outputs.",
        "source_5": "Gilens, Martin; Page, Benjamin I. (2014). Testing Theories of American Politics: Elites, Interest Groups, and Average Citizens. Perspectives on Politics. Conclusion: Across 1,779 policy outcomes (1981–2002), the independent influence of average citizens’ preferences on policy was minimal compared to economic elites and organized interests, suggesting individual votes may have limited impact on policy direction.",
        "source_6": "Gerber, Alan S.; Green, Donald P.; Shachar, Ron (2003). Voting May Be Habit-Forming: Evidence from a Randomized Field Experiment. American Journal of Political Science. Finding: Being mobilized to vote once causally increases the likelihood of voting in subsequent elections by several percentage points, implying a single act of voting can create a durable participation habit that amplifies long-run impact."
    }
}