{
    "question": "Should civil liberties be sacrificed for the greater good?",
    "content": {
        "source_1": "Jacobson v. Massachusetts, 197 U.S. 11 (1905) — U.S. Supreme Court upheld compulsory smallpox vaccination, holding that individual liberty can be curtailed when “the safety of the general public may demand,” a canonical precedent for sacrificing certain civil liberties to protect public health. https://supreme.justia.com/cases/federal/us/197/11/",
        "source_2": "Haug, N. et al. (2020). Ranking the effectiveness of worldwide COVID-19 government interventions. Nature Human Behaviour. Finds that stringent non-pharmaceutical interventions—such as stay-at-home orders, school closures, and gathering bans—significantly reduced transmission, indicating that temporary restrictions on movement and assembly produced measurable public health benefits. https://www.nature.com/articles/s41562-020-01009-0",
        "source_3": "Privacy and Civil Liberties Oversight Board (2014). Report on the Telephone Records Program Conducted under Section 215 of the USA PATRIOT Act. Concluded the NSA’s bulk telephony metadata program provided only minimal, non-essential counterterrorism value, suggesting that sweeping surveillance sacrifices of privacy were not justified by commensurate security gains. https://fas.org/irp/offdocs/pclob-215.pdf",
        "source_4": "Commission on Wartime Relocation and Internment of Civilians (1983). Personal Justice Denied. The official inquiry found no military necessity for Japanese American internment during WWII; decisions were driven by “race prejudice, war hysteria, and a failure of political leadership,” documenting severe harms when civil liberties are curtailed in the name of the “greater good.” https://www.archives.gov/research/japanese-americans/justice-denied",
        "source_5": "Siracusa Principles on the Limitation and Derogation Provisions in the ICCPR (1984). Authoritative guidance holds that rights restrictions in emergencies must be lawful, necessary, proportionate, non-discriminatory, and time-bound—supporting narrowly tailored, temporary sacrifices of civil liberties but rejecting broad or indefinite curtailments. https://www.icj.org/siracusa-principles-on-the-limitation-and-derogation-provisions-in-the-international-covenant-on-civil-and-political-rights/",
        "source_6": "Bjørnskov, C. & Voigt, S. (2018). The Architecture of Emergency Constitutions. Cambridge University Press. Cross-national evidence shows emergency provisions are frequently associated with expanded and enduring rights restrictions, with weak evidence of improved security outcomes—warning of a “ratchet effect” where temporary sacrifices become permanent. https://www.cambridge.org/core/books/architecture-of-emergency-constitutions/9BFC9553EAF1F173AB48CEAE108C3136"
    }
}