{
    "question": "Should everyone go vegetarian?",
    "content": {
        "source_1": "Dinu, M., Abbate, R., Gensini, G. F., Casini, A., & Sofi, F. (2017). Vegetarian, vegan diets and multiple health outcomes: A systematic review with meta-analysis of observational studies. Critical Reviews in Food Science and Nutrition. Finds vegetarian diets are associated with substantially lower ischemic heart disease risk (~25% lower) and modestly lower cancer incidence (~8% lower) compared with non‑vegetarian diets. DOI: 10.1080/10408398.2017.1313351",
        "source_2": "Poore, J., & Nemecek, T. (2018). Reducing food’s environmental impacts through producers and consumers. Science. Shows that shifting from current average diets to plant‑based diets can reduce food‑related greenhouse gas emissions by up to ~49% and land use by up to ~76%; animal products supply a minority of calories but dominate land use and emissions. DOI: 10.1126/science.aaq0216",
        "source_3": "Tong, T. Y. N., Appleby, P. N., Bradbury, K. E., et al. (2019). Risks of ischaemic heart disease and stroke in meat eaters, fish eaters, and vegetarians over 18 years of follow-up: EPIC‑Oxford. BMJ. Reports vegetarians had a 22% lower risk of ischaemic heart disease but a 20% higher risk of stroke (especially haemorrhagic), indicating potential health trade‑offs of population‑wide vegetarianism. DOI: 10.1136/bmj.l4897",
        "source_4": "van Zanten, H. H. E., Herrero, M., van Hal, O., Röös, E., et al. (2018). Defining a land boundary for sustainable livestock consumption. Global Food Security, 19, 21–30. Estimates that if livestock were fed only non‑edible biomass (e.g., grass on marginal lands, crop residues, food by‑products), they could supply roughly 9–23 g of animal protein per person per day without competing with crops—supporting a targeted role for some livestock rather than universal vegetarianism. https://www.sciencedirect.com/science/article/pii/S2211912417301225",
        "source_5": "IPCC (2019). Special Report on Climate Change and Land (SRCCL). Concludes that improved grazing land management can sequester on the order of 0.3–1.7 Gt CO2‑eq per year and provide co‑benefits for land degradation and desertification; while plant‑rich diets reduce emissions, the report highlights region‑specific roles for livestock and cautions against one‑size‑fits‑all prescriptions. https://www.ipcc.ch/srccl/",
        "source_6": "Gephart, J. A., Henriksson, P. J. G., Parker, R. W. R., et al. (2021). Environmental performance of blue foods. Nature. Finds many wild‑capture fisheries and aquaculture species have lower greenhouse‑gas and land‑use footprints than most terrestrial animal foods, with some approaching plant proteins—undermining the claim that eliminating all animal‑source foods is necessary for environmental goals. DOI: 10.1038/s41586-021-03889-2"
    }
}