{
    "question": "Is it good to gossip?",
    "content": {
        "source_1": "Evolutionary anthropology (Robin Dunbar’s “gossip-as-grooming” hypothesis): Proposes that conversational gossip evolved to replace physical grooming as a low-cost way to maintain cohesion and alliances in large groups, making it adaptive and socially beneficial by bonding individuals and managing coalitions.",
        "source_2": "Experimental social science (PNAS 2014, Feinberg, Willer, et al.): Laboratory public-goods experiments found that allowing participants to share reputational information (gossip) and ostracize free riders increased cooperation and reduced exploitation compared to controls, indicating a prosocial, norm-enforcing function of gossip.",
        "source_3": "Communication and psychology research: Surveys and experiments report that people often gossip to help others and regulate emotions; sharing information about norm violations can provide relief to the speaker, prepare recipients to avoid harm, and strengthen ties through shared values, showing interpersonal and informational benefits when motives are prosocial.",
        "source_4": "Organizational behavior findings: Field and survey studies link negative workplace gossip to lower trust and psychological safety, reduced team performance and knowledge sharing, higher burnout, and stronger turnover intentions, suggesting net harms in professional settings.",
        "source_5": "Developmental mental health evidence: Longitudinal research on adolescents shows that rumor-spreading (a form of relational aggression) predicts increased depression, anxiety, social withdrawal, and academic disengagement among targets, indicating significant psychological costs of being gossiped about.",
        "source_6": "Ethical and legal perspectives: Many religious traditions condemn gossip/backbiting on moral grounds (e.g., Judaism’s lashon hara; Christian texts such as James 3; Qur’an 49:12), and modern law can classify certain gossip as defamation or invasion of privacy; viral public shaming demonstrates how gossip can inflict disproportionate, lasting reputational harm."
    }
}