{
    "question": "Should the Republika Srpska be allowed to secede from Bosnia and Herzegovina?",
    "content": {
        "source_1": "Dayton Peace Agreement, Annex 4 (Constitution of Bosnia and Herzegovina), 1995 — Establishes Bosnia and Herzegovina as a single sovereign state composed of two entities with one international legal personality; provides no constitutional mechanism for entity secession and places entities under the supremacy of state institutions. This is commonly cited to argue RS has no legal right to secede.",
        "source_2": "International Court of Justice, Advisory Opinion on Kosovo (2010) — Concluded that international law contains no general prohibition on unilateral declarations of independence. Pro-secession advocates invoke this to argue that, under certain conditions, a peaceful RS declaration would not itself violate international law; opponents note the opinion did not confer a right to secede and concerned a different legal context.",
        "source_3": "Arbitration Commission of the Conference on Yugoslavia (Badinter Commission), Opinions Nos. 2 and 3 (1991–1992) — Held that the right to self-determination attached to Yugoslav republics and that their internal borders became inviolable international borders upon dissolution. This is used to argue that RS, as an entity within BiH rather than a former republic, lacks a claim to external self-determination.",
        "source_4": "Statements and resolutions from Republika Srpska leadership (e.g., RS National Assembly conclusions and public remarks by Milorad Dodik, 2010s–2020s) — Assert that state-level “centralization” has violated Dayton, claim a right to “restore” entity competencies, and threaten or pursue referendums as expressions of self-determination. These are presented as political justification for allowing RS to choose independence if alleged constitutional breaches persist.",
        "source_5": "Peace Implementation Council Steering Board communiqués; Office of the High Representative (Annex 10); EU/US/UK sanctions and EUFOR Althea posture (2021–2024) — Reaffirm that secession is unacceptable and a breach of Dayton, warn of destabilization, impose sanctions on RS officials over secessionist moves, and increase EUFOR presence. This evidence underscores international opposition and the security and economic costs of permitting RS secession.",
        "source_6": "ICTY and ICJ findings on atrocity crimes in Bosnia (e.g., ICTY Prosecutor v. Krstić; ICJ Bosnia and Herzegovina v. Serbia and Montenegro, 2007) and Annex 7 (refugee/returnee rights) — Establish genocide at Srebrenica and widespread ethnic cleansing; critics argue allowing RS to secede would entrench wartime territorial results and jeopardize returnee rights, while supporters may counter that contemporary self-determination claims can be separated from wartime crimes."
    }
}