{
    "question": "Should creationism be discussed in school science lessons?",
    "content": {
        "source_1": "National Academy of Sciences & Institute of Medicine — “Science, Evolution, and Creationism” (2008). Concludes that creationism and intelligent design are not science, lack empirical support, and should not be presented as scientific alternatives to evolution; evolution is foundational to modern biology. https://nap.nationalacademies.org/catalog/11876/science-evolution-and-creationism",
        "source_2": "Kitzmiller v. Dover Area School District, 400 F. Supp. 2d 707 (M.D. Pa. 2005). A federal court ruled that intelligent design is a religious view, not science, and that teaching it as an alternative to evolution in public school science classes violates the Establishment Clause. https://law.justia.com/cases/federal/district-courts/FSupp2/400/707/2521039/",
        "source_3": "Pew Research Center — “Public Divided on Origins of Life” (Aug. 17, 2005). Surveys found a majority of Americans favored teaching creationism alongside evolution in public schools, indicating substantial public support for discussing creationism in science education. https://www.pewresearch.org/religion/2005/08/17/public-divided-on-origins-of-life/",
        "source_4": "Michael J. Reiss (Royal Society education director at the time) — reported remarks on discussing creationism in class (2008). Argues that when students raise creationist beliefs, science teachers should address them respectfully to clarify the nature of science and improve learning, while not teaching creationism as valid science. https://www.theguardian.com/science/2008/sep/12/royalsociety.evolution",
        "source_5": "Discovery Institute, Center for Science & Culture — “Should Public Schools Teach Intelligent Design?” and related “Academic Freedom” materials. Advocates not mandating ID, but encouraging critical analysis of evolution and discussing its “strengths and weaknesses” to promote critical thinking; positions discussion as pedagogically beneficial. https://www.discovery.org/a/3164/ and https://www.discovery.org/id/education/",
        "source_6": "Council of Europe Parliamentary Assembly — Resolution 1580: “The dangers of creationism in education” (2007). Recommends that creationism not be taught as a scientific discipline in schools; if addressed, it belongs in cultural or religious studies, not science lessons. https://assembly.coe.int/nw/xml/XRef/Xref-XML2HTML-en.asp?fileid=17592"
    }
}