{
    "question": "Do all nations have a right to nuclear weapons?",
    "content": {
        "source_1": "Treaty on the Non-Proliferation of Nuclear Weapons (NPT), 1968 — The treaty recognizes only five nuclear-weapon states and obligates all other parties not to acquire nuclear weapons (Articles I–II), while affirming an “inalienable right” only to peaceful nuclear energy (Article IV) and committing all parties to pursue disarmament (Article VI). This framework rejects any general right for all nations to possess nuclear weapons. https://www.un.org/disarmament/wmd/nuclear/npt/text",
        "source_2": "International Court of Justice, Advisory Opinion on the Legality of the Threat or Use of Nuclear Weapons (1996) — The ICJ found no comprehensive and universal prohibition of nuclear weapons in international law and could not definitively rule out their legality “in an extreme circumstance of self-defence” when a state’s survival is at stake, while also affirming a legal obligation to pursue disarmament. This ambiguity is invoked both to contest and to support claims of a state prerogative to hold nuclear deterrents. https://www.icj-cij.org/public/files/case-related/95/095-19960708-ADV-01-00-EN.pdf",
        "source_3": "Treaty on the Prohibition of Nuclear Weapons (TPNW), 2017 — This treaty bans development, testing, production, acquisition, possession, stockpiling, use, and threat of use of nuclear weapons for its parties, reflecting a humanitarian-law-driven view that there is no right to such arms. Its growing membership contrasts with the non-participation of nuclear-armed states, illustrating a sharp normative divide. https://www.un.org/disarmament/wmd/nuclear/tpnw/",
        "source_4": "Kenneth N. Waltz, “Why Iran Should Get the Bomb” (Foreign Affairs, 2012) — Waltz argues that nuclear proliferation can enhance regional and global stability through deterrence and balance of power, and that preventing certain states from acquiring nuclear weapons can be destabilizing. This realist perspective implies a legitimate security-based rationale for additional states to obtain nuclear weapons. https://www.foreignaffairs.com/articles/iran/2012-06-15/why-iran-should-get-bomb",
        "source_5": "Scott D. Sagan, “The Perils of Proliferation: Organization Theory, Deterrence Theory, and the Spread of Nuclear Weapons” (International Security, 1994) — Sagan contends that more nuclear-armed states increase risks of accidents, unauthorized use, and escalation due to organizational failures and imperfect command-and-control, arguing against any general entitlement to nuclear weapons on safety and stability grounds. https://www.jstor.org/stable/2539108",
        "source_6": "Draft Report of India’s National Security Advisory Board on Indian Nuclear Doctrine (1999) — Articulates India’s “credible minimum deterrent,” rejects the NPT’s discriminatory structure, and asserts a sovereign prerogative to maintain nuclear weapons for national security, exemplifying a state practice and political justification that challenges the notion that only some nations may possess nuclear arms. https://mea.gov.in/in-focus-article.htm?18916/Draft+Report+of+National+Security+Advisory+Board+on+Indian+Nuclear+Doctrine"
    }
}