{
    "question": "Should boys go to boys-only schools?",
    "content": {
        "source_1": "Pahlke, E., Hyde, J. S., & Allison, C. (2014). The Effects of Single-Sex Compared With Coeducational Schooling on Students’ Performance and Attitudes: A Meta-Analysis. Psychological Bulletin. Synthesis of 184 studies found no reliable academic advantage of single-sex over coeducational schooling once selection and methodological biases are controlled, suggesting the average boy does not perform better simply by attending a boys-only school.",
        "source_2": "Lavy, V., & Schlosser, A. (2011). Mechanisms and Impacts of Gender Peer Effects at School. Journal of the European Economic Association. Using large administrative data from Israel, the authors show that having a higher share of girls in coed classes improves test scores and reduces disruptions for both genders; for boys, exposure to female peers is beneficial—evidence against segregating boys.",
        "source_3": "Park, H., Behrman, J. R., & colleagues (2013). Causal Effects of Single-Sex Schools on Exam Scores and College Outcomes: Evidence from South Korea. Using quasi-random assignment to single-sex vs. coed high schools within districts, the study finds single-sex schools raise test scores and college attendance, with notable gains for boys—evidence that boys-only settings can boost achievement in some systems.",
        "source_4": "Jackson, C. K. (2012). Single-Sex Schools, Student Achievement, and Course Selection: Evidence from Rule-Based Student Assignments in Trinidad and Tobago. Journal of Public Economics. Exploiting policy-based assignment, single-sex schools increased exam participation and altered course-taking; effects on achievement were positive (larger for girls), while boys experienced changes in curricular choices and school climate—suggesting context-specific benefits that are not purely academic.",
        "source_5": "Sullivan, A., Joshi, H., & Leonard, D. (2010). Single-sex Schooling and Academic Attainment at School and Through the Life Course. Oxford Review of Education. Using the 1970 British Cohort Study, the authors find limited overall attainment differences after controls, but boys from single-sex schools were more likely to choose languages/arts (less gender-typical choices), indicating boys-only environments may broaden subject selection without clear long-term earnings gains.",
        "source_6": "Halpern, D. F., Eliot, L., Bigler, R. S., et al. (2011). The Pseudoscience of Single-Sex Schooling. Science. A critical review arguing that purported neuroscientific justifications for single-sex education are weak and that segregation may heighten gender stereotyping and bias; advises caution in promoting boys-only schools absent strong, generalizable evidence."
    }
}