{
    "question": "Has the United Nations failed?",
    "content": {
        "source_1": "UN Independent Inquiry into the actions of the United Nations during the 1994 genocide in Rwanda (Ingvar Carlsson et al., 1999) — The inquiry concluded the UN failed to prevent or stop the genocide due to a weak mandate, inadequate troop levels, and failures of leadership and early warning response, offering direct evidence of catastrophic UN peacekeeping failure.",
        "source_2": "Security Council Report, Research Report: The Veto (various editions, e.g., 2020/2023) — Documents how repeated vetoes by permanent members (e.g., on Syria since 2011 and on Ukraine-related resolutions since 2022) have paralyzed the Security Council, highlighting structural design flaws that impede the UN’s capacity to act.",
        "source_3": "Independent Inquiry Committee into the United Nations Oil-for-Food Programme, Final Report (Paul A. Volcker, 2005) — Found widespread corruption, kickbacks, and oversight failures within a flagship UN-administered program, evidencing institutional mismanagement and integrity failures.",
        "source_4": "United Nations, The Millennium Development Goals Report 2015 — Reports that global extreme poverty was more than halved since 1990, primary school enrollment rose markedly, and child mortality declined substantially, indicating major UN-coordinated development successes that contradict blanket claims of failure.",
        "source_5": "Virginia Page Fortna, Does Peacekeeping Work? Shaping Belligerents’ Choices after Civil War (Princeton University Press, 2008) — Empirical analysis shows UN peacekeeping significantly reduces the risk of renewed war and saves lives, supporting the view that UN operations are often effective despite high-profile failures.",
        "source_6": "Thomas G. Weiss, What’s Wrong with the United Nations and How to Fix It (Polity, multiple editions; 2016) — Argues the UN’s shortcomings stem largely from member-state politics, underfunding, and the Charter’s constraints; contends the UN is indispensable but needs reform rather than being deemed a failure."
    }
}