{
    "question": "Should poor communities be subsidized?",
    "content": {
        "source_1": "Busso, M., Gregory, J., and Kline, P. (2013). Assessing the Incidence and Efficiency of a Prominent Place-Based Policy. American Economic Review. Evidence from federal Empowerment Zones shows sizable increases in local employment and wages within targeted neighborhoods, suggesting that place-based subsidies can boost economic activity where poverty is concentrated.",
        "source_2": "U.S. Census Bureau (Creamer, J., Burns, K., et al.) (2022). Poverty in the United States: 2021 (Supplemental Poverty Measure). The report attributes a record low Supplemental Poverty Measure child poverty rate in 2021 largely to refundable tax credits, including the expanded Child Tax Credit, demonstrating that income supports can sharply reduce poverty among low-income families.",
        "source_3": "Bastagli, F., Hagen-Zanker, J., Harman, L., Barca, V., Sturge, G., Schmidt, T., and Pellerano, L. (2016). Cash transfers: what does the evidence say? ODI. Systematic review finds cash transfers consistently reduce monetary poverty and improve schooling and health service use, with little evidence of reduced adult labor supply—supporting the effectiveness of subsidies without strong work disincentive effects.",
        "source_4": "Susin, S. (2002). Rent vouchers and the price of low-income housing. Journal of Public Economics. Analysis of U.S. housing vouchers indicates rents at the low end of the market rose in response to voucher demand, implying that landlords can capture part of the subsidy and that place-based/tenant-based housing aid can bid up prices for poor households.",
        "source_5": "Chetty, R., Hendren, N., and Katz, L. F. (2016). The Effects of Exposure to Better Neighborhoods on Children: New Evidence from the Moving to Opportunity Experiment. American Economic Review. Children who moved from high- to low-poverty areas at young ages had significantly higher adult earnings and college attendance, suggesting people-based mobility assistance may yield larger long-run gains than subsidizing persistently poor neighborhoods.",
        "source_6": "Congressional Budget Office (2021). Estimated budgetary effects of permanently extending the 2021 Child Tax Credit expansion. CBO estimated that making the temporary CTC expansion permanent would cost on the order of $1.6 trillion over 10 years, highlighting fiscal trade-offs and sustainability concerns of large-scale subsidies."
    }
}