{
    "question": "Is voting for independence the best way to protect Scottish interests in the EU?",
    "content": {
        "source_1": "Scottish Government — Building a New Scotland: An independent Scotland in the EU (Nov 2023). Sets out the government’s case that independence would enable Scotland to rejoin the EU via Article 49, regain single-market and free-movement benefits, have direct representation in EU institutions, and better protect distinct Scottish interests (e.g., 62% Remain vote in 2016). https://www.gov.scot/publications/building-new-scotland-independent-scotland-european-union/",
        "source_2": "European Commission — Scotland would need to apply to join EU (BBC News, Jan 31, 2020). The Commission confirms Scotland would be a “third country” after UK exit and would not have automatic or fast-track entry; accession would follow the standard, potentially lengthy Article 49 process. https://www.bbc.com/news/uk-scotland-scotland-politics-51327140",
        "source_3": "Institute for Government — An independent Scotland and the EU (Sept 2022). Finds that while rejoining is feasible, Scotland would face significant practical hurdles: establishing an external border with the UK, building regulatory and customs infrastructure, and resolving currency arrangements (sterlingisation could complicate meeting EU/euro obligations), implying a multi‑year path with trade-offs. https://www.instituteforgovernment.org.uk/publication/independent-scotland-and-eu",
        "source_4": "Scottish Government — Export Statistics Scotland 2021 (published 2023). Reports that the rest of the UK accounts for around 60% of Scotland’s exports versus ~19% to the EU, indicating that EU accession could introduce new trade frictions with Scotland’s largest market, potentially offsetting EU single-market gains. https://www.gov.scot/publications/export-statistics-scotland-2021/",
        "source_5": "Scottish Fishermen’s Federation — Policy on the Common Fisheries Policy (ongoing brief). Longstanding critique that the EU’s CFP disadvantaged Scottish fleets through quota shares and management; rejoining the EU would mean re-entering the CFP, which many in the sector view as not serving Scotland’s interests. https://www.sff.co.uk/policy/common-fisheries-policy/",
        "source_6": "Donald Tusk interview — “Enthusiasm” to welcome Scotland to the EU (BBC News, Feb 2, 2020). The former European Council president expressed strong political sympathy for Scottish EU membership, suggesting a receptive political climate in Brussels for an independent Scotland seeking to join. https://www.bbc.com/news/uk-scotland-scotland-politics-51315462"
    }
}