{
    "question": "Should housewives be paid for their work?",
    "content": {
        "source_1": "Oxfam (2020), “Time to Care.” https://www.oxfam.org/en/research/time-care - Estimates the monetary value of women’s unpaid care work at $10.8 trillion annually and argues that economies rely on this invisible labor, supporting policies that recognize and remunerate it.",
        "source_2": "The Hindu (Jan 5, 2021), “A homemaker’s ‘work’ is of great value: Supreme Court.” https://www.thehindu.com/news/national/a-homemakers-work-is-of-great-value-supreme-court/article33511044.ece - Reporting on India’s Supreme Court ruling (Kirti & Anr v. Oriental Insurance Co.) that recognized the economic value of a homemaker’s work for compensation calculations, bolstering the case that such labor merits explicit monetary recognition.",
        "source_3": "International Labour Organization (2018), “Care work and care jobs for the future of decent work.” https://www.ilo.org/global/publications/books/WCMS_633135/lang--en/index.htm - Finds that 16.4 billion hours of unpaid care are performed daily (three-quarters by women), but recommends expanding public care services, leave, and social protection rather than wages-for-housework, to avoid reinforcing traditional gender roles.",
        "source_4": "Rønsen, M. and S. Skarðhamar (2011), “Do cash-for-care benefits reduce maternal labor supply?” Labour Economics. https://www.sciencedirect.com/science/article/pii/S0927537111000044 - Using Norway’s cash‑for‑care program, the study finds reduced employment among eligible mothers, suggesting that paying for home care/housework can depress female labor force participation and entrench gendered divisions.",
        "source_5": "The Economist (Jan 16, 2021), “India’s politicians weigh paying housewives a salary.” https://www.economist.com/asia/2021/01/16/indias-politicians-weigh-paying-housewives-a-salary - Raises practical and normative concerns: defining eligible “housework,” risks of fraud, fiscal costs, and the possibility of cementing patriarchal norms, arguing against state wages for housewives.",
        "source_6": "Baker, M., J. Gruber, and K. Milligan (2008), “Universal Child Care, Maternal Labor Supply, and Family Well‑Being.” Journal of Political Economy. https://www.journals.uchicago.edu/doi/10.1086/591908 - Evidence from Quebec shows subsidized child care substantially increased mothers’ labor supply; this is cited as an alternative policy lever to paying housewives directly, aiming to value care while promoting workforce attachment."
    }
}