{
    "question": "Should previous convictions be disclosed in court?",
    "content": {
        "source_1": "England & Wales — Criminal Justice Act 2003, ss. 98–113 (bad character evidence) and R v Hanson [2005] EWCA Crim 824: Permits disclosure of a defendant’s previous convictions through specified gateways (e.g., to show propensity or correct a false impression), subject to judicial balancing; Hanson cautions that propensity must be genuinely probative and not unduly prejudicial.",
        "source_2": "United States — Federal Rules of Evidence 404(a), 404(b), 609, and 403: Generally bar using prior crimes to prove propensity (404(a)); allow limited use for non-propensity purposes like motive or intent (404(b)); permit impeachment of credibility by certain convictions (609), all subject to Rule 403’s unfair-prejudice balancing—favoring non-disclosure in the guilt phase except for narrow purposes.",
        "source_3": "California — Evidence Code §§1108 and 1109 (sexual and domestic violence offenses): Create express statutory exceptions allowing admission of prior sexual or domestic violence offenses to show propensity, subject to prejudice balancing under §352; reflects a policy choice favoring disclosure in specific crime categories.",
        "source_4": "United States — Old Chief v. United States, 519 U.S. 172 (1997): Holds that when a prior conviction is an element (e.g., felon-in-possession), a defendant’s offer to stipulate can require the government to forgo disclosing the name/nature of the prior offense to avoid unfair prejudice—supporting tightly limited disclosure.",
        "source_5": "Canada — Canada Evidence Act, RSC 1985, c C-5, s. 12 and R v Corbett, [1988] 1 SCR 670: Allows cross-examination of an accused on prior convictions to attack credibility, but grants trial judges discretion to exclude such disclosure where its prejudicial effect on the issue of guilt outweighs probative value—an explicit balancing approach.",
        "source_6": "Sentencing phase practices — US Sentencing Guidelines Ch. 4 (Criminal History) and UK Sentencing Council guidelines on aggravating factors: Prior convictions are routinely disclosed and weighted at sentencing (e.g., criminal history category in the US; aggravation in England & Wales), even where disclosure was restricted during the trial—showing stage-dependent openness to prior-record evidence."
    }
}