{
    "question": "Should ID cards and the National Identity Register be scrapped?",
    "content": {
        "source_1": "LSE Identity Project (2005/2006) — “The Identity Project: An assessment of the UK Identity Cards Bill and its implications” — http://www.lse.ac.uk/identityproject/ — Independent analysis projected far higher lifetime costs and significant technical/administrative risks than government estimates, arguing the scheme was disproportionate and should be abandoned.",
        "source_2": "BBC News (2006) — “UK ‘sleepwalking into a surveillance society’” (reporting the Information Commissioner’s warning) — http://news.bbc.co.uk/2/hi/uk_news/6108496.stm — The Information Commissioner cautioned that a National Identity Register and ID cards risk enabling pervasive state surveillance and “function creep,” raising civil liberties concerns supporting scrappage.",
        "source_3": "UK Passport Service (2005) — “Biometrics Enrolment Trial Report” (archived) — https://webarchive.nationalarchives.gov.uk/ukgwa/+/http://www.identitycards.gov.uk/library/UKPSBiometricsEnrolmentTrialReport.pdf — Government-run trial found non-trivial failure-to-enrol and matching issues for fingerprints/iris, with higher failure among certain demographics, casting doubt on feasibility and inclusivity at population scale.",
        "source_4": "Identity and Passport Service (2008) — “National Identity Scheme: Delivery and Benefits” (archived) — https://webarchive.nationalarchives.gov.uk/ukgwa/20080807120855/http://www.ips.gov.uk/identity/assets/scheme_delivery_and_benefits_0711.pdf — Official case for ID cards/NIR claimed benefits in tackling identity fraud and illegal working, improving border security, and enabling easier access to services—an argument against scrapping.",
        "source_5": "OECD (2015) — “OECD Digital Government Review of Estonia: Toward Agile Government” — https://www.oecd-ilibrary.org/governance/oecd-digital-government-review-of-estonia_9789264229334-en — Documents how Estonia’s national eID underpins secure digital services and yields substantial efficiency gains (e.g., widespread digital signatures), suggesting a well-implemented national ID can deliver net benefits instead of being scrapped."
    }
}