{
    "question": "Should Turkey be allowed to join the European Union?",
    "content": {
        "source_1": "European Commission — Türkiye 2023 Report (Enlargement Package, Nov 2023). The Commission finds serious backsliding on rule of law, judicial independence, and fundamental rights, stating accession negotiations are effectively at a standstill, undermining prospects for EU membership.",
        "source_2": "Council of the European Union — Conclusions on Turkey (Dec 2006; reaffirmed subsequently). The Council froze eight negotiation chapters and barred provisional closure of any chapter due to Turkey’s non-implementation of the Additional Protocol (ports/airports closed to Cyprus), making the unresolved Cyprus issue a formal obstacle to accession.",
        "source_3": "European Commission — EU–Turkey Statement (18 March 2016) and Commission assessments. The agreement markedly reduced irregular crossings on the Eastern Mediterranean route compared with 2015 and deepened cooperation on migration management and security, highlighting geostrategic benefits of closer EU–Turkey integration.",
        "source_4": "European Commission, DG Trade — Countries and regions: Türkiye. The EU and Turkey have been in a customs union since 1995; the EU is Turkey’s largest trading partner and two‑way goods trade is around €200 billion annually, suggesting further integration could yield mutual economic gains.",
        "source_5": "International Monetary Fund — Turkey: 2024 Article IV Consultation Staff Concluding Statement. The IMF notes very high inflation and macroeconomic imbalances, with policy credibility being rebuilt only gradually—conditions that complicate meeting EU economic convergence and stability criteria.",
        "source_6": "United Nations, Department of Economic and Social Affairs — World Population Prospects 2022. Turkey’s median age is around 33, far younger than many EU members (often mid‑to‑high 40s), indicating a potential to alleviate EU workforce aging if accession enabled freer labor mobility."
    }
}