{
    "question": "Is the ICC biased against Africa?",
    "content": {
        "source_1": "African Union Assembly decisions alleging targeting of Africa: In 2013 and 2016, AU heads of state formally accused the ICC of unfairly targeting African leaders and considered a withdrawal strategy. For example, the AU Extraordinary Summit decision of Oct. 2013 on Africa’s relationship with the ICC expressed “concern” over the “indictment of African sitting Heads of State and Government” and urged non-cooperation in certain cases; in 2016, the AU adopted a “Withdrawal Strategy” decision citing perceptions of bias. Source: African Union Assembly decisions Ext/Assembly/AU/Dec.1(Oct.2013) and Assembly/AU/Dec.615(XXVII) (available via au.int); AU press communiqués 2013–2017.",
        "source_2": "Early case distribution largely in Africa but driven by African self-referrals: For roughly the ICC’s first decade, all situations under investigation were in Africa, but most were opened at the request of African governments themselves (Uganda, DRC, Central African Republic [two referrals], Mali), while two (Darfur, Libya) came via UN Security Council referrals and others (Kenya, Côte d’Ivoire) via prosecutorial requests/jurisdiction acceptances. This suggests docket composition reflected triggers rather than selection bias alone. Source: Human Rights Watch, “Q&A: The International Criminal Court and Africa” (2013, updated), and ICC “Situations and cases” listings.",
        "source_3": "Broadening beyond Africa undermining the bias claim: Since 2016 the ICC has opened or pursued significant non-African situations, including Georgia (2008 conflict), Bangladesh/Myanmar (Rohingya), Afghanistan, Palestine, and Ukraine. These steps show an expanding geographic focus. Sources: ICC press releases/decisions—Georgia investigation authorized (27 Jan 2016); Bangladesh/Myanmar investigation authorized (14 Nov 2019); Afghanistan investigation authorized on appeal (5 Mar 2020); Palestine jurisdiction decision (5 Feb 2021); Ukraine investigation opened after multiple state referrals (2 Mar 2022) at icc-cpi.int.",
        "source_4": "Structural power politics skew referrals toward Africa, not necessarily court bias: Every UN Security Council referral to the ICC to date has concerned an African situation (Darfur, Libya), while efforts to refer Syria were vetoed (UN Security Council, 22 May 2014). Major powers have also pressured the Court (e.g., U.S. Executive Order 13928 in 2020 sanctioning ICC personnel over the Afghanistan probe, later revoked), constraining action outside Africa and creating the appearance of regional bias. Sources: UNSC Res. 1593 (2005) and 1970 (2011); UN News on Syria referral veto (22 May 2014); Federal Register, EO 13928 (15 June 2020).",
        "source_5": "African victims’ groups and NGOs defend the ICC’s role on the continent: Numerous African civil society organizations have publicly supported the ICC, arguing it delivers otherwise unattainable justice for victims of grave crimes and urging governments not to withdraw. Example: 100+ African NGOs’ statements in 2013 and 2016 urging states to “strengthen, not weaken” engagement with the ICC and opposing mass withdrawal. Sources: Human Rights Watch/Coalition for the ICC joint statements (e.g., 10 Nov 2016 “African civil society reaffirms support for the ICC”; coalitionfortheicc.org; hrw.org).",
        "source_6": "Mixed record on powerful states fuels perceptions of double standards, but recent warrants cut against an Africa-only focus: The ICC closed its UK/Iraq preliminary examination in 2020 for complementarity reasons despite acknowledging credible abuse allegations, drawing criticism from NGOs, while in 2023 it issued arrest warrants for Russia’s President Vladimir Putin and Maria Lvova-Belova over Ukraine, indicating willingness to pursue non-African leaders when feasible. Sources: ICC OTP “Final Report: Situation in Iraq/UK” (9 Dec 2020) and HRW critique (9 Dec 2020); ICC press release on Putin/Lvova-Belova warrants (17 Mar 2023)."
    }
}