{
    "question": "Should Christians be allowed to wear the Cross at work?",
    "content": {
        "source_1": "European Court of Human Rights — Eweida and Others v United Kingdom, Judgment (15 Jan 2013). The Court held that British Airways’ ban on a customer-facing employee wearing a small cross necklace violated Article 9 (freedom of religion), finding the employer’s interest in projecting a corporate image insufficient to outweigh the employee’s right to manifest her religion.",
        "source_2": "European Court of Human Rights — Eweida and Others v United Kingdom, Judgment (15 Jan 2013), Chaplin aspect. In contrast, the Court upheld a hospital’s restriction on a nurse wearing a cross necklace due to health and safety on a clinical ward, recognizing infection-control and patient-safety risks as a legitimate and proportionate justification.",
        "source_3": "Court of Justice of the European Union — Achbita v G4S Secure Solutions NV, C‑157/15 (14 Mar 2017). The CJEU held that a company-wide neutrality policy banning visible religious, political, or philosophical symbols can be lawful if applied consistently and proportionately, allowing employers to prohibit visible crosses (along with other symbols) to pursue a legitimate neutrality aim.",
        "source_4": "U.S. Supreme Court — Groff v. DeJoy, 600 U.S. ___ (2023). The Court strengthened employees’ protection under Title VII by requiring employers to show “substantial increased costs” to deny a religious accommodation. This higher bar generally supports accommodating unobtrusive religious attire or jewelry, such as a cross, in U.S. workplaces absent concrete undue hardship.",
        "source_5": "UK Department of Health and Social Care — Uniforms and workwear: Guidance on uniform and workwear policies for NHS employers (2010, with subsequent updates). The guidance advises against necklaces and dangling jewelry in clinical areas for infection-control and safety reasons, indicating that cross necklaces may be legitimately restricted in healthcare settings to protect patients and staff."
    }
}