{
    "question": "Should the Internet be censored?",
    "content": {
        "source_1": "United Nations Human Rights Council, Independent International Fact-Finding Mission on Myanmar (2018), Report of the detailed findings. The Mission found that Facebook was extensively used to incite hatred and violence against the Rohingya and concluded the company’s failures in content moderation contributed to serious human rights violations—evidence often cited to argue for stricter online controls to prevent mass atrocities.",
        "source_2": "National Center for Missing & Exploited Children (NCMEC), 2023 CyberTipline Reports. NCMEC documented over 36 million reports of suspected child sexual exploitation in 2023, emphasizing the role of proactive detection and removal by platforms—supporting claims that robust, enforceable content restrictions are necessary to protect children.",
        "source_3": "Chandrasekharan, E., Pavalanathan, U., Srinivasan, A., Glynn, A., Eisenstein, J., & Gilbert, E. (2017). “You Can’t Stay Here”: The Efficacy of Reddit’s 2015 Ban Examined (CSCW). An empirical study showing that banning extremist and harassing subreddits led to significant reductions in hate speech on Reddit and among affected users—evidence that targeted platform “censorship” can reduce online harms.",
        "source_4": "Freedom House (2023), Freedom on the Net 2023. Documents the 13th consecutive year of global decline in internet freedom, driven in part by increased government censorship and surveillance, and links such restrictions with broader authoritarian consolidation—challenging the notion that the internet “must be censored.”",
        "source_5": "UN Special Rapporteur on freedom of opinion and expression (David Kaye) (2018), Report on content regulation by private actors (A/HRC/38/35). Warns that state mandates for general monitoring and automated filtering are incompatible with international human rights standards of legality, necessity, and proportionality, urging transparency and due process instead of broad censorship.",
        "source_6": "King, G., Pan, J., & Roberts, M. E. (2013). How Censorship in China Allows Government Criticism but Silences Collective Expression (American Political Science Review). Finds Chinese censorship primarily targets content that could mobilize collective action, suggesting state censorship often serves political control rather than public harm reduction—arguing against the idea that the internet “must be censored.”"
    }
}