{
    "question": "Should the United States sign the Ottawa Convention banning landmines?",
    "content": {
        "source_1": "Landmine Monitor 2023 — International Campaign to Ban Landmines/Cluster Munition Coalition, Nov. 2023. https://the-monitor.org/en-gb/reports/2023/landmine-monitor-2023/ Evidence: Reports at least 4,710 global casualties from landmines and explosive remnants of war in 2022, with the vast majority being civilians, and notes 164 States Parties to the Mine Ban Treaty—underscoring both the humanitarian toll and the widespread international norm against antipersonnel mines.",
        "source_2": "Fact Sheet: United States Aligns U.S. Policy with the Ottawa Convention — The White House, June 21, 2022. https://www.whitehouse.gov/briefing-room/statements-releases/2022/06/21/united-states-aligns-u-s-policy-with-the-ottawa-convention-on-anti-personnel-landmines/ Perspective: The U.S. pledged not to develop, produce, acquire, or use antipersonnel mines outside the Korean Peninsula and aims to eventually accede, but maintains an exception for the defense of South Korea—framing signature as principally constrained by the Korea contingency.",
        "source_3": "U.S. Policy on Antipersonnel Landmines (IF11292) — Congressional Research Service, updated 2022/2023. https://crsreports.congress.gov/product/pdf/IF/IF11292 Perspective: Outlines the military utility debate, noting the U.S. has not used victim-activated antipersonnel mines since 1991 and that U.S. stocks emphasize self-destruct/self-deactivate features claimed to reduce long-term danger; assesses potential capability gaps and alternatives if a total ban were adopted.",
        "source_4": "To Walk the Earth in Safety (2024 edition) — U.S. Department of State, 2024. https://www.state.gov/reports/to-walk-the-earth-in-safety-2024/ Perspective: Documents that the United States is the world’s largest funder of mine action, providing more than $4.6 billion in conventional weapons destruction assistance since 1993—suggesting Washington wields substantial humanitarian leadership even without joining the treaty, or conversely that signature would align policy with its funding leadership.",
        "source_5": "Statement by the Republic of Korea to the Mine Ban Treaty 20th Meeting of States Parties — Republic of Korea, Nov. 21, 2022. https://www.apminebanconvention.org/meetings-of-the-states-parties/20msp/20msp-statements Perspective: South Korea reiterates it cannot accede due to the unique security situation and reliance on mines for defense of the DMZ—highlighting alliance and deterrence considerations that underpin the U.S. Korea exception and arguments against immediate U.S. signature.",
        "source_6": "Ukraine: Banned Landmines Harm Civilians — Human Rights Watch, Jan. 31, 2023. https://www.hrw.org/news/2023/01/31/ukraine-banned-landmines-harm-civilians Evidence/Perspective: Documents alleged use of PFM-1 antipersonnel mines by Ukraine (a State Party), causing civilian harm and prompting calls for investigation and accountability—illustrating both the real-world harm of APL and enforcement/compliance challenges even among treaty members."
    }
}