{
    "question": "Should basic income tax be abolished?",
    "content": {
        "source_1": "OECD, Tax Policy Reform and Economic Growth (OECD Tax Policy Studies No. 20, 2010). Cross‑country evidence finds that shifting the tax mix away from personal income and toward consumption and recurrent property taxes is associated with higher long‑run GDP, suggesting that reducing or abolishing income taxes and replacing them with less distortive bases can raise growth.",
        "source_2": "Institute for Fiscal Studies, The Mirrlees Review: Tax by Design (Oxford University Press/IFS, 2011). The review argues that well‑designed systems should tax immobile bases (e.g., land values) and consumption more heavily while relying less on earnings taxation, because income taxes distort labor supply and savings; it proposes substantial moves toward land value taxation as an efficiency‑enhancing alternative.",
        "source_3": "U.S. National Taxpayer Advocate, Annual Report to Congress (various years; e.g., 2022). Documents that the U.S. individual income tax imposes a very large compliance burden—billions of hours and hundreds of billions of dollars annually—due to complexity and administrative frictions, implying sizable deadweight losses that abolition or radical simplification could mitigate.",
        "source_4": "OECD, Revenue Statistics 2023. Reports that, on average across OECD countries, personal income taxes account for roughly a quarter of total tax revenue, making them a cornerstone of fiscal capacity; abolishing them would create large revenue gaps that must be filled by other taxes or spending cuts to avoid deficits.",
        "source_5": "IMF, Fiscal Monitor: Tackling Inequality (October 2017). Concludes that progressive personal income taxes are a key tool for reducing post‑tax income inequality; scrapping them and shifting toward broad consumption taxes would tend to raise inequality unless offset by robust, well‑targeted transfers.",
        "source_6": "Center on Budget and Policy Priorities, Kansas’ Tax Cut Experiment (2017/2019 analyses). Evaluates Kansas’s large income tax cuts (2012–2017) and finds they produced significant revenue shortfalls, credit downgrades, and economic underperformance relative to peers, cautioning that deep cuts to income taxes do not reliably pay for themselves or spur strong growth."
    }
}