{
    "question": "Was the US intervention in Libya, lacking congressional approval, illegal?",
    "content": {
        "source_1": "War Powers Resolution (50 U.S.C. §§ 1541–1548) — The statute requires the President to terminate the use of U.S. armed forces within 60 days in the absence of a declaration of war or specific congressional authorization, with a limited 30-day withdrawal extension (50 U.S.C. § 1544(b)). “Hostilities” is not defined, creating interpretive disputes central to the Libya debate. Text: https://www.law.cornell.edu/uscode/text/50/1544",
        "source_2": "White House, “United States Activities in Libya” (June 15, 2011) — The administration argued U.S. operations did not constitute “hostilities” under the War Powers Resolution because they involved no U.S. ground troops, limited risk of U.S. casualties, and a supporting role (ISR, refueling, targeting) within a NATO mission. On that basis, it claimed no need for new congressional authorization after 60 days. PDF: https://obamawhitehouse.archives.gov/sites/default/files/Libya_Report_06152011.pdf",
        "source_3": "Charlie Savage and Mark Landler, “2 Top Lawyers Lost to Obama in Libya War Policy Debate,” New York Times (June 17, 2011) — Reported that the Pentagon General Counsel (Jeh Johnson) and the acting head of OLC (Caroline Krass) advised that U.S. actions in Libya did amount to “hostilities” under the WPR, triggering the 60-day limit and requiring congressional authorization, but President Obama adopted the contrary view advanced by the State Department’s Legal Adviser. https://www.nytimes.com/2011/06/18/us/politics/18powers.html",
        "source_4": "House of Representatives actions (112th Congress, June 2011) — The House voted down an authorization of force for Libya (H.J.Res. 68 failed 123–295 on June 24, 2011), indicating no statutory authorization was granted; it also passed a rebuke demanding more information (H.Res. 292 on June 3, 2011). These votes underscore the absence of congressional approval even as funding cutoffs failed. H.J.Res. 68: https://www.congress.gov/bill/112th-congress/house-joint-resolution/68",
        "source_5": "Kucinich v. Obama, 821 F. Supp. 2d 110 (D.D.C. 2011) — A suit by Members of Congress alleging the Libya operation violated the War Powers Resolution was dismissed for lack of standing and other justiciability grounds. The court did not reach the merits, illustrating that the judiciary did not declare the intervention illegal (and often declines to adjudicate such disputes).",
        "source_6": "Office of Legal Counsel, “Authority to Use Military Force in Libya” (Apr. 1, 2011) — OLC concluded the President had Article II authority to initiate limited military operations in Libya, to protect national interests and enforce U.N. Security Council Resolution 1973, without prior congressional authorization, given the anticipated limited nature, scope, and duration of the mission. https://www.justice.gov/olc/opinion/authority-use-military-force-libya"
    }
}