{
    "question": "Should year-round schooling be introduced?",
    "content": {
        "source_1": "RAND Corporation – Policy analysis of districts using year‑round calendars: Finds average effects on standardized test scores are small or mixed overall; modest gains, when present, tend to appear where schools build structured “intersession” remediation into the calendar. Notes implementation trade‑offs (transportation, scheduling, extracurriculars) that can dilute academic benefits.",
        "source_2": "National Summer Learning Association – Research synthesis on summer learning loss: Documents that students, especially from low‑income families, lose significant ground over long summer breaks; argues that shortening the summer via year‑round calendars can reduce this loss and narrow achievement gaps, particularly when intersessions provide targeted support.",
        "source_3": "Wake County Public School System (NC) – District operations and facilities reports on multi‑track year‑round schools: Shows year‑round calendars can increase building capacity by roughly 20–33% (e.g., four tracks with three in session at a time), delaying or avoiding new construction; also flags higher summer utility costs and tighter maintenance windows as operational downsides.",
        "source_4": "Afterschool and parent advocacy surveys (e.g., Afterschool Alliance/local PTA coalitions) – Family impact findings: Parents report greater difficulty arranging childcare, coordinating vacations, and accessing traditional summer camps; teens have fewer uninterrupted weeks for seasonal jobs or internships, and siblings on different calendars create logistical strain.",
        "source_5": "Teacher workforce and labor group briefings (e.g., state NEA/AFT affiliates) – Staffing and professional development perspective: Frequent shorter breaks can reduce burnout for some educators, but fragmented calendars complicate multi‑day professional learning, second jobs, and family schedules; districts report mixed effects on recruitment/retention, with some teachers preferring traditional summers.",
        "source_6": "School nutrition and public health sources (e.g., USDA Food and Nutrition Service, School Nutrition Association) – Food security and attendance: Because participation in summer meal programs is much lower than during the school year, year‑round calendars can provide more consistent access to school meals and associated services; some districts report improved attendance and behavior among food‑insecure students when long summer gaps are shortened."
    }
}