{
    "question": "Should there be compulsory testing and labeling of people with HIV?",
    "content": {
        "source_1": "WHO/UNAIDS – Consolidated Guidelines on HIV Testing Services (2015; updates 2019). These guidelines state that HIV testing must be voluntary, confidential, and based on informed consent (with narrow exceptions like blood/organ screening and unlinked surveillance); they explicitly oppose mandatory testing and public disclosure (“labeling”) because it violates rights, fuels stigma, and deters people from seeking testing and care. Source: World Health Organization/UNAIDS, Consolidated guidelines on HIV testing services.",
        "source_2": "CDC – Revised Recommendations for HIV Testing of Adults, Adolescents, and Pregnant Women in Health-Care Settings (MMWR, 2006). The CDC recommends routine, opt-out HIV screening in medical settings as a non-coercive strategy that increases case identification and linkage to care. U.S. experience with routine prenatal screening (opt-out) has contributed to >90% declines in perinatal HIV transmission, suggesting broad public health gains are achievable without compulsory testing or labeling. Source: Centers for Disease Control and Prevention, MMWR 55(RR-14):1–17; CDC HIV and perinatal transmission factsheets.",
        "source_3": "Granich RM et al. – Universal voluntary HIV testing with immediate antiretroviral therapy as a strategy for elimination of HIV transmission: a mathematical model (The Lancet, 2009). Modeling for high-prevalence settings suggests that annual universal testing coupled with immediate ART could drastically reduce incidence and potentially eliminate transmission over time. Proponents of compulsory testing/labeling cite such models to argue that rapidly identifying all people living with HIV would accelerate treatment-as-prevention benefits and protect the public. Source: The Lancet 373(9657):48–57.",
        "source_4": "California Penal Code § 1202.1 – Mandatory HIV testing of persons convicted of specified sexual offenses (ongoing statute). California law requires courts to order HIV testing of individuals convicted of certain sexual crimes, with results disclosed to victims. This legal precedent reflects a viewpoint that compulsory testing and limited disclosure can be justified to protect identifiable third parties at risk. Source: California Legislative Information, Cal. Penal Code § 1202.1.",
        "source_5": "EEOC – Living with HIV Infection: Your Legal Rights in the Workplace Under the ADA (guidance, updated). U.S. federal law treats HIV as a disability; employers generally may not require HIV tests, must keep medical information confidential, and may not disclose an employee’s status. This framework indicates that compulsory “labeling” conflicts with anti-discrimination and privacy protections in employment. Source: U.S. Equal Employment Opportunity Commission guidance under the Americans with Disabilities Act.",
        "source_6": "Musheke M. et al. – Reasons for non-uptake of HIV testing in sub-Saharan Africa: a systematic review (BMC Public Health, 2013). Across studies, fear of stigma, discrimination, and breaches of confidentiality were major barriers to accepting HIV testing and to timely care. This evidence suggests that compulsory testing and labeling could backfire by driving people away from services, undermining epidemic control. Source: BMC Public Health 13:220."
    }
}