{
    "question": "Has the use of mobile phones lowered active social life and become an addiction?",
    "content": {
        "source_1": "Misra, S., Cheng, L., Genevie, J., & Yuan, M. (2016). The iPhone Effect: The Quality of In-Person Social Interactions in the Presence of Mobile Devices. Environment and Behavior. Field experiments found that the mere presence of a mobile phone during face-to-face conversations reduced perceived conversational quality, empathy, and rapport, suggesting phones can dampen active in-person social connection. (https://doi.org/10.1177/0013916514539755)",
        "source_2": "Twenge, J. M. (2017). iGen: Why Today’s Super-Connected Kids Are Growing Up Less Rebellious, More Tolerant, Less Happy—and Completely Unprepared for Adulthood. Using large U.S. surveys, Twenge argues that after 2010—coinciding with smartphone ubiquity—teens reported less frequent in-person socializing, dating, and going out, consistent with a displacement of offline social life by mobile media. (https://www.simonandschuster.com/books/iGen/Jean-M-Twenge/9781501152016)",
        "source_3": "Sohn, S. Y., Rees, P., Wildridge, B., Kalk, N. J., & Carter, B. (2019). Prevalence of problematic smartphone usage and associated mental health outcomes amongst children and young people: A systematic review, meta-analysis and GRADE of the evidence. BMC Psychiatry. Pooled estimates indicated that a sizable minority (around one in four in many samples) meet thresholds for “problematic smartphone use,” which was associated with poorer mental health—evidence consistent with addiction-like patterns in some users. (https://bmcpsychiatry.biomedcentral.com/articles/10.1186/s12888-019-2350-x)",
        "source_4": "Orben, A., & Przybylski, A. K. (2019). Screens, Teens, and Psychological Well-Being: Evidence From Three Time-Use-Diary Studies. Nature Human Behaviour. Analyses of large, preregistered datasets found that digital technology use explained at most a tiny fraction of variance in adolescent well-being, challenging strong claims that phones broadly harm social or psychological health. (https://www.nature.com/articles/s41562-018-0506-1)",
        "source_5": "Pew Research Center (2015). Teens, Technology and Friendships. Survey data showed that mobile phones and social media often facilitate, rather than replace, social life: 57% of teens reported making a new friend online and many said technology helps them feel more connected to friends and coordinate meetups. (https://www.pewresearch.org/internet/2015/08/06/teens-technology-and-friendships/)",
        "source_6": "American Psychiatric Association; World Health Organization (DSM-5-TR, 2022; ICD-11). Neither DSM-5-TR nor ICD-11 recognizes “smartphone addiction” as a formal diagnosis (ICD-11 includes Gaming Disorder, but not smartphone addiction), indicating ongoing debate and caution about labeling general mobile phone use as an addiction. (DSM-5-TR overview: https://www.psychiatry.org/psychiatrists/practice/dsm; ICD-11 Gaming Disorder: https://icd.who.int/)"
    }
}