{
    "question": "Should military action to intervene during atrocities without United Nations Security Council approval be considered legal?",
    "content": {
        "source_1": "UK Government, “Chemical weapon use by Syrian regime — UK Government legal position,” 29 Aug 2013. Sets out a state practice view that a narrow doctrine of humanitarian intervention exists in customary international law, allowing force without Security Council authorization if three conditions are met: extreme humanitarian distress, no practicable alternative, and necessity/proportionality of the force used.",
        "source_2": "International Court of Justice, Military and Paramilitary Activities in and against Nicaragua (Nicaragua v. United States), Merits, Judgment (1986), para. 268; and Armed Activities on the Territory of the Congo (DRC v. Uganda), Judgment (2005), para. 201. The ICJ rejected a purported right of unilateral humanitarian intervention, stating that respect for human rights cannot justify the use of force absent Security Council authorization or valid consent.",
        "source_3": "UN General Assembly, Resolution 377 A (V) “Uniting for Peace” (3 Nov 1950). Provides that when the Security Council fails to act due to lack of unanimity among its permanent members, the General Assembly may recommend collective measures, including “the use of armed force when necessary”; some scholars and states cite this as a lawful avenue for collective action to halt atrocities without Security Council approval.",
        "source_4": "UN General Assembly, 2005 World Summit Outcome, GA Res. 60/1, paras. 138–139. Codifies the Responsibility to Protect as a political commitment and emphasizes that collective action to halt mass atrocity crimes is to be taken “through the Security Council,” signaling that unilateral or GA-recommended uses of force are not generally accepted as lawful bases.",
        "source_5": "International Law Commission, Articles on Responsibility of States for Internationally Wrongful Acts (2001), Art. 20 (Consent). Establishes that valid consent by the territorial state precludes the wrongfulness of what would otherwise be a violation of the prohibition on the use of force; thus, military assistance to stop atrocities can be lawful without Security Council approval if the host state invites it and the consent is genuine and not coerced.",
        "source_6": "Independent International Commission on Kosovo, The Kosovo Report (2000). Assessed NATO’s 1999 intervention as “illegal but legitimate,” indicating that, under then-prevailing law, intervening without Security Council approval lacked a legal basis despite humanitarian imperatives—supporting the view that such actions are not (yet) legal even if morally compelling."
    }
}