{
    "question": "Should nuclear waste be stored underground?",
    "content": {
        "source_1": "OECD Nuclear Energy Agency (2008) — “Moving Forward with Geological Disposal of Radioactive Waste.” Concludes that deep geological repositories are the reference, internationally endorsed solution for long-term management of high-level radioactive waste, emphasizing passive, multi-barrier safety over geologic timescales.",
        "source_2": "Government Offices of Sweden (Press release, 27 Jan 2022) — “Government gives go-ahead for the final repository for spent nuclear fuel.” Authorizes SKB’s KBS-3 repository at Forsmark (~500 m depth, copper canisters with bentonite buffer) after decades of review, indicating regulators judged the long-term safety case sufficient to proceed under a stepwise licensing regime.",
        "source_3": "U.S. Department of Energy, Accident Investigation Board (April 2015) — “Radiological Release Event at the Waste Isolation Pilot Plant.” Investigates the Feb 2014 barrel breach that caused a radiological release and a multi-year shutdown; illustrates that underground repositories can experience failures due to human and procedural errors, with significant operational and cost consequences.",
        "source_4": "Land and Environment Court (Nacka District Court, Sweden) Statement on SKB’s application (23 Jan 2018, Case M 1333-11). The court flagged unresolved uncertainties about long-term copper canister corrosion and buffer erosion, recommending against approval until clarified; reflects scientific dispute over whether engineered barriers can reliably contain waste for 100,000+ years.",
        "source_5": "U.S. Nuclear Regulatory Commission (Sept 2014) — NUREG-2157, “Generic Environmental Impact Statement for Continued Storage of Spent Nuclear Fuel.” Finds that extended dry-cask storage at or near the surface can meet safety standards for many decades to a century or more (with surveillance and maintenance), suggesting underground disposal need not be immediate and that monitorable alternatives exist.",
        "source_6": "Blue Ribbon Commission on America’s Nuclear Future (Jan 2012) — “Report to the Secretary of Energy.” While endorsing geologic disposal in principle, concludes that lack of consent and trust (e.g., Yucca Mountain) undermines implementation; recommends consent-based siting and new institutional frameworks, highlighting social-license and environmental justice concerns with siting underground repositories."
    }
}