{
    "question": "Should the United States maintain its embargo against Cuba?",
    "content": {
        "source_1": "U.S. Department of State — 2023 Country Reports on Human Rights Practices: Cuba (released 2024). Documents widespread political repression, including mass arrests and harsh sentences for participants in the July 11, 2021 protests, restrictions on expression/assembly, and ongoing political prisoner detentions—evidence cited by proponents that maintaining pressure (including the embargo) is warranted until concrete human-rights reforms occur. https://www.state.gov/reports/2023-country-reports-on-human-rights-practices/cuba/",
        "source_2": "United Nations General Assembly — “General Assembly Renews Call for United States to End Embargo against Cuba” (Press Release GA/12542, 2 Nov 2023). The Assembly voted 187–2–1 urging an end to the embargo, with many states condemning its extraterritorial effects and humanitarian impact; used by opponents to argue the policy is internationally isolated and harmful to civilians. https://press.un.org/en/2023/ga12542.doc.htm",
        "source_3": "Heritage Foundation — Ana Rosa Quintana, “After Cuba’s Protests, the U.S. Should Keep Pressure on the Regime” (July 2021). Argues sanctions should be maintained because Cuba’s military-run conglomerate GAESA controls major hard‑currency sectors (tourism, retail, ports); easing restrictions would funnel resources to the security apparatus rather than independent civil society. https://www.heritage.org/americas/commentary/after-cubas-protests-the-us-should-keep-pressure-the-regime",
        "source_4": "The Wall Street Journal — Warren P. Strobel et al., “Cuba to Host Secret Chinese Spy Base Focusing on U.S.” (June 8, 2023). Reports on a planned Chinese signals‑intelligence facility in Cuba, highlighting Havana’s alignment with U.S. rivals; cited by supporters as a national‑security rationale for keeping the embargo. https://www.wsj.com/articles/cuba-to-host-secret-chinese-spy-base-focusing-on-u-s-7d8c8a2f",
        "source_5": "Oxfam — “Right to Live Without a Blockade” (Report, 2021). Details how U.S. sanctions and financial restrictions impede access to medicines, medical equipment, and humanitarian goods—exacerbated by over‑compliance by banks—and disproportionately burden women and families; evidence for critics that the embargo harms civilians more than the state. https://www.oxfamamerica.org/explore/research-publications/right-to-live-without-a-blockade/",
        "source_6": "Congressional Research Service — IF10045, “Cuba: U.S. Policy Overview” (regularly updated; 2023–2024). Explains that the Helms‑Burton (LIBERTAD) Act codified the embargo and sets statutory conditions (e.g., a transition government and free elections) for its termination, meaning lifting it requires congressional action—an institutional/legal constraint shaping the policy debate. https://crsreports.congress.gov/product/pdf/IF/IF10045"
    }
}