{
    "question": "Is Christianity the greatest deception of today?",
    "content": {
        "source_1": "Bowler, Kate. Blessed: A History of the American Prosperity Gospel (Oxford University Press, 2013). Documents how prosperity preachers promise health and wealth in exchange for donations, using case studies and financial records to show exploitative fundraising practices that critics label deceptive within segments of contemporary Christianity.",
        "source_2": "Ehrman, Bart D. Forged: Writing in the Name of God—Why the Bible’s Authors Are Not Who We Think They Are (HarperOne, 2011). Argues several New Testament letters are pseudonymous, presenting textual and historical analyses that some interpret as evidence of intentional deception in early Christian authorship.",
        "source_3": "Office of Attorney General, Commonwealth of Pennsylvania. Report I of the 40th Statewide Investigating Grand Jury (2018). Details decades of clergy sexual abuse and systematic cover-ups by Catholic Church leadership in Pennsylvania, evidencing institutional deception toward parishioners and the public.",
        "source_4": "Wright, N. T. The Resurrection of the Son of God (Fortress Press, 2003). Makes a historical case that the earliest Christian belief in Jesus’s bodily resurrection is best explained by real experiences rather than fabrication, directly challenging the claim that Christianity is fundamentally deceptive.",
        "source_5": "Olivier, Jill; Tsimpo, Clarence; Gemignani, Regina; Shojo, Mari; Coulombe, Harold; Dimmock, Frank; et al. Understanding the roles of faith-based health-care providers in Africa: review of the evidence (The Lancet, 2015). Finds Christian-affiliated organizations deliver a substantial share of health services in multiple African countries, highlighting tangible social benefits that complicate any simple characterization of Christianity as deception.",
        "source_6": "Norenzayan, Ara. Big Gods: How Religion Transformed Cooperation and Conflict (Princeton University Press, 2013). Proposes that religions with moralizing, omniscient deities (including Christianity) spread because they enhance social cooperation, reframing persistence and influence as cultural adaptation rather than proof of truth or of deception."
    }
}