{
    "question": "Are federal states better than unitary nations?",
    "content": {
        "source_1": "Oates, Wallace E. (1999). \"An Essay on Fiscal Federalism.\" Journal of Economic Literature 37(3): 1120–1149. Summarizes theoretical and empirical support for the Decentralization Theorem: when local preferences and conditions vary and spillovers are limited, decentralized (federal) provision of public goods yields more efficient and welfare-enhancing outcomes than uniform national policies.",
        "source_2": "Gerring, John, and Strom C. Thacker (2004). \"Political Institutions and Corruption: The Role of Unitarism and Parliamentarism.\" British Journal of Political Science 34(2): 295–330. Cross-national analysis finds unitary states are associated with lower levels of corruption (controlling for development and other institutions), suggesting centralized authority can improve accountability and policy coherence relative to federal systems.",
        "source_3": "Rodden, Jonathan (2006). Hamilton’s Paradox: The Promise and Peril of Fiscal Federalism. Cambridge University Press. Shows that federations often face “soft budget constraints” and bailout expectations among subnational governments, increasing risks of deficits and fiscal crises; more centralized (unitary) arrangements can more easily enforce fiscal discipline.",
        "source_4": "Brancati, Dawn (2006). \"Decentralization: Fueling the Fire or Dampening the Flames of Ethnic Conflict and Secessionism?\" International Organization 60(3): 651–685. Finds that political decentralization can reduce ethnic conflict by accommodating regional demands, but it also strengthens regional parties and can heighten secessionist pressures—highlighting both stabilizing and destabilizing effects of federal designs.",
        "source_5": "Blöchliger, Hansjörg, and Balázs Égert (2013). \"Decentralisation and Economic Growth – Part 2: The Impact on Economic Activity, Productivity and Investment.\" OECD Economics Department Working Papers. Empirical evidence across OECD countries links revenue decentralization and subnational tax autonomy to higher GDP per capita and productivity growth (up to a point), while spending decentralization alone shows mixed effects—implying conditional economic advantages for federal-style fiscal decentralization.",
        "source_6": "Greer, Scott L., Elizabeth J. King, Elize Massard da Fonseca, and Andre Peralta-Santos, eds. (2021). Coronavirus Politics: The Comparative Politics and Policy of COVID-19. University of Michigan Press. Comparative case studies indicate that federations such as the United States, Brazil, and India experienced fragmented, conflictual pandemic responses, whereas several unitary states (e.g., New Zealand) mounted faster, coordinated national actions—suggesting unitary structures can outperform federations in urgent, nationwide crises."
    }
}