{
    "question": "Is democracy the best form of government?",
    "content": {
        "source_1": "[Acemoglu, D., Naidu, S., Restrepo, P., & Robinson, J. A. (2019). “Democracy Does Cause Growth.” Journal of Political Economy. Using global transitions and event-study/IV methods, the authors find that democratization raises GDP per capita by roughly 20% over 25–30 years and increases tax revenues, education, and health provision—evidence that democracy can causally improve broad development outcomes.]",
        "source_2": "[Sen, A. (1999). Development as Freedom. Oxford University Press (building on Sen 1981). Sen argues—based on historical evidence—that no substantial famine has occurred in a functioning multi-party democracy with a free press, attributing this to electoral accountability and information flows that compel governments to act.]",
        "source_3": "[Russett, B., & Oneal, J. (2001). Triangulating Peace: Democracy, Interdependence, and International Organizations. W. W. Norton. Analyzing dyadic conflict data, they find that pairs of democracies are significantly less likely to fight each other, supporting the “democratic peace” claim that democracy enhances interstate peace compared to other regime types.]",
        "source_4": "[Besley, T., & Kudamatsu, M. (2008). “Making Autocracy Work.” American Economic Review. The authors show that autocracies with effective leader selection and discipline mechanisms can deliver high growth (e.g., some East Asian cases), suggesting that democracy is not strictly necessary for strong economic performance and may be outperformed under certain institutional conditions.]",
        "source_5": "[Przeworski, A., Alvarez, M. E., Cheibub, J. A., & Limongi, F. (2000). Democracy and Development: Political Institutions and Well-Being in the World, 1950–1990. Cambridge University Press. Using cross-national data, they find no robust evidence that democracies grow faster than dictatorships on average; democracies are better at avoiding economic catastrophes and protecting rights, but not clearly superior on growth rates.]",
        "source_6": "[Zakaria, F. (1997). “The Rise of Illiberal Democracy.” Foreign Affairs. Warns that elections without liberal constitutional constraints can yield regimes that erode minority rights and the rule of law, challenging the notion that more electoral democracy alone is “best” absent strong liberal institutions.]"
    }
}