{
    "question": "Should people have the right to die?",
    "content": {
        "source_1": "Carter v. Canada (Attorney General), 2015 SCC 5 — Supreme Court of Canada. The Court struck down the blanket criminal prohibition on physician-assisted death for competent adults with grievous and irremediable conditions, citing autonomy, dignity, and the right to life, liberty, and security of the person, while emphasizing the feasibility of safeguards. https://scc-csc.lexum.com/scc-csc/scc-csc/en/item/14637/index.do",
        "source_2": "Washington v. Glucksberg, 521 U.S. 702 (1997) — U.S. Supreme Court. The Court held there is no fundamental constitutional right to physician-assisted suicide and upheld state bans, stressing state interests in preserving life, preventing suicide, protecting vulnerable populations, and maintaining medical ethics. https://www.law.cornell.edu/supremecourt/text/521/702",
        "source_3": "Oregon Health Authority — Oregon Death with Dignity Act Annual Reports (e.g., 2023 Data Summary). Long-running state data show the program accounts for a small fraction of deaths; most participants are in hospice, and the most common reasons cited are loss of autonomy, decreasing ability to engage in activities, and loss of dignity, with low reported complication rates. https://www.oregon.gov/oha/PH/PROVIDERPARTNERRESOURCES/EVALUATIONRESEARCH/DEATHWITHDIGNITYACT/Pages/ar-index.aspx",
        "source_4": "Health Canada — Fourth Annual Report on Medical Assistance in Dying (MAID) in Canada, 2022. Reports 13,241 MAID deaths in 2022 (4.1% of all deaths), a 31% increase from 2021, documenting rapid growth and national patterns that inform debates about access, oversight, and system capacity. https://www.canada.ca/en/health-canada/services/medical-assistance-dying/annual-report-2022.html",
        "source_5": "National Council on Disability (U.S.), The Danger of Assisted Suicide Laws (2019). A disability rights analysis arguing that assisted-suicide regimes pose risks of coercion, diagnostic error, and economic pressure, and that safeguards are insufficient to protect disabled and marginalized people. https://ncd.gov/publications/2019/danger-assisted-suicide-laws",
        "source_6": "Kim SYH, De Vries RG, Peteet JR. Euthanasia and Assisted Suicide of Patients With Psychiatric Disorders in the Netherlands: 2011–2014. JAMA Psychiatry. 2016;73(4):362-368. Case review highlighting challenges in assessing decisional capacity, voluntariness, and treatment resistance in psychiatric cases, raising concerns about consistency and safeguards when extending right-to-die to mental illness. https://jamanetwork.com/journals/jamapsychiatry/fullarticle/2491356"
    }
}