{
    "question": "Is the money we spend on our Olympic medal count money well spent?",
    "content": {
        "source_1": "BBC Sport (Tom Fordyce), “How National Lottery funding transformed British sport” (2016) — Documents how targeted, performance-based funding after 1996 led to a step-change in outcomes: from 15 medals (1 gold) at Atlanta 1996 to 65 at London 2012 and 67 at Rio 2016, indicating the funding model is highly effective at delivering the policy goal of more medals. https://www.bbc.com/sport/olympics/37037777",
        "source_2": "The Guardian (Sean Ingle), “Team GB’s Olympic medals cost £345m — is that value for money?” (2021) — Reports UK Sport invested about £345m in Olympic programs for the Tokyo cycle; with 65 medals, that equates to roughly £5.3m per medal, raising concerns about opportunity cost and whether such elite funding is an efficient public spend. https://www.theguardian.com/sport/2021/aug/08/team-gb-olympic-medals-funding-value-for-money",
        "source_3": "Weed, M. et al., “The Olympic Games and physical activity: A systematic review” (Sports Medicine, 2015) — Finds little robust evidence that elite success or hosting drives sustained increases in mass sport participation (“demonstration effect”), challenging a common rationale that medal-focused spending benefits public health. https://link.springer.com/article/10.1007/s40279-014-0241-5",
        "source_4": "Kavetsos, G. & Szymanski, S., “National well-being and international sports events” (Journal of Economic Psychology, 2010) — Shows that major sporting success produces measurable, albeit temporary, increases in national life satisfaction; such intangible “feel-good” gains can be interpreted as benefits that help justify elite-performance spending. https://www.sciencedirect.com/science/article/pii/S0167487010001250",
        "source_5": "UK Sport, “Where the money comes from” (accessed 2025) — Explains that the high-performance system is funded substantially by National Lottery proceeds alongside Exchequer funds, implying a different public trade-off than general taxation and mitigating some taxpayer cost concerns. https://www.uksport.gov.uk/about-us/our-funding/where-the-money-comes-from",
        "source_6": "The Whyte Review (2022), “Independent Review into allegations of abuse in gymnastics in the UK” — Concludes that aspects of a medal-targeted, high-pressure culture contributed to athlete welfare failings, highlighting ethical and social costs that can undercut claims that medal-focused spending is “money well spent.” https://www.whytereview.org/"
    }
}