{
    "question": "Should think tanks be forced to reveal all of their sources of funding?",
    "content": {
        "source_1": "New York Times — “Foreign Powers Buy Influence at Think Tanks” (Eric Lipton, Brooke Williams, Nicholas Confessore; Sept. 6, 2014). Investigative report documenting U.S. think tanks receiving money from foreign governments while producing policy work aligned with those governments’ interests, often without clear public disclosure. Evidence that undisclosed funding can create hidden conflicts and influence policy debates. https://www.nytimes.com/2014/09/07/us/politics/foreign-powers-buy-influence-at-think-tanks.html",
        "source_2": "U.S. Supreme Court — Americans for Prosperity Foundation v. Bonta, 594 U.S. ___ (2021). The Court struck down California’s blanket requirement that charities disclose major donors to the state, citing a significant chilling effect on First Amendment associational rights. Suggests that forcing comprehensive donor disclosure—even to regulators—can be unconstitutional or require narrow tailoring, cautioning against sweeping mandates for think tanks. https://www.supremecourt.gov/opinions/20pdf/19-251_p86b.pdf",
        "source_3": "Transparify — Global Think Tank Funding Transparency Ratings (e.g., 2018–2020 reports). Independent assessments show many leading think tanks voluntarily disclose detailed funding sources and are rewarded with higher credibility scores; others remain opaque. Indicates that robust transparency is feasible in practice and can be driven by norms and reputational incentives, not only legal mandates. https://www.transparify.org/ratings",
        "source_4": "Center for International Policy (Foreign Influence Transparency Initiative) — “The Military-Industrial Think Tank Complex” (Ben Freeman; 2020). Analysis documenting extensive funding from defense contractors to prominent foreign-policy think tanks and mapping how this funding aligns with hawkish policy advocacy; highlights inconsistent or limited donor disclosure. Supports the argument that mandatory, comprehensive funding transparency is needed to identify and weigh conflicts of interest. https://www.ciponline.org/research/publications/the-military-industrial-think-tank-complex",
        "source_5": "European Union — Interinstitutional Agreement on a Mandatory Transparency Register (2021). To access EU institutions, interest representatives (including think tanks) must disclose budgets and funding sources in specified ranges and categories. Demonstrates a workable, policy-based model of enforced transparency short of naming every donor, offering a counterpoint to “reveal all sources” by emphasizing proportional disclosure. https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32021Q0511(01)",
        "source_6": "ACLU — Letter on H.R. 1 (For the People Act of 2019). The ACLU warned that broad donor-disclosure and disclaimer provisions risk chilling issue advocacy and exposing supporters of controversial causes to harassment or retaliation. Provides a civil-liberties perspective against blanket donor disclosure mandates for nonprofits, including think tanks. https://www.aclu.org/letter/aclu-letter-house-hr-1-people-act-2019"
    }
}