{
    "question": "Should fines be made relative to income?",
    "content": {
        "source_1": "Vera Institute of Justice — Day Fines in American Courts: The Staten Island and Milwaukee Experiments (1996). Reports on U.S. pilots of income-based “day fines,” finding higher collection/compliance rates and fewer jail sanctions for nonpayment compared with flat fines, suggesting income-relative fines can improve equity and effectiveness. https://www.vera.org/publications/day-fines-in-american-courts-the-staten-island-and-milwaukee-experiments",
        "source_2": "BBC News — Finland’s €54,000 speeding fine sparks debate (2015). Describes Finland’s day-fine system and a high-profile case where a very wealthy driver received a six-figure-equivalent penalty, highlighting public controversy over whether income-based fines impose unequal punishment for the same offense. https://www.bbc.com/news/world-europe-31849497",
        "source_3": "Sentencing Council (England & Wales) — Magistrates’ Court Sentencing Guidelines: Fines (current). Explains the operational model that ties fines to an offender’s “relevant weekly income” with banded multipliers and caps, showing that income-related fines are administrable at scale within a modern court system. https://www.sentencingcouncil.org.uk/explanatory-material/magistrates-court/item/fines/",
        "source_4": "Bearden v. Georgia, 461 U.S. 660 (1983). U.S. Supreme Court held courts must consider a defendant’s ability to pay before revoking probation or jailing for nonpayment; often cited to argue that fairness can be achieved through ability-to-pay assessments rather than making fines explicitly proportional to income. https://www.law.cornell.edu/supremecourt/text/461/660",
        "source_5": "U.S. Department of Justice, Civil Rights Division — Investigation of the Ferguson Police Department (2015). Documents how reliance on flat fines and fees disproportionately burdened low-income residents and fueled cycles of debt and enforcement, evidence often used to support reforms that scale monetary sanctions to financial capacity. https://www.justice.gov/sites/default/files/opa/press-releases/attachments/2015/03/04/ferguson_police_department_report.pdf",
        "source_6": "Conference of Chief Justices & Conference of State Court Administrators — Resolution 5: Commitment to Ensuring Fair and Effective Use of Fines and Fees (2016). Policy guidance urging courts to conduct ability-to-pay determinations and adjust sanctions accordingly; reflects a mainstream U.S. reform path that emphasizes individualized assessments over across-the-board income-indexed fine schedules. https://ccj.ncsc.org/policy-resolutions/resolution-5-commitment-ensuring-fair-and-effective-use-fines-and-fees"
    }
}