{
    "question": "Should university education be capped and made more selective?",
    "content": {
        "source_1": "Caplan, Bryan (2018). The Case Against Education: Why the Education System Is a Waste of Time and Money. Princeton University Press. - Argument: Much of the private return to college reflects signaling rather than skill acquisition, implying social returns are far lower than private returns. Caplan contends that expanding university access misallocates talent and resources; more selectivity (and even caps) would reduce waste by limiting credential inflation.",
        "source_2": "OECD (2019). OECD Skills Outlook 2019: Thriving in a Digital World. - Evidence: Across OECD countries, a sizable share of tertiary-educated workers are employed in jobs that do not require a degree and report skill underutilization (roughly one in five workers overqualified in many systems). This mismatch suggests that mass expansion can outpace demand for high-skill roles, supporting arguments for tighter selectivity or caps aligned to labor-market needs.",
        "source_3": "Autor, David (2014). Skills, education, and the rise of earnings inequality. Science, 344(6186), 843–851. - Evidence: The college wage premium remains large and grew over recent decades; insufficient supply of college-educated workers contributed to inequality. This implies that capping university education could worsen skill shortages and earnings gaps, arguing against more selectivity at the system level.",
        "source_4": "Chetty, Raj; Friedman, John; Saez, Emmanuel; Turner, Nicholas; Yagan, Danny (2017). Mobility Report Cards: The Role of Colleges in Intergenerational Mobility. NBER Working Paper 23618. - Evidence: Many colleges—especially broad-access public institutions—substantially boost low-income students’ earnings mobility. Imposing caps or greater selectivity risks reducing seats at institutions that function as engines of upward mobility, likely harming equity.",
        "source_5": "Association of American Medical Colleges (AAMC) (2023). The Complexities of Physician Supply and Demand: Projections From 2021 to 2036. - Evidence: The U.S. faces a projected physician shortfall (on the order of tens of thousands by the 2030s), with constraints in medical education and residency slots as bottlenecks. This sectoral shortage illustrates how caps and strict selectivity can create harmful undersupply in critical fields, arguing for expansion rather than contraction in such programs.",
        "source_6": "Britton, Jack; Dearden, Lorraine; Shephard, Neil; Vignoles, Anna (2020). The impact of undergraduate degrees on lifetime earnings. Institute for Fiscal Studies. - Evidence: Returns to university vary widely by subject and institution; some programs deliver low or even negative earnings premiums, while others deliver very high returns. This heterogeneity supports targeted selectivity or caps for low-return courses rather than blanket expansion, to improve system efficiency without reducing high-value capacity."
    }
}