{
    "question": "Should blasphemy have a place on the statute books?",
    "content": {
        "source_1": "UN Human Rights Committee, General Comment No. 34 (Article 19: Freedoms of opinion and expression), 2011 — https://www.ohchr.org/en/documents/general-comments-and-recommendations/general-comment-no-34-article-19-freedoms-opinion-and — Interprets the ICCPR to say laws prohibiting displays of lack of respect for religion, including blasphemy laws, are generally incompatible with freedom of expression, except for narrowly defined incitement under Article 20(2).",
        "source_2": "U.S. Commission on International Religious Freedom (USCIRF), “Respecting Rights? Measuring the World’s Blasphemy Laws,” 2017 — https://www.uscirf.gov/reports-briefs/special-reports/respecting-rights-measuring-worlds-blasphemy-laws — Comparative legal analysis finding most blasphemy statutes worldwide are vague, carry severe penalties (including death), and are frequently misused against minorities and dissenters, undermining human rights and rule of law.",
        "source_3": "European Court of Human Rights, E.S. v. Austria (Application no. 38450/12), Judgment of 25 October 2018 — https://hudoc.echr.coe.int/eng?i=001-187188 — The Court found no violation of Article 10 (free expression) in upholding a criminal conviction for disparaging religious doctrines, reasoning that the interference pursued the legitimate aim of protecting the rights of others and preserving religious peace.",
        "source_4": "Human Rights Watch, “Indonesia: Court Upholds Blasphemy Law,” 19 April 2010 — https://www.hrw.org/news/2010/04/19/indonesia-court-upholds-blasphemy-law — Reports on Indonesia’s Constitutional Court decision to retain the blasphemy statute to maintain public order and religious harmony, reflecting a governance rationale for keeping such laws despite rights-based criticisms.",
        "source_5": "Government of Ireland, Blasphemy (Abolition of Offences and Related Matters) Act 2019 — https://www.irishstatutebook.ie/eli/2019/act/5/enacted/en/html — Implements the 2018 referendum result by removing the offence of blasphemy from Irish law, illustrating a liberal-democratic shift toward decriminalization without apparent adverse effects on public order.",
        "source_6": "UN General Assembly, Resolution 65/224 “Combating defamation of religions,” 2010 — https://undocs.org/A/RES/65/224 — Calls on states to take measures, including legal ones, against “defamation of religions,” arguing that such expressions can foment discrimination, hostility, and violence—an international-policy perspective often cited to justify blasphemy-type regulations."
    }
}