{
    "question": "Has the UN intervention in the Democratic Republic of Congo been a success?",
    "content": {
        "source_1": "Reuters — “Congo’s M23 rebel group declares end of insurgency after army, U.N. offensive” (Nov. 5, 2013). Evidence: The UN’s Force Intervention Brigade, working with the Congolese army, routed M23 and compelled its surrender, a landmark operational success for a more robust UN peacekeeping approach in eastern DRC.",
        "source_2": "UNDP/UN (press and program reports) — Support to the 2018 DRC elections (2018–2019). Evidence: UNDP and MONUSCO provided logistics, airlift and technical assistance to the electoral commission, helping enable voting in remote areas and contributing to the 2019 transfer of power to President Félix Tshisekedi, cited as a positive governance outcome linked to UN support.",
        "source_3": "OCHA — Democratic Republic of the Congo: Humanitarian Needs Overview 2024 (late 2023). Evidence: OCHA reports over 7 million people internally displaced—one of the world’s largest displacement crises—with surging violence in North Kivu/Ituri despite decades of UN presence, indicating limited success in protecting civilians and stabilizing the east.",
        "source_4": "Human Rights Watch — “DR Congo: UN Should Stop Supporting Abusive Army Units” (2009–2010 reporting on Operation Kimia II). Evidence: HRW documented grave abuses by Congolese army units that received UN support during operations against rebels, arguing UN backing facilitated violations and undermined the mission’s protection and human rights objectives.",
        "source_5": "Reuters — “U.N. peacekeepers open fire at Congo border, killing two” (Kasindi incident, July 31, 2022). Evidence: Peacekeepers shot civilians at a border crossing amid widespread anti-UN protests in eastern DRC, fueling public anger and calls for the mission’s departure—signaling a serious legitimacy and accountability crisis for the UN presence.",
        "source_6": "UN Security Council — Resolution 2717 (Dec. 19, 2023). Evidence: At the DRC government’s request, the Council endorsed a phased, accelerated withdrawal of MONUSCO starting in 2024, reflecting host-state dissatisfaction and raising questions about the mission’s overall effectiveness and sustainability."
    }
}