{
    "question": "Should cannabis be legalised?",
    "content": {
        "source_1": "National Academies of Sciences, Engineering, and Medicine (2017) — The Health Effects of Cannabis and Cannabinoids: A comprehensive review concluded there is substantial evidence that cannabis or cannabinoids are effective for treating chronic pain in adults, chemotherapy-induced nausea and vomiting, and patient-reported spasticity symptoms in multiple sclerosis, supporting regulated medical access. https://nap.nationalacademies.org/catalog/24625/the-health-effects-of-cannabis-and-cannabinoids-the-current-state",
        "source_2": "Insurance Institute for Highway Safety / Highway Loss Data Institute (2022) — Studies link recreational marijuana legalization and retail sales to increases in crash rates: analyses found post-legalization increases of roughly 4–6% in injury and fatal crash rates and in collision claim frequencies in several early-legal states, highlighting road-safety risks. https://www.iihs.org/news/detail/studies-link-legalizing-retail-marijuana-sales-to-increases-in-crashes",
        "source_3": "Di Forti et al., Lancet Psychiatry (2019) — High-potency, daily cannabis use associated with markedly increased odds of first-episode psychosis across European sites; in cities with prevalent high-THC products, a sizable fraction of psychosis cases was statistically attributable to such use, underscoring potential mental health harms if high-potency products are widely available. https://www.thelancet.com/journals/lanpsy/article/PIIS2215-0366(19)30048-3/fulltext",
        "source_4": "Anderson, Hansen, and Rees, JAMA Pediatrics (2019) — Difference-in-differences study finds no evidence that recreational marijuana laws increase adolescent marijuana use; estimates suggest small declines in past-30-day and frequent use among high school students after legalization. https://jamanetwork.com/journals/jamapediatrics/fullarticle/2737637",
        "source_5": "ACLU (2020) — A Tale of Two Countries: Racially Targeted Arrests in the Era of Marijuana Reform: Nationwide, Black people were 3.6 times more likely than white people to be arrested for marijuana possession despite similar usage rates; legalization in some states substantially reduced overall marijuana arrests, supporting arguments about reducing criminalization and disparities. https://www.aclu.org/report/tale-two-countries-racially-targeted-arrests-era-marijuana-reform",
        "source_6": "Tax Foundation (2023) — Marijuana Taxes in States with Legal Sales: While legalization generates significant excise revenue, high tax rates and restrictive local policies can sustain large illicit markets (e.g., California), indicating legalization alone does not eliminate illegal sales and that policy design critically shapes outcomes. https://taxfoundation.org/data/all/state/marijuana-taxes-state-legal-sales/"
    }
}