{
    "question": "Should the voting age be lowered to 16?",
    "content": {
        "source_1": "Wagner, Johann, and Kritzinger (Electoral Studies, 2012) — “Voting at 16: Turnout and the quality of vote choice.” Peer-reviewed analysis of Austria’s reform finds that 16–17-year-olds’ political knowledge and the “quality” of their vote choices are comparable to adults’, and that their turnout, when enfranchised, is similar to older first-time voters. Perspective: supports lowering the voting age based on competence and real-world behavior. https://www.sciencedirect.com/science/article/pii/S0261379411001379",
        "source_2": "UK Electoral Commission (2014) — “Scottish Independence Referendum: Report on the referendum held on 18 September 2014.” Post-referendum research estimated that about 75% of registered 16–17-year-olds voted in the 2014 Scottish referendum, indicating high engagement when given the franchise. Perspective: supports lowering the voting age with case evidence of strong youth participation. https://www.electoralcommission.org.uk",
        "source_3": "Laurence Steinberg (New York Times op-ed, 2019) — “Lower the Voting Age to 16.” Drawing on developmental neuroscience, Steinberg argues that by age 16 adolescents’ “cold cognition” (deliberative decision-making used in voting) is essentially adult-like, even though impulse control in “hot” contexts matures later. Perspective: supports lowering the voting age on cognitive-capacity grounds. https://www.nytimes.com",
        "source_4": "Gerber, Green, and Shachar (American Journal of Political Science, 2003) — “Voting May Be Habit-Forming: Evidence from a Randomized Field Experiment.” Demonstrates that voting once increases the likelihood of voting in subsequent elections, suggesting earlier first eligibility (while teens are still in school and easier to reach with civics) can foster lifelong participation. Perspective: supports lowering the voting age due to habit formation benefits. https://www.jstor.org/stable/1519896",
        "source_5": "The Hill/HarrisX Poll (2019) — “Most voters oppose lowering the voting age to 16.” Nationwide US survey found a large majority (roughly three-quarters or more) of voters opposed reducing the voting age to 16. Perspective: opposes the change on grounds of low public support/legitimacy. https://thehill.com/hilltv/what-americas-thinking/",
        "source_6": "Tribunal Superior Eleitoral (Brazil) statistics (2018) — Electorate by age reports showed 16–17-year-old registration (voting is optional for this group) at its lowest share in many years, around 1% of the electorate before the 2018 general election. Perspective: cautions that merely lowering eligibility may not yield high youth participation; engagement can be weak without strong mobilization. https://www.tse.jus.br/eleitor/estatisticas/estatisticas-eleitorais"
    }
}