{
    "question": "Should access to social messaging networks be blocked during riots?",
    "content": {
        "source_1": "The Guardian (Aug 2011) reported that during the 2011 England riots, BlackBerry Messenger (BBM) and other private messaging tools were extensively used to coordinate gatherings, looting targets, and rapid movements, outpacing police response and complicating monitoring. This was cited by some officials at the time as a rationale to consider temporarily restricting social platforms to disrupt violent mobilization.",
        "source_2": "Jan Rydzak, “Of Blackouts and Bandhs: The Strategy and Structure of Disconnected Protest in India” (Stanford Global Digital Policy Incubator/SSRN, 2019). Using event-level data from India, Rydzak finds that network shutdowns suppress some peaceful collective action but increase the incidence of more localized and violent tactics, suggesting that cutting communications can backfire by escalating disorder rather than containing it.",
        "source_3": "Supreme Court of India, Anuradha Bhasin v. Union of India (Jan 10, 2020). The Court held that internet restrictions must meet tests of necessity and proportionality, be time-limited, and be published, emphasizing that blanket or indefinite shutdowns are constitutionally suspect. This legal framework implies that broad blocking of messaging networks during unrest will often be unlawful and overbroad relative to narrower alternatives.",
        "source_4": "BBC News (Aug 2011) covered how social media was used to aid community response during the UK riots, including mobilizing volunteers via the #riotcleanup effort, sharing safety information, and debunking rumors. This highlights that blocking messaging networks would also remove critical channels for public safety communication and community resilience during crises.",
        "source_5": "Brookings Institution, Darrell M. West, “Internet shutdowns cost countries $2.4 billion in 2015” (Oct 2016). The analysis estimates large economic and social costs from shutdowns, including disruption to commerce, transportation, and essential services. Even targeted blocks on major messaging platforms can impose significant collateral damage on economies and daily life.",
        "source_6": "Reuters (Mar 2018) reported that Sri Lanka’s government temporarily blocked Facebook, WhatsApp, and other platforms during anti-Muslim riots, with officials claiming the move curbed the spread of incendiary rumors and helped restore order. This case is often cited by proponents as evidence that short, targeted blocks of messaging networks can help de-escalate violence during communal unrest."
    }
}