{
    "question": "Should the full financial history of all candidates for political office be posted online?",
    "content": {
        "source_1": "Djankov, La Porta, Lopez-de-Silanes, and Shleifer, “Disclosure by Politicians,” The Quarterly Journal of Economics (2010). https://papers.ssrn.com/sol3/papers.cfm?abstract_id=1165552 - Cross-country analysis finds stronger personal financial disclosure rules for public officials are associated with lower perceived corruption and better governance, supporting transparency requirements as an anti-corruption tool.",
        "source_2": "Americans for Prosperity Foundation v. Bonta, 594 U.S. ___ (2021). U.S. Supreme Court. https://www.supremecourt.gov/opinions/20pdf/19-251_p04b.pdf - The Court held that blanket disclosure regimes must be narrowly tailored due to First Amendment and privacy concerns; broad, indiscriminate online disclosure (such as “full financial history”) risks unconstitutional chilling effects on participation.",
        "source_3": "National Academy of Public Administration, “The STOCK Act—An Analysis of the Impact of Providing Public Access to Financial Disclosure Reports of Executive Branch Employees” (2013). https://napawash.org/academy-studies/the-stock-act-an-analysis-of-the-impact-of-providing-public-access-to-financial-disclosure-reports-of-executive-branch-employees - A congressionally mandated study concluded that posting detailed financial disclosures of thousands of executive-branch employees online posed security and privacy risks; Congress subsequently repealed the broad online-posting requirement, indicating practical dangers of universal online publication.",
        "source_4": "OECD, “Asset Declarations for Public Officials: A Tool to Prevent Corruption” (2011). https://www.oecd.org/gov/ethics/48972967.pdf - International best-practice guidance endorses asset and interest disclosures but emphasizes proportionality, targeted scope, and sometimes partial confidentiality to balance anti-corruption goals with privacy—arguing against publishing “full financial histories” indiscriminately.",
        "source_5": "Bø, Slemrod, and Thoresen, “Taxes on the Internet: Equilibrium Effects of Making Tax Records Public,” Journal of Public Economics 130 (2015): 1–17. https://doi.org/10.1016/j.jpubeco.2015.06.006 - When Norway made individual tax records publicly searchable online, reported incomes rose—evidence that broad financial transparency can change behavior and bolster compliance, lending support to strong disclosure’s deterrent effects.",
        "source_6": "National Conference of State Legislatures (NCSL), “Personal Financial Disclosure” (updated). https://www.ncsl.org/ethics/personal-financial-disclosure - Survey of U.S. state practices shows most require candidates/officials to disclose current assets, income sources, liabilities, and interests—typically by ranges and with some redactions—rather than full financial histories posted online, reflecting a prevailing norm of limited, focused transparency."
    }
}