{
    "question": "Should the American Jobs Act pass?",
    "content": {
        "source_1": "Congressional Budget Office (Oct 2011) — Estimated Impact of the American Jobs Act of 2011 on Employment and Economic Output: CBO projected the AJA would increase employment by 0.5 to 2.9 million and boost GDP by 0.2% to 1.4% by the end of 2012, reducing the unemployment rate by 0.2 to 1.1 percentage points. This supports passage on macroeconomic grounds.",
        "source_2": "National Federation of Independent Business (Sept 2011) — NFIB letter opposing the American Jobs Act: NFIB argued the AJA’s temporary hiring credits and payroll tax cuts would not materially change hiring decisions, while proposed tax increases on high earners would hit many pass-through small businesses, dampening investment. This challenges the bill’s effectiveness for small employers.",
        "source_3": "American Society of Civil Engineers (Sept 2011) — ASCE statement on the AJA’s infrastructure components: ASCE supported the bill’s school modernization and transportation investments, citing large job creation from infrastructure spending and long-run productivity gains from addressing the nation’s maintenance backlog. This backs passage based on infrastructure needs and multipliers.",
        "source_4": "Committee for a Responsible Federal Budget (Sept 2011) — Preliminary analysis of the President’s jobs plan: CRFB noted the package was front-loaded with costs and relied on politically uncertain, back-loaded offsets over 10 years; they urged pairing near-term support with credible long-term deficit reduction. This raises fiscal sustainability concerns about passing the bill as proposed.",
        "source_5": "Statement by Speaker John Boehner (Sept 2011) — Critique of the AJA as “Stimulus 2.0”: Boehner contended the plan repeats elements of the 2009 stimulus that he argued underperformed, and instead advocated regulatory reform and comprehensive tax reform to spur private-sector hiring. This presents a political and policy alternative opposing passage."
    }
}