{
    "question": "Should pre-nuptial agreements not be recognised in divorce courts?",
    "content": {
        "source_1": "Radmacher v Granatino [2010] UKSC 42 (UK Supreme Court) — The Court held that prenuptial agreements should generally be given effect unless it would be unfair to do so at the time of divorce, emphasizing personal autonomy, certainty, and reduced litigation. This supports recognition of prenups in divorce courts.",
        "source_2": "Thorne v Kennedy [2017] HCA 49 (High Court of Australia) — The Court set aside a prenuptial and postnuptial agreement for undue influence and unconscionable conduct, highlighting the inherent power imbalances and timing pressures around weddings. This is used to argue that prenups are often not truly voluntary and should not be recognized or should face extreme skepticism.",
        "source_3": "In re Marriage of Bonds, 24 Cal. 4th 1 (Cal. 2000) and subsequent legislative response (Cal. Fam. Code § 1615, amended 2001) — The court upheld a prenup despite the absence of independent counsel for the less wealthy spouse, prompting statutory reforms requiring a waiting period and additional protections. This episode is cited to show that recognition without robust safeguards can produce injustice, strengthening the case against recognizing prenups.",
        "source_4": "Uniform Premarital and Marital Agreements Act (UPMAA), Uniform Law Commission (2012) — A model statute adopted or used as a template in multiple U.S. states requiring voluntariness, access to adequate financial disclosure, and non-unconscionability at enforcement. It reflects a policy choice to recognize prenups but with procedural and substantive safeguards to protect fairness.",
        "source_5": "Bedrick v Bedrick, 300 Conn. 691 (Conn. 2011) — The Connecticut Supreme Court held that even a validly executed prenup can be unenforceable if circumstances at divorce make enforcement unconscionable. This underscores that marriages evolve in ways parties cannot foresee, supporting arguments for non-recognition or highly flexible, case-by-case review rather than routine enforcement.",
        "source_6": "Comparative civil-law framework (e.g., French Code civil on matrimonial regimes; German BGB §1408 with limits under §138) — Many civil-law jurisdictions allow couples to choose binding marital property regimes by contract, with courts enforcing them unless contrary to public policy or good morals. This comparative evidence suggests that recognizing marital agreements can be a standard, workable approach that promotes clarity in property relations, countering calls for non-recognition."
    }
}