{
    "question": "Is downloading music without permission morally equivalent to theft?",
    "content": {
        "source_1": "Recording Industry Association of America (RIAA) – “About Piracy” page: Frames unauthorized downloading as “music theft,” asserting it harms artists and the industry and is morally comparable to stealing physical goods. (https://www.riaa.com/resources-learning/about-piracy/)",
        "source_2": "U.S. Supreme Court – Dowling v. United States, 473 U.S. 207 (1985): Held that distributing bootleg recordings is copyright infringement, not “theft” under the National Stolen Property Act, highlighting a legal distinction that challenges the theft equivalence. (https://supreme.justia.com/cases/federal/us/473/207/)",
        "source_3": "Alejandro Zentner (2006), “Measuring the Effect of File Sharing on Music Purchases,” Journal of Law and Economics 49(1): Finds file-sharing significantly reduces music purchases, implying tangible economic harm consistent with the moral gravity often ascribed to theft. (https://www.journals.uchicago.edu/doi/abs/10.1086/430809)",
        "source_4": "Felix Oberholzer-Gee and Koleman Strumpf (2007), “The Effect of File Sharing on Record Sales: An Empirical Analysis,” Journal of Political Economy 115(1): Reports little to no negative impact of file sharing on sales, undermining the claim that unauthorized downloading is morally equivalent to theft due to lack of clear harm. (https://www.journals.uchicago.edu/doi/10.1086/511995)",
        "source_5": "Lawrence Lessig (2004), Free Culture (book): Argues that copying digital works is nonrivalrous—no one is dispossessed—so equating unauthorized downloading with theft is a misleading moral analogy; advocates distinct norms and policies for digital culture. (http://free-culture.cc/)",
        "source_6": "Justin Hughes (1988), “The Philosophy of Intellectual Property,” Georgetown Law Journal 77: Uses Lockean labor and personality theories to justify strong moral claims over creative works; unauthorized copying violates creators’ rights in a way that can be viewed as morally akin to theft. (https://papers.ssrn.com/sol3/papers.cfm?abstract_id=1304241)"
    }
}