{
    "question": "Do violent video games contribute to youth violence?",
    "content": {
        "source_1": "Anderson, C. A., Shibuya, A., Ihori, N., Swing, E., Bushman, B. J., Sakamoto, A., Rothstein, H., & Saleem, M. (2010). Psychological Bulletin. A meta-analytic review across Eastern and Western samples reported that exposure to violent video games increases aggressive behavior, aggressive thoughts, and aggressive affect in youths, suggesting a plausible pathway from gameplay to real-world aggression.",
        "source_2": "Gentile, D. A., Li, D., Khoo, A., Prot, S., & Anderson, C. A. (2014). JAMA Pediatrics. A multi-wave longitudinal study of Singaporean adolescents found that greater violent video game exposure predicted later physical aggression over two to three years, even after controlling for baseline aggression, with effects partially mediated by hostile attribution biases.",
        "source_3": "Przybylski, A. K., & Weinstein, N. (2019). Royal Society Open Science. In a large preregistered study of UK adolescents using parent-reported aggression outcomes, engagement with violent video games was not associated with increases in aggressive behavior, challenging claims of a reliable link.",
        "source_4": "Cunningham, S., Engelstätter, B., & Ward, M. R. (2016). “Violent Video Games and Violent Crime.” Using natural experiments around the release timing of popular violent games and US crime data, the authors found short-term decreases in violent crime following releases, consistent with an incapacitation/substitution effect rather than provocation.",
        "source_5": "FBI Uniform Crime Reports (1990s–2010s) and Entertainment Software Association annual reports. While US juvenile violent-crime arrest rates declined markedly from the mid-1990s through the 2010s, video game sales (including M-rated titles) and overall play time grew substantially, an ecological pattern inconsistent with violent games driving youth violence at the population level.",
        "source_6": "American Psychological Association (2020). Updated APA Statement on Violent Video Games. The APA concluded there is insufficient evidence that violent video game use is a risk factor for criminal violence or delinquency, although small associations with aggressive outcomes may exist—indicating the evidence does not support a causal link to youth violence."
    }
}