{
    "question": "Are high taxes necessary for an effective state?",
    "content": {
        "source_1": "OECD, Revenue Statistics (latest edition) and Government at a Glance 2023 — Cross-country evidence shows that higher tax-to-GDP ratios are associated with higher public social spending and more comprehensive service provision; countries with taxes above ~40% of GDP (e.g., Nordics) tend to achieve lower inequality and strong health/education outcomes compared to lower-tax peers. https://www.oecd.org/tax/revenue-statistics.htm ; https://www.oecd.org/gov/government-at-a-glance-22214399.htm",
        "source_2": "Besley, T. & Persson, T. (2011), Pillars of Prosperity; and Besley & Persson (2013), “Taxation and Development,” Journal of Economic Perspectives — Argues state effectiveness hinges on building fiscal capacity (broad tax base, compliance, administration) and legal capacity, not simply high statutory tax rates; high taxes without capacity can be distortionary and ineffective. Book: https://press.princeton.edu/books/hardcover/9780691140604/pillars-of-prosperity ; JEP: https://www.aeaweb.org/articles?id=10.1257/jep.27.1.109",
        "source_3": "Romer, C. & Romer, D. (2010), “The Macroeconomic Effects of Tax Changes,” American Economic Review — Using narrative-identified, exogenous U.S. tax shocks, finds that a tax increase of 1% of GDP reduces real GDP by about 3% over the following 10 quarters, suggesting that higher taxes can slow growth and potentially shrink the resource base for effective state action. https://www.aeaweb.org/articles?id=10.1257/aer.100.3.763",
        "source_4": "IMF, Singapore: 2023 Article IV Consultation; World Bank Worldwide Governance Indicators — Singapore combines a low tax-to-GDP ratio (~14%) with top-tier “Government Effectiveness” scores and high-quality public services, showing that an effective state can be achieved with relatively low taxes when institutions, policy design, and state-owned asset income support service delivery. IMF: https://www.imf.org/en/Publications/CR/Issues/2023/10/03/Singapore-2023-Article-IV-Consultation-Press-Release-Staff-Report-571504 ; WGI: https://info.worldbank.org/governance/wgi/",
        "source_5": "Andersen, T., Holmström, B., Honkapohja, S., Korkman, S., Söderström, H. T., & Vartiainen, J. (2007), The Nordic Model: Embracing Globalization and Sharing Risks — Case study arguing high, broad-based taxation underpins universal welfare, active labor-market policies, and social insurance in Nordic countries, supporting both equity and competitiveness, i.e., high taxes as an enabling feature of effective states. https://www.norden.org/en/publication/nordic-model-embracing-globalization-and-sharing-risks",
        "source_6": "World Bank, World Development Report 2017: Governance and the Law — Emphasizes that policy effectiveness depends on governance (commitment, coordination, cooperation). Increased resources or spending without improved governance often yield limited outcomes, implying high taxes are not sufficient (and may be unnecessary) for effectiveness if institutional quality is weak or alternative revenues exist. https://www.worldbank.org/en/publication/wdr2017"
    }
}