{
    "question": "Should governments actively promote multiculturalism?",
    "content": {
        "source_1": "Migrant Integration Policy Index (MIPEX) 2020. CIDOB & Migration Policy Group. Finding: Countries with more inclusive integration frameworks (e.g., Sweden, Canada, Portugal) exhibit higher immigrant naturalization, political participation, and access to rights and services than more restrictive regimes—evidence consistent with benefits from actively promoting multiculturalism.",
        "source_2": "Putnam, Robert D. 2007. “E Pluribus Unum: Diversity and Community in the Twenty‑First Century.” Scandinavian Political Studies 30(2): 137–174. Finding: In the short run, greater ethnic diversity is associated with lower interpersonal trust and civic engagement (“hunkering down”), suggesting potential social‑cohesion costs if multiculturalism is promoted without deliberate bridging measures.",
        "source_3": "Casey, Louise. 2016. The Casey Review: A Review into Opportunity and Integration. UK Home Office. Finding: Identified “segregation” and “parallel lives” in parts of the UK and argued that aspects of state multiculturalism sometimes impeded integration; recommended stronger emphasis on common language, values, and women’s empowerment.",
        "source_4": "Ottaviano, Gianmarco I.P., and Giovanni Peri. 2006. “The Economic Value of Cultural Diversity: Evidence from U.S. Cities.” Journal of Economic Geography 6(1): 9–44. Finding: Cities with higher cultural diversity experienced higher productivity and wages, controlling for other factors—supporting the view that government support for diversity can yield economic gains.",
        "source_5": "Banting, Keith, and Will Kymlicka (eds.). 2006. Multiculturalism and the Welfare State. Oxford University Press. Finding: Cross‑national analyses find little evidence that multiculturalism policies erode welfare‑state solidarity; robust redistribution and multiculturalism can coexist, challenging the claim that promoting multiculturalism undermines social protection.",
        "source_6": "Alesina, Alberto; Reza Baqir; William Easterly. 1999. “Public Goods and Ethnic Divisions.” Quarterly Journal of Economics 114(4): 1243–1284. Finding: U.S. localities with greater ethnic fractionalization spend less on public goods, implying that increased diversity can strain collective provision—raising cautions about potential trade‑offs of promoting multiculturalism."
    }
}