{
    "question": "Should smoking be banned in public places?",
    "content": {
        "source_1": "Institute of Medicine (U.S. National Academies), “Secondhand Smoke Exposure and Cardiovascular Effects: Making Sense of the Evidence” (2009). Reviewing multiple jurisdictions, the IOM concluded smoke-free laws are followed by significant drops in acute coronary events (roughly 6–17% in the first year), reinforcing that eliminating public-place smoking materially protects non-smokers’ health. Supports bans.",
        "source_2": "New York City Department of Health and Mental Hygiene, “The State of Smoke-Free New York City: A One-Year Review” (2004). After the Smoke-Free Air Act, NYC reported increased bar/restaurant business tax receipts and higher hospitality employment alongside high compliance, countering claims of economic harm to the hospitality sector. Supports bans.",
        "source_3": "Klepeis et al., “Real-Time Measurement of Outdoor Tobacco Smoke Particles,” Journal of the Air & Waste Management Association (2007). Field measurements show outdoor secondhand smoke particle concentrations can be elevated very close to an active smoker but fall to near-background levels within a few meters, suggesting broadly prohibiting outdoor smoking may be disproportionate to typical exposure risks. Challenges blanket outdoor bans.",
        "source_4": "Thomas A. Lambert, “The Case Against Smoking Bans,” Cato Institute Policy Analysis (2006). Argues that smoking bans infringe on individual liberty and property rights, contending that private establishments should set their own smoking policies so consumers and workers can choose environments that match their preferences. Challenges bans on principled grounds.",
        "source_5": "Public Health Law Center, “Commercial Tobacco Control and Health Equity: Smoke-Free Policies” (2021). Warns that punitive enforcement of smoke-free laws (e.g., fines, policing) can disproportionately burden low-income and marginalized communities, urging education-first and non-punitive approaches to avoid inequitable impacts. Challenges punitive implementations of bans.",
        "source_6": "Public Health England, “Evidence review of e-cigarettes and heated tobacco products” (2018). Finds e-cigarettes are substantially less harmful than smoking and can aid cessation, suggesting harm-reduction strategies and designated areas may reduce exposure and nuisance without blanket prohibitions in all public spaces. Proposes alternatives to total bans."
    }
}