{
    "question": "Should the right to bear arms be limited?",
    "content": {
        "source_1": "RAND Corporation (2023), The Science of Gun Policy: A Critical Synthesis of Research Evidence on the Effects of Gun Policies in the United States. A living evidence review finding that several limiting policies—such as universal background checks and child-access prevention laws—are associated with reductions in firearm homicides, violent crime, and unintentional injuries, especially among youth. Provides graded confidence levels across policy areas, supporting targeted restrictions as effective public-safety measures.",
        "source_2": "Klarevas, L., Conner, A., & Hemenway, D. (2019), The Effect of Large-Capacity Magazine Bans on High-Fatality Mass Shootings, 1990–2017, American Journal of Public Health. States with bans on large-capacity magazines experienced significantly fewer high-fatality mass shootings and fewer people killed when such events occurred, suggesting that limiting access to high-capacity magazines reduces the lethality of attacks.",
        "source_3": "Kleck, G., & Gertz, M. (1995), Armed Resistance to Crime: The Prevalence and Nature of Self-Defense with a Gun, Journal of Criminal Law and Criminology. Survey-based research estimating millions of defensive gun uses annually, arguing that widespread lawful gun ownership provides substantial crime-prevention benefits; often cited to caution against broad restrictions that could impair self-defense.",
        "source_4": "District of Columbia v. Heller, 554 U.S. 570 (2008); New York State Rifle & Pistol Association v. Bruen, 142 S. Ct. 2111 (2022). U.S. Supreme Court rulings affirm an individual right to keep and bear arms and require modern regulations to align with the nation’s historical tradition of firearm regulation, constraining the scope and form of permissible limits and challenging interest-balancing approaches.",
        "source_5": "Chapman, S., Alpers, P., Agho, K., & Jones, M. (2006; follow-up analyses through 2016), Australia’s 1996 Gun Law Reforms and Firearm Deaths/Mass Shootings, Injury Prevention; JAMA. After Australia’s National Firearms Agreement (including bans and a large buyback), the country saw an absence of mass shootings for decades and accelerated declines in firearm deaths, indicating that comprehensive national restrictions can coincide with major public-safety gains.",
        "source_6": "Kivisto, A. J., & Phalen, P. L. (2018), Effects of Risk-Based Firearm Seizure Laws in Connecticut and Indiana on Suicide Rates, 1981–2015, Psychiatric Services. Evaluating “red flag” (ERPO) laws, the study associates their implementation with measurable reductions in firearm suicide, implying that narrowly tailored, due-process-based limits on access for high-risk individuals can prevent deaths without broad prohibitions."
    }
}