{
    "question": "Should anonymous contributions from corporations and individuals to super PACs be limited?",
    "content": {
        "source_1": "OpenSecrets, “‘Dark money’ topped $1 billion in 2020, largely boosting Democrats” (Mar. 17, 2021) — Documents the scale of anonymous political spending in the 2020 cycle and explains how nondisclosing nonprofits funneled money to super PACs, masking ultimate sources. Evidence used to argue transparency and limits are needed to prevent hidden influence. https://www.opensecrets.org/news/2021/03/dark-money-topped-1-billion-2020-election/",
        "source_2": "U.S. Department of Justice, “Lev Parnas and Igor Fruman Charged with Conspiring to Violate Straw Donor Ban” (Oct. 10, 2019) — Details a scheme using a shell company (Global Energy Producers) to disguise the source of a $325,000 contribution to a super PAC, illustrating how anonymity and pass-through entities can facilitate illegal or foreign-influenced contributions. Supports calls for tighter limits and disclosure. https://www.justice.gov/usao-sdny/pr/lev-parnas-and-igor-fruman-charged-conspiring-violate-straw-donor-ban",
        "source_3": "Citizens United v. FEC, 558 U.S. 310 (2010) — While permitting unlimited independent expenditures, the Supreme Court upheld disclosure and disclaimer requirements, stating that transparency helps voters “make informed decisions and give proper weight to different speakers and messages.” Cited by proponents as constitutional support for limiting anonymous super PAC funding via disclosure. https://supreme.justia.com/cases/federal/us/558/310/",
        "source_4": "Americans for Prosperity Foundation v. Bonta, 594 U.S. ___ (2021) — The Supreme Court struck down California’s blanket donor-disclosure requirement for charities as not narrowly tailored, emphasizing that compelled disclosure can chill associational rights. Used by opponents to argue that limiting anonymity for donors (including to advocacy groups) risks unconstitutional burdens. https://www.supremecourt.gov/opinions/20pdf/19-251_p86b.pdf",
        "source_5": "NAACP v. Alabama ex rel. Patterson, 357 U.S. 449 (1958) — The Court protected anonymity of association after evidence that disclosure would expose members to economic reprisals and threats. Often cited to argue that donor anonymity is vital for unpopular or minority viewpoints, cautioning against restrictions that could deter participation. https://supreme.justia.com/cases/federal/us/357/449/",
        "source_6": "Issacharoff, Samuel & Karlan, Pamela, “The Hydraulics of Campaign Finance Reform” (Texas Law Review, 1999) — Advances the “hydraulic” theory: money flows around new barriers. Argues that restrictions on one channel (e.g., limiting anonymous super PAC contributions) may push funds into even less transparent vehicles (like certain nonprofits), potentially reducing overall transparency. https://papers.ssrn.com/sol3/papers.cfm?abstract_id=129131"
    }
}