{
    "question": "Should Scotland cede from the union?",
    "content": {
        "source_1": "Scottish Government — Building a New Scotland: An independent Scotland in the EU (Nov 2023). Sets out the case that independence would allow Scotland to rejoin the EU Single Market and restore freedom of movement, arguing Brexit (despite Scotland’s 62% Remain vote) justifies a different constitutional path. https://www.gov.scot/publications/building-new-scotland-independent-scotland-eu/",
        "source_2": "Scottish Government — Government Expenditure & Revenue Scotland (GERS) 2022–23 (Aug 2023). Reports Scotland’s net fiscal balance at -9.0% of GDP (including a geographic share of North Sea revenue) versus the UK’s -5.2%, highlighting a sizeable fiscal gap that an independent Scotland would need to address. https://www.gov.scot/publications/government-expenditure-revenue-scotland-2022-23/",
        "source_3": "LSE Centre for Economic Performance — Disunited Kingdom? The economic impact of Scottish independence (2021). Model-based analysis estimates long-run income per capita in Scotland would fall by about 6–8% from independence due mainly to new trade barriers with rUK; rejoining the EU offsets some losses but does not fully reverse them. https://cep.lse.ac.uk/pubs/download/ea058.pdf",
        "source_4": "HM Treasury — Chancellor’s 2014 statement on a currency union (Feb 2014). UK Government stated it would not agree to a formal pound sterling currency union with an independent Scotland, implying Scotland would need its own currency or to “sterlingise” without a central bank backstop. https://www.gov.uk/government/speeches/chancellor-on-scotland-currency",
        "source_5": "Crown Estate Scotland — ScotWind leasing round (from Jan 2022). Awards for around 25 GW of offshore wind projects signal large-scale investment and export potential, supporting arguments that Scotland could build a renewable-led economy as an independent state. https://www.crownestatescotland.com/our-projects/scotwind",
        "source_6": "UK Supreme Court — Reference by the Lord Advocate [2022] UKSC 31 (Nov 2022). Unanimous ruling that the Scottish Parliament lacks competence to legislate unilaterally for an independence referendum, underscoring constitutional constraints and the need for UK consent or a change in law. https://www.supremecourt.uk/cases/uksc-2022-0098.html"
    }
}