{
    "question": "Should music containing lyrics that glorify violent and criminal lifestyles be banned?",
    "content": {
        "source_1": "Anderson, C. A., Carnagey, N. L., & Eubanks, J. (2003). Exposure to Violent Media: The Effects of Songs With Violent Lyrics on Aggressive Thoughts and Feelings. Journal of Personality and Social Psychology, 84(5), 960–971. Experimental studies found that listening to songs with violent lyrics increased aggressive thoughts and feelings in the short term, suggesting potential public health grounds for content restrictions.",
        "source_2": "BBC News (2018, June 18). YouTube deletes drill music videos at Met Police request. The Metropolitan Police argued that specific drill videos glorified violence and were linked to real-world gang feuds and stabbings; YouTube removed dozens of videos, illustrating a law-enforcement view that such content can escalate violence and should be curtailed.",
        "source_3": "Brown v. Entertainment Merchants Association, 564 U.S. 786 (2011). The U.S. Supreme Court struck down a state law restricting violent video games for minors, holding that violent content is protected speech and that bans based on purported harm fail strict scrutiny; by analogy, broad bans on violent lyrics would likely be unconstitutional absent direct incitement.",
        "source_4": "Nielson, E., & Dennis, A. L. (2019). Rap on Trial: Race, Lyrics, and Guilt in America. The New Press. Documents how authorities and juries often treat rap lyrics as literal confessions, leading to prejudice and selective criminalization; warns that bans targeting “glorification” would disproportionately silence minority artists and misread artistic expression.",
        "source_5": "Sharman, L., & Dingle, G. A. (2015). Extreme Metal Music and Anger Processing. Frontiers in Human Neuroscience, 9, 272. In a controlled study, listeners reported that extreme music helped regulate and process anger, reducing hostility and increasing positive emotions—counter-evidence to claims that aggressive-sounding music necessarily promotes violence.",
        "source_6": "Selfhout, M., Delsing, M., ter Bogt, T., & Meeus, W. (2008). Heavy Metal and Hip-Hop Style Preference and Externalizing Problem Behavior in Adolescence. Journal of Youth and Adolescence, 37(8), 1046–1057. Longitudinal analyses showed that while preferences for certain music genres correlated with delinquency, selection effects (already antisocial youths preferring such music) were stronger than causal influence, challenging the efficacy of bans to reduce crime."
    }
}