{
    "question": "Should humans eat meat?",
    "content": {
        "source_1": "Neumann, C.G., Murphy, S.P., Gewa, C., Grillenberger, M., Bwibo, N.O. “Meat supplementation improves growth, cognitive, and behavioral outcomes in Kenyan children.” Journal of Nutrition, 2007. In a randomized school-feeding trial, children receiving meat showed superior gains in cognitive test scores and growth compared with isocaloric controls, suggesting benefits of meat in contexts of undernutrition.",
        "source_2": "Bouvard, V., Loomis, D., Guyton, K.Z., et al. “Carcinogenicity of consumption of red and processed meat.” The Lancet Oncology, 2015. The IARC classified processed meat as carcinogenic to humans (Group 1) and red meat as probably carcinogenic (Group 2A), citing increased colorectal cancer risk, which challenges health-based arguments for eating meat.",
        "source_3": "Poore, J., Nemecek, T. “Reducing food’s environmental impacts through producers and consumers.” Science, 2018. A global life‑cycle assessment found beef and lamb have the highest greenhouse gas emissions and land use among common foods; shifting from meat to plant-based foods substantially lowers environmental footprints, weighing against the “should eat meat” claim on sustainability grounds.",
        "source_4": "Academy of Nutrition and Dietetics. “Position of the Academy of Nutrition and Dietetics: Vegetarian Diets.” Journal of the Academy of Nutrition and Dietetics, 2016. Concludes that appropriately planned vegetarian and vegan diets are healthful, nutritionally adequate, and suitable for all life stages—evidence that humans do not need to eat meat to meet nutritional needs.",
        "source_5": "The Cambridge Declaration on Consciousness, 2012. Leading neuroscientists declared that many nonhuman animals possess the neurological substrates of consciousness and can experience affective states, providing an ethical basis for questioning whether humans should eat meat despite potential nutritional benefits."
    }
}