{
    "question": "Should the world go vegan?",
    "content": {
        "source_1": "Poore, J., Nemecek, T. Reducing food’s environmental impacts through producers and consumers. Science, 2018. https://www.science.org/doi/10.1126/science.aaq0216 — Global meta-analysis (40,000 farms, 119 countries) finds animal products have disproportionately high impacts; diets excluding animal products could reduce global agricultural land use by over 75% and cut food-related greenhouse gas emissions nearly by half, supporting a vegan shift for environmental reasons.",
        "source_2": "Academy of Nutrition and Dietetics. Position of the Academy of Nutrition and Dietetics: Vegetarian Diets. Journal of the Academy of Nutrition and Dietetics, 2016. https://www.jandonline.org/article/S2212-2672(16)31192-3/fulltext — Concludes that appropriately planned vegan diets are healthful, nutritionally adequate across the life cycle, and associated with reduced risks of certain chronic diseases, supporting the feasibility of population-level shifts toward vegan eating (with attention to B12 and other nutrients).",
        "source_3": "Tong, T.Y.N., et al. Risks of ischaemic heart disease and stroke in meat eaters, fish eaters, and vegetarians over 18 years of follow-up: results from the EPIC-Oxford study. BMJ, 2019. https://www.bmj.com/content/366/bmj.l4897 — Prospective cohort finds vegetarians/vegans had lower ischemic heart disease risk but higher hemorrhagic stroke risk compared with meat eaters, indicating potential health trade-offs and the need for careful planning/fortification if populations move toward veganism.",
        "source_4": "Cassidy, E.S., West, P.C., Gerber, J.S., Foley, J.A. Redefining agricultural yields: from tonnes to people nourished per hectare. PNAS, 2013. https://www.pnas.org/doi/10.1073/pnas.1302426110 — Shows that reallocating crops currently fed to livestock to direct human consumption could increase available food calories by up to 70%, potentially feeding up to 4 billion additional people, supporting a shift away from animal agriculture on food security grounds.",
        "source_5": "HLPE (High Level Panel of Experts on Food Security and Nutrition). Sustainable agricultural development for food security and nutrition: what roles for livestock? FAO, 2016. https://www.fao.org/3/i5795e/i5795e.pdf — Highlights that livestock underpin livelihoods for about 1.3 billion people, provide nutrient-dense foods (especially in low-income settings), and utilize marginal lands unsuitable for crops; warns that blanket moves to eliminate livestock could harm food security, livelihoods, and cultural systems.",
        "source_6": "Stanley, P.L., Rowntree, J.E., Beede, D.K., DeLonge, M.S., Hamm, M.W. Impacts of soil carbon sequestration on life cycle greenhouse gas emissions in U.S. beef cattle production. Agricultural Systems, 2018. https://www.sciencedirect.com/science/article/pii/S0308521X18300610 — Life-cycle analysis suggests adaptive multi-paddock grazing can substantially increase soil carbon sequestration, potentially offsetting or even netting down beef’s emissions under specific conditions, challenging the view that all animal agriculture is inherently incompatible with climate goals."
    }
}