{
    "question": "Should governments of resource-rich nations impose high taxes on mining and extraction?",
    "content": {
        "source_1": "International Monetary Fund, Fiscal Affairs Department. Fiscal Regimes for Extractive Industries: Design and Implementation (2012). Argues that progressive, rent-based taxes (e.g., resource rent taxes) allow governments to capture a large share of excess profits with minimal distortion to investment if well-designed and stable. https://www.imf.org/external/np/pp/eng/2012/081512.pdf",
        "source_2": "Fraser Institute. Annual Survey of Mining Companies, 2023 (2024 release). Finds that higher tax burdens and fiscal uncertainty are among the top deterrents to exploration and development; jurisdictions with aggressive tax/royalty regimes score lower on investment attractiveness, implying high taxes can push capital elsewhere. https://www.fraserinstitute.org/studies/annual-survey-of-mining-companies-2023",
        "source_3": "Norwegian Ministry of Petroleum and Energy / Norsk Petroleum. Taxation of the petroleum sector (ongoing; accessed 2025). Norway levies a 78% marginal tax rate on petroleum profits and channels revenues to its sovereign wealth fund; stable rules, deductions, and state participation have coincided with sustained investment—evidence that high rent capture can work under strong institutions. https://www.norskpetroleum.no/en/economy/taxation/",
        "source_4": "Reuters. Zambia cuts planned mining royalty hikes after industry backlash (2015). Zambia’s 2015 move to sharply raise mineral royalties prompted shutdown threats and job cuts, leading the government to quickly reverse course—showing steep tax increases can backfire in higher-cost, weaker-governance settings. https://www.reuters.com",
        "source_5": "UNEP International Resource Panel. Mineral Resource Governance in the 21st Century: Gearing Extractive Industries Towards Sustainable Development (2020). Concludes that many environmental and social externalities of mining are unpriced; recommends using fiscal instruments (taxes, royalties, fees) to internalize external costs and fund remediation—supporting higher extraction charges on environmental grounds. https://www.resourcepanel.org/reports/mineral-resource-governance-21st-century",
        "source_6": "Michael L. Ross. What Have We Learned About the Resource Curse? Annual Review of Political Science (2015). Surveys evidence that large, easy resource rents often weaken governance and accountability; without strong institutions, capturing more rents via higher taxes can fuel corruption and fail to improve development outcomes. https://www.annualreviews.org/doi/10.1146/annurev-polisci-052213-040359"
    }
}