{
    "question": "Should targeted online advertising based on user profiles and demographics be banned?",
    "content": {
        "source_1": "European Data Protection Board (EDPB) – Urgent Binding Decision on Meta’s behavioural advertising (Oct 27, 2023). The EDPB instructed Ireland’s DPC to impose a ban on Meta’s behavioural ads in the EEA for lack of valid consent, signaling that profiling-based targeting infringes EU privacy law without strict safeguards. Perspective: Supports stricter curbs/ban due to systemic legal non-compliance and difficulty of ensuring valid consent at scale. https://edpb.europa.eu/news/news/2023/edpb-adopts-urgent-binding-decision-use-behavioural-advertising-meta_en",
        "source_2": "U.S. Department of Justice – Settlement with Meta to curb discriminatory housing ad targeting (June 21, 2022). DOJ secured a groundbreaking agreement requiring Meta to develop a system to reduce algorithmic discrimination in housing ads after evidence that targeting tools enabled exclusion by race and other protected traits. Perspective: Supports bans or strong limits due to concrete civil-rights harms from demographic/profile-based targeting. https://www.justice.gov/opa/pr/justice-department-secures-groundbreaking-agreement-prevent-discriminatory-targeted-advertising",
        "source_3": "Digiday – Dutch public broadcaster NPO/Ster case: ad revenue rose after ditching third-party cookies (May 2020). After moving to contextual-only ads, NPO reported markedly higher CPMs and a year-over-year revenue jump (reported ~61%), indicating viable, privacy-preserving alternatives to profile-based targeting. Perspective: Counters “ban will cripple funding” by showing contextual models can perform competitively without user profiling. https://digiday.com/media/dutch-publisher-npo-saw-ad-revenue-jump-61-after-ditching-cookies/",
        "source_4": "Goldfarb & Tucker (2011), “Privacy Regulation and Online Advertising,” Management Science. Studying millions of ads, the authors find that stricter privacy rules reduced ad effectiveness by about 65% on average, implying less efficient advertising and potential harm to advertisers and publishers. Perspective: Opposes a ban; privacy restrictions can substantially reduce ad performance and economic welfare. https://pubsonline.informs.org/doi/abs/10.1287/mnsc.1100.1246",
        "source_5": "UK Information Commissioner’s Office – “Democracy Disrupted? Personal information and political influence” (2018). The ICO’s investigation into microtargeting in elections warned that opaque, data-driven profiling enables manipulation and undermines democratic transparency, recommending tighter controls and enforcement. Perspective: Supports bans/strong prohibitions for political ads to protect democratic processes from covert microtargeting. https://ico.org.uk/media/action-weve-taken/2259369/democracy-disrupted-110718.pdf",
        "source_6": "Pew Research Center – “Americans and Privacy: Concerned, Confused, and Feeling Lack of Control” (Nov 15, 2019). Majorities report discomfort with companies’ data collection and feel a lack of control over personal information; many oppose being tracked for advertising. Perspective: Supports bans on profile/demographic targeting as aligned with public preferences and expectations for privacy. https://www.pewresearch.org/internet/2019/11/15/americans-and-privacy-concerned-confused-and-feeling-lack-of-control-over-their-personal-information/"
    }
}