{
    "question": "Should history be excluded from the classroom?",
    "content": {
        "source_1": "Lavy, Victor (2015). Do Differences in Schools’ Instruction Time Explain International Achievement Gaps? The Economic Journal. Cross-country evidence shows additional instructional hours in math, science, and language arts significantly raise test scores. Given finite classroom time and accountability pressures tied to tested subjects, some argue for deprioritizing history to maximize measurable gains—supporting the claim.",
        "source_2": "National Center for Education Statistics (2023). The Nation’s Report Card: U.S. History and Civics 2022. NAEP results show historic declines and very low proficiency rates in history and civics, raising concerns about students’ civic preparedness. The findings are used to argue that history needs more, not less, classroom presence—contradicting the claim.",
        "source_3": "Wineburg, Sam; McGrew, Sarah; et al. (2016). Evaluating Information: The Cornerstone of Civic Online Reasoning. Stanford History Education Group. Studies find students (and many adults) struggle to vet online information; instruction in sourcing, corroboration, and contextualization—core historical thinking skills—improves performance. This is cited to argue that history is essential for digital/media literacy—contradicting the claim.",
        "source_4": "Cole, Elizabeth A.; Barsalou, Judy (2006). Unite or Divide? The Challenges of Teaching History in Societies Emerging from Violent Conflict. United States Institute of Peace Special Report. In polarized, post-conflict settings, teaching contested histories can inflame tensions and impede reconciliation; the report recommends careful sequencing, inclusive processes, or temporary deferral. This supports limiting or postponing classroom history in specific contexts—aligning with the claim.",
        "source_5": "Willingham, Daniel T. (2006). How Knowledge Helps. American Educator. Cognitive science shows background knowledge is foundational for reading comprehension and critical thinking; content-rich subjects like history supply that knowledge. Cutting history undermines literacy and general learning—contradicting the claim.",
        "source_6": "PEN America (2023). Educational Gag Orders: Legislative Restrictions on the Freedom to Read, Learn, and Teach. The report documents hundreds of proposed and dozens of enacted state-level restrictions on how teachers address race, gender, and history, creating chilling effects and compliance burdens. Some stakeholders respond by advocating reduced history instruction to avoid legal/political risk—supporting the claim on pragmatic grounds."
    }
}