{
    "question": "Should homework be banned?",
    "content": {
        "source_1": "Cooper, H., Robinson, J. C., & Patall, E. A. (2006). Does Homework Improve Academic Achievement? A Synthesis of Research, 1987–2003. Review of Educational Research. Meta-analysis finding little to no academic benefit of homework in elementary grades, but positive effects for secondary students—suggesting homework’s value is age-dependent rather than universally warranted or unwarranted.",
        "source_2": "Galloway, M., Conner, J., & Pope, D. (2013). Nonacademic Effects of Homework in Privileged, High-Performing High Schools. Journal of Experimental Education. Empirical study reporting that heavy homework loads are associated with elevated stress, sleep deprivation, physical health problems, and reduced time for family/extracurriculars—evidence for potential harms that support limiting or banning excessive homework.",
        "source_3": "OECD (2014). PISA in Focus No. 46: Are students doing too much homework? Cross-national analysis indicating that after accounting for socioeconomic background, more time on homework has a weak relationship with performance and is linked to wider achievement gaps, as advantaged students gain more—raising equity concerns about homework rather than a blanket endorsement.",
        "source_4": "Eren, O., & Henderson, D. J. (2011). Are we wasting our children’s time by giving them more homework? Economics of Education Review. Using time-use and achievement data, the authors find math homework is positively associated with math achievement, while reading homework shows little benefit—arguing for targeted, subject-specific homework rather than across-the-board bans.",
        "source_5": "Kohn, A. (2006). The Homework Myth: Why Our Kids Get Too Much of a Bad Thing. Book arguing that the empirical case for homework’s academic benefits is weak (especially in early grades) and that it can undermine intrinsic motivation and family life—advocating for eliminating or drastically reducing homework.",
        "source_6": "Education Endowment Foundation (EEF) – Teaching & Learning Toolkit: Homework. Evidence summary emphasizing that the impact of homework depends on the quality of tasks and especially on feedback; routine, unmonitored tasks yield minimal gains, whereas well-designed assignments with follow-up can be effective—supporting improvement of practice over prohibition."
    }
}