{
    "question": "Should Major League Baseball continue to allow collisions at home plate?",
    "content": {
        "source_1": "MLB Official Rules, Rule 6.01(i) — Collisions at Home Plate (MLB Rulebook). Establishes that catchers cannot block the plate without the ball and runners cannot deviate to initiate contact, allowing only incidental contact; reflects MLB’s current safety-first stance limiting most collisions.",
        "source_2": "Orthopaedic Journal of Sports Medicine (2019) — Concussion trends in MLB before and after the 2014 home-plate collision rule. Peer‑reviewed analysis found a significant reduction in catcher concussions and collision-related injuries at home plate following adoption of the rule, indicating safety gains from restricting collisions.",
        "source_3": "ESPN (2014) — Player reaction (e.g., Pete Rose and others) criticizing the home‑plate collision rule. Argues collisions are part of baseball’s tradition and competitive fabric, that catchers assume the risk with gear and positioning, and that banning collisions removes a legitimate defensive tactic.",
        "source_4": "The New York Times (2021) — Ray Fosse retrospective/obituary recounting the 1970 All‑Star Game collision with Pete Rose. Documents how a single home‑plate collision led to serious shoulder damage and long‑term impact on Fosse’s career, illustrating the potential severity of such plays.",
        "source_5": "FanGraphs (2016) — Analysis of Rule 7.13/6.01(i) enforcement and replay controversies. Highlights inconsistent, confusing obstruction/blocking interpretations that have overturned otherwise routine outs, suggesting the restriction creates ambiguity that harms competitive clarity and fan experience.",
        "source_6": "MLB/MLBPA joint announcement (2014) — Press release introducing the experimental rule to reduce home‑plate collisions. Presents the league and players’ union rationale centered on concussion prevention and player welfare, signaling a labor‑management consensus toward limiting or eliminating collisions."
    }
}