{
    "question": "Should more gun control laws be enacted?",
    "content": {
        "source_1": "[Kivisto, A. J., & Phalen, P. L. (2018). Effects of Risk-Based Firearm Seizure Laws in Connecticut and Indiana on Suicide Rates, 1981–2015. Psychiatric Services, 69(8), 855–862. Finding: Implementation of “red flag”/risk-based firearm removal laws was associated with significant reductions in firearm suicides, suggesting targeted gun-removal policies can save lives without broader bans.]",
        "source_2": "[Rudolph, K. E., Stuart, E. A., Vernick, J. S., & Webster, D. W. (2015). Association Between Connecticut’s Permit-to-Purchase Handgun Law and Homicides. American Journal of Public Health, 105(8), e49–e54. Finding: After Connecticut adopted a permit-to-purchase handgun law, firearm homicides fell by an estimated 40% over the following decade relative to a synthetic control, supporting the efficacy of licensing requirements.]",
        "source_3": "[Dee, T. S. (2003). Does Child Access Prevention Save Lives? Journal of Law and Economics, 46(1), 1–27. Finding: Child Access Prevention (safe-storage) laws were associated with about a 23% reduction in unintentional firearm deaths among children, indicating specific storage mandates can reduce accidental fatalities.]",
        "source_4": "[Lott, J. R., & Mustard, D. B. (1997). Crime, Deterrence, and Right-to-Carry Concealed Handguns. Journal of Legal Studies, 26(1), 1–68. Finding: The authors’ econometric analysis concluded that “shall-issue” right-to-carry laws were associated with decreases in violent crime, suggesting that loosening carry restrictions may deter some offenses.]",
        "source_5": "[Koper, C. S. (2013). America’s Experience with the Federal Assault Weapons Ban, 1994–2004: Key Findings and Implications. In D. W. Webster & J. S. Vernick (Eds.), Reducing Gun Violence in America. Johns Hopkins University Press. Finding: Evaluation of the 1994 federal assault weapons ban found little to no measurable impact on overall gun violence, implying that certain categorical bans may yield limited public-safety benefits as implemented.]",
        "source_6": "[Kleck, G., & Gertz, M. (1995). Armed Resistance to Crime: The Prevalence and Nature of Self-Defense with a Gun. Journal of Criminal Law & Criminology, 86(1), 150–187. Finding: Survey-based estimates suggested millions of defensive gun uses annually, a claim used to argue that stricter limits on gun access could reduce opportunities for self-defense; the estimates are contested but represent a key counter-perspective.]"
    }
}