{
    "question": "Do individuals have a moral obligation to assist people in need?",
    "content": {
        "source_1": "Peter Singer (1972), “Famine, Affluence, and Morality,” Philosophy & Public Affairs 1(3): 229–243. Argues that if we can prevent suffering and death without sacrificing anything of comparable moral importance, we are morally obligated to do so; his “shallow pond” analogy implies strong individual duties to aid those in need, even at significant personal cost.",
        "source_2": "Robert Nozick (1974), Anarchy, State, and Utopia, Basic Books. Defends a rights-based, libertarian view centered on negative rights and side-constraints; rejects general positive duties to aid strangers as moral requirements, framing assistance as supererogatory and opposing enforced redistribution (“Taxation of earnings from labor is on a par with forced labor”).",
        "source_3": "John M. Darley & C. Daniel Batson (1973), “From Jerusalem to Jericho: A Study of Situational and Dispositional Variables in Helping Behavior,” Journal of Personality and Social Psychology 27(1): 100–108. Empirical study showing that time pressure sharply reduces helping behavior (even among seminarians about to speak on the Good Samaritan), suggesting that expectations of a standing obligation to assist may conflict with predictable human situational constraints.",
        "source_4": "Thomas Pogge (2002), World Poverty and Human Rights, Polity. Contends that the affluent have stringent negative duties not to uphold unjust global institutions that foreseeably and avoidably cause severe poverty; shifts the basis of obligation from discretionary charity to responsibilities for institutional reform and harm-avoidance.",
        "source_5": "Susan Wolf (1982), “Moral Saints,” The Journal of Philosophy 79(8): 419–439. Critiques highly demanding moral theories that require constant beneficence; argues that making maximal assistance a standing obligation would crowd out legitimate personal projects and values, indicating limits to any purported duty to help.",
        "source_6": "The Qur’an (9:60). Establishes zakat as an obligatory almsgiving with specified recipients (“alms are only for the poor and the needy…”), framing assistance to those in need as a personal religious duty in Islam and grounding a clear, non-optional obligation to help."
    }
}