{
    "question": "Should the school day be extended?",
    "content": {
        "source_1": "Cortes, Kalena E.; Goodman, Joshua S.; Nomi, Takako (2015). Doubling Up: The Long-Run Impacts of Remedial Algebra on Academic Outcomes. Education Finance and Policy. Evidence from Chicago Public Schools shows that assigning underprepared 9th graders to a double-period (extended time) algebra course raised math achievement, increased credit accumulation, and led to higher graduation and college enrollment rates—indicating targeted extensions of the school day for core instruction can produce substantial gains for struggling students.",
        "source_2": "American Academy of Pediatrics (Judith A. Owens et al., 2014; reaffirmed). Policy Statement: School Start Times for Adolescents. The AAP recommends middle and high schools start at 8:30 a.m. or later because adolescents need 8–10 hours of sleep; insufficient sleep is linked to worse grades, depression, and accident risk. Extending the school day without shifting to later start times may exacerbate sleep deprivation and harm learning and health.",
        "source_3": "RAND Corporation (Elizabeth D. Steiner, Ashley Woo, 2021). Job-Related Stress Threatens Teacher Well-Being and Retention. National survey data show teachers report substantially higher job-related stress and burnout than other working adults, with time pressure and workload as leading contributors. Lengthening the school day risks worsening burnout and turnover unless paired with added staffing, planning time, and compensation.",
        "source_4": "Office of Juvenile Justice and Delinquency Prevention (Sickmund, Puzzanchera, et al., 2014). Juvenile Offenders and Victims: 2014 National Report. On school days, juvenile crime and victimization rates peak in the hours immediately after school (roughly 2–6 p.m.). Extending the school day to provide structured supervision during these hours is argued to reduce delinquency and enhance community safety, offering a non-academic rationale for longer days.",
        "source_5": "Fryer, Roland G. Jr. (2014). Injecting Charter School Best Practices into Traditional Public Schools: Evidence from Houston. Quarterly Journal of Economics. A package of reforms that included substantially increased instructional time produced large gains in math and reading. The study suggests extended time can be effective when embedded in a broader model (high-dosage tutoring, data-driven instruction, teacher feedback), implying time alone is unlikely to deliver similar results.",
        "source_6": "Education Endowment Foundation (2021). Teaching and Learning Toolkit: Extending School Time. Synthesizing randomized and quasi-experimental studies, the EEF estimates extending school time yields a small average impact on learning (around +2 months’ progress per year) at moderate cost; benefits are larger when time is tightly targeted (e.g., tutoring), raising questions about the cost-effectiveness of blanket school-day extensions."
    }
}