{
    "question": "Should we produce high-quality generic drugs for Africa?",
    "content": {
        "source_1": "MSF Access Campaign — “Untangling the Web of Antiretroviral Price Reductions” (latest editions) Evidence: First-line HIV treatment prices fell from around $10,000 per patient-year in the early 2000s to under $100 due to generic competition, enabling massive treatment scale-up in sub-Saharan Africa. Supports the view that high-quality generics are central to affordability and lives saved.",
        "source_2": "WHO Regional Office for Africa — “Regional strategy for strengthening local production of medicines and other health technologies in the WHO African Region 2022–2030” (2022) Evidence: Africa imports an estimated 70–90% of its medicines; the strategy argues that expanding quality-assured local production is needed for supply security, resilience to shocks, and reduced dependency. Supports producing (in Africa) high-quality generics for health security.",
        "source_3": "WHO — “Local production for access to medical products: developing a framework to improve public health” (2011, literature review) Evidence: Finds mixed results on whether local drug production lowers prices or improves access; economies of scale, regulatory strength, and procurement efficiency often determine outcomes. Challenges the assumption that producing generics locally will automatically be cost-effective or beneficial.",
        "source_4": "WHO — “A study on the public health and socioeconomic impact of substandard and falsified medical products” (2017) Evidence: Estimates about 1 in 10 medical products in low- and middle-income countries is substandard or falsified; includes an estimate of 116,000 additional deaths annually in sub-Saharan Africa from substandard antimalarials. Emphasizes that “high quality” requires stringent regulation and oversight—production without robust quality systems risks harm.",
        "source_5": "WTO — Doha Declaration on the TRIPS Agreement and Public Health (2001) and Paragraph 6 Decision (2003) Evidence: Affirms countries’ rights to use TRIPS flexibilities (including compulsory licensing) and allows export of medicines made under compulsory license to countries lacking manufacturing capacity—legal mechanisms that enable generic production for African markets. Supports producing generics for Africa via international and regional manufacturing.",
        "source_6": "The Global Fund — Sourcing and Supply Operations Annual Report (e.g., 2023) Evidence: Pooled Procurement Mechanism sources primarily WHO-prequalified/stringent-regulator-approved generics and reports substantial multi-year savings and stable supply for HIV/TB/malaria programs. Suggests that efficient pooled procurement of high-quality generics from global producers can deliver access without necessarily building local production."
    }
}