{
    "question": "Should historical artefacts be repatriated to their country of origin?",
    "content": {
        "source_1": "UNESCO (1970). Convention on the Means of Prohibiting and Preventing the Illicit Import, Export and Transfer of Ownership of Cultural Property. Evidence: Establishes an international legal framework obligating States Parties to prevent illicit trade and facilitate the return of unlawfully exported cultural property, bolstering repatriation claims grounded in law and sovereignty.",
        "source_2": "Declaration on the Importance and Value of Universal Museums (2002). Directors of major museums (e.g., British Museum, Louvre, the Met). Evidence: Argues that encyclopedic museums serve global audiences by preserving and interpreting artifacts beyond national borders; broad repatriation would fragment collections, diminish cross-cultural understanding, and reduce access.",
        "source_3": "Oltermann, Philip (2022). Germany hands over ownership of Benin bronzes to Nigeria. The Guardian, 29 June 2022. Evidence: Germany’s transfer of ownership and initial returns of Benin Bronzes, looted in 1897, exemplify state-led restitution for colonial-era takings and support claims that repatriation can address historical injustice and enable cultural renewal in origin communities.",
        "source_4": "Bogdanos, Matthew (2005). The Casualties of War: Antiquities Protection and the 2003 Iraq Museum Looting. American Journal of Archaeology, 109(3). Evidence: Documents large-scale looting of the Iraq Museum during conflict, often cited by opponents of blanket repatriation to argue that in unstable contexts artifacts may face higher risks than in well-resourced foreign institutions.",
        "source_5": "U.S. National Park Service (1990; updated 2024). Native American Graves Protection and Repatriation Act (NAGPRA) and 2024 regulations. Evidence: U.S. federal law mandates the return of Native American human remains and cultural items; recent rules accelerate returns and require tribal consent for display, demonstrating tangible ethical, legal, and community benefits of repatriation.",
        "source_6": "BBC News (2023). British Museum ‘in talks’ with Greece over Parthenon Sculptures. Evidence: Reports on negotiations exploring long-term loans/partnerships rather than outright transfer, illustrating a compromise model—shared stewardship and loans—as an alternative to full repatriation that maintains access while acknowledging origin claims."
    }
}