{
    "question": "Is history as a subject in school necessary?",
    "content": {
        "source_1": "Reisman, A. (2012). Reading Like a Historian: A Document-Based History Curriculum Intervention in Urban Schools. Cognition and Instruction, 30(1), 86–112. https://doi.org/10.1080/07370008.2011.634081 - Quasi-experimental study showing that inquiry-based history instruction improved students’ historical thinking and reading comprehension, supporting the claim that history as a school subject cultivates transferable analytic and literacy skills.",
        "source_2": "UNESCO (2015). Global Citizenship Education: Topics and learning objectives. Paris: UNESCO. https://unesdoc.unesco.org/ark:/48223/pf0000232993 - Policy framework arguing that understanding historical processes and perspectives is essential for democratic participation and intercultural understanding, positioning school history as foundational to civic competence.",
        "source_3": "National Center for Education Statistics (2023). The Nation’s Report Card: U.S. History and Civics 2022. https://www.nationsreportcard.gov/ushistory?grade=8 - National assessment documenting record-low performance in U.S. history among eighth graders, used by many educators and policymakers to argue for strengthening history instruction to address a civic knowledge deficit.",
        "source_4": "Rieff, D. (2016). In Praise of Forgetting: Historical Memory and Its Ironies. Yale University Press. https://yalebooks.yale.edu/book/9780300186933/in-praise-of-forgetting/ - Argues that collective historical memory can inflame grievances and perpetuate conflict, challenging the assumption that more history education is always socially beneficial.",
        "source_5": "Wineburg, S. (2001; 2018 updated ed.). Historical Thinking and Other Unnatural Acts: Charting the Future of Teaching the Past. Teachers College Press. https://www.tcpress.com/historical-thinking-and-other-unnatural-acts-9780807747147 - Critiques traditional school history as rote and ineffective at fostering genuine historical reasoning, suggesting that merely having history as a subject does not ensure desired outcomes without major pedagogical reform.",
        "source_6": "Guess, A. M., Lerner, M., Lyons, B., Montgomery, J. M., Nyhan, B., Reifler, J., & Sircar, N. (2020). A digital media literacy intervention increases discernment between mainstream and false news in the United States and India. Proceedings of the National Academy of Sciences, 117(27), 15536–15545. https://www.pnas.org/doi/10.1073/pnas.1920498117 - Finds that a brief, targeted media literacy course improves misinformation discernment, implying that goals often cited for history (e.g., resisting misinformation) can be achieved through focused interventions without a standalone history course."
    }
}