{
    "question": "Are newspapers a thing of the past?",
    "content": {
        "source_1": "State of Local News 2023 — Northwestern University Medill School, 2023. https://localnewsinitiative.northwestern.edu/research/state-of-local-news/2023/ - Evidence: Medill documents the loss of roughly 2,900 U.S. newspapers since 2005 and the expansion of “news deserts” (counties with no or very limited local news), indicating a structural collapse of the traditional print newspaper ecosystem in many communities.",
        "source_2": "Digital News Report 2024 — Reuters Institute for the Study of Journalism, 2024. https://reutersinstitute.politics.ox.ac.uk/digital-news-report/2024 - Evidence: The report finds print use continues to fall sharply across markets, with under-35s rarely using print and most audiences accessing news via smartphones, platforms, and online publishers—supporting the view that print newspapers are increasingly marginal to everyday news consumption.",
        "source_3": "The New York Times Company Reports 2023 Fourth-Quarter and Full-Year Results — The New York Times Company (Investor Relations), Feb 2024. https://investors.nytco.com/investors/financials/default.aspx - Evidence: The NYT surpassed 10 million total subscriptions, with the vast majority digital; digital subscription revenue growth and profitability underscore that leading newspaper brands are thriving by transforming their business models rather than disappearing—countering the notion that “newspapers” are simply over.",
        "source_4": "World Press Trends Outlook 2023–2024 — WAN-IFRA (World Association of News Publishers), 2023. https://wan-ifra.org/insight-reports/world-press-trends-outlook-2023-2024/ - Evidence: WAN-IFRA reports that in many markets print circulation revenue still represents a substantial share of reader revenue and remains operationally important to publishers, suggesting print editions continue to play a material role in sustaining news businesses.",
        "source_5": "Newspapers in Japan (Circulation and Industry Overview) — Japan Newspaper Publishers & Editors Association (NSK), accessed 2023–2024. https://www.pressnet.or.jp/english/ - Evidence: NSK data show Japan remains a global outlier with major dailies still distributing several million print copies and maintaining dense home-delivery networks, illustrating that print newspapers retain significant relevance in certain markets and are not uniformly “a thing of the past.”"
    }
}