{
    "question": "Should developing nations place restrictions on rural-urban migration?",
    "content": {
        "source_1": "UN-Habitat (2022), World Cities Report 2022: Envisaging the Future of Cities — Documents that rapid rural-urban migration in developing regions has outpaced formal housing and basic services, contributing to over 1 billion people living in slums and elevating public health and infrastructure strain. This evidence is often used to justify tightening in-migration to relieve pressure on overstretched cities.",
        "source_2": "Harris, J. R., & Todaro, M. P. (1970), “Migration, Unemployment and Development: A Two-Sector Analysis,” American Economic Review — The classic model shows that when expected urban wages exceed rural earnings, unrestricted migration can create large urban unemployment/underemployment “queues.” Empirical work on Sub-Saharan Africa’s cities reporting high youth unemployment supports the concern that limiting inflows can reduce socially costly job queues.",
        "source_3": "Chan, K. W., & Buckingham, W. (2008), “Is China Abolishing the Hukou System?” The China Quarterly; and related work (e.g., Au & Henderson, 2006) — China’s hukou-based restrictions curbed slum formation and moderated megacity growth, but also generated inequality and efficiency losses by denying migrants urban services and misallocating labor. This case illustrates both the potential benefits (less informal settlement) and significant costs of migration restrictions.",
        "source_4": "World Bank (2009), World Development Report: Reshaping Economic Geography — Argues that mobility and urbanization are central to structural transformation and productivity gains via agglomeration economies; restricting internal migration keeps workers in low-productivity locations and slows growth. Recommends policies that facilitate, not impede, movement to dynamic urban areas.",
        "source_5": "Beegle, K., De Weerdt, J., & Dercon, S. (2011), “Migration and Economic Mobility in Tanzania: Evidence from a Tracking Survey,” Review of Economics and Statistics — Finds large, sustained increases in consumption and poverty reduction among internal migrants who leave rural areas for towns/cities. Indicates that restricting rural-urban moves would block a proven pathway for household-level upward mobility.",
        "source_6": "World Bank (2017), Africa’s Cities: Opening Doors to the World — Concludes that restricting migration does not halt urban growth but diverts it into informality; the binding constraints are dysfunctional land markets, inadequate serviced land, and weak transport. Recommends expanding serviced urban land and basic infrastructure and developing secondary cities as superior alternatives to migration caps."
    }
}