{
    "question": "Should the United States increase its foreign aid budget?",
    "content": {
        "source_1": "Congressional Research Service — “U.S. Foreign Assistance: An Introduction” (2023). CRS notes that total U.S. foreign aid is roughly 1% of the federal budget, concentrated in discretionary accounts. This implies that even a sizable percentage increase would have a limited impact on overall budget outlays while potentially yielding diplomatic, economic, and security returns.",
        "source_2": "JAMA — Bendavid et al., “Association of the President’s Emergency Plan for AIDS Relief with Adult Mortality” (2012). A quasi-experimental study found significant declines in all-cause adult mortality (on the order of 10–15%) in PEPFAR focus countries relative to controls, providing evidence that targeted U.S. health aid can save lives at scale. This supports arguments for increasing evidence-backed aid programs.",
        "source_3": "Angus Deaton — “The Great Escape: Health, Wealth, and the Origins of Inequality” (2013). Deaton argues that large-scale foreign aid can distort local accountability, entrench poor governance, and shows limited evidence of sustained economic growth effects. This perspective cautions against increasing aid without addressing fundamental incentive problems.",
        "source_4": "OECD Development Assistance Committee — “Development Co-operation Profiles: United States” (2023). OECD data show the U.S. gives the most aid in absolute terms but only about 0.22% of GNI—well below the UN’s 0.7% benchmark and below many peers. This supports the view that the U.S. should increase aid to meet international burden-sharing norms.",
        "source_5": "USAID Office of Inspector General — “Top Management Challenges for USAID” (FY 2024). The OIG highlights persistent weaknesses in monitoring and evaluation, fraud risk management, and partner oversight—especially amid localization and work in fragile settings. This evidence underpins the argument to prioritize reforms and oversight before expanding the aid budget.",
        "source_6": "AidData — “Banking on the Belt and Road” (2021). Analysis of China’s overseas finance finds large volumes of opaque, collateralized lending and rising debt distress risks in many low- and middle-income countries, alongside measurable geopolitical influence gains for Beijing. Proponents argue the U.S. should increase high-standard, transparent aid to offer credible alternatives and compete strategically."
    }
}