{
    "question": "Are social networking sites good for our society?",
    "content": {
        "source_1": "Cameron, A. M., Massie, A. B., Alexander, C. E., et al. (2013). Social Media and Organ Donation: The Facebook Effect. American Journal of Transplantation. After Facebook introduced an organ-donor status in 2012, daily donor registrations spiked dramatically (up to 21-fold in some U.S. states on day one), indicating social networks can catalyze large-scale prosocial health behavior.",
        "source_2": "Houston, J. B., Hawthorne, J., Perreault, M. F., et al. (2015). Social media and disasters: A functional framework for social media use in disaster planning, response, and research. Disasters. Reviews evidence that social platforms improve situational awareness, volunteer coordination, and information dissemination during crises (e.g., hurricanes, earthquakes), supporting a public-safety benefit.",
        "source_3": "Vosoughi, S., Roy, D., Aral, S. (2018). The spread of true and false news online. Science. Large-scale Twitter analysis shows false news spreads faster, farther, and more broadly than truth—especially in politics—suggesting social networks can undermine societal knowledge by amplifying misinformation.",
        "source_4": "Twenge, J. M., Joiner, T. E., Rogers, M. L., Martin, G. N. (2018). Increases in depressive symptoms, suicide-related outcomes, and suicide rates among U.S. adolescents after 2010 and links to increased new media screen time. Clinical Psychological Science. Correlational evidence links higher social media/screen time with increased depressive symptoms and suicide-related outcomes in teens, indicating potential harms to youth well-being.",
        "source_5": "McKinsey Global Institute (2012). The social economy: Unlocking value and productivity through social technologies. Estimates social technologies could generate $900 billion–$1.3 trillion in annual value across sectors by boosting collaboration, knowledge sharing, and marketing efficiency—an economic gain for society.",
        "source_6": "Federal Trade Commission (2019). FTC Imposes $5 Billion Penalty and Sweeping New Privacy Restrictions on Facebook. The record fine following the Cambridge Analytica scandal documents significant misuse of user data, highlighting societal risks to privacy and autonomy posed by social networking platforms."
    }
}