{
    "question": "Should we have a criminal DNA database?",
    "content": {
        "source_1": "FBI Laboratory, CODIS/NDIS Statistics (ongoing). The FBI reports that the national Combined DNA Index System (CODIS) has generated hundreds of thousands of hits and aided a large number of investigations across the United States, demonstrating substantial investigative value from a criminal DNA database. https://www.fbi.gov/services/laboratory/biometric-analysis/codis/ndis-statistics",
        "source_2": "Jennifer L. Doleac, “The Effects of DNA Databases on Crime,” American Economic Journal: Applied Economics, 2017. A peer-reviewed, quasi-experimental analysis finds that expanding DNA databases (including to arrestees in some states) reduces crime and is highly cost-effective relative to alternatives, suggesting strong public-safety returns to broader criminal DNA databasing. https://www.aeaweb.org/articles?id=10.1257/app.20150043",
        "source_3": "Maryland v. King, 569 U.S. 435 (2013). The U.S. Supreme Court upheld the collection of DNA via cheek swab from individuals arrested for serious offenses as a reasonable identification procedure akin to fingerprinting, providing constitutional support in the United States for building and using criminal DNA databases. https://supreme.justia.com/cases/federal/us/569/435/",
        "source_4": "S. and Marper v. United Kingdom, European Court of Human Rights, App. Nos. 30562/04 and 30566/04 (2008). The ECHR held that indefinite retention of DNA profiles and samples from people not convicted violates the right to privacy (Article 8), highlighting civil-liberties limits on how expansive a DNA database can be, especially regarding unconvicted individuals. https://hudoc.echr.coe.int/eng?i=001-90051",
        "source_5": "Erin Murphy, Inside the Cell: The Dark Side of Forensic DNA (2015). A legal scholar argues that expanding criminal DNA databases risks surveillance creep, mission drift, and disproportionate impact on over-policed communities, raising equity and privacy concerns that challenge the “must have” premise and call for stricter limits and oversight. ISBN: 978-1568584943",
        "source_6": "Helen Carter, “Man wrongly arrested after DNA sample contamination,” The Guardian, 2013. The Adam Scott case in the UK shows how laboratory contamination led to a false DNA match and wrongful arrest, illustrating that database-driven matches can mislead investigations without rigorous quality controls and error safeguards. https://www.theguardian.com/uk/2013/jan/30/man-wrongly-arrested-dna-contamination"
    }
}