{
    "question": "Can the integration of Africa through the African Union succeed?",
    "content": {
        "source_1": "World Bank (2020). “The African Continental Free Trade Area: Economic and Distributional Effects.” World Bank Group. https://www.worldbank.org/en/topic/trade/publication/the-african-continental-free-trade-area - Evidence: Modeling finds AfCFTA, an AU-led flagship, could raise Africa’s income by about $450 billion by 2035, boost intra-African exports by 81%, and lift 30 million people out of extreme poverty—indicating continental integration can succeed if implementation is sustained.",
        "source_2": "East African Community Secretariat and TradeMark East Africa (various, 2018–2022). Reports on One-Stop Border Posts and the Single Customs Territory. https://www.eac.int/ | https://www.trademarkea.com - Evidence: Practical gains from a REC “building block” show integration works in Africa—e.g., One-Stop Border Posts and the EAC Single Customs Territory cut border clearance times by over 50% on key corridors and reduced logistics costs, suggesting AU’s stepwise, REC-led integration model is feasible.",
        "source_3": "Nkengasong, J. et al. (2021–2022). Africa CDC/AU Joint Continental Strategy for COVID-19 and AVATT updates. Africa CDC and AU. https://africacdc.org - Evidence: The AU coordinated continent-wide pandemic measures, including pooled procurement via the Africa Medical Supplies Platform and the AVATT mechanism securing hundreds of millions of vaccine doses, demonstrating the Union’s capacity to mobilize collective action across diverse member states.",
        "source_4": "African Union Treaty Status (updated periodically). “Protocol on Free Movement of Persons, Right of Residence and Right of Establishment.” https://au.int/en/treaties/protocol-treaty-establishing-african-economic-community-relating-free-movement-persons - Evidence: Years after adoption (2018), the protocol still lacks the 15 ratifications needed to enter into force, with only a small number of states having ratified—highlighting weak political will on labor mobility that could impede successful continental integration.",
        "source_5": "Reuters (Jan 28, 2024). “Mali, Burkina Faso and Niger say they have left ECOWAS.” https://www.reuters.com/world/africa/mali-burkina-faso-niger-say-they-have-left-ecowas-2024-01-28/ - Evidence: Political instability and divergent security trajectories are fragmenting regional blocs (e.g., Sahel states quitting ECOWAS, AU suspensions after coups), undermining the trust, policy alignment, and free movement needed for AU-led integration to succeed.",
        "source_6": "Brookings Institution – Africa Growth Initiative (2017; updates through 2020). “Financing the African Union: on the path to self-reliance?” https://www.brookings.edu - Evidence: Analyses show the AU has long relied on external partners for a large share (often around 60% or more) of its budget, and the proposed 0.2% import levy has been unevenly implemented—raising doubts about the financial sustainability required for successful, long-term integration."
    }
}