{
    "question": "Should endangered species be protected?",
    "content": {
        "source_1": "Bolam, F. C., et al. (2020). Conservation Letters — Analysis estimated that targeted conservation actions since 1993 prevented 21–32 bird and mammal extinctions, demonstrating that species-specific protection can avert losses. https://onlinelibrary.wiley.com/doi/10.1111/conl.12762",
        "source_2": "Estes, J. A., et al. (2011). Science — “Trophic downgrading of planet Earth” shows that losing apex predators triggers cascading ecological and economic damages; protecting endangered top predators helps maintain ecosystem stability and services. https://www.science.org/doi/10.1126/science.1205106",
        "source_3": "IPBES (2019). Global Assessment Report on Biodiversity and Ecosystem Services — Concludes that biodiversity underpins food, water, health, and livelihoods, with about 1 million species at risk; safeguarding threatened species is part of avoiding severe risks to human well-being. https://ipbes.net/global-assessment",
        "source_4": "Lueck, D., & Michael, J. A. (2003). Journal of Law and Economics — Evidence of “preemptive habitat destruction” by U.S. landowners to avoid Endangered Species Act restrictions (e.g., for the red-cockaded woodpecker), suggesting some protection rules can backfire without proper incentives. https://www.journals.uchicago.edu/doi/10.1086/381274",
        "source_5": "Bottrill, M. C., et al. (2008). Trends in Ecology & Evolution — Argues for conservation triage: with finite budgets, not all endangered species can or should be saved; prioritization based on costs, benefits, and probability of success may yield better overall outcomes. https://www.sciencedirect.com/science/article/pii/S0169534708002872",
        "source_6": "West, P., Igoe, J., & Brockington, D. (2006). Current Anthropology — Reviews social impacts of protected areas, documenting cases of displacement and livelihood costs for local communities, raising ethical and practical concerns about species protection strategies that impose human costs. https://www.journals.uchicago.edu/doi/10.1086/499552"
    }
}