{
    "question": "Is golf a sport?",
    "content": {
        "source_1": "International Olympic Committee / International Golf Federation (2016–present): Golf was reinstated to the Olympic program in 2016, and the sport’s global federation (IGF) is a signatory to the World Anti-Doping Code, with Olympic golfers subject to in-competition and out-of-competition testing—an institutional recognition and regulation framework typical of sports.",
        "source_2": "Murray, A. et al., “Golf and health: a scoping review,” British Journal of Sports Medicine (2016): Peer‑reviewed synthesis reporting that participation in golf is associated with moderate levels of physical activity (when walking), improved cardiovascular risk factors, balance, and longevity—evidence consistent with health and performance benefits expected of sports.",
        "source_3": "National Collegiate Athletic Association (NCAA): The NCAA sanctions men’s and women’s golf with formal championships, coaching, training, and inclusion in its Injury Surveillance Program—treating golf as an intercollegiate sport with athlete health, eligibility, and competitive structures comparable to other NCAA sports.",
        "source_4": "Ainsworth et al., Compendium of Physical Activities (with U.S. HHS/CDC intensity categories): The Compendium classifies golf played while riding in a cart as light-intensity activity (<3 METs), while walking the course and carrying/pulling clubs falls in the moderate-intensity range (3–5.9 METs); thus, depending on how it’s played, golf may not consistently meet exertion expectations some use to define “sport.”",
        "source_5": "U.S. Supreme Court, PGA Tour, Inc. v. Martin, 532 U.S. 661 (2001): The Court held that allowing a golfer to use a cart under the ADA would not fundamentally alter professional competition because fatigue from walking is not an essential aspect tested by golf—supporting the view that physical exertion is not central to the activity in the way it is for many sports."
    }
}