{
    "question": "Should gay marriage be legal?",
    "content": {
        "source_1": "Obergefell v. Hodges, 576 U.S. 644 (2015) — The U.S. Supreme Court held that the Fourteenth Amendment requires states to license and recognize marriages between same-sex couples, framing marriage as a fundamental right tied to individual autonomy and equal protection. This legal precedent supports the claim that gay marriage should be legal on constitutional grounds.",
        "source_2": "Hatzenbuehler, M. L., et al. “Association Between State Same-Sex Marriage Policies and Adolescent Suicide Attempts.” JAMA Pediatrics, 2017 — Using a differences-in-differences design, the study found state legalization was associated with a 7% reduction in suicide attempts among all adolescents and a 14% reduction among LGB youth, suggesting public-health benefits of legal recognition.",
        "source_3": "American Academy of Pediatrics, Policy Statement: “Promoting the Well-Being of Children Whose Parents Are Gay or Lesbian” (2013) — Concludes that children raised by same-sex parents have similar health, adjustment, and developmental outcomes as those raised by different-sex parents, and that allowing parents to marry enhances child stability and well-being.",
        "source_4": "Regnerus, Mark. “How different are the adult children of parents who have same-sex relationships? Findings from the New Family Structures Study.” Social Science Research, 2012 — Reports comparatively poorer outcomes on several measures among young adults with a parent who had a same-sex relationship, a finding cited by opponents to question legalization’s social effects (though the study’s methodology and interpretation have been widely criticized in the field).",
        "source_5": "Masterpiece Cakeshop v. Colorado Civil Rights Commission, 584 U.S. ___ (2018) — The Supreme Court ruled that a state civil rights agency showed unconstitutional hostility to a baker’s religious beliefs in a dispute over a cake for a same-sex wedding. Cited by critics as evidence that legalizing gay marriage can create conflicts with religious liberty and conscience protections.",
        "source_6": "The Williams Institute (UCLA School of Law), “The Economic Impact of Marriage for Same-Sex Couples” (multiple state and national reports, 2014–2019) — Empirical estimates indicate billions of dollars in additional wedding-related spending, tourism, and tax revenues in jurisdictions after legalization (e.g., several billion in the U.S. in the years following Obergefell), suggesting positive economic effects of legal recognition."
    }
}