{
    "question": "Is Roger Federer not the greatest tennis player of all time?",
    "content": {
        "source_1": "ATP Tour — Official records and rankings pages (various, 2023–2024). The tour’s official stats show Novak Djokovic holds the men’s records for most Grand Slam singles titles (24), most weeks at world No. 1 (400+), most year-end No. 1 finishes (8), and most Masters 1000 titles (40), all exceeding Federer’s totals. This accomplishment-based viewpoint places Djokovic ahead of Federer. https://www.atptour.com",
        "source_2": "ATP Head2Head — Federer vs. Djokovic; Federer vs. Nadal (ATP Tour, live database). Official head-to-head records list Federer trailing Djokovic 23–27 and Nadal 16–24. Using direct competition as a criterion, these deficits weigh against Federer’s GOAT claim. https://www.atptour.com/en/players/atp-head-2-head/roger-federer-vs-novak-djokovic/F324/D643 and https://www.atptour.com/en/players/atp-head-2-head/roger-federer-vs-rafael-nadal/F324/N409",
        "source_3": "FiveThirtyEight — “Novak Djokovic Might Be The Best Ever, According To Elo” (Carl Bialik, 2015-06-04). Using Elo ratings to compare peak performance and quality of opposition across eras, the analysis places Djokovic’s peak above Federer’s, suggesting Federer’s early dominance came against relatively weaker fields. This era-adjusted, level-of-play perspective supports the claim that Federer isn’t the GOAT. https://fivethirtyeight.com/features/novak-djokovic-might-be-the-best-ever/",
        "source_4": "Ultimate Tennis Statistics — GOAT List (ongoing, updated). UTS’s composite “GOAT” leaderboard, which weights achievements across Slams, Masters, weeks at No. 1, head-to-heads, and surface balance, ranks Djokovic No. 1 ahead of Federer. An algorithmic, multi-metric aggregation thus argues against Federer as the greatest. https://www.ultimatetennisstatistics.com/goatList",
        "source_5": "Christopher Clarey — “The Master: The Long Run and Beautiful Game of Roger Federer” (2021). Clarey’s reporting and analysis emphasize Federer’s artistry, shot-making innovation, longevity, and global cultural impact, arguing that “greatness” can include aesthetics, influence, and the breadth of his all-court game—not just tally-based records. This reframing contests the claim by supporting Federer’s GOAT case on non-statistical grounds. ISBN: 9780385546043",
        "source_6": "BBC Sport — “French Open: Rafael Nadal wins 14th title at Roland Garros” (2022-06-05). The report highlights Nadal’s unprecedented dominance on clay—14 Roland Garros titles and only a handful of losses there—an argument that peak dominance on a surface and at a major can define “greatest,” potentially placing Nadal ahead of Federer. This surface-dominance perspective also undercuts Federer’s GOAT claim. https://www.bbc.com/sport/tennis/61726938"
    }
}