{
    "question": "Should parents be able to choose the sex of their children?",
    "content": {
        "source_1": "Robertson, John A. Children of Choice: Freedom and the New Reproductive Technologies (1994) — Argues that “procreative liberty” includes parental discretion to select a child’s sex when it does not impose clear harms on others, framing sex selection (especially for family balancing) as a permissible exercise of reproductive autonomy.",
        "source_2": "Human Fertilisation and Embryology Authority (UK), “Sex selection” (HFEA guidance, current) — States it is illegal in the UK to choose a baby’s sex for non-medical reasons; sex selection is permitted only to avoid serious sex-linked genetic conditions via licensed preimplantation genetic testing, reflecting a precautionary public-interest stance.",
        "source_3": "UNFPA, State of World Population 2020: Against My Will — Documents large-scale demographic and social harms from gender-biased sex selection, estimating over 140 million “missing women” globally, with skewed sex ratios linked to son preference contributing to trafficking risks, violence, and long-term societal imbalances.",
        "source_4": "Ethics Committee of the American Society for Reproductive Medicine (ASRM), “Use of reproductive technology for sex selection for nonmedical reasons” (Fertility and Sterility, 2015) — Concludes nonmedical sex selection raises ethical concerns and should be discouraged, but may be ethically permissible in limited circumstances such as family balancing with thorough counseling; notes PGD is effective while sperm sorting has limitations and regulatory constraints.",
        "source_5": "Congregation for the Doctrine of the Faith (Vatican), Dignitas Personae (2008) — Condemns sex selection and the embryo selection practices it entails as contrary to human dignity, arguing such choices instrumentalize children and foster discrimination, thereby rejecting parental discretion to choose sex on moral grounds.",
        "source_6": "Israel Ministry of Health, National Committee Policy on Nonmedical Sex Selection via PGD (policy framework, established mid-2000s; updated subsequently) — Allows sex selection for nonmedical reasons only in exceptional, case-by-case approvals by a national committee, typically requiring multiple children of the same sex and demonstrated psychological distress; exemplifies a tightly regulated compromise between autonomy and societal concerns."
    }
}