{
    "question": "Should the UN be reformed or replaced?",
    "content": {
        "source_1": "Security Council Report, “The Veto” (updated 2023) — Empirical tracking shows frequent use of the veto has blocked Security Council action on major crises (e.g., repeated vetoes on Syria-related resolutions and Russia’s veto of resolutions on its actions in Ukraine), illustrating structural paralysis that reformers cite as reason to curb or redesign the veto power.",
        "source_2": "Hultman, Kathman, and Shannon, “United Nations Peacekeeping and Civilian Protection in Civil Wars,” American Journal of Political Science (2013) — Large-N analysis finds UN peacekeeping missions significantly reduce civilian killings and help limit conflict violence, evidence that the UN’s existing tools can work effectively and argue for strengthening rather than replacing the institution.",
        "source_3": "Independent Inquiry Committee into the United Nations Oil-for-Food Programme (Volcker Report), Final Report (2005) — Documents widespread corruption, procurement irregularities, and management failures in a flagship UN program, fueling arguments that the UN’s accountability deficits warrant deep structural reform or a fundamentally different replacement model.",
        "source_4": "African Union, “The Ezulwini Consensus: The Common African Position on the Proposed Reform of the United Nations” (2005) — Calls for at least two permanent seats (with veto) and five non-permanent seats for Africa on the Security Council, highlighting legitimacy and representation gaps that many states argue must be addressed through reform rather than abandonment.",
        "source_5": "UNEP/WMO, Scientific Assessment of Ozone Depletion: 2022 (released 2023) — Concludes the Montreal Protocol (a UN-facilitated treaty) has phased out about 99% of ozone-depleting substances and put the ozone layer on track to recover, evidence that UN-centered multilateral frameworks can deliver major global public goods and caution against replacing the UN.",
        "source_6": "Ivo Daalder and James Lindsay, “Democracies of the World, Unite,” Foreign Affairs (2007) — Proposes a Concert/League of Democracies to act when the UN is gridlocked, arguing a new body of like-minded states could be more decisive and legitimate in addressing security threats, sanctions, and humanitarian interventions than the current UN system."
    }
}