{
    "question": "Should adaptation be the most urgent response to climate change?",
    "content": {
        "source_1": "IPCC AR6 Working Group II, Summary for Policymakers (2022) — Assesses that some climate impacts are now unavoidable in the near term (2021–2040), with 3.3–3.6 billion people living in contexts highly vulnerable to climate change. Concludes that rapidly scaling adaptation is urgent to reduce mounting risks from locked-in heat, sea-level rise, and extreme events already affecting human and natural systems.",
        "source_2": "IPCC AR6 Synthesis Report, Summary for Policymakers (2023) — Finds that adaptation options become less effective as warming increases and that hard limits to adaptation are already being reached in some ecosystems. Emphasizes that only deep, rapid mitigation can prevent escalating losses, challenging the idea that adaptation should be the most urgent priority.",
        "source_3": "Global Commission on Adaptation, “Adapt Now: A Global Call for Leadership on Climate Resilience” (2019) — Estimates that $1.8 trillion invested in adaptation between 2020–2030 could yield $7.1 trillion in net benefits, with very high benefit-cost ratios for measures like early warning systems, climate-resilient infrastructure, and mangrove protection. Presents an economic case for prioritizing near-term adaptation.",
        "source_4": "International Energy Agency, Net Zero Roadmap (2023 update) — Argues that the most cost-effective, immediate actions to secure a livable climate are mitigation steps this decade (e.g., tripling renewables and doubling energy efficiency improvement rates by 2030), enabled by steep cost declines in clean technologies. Frames mitigation as the more urgent lever to avoid locking in higher future adaptation burdens.",
        "source_5": "UNEP Adaptation Gap Report (2023) — Reports that adaptation finance needs in developing countries are estimated at $215–387 billion per year this decade, while current international public flows are 10–18 times lower. Highlights an acute and widening adaptation finance gap, making a case that closing it is an urgent priority to protect the most vulnerable now.",
        "source_6": "Armstrong McKay et al., Science (2022) — Synthesizes evidence that exceeding 1.5–2.0°C could trigger multiple climate tipping points (e.g., ice-sheet destabilization, AMOC weakening) with abrupt, potentially irreversible changes beyond the scope of adaptation in many regions. Supports prioritizing aggressive mitigation to avoid outcomes adaptation cannot manage."
    }
}