{
    "question": "Is positive discrimination towards women in society justified?",
    "content": {
        "source_1": "World Economic Forum (2024). Global Gender Gap Report 2024. Finds that substantial gaps persist in economic participation, political representation, and pay; at current rates, global gender parity remains more than a century away. This is used to justify positive discrimination as a corrective to enduring structural inequalities.",
        "source_2": "Beaman, L., Duflo, E., Pande, R., & Topalova, P. (2012). Female leadership raises aspirations and educational attainment for girls: A randomized policy experiment in India. Science. Exploiting randomized village council seat reservations for women, the study shows quotas reduced gender bias, raised parents’ and girls’ aspirations, and increased girls’ educational attainment—evidence that positive discrimination can produce long-run norm and outcome improvements.",
        "source_3": "Ahern, K. R., & Dittmar, A. K. (2012). The Changing of the Boards: The Impact on Firm Valuation of Mandated Female Board Representation. The Quarterly Journal of Economics. Examining Norway’s board gender quota, the authors find a short- to medium-run decline in firm value, attributing it partly to younger, less-experienced appointees; this is used to argue such mandates can have unintended economic costs.",
        "source_4": "Williams, W. M., & Ceci, S. J. (2015). National hiring experiments reveal 2:1 faculty preference for women on STEM tenure track. Proceedings of the National Academy of Sciences. In controlled hiring simulations with equivalent dossiers, STEM faculty preferred female candidates by roughly 2:1, suggesting that in some contexts women may already receive preferential consideration, complicating blanket justifications for further positive discrimination.",
        "source_5": "Herring, C. (2009). Does diversity pay? Race, gender, and the business case for diversity. American Sociological Review. Firm-level analysis links greater gender diversity to higher sales revenue, more customers, and greater relative profits, supporting the view that proactive gender-inclusive policies can enhance organizational performance.",
        "source_6": "UN Committee on the Elimination of Discrimination against Women (2004). General Recommendation No. 25 on Article 4(1) of CEDAW (Temporary Special Measures). Clarifies that time-bound positive measures to accelerate de facto equality for women are permissible and not discriminatory under international law, providing a legal-normative basis for justified positive discrimination."
    }
}