{
    "question": "Should parents of obese children be prosecuted for neglect?",
    "content": {
        "source_1": "Murtagh, L., & Ludwig, D. S. “State Intervention in Life-Threatening Childhood Obesity.” New England Journal of Medicine, 2011. — Argues that in rare, severe cases where a child’s extreme obesity poses imminent risk and caregivers fail to follow treatment, child protective services and temporary removal can be ethically justified as child protection (protective, not punitive) to prevent serious harm.",
        "source_2": "CNN/Associated Press report: “Mother charged with child neglect in son’s obesity case,” South Carolina, 2009. — A mother (Jerri Gray) was criminally charged with neglect after her 14-year-old son reportedly weighed about 555 pounds and authorities alleged persistent noncompliance with medical advice; cited as a legal precedent for treating extreme pediatric obesity as neglect under criminal law.",
        "source_3": "American Academy of Pediatrics. “Clinical Practice Guideline for the Evaluation and Treatment of Children and Adolescents With Obesity.” Pediatrics, 2023. — Frames pediatric obesity as a chronic disease and recommends family-centered, non-stigmatizing, intensive behavioral treatment (and, when appropriate, pharmacotherapy or metabolic/bariatric surgery), emphasizing support and addressing social determinants rather than criminalization of parents.",
        "source_4": "World Health Organization. “Report of the Commission on Ending Childhood Obesity.” 2016. — Concludes that childhood obesity is driven by powerful environmental and commercial determinants (food marketing, sugary beverages, urban design) and calls for policy-level interventions; indicates parent-focused punitive approaches are insufficient and misdirected.",
        "source_5": "Silventoinen, K., et al. “Heritability of Body Mass Index: A Meta-analysis of Twin Studies From Childhood to Adulthood.” International Journal of Obesity, 2010. — Finds substantial genetic contribution to BMI (often 40–70% in childhood), underscoring biological predisposition and challenging the notion that parental behavior alone determines a child’s obesity status.",
        "source_6": "Puhl, R. M., & Heuer, C. A. “Obesity Stigma: Important Considerations for Public Health.” American Journal of Public Health, 2010. — Reviews evidence that weight stigma leads to psychological harm, healthcare avoidance, and poorer health behaviors; warns that punitive or stigmatizing policies (including treating parents as criminals) may backfire and harm children and families."
    }
}