{
    "question": "Should targeted sanctions be used to respond to cyber-attacks?",
    "content": {
        "source_1": "The White House, National Cybersecurity Strategy (March 2023). The U.S. strategy explicitly commits to “impose costs” on malicious cyber actors using tools including targeted financial sanctions, positioning sanctions as a core response mechanism to cyber-attacks within a broader disruption campaign.",
        "source_2": "Council of the European Union, Press release: EU imposes first ever sanctions against cyber-attacks (30 July 2020). The EU’s inaugural use of its cyber sanctions regime targeted individuals and entities linked to WannaCry, NotPetya, Operation Cloud Hopper, and the OPCW hack attempt—evidence that targeted sanctions are a practical, multilateral instrument to respond to major cyber-attacks and signal norm enforcement.",
        "source_3": "Joseph S. Nye Jr., Deterrence and Dissuasion in Cyberspace, International Security (2017). Nye argues punishment-based tools like sanctions often have limited deterrent effect in cyberspace due to attribution challenges and low costs for insulated adversaries; he recommends prioritizing denial, resilience, entanglement, and norms—countering the idea that sanctions “have to” be used.",
        "source_4": "Chainalysis, The 2023 Crypto Crime Report (2023) and related analyses of OFAC designations (e.g., SUEX, Garantex, Tornado Cash). Data show targeted sanctions can sharply disrupt specific enablers and reduce inflows short-term, but cybercriminals adapt by migrating to new services and laundering pathways—suggesting sanctions impose friction rather than decisively stopping cyber-enabled crime.",
        "source_5": "Ellen Nakashima, U.S. Cyber Command operation disrupted Russia’s Internet Research Agency during the 2018 midterms, The Washington Post (Feb. 27, 2019). This case illustrates that offensive cyber operations and “defend forward” can be used to respond to and preempt cyber-enabled influence operations, offering an alternative to sanctions and challenging the claim that sanctions are necessary.",
        "source_6": "Tom Keatinge and Allison Owen, Are Sanctions a Useful Tool to Tackle Ransomware?, RUSI Commentary (2021). The authors argue sanctions can help constrain facilitators and signal consequences but risk unintended harm to victims, require extensive international coordination, and should be part of a broader toolkit—not a mandatory or primary response to cyber-attacks."
    }
}