{
    "question": "Should Aboriginal culture be protected?",
    "content": {
        "source_1": "United Nations General Assembly — United Nations Declaration on the Rights of Indigenous Peoples (UNDRIP), 2007. Articles 11 and 31 affirm Indigenous peoples’ rights to maintain, control, protect, and develop their cultural heritage and oblige states to provide redress for violations, supporting the view that Aboriginal culture requires protection. https://www.un.org/development/desa/indigenouspeoples/declaration-on-the-rights-of-indigenous-peoples.html",
        "source_2": "Parliament of Australia, Joint Standing Committee on Northern Australia — A Way Forward: Final Report into the destruction of Indigenous heritage at Juukan Gorge, 2021. Documents the irreversible loss of 46,000-year-old rock shelters and recommends stronger legal protections, illustrating concrete harms when Aboriginal heritage is not adequately protected. https://www.aph.gov.au/Parliamentary_Business/Committees/Joint/Northern_Australia/JuukanGorge",
        "source_3": "Will Kymlicka — Multicultural Citizenship: A Liberal Theory of Minority Rights, 1995 (Oxford University Press). Argues that protecting minority “societal cultures” is necessary for individuals’ autonomy and equal opportunity, offering a liberal-theory justification for robust cultural protection. https://global.oup.com/academic/product/multicultural-citizenship-9780198290919",
        "source_4": "Michael F. Brown — Who Owns Native Culture?, 2003 (Harvard University Press). Warns that expansive cultural protection regimes can chill scholarship, public discourse, and artistic expression, and risk essentializing living cultures, arguing for more nuanced, context-specific protections. https://www.hup.harvard.edu/books/9780674011712",
        "source_5": "Brian Barry — Culture and Equality: An Egalitarian Critique of Multiculturalism, 2001 (Harvard University Press). Critiques group-differentiated cultural rights on egalitarian grounds, contending that special protections can conflict with equal treatment under general laws and liberal-democratic fairness. https://www.hup.harvard.edu/books/9780674006787",
        "source_6": "ABC News (Australia) — WA government to scrap new Aboriginal cultural heritage laws after backlash, 8 Aug 2023. Reports the repeal of Western Australia’s strengthened heritage law amid opposition from farmers and miners and mixed responses from Aboriginal groups, highlighting practical, political, and economic tensions around the imperative to protect culture. https://www.abc.net.au/news/2023-08-08/wa-government-scraps-aboriginal-cultural-heritage-laws/102700820"
    }
}