{
    "question": "Does Russia have the right to send troops into Crimea?",
    "content": {
        "source_1": "Kremlin appeal to use force in Ukraine — President of Russia (March 1, 2014). Vladimir Putin requested Federation Council authorization to deploy Russian armed forces “on the territory of Ukraine” until the situation normalized, citing a request for assistance from (ousted) President Viktor Yanukovych and the need to protect Russian citizens and the Black Sea Fleet. This presents Russia’s asserted legal basis via “invitation” and protection of nationals.",
        "source_2": "1997 Partition Treaty on the Status and Conditions of the Black Sea Fleet (and 2010 Kharkiv Accords). The basing agreements allowed Russia to station up to 25,000 troops in Crimea but required respect for Ukraine’s sovereignty, Ukrainian law, and coordination with Ukraine for movements outside designated facilities, with no interference in Ukraine’s internal affairs. This undercuts the claim that basing rights conferred a unilateral right to deploy or operate troops across Crimea.",
        "source_3": "UN General Assembly Resolution 68/262, “Territorial integrity of Ukraine” (March 27, 2014). The GA affirmed Ukraine’s internationally recognized borders, deemed the Crimean referendum invalid, and called on states not to recognize any alteration of Crimea’s status. This reflects broad international rejection of a legal right for Russia to send troops into Crimea.",
        "source_4": "Budapest Memorandum on Security Assurances (Dec. 5, 1994). Russia, alongside the U.S. and U.K., pledged to respect Ukraine’s independence and existing borders and to refrain from the threat or use of force against Ukraine. This commitment is widely cited as incompatible with Russia’s deployment of troops in Crimea.",
        "source_5": "President Putin’s Address on Crimea — Kremlin (March 18, 2014). Putin invoked the UN Charter’s self-determination principle, compared Crimea to Kosovo, and referenced the ICJ’s Kosovo advisory opinion to argue the referendum reflected the will of the people and legitimized Russia’s actions. This sets out a pro-Russian legal-political justification tied to self-determination.",
        "source_6": "UN OHCHR, “Report on the human rights situation in Ukraine” (15 April 2014). The UN human rights monitoring mission reported no evidence of widespread or systematic threats to ethnic Russians in Crimea that would justify a protective intervention; it documented intimidation by “self-defense” groups and the presence of unmarked armed personnel. This challenges the humanitarian/protection rationale for sending troops."
    }
}