{
    "question": "Should music that glorifies crime be banned?",
    "content": {
        "source_1": "HM Government — Serious Violence Strategy (2018, UK Home Office): The strategy asserts that some online content, including music videos, can “glamorise gang culture and [be] used to taunt rivals,” and sets out plans to work with platforms to remove such material as part of violence reduction efforts. This is a policy rationale in favor of restricting or banning music that glorifies crime.",
        "source_2": "Anderson, Carnagey, & Eubanks — Exposure to Violent Media: The Effects of Songs with Violent Lyrics on Aggressive Thoughts and Feelings (Journal of Personality and Social Psychology, 2003): Laboratory experiments found that listening to songs with violent lyrics increased aggressive thoughts and hostile feelings in the short term, offering empirical support for the claim that certain music can produce harmful cognitive effects.",
        "source_3": "Brown v. Entertainment Merchants Association, 564 U.S. 786 (U.S. Supreme Court, 2011): The Court struck down a content-based restriction (on violent video games to minors), holding that speech depicting violence is protected; it also found the state’s evidence of harm unconvincing. While not about music specifically, it sets a high constitutional bar against bans on violent/”glorifying” content in the U.S.",
        "source_4": "Nielson & Dennis — Rap on Trial: Race, Lyrics, and Guilt in America (The New Press, 2019): The authors document widespread use of rap lyrics as criminal evidence and argue that policing and censoring “crime-glorifying” music disproportionately targets Black artists and audiences, raising concerns about racial bias and chilling effects on artistic expression.",
        "source_5": "European Court of Human Rights — Handyside v. United Kingdom (App. No. 5493/72, Judgment of 7 Dec 1976): The Court affirmed that freedom of expression protects not only agreeable speech but also that which “offend[s], shock[s] or disturb[s],” cautioning against vague, morality-based bans that risk overreach—relevant to proposals to ban music for “glorifying crime.”",
        "source_6": "Sharman & Dingle — Extreme Metal Music and Anger Processing (PLOS ONE, 2015): Among listeners of aggressive/violent-sounding music, the study found no escalation of anger; instead, such music helped regulate and process anger. This challenges assumptions that consuming “violent” or transgressive music reliably increases harmful behavior."
    }
}