{
    "question": "Is marriage an outdated institution?",
    "content": {
        "source_1": "Pew Research Center (2019) — “Marriage and Cohabitation in the U.S.”: Documents substantial long-term declines in U.S. marriage rates, record-high ages at first marriage, and broad social acceptance of cohabitation and nonmarital childbearing. Evidence often cited to argue marriage is becoming less necessary and thus outdated for many.",
        "source_2": "Holt-Lunstad, Smith, & Layton (2010), PLoS Medicine — Meta-analysis on social relationships and mortality: Finds that stronger social ties are associated with markedly lower mortality risk; marriage is a canonical strong tie in many societies. Used to argue marriage continues to deliver measurable health benefits, challenging the notion that it’s outdated.",
        "source_3": "U.S. Government Accountability Office (2004) — “Defense of Marriage Act: Update to Prior Report”: Identifies 1,138 federal statutory provisions in which marital status affects access to benefits, rights, and responsibilities (taxes, immigration, Social Security, etc.). Supports the view that marriage remains practically relevant because it uniquely unlocks legal and economic protections.",
        "source_4": "World Bank — Women, Business and the Law (2023): The Marriage indicator shows persistent legal inequalities tied to marriage in many economies (e.g., unequal divorce rights, head-of-household rules), and notes that in dozens of countries marital rape is not explicitly criminalized. Cited to argue marriage retains patriarchal legal features and is outdated from a gender-equality perspective.",
        "source_5": "Gallup (2023) — “Same-Sex Marriage Support at New High”: Reports record-high U.S. public support for same-sex marriage, alongside the global trend of more than 30 countries recognizing it. Used to argue the institution is evolving and broadening inclusion rather than becoming obsolete.",
        "source_6": "National Center for Health Statistics, CDC (e.g., “National Marriage and Divorce Rate Trends,” recent updates): Shows U.S. divorce rates have fallen to multi-decade lows and marriages have become more stable among those who marry. Interpreted as evidence that marriage is not collapsing but becoming more selective and durable, countering the “outdated” claim."
    }
}