{
    "question": "Should we encourage increased use of referendums?",
    "content": {
        "source_1": "Frey, Bruno S., and Alois Stutzer (2000). “Happiness, Economy and Institutions.” The Economic Journal. Analysis of Swiss cantons finds higher life satisfaction and trust where direct democracy (including frequent referendums) is stronger, suggesting referendums can enhance legitimacy and citizen well-being.",
        "source_2": "Born, Benjamin; Gernot J. Müller; Moritz Schularick; Petr Sedláček (2019). “The Economic Consequences of the Brexit Referendum.” Economic Policy. Estimates that the Brexit vote led to a significant GDP shortfall relative to a no-Brexit counterfactual, illustrating how single-issue referendums on complex matters can impose large economic and political costs.",
        "source_3": "California Legislative Analyst’s Office (2011). “A Look at Ballot Box Budgeting.” Official report concludes that voter-approved mandates and tax limits via initiatives have created rigidities and volatility in California’s finances, reducing lawmakers’ flexibility and contributing to structural budget challenges.",
        "source_4": "The Economist (2018). “How to do referendums right: lessons from Ireland.” Reviews Ireland’s 2018 abortion referendum preceded by a Citizens’ Assembly and cross-party committee, arguing that embedding deliberation and expert input can improve voter information and confer durable legitimacy on sensitive decisions.",
        "source_5": "OSCE/ODIHR (2017). “Republic of Turkey Constitutional Referendum, 16 April 2017: Final Report.” Finds the vote did not meet international standards due to curtailed fundamental freedoms, media bias, and late procedural changes—evidence that referendums can be used by incumbents to entrench power.",
        "source_6": "Matsusaka, John G. (2004). For the Many or the Few: The Initiative, Public Policy, and American Democracy. University of Chicago Press. Cross-state evidence indicates initiatives and referendums tend to move policy toward majority preferences and check unresponsive legislatures, with modest average fiscal effects."
    }
}