{
    "question": "Is college education worth it?",
    "content": {
        "source_1": "Georgetown University Center on Education and the Workforce (2021), “The College Payoff: More Education Doesn’t Just Get You a Job—It Leads to Better Jobs” — Finds large lifetime earnings gains: median lifetime earnings of bachelor’s degree holders (~$2.8M) far exceed high school graduates (~$1.6M), even after accounting for occupation mix. https://cew.georgetown.edu/cew-reports/the-college-payoff/",
        "source_2": "Federal Reserve Bank of New York (Updated 2023), “The Labor Market for Recent College Graduates” — Shows the college wage premium persists but is uneven: recent grads face about 41% underemployment, and returns vary widely by major and field, implying college can be a risky bet depending on choice and timing. https://www.newyorkfed.org/research/college-labor-market",
        "source_3": "Brookings Institution (Looney & Yannelis, 2015/2018 updates), “A crisis in student loans? How changes in the characteristics of borrowers and in the institutions they attend contributed to rising loan defaults” — Documents that defaults are concentrated among non-completers and for-profit attendees; many defaulters owe relatively small balances, indicating college is often not “worth it” when students don’t finish. https://www.brookings.edu/articles/a-crisis-in-student-loans/",
        "source_4": "Oreopoulos & Salvanes (2011), Journal of Economic Perspectives, “Priceless? The Nonpecuniary Benefits of Schooling” — Reviews evidence that education yields substantial non-monetary benefits (better health, longer life, higher civic engagement, lower crime), suggesting “worth” can extend beyond earnings. https://www.aeaweb.org/articles?id=10.1257/jep.25.1.159",
        "source_5": "Bryan Caplan (2018), The Case Against Education — Argues much of the observed return to college is signaling rather than skill acquisition (e.g., strong “sheepskin effects”), implying private gains may not reflect social value and that the investment is over-rated for many. https://press.princeton.edu/books/hardcover/9780691174655/the-case-against-education",
        "source_6": "U.S. Department of Labor, Apprenticeship.gov (accessed 2024) — Reports that 91% of apprenticeship completers are employed with average starting salaries around $77,000 and little to no debt, presenting a non-degree pathway that can rival or exceed ROI for many occupations. https://www.apprenticeship.gov/benefits/apprenticeship-job-seekers"
    }
}