{
    "question": "Should the media be forced to display, promote, and report women’s sports equally to men’s sports?",
    "content": {
        "source_1": "NPR — “Study: Women’s sports coverage on TV hasn’t increased much in 30 years” (June 21, 2021). Summarizes a 30-year USC/Purdue study finding women’s sports received just 5.4% of TV news and highlight show coverage in 2019, little changed since 1989—evidence that voluntary industry practices have not delivered parity. https://www.npr.org/2021/06/21/1009026701/study-womens-sports-coverage-on-tv-all-but-evaporates-even-as-fans-grow",
        "source_2": "U.S. Supreme Court — Miami Herald Publishing Co. v. Tornillo, 418 U.S. 241 (1974). The Court struck down a law compelling newspapers to publish replies, holding that government cannot mandate editorial content—raising constitutional barriers to “forcing” equal sports coverage in U.S. media. https://supreme.justia.com/cases/federal/us/418/241/",
        "source_3": "Sports Media Watch — “WNBA posts best regular-season viewership since 2008” (Sept. 2023) and “NBA regular season hits five-year high” (Apr. 2023). WNBA national telecasts averaged ~505,000 viewers in 2023, while NBA games averaged ~1.59 million—data used by opponents to argue equal coverage mandates could conflict with current audience demand and ad-revenue realities. https://www.sportsmediawatch.com/2023/09/wnba-regular-season-viewership-ratings-espn-abc-cbs/ | https://www.sportsmediawatch.com/2023/04/nba-regular-season-ratings-espn-tnt-abc-five-year-high/",
        "source_4": "Deloitte TMT Predictions 2024 — “Women’s sports to generate more than $1 billion in revenue in 2024” (Dec. 2023). Projects women’s sports revenues surpassing $1B with faster growth rates than many men’s properties, and strong sponsorship ROI—evidence that greater investment and promotion can be commercially viable. https://www2.deloitte.com/global/en/insights/industry/technology/technology-media-and-telecom-predictions/2024/womens-sports-revenue.html",
        "source_5": "Australian Government — Anti‑siphoning framework (2023–2024). Policy to keep nationally significant events, including major women’s sports, available free-to-air; illustrates a regulatory path that boosts visibility without imposing strict equal-coverage quotas. https://www.infrastructure.gov.au/media-communications-arts/media/broadcasting/anti-siphoning",
        "source_6": "ESPN Press Room — “Most-watched NCAA Women’s Basketball game ever” (Apr. 9, 2024). The 2024 women’s national championship averaged 18.7 million viewers (peaking at 24M), outdrawing every men’s college game since 2019—evidence that when given prime placement and promotion, women’s sports can deliver mass audiences. https://espnpressroom.com/us/press-releases/2024/04/most-watched-ncaa-womens-basketball-game-ever/"
    }
}