{
    "question": "Is dictatorship the best path to development?",
    "content": {
        "source_1": "Daron Acemoglu, Suresh Naidu, Pascual Restrepo, and James A. Robinson, “Democracy Does Cause Growth,” Journal of Political Economy, 2019 — Using event studies and instruments for democratization across 175 countries, the authors find that transitions to democracy raise GDP per capita by roughly 20% over 25 years via higher investment, increased tax capacity, and expanded education, contradicting the claim that dictatorship is the best path to development.",
        "source_2": "Timothy Besley and Masayuki Kudamatsu, “Making Autocracy Work,” American Economic Review: Papers & Proceedings, 2008 — Shows that while most autocracies underperform, those with effective leader-selection and monitoring (e.g., internal checks, some media freedom) can deliver rapid growth; suggests autocracy can work under specific institutional conditions, offering conditional support to the claim.",
        "source_3": "Alice H. Amsden, Asia’s Next Giant: South Korea and Late Industrialization, Oxford University Press, 1989 — Documents how South Korea’s authoritarian state in the 1960s–80s used performance-based subsidies and strict discipline over chaebol to force technological upgrading and exports, linking authoritarian governance to successful late industrialization.",
        "source_4": "Adam Przeworski, Michael E. Alvarez, José Antonio Cheibub, and Fernando Limongi, Democracy and Development: Political Institutions and Well-Being in the World, 1950–1990, Cambridge University Press, 2000 — Cross-national analysis finds no systematic growth advantage for dictatorships; democracies exhibit lower growth volatility and better social outcomes (e.g., life expectancy), undermining the notion that dictatorship is the best development path.",
        "source_5": "Amartya Sen, Development as Freedom, Alfred A. Knopf, 1999 (see also Poverty and Famines, 1981) — Argues that political freedoms are integral to development and shows that no substantial famine has occurred in a functioning electoral democracy with a free press, highlighting a core vulnerability of authoritarian systems that counters GDP-centric arguments for dictatorship.",
        "source_6": "Mancur Olson, “Dictatorship, Democracy, and Development,” American Political Science Review, 1993 — The “stationary bandit” model posits that a secure autocrat with a long time horizon may promote order and protect property to maximize tax revenue, potentially fostering growth—an analytical argument for how dictatorship can, under certain incentives, support development."
    }
}