{
    "question": "Should we show more compassion to drug addicts?",
    "content": {
        "source_1": "Medications for Opioid Use Disorder Are Effective and Underutilized — National Academies of Sciences, Engineering, and Medicine (2019): Reviews extensive clinical evidence showing that compassion-centered, medical treatment (e.g., methadone, buprenorphine) cuts overdose death risk and improves retention in care; identifies stigma and punitive attitudes as barriers that reduce treatment uptake.",
        "source_2": "Supervised Consumption Site Outcomes in Vancouver — Peer-reviewed study (The Lancet, 2011): Finds a significant drop in overdose deaths near the site and increased referrals to detox/treatment after opening a supervised injection facility, with no measured increase in neighborhood crime, supporting harm-reduction framed as compassion in practice.",
        "source_3": "Portugal’s Decriminalization: Public Health Indicators — European Monitoring Centre for Drugs and Drug Addiction reviews (2000s–2010s): Reports declines in HIV transmission among people who use drugs and improvements in treatment access after decriminalization paired with services; suggests that shifting from punishment to health-oriented, compassionate responses can yield population-level benefits.",
        "source_4": "Oregon Measure 110 Implementation Audit — Oregon Secretary of State (2023): Documents slow rollout, weak accountability, and limited early evidence of treatment engagement following decriminalization; coincided with rising overdose deaths and public disorder complaints, used by critics to argue that “compassion without capacity or consequences” can backfire.",
        "source_5": "Commercial Corridor Safety Surveys — Urban business associations in West Coast cities (2022–2024): Member surveys and incident logs attribute increased shoplifting, vandalism, and open-air drug use to lenient, compassion-first policies; argue that community compassion must be balanced with enforcement to protect workers and customers.",
        "source_6": "Moral Hazard and Incentives in Drug Policy — Economist commentary (policy journal, 2020s): Posits that expanding low-barrier services without clear expectations can unintentionally reduce the perceived costs of continued use, potentially increasing prevalence; recommends “compassion with contingencies” (e.g., drug courts, mandated treatment, contingency management) to align support with behavior change."
    }
}