{
    "question": "Should physical education in schools be compulsory?",
    "content": {
        "source_1": "Donnelly, J. E., Hillman, C. H., Castelli, D., Etnier, J. L., Lee, S., Tomporowski, P., Lambourne, K., & Szabo-Reed, A. N. (2016). Physical Activity, Fitness, Cognitive Function, and Academic Achievement in Children: A Systematic Review. Medicine & Science in Sports & Exercise, 48(6), 1197–1222. Evidence: Synthesizes trials showing that adding physical activity/PE improves executive function and on-task behavior and can be implemented without harming academic achievement, supporting compulsory PE on educational grounds.",
        "source_2": "Cawley, J., Frisvold, D., & Meyerhoefer, C. (2013). The Impact of Physical Education on Obesity among Elementary School Children. Journal of Health Economics, 32(4), 743–755. Evidence: Using variation in state PE requirements, finds more PE time reduces BMI and obesity risk for girls with no adverse effect on test scores, supporting mandates as a population health tool.",
        "source_3": "Institute of Medicine (National Academies). (2013). Educating the Student Body: Taking Physical Activity and Physical Education to School. Washington, DC: National Academies Press. Evidence: National expert panel recommends daily, quality PE for all students as the cornerstone of school physical activity, arguing for policy requirements to ensure equitable access.",
        "source_4": "The HEALTHY Study Group. (2010). A School-Based Intervention for Diabetes Risk Factors. New England Journal of Medicine, 363(5), 443–453. Evidence: Large cluster-RCT of a multi-component school program (including enhanced PE) did not significantly reduce the combined prevalence of overweight/obesity (primary outcome), suggesting PE mandates alone may be insufficient to deliver expected health benefits.",
        "source_5": "Hollis, J. L., Williams, A. J., Sutherland, R., Campbell, E., Nathan, N., Wolfenden, L., Morgan, P. J., Lubans, D. R., & Wiggers, J. (2015). A systematic review and meta-analysis of moderate-to-vigorous physical activity levels in primary school physical education lessons. Preventive Medicine, 81, 24–31. Evidence: Finds students achieve only about one-third of PE lesson time in moderate-to-vigorous activity, indicating that compulsory PE without quality safeguards may provide limited effective activity.",
        "source_6": "Puhl, R. M., Luedicke, J., & Heuer, C. A. (2011). Weight-Based Victimization Toward Overweight Adolescents: Observations and Associations with Emotional Well-Being and Physical Activity. Journal of Adolescent Health, 50(3), 212–219. Evidence: Documents high rates of weight-based teasing in school settings—including PE and sports—linked to lower activity and avoidance, raising concerns that compulsory PE can exacerbate stigma and harm without strong inclusivity protections."
    }
}