{
    "question": "Should gay couples be allowed to marry?",
    "content": {
        "source_1": "Obergefell v. Hodges, 576 U.S. 644 (2015) — U.S. Supreme Court held that same-sex couples have a fundamental right to marry under the Due Process and Equal Protection Clauses, emphasizing individual dignity and equal legal status in civil marriage. https://www.supremecourt.gov/opinions/14pdf/14-556_3204.pdf",
        "source_2": "American Academy of Pediatrics, “Promoting the Well-Being of Children Whose Parents Are Gay or Lesbian,” Pediatrics, 2013 — Policy statement concludes children raised by same-sex parents fare as well as those raised by different-sex parents and that allowing civil marriage promotes family stability beneficial to children. https://doi.org/10.1542/peds.2013-0375",
        "source_3": "Raifman et al., “Association of State Same-Sex Marriage Policies With Adolescent Suicide Attempts,” JAMA Pediatrics, 2017 — Observational study finds a 7% reduction in suicide attempts among high school students (14% among LGB youth) following legalization of same-sex marriage, suggesting population mental-health benefits. https://jamanetwork.com/journals/jamapediatrics/fullarticle/2604258",
        "source_4": "Congregation for the Doctrine of the Faith (Vatican), “Considerations Regarding Proposals to Give Legal Recognition to Unions Between Homosexual Persons,” 2003 — Theological and moral argument opposing legal recognition of same-sex unions, asserting marriage is intrinsically oriented to procreation and that recognizing same-sex marriage would redefine and diminish the traditional institution. https://www.vatican.va/roman_curia/congregations/cfaith/documents/rc_con_cfaith_doc_20030731_homosexual-unions_en.html",
        "source_5": "Sherif Girgis, Ryan T. Anderson, and Robert P. George, “What Is Marriage? Man and Woman: A Defense,” Harvard Journal of Law & Public Policy, 2010 — Philosophical and legal case for a “conjugal” view of marriage tied to procreation and complementarity, arguing the state’s interest is uniquely served by man–woman unions and that redefining marriage to include same-sex couples changes the institution’s purpose. https://papers.ssrn.com/sol3/papers.cfm?abstract_id=1722155",
        "source_6": "European Court of Human Rights, Schalk and Kopf v. Austria, no. 30141/04 (2010) — The Court ruled the European Convention on Human Rights does not impose an obligation on states to grant same-sex marriage, leaving recognition largely to national discretion (margin of appreciation). https://hudoc.echr.coe.int/eng?i=001-99605"
    }
}