{
    "question": "Does money undermine sport’s values?",
    "content": {
        "source_1": "U.S. Department of Justice — 2015 FIFA corruption indictments: Prosecutors detailed systemic bribery in awarding media/marketing rights and influence over World Cup hosting decisions, showing how large financial incentives corrupted governance and undermined sporting integrity.",
        "source_2": "U.S. Anti-Doping Agency — 2012 Reasoned Decision on Lance Armstrong: The dossier documents an orchestrated doping scheme sustained by competitive pressures and lucrative sponsorships/prize money, illustrating how financial rewards can incentivize cheating and erode fair play.",
        "source_3": "Amnesty International — Analyses of “sportswashing” (e.g., Saudi Public Investment Fund’s backing of LIV Golf and purchase of Newcastle United): Argues that massive state-backed spending uses sport to launder reputations and blunt human-rights scrutiny, conflicting with sport’s ethical values.",
        "source_4": "World Anti-Doping Agency/International Testing Agency and major league officiating tech: Commercial revenues have financed stronger integrity systems (independent testing, biological passports) and technologies like goal-line tech and VAR, which governing bodies credit with fewer officiating errors — evidence that money can reinforce fairness rather than undermine it.",
        "source_5": "U.S. Soccer Federation 2022 equal-pay CBAs and FIFA’s increased Women’s World Cup prize pool: Heightened commercial revenues and sponsor pressure were leveraged to advance pay equity and investment in women’s sport, aligning money with values of fairness and inclusion.",
        "source_6": "UEFA’s HatTrick development programme and domestic solidarity mechanisms: Tournament and broadcast revenues are redistributed to fund grassroots facilities, youth academies, and community programs, indicating that, when governed well, money can broaden access and support sport’s social values."
    }
}