{
    "question": "Should all collective bargaining rights claimed by trades unions be abolished?",
    "content": {
        "source_1": "Lovenheim, Michael F., and Alexander Willén. “The Long-Run Effects of Teacher Collective Bargaining.” NBER Working Paper No. 22052, 2016. https://www.nber.org/papers/w22052 - Evidence: Using a difference-in-differences design exploiting timing of state teacher-CB laws, the authors find exposure to teacher collective bargaining lowers male students’ long-run earnings and employment. This supports arguments that collective bargaining can impose costs on human capital formation and labor-market outcomes.",
        "source_2": "OECD. “Negotiating Our Way Up: Collective Bargaining in a Changing World of Work.” 2019. https://www.oecd.org/employment/negotiating-our-way-up-1fd2da34-en.htm - Evidence: Cross-country analysis concludes that well-designed and coordinated sectoral bargaining can support higher employment, productivity, and inclusiveness, and help adapt to technological change. This cautions against abolishing CB outright, emphasizing institutional design over elimination.",
        "source_3": "Jaumotte, Florence, and Carolina Osorio Buitron. “Inequality and Labor Market Institutions.” IMF Staff Discussion Note SDN/15/14, 2015. https://www.imf.org/en/Publications/Staff-Discussion-Notes/Issues/2016/12/31/Inequality-and-Labor-Market-Institutions-42952 - Evidence: The IMF links declining unionization to rising top-income shares and overall inequality in advanced economies, with little robust evidence that stronger unions raise unemployment. This underscores distributive costs of dismantling collective bargaining.",
        "source_4": "DiSalvo, Daniel. “Government Unions and the Cost of Government.” Manhattan Institute, 2010. https://www.manhattan-institute.org/html/government-unions-and-cost-government-5815.html - Evidence: Argues public-sector collective bargaining inflates compensation costs and constrains managerial flexibility, with knock-on effects for budgets and democratic accountability. This perspective favors curtailing or abolishing CB in the public sector to improve fiscal discipline.",
        "source_5": "International Labour Organization. “Global Wage Report 2022–23: The impact of inflation and COVID-19 on wages and purchasing power.” 2022. https://www.ilo.org/global/publications/books/WCMS_862569/lang--en/index.htm - Evidence: The ILO reports that collective agreements helped buffer real wages during recent inflationary and pandemic shocks, particularly for lower-paid workers. This suggests abolishing CB would weaken workers’ protection in downturns and high-inflation episodes.",
        "source_6": "UK Office for National Statistics. “Labour disputes: Working days lost.” Time series dataset. https://www.ons.gov.uk/employmentandlabourmarket/peopleinwork/workplacedisputesandworkingconditions/datasets/labourdisputesworkingdayslost - Evidence: UK strike data show working days lost dropped dramatically after the 1980s curbs on union powers and bargaining practices (from tens of millions in 1979 to typically under one million in later decades). This is used to argue that restricting CB can promote industrial peace and economic stability."
    }
}