{
    "question": "Is socialism dead?",
    "content": {
        "source_1": "János Kornai, The Socialist System: The Political Economy of Communism (Princeton University Press, 1992) — Analyzes the inherent incentive and coordination problems of classical socialist economies and uses the 1989–91 collapse of the Soviet/Eastern European systems and subsequent market transitions as evidence that socialism, as a comprehensive economic system, failed and was largely abandoned.",
        "source_2": "Francis Fukuyama, “The End of History?” (The National Interest, 1989) — Argues that liberal democracy and market capitalism achieved ideological supremacy after the Cold War, implying the exhaustion of socialism as a viable rival doctrine on the world stage.",
        "source_3": "Barry Naughton, The Chinese Economy: Adaptation and Growth, 2nd ed. (MIT Press, 2018) — Documents the continued centrality of the Chinese Communist Party, extensive state ownership, and industrial policy in China’s “socialism with Chinese characteristics,” indicating that significant socialist institutions persist and remain influential in a leading global economy.",
        "source_4": "Gallup, “Democrats More Positive About Socialism Than Capitalism” (Aug. 13, 2018) — U.S. public opinion data showing a majority of Democrats viewed “socialism” positively at the time, suggesting the term and its associated ideas retain appeal and are not “dead” in the realm of political attitudes.",
        "source_5": "Lane Kenworthy, Social Democratic Capitalism (Oxford University Press, 2020) — Presents comparative evidence that Nordic-style social-democratic institutions—high taxation, universal welfare, robust public services—deliver strong outcomes and continue to expand in some domains, implying that socialist-inspired policy frameworks remain viable.",
        "source_6": "Javier Corrales and Michael Penfold, Dragon in the Tropics: Hugo Chávez and the Political Economy of Revolution, 2nd ed. (Brookings Institution Press, 2015) — Examines Venezuela’s “twenty-first-century socialism,” detailing policy distortions and institutional erosion that preceded severe economic collapse, a case critics use to argue socialism is unworkable in practice and thus “dead.”"
    }
}