{
    "question": "Is it time to stop buying bottled water?",
    "content": {
        "source_1": "United Nations University Institute for Water, Environment and Health (UNU-INWEH) — “Global Bottled Water Industry: A Review of Impacts and Trends” (2023). Finds the rapid growth of bottled water (hundreds of billions in annual sales) generates substantial plastic waste, stresses local water sources, and risks diverting attention and investment away from universal access to safe, affordable public tap water (SDG 6).",
        "source_2": "Gleick, P. H., & Cooley, H. — “Energy implications of bottled water” (Environmental Research Letters, 2009). Life-cycle analysis shows bottled water can require up to thousands of times more energy than delivering tap water, largely due to packaging (PET production) and transportation, implying a far higher climate footprint per liter than municipal supplies.",
        "source_3": "Qian et al. — “Detection of nanoplastics in bottled water by stimulated Raman scattering microscopy” (PNAS, 2024). Using advanced imaging, the study reports hundreds of thousands of plastic particles per liter in sampled bottled waters—most of them nanoplastics—raising unresolved health questions and indicating bottled water can contain more micro/nanoplastics than tap.",
        "source_4": "International Bottled Water Association (IBWA) — Industry statements and fact sheets (ongoing). Argues bottled water is a safe, convenient, zero-calorie beverage regulated by the FDA, with a lower environmental footprint than other packaged drinks; emphasizes consumer preference and role in helping people shift away from sugary beverages.",
        "source_5": "U.S. Centers for Disease Control and Prevention (CDC) — Emergency water storage and safety guidance (updated regularly). Recommends using and storing bottled water for disasters and contamination events (e.g., at least one gallon per person per day), underscoring that bottled water is essential for resilience where tap systems are disrupted or unsafe.",
        "source_6": "Food & Water Watch — “Take Back the Tap” reports (e.g., 2018 and updates). Documents that bottled water can cost hundreds to thousands of times more per gallon than tap and that a large share of bottled water is sourced from municipal supplies, suggesting consumers often pay a steep premium for repackaged tap water rather than added safety."
    }
}