{
    "question": "Should forced marriage be banned?",
    "content": {
        "source_1": "United Nations — Universal Declaration of Human Rights, Article 16 (1948): States that marriage shall be entered into only with the free and full consent of the intending spouses, framing forced marriage as a violation of a fundamental human right and supporting legal bans.",
        "source_2": "World Health Organization — Adolescent pregnancy/violence against women fact sheets: Notes that complications from pregnancy and childbirth are a leading cause of death among girls aged 15–19 globally and that early/forced unions increase risks of early pregnancy, intimate partner violence, and poor mental health—evidence that forced marriage causes serious, preventable harm.",
        "source_3": "UK Home Office & Foreign, Commonwealth & Development Office — Forced Marriage Unit (FMU) annual reports and legal framework: England and Wales criminalized forced marriage in 2014 and use Forced Marriage Protection Orders to prevent it; the FMU continues to support hundreds to over a thousand suspected cases annually, indicating both the need for and the practical tools of a legal ban.",
        "source_4": "Southall Black Sisters (UK NGO) — Position statements on criminalization: Argues that making forced marriage a criminal offense can drive the practice underground and deter victims who fear prosecuting family members; recommends prioritizing robust civil protection orders and specialist support services alongside or instead of criminal penalties.",
        "source_5": "UK Government — Statutory Guidance “The Right to Choose” (Forced Marriage): Distinguishes clearly between arranged marriage (lawful when genuinely consensual) and forced marriage (illegal where coercion is used), cautioning that poorly drafted bans risk stigmatizing consensual cultural practices; supports narrowly tailored prohibitions focused on coercion.",
        "source_6": "Population Council — Evaluation of the Berhane Hewan program (Amhara, Ethiopia): Finds that multi-component community interventions (girls’ schooling support, community dialogues, conditional incentives) significantly delayed age at marriage and increased school attendance, suggesting that bans alone are insufficient and that prevention programs can effectively reduce forced/child marriage."
    }
}