{
    "question": "Should we cut the length of copyright protection?",
    "content": {
        "source_1": "Paul J. Heald (2014), “How Copyright Keeps Works Disappeared,” Journal of Empirical Legal Studies 11(4): 829–866. Using large-scale availability data, Heald shows a pronounced “missing works” trough for mid‑20th‑century books still under copyright, while pre‑1923 public-domain books are more available from publishers and retailers. This suggests long copyright terms reduce access and commercial availability, supporting shorter terms.",
        "source_2": "Rufus Pollock (2009), “Forever Minus a Day? Calculating Optimal Copyright Term,” University of Cambridge Working Paper. Calibrating a welfare model of incentives versus access, Pollock estimates the optimal copyright term is on the order of 14–38 years (often near the lower end), far shorter than life-plus-70. This provides an economic case for cutting terms to improve overall welfare.",
        "source_3": "Joel Waldfogel (2011), “Bye, Bye, Miss American Pie? The Supply of New Recorded Music since Napster,” NBER Working Paper No. 16882. Examining releases, quality proxies, and variety post‑Napster, Waldfogel finds music creation did not collapse and in some respects increased despite weaker effective protection from piracy, implying that very long exclusive terms may not be necessary to sustain creation.",
        "source_4": "Brief of Amici Curiae Economists in Support of Petitioners, Eldred v. Ashcroft, No. 01‑618 (U.S. 2002) (Arrow, Becker, Coase, Akerlof, et al.). The economists argue that retroactive term extensions (like the CTEA’s move to life+70) create no new works and impose deadweight losses and transaction costs, indicating that long or extended terms can be socially costly without adding incentive—supporting shorter or at least non‑extended terms.",
        "source_5": "IFPI (2016), “Investing in Music: How Music Companies Discover, Develop and Promote Talent.” The industry reports substantial upfront A&R and marketing investments (often $0.5–$2 million to break a new artist; labels reinvest a large share of revenues), and argues strong and long copyright protection is needed to recoup over long horizons—opposing cuts to term length.",
        "source_6": "Berne Convention for the Protection of Literary and Artistic Works, Article 7; TRIPS Agreement Article 9 (incorporating Berne). International rules set a minimum copyright term of life of the author plus 50 years for most works. Cutting terms below this floor would breach treaty obligations, constraining how far countries can shorten protection even if they wish to—an institutional counterpoint to proposals to reduce terms."
    }
}