{
    "question": "Should airbrushing of women’s bodies in the media be banned?",
    "content": {
        "source_1": "Grabe, Ward, and Hyde (2008). The role of the media in body image concerns among women: A meta-analysis of experimental and correlational studies. Psychological Bulletin. Meta-analysis finds exposure to idealized media images is associated with increased body dissatisfaction and internalization of thin ideals among women—evidence often cited to justify strong restrictions (including bans) on digitally altered, unrealistic portrayals.",
        "source_2": "Ferguson (2013). In the eye of the beholder: Thin-ideal media effects on body dissatisfaction and eating disturbance are moderated by preexisting risk. Journal of Social and Clinical Psychology. Reports that harmful effects of thin-ideal media are small on average and largely concentrated among individuals already at risk, suggesting a blanket ban may be overbroad relative to targeted education or support.",
        "source_3": "Central Hudson Gas & Electric Corp. v. Public Service Commission, 447 U.S. 557 (1980). U.S. Supreme Court case establishing the test for restricting commercial speech. A sweeping ban on airbrushing would likely face serious First Amendment hurdles in the U.S. as a content-based restriction on truthful, non-misleading advertising, indicating legal infeasibility of a blanket prohibition.",
        "source_4": "BBC News (2017, Oct 1). France makes it compulsory to label retouched photos of models. Reports on France’s law requiring “photographie retouchée” labels when body shape is digitally altered in commercial images—an example of a regulatory alternative to an outright ban that aims to reduce harm through transparency rather than prohibition.",
        "source_5": "Farid, H. (2016). Photo Forensics. MIT Press. Explains the technical difficulty of reliably detecting digital alterations and distinguishing benign edits from manipulative body morphing, highlighting enforceability problems and compliance costs that a comprehensive ban on airbrushing would create.",
        "source_6": "Business Insider (2016). Aerie’s no-Photoshop policy is boosting sales. Coverage of American Eagle’s Aerie brand reporting strong sales growth after adopting a no-retouching policy (“Aerie Real”), suggesting market-driven, voluntary standards can reduce harmful editing practices without government bans."
    }
}