{
    "question": "Should the sale of 3D printers to households be banned?",
    "content": {
        "source_1": "Fact Sheet: The Biden Administration Takes Action to Stop the Proliferation of Ghost Guns (White House, 2022) — Law enforcement recovered approximately 20,000 suspected “ghost guns” in 2021, a ten-fold increase since 2016; policymakers link some of this rise to easier access to home fabrication tools, including 3D printing, to argue for stronger restrictions. https://www.whitehouse.gov/briefing-room/statements-releases/2022/04/11/fact-sheet-the-biden-administration-takes-action-to-stop-the-proliferation-of-ghost-guns/",
        "source_2": "Azimi, P., et al. (2016). Emissions of Ultrafine Particles and Volatile Organic Compounds from Commercially Available Desktop Three-Dimensional Printers (Environmental Science & Technology) — Desktop FFF/FDM printers emit ultrafine particles and VOCs (e.g., styrene, caprolactam); without proper ventilation, indoor concentrations can reach levels of concern, raising household health and safety issues used to justify restrictions. https://pubs.acs.org/doi/10.1021/acs.est.5b04983",
        "source_3": "The Next Production Revolution: Implications for Governments and Business (OECD, 2017) — OECD finds additive manufacturing democratizes innovation, supports SMEs, and builds workforce skills; blanket bans on consumer access would impede diffusion of beneficial technologies and slow productivity and entrepreneurship. https://www.oecd.org/publications/the-next-production-revolution-9789264271036-en.htm",
        "source_4": "Choong, Y.Y.C., et al. (2020). The Roles of 3D Printing in the COVID-19 Pandemic (3D Printing and Additive Manufacturing) — During acute PPE shortages, decentralized 3D printing—including by hobbyists and home users—rapidly produced face shields and medical accessories, demonstrating public-interest benefits that a household sales ban would undercut. https://www.liebertpub.com/doi/10.1089/3dp.2020.0123",
        "source_5": "Weinberg, M. (2010). It Will Be Awesome If They Don’t Screw It Up: 3D Printing, Intellectual Property, and the Fight Over the Next Great Disruptive Technology (Public Knowledge) — Argues against preemptive regulation of 3D printers; contends tool bans are overbroad and ineffective compared to targeted enforcement (e.g., against unlawful uses), warning of stifled innovation and speech concerns. https://www.publicknowledge.org/files/docs/It_Will_Be_Awesome_if_They_Dont_Screw_it_Up_v3.pdf",
        "source_6": "Bowyer, A., et al. (2011). RepRap—The Replicating Rapid Prototyper (Rapid Prototyping Journal) — Documents open-source, self-replicating 3D printers built from off-the-shelf parts; highlights that even if retail sales to households were banned, individuals could still assemble printers, undermining the effectiveness of such a prohibition. https://www.emerald.com/insight/content/doi/10.1108/13552541111156476/full/html"
    }
}