{
    "question": "Is cramming before exams a bad idea?",
    "content": {
        "source_1": "Rohrer, D., & Pashler, H. (2007). Increasing retention without increasing study time. Current Directions in Psychological Science, 16(4), 183–186. Review shows distributed (spaced) practice reliably outperforms massed practice (cramming) for long-term retention, indicating cramming leads to faster forgetting even when total study time is equal.",
        "source_2": "Pilcher, J. J., & Huffcutt, A. I. (1996). Effects of sleep deprivation on performance: A meta-analysis. Sleep, 19(4), 318–326. Meta-analysis finds sleep loss significantly impairs attention, working memory, and higher-order cognition; pulling late-night cram sessions that cut sleep is linked to worse next-day performance.",
        "source_3": "Lupien, S. J., McEwen, B. S., Gunnar, M. R., & Heim, C. (2009). Effects of stress throughout the lifespan on the brain, behaviour and cognition. Nature Reviews Neuroscience, 10(6), 434–445. Review documents that acute stress and elevated cortisol impair memory retrieval and prefrontal functions; last-minute cramming can elevate stress and thereby hinder exam performance.",
        "source_4": "Cepeda, N. J., Vul, E., Rohrer, D., Wixted, J. T., & Pashler, H. (2008). Spacing effects in learning: A temporal ridgeline of optimal retention. Psychological Science, 19(11), 1095–1102. Experiments show the optimal spacing depends on the delay to the test; when the test is very soon, minimal spacing is near-optimal—implying cramming can be effective for next-day assessments.",
        "source_5": "Soderstrom, N. C., & Bjork, R. A. (2015). Learning versus performance: An integrative review. Perspectives on Psychological Science, 10(2), 176–199. Distinguishes short-term performance from durable learning; massed practice can boost immediate test scores (a reason cramming sometimes “works”) but yields poor long-term retention.",
        "source_6": "Hartwig, M. K., & Dunlosky, J. (2012). Study strategies of college students: Are self-testing and scheduling related to achievement? Psychonomic Bulletin & Review, 19(1), 126–134. Field data show students who use spacing and self-testing tend to have higher grades, whereas reliance on last-minute studying is associated with lower achievement, supporting the view that cramming is generally disadvantageous."
    }
}