{
    "question": "Should state funding to universities be conditioned upon all academic work being made available to the general public?",
    "content": {
        "source_1": "White House Office of Science and Technology Policy (2022). Ensuring Free, Immediate, and Equitable Access to Federally Funded Research. https://www.whitehouse.gov/ostp/news-updates/2022/08/25/ostp-issues-guidance-to-make-federally-funded-research-freely-available-without-delay/ - Perspective: Supportive precedent. Directs U.S. federal agencies to require immediate public access to publications and supporting data from federally funded research by 2025, arguing taxpayers deserve access and that openness accelerates discovery—evidence that tying public funding to public access is feasible and already underway for a large share of university research.",
        "source_2": "Piwowar, H. et al. (2018). The State of OA: A large-scale analysis of the prevalence and impact of Open Access articles. PeerJ, 6:e4375. https://peerj.com/articles/4375/ - Perspective: Empirical benefit. Finds open-access articles receive a citation advantage (estimated ~18% overall), suggesting that requiring public availability of academic work can measurably increase scholarly impact and public uptake, strengthening the case for access conditions on state funding.",
        "source_3": "World Intellectual Property Organization (WIPO). Patent FAQs—Novelty and public disclosure. https://www.wipo.int/patents/en/faq_patents.html#novelty - Perspective: Commercialization risk. Explains that public disclosure before filing can destroy novelty in many jurisdictions, jeopardizing patents and downstream technology transfer. A blanket requirement that all state-funded academic work be immediately public could undermine commercialization of university inventions and regional economic development.",
        "source_4": "UK Research and Innovation (2021). UKRI Open Access Policy. https://www.ukri.org/publications/ukri-open-access-policy/ - Perspective: Practical carve-outs for books. While mandating OA for journal articles, UKRI allows embargoes and exceptions for monographs/long-form outputs due to rights and cost complexities. This policy architecture implies that “all academic work” mandates need nuanced exceptions; a rigid condition on all outputs may be unworkable, especially in the humanities.",
        "source_5": "UNESCO (2021). Recommendation on Open Science. https://en.unesco.org/science-sustainable-future/open-science/recommendation - Perspective: Equity caution. Endorses open access but warns that APC-based models can exacerbate inequalities and that open science policies must avoid creating new barriers for underfunded researchers and institutions. Conditioning state funds on openness without addressing publication-cost inequities risks unfairly penalizing some scholars and universities.",
        "source_6": "U.S. National Institutes of Health (2023). NIH Data Management and Sharing Policy. https://sharing.nih.gov/data-management-and-sharing-policy/about-data-management-and-sharing-policy - Perspective: Privacy and ethics constraints. Requires data sharing for funded research but explicitly allows limitations to protect privacy, confidentiality, and proprietary interests. This evidences that “all academic work” cannot always be made fully public; ethical and legal constraints necessitate exceptions in any funding condition."
    }
}