{
    "question": "Should everyone be automatically opted into an organ donation scheme?",
    "content": {
        "source_1": "Abadie, A., & Gay, S. (2006). The impact of presumed consent legislation on cadaveric organ donation: A cross-country study. Journal of Health Economics, 25(4), 599–620. — Econometric analysis across multiple countries found presumed-consent (opt-out) laws are associated with roughly 25–30% higher cadaveric donation rates, supporting automatic opt-in.",
        "source_2": "Fabre, J. W. (2010). Presumed consent for organ donation: A distraction in the quest for increasing donation? BMJ, 340:c2188. — Argues Spain’s world-leading results stem from hospital-based coordination, ICU capacity, and trained requestors, concluding that changing consent law alone is neither necessary nor sufficient to raise donations.",
        "source_3": "NHS Blood and Transplant. Organ Donation and Transplantation Activity Report 2022/23 (UK). — Reports that family authorization remains a major determinant of whether donation proceeds (with significant variation by community), highlighting that opt-out frameworks do not eliminate family vetoes or the need for consent-sensitive practice.",
        "source_4": "European Court of Human Rights. Elberte v. Latvia (Application no. 61243/08), Judgment of 13 January 2015. — The Court held that tissue removal under a presumed-consent regime without ensuring relatives were properly informed violated Article 8 (private and family life), underscoring human-rights risks if automatic opt-in lacks robust safeguards and transparency.",
        "source_5": "Zúñiga-Fajuri, A. (2015). Increasing organ donation by presumed consent and allocation priority: Chile. Bulletin of the World Health Organization, 93, 199–202. — Chile’s 2010 switch to opt-out initially led to fewer donations amid public mistrust and mass opt-outs; later reforms (including priority for registered donors) were needed to recover donation rates, warning that automatic opt-in can backfire without trust-building policies.",
        "source_6": "Nuffield Council on Bioethics (2011). Human bodies: Donation for medicine and research. — Emphasizes the ethical primacy of genuine, informed consent and public trust; supports opt-out only with strong safeguards (clear communication, easy opt-out, respect for families), cautioning that automatic enrollment may undermine autonomy if poorly implemented."
    }
}