{
    "question": "Should voting be made compulsory?",
    "content": {
        "source_1": "Australian Electoral Commission (AEC), “Voter turnout in federal elections” and “Compulsory voting in Australia” (official data pages). Australia’s compulsory voting regime has sustained turnout typically around 90–95% of enrolled voters since its adoption in 1924, evidencing that compulsion reliably drives near-universal participation. https://www.aec.gov.au/elections/australian_electoral_history/compulsory_voting.htm and https://www.aec.gov.au/Elections/australian_electoral_history/voter_turnout.htm",
        "source_2": "Arend Lijphart, “Unequal Participation: Democracy’s Unresolved Dilemma,” American Political Science Review, 1997. Lijphart argues, drawing on comparative evidence, that compulsory voting is a powerful remedy for class- and education-based turnout gaps, thereby improving representational equality and democratic legitimacy. DOI: 10.2307/2952352",
        "source_3": "Australian Electoral Commission (AEC), “Informal voting in House of Representatives elections” (briefings/factsheets; multiple election cycles). Under compulsory voting, Australia consistently records nontrivial rates of invalid (“informal”) ballots and ballot-order/“donkey vote” effects identified in election studies, indicating that compelling the uninterested can increase low-information or protest voting rather than informed choice. https://www.aec.gov.au/Voting/How_to_Vote/informal.htm",
        "source_4": "Jason Brennan, The Ethics of Voting, Princeton University Press, 2011. Brennan contends that citizens have a right not to vote and that compelling turnout likely increases the share of uninformed or indifferent voters, which can degrade decision quality and policy outcomes—arguing against compulsory voting on both liberty and epistemic grounds. ISBN: 978-0691144818",
        "source_5": "International IDEA, “Compulsory Voting” (overview) and Voter Turnout Database. IDEA documents that compulsion typically involves sanctions (e.g., fines or administrative penalties, as in Brazil and Belgium), raising civil liberties and equity concerns because enforcement can disproportionately burden lower-income or otherwise marginalized citizens. https://www.idea.int/data-tools/data/voter-turnout and https://www.idea.int",
        "source_6": "International IDEA Voter Turnout Database: Netherlands country profile. After the Netherlands abolished compulsory voting in 1967, turnout fell from very high levels but stabilized around roughly 80% in subsequent national elections—evidence that robust participation and democratic quality can persist without compulsion, challenging the necessity of mandatory voting. https://www.idea.int/data-tools/country-view/237/40"
    }
}