{
    "question": "Should hate speech on campus be censored?",
    "content": {
        "source_1": "Papish v. Board of Curators of the University of Missouri, 410 U.S. 667 (1973) — U.S. Supreme Court - Holding that a public university could not punish a student for distributing an “indecent” but nonviolent newspaper, the Court affirmed that “the mere dissemination of ideas—no matter how offensive to good taste—on a state university campus may not be shut off.” This undercuts claims that hate speech at public colleges “has to be” censored merely for being offensive.",
        "source_2": "Davis v. Monroe County Board of Education, 526 U.S. 629 (1999) — U.S. Supreme Court - Establishes that schools can be liable under Title IX when they are deliberately indifferent to student-on-student harassment that is so severe, pervasive, and objectively offensive that it denies victims equal access to education. This supports the view that institutions may be required to restrict certain targeted, hateful conduct/speech when it meets the legal harassment threshold.",
        "source_3": "National Academies of Sciences, Engineering, and Medicine (2018). Sexual Harassment of Women: Climate, Culture, and Consequences in Academic Sciences, Engineering, and Medicine. Washington, DC: The National Academies Press. - Synthesizes evidence that hostile, derogatory, and abusive climates (including verbal harassment) harm targets’ mental health, drive attrition, and impede learning and research. While focused on sexual harassment, the report supports the broader claim that institutions may need strong interventions—including restrictions on abusive expression—to fulfill educational missions.",
        "source_4": "American Association of University Professors (AAUP) (1992). On Freedom of Expression and Campus Speech Codes. - Argues that campus “hate speech codes” are misguided and often incompatible with academic freedom and the First Amendment (at public institutions), and recommends counterspeech, education, and robust support for affected students over censorship. This challenges the claim that censorship is the necessary or proper remedy.",
        "source_5": "Knight Foundation and Ipsos (2022). College Student Views on Free Expression and Campus Speech. - National survey data show students both value free expression and, at the same time, many support restricting racist or sexist slurs to ensure an inclusive environment; a substantial share also report self-censoring. These mixed attitudes are used by proponents to justify targeted restrictions on hate speech in the name of inclusion.",
        "source_6": "European Court of Human Rights, Vejdeland and Others v. Sweden (Application no. 1813/07), Judgment of 9 Feb. 2012. - The Court upheld criminal convictions for distributing anti-gay leaflets in a school, finding the interference with expression justified to protect the rights of others under Article 10(2) ECHR. This illustrates a contrasting legal framework in which restricting hate speech in educational settings can be lawful and, in practice, required."
    }
}