{
    "question": "Is gender equality treating men and women the same way?",
    "content": {
        "source_1": "John Stuart Mill, “The Subjection of Women” (1869) — Classic liberal argument that equality means granting women the same civil and political rights as men and removing sex-based legal distinctions; it frames gender equality primarily as identical treatment under the law. Link: https://oll.libertyfund.org/title/mill-the-subjection-of-women",
        "source_2": "U.S. Equal Pay Act of 1963, 29 U.S.C. § 206(d) — Requires that men and women receive equal pay for equal work performed under similar conditions, embodying a “same treatment for the same job” conception of gender equality in wage-setting. Overview: https://www.eeoc.gov/statutes/equal-pay-act-1963",
        "source_3": "UN CEDAW General Recommendation No. 25 on temporary special measures (2004) — States that identical treatment of women and men can be insufficient to achieve de facto equality, and endorses time-limited special measures (e.g., quotas) to overcome structural disadvantage; challenges the idea that equality is simply sameness. Text: https://www.ohchr.org/en/treaty-bodies/cedaw/general-recommendations",
        "source_4": "U.S. Pregnant Workers Fairness Act (effective 2023), enforced by EEOC — Mandates reasonable accommodations for pregnancy, childbirth, and related conditions, even when such accommodations are not provided to others; exemplifies a legal shift from strict “same treatment” toward differential treatment to achieve equal opportunity. Overview: https://www.eeoc.gov/wysk/what-you-should-know-about-pregnant-workers-fairness-act",
        "source_5": "OECD Policy Brief, “Parental leave: Where are the fathers?” (2016) — Reviews evidence that gender‑neutral parental leave policies are taken predominantly by mothers unless designed with non-transferable “daddy quotas”; shows that formally identical policies can perpetuate unequal outcomes without targeted measures. Link: https://www.oecd.org/policy-briefs/parental-leave-where-are-the-fathers.pdf",
        "source_6": "U.S. Department of Education Title IX Regulations, 34 C.F.R. § 106.41 (Athletics) — Permits separate teams for members of each sex in certain sports while requiring equal athletic opportunities overall, reflecting that equal opportunity may involve different treatment rather than identical treatment. Regulation: https://www.ecfr.gov/current/title-34/part-106/section-106.41"
    }
}