{
    "question": "Should an African Criminal Court be created?",
    "content": {
        "source_1": "African Union, Protocol on Amendments to the Protocol on the Statute of the African Court of Justice and Human Rights (the “Malabo Protocol”), adopted 27 June 2014. Evidence: Creates an International Criminal Law Section within a restructured African Court, adds regional crimes beyond the Rome Statute (e.g., unconstitutional change of government, corruption, illicit exploitation of natural resources, piracy, terrorism, trafficking, money laundering), and introduces corporate criminal liability—an innovation that could address Africa-specific harms and corporate abuse not readily prosecutable internationally.",
        "source_2": "Human Rights Watch, “AU: Reject Immunity for Leaders in New Court,” 30 June 2014. Evidence: Critiques Article 46A bis of the Malabo Protocol, which grants immunity to sitting heads of state and senior officials, arguing it undermines the fight against impunity and conflicts with evolving international norms that bar such immunities for core international crimes.",
        "source_3": "African Union Treaty Database (Status List for the Malabo Protocol), AU Commission, accessed 2024. Evidence: Notes that the Protocol requires 15 ratifications to enter into force but, as of 2024, had received no ratifications—highlighting a major practical barrier to creating and operationalizing an African Criminal Court.",
        "source_4": "Institute for Security Studies (ISS), Policy Brief on the Malabo Protocol (e.g., Ottilia Maunganidze & Anton du Plessis, 2015–2017 series). Evidence: Warns that establishing and operating a regional criminal court would be resource-intensive, stretching already limited AU and member-state budgets and institutional capacity, and potentially diverting funds from strengthening national judiciaries and the existing African human rights court.",
        "source_5": "EJIL: Talk! (European Journal of International Law blog), Dapo Akande & Charles C. Jalloh, “An African Criminal Court? The ICC and the Malabo Protocol,” 2014. Evidence: Analyzes likely jurisdictional friction with the International Criminal Court, including complementarity and immunity conflicts, and flags risks of fragmentation, forum shopping, and legal uncertainty if both courts assert authority over overlapping crimes.",
        "source_6": "Pan African Lawyers Union (PALU), Advocacy briefs on ratification of the Malabo Protocol (2018–2021). Evidence: Argues that a regional criminal court would increase African ownership of accountability processes, improve accessibility for victims (language, proximity, participation), and uniquely enable prosecutions of corporate actors and region-specific crimes—benefits not fully available under current international or domestic mechanisms."
    }
}