{
    "question": "Is self-determination of peoples a human right?",
    "content": {
        "source_1": "International Covenant on Civil and Political Rights (ICCPR) and International Covenant on Economic, Social and Cultural Rights (ICESCR), Common Article 1 (UN, 1966) — Both core human rights treaties open by declaring: “All peoples have the right of self-determination,” embedding it in binding human rights law and obliging states to promote and respect it. https://www.ohchr.org/en/instruments-mechanisms/instruments/international-covenant-civil-and-political-rights",
        "source_2": "UN General Assembly Resolution 2625 (XXV), “Declaration on Principles of International Law concerning Friendly Relations…” (1970) — Affirms self-determination but adds a limiting clause: nothing authorizes actions that would dismember or impair states’ territorial integrity if they represent “the whole people,” framing the right as constrained and primarily internal absent grave injustice. https://digitallibrary.un.org/record/202170",
        "source_3": "UN Human Rights Committee, General Comment No. 12 on Article 1 (1984) — Interprets self-determination as a right of “peoples” (a collective right), not enforceable by individual complaints under the ICCPR’s Optional Protocol, signaling that while it’s in human rights treaties, it functions differently from individual human rights. https://www.refworld.org/docid/453883f822.html",
        "source_4": "International Court of Justice, Accordance with International Law of the Unilateral Declaration of Independence in Respect of Kosovo (Advisory Opinion, 2010) — The ICJ held that Kosovo’s declaration did not violate international law but did not recognize a general right to unilateral secession, illustrating that self-determination is not equivalent to a human right to statehood. https://www.icj-cij.org/public/files/case-related/141/141-20100722-ADV-01-00-EN.pdf",
        "source_5": "African Charter on Human and Peoples’ Rights, Article 20, and Katangese Peoples’ Congress v. Zaire (African Commission, Comm. 75/92, 1995) — The Charter proclaims an “unquestionable and inalienable” right of peoples to self-determination as a regional human right, yet the Commission emphasized internal self-determination and treated secession as a last resort, showing a rights-based but restrained approach. Charter: https://www.achpr.org/legalinstruments/detail?id=49; Decision: https://www.achpr.org/communication/75-92",
        "source_6": "Allen Buchanan, Justice, Legitimacy, and Self-Determination (Oxford University Press, 2004) — A leading philosophical critique arguing self-determination does not entail a general human right to secede; at most there is a “remedial” right triggered by serious injustices (e.g., systematic oppression), challenging broad claims that self-determination is a universal human right. https://global.oup.com/academic/product/justice-legitimacy-and-self-determination-9780198295103"
    }
}