{
    "question": "Should the expenditure of money be protected as speech?",
    "content": {
        "source_1": "Buckley v. Valeo, 424 U.S. 1 (1976) — U.S. Supreme Court held that limits on independent campaign expenditures impose “direct and substantial restraints on the quantity of political speech,” protecting spending on one’s own political expression under the First Amendment. https://www.law.cornell.edu/supremecourt/text/424/1",
        "source_2": "Citizens United v. FEC, 558 U.S. 310 (2010) — Majority opinion ruled that political speech does not lose First Amendment protection based on the speaker’s identity (including corporations), striking down bans on corporate independent expenditures and emphasizing that restricting spending is a form of restricting speech. https://www.law.cornell.edu/supremecourt/text/08-205",
        "source_3": "Austin v. Michigan Chamber of Commerce, 494 U.S. 652 (1990) — U.S. Supreme Court (later overruled) upheld limits on corporate independent expenditures to prevent “the corrosive and distorting effects of immense aggregations of wealth,” a competing view that spending may be regulated to protect the political process. https://www.law.cornell.edu/supct/html/89-1391.ZO.html",
        "source_4": "Harper v. Canada (Attorney General), 2004 SCC 33 — Supreme Court of Canada upheld limits on third‑party election advertising, reasoning that spending caps promote electoral fairness and equal participation; a comparative perspective where money in elections is not treated as fully protected speech. https://canlii.ca/t/1gdxp",
        "source_5": "Freedman, P., Franz, M., & Goldstein, K. (2004). Campaign Advertising and Democratic Citizenship. American Journal of Political Science, 48(4), 723–741 — Empirical evidence that exposure to political ads increases political knowledge, interest, and turnout, suggesting that expenditures enable voter-information benefits consistent with protecting spending as speech. https://www.jstor.org/stable/1519930",
        "source_6": "Kalla, J., & Broockman, D. (2016). Campaign Contributions Facilitate Access to Congressional Officials: A Randomized Field Experiment. American Political Science Review, 110(3), 1–18 — Field experiment finding donors were far likelier to secure meetings with policymakers, indicating money buys access and supporting the view that protecting spending as speech can undermine political equality. https://www.cambridge.org/core/journals/american-political-science-review/article/campaign-contributions-facilitate-access-to-congressional-officials-a-randomized-field-experiment/5C21E18144FDA8F7C9B4E2CB23E25AE6"
    }
}