{
    "question": "Should there be a right to reply?",
    "content": {
        "source_1": "Miami Herald Publishing Co. v. Tornillo, 418 U.S. 241 (1974) — The U.S. Supreme Court struck down a Florida statute that required newspapers to publish replies from political candidates they criticized, holding that a mandatory right of reply for print media violates the First Amendment by compelling speech and chilling editorial judgment. https://www.law.cornell.edu/supremecourt/text/418/241",
        "source_2": "Red Lion Broadcasting Co. v. FCC, 395 U.S. 367 (1969) — The U.S. Supreme Court upheld the FCC’s “personal attack” and “political editorial” rules under the Fairness Doctrine, which required broadcasters to provide a right of reply, reasoning that spectrum scarcity justified greater regulation of broadcasters than print media. https://www.law.cornell.edu/supremecourt/text/395/367",
        "source_3": "EU Audiovisual Media Services Directive (2010/13/EU), Article 28 “Right of reply” — EU law requires Member States to ensure a right of reply or equivalent remedies for television broadcasting, embedding a legal entitlement to respond in the European media framework. https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX%3A32010L0013",
        "source_4": "Ofcom Broadcasting Code (UK), Section Seven: Fairness — UK broadcasters must deal fairly with people in programs, including offering an opportunity to respond to significant allegations and, where appropriate, a post-broadcast right of reply, reflecting a regulatory, not constitutional, approach. https://www.ofcom.org.uk/tv-radio-and-on-demand/broadcast-codes/broadcast-code/section-seven-fairness",
        "source_5": "Society of Professional Journalists (SPJ) Code of Ethics — The leading U.S. journalism ethics code urges reporters to “diligently seek subjects of news coverage to allow them to respond to criticism or allegations of wrongdoing,” endorsing a professional norm of right to reply even without a legal mandate. https://www.spj.org/ethicscode.asp",
        "source_6": "ARTICLE 19, “Defining Defamation: Principles on Freedom of Expression and Protection of Reputation” (2017) — A free-expression NGO cautions that statutory, mandatory rights of reply/correction can be abused to burden or chill speech, recommending self-regulatory or proportionate remedies over legal compulsion. https://www.article19.org/resources/defining-defamation-principles-on-freedom-of-expression-and-protection-of-reputation/"
    }
}