{
    "question": "Should speed limits be reduced?",
    "content": {
        "source_1": "World Health Organization — Managing Speed (2017). WHO synthesizes global evidence showing that small reductions in average speed produce disproportionately large safety gains: a 1% drop in mean speed is associated with roughly a 4% reduction in fatal crashes; pedestrian death risk rises sharply with impact speed (about 10% at 30 km/h vs around 80% at 50 km/h). https://www.who.int/publications/i/item/WHO-NMH-NVI-17.8",
        "source_2": "Grundy et al., BMJ — Effect of 20 mph traffic speed zones on road injuries in London (2009). A controlled interrupted time series of London’s 20 mph zones found substantial casualty reductions where limits were lowered with traffic-calming measures: all-road-casualties fell by about 42%, with even larger reductions for children and for serious/fatal injuries. https://www.bmj.com/content/339/bmj.b4469",
        "source_3": "UK Department for Transport (Atkins/AECOM) — 20mph speed limits: Research Study (2018). Evaluating “signed-only” 20 mph limits (without physical calming), DfT found small average speed reductions (around 1 mph) and no statistically significant short-term casualty reduction, indicating that lowering the posted number alone often has limited safety effect without engineering or enforcement changes. https://www.gov.uk/government/publications/20mph-speed-limits-on-roads",
        "source_4": "International Energy Agency — A 10-Point Plan to Cut Oil Use (2022). IEA estimates that reducing highway speed limits by 10 km/h in advanced economies would save roughly 290,000 barrels of oil per day and cut CO2 and local air pollutant emissions, framing lower speed limits as an energy security and climate measure as well as a safety intervention. https://www.iea.org/reports/a-10-point-plan-to-cut-oil-use",
        "source_5": "Owner-Operator Independent Drivers Association (OOIDA) — Opposition to speed limiters and lower/split speed limits for trucks (e.g., response to 2016 FMCSA/NHTSA proposal). OOIDA argues that reduced or differential speed limits increase speed variance and interaction conflicts between vehicles, potentially elevating crash risk, while also imposing time and cost burdens on freight operations. https://www.ooida.com/news-and-press/press-releases/",
        "source_6": "Stanford Open Policing Project — Findings on traffic-stop disparities (ongoing; Pierson et al., Nature Human Behaviour 2020). Large-scale analysis shows racial disparities in traffic stops and search rates; policies that rely on increased traffic enforcement (e.g., stricter speed enforcement after lowering limits) risk exacerbating inequities unless carefully designed with automated, bias-resistant methods and oversight. https://openpolicing.stanford.edu/findings/"
    }
}