{
    "question": "Does land titling provide legal empowerment for women?",
    "content": {
        "source_1": "Ali, Daniel A.; Deininger, Klaus; Goldstein, Markus (2014). Environmental and Gender Impacts of Land Tenure Regularization in Africa: Pilot Evidence from Rwanda. Journal of Development Economics. Evidence: Rwanda’s nationwide land tenure regularization, which recorded joint spousal rights and women’s names on titles, increased women’s documented land claims, reduced land disputes, and boosted investment on plots held by (legally) married women—indicating concrete legal empowerment effects when titling explicitly secures women’s rights.",
        "source_2": "Field, Erica (2007). Entitled to Work: Urban Property Rights and Labor Supply in Peru. Quarterly Journal of Economics. Evidence: Formal property titles in urban Peru led to significant increases in women’s labor supply by reducing the need to guard property and improving perceived security, suggesting that titling can enhance women’s autonomy and economic agency—a pathway of legal empowerment through greater freedom to engage in labor markets.",
        "source_3": "Deere, Carmen Diana; León, Magdalena (2003). The Gender Asset Gap: Land in Latin America. World Development. Evidence: Comparative analysis shows many titling programs registered land in the name of the male household head by default; without explicit joint titling mandates, women’s ownership shares did not rise and women’s claims were often unrecognized—implying that titling alone does not guarantee women’s legal empowerment and can entrench gender bias.",
        "source_4": "Lastarria-Cornhiel, Susana (1997). Impact of Privatization on Gender and Property Rights in Africa. World Development. Evidence: The shift to individualized, formal titles frequently undermined women’s secondary and use rights under customary systems (e.g., widows’ and daughters’ claims), sometimes resulting in dispossession—indicating that titling can reduce, rather than enhance, women’s legal empowerment where customary protections are displaced.",
        "source_5": "Goldstein, Markus; Udry, Christopher (2008). The Profits of Power: Land Rights and Agricultural Investment in Ghana. Journal of Political Economy. Evidence: Women’s land security and investment were strongly tied to their political and social standing within customary institutions, not just formal rules; this suggests that formal titling, without shifts in underlying power relations, may have limited impact on women’s effective control—challenging the assumption that titling automatically yields legal empowerment."
    }
}