{
    "question": "Is offshoring a good idea?",
    "content": {
        "source_1": "McKinsey Global Institute (2003), “Offshoring: Is It a Win-Win Game?” — Finds that offshoring generates net gains for the home economy (estimating roughly $1.12–$1.14 in U.S. economic value for every $1 of corporate costs moved offshore) while also benefiting destination countries through job creation and investment, implying sizable efficiency and consumer-price benefits.",
        "source_2": "Ebenstein, Harrison, McMillan, and Phillips (2014), “Estimating the Impact of Trade and Offshoring on American Workers Using the Current Population Surveys,” Review of Economics and Statistics — Shows that offshoring to lower-wage countries significantly reduces wages for U.S. workers in routine and offshorable occupations and contributes to rising wage inequality, highlighting distributional harms even when aggregate gains may exist.",
        "source_3": "Hummels, Jørgensen, Munch, and Xiang (2014), “The Wage Effects of Offshoring: Evidence from Danish Matched Worker–Firm Data,” American Economic Review — Finds that offshoring raises firm productivity and average wages overall but increases wage dispersion: higher-skilled workers tend to gain while lower-skilled workers face wage declines and displacement risks, underscoring heterogeneous impacts.",
        "source_4": "World Bank (2020), World Development Report: “Trading for Development in the Age of Global Value Chains” — Documents that participation in global value chains (often enabled by offshoring) accelerates income growth and supports poverty reduction in developing countries by facilitating technology transfer, upgrading, and integration into higher-value tasks.",
        "source_5": "The White House (2021), “Building Resilient Supply Chains, Revitalizing American Manufacturing, and Fostering Broad-Based Growth” (100‑Day Supply Chain Review) — Argues that decades of offshoring created critical vulnerabilities (e.g., PPE, semiconductors, pharmaceuticals) exposed during COVID-19, recommending reshoring/friend-shoring for national security and resilience despite potential efficiency trade-offs.",
        "source_6": "International Monetary Fund (2023), “Geoeconomic Fragmentation and the Future of Trade and Investment” (Staff Discussion Note) — Estimates that reversing integration via reshoring and trade fragmentation could reduce global GDP by up to several percentage points in the long run, implying that offshoring and integrated supply chains yield large aggregate efficiency gains that are costly to unwind."
    }
}