{
    "question": "Has evolution disproved creationism?",
    "content": {
        "source_1": "IJdo et al., “Origin of human chromosome 2: An ancestral telomere–telomere fusion,” Nature (1991). Reports telomeric and vestigial centromeric sequences in human chromosome 2 consistent with fusion of two ancestral ape chromosomes, a specific genetic signature supporting common ancestry and challenging separate special creation of humans.",
        "source_2": "Shubin, Daeschler, and Jenkins, “A Devonian tetrapod-like fish and the evolution of the tetrapod body plan,” Nature (2006). Describes Tiktaalik roseae, a transitional fossil with both fish and tetrapod features, discovered in strata and locale predicted by evolutionary theory, countering claims that transitional forms are absent.",
        "source_3": "Dalrymple, The Age of the Earth (Stanford University Press, 1991). Synthesizes radiometric dating results across multiple independent isotope systems and meteorites converging on ~4.54 billion years for Earth’s age, directly contradicting young-earth creationist timelines.",
        "source_4": "Behe, Darwin’s Black Box: The Biochemical Challenge to Evolution (Free Press, 1996). Argues certain cellular systems (e.g., bacterial flagellum, blood-clotting cascade) exhibit “irreducible complexity” that, he claims, is not plausibly produced by stepwise Darwinian processes—used to contend evolution has not refuted design-based creationist explanations.",
        "source_5": "Sober, Evidence and Evolution: The Logic Behind the Science (Cambridge University Press, 2008). Philosophical analysis contending that while specific empirical claims of creationism (e.g., young Earth, separate ancestry) can be tested and disconfirmed, broad supernatural-creation claims are too unconstrained to be falsified by scientific methods—thereby challenging the assertion that “creationism” as a whole has been disproved.",
        "source_6": "Collins, The Language of God: A Scientist Presents Evidence for Belief (Free Press, 2006). Presents genomic evidence strongly supporting evolution while arguing it is compatible with belief in a Creator (theistic evolution), indicating that acceptance of evolution does not, in itself, disprove all forms of creationist belief."
    }
}