{
    "question": "Should tuition fees be increased?",
    "content": {
        "source_1": "State Higher Education Executive Officers Association (SHEEO), State Higher Education Finance (SHEF) Report FY 2022 (2023) — Over the long term, many states have shifted a greater share of educational revenue onto tuition as per-student state appropriations lag or fluctuate; institutions have used tuition increases to backfill public funding gaps to sustain program quality and staffing.",
        "source_2": "OECD, Education at a Glance 2023 — Cross-country data show that systems with higher tertiary tuition (e.g., United States, United Kingdom) also tend to have higher per-student spending and more resources, while many zero-tuition systems face lower spending per student and capacity constraints, suggesting higher fees can support quality when paired with aid.",
        "source_3": "UCAS, End of Cycle Report 2016 — In England, after the 2012 rise in tuition fees, entry rates for 18-year-olds, including those from the most disadvantaged areas, reached record highs within a few years; the evidence indicates that income-contingent loans and bursaries can offset higher sticker prices and preserve (or even increase) participation.",
        "source_4": "Susan M. Dynarski, “Does Aid Matter? Measuring the Effect of Student Aid on College Attendance and Completion,” American Economic Review (2003) — Empirical estimates show that reducing net price (via grants/aid) increases college attendance and completion, implying the reverse: raising tuition without commensurate aid depresses enrollment, especially among low-income students.",
        "source_5": "Delta Cost Project (American Institutes for Research), Trends in College Spending 2003–2013 — Analysis of institutional spending patterns finds growth in expenditures on student services and administrative support often outpacing spending on instruction, raising concerns that additional tuition revenue may not translate into improved teaching quality without governance and accountability reforms.",
        "source_6": "Alvaro Mezza, Daniel Ringo, Shane Sherlund, and Kamila Sommer, “Student Loans and Homeownership,” Journal of Labor Economics (2020) — Increases in student debt causally reduce young adults’ homeownership rates; higher tuition that leads to greater borrowing can have broader negative household and macroeconomic consequences even if it stabilizes institutional budgets."
    }
}