{
    "question": "Should human cloning be banned?",
    "content": {
        "source_1": "United Nations General Assembly (2005). United Nations Declaration on Human Cloning (A/RES/59/280) — Calls on Member States to prohibit all forms of human cloning that are incompatible with human dignity and the protection of human life; widely cited as a basis for national bans, supporting a comprehensive prohibition.",
        "source_2": "National Academies of Sciences (2002). Scientific and Medical Aspects of Human Reproductive Cloning — Reviews animal cloning data and concludes human reproductive cloning would be unsafe due to high rates of fetal loss, malformations, and epigenetic abnormalities; recommends a legal ban on reproductive cloning on safety grounds.",
        "source_3": "UK Human Fertilisation and Embryology Act (2008) and HFE (Research Purposes) Regulations (2001), administered by the Human Fertilisation and Embryology Authority (HFEA) — Establishes a regulatory model that bans reproductive cloning while permitting somatic cell nuclear transfer for research under license, evidencing a targeted alternative to an across-the-board ban.",
        "source_4": "Harris, John (2004). On Cloning. Routledge — Argues that, if safe, reproductive cloning is an extension of reproductive autonomy and not intrinsically immoral; challenges categorical bans by appealing to individual liberty and consistency with assisted reproduction.",
        "source_5": "Tachibana, Masahito et al. (2013). Human Embryonic Stem Cells Derived by Somatic Cell Nuclear Transfer. Cell — Demonstrates creation of patient-specific embryonic stem cells via SCNT, highlighting potential benefits for disease modeling and immune-matched therapies; evidence against prohibiting all forms of human cloning research.",
        "source_6": "Takahashi, Kazutoshi; Yamanaka, Shinya (2006/2007). Induction of pluripotent stem cells by defined factors. Cell — Shows that iPSC technology can generate pluripotent cells without cloning embryos, offering a non-cloning alternative for many therapeutic aims; supports arguments that a ban on SCNT-based human cloning need not impede biomedical progress."
    }
}