{
    "question": "Should patenting genes be allowed?",
    "content": {
        "source_1": "Association for Molecular Pathology v. Myriad Genetics, Inc., 569 U.S. 576 (2013) — U.S. Supreme Court held that naturally occurring DNA segments are products of nature and not patent-eligible, though cDNA may be patentable; this legal precedent weighs against allowing patents on naturally occurring human genes. https://www.supremecourt.gov/opinions/12pdf/12-398_1b7d.pdf",
        "source_2": "Directive 98/44/EC of the European Parliament and of the Council on the legal protection of biotechnological inventions (1998) — The EU explicitly allows patents on elements isolated from the human body, including gene sequences, provided their function is disclosed and they have industrial application, reflecting a policy stance that gene patents can be permissible under conditions. https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:31998L0044",
        "source_3": "Williams, Heidi (2013), “Intellectual Property Rights and Innovation: Evidence from the Human Genome,” Journal of Political Economy 121(1): 1–27 — Using Celera’s gene IP as a natural experiment, the study finds 20–30% reductions in subsequent scientific research and product development on patented genes, suggesting gene patents can impede follow-on innovation. https://doi.org/10.1086/669749",
        "source_4": "OECD (2002), Genetic Inventions, Intellectual Property Rights and Licensing Practices: Evidence and Policies — Surveying biotechnology stakeholders, the report concludes that patents are important for attracting private investment into genetic diagnostics and therapeutics, while recommending licensing practices to mitigate access concerns. https://www.oecd.org/sti/emerging-tech/2491084.pdf",
        "source_5": "U.S. HHS Secretary’s Advisory Committee on Genetics, Health, and Society (SACGHS) (2010), Gene Patents and Licensing Practices and Their Impact on Patient Access to Genetic Tests — Finds that certain gene patents and exclusive licenses (e.g., BRCA) raised prices and limited access to testing, and recommends policy reforms such as nonexclusive licensing and research exemptions. https://osp.od.nih.gov/wp-content/uploads/2013/11/GELP_Report_2010.pdf",
        "source_6": "UNESCO (1997), Universal Declaration on the Human Genome and Human Rights — States that “the human genome in its natural state shall not give rise to financial gains,” articulating an ethical stance against proprietary claims over human genes. https://unesdoc.unesco.org/ark:/48223/pf0000110220"
    }
}