{
    "question": "Does football unify us?",
    "content": {
        "source_1": "FIFA (2019) — 2018 FIFA World Cup Russia Global Broadcast and Audience Summary. Key evidence: an estimated 3.5+ billion people watched at least part of the tournament and around 1.12 billion watched the final, with high rates of communal viewing, illustrating a globally shared experience that can foster a sense of unity across countries and cultures.",
        "source_2": "Kavetsos, G., & Szymanski, S. (2010). National well-being and international sports events. Journal of Economic Psychology, 31(2), 158–171. Finding: national life satisfaction measurably increases around major international sporting successes (including football) and when countries host big events—short-lived but broad-based boosts consistent with temporary social cohesion.",
        "source_3": "BBC News (2018). Reporting on Didier Drogba and Côte d’Ivoire — e.g., “How Didier Drogba helped end a civil war.” Evidence: the Ivorian national team’s public peace plea and a symbolic match in Bouaké were credited with helping catalyze a ceasefire and national reconciliation messaging, a concrete case of football contributing to political and social unity.",
        "source_4": "The Guardian (2014). “World Cup: domestic violence rises when England play, police data show.” Evidence: analysis of Lancashire Police data across multiple tournaments found domestic abuse incidents rose by 38% when England lost and 26% when they won, indicating that high-stakes football can exacerbate conflict and harm within households rather than unify.",
        "source_5": "Scottish Government (2015). Analysis of offending linked to football and sectarianism in Scotland. Finding: a substantial proportion of “religiously aggravated” charges are football-related, with notable spikes around Old Firm (Celtic–Rangers) matches, showing that football rivalries can entrench sectarian identities and social division.",
        "source_6": "Ofcom and The Alan Turing Institute (2022). Report on online abuse of Premier League players on Twitter. Finding: roughly 3.5% of directed tweets were abusive, with surges after high-profile matches and disproportionate targeting of Black players—evidence that football can fuel polarization and discriminatory abuse rather than unity in digital spaces."
    }
}