{
    "question": "Should junk food be banned from schools?",
    "content": {
        "source_1": "Taber DR, Chriqui JF, Powell LM, Chaloupka FJ — Pediatrics (2012): Longitudinal analysis found that students in states with strong laws restricting “competitive” foods and beverages at school had smaller increases in BMI over three years compared with students in states without such laws. This supports the claim that limiting junk food access in schools can modestly curb weight gain.",
        "source_2": "Centers for Disease Control and Prevention — School Health Policies and Practices Study (SHPPS) and Smart Snacks monitoring (2016–2018): National surveillance shows schools that implemented USDA Smart Snacks standards substantially reduced the availability of sugar-sweetened beverages and high-calorie snack items on campus. This indicates bans/strong standards are effective at changing the on-campus food environment and reducing exposure to junk foods during the school day.",
        "source_3": "U.S. Government Accountability Office (GAO) — Reports on school nutrition standards implementation (mid-2010s): GAO reviews of district experiences documented initial declines in a la carte and vending revenues and challenges for some small/rural districts after stronger nutrition rules, with some schools reporting lower participation before adjustments. This raises a fiscal and operational concern about outright bans’ potential to strain school food-service budgets.",
        "source_4": "Cochrane Collaboration — “Interventions for preventing obesity in children” systematic review (e.g., Waters et al., 2011 and updates): School-based dietary environment interventions produce small average reductions in adiposity, and some studies suggest students may compensate by consuming discretionary foods outside school. This tempers expectations that bans alone will substantially change total daily intake or BMI without broader measures.",
        "source_5": "American Academy of Pediatrics — Policy statements on school nutrition and obesity prevention (2015–2019): AAP endorses eliminating sugar-sweetened beverages and low-nutrition competitive foods from schools, but emphasizes that effective, lasting impact requires comprehensive strategies (nutrition education, appealing healthy meals, physical activity, family engagement). This perspective supports restrictions while cautioning that bans should be part of a broader program.",
        "source_6": "Cato Institute — Commentary on school food policy (various): Argues that junk food bans in schools risk undermining parental choice and student autonomy, rely on contested definitions of “junk,” and may be better replaced by transparency and education-based approaches. This presents a civil-liberties and governance critique of banning policies."
    }
}