{
    "question": "Should national service be re-introduced?",
    "content": {
        "source_1": "BBC News — Sweden brings back military conscription amid security concerns (2017) - Evidence: Sweden reintroduced conscription citing regional threats and shortfalls in volunteer recruitment, arguing it was necessary to improve readiness and fill critical defense roles. This illustrates a pro-security rationale that national service can address manpower and preparedness gaps in certain contexts.",
        "source_2": "Corporation for National and Community Service (CNCS) — Volunteering as a Pathway to Employment (2013) - Evidence: Using U.S. Current Population Survey data, CNCS found unemployed individuals who volunteer are significantly more likely to secure employment subsequently, even after controlling for demographic factors. This supports the idea that structured civilian national service can boost employability and civic engagement.",
        "source_3": "Joshua D. Angrist — Lifetime Earnings and the Vietnam Era Draft Lottery: Evidence from Social Security Administrative Records, American Economic Review (1990) - Evidence: Using the Vietnam draft lottery as an instrument, Angrist found that conscription-linked veteran status was associated with lower lifetime earnings for affected cohorts, indicating substantial opportunity costs of mandatory military service.",
        "source_4": "Institute for Fiscal Studies (IFS) — The Conservatives’ proposed National Service: costs and funding uncertainties (May 2024) - Evidence: IFS analysis of the UK proposal flagged multi-billion-pound annual costs and unclear funding sources, noting potential strain on defense and voluntary sectors’ capacity. This raises feasibility and fiscal sustainability concerns about reintroducing national service at scale.",
        "source_5": "RUSI Commentary — Why compulsory national service would not deliver UK military readiness (May 2024) - Evidence: Defence analysts argue modern, high-tech forces require long training pipelines and experienced personnel; short-term conscripts would be minimally deployable and divert resources to training and supervision, potentially weakening rather than strengthening readiness.",
        "source_6": "YouGov — Public attitudes to reintroducing National Service in the UK (May 2024) - Evidence: Polling showed the public split, with strong age polarization—older voters more supportive and younger voters largely opposed—indicating significant societal and political contention over reintroducing national service."
    }
}