{
    "question": "Should 16-year-olds be able to vote in presidential elections?",
    "content": {
        "source_1": "Laurence Steinberg, “Why 16-Year-Olds Really Should Vote” (New York Times, Mar. 2, 2019) — Citing developmental research, Steinberg argues that by age 16 adolescents’ “cold cognition” (deliberative reasoning used in tasks like voting) is comparable to adults’, supporting their capacity to make informed electoral choices. https://www.nytimes.com/2019/03/02/opinion/sunday/voting-age.html",
        "source_2": "Roper v. Simmons, 543 U.S. 551, 569 (2005) — The U.S. Supreme Court characterized juveniles as less mature, more susceptible to peer pressure, and having an underdeveloped sense of responsibility when distinguishing them from adults in criminal culpability, a perspective often cited to caution against equating adolescent and adult judgment in civic decisions.",
        "source_3": "Wagner, Markus; Johann, David; Kritzinger, Sylvia. “Voting at 16: Turnout and the quality of vote choice.” Electoral Studies 31(2), 2012 — Using Austria’s experience (national voting age 16), the authors find the “quality of vote choice” among 16–17-year-olds is on par with older voters, indicating competent preference–party matching. https://doi.org/10.1016/j.electstud.2011.11.003",
        "source_4": "The Nation’s Report Card: Civics 2022 (National Assessment of Educational Progress) — Only 22% of eighth graders scored at or above Proficient, and average civics scores declined for the first time, raising concerns about baseline civic knowledge among U.S. teens approaching voting age. https://www.nationsreportcard.gov/civics/",
        "source_5": "CIRCLE (Tufts University), “Takoma Park’s 16- and 17-Year-Olds Turned Out at Four Times the Rate of Older Voters” (Nov. 2013) — In the first U.S. city to lower the local voting age to 16, 44% of registered 16–17-year-olds voted versus 11% citywide, suggesting strong engagement when enfranchised and contacted through schools/communities. https://circle.tufts.edu/latest-research/takoma-parks-16-and-17-year-olds-turned-out-four-times-rate-older-voters",
        "source_6": "Hill-HarrisX Poll (The Hill, Mar. 2019) — Public opinion runs strongly against lowering the voting age: 84% of respondents opposed allowing 16-year-olds to vote in federal elections, indicating limited public support for such a reform. https://thehill.com/hilltv/what-americas-thinking/434206-poll-84-percent-of-voters-oppose-lowering-federal-voting-age-to-16/"
    }
}