{
    "question": "Should sexist advertising be banned?",
    "content": {
        "source_1": "American Psychological Association Task Force on the Sexualization of Girls (2007), “Report of the APA Task Force on the Sexualization of Girls.” Synthesis of experimental and correlational studies finds that sexualized portrayals in media and advertising are linked to harms including body dissatisfaction, depressive symptoms, and impaired cognitive performance. Supports stronger policy interventions to reduce harmful gendered content in ads.",
        "source_2": "UK Advertising Standards Authority (ASA) and Committees of Advertising Practice (CAP/BCAP) (2017–2019). ASA’s evidence review “Depictions, Perceptions and Harm” (2017) concluded certain gender stereotypes in ads can constrain life choices and cause harm; in 2019 CAP/BCAP introduced a rule prohibiting ads that include gender stereotypes likely to cause harm or serious offense, leading to high‑profile ad bans. Presents a targeted regulatory approach short of an outright ban, arguing precision rules can address harm without a blanket prohibition.",
        "source_3": "U.S. Supreme Court, Central Hudson Gas & Electric Corp. v. Public Service Commission, 447 U.S. 557 (1980); Matal v. Tam, 582 U.S. 218 (2017). Central Hudson sets limits on restricting commercial speech (regulations must directly advance a substantial interest and be no more extensive than necessary), while Matal v. Tam holds viewpoint-based restrictions unconstitutional. Indicates a broad ban on “sexist advertising” would likely be impermissible in the U.S., raising free‑speech and vagueness concerns.",
        "source_4": "United Nations, Convention on the Elimination of All Forms of Discrimination against Women (CEDAW) (1979), Article 5; and Beijing Platform for Action (1995), Section J “Women and the Media.” Calls on states to eliminate prejudices and stereotyped gender roles and to encourage (including via regulatory means) media to avoid sexist portrayals. Provides a human‑rights basis for governments to restrict sexist advertising to uphold gender equality.",
        "source_5": "Kantar (2019), “Getting Gender Right: Achieving gender balance in advertising,” and UN Women’s Unstereotype Alliance Progress Reports (2020–2022). Research reports that ads with progressive, non‑stereotyped portrayals are associated with stronger brand effectiveness and equity, and industry initiatives have driven measurable shifts without government bans. Argues market incentives and self‑regulation can reduce sexist advertising effectively, making blanket prohibitions unnecessary."
    }
}