{
    "question": "Should voting be compulsory in the UK?",
    "content": {
        "source_1": "International IDEA Voter Turnout Database (Voter Turnout, global): Comparative data show countries with compulsory voting (e.g., Australia, Belgium) consistently record turnout around 85–95% of registered voters, while recent UK general elections have been markedly lower (about 60–67%), indicating compulsion is associated with substantially higher participation.",
        "source_2": "Arend Lijphart, “Unequal Participation: Democracy’s Unresolved Dilemma,” American Political Science Review (1997): Lijphart argues compulsory voting is the most effective reform for reducing socioeconomic turnout gaps, enhancing political equality by bringing lower-income and less-educated citizens into the electorate.",
        "source_3": "Australian Parliamentary Library, Quick Guide on informal and “donkey” voting (e.g., Damon Muller, Informal voting in recent federal elections): Documents that Australia’s compulsory system sees non-trivial levels of informal ballots (about 5–6% in the 2019 federal election) and ballot-order “donkey voting,” raising concerns about the quality and sincerity of some compelled votes.",
        "source_4": "Commonwealth Electoral Act 1918 (Cth), s.245 (Australia): Establishes legal enforcement of compulsory voting and a penalty (typically A$20 for failing to vote without valid reason), illustrating the coercive mechanism and administrative burden required to pursue and fine non-voters.",
        "source_5": "UK House of Commons Political and Constitutional Reform Committee, “Voter engagement in the UK” (2014–15, HC 232): Considered compulsory voting but did not recommend it, citing civil liberties concerns and advocating alternative measures (e.g., improved registration, civic education, and electoral reforms) to boost engagement without coercion.",
        "source_6": "Venice Commission (Council of Europe), Code of Good Practice in Electoral Matters (2002, rev.): States that compulsory voting is not inherently contrary to free-election principles if sanctions are proportionate and non-excessive, indicating the policy would be legally compatible with European democratic standards if carefully designed."
    }
}