{
    "question": "Should women be allowed to take part in combat?",
    "content": {
        "source_1": "U.S. Department of Defense, “Carter Opens All Military Occupations and Positions to Women,” Dec. 3, 2015, defense.gov. Evidence: The Pentagon opened all combat roles to women with no exceptions and pledged not to lower standards, arguing broader access to the full talent pool would improve force effectiveness.",
        "source_2": "U.S. Marine Corps, “Force Integration Plan Summary,” Sept. 2015 (Ground Combat Element Integrated Task Force findings). Evidence: In controlled evaluations, all-male squads outperformed mixed-gender squads in 69% of tasks under load and women experienced higher rates of musculoskeletal injuries, raising concerns about lethality and injury risk in certain combat roles.",
        "source_3": "UK Ministry of Defence, “Women in Ground Close Combat (WGCC) Review,” 2016, gov.uk. Evidence: The review found average physiological differences (strength, aerobic capacity) increase injury risk for women in close-combat roles but recommended opening roles with gender-neutral standards, targeted conditioning, and mitigation measures to preserve operational effectiveness.",
        "source_4": "U.S. Army, “Two women make Army Ranger School history,” Aug. 2015, army.mil. Evidence: The first women to graduate Ranger School met identical standards in one of the military’s toughest courses, demonstrating that individual women can meet elite combat requirements.",
        "source_5": "U.S. Army, “Army Combat Fitness Test (ACFT) updates,” March 2022, army.mil/acft. Evidence: The Army shifted from a single gender-neutral scoring model to age- and sex-normed performance categories after pilot data showed disparate pass rates, which critics cite as evidence of pressure to adjust standards for combat readiness, and supporters frame as more valid fitness assessment.",
        "source_6": "BBC News, “The women fighting ISIS,” 2015, bbc.com. Evidence: Reporting on Kurdish YPJ units documents women engaging effectively in direct combat (e.g., the defense of Kobane) against ISIS, providing real-world cases that women can perform in frontline combat operations."
    }
}