{
    "question": "Does strict parenting work best?",
    "content": {
        "source_1": "Lamborn, S. D., Mounts, N. S., Steinberg, L., & Dornbusch, S. M. (1991). Patterns of competence and adjustment among adolescents from authoritative, authoritarian, indulgent, and neglectful families. Child Development, 62(5), 1049–1065. Large U.S. study linking authoritative (firm but warm) parenting to the best academic, psychosocial, and behavioral outcomes; adolescents from authoritarian (strict, low warmth) homes fared worse on self-reliance and social competence, challenging the idea that strict works best.",
        "source_2": "Barber, B. K., Stolz, H. E., & Olsen, J. A. (2005). Parental support, psychological control, and behavioral control: Assessing relevance across time, culture, and method. Monographs of the Society for Research in Child Development, 70(4). Distinguishes types of “strictness”: behavioral control (clear rules/monitoring) is generally associated with fewer externalizing problems, whereas psychological control (guilt/shame, intrusiveness) predicts poorer adjustment—suggesting some forms of firmness can be beneficial while others are harmful.",
        "source_3": "Chao, R. K. (1994). Beyond parental control and authoritarian parenting style: Understanding Chinese parenting through the cultural notion of training. Child Development, 65(4), 1111–1119. Argues that what looks like “strict” in Chinese families reflects a culturally valued concept of training (guan) perceived as care and investment, which can relate to strong academic effort—implying strictness may function differently and more positively in some cultural contexts.",
        "source_4": "Gershoff, E. T., & Grogan-Kaylor, A. (2016). Spanking and child outcomes: Old controversies and new meta-analyses. Journal of Family Psychology, 30(4), 453–469. Meta-analyses across 75 studies find spanking associated with more aggression, antisocial behavior, and mental health problems, with no evidence of improved long-term compliance—undercutting strict, punitive discipline as “best.”",
        "source_5": "Lansford, J. E., Chang, L., Dodge, K. A., Malone, P. S., Oburu, P., Palmérus, K., Bacchini, D., Pastorelli, C., Bombi, A. S., Zelli, A., Tapanya, S., Chaudhary, N., Deater-Deckard, K., & Quinn, N. (2005). Physical discipline and children’s adjustment: Cultural normativeness as a moderator. Child Development, 76(6), 1234–1246. In samples from six countries, links between physical discipline and maladjustment were weaker where such discipline was culturally normative—suggesting strict practices can be less harmful or differently interpreted depending on societal context.",
        "source_6": "Kim, S. Y., Wang, Y., Orozco-Lapray, D., Shen, Y., & Murtuza, M. (2013). Does “Tiger Parenting” exist? Parenting profiles of Chinese Americans and adolescent developmental outcomes. Asian American Journal of Psychology, 4(1), 7–18. Identifies a “tiger parenting” profile (high pressure/strictness) but finds it predicts worse academic and psychological outcomes than supportive parenting among Chinese American youth—contradicting the claim that stricter styles work best."
    }
}