{
    "question": "Should public high school students in the United States be required to pass standardized exit exams to graduate?",
    "content": {
        "source_1": "Warren, John Robert; Grodsky, Eric; Kalogrides, Demetra. “State High School Exit Examinations and High School Completion.” Sociology of Education, 81(2), 2008. — Using national data and quasi-experimental comparisons across states and cohorts, the authors find that adopting exit exams is associated with statistically significant declines in high school completion, with larger negative effects for historically disadvantaged groups (e.g., Black and Latino students and low-achievers).",
        "source_2": "Clark, Damon; Martorell, Paco. “The Signaling Value of a High School Diploma.” Journal of Political Economy, 122(2), 2014. — Exploiting Texas’s exit-exam-based diploma requirement with a regression discontinuity design, the study finds no discrete improvement in labor market outcomes at the pass/fail threshold, suggesting that conditioning graduation on passing standardized exit exams provides little to no signaling payoff in earnings or employment for marginal students.",
        "source_3": "Bishop, John H. “The Effect of National Standards and Curriculum-Based Exams on Achievement.” American Economic Review: Papers and Proceedings, 87(2), 1997. — Cross-national evidence indicates that systems employing external, curriculum-based exit examinations tend to produce higher student achievement (e.g., in math and science) than systems without such exams, consistent with the view that exit exams raise expectations and instructional focus.",
        "source_4": "Human Resources Research Organization (HumRRO). “Evaluation of the California High School Exit Examination (CAHSEE): 2008 Annual Report.” Prepared for the California Department of Education, 2008. — The official evaluation documents large subgroup disparities in first-time pass rates (e.g., lower rates for English learners, students with disabilities, and Black/Latino students), highlighting concerns that a uniform exit exam disproportionately screens out marginalized students.",
        "source_5": "Center on Education Policy. “State High School Exit Exams: A Policy in Transition.” 2012. — This national policy review reports that the number of states requiring exit exams peaked and then began to decline as states shifted toward end-of-course tests or multiple measures; the report cites limited evidence that exit exams boost overall achievement and raises concerns about unintended consequences for equity and graduation.",
        "source_6": "Human Resources Research Organization (HumRRO). “Evaluation of the California High School Exit Examination (CAHSEE): 2010 Annual Report.” Prepared for the California Department of Education, 2010. — Tracking cohorts over time, the evaluation finds substantial increases in both first-time and cumulative pass rates as districts aligned instruction and expanded supports, suggesting that exit exams can spur system responses that improve minimum competency attainment."
    }
}