{
    "question": "Should the Schengen Agreement be dissolved?",
    "content": {
        "source_1": "Europol — EU Terrorism Situation and Trend Reports (TE-SAT), various years. Europol’s analyses of attacks such as Paris (2015) and Brussels (2016) document how extremist networks exploited ease of intra-Schengen movement and fraudulent documents to operate across borders, a point often cited by proponents of restoring permanent national border controls. https://www.europol.europa.eu/publications-events/publications",
        "source_2": "European Commission — “Back to Schengen – A Roadmap” (2016). The Commission estimated that the reintroduction of internal border controls would cost the EU economy between €5–18 billion annually through delays, supply-chain frictions, and commuter disruption, evidence commonly used to argue against dissolving Schengen. https://eur-lex.europa.eu",
        "source_3": "Court of Justice of the European Union — Press release and judgments on internal border controls under the Schengen Borders Code (26 April 2022). The CJEU clarified that prolonged internal border checks are unlawful unless new serious threats arise, while several member states have nonetheless maintained long-running checks—evidence used by critics to claim the system is structurally strained and unsustainable. https://curia.europa.eu",
        "source_4": "eu-LISA — Schengen Information System (SIS) annual statistics. SIS underpins Schengen police cooperation with billions of searches and hundreds of thousands of “hits” on alerts each year; analysts warn that dismantling Schengen would undermine this cross-border law-enforcement backbone and reduce collective security. https://www.eulisa.europa.eu/publications-reports/sis-ii-statistics",
        "source_5": "European Commission (Eurobarometer) — Public opinion on free movement. Eurobarometer surveys consistently show strong public support (around 80% in recent years) for the free movement of people within the EU, a rights-based and political argument against dissolving Schengen. https://europa.eu/eurobarometer",
        "source_6": "European Council — COVID-19: Borders, travel and transport (policy timeline, 2020–2021). During the pandemic, many member states reinstated internal border checks and restrictions, and the EU introduced “green lanes” to keep goods moving—evidence cited by proponents of dissolution who argue that crises repeatedly force de facto suspensions and that permanent national control would be clearer and more manageable. https://www.consilium.europa.eu/en/policies/coronavirus/covid-19-travel-and-transport/"
    }
}