{
    "question": "Should creationism be taught in schools?",
    "content": {
        "source_1": "Edwards v. Aguillard, 482 U.S. 578 (1987) — U.S. Supreme Court struck down a Louisiana law requiring “creation science” be taught alongside evolution in public school science classes, holding it violated the Establishment Clause. Establishes that mandating creationism in science curricula is unconstitutional in U.S. public schools.",
        "source_2": "Kitzmiller v. Dover Area School District, 400 F. Supp. 2d 707 (M.D. Pa. 2005) — Federal court ruled “intelligent design” is a form of creationism, is not science, and its inclusion in biology class policy was unconstitutional. Details why presenting creationism/ID as science in public schools violates church–state separation.",
        "source_3": "Pew Research Center (2005 national survey) — Reported that nearly two-thirds (about 64%) of Americans favored teaching creationism alongside evolution in public schools. Provides evidence of substantial public support for including creationism, reflecting a democratic/parental preference perspective.",
        "source_4": "National Academy of Sciences and Institute of Medicine (2008), Science, Evolution, and Creationism — Explains the extensive evidence for evolution and concludes creationism/ID are religious doctrines, not science, and therefore should not be taught as science in public school science classes. Represents the scientific consensus against teaching creationism in science courses.",
        "source_5": "Louisiana Science Education Act, La. Rev. Stat. §17:285.1 (enacted 2008) — Allows teachers to use supplemental materials to help students “analyze and critique” scientific theories, explicitly naming evolution among topics. Supporters cite academic freedom; critics argue it opens a pathway for creationist materials. Shows a policy mechanism used by proponents to introduce debates around evolution.",
        "source_6": "UK Department for Education (2014 policy clarification for academies and free schools) — Requires that state-funded schools must not teach creationism as scientific fact; permits discussion of creationism in religious education but not as evidence-based science. Offers an international policy stance rejecting creationism in science classes while allowing it in comparative religion contexts."
    }
}