{
    "question": "Is it sometimes right for the government to restrict freedom of speech?",
    "content": {
        "source_1": "Brandenburg v. Ohio, 395 U.S. 444 (1969). U.S. Supreme Court held that government may restrict advocacy only when it is directed to inciting or producing imminent lawless action and is likely to produce such action—recognizing narrow, safety-based limits on speech.",
        "source_2": "European Court of Human Rights, Garaudy v. France (dec.), no. 65831/01, 2003. The Court upheld France’s criminalization of Holocaust denial, finding such expression falls outside Convention protection (via Article 17) and that restrictions can be justified to protect the rights of others and public order.",
        "source_3": "UN Human Rights Committee, General Comment No. 34 on Article 19 ICCPR (CCPR/C/GC/34, 2011). International human rights law permits speech restrictions only if they meet legality, legitimate aim, and necessity/proportionality tests—setting a high but affirmative standard for when limits can be right.",
        "source_4": "Loomba, S., de Figueiredo, A., Piatek, S. J., de Graaf, K., & Larson, H. J. (2021). Measuring the impact of COVID-19 vaccine misinformation on vaccination intent in the UK and USA. Nature Human Behaviour, 5, 337–348. DOI: 10.1038/s41562-021-01056-1. Empirical evidence that exposure to misinformation measurably reduces vaccine intention, cited by proponents of targeted restrictions to mitigate public-health harm.",
        "source_5": "King, G., Pan, J., & Roberts, M. E. (2013). How Censorship in China Allows Government Criticism but Silences Collective Expression. American Political Science Review, 107(2), 1–18. DOI: 10.1017/S0003055413000014. Finds state censorship disproportionately targets posts about collective action, illustrating how speech restrictions can be abused to entrench power rather than protect the public.",
        "source_6": "United States v. Alvarez, 567 U.S. 709 (2012). U.S. Supreme Court struck down the Stolen Valor Act, ruling that even knowingly false statements are not categorically unprotected; warns that government restrictions on speech risk overbreadth and viewpoint discrimination."
    }
}