{
    "question": "Is refusing to stand for the national anthem an appropriate form of protest?",
    "content": {
        "source_1": "West Virginia State Board of Education v. Barnette, 319 U.S. 624 (1943) — The U.S. Supreme Court held that government cannot compel students to salute the flag or recite the Pledge, establishing that abstaining from patriotic rituals is protected expression. This supports the view that refusing to stand for the anthem is a constitutionally protected form of protest against government compulsion.",
        "source_2": "36 U.S.C. § 301 (U.S. Flag Code) — The statute states that during the National Anthem, persons present should stand at attention (and, if applicable, salute). The Flag Code is advisory and carries no penalties, but it articulates a widely cited norm of expected behavior, often invoked by critics to argue such protests are inappropriate even if legal.",
        "source_3": "Pew Research Center (2018), analysis of views on athletes kneeling during the anthem — Survey data found that a majority of Americans at the time considered kneeling during the anthem inappropriate, with sharp partisan, racial, and age divides. This is evidence that many perceive the protest as unsuitable or disrespectful.",
        "source_4": "NFL policy announcements (May–July 2018) — NFL owners approved a policy to require players on the field to stand for the anthem or for teams to face fines; after an NFLPA grievance, the policy was put on hold pending negotiations. This illustrates that private employers may regulate workplace protest and that the appropriateness of anthem protests is contested in employment contexts.",
        "source_5": "Nate Boyer (Army veteran and former NFL player), Army Times open letter (Aug. 2016) and subsequent meeting with Colin Kaepernick — Boyer advised that kneeling (rather than sitting) would honor service members while still protesting racial injustice; Kaepernick adopted kneeling. This provides a veteran’s perspective that the act can be a respectful, appropriate form of protest.",
        "source_6": "New York Times (June 5, 2020), “N.F.L. Commissioner Roger Goodell Says League Was Wrong About National Anthem Protests” — Goodell stated the league “was wrong for not listening to NFL players earlier” and expressed support for peaceful protest, indicating an institutional shift toward viewing anthem protests as appropriate."
    }
}