{
    "question": "Should the feminist movement seek a ban on pornography?",
    "content": {
        "source_1": "Wright, Paul J.; Tokunaga, Robert S.; Kraus, Allison (2016). A Meta-Analysis of Pornography Consumption and Actual Acts of Sexual Aggression in General Population Studies. Journal of Communication, 66(1), 183–205. DOI: 10.1111/jcom.12201. Link: https://academic.oup.com/joc/article/66/1/183/4081071 - Finds a significant positive association between pornography consumption and perpetration of sexual aggression in general-population studies, evidence often cited by those arguing the feminist movement should pursue stronger restrictions or bans.",
        "source_2": "Diamond, Milton; Uchiyama, Ayako (1999). Pornography, Rape and Sex Crimes in Japan. International Journal of Law and Psychiatry, 22(1), 1–22. https://www.sciencedirect.com/science/article/pii/S0160252798000395 - Reports that as access to sexually explicit material expanded in Japan, rates of rape and some sex crimes declined, challenging the premise that pornography increases sexual violence and undercutting arguments for bans.",
        "source_3": "American Booksellers Ass’n, Inc. v. Hudnut, 771 F.2d 323 (7th Cir. 1985), aff’d, 475 U.S. 1001 (1986). Case text: https://law.justia.com/cases/federal/appellate-courts/F2/771/323/34128/ - Struck down a MacKinnon/Dworkin-inspired anti-pornography civil rights ordinance as unconstitutional viewpoint discrimination, indicating that sweeping bans framed as feminist policy face serious First Amendment barriers and could suppress protected speech.",
        "source_4": "Dines, Gail (2010). Pornland: How Porn Has Hijacked Our Sexuality. Beacon Press. https://www.beacon.org/Pornland-P892.aspx - A leading anti-porn feminist argues that mainstream pornography normalizes misogyny and harms women’s status; she urges aggressive policy responses, including prohibitions, aligning with calls for the feminist movement to seek bans.",
        "source_5": "Strossen, Nadine (1995/2000). Defending Pornography: Free Speech, Sex, and the Fight for Women’s Rights. NYU Press. https://nyupress.org/9780814774697/defending-pornography/ - From a feminist civil-liberties perspective, contends that censorship of pornography undermines women’s equality and autonomy and that the feminist movement should favor free-speech–compatible strategies over bans.",
        "source_6": "Taormino, Tristan; Penley, Constance; Parreñas Shimizu, Celine; Miller-Young, Mireille (eds.) (2013). The Feminist Porn Book: The Politics of Producing Pleasure. The Feminist Press. Google Books: https://books.google.com/books?id=WMZzAgAAQBAJ - Documents feminist and queer-led porn production emphasizing consent, fair labor, and diverse representation, offering an alternative strategy to prohibition by reforming production practices rather than seeking bans."
    }
}