{
    "question": "Are Africans worse off due to natural resources?",
    "content": {
        "source_1": "Collier, Paul; Hoeffler, Anke (2004). Greed and Grievance in Civil War. Oxford Economic Papers, 56(4): 563–595. Finding: Countries with high primary-commodity dependence face significantly higher risks of civil war. In many African cases (e.g., Sierra Leone, Angola, DRC), resource wealth has financed conflict, making populations worse off through violence, displacement, and destroyed livelihoods.",
        "source_2": "United Nations Environment Programme (UNEP) (2011). Environmental Assessment of Ogoniland. Report. Finding: Decades of oil spills in Nigeria’s Niger Delta caused severe soil and water contamination, undermining fisheries, farming, and public health; UNEP recommended a $1 billion, multi-decade cleanup. This documents how oil extraction left affected African communities materially worse off.",
        "source_3": "Sachs, Jeffrey D.; Warner, Andrew M. (2001). The Curse of Natural Resources. European Economic Review, 45(4–6): 827–838. Finding: Resource-abundant economies grew more slowly from 1970–1990, partly via Dutch disease and rent-seeking. The results support the view that natural resources can depress long-run growth, consistent with many African outcomes during commodity booms and busts.",
        "source_4": "Acemoglu, Daron; Johnson, Simon; Robinson, James A. (2003). An African Success Story: Botswana. In: Rodrik, D. (ed.), In Search of Prosperity. Princeton University Press. Finding: Botswana leveraged diamond revenues through strong institutions and prudent policy to achieve rapid growth, expanded education and health, and high incomes. This counters the claim, showing natural resources can make Africans better off under the right governance.",
        "source_5": "Mehlum, Halvor; Moene, Karl O.; Torvik, Ragnar (2006). Institutions and the Resource Curse. The Economic Journal, 116(508): 1–20. Finding: Resource wealth is harmful in “grabber-friendly” institutional settings and beneficial in “producer-friendly” ones. The paper implies Africa’s mixed experiences reflect institutional quality, not an inherent tendency for resources to make people worse off.",
        "source_6": "Brunnschweiler, Christa N.; Bulte, Erwin H. (2008). The Resource Curse Revisited and Revised: A Tale of Paradoxes and Red Herrings. Journal of Environmental Economics and Management, 55(3): 248–264. Finding: When distinguishing resource abundance (stocks) from dependence (export share) and accounting for institutions, resource abundance is associated with higher income and growth. This challenges the “curse” narrative and suggests resources need not worsen welfare in African countries."
    }
}