{
    "question": "Should children be allowed to inherit vast wealth?",
    "content": {
        "source_1": "Luthar, S. S., & Latendresse, S. J. (2005). Children of the affluent: challenges to well-being. Development and Psychopathology, 17(1), 49–90. Evidence: Studies of highly affluent adolescents find elevated rates of depression, anxiety, and substance use compared to national norms, linked to achievement pressures and emotional distancing in wealthy families. This supports the view that growing up with great wealth can harm children’s mental health and development.",
        "source_2": "OECD (2021). Inheritance Taxation in OECD Countries. Evidence: Cross-country analysis finds that inheritances and gifts are highly concentrated among the wealthiest households and tend to amplify wealth inequality and reduce equality of opportunity. The report concludes that well-designed inheritance taxation can mitigate dynastic concentration without large efficiency costs, supporting the claim that large bequests can damage society by entrenching inequality.",
        "source_3": "Anderson, R. C., & Reeb, D. M. (2003). Founding-family ownership and firm performance. Journal of Finance, 58(3), 1301–1328. Evidence: S&P 500 firms with founding-family ownership exhibit superior performance and valuation relative to nonfamily firms, consistent with patient capital and long-term governance benefits. This perspective suggests that enabling intergenerational transfers can benefit the wider economy by sustaining effective family-controlled enterprises.",
        "source_4": "Bennedsen, M., Nielsen, K. M., Pérez-González, F., & Wolfenzon, D. (2007). Inside the Family Firm: The Role of Families in Succession Decisions and Performance. Quarterly Journal of Economics, 122(2), 647–691. Evidence: Using Danish data, firms that pass CEO control to a family member experience significant declines in operating performance versus professional successions. This indicates potential social costs from dynastic inheritance when it leads to less competent leadership.",
        "source_5": "Akee, R., Copeland, W., Keeler, G., Angold, A., & Costello, E. J. (2010). Parents’ Incomes and Children’s Outcomes: A Quasi-Experiment Using Transfer Payments from an American Indian Casino. American Economic Journal: Applied Economics, 2(1), 86–115. Evidence: Exogenous increases in household income improved children’s behavioral health and educational outcomes. This challenges the claim by showing that substantial financial resources can enhance, rather than damage, children’s development.",
        "source_6": "Kopczuk, W., & Slemrod, J. (2003). Dying to Save Taxes: Evidence from Estate Taxation. Review of Economics and Statistics, 85(2), 391–408. Evidence: Estate tax changes induce significant timing and avoidance behavior around death and bequests, implying high avoidance responses and planning costs. This suggests that strict limits on inheritance may be difficult to enforce and could generate distortions without achieving intended societal benefits."
    }
}