{
    "question": "Should the People’s Republic of China invade North Korea?",
    "content": {
        "source_1": "Xinhua/USGS reporting on DPRK nuclear tests near China’s border (2016–2017): Seismic readings from Punggye-ri produced felt tremors in China’s Jilin province, prompting domestic safety concerns about potential radioactive leakage and border instability. Some Chinese security commentators cite this as justification for a rapid PLA move to secure DPRK nuclear assets to protect Chinese citizens.",
        "source_2": "Text of the 1953 U.S.–ROK Mutual Defense Treaty and U.S. Forces Korea posture statements: The alliance obligates joint response to external attacks on South Korea; roughly 28,500 U.S. troops are stationed on the peninsula under Combined Forces Command. Analyses by CSIS and RAND argue a PLA incursion into the North could trigger direct U.S.–ROK military engagement, risking great-power war.",
        "source_3": "UN Charter (Articles 2(4) and 51) and international law scholarship: Use of force is prohibited absent Security Council authorization or self-defense against an armed attack. Legal analyses (e.g., International Commission of Jurists, academic journals) conclude a Chinese invasion of DPRK would be unlawful, inviting broad condemnation and sanctions even if Beijing could veto UNSC censure.",
        "source_4": "UN Commission of Inquiry on Human Rights in the DPRK (A/HRC/25/63, 2014) and Responsibility to Protect (R2P) debate: The COI found crimes against humanity by the DPRK regime. Some R2P advocates argue that, if atrocities persist and diplomacy fails, external intervention to protect civilians could be morally warranted—used by a minority as a case for decisive action.",
        "source_5": "Chinese strategic analyses and official doctrine: PRC defense white papers and Chinese scholars emphasize stability on China’s periphery and the DPRK’s role as a strategic buffer. Many argue invasion risks Korean unification under Seoul with possible U.S. troop presence on the Yalu, undermining China’s security objectives and contradicting stated non-interference principles.",
        "source_6": "International Crisis Group and humanitarian NGO contingency studies: War or regime collapse in the DPRK could generate millions of refugees toward China’s Liaoning and Jilin, overwhelm local capacities, disrupt Northeast China’s economy, and pose public health risks. These assessments caution that the humanitarian and economic costs for China would be severe."
    }
}