{
    "question": "Should the federal minimum wage be increased?",
    "content": {
        "source_1": "Congressional Budget Office (2019). “The Effects on Employment and Family Income of Increasing the Federal Minimum Wage.” Evidence: A $15 federal minimum wage by 2025 would raise wages for about 17 million workers who would otherwise earn less and lift roughly 1.3 million people out of poverty; it would also affect prices and federal spending/taxes via reduced means‑tested benefits and higher government labor costs. Perspective: Highlights anti-poverty gains alongside macro-fiscal trade-offs.",
        "source_2": "Cengiz, Dube, Lindner, and Zipperer (2019, Quarterly Journal of Economics). “The Effect of Minimum Wages on Low-Wage Jobs.” Evidence: Using U.S. data from 1979–2016, employment around the new minimum shows no significant net losses, while wages at the bottom rise substantially, implying that higher minimums can boost low-end pay without cutting overall low-wage job counts. Perspective: Supports increases based on minimal employment impacts and clear wage gains.",
        "source_3": "Jardim, Long, Plotnick, van Inwegen, Vigdor, and Wething (2017, NBER Working Paper 23532; subsequent revisions). “Minimum Wage Increases, Wages, and Low-Wage Employment: Evidence from Seattle.” Evidence: The increase to $13 reduced hours worked by low-wage workers by about 9% and lowered their average monthly earnings by roughly $125, indicating that sharp hikes can reduce hours and take-home pay for some workers. Perspective: Cautions that large, rapid increases can harm intended beneficiaries.",
        "source_4": "Derenoncourt and Montialoux (2021, Quarterly Journal of Economics). “Minimum Wages and Racial Inequality.” Evidence: The 1967 expansion of federal minimum wage coverage accounts for about 20% of the late-1960s decline in the Black–white earnings gap, with little adverse effect on adult employment, suggesting equity benefits from higher minimums. Perspective: Argues increases can reduce racial wage disparities.",
        "source_5": "Luca and Luca (2019, Harvard Business School Working Paper). “Survival of the Fittest: The Impact of the Minimum Wage on Firm Exit.” Evidence: A $1 increase in the minimum wage raised the closure risk of lower-rated (e.g., 3.5-star) restaurants by roughly 10–14%, while higher-rated establishments were largely unaffected, implying uneven small-business impacts. Perspective: Warns that increases may accelerate exit among more marginal firms."
    }
}