{
    "question": "Should arranged marriages in EU countries be banned?",
    "content": {
        "source_1": "Council of Europe, Convention on preventing and combating violence against women and domestic violence (Istanbul Convention) and Explanatory Report (2011). Article 37 requires criminalising forced marriage, while the Explanatory Report clarifies that arranged marriages are not the object of this provision so long as both parties give full and free consent. This indicates European human-rights standards distinguish arranged from forced marriage and would weigh against a blanket ban on arranged marriages. https://rm.coe.int/168008482e (Convention); see Explanatory Report on Article 37",
        "source_2": "European Institute for Gender Equality (EIGE), “Forced marriage in the EU: definitions, data and practices” (various briefs and reports, 2021–2023). EIGE documents persistent underreporting of forced marriage in EU Member States and stresses that social/familial pressure often blurs the line between “arranged” and “forced,” making genuine consent hard to verify in practice. This evidence can be used to argue that allowing arranged marriages creates loopholes that enable coercion. https://eige.europa.eu/gender-based-violence/what-forced-marriage",
        "source_3": "UK Government, Forced Marriage Unit (FMU), Annual statistics and policy updates (e.g., 2018–2023). FMU data consistently show limited criminal prosecutions relative to the number of cases, with many victims preferring civil protection orders; stakeholders warn that criminalisation alone can drive abuse underground and deter reporting. This suggests outright bans may be ineffective and counterproductive. https://www.gov.uk/government/collections/forced-marriage-unit-statistics",
        "source_4": "European Parliament, Resolution of 11 June 2013 on ending early and forced marriage (2012/2012(INI)). The Parliament condemns forced marriage, calls for criminalisation and robust prevention, and notes that marriages described as “arranged” can amount to forced marriage when consent is vitiated by pressure. This supports a more restrictive stance and is cited by advocates who argue for prohibiting arranged marriages to prevent coercion. https://www.europarl.europa.eu/doceo/document/TA-7-2013-0251_EN.html",
        "source_5": "European Court of Human Rights, B and L v. United Kingdom (2005) and O’Donoghue and Others v. United Kingdom (2010). The Court held that states must not impose disproportionate or blanket impediments to the right to marry under Article 12 ECHR; restrictions require strong, individualized justification. This jurisprudence suggests a categorical ban on arranged marriages in the EU would likely be deemed overbroad and incompatible with fundamental rights. https://hudoc.echr.coe.int",
        "source_6": "Gill, Aisha K. and Sundari Anitha, “Forced Marriage” (Routledge, 2011) and related peer‑reviewed work. Their research distinguishes consensual arranged marriages from forced marriages, cautions against conflating the two, and recommends targeting coercion rather than prohibiting culturally embedded, consent-based arrangements. This scholarship argues against a blanket ban and for nuanced, victim-centered enforcement. https://www.routledge.com/Forced-Marriage/Gill-Anitha/p/book/9781138641273"
    }
}