{
    "question": "Should sex education be made mandatory in schools?",
    "content": {
        "source_1": "UNESCO (2018). International technical guidance on sexuality education: An evidence-informed approach (revised edition). UNESCO/UNAIDS/UNFPA/UNICEF/UN Women/WHO. Synthesis of global studies finds comprehensive sexuality education can delay sexual initiation, reduce risky sexual behaviors, and increase condom/contraceptive use, while improving knowledge and gender-equitable attitudes. https://unesdoc.unesco.org/ark:/48223/pf0000260770",
        "source_2": "Kohler, P. K., Manhart, L. E., & Lafferty, W. E. (2008). Abstinence-only and comprehensive sex education and the initiation of sexual activity and teen pregnancy. Journal of Adolescent Health, 42(4), 344–351. U.S. observational analysis shows comprehensive sex education is associated with lower likelihood of teen pregnancy compared with abstinence-only or no sex education, without increasing sexual activity. https://www.jahonline.org/article/S1054-139X(07)00538-6/abstract",
        "source_3": "Mason-Jones, A. J., Sinclair, D., Mathews, C., Kagee, A., Hillman, A., & Lombard, C. (2016). School-based interventions for preventing HIV, sexually transmitted infections, and pregnancy. Cochrane Database of Systematic Reviews, Issue 11, CD006417. Systematic review of randomized and cluster trials finds limited or no consistent effects on biological outcomes (STIs, pregnancy), suggesting education alone may be insufficient or uneven in effectiveness. https://www.cochranelibrary.com/cdsr/doi/10.1002/14651858.CD006417.pub3/full",
        "source_4": "Ruse, C., & Hasson, M. (2019). Sex Education in Public Schools: Sexualization of Children and LGBT Indoctrination. The Heritage Foundation. Argues against mandating comprehensive sex ed on grounds of parental rights, age-appropriateness, and ideological content; favors opt-in policies and abstinence-centered “sexual risk avoidance” approaches. https://www.heritage.org/education/report/sex-education-public-schools-sexualization-children-and-lgbt-indoctrination",
        "source_5": "National Conference of State Legislatures (NCSL) (updated regularly). State Policies on Sex Education in Schools. Compiles current state statutes showing a patchwork of requirements (e.g., medical accuracy provisions, parental opt-in/opt-out rules, and varying mandates), highlighting how a universal mandate would intersect with existing state and parental consent laws. https://www.ncsl.org/research/health/state-policies-on-sex-education-in-schools.aspx",
        "source_6": "Centers for Disease Control and Prevention (CDC) (2024). Sexually Transmitted Infections Surveillance, 2022. Reports record-high STI rates in the U.S., with adolescents and young adults (15–24) accounting for nearly half of new infections and sharp increases in congenital syphilis—evidence cited by public health advocates for strengthening school-based sexual health education. https://www.cdc.gov/std/statistics/2022/overview.htm"
    }
}