{
    "question": "Should aid be tied to human rights?",
    "content": {
        "source_1": "Schimmelfennig, Frank, and Ulrich Sedelmeier. “Governance by Conditionality: EU Rule Transfer to the Candidate Countries of Central and Eastern Europe.” Journal of European Public Policy, 2004. — Finds that clear, credible conditionality tied to substantial benefits (EU accession) spurred meaningful human-rights and democratic reforms in applicant states, suggesting conditional incentives can work when stakes and enforcement are high.",
        "source_2": "Millennium Challenge Corporation (MCC). “The MCC Effect: Incentives for Reform.” MCC program materials and country case notes, various years. — Documents instances where governments pursued policy and legal reforms to pass governance and civil liberties indicators to qualify for MCC compacts, illustrating a “selectivity/conditionality” model that can encourage rights-respecting behavior without across-the-board aid cutoffs.",
        "source_3": "UN OCHA. “OCHA on Message: Humanitarian Principles.” 2012. — Emphasizes that humanitarian aid must be neutral, impartial, and independent; warns that tying life-saving assistance to political conditions (including human-rights benchmarks) can jeopardize access, endanger staff and civilians, and undermine trust with all parties to a conflict.",
        "source_4": "Easterly, William. The White Man’s Burden. Penguin Press, 2006. — Argues that decades of donor conditionality have largely failed because donors rarely sustain cutoffs and recipients can substitute or make superficial promises; conditionality often lacks credibility and thus does not reliably produce governance or human-rights improvements.",
        "source_5": "Reuters. “U.S. to withhold $85 million in military aid to Egypt over human rights concerns.” Sept. 2023. — Reports that Washington withheld a small portion of Egypt’s $1.3 billion in annual security assistance while releasing most funds; rights groups noted limited leverage and minimal human-rights change, highlighting the problem of inconsistent, politically constrained enforcement of human-rights conditions.",
        "source_6": "Overseas Development Institute (ODI). “The impact of the 2013/14 suspension of budget support to Malawi.” ODI analysis, 2014–2016. — Finds that abrupt donor suspensions of general budget support (after the “cashgate” scandal) triggered fiscal stress, delays in public-sector wages, and cuts to basic services, indicating that punitive conditionality can disproportionately harm civilians and weaken state capacity without guaranteeing rights reforms."
    }
}