{
    "question": "Should same-sex relationships have the same legal status as heterosexual relationships under EU law?",
    "content": {
        "source_1": "Court of Justice of the EU, Coman and Others, C‑673/16 (Judgment of 5 June 2018). Held that “spouse” in Directive 2004/38 on free movement includes a same‑sex spouse, requiring Member States to recognize such marriages for the purpose of residence rights, even if they do not allow same‑sex marriage domestically. Evidence for partial EU‑law equality via free movement, without mandating national marriage equality. (curia.europa.eu/juris/document/document.jsf?docid=202542&doclang=EN)",
        "source_2": "Court of Justice of the EU, V.M.A. v Stolichna Obsthina (Pancharevo), C‑490/20 (Judgment of 14 December 2021). Required Bulgaria to issue identity documents to a child with two mothers listed on a Spanish birth certificate and to recognize the parent‑child relationship for the child’s EU free‑movement rights. Supports cross‑border recognition of same‑sex families for EU citizenship/free‑movement purposes, short of imposing full family‑law recognition. (curia.europa.eu/juris/document/document.jsf?docid=251254&doclang=EN)",
        "source_3": "EU primary law constraints: Charter of Fundamental Rights art. 9 (right to marry “in accordance with national laws”), art. 21 (ban on discrimination incl. sexual orientation), TEU art. 4(2) (national identity), and TFEU art. 81 (family‑law judicial cooperation). Taken together, these indicate the EU lacks general competence to harmonize marriage/family status, leaving core status definitions to Member States while prohibiting discrimination within the scope of EU law. (Charter text: eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:12012P/TXT)",
        "source_4": "CJEU line of cases on employment benefits: Maruko, C‑267/06 (2008); Römer, C‑147/08 (2011); Hay, C‑267/12 (2013). Interpreting Directive 2000/78, the Court held employers/pension schemes must grant same‑sex registered partners or spouses equal survivor’s pensions, leave, or bonuses where national law places them in a situation comparable to marriage. Evidence that EU equality law can require equal treatment of same‑sex relationships in employment‑related benefits. (e.g., Maruko: curia.europa.eu/juris/document/document.jsf?docid=72002&doclang=EN)",
        "source_5": "Court of Justice of the EU, Ratzenböck and Seyrer, C‑201/15 (Judgment of 24 November 2016). Upheld Austria’s restriction of registered partnerships to same‑sex couples and found an opposite‑sex couple was not in a comparable situation to married couples; no EU‑law discrimination arose. Evidence that EU law allows differential treatment tied to nationally defined family statuses and does not mandate uniform status across all contexts. (curia.europa.eu/juris/document/document.jsf?docid=185256&doclang=EN)",
        "source_6": "European Commission, Proposal for a Council Regulation on jurisdiction, applicable law, recognition of decisions and acceptance of authentic instruments in matters of parenthood and on the creation of a European Certificate of Parenthood, COM(2022) 695 final (7 December 2022). Seeks EU‑wide recognition of parenthood established in one Member State, regardless of the parents’ sex, to ensure children’s rights across borders. Evidence of an EU policy push toward equal cross‑border legal effects for same‑sex families, highlighting current gaps absent new legislation. (eur-lex.europa.eu/legal-content/EN/TXT/?uri=COM:2022:695:FIN)"
    }
}