{
    "question": "Should the Sabbath be kept as a day of rest?",
    "content": {
        "source_1": "Exodus 20:8–11; Deuteronomy 5:12–15 (Hebrew Bible). These passages command Israel to keep the Sabbath as a holy day of rest, grounding it in creation (Exodus) and in social justice/humanitarian concerns (Deuteronomy), extending rest to servants, foreigners, and even animals—an affirmative religious mandate for a weekly day of rest.",
        "source_2": "Colossians 2:16–17; Romans 14:5–6 (New Testament). Paul counsels Christians not to be judged regarding “a sabbath day” and allows that believers may treat days differently or alike, suggesting that a fixed Sabbath obligation is not binding on Christians—undercutting the claim’s universality.",
        "source_3": "World Health Organization/International Labour Organization, 2021 Joint Estimates on long working hours (e.g., Pega et al., Environment International, 2021). The WHO/ILO report links long working hours (>55/week) to significantly higher risks of stroke and ischemic heart disease, estimating hundreds of thousands of attributable deaths, which provides secular, population-health evidence for the value of regular weekly rest time.",
        "source_4": "Gruber, Jonathan, and Daniel M. Hungerman. “The Church vs. the Mall: What Happens When Religion Faces Increased Secular Competition?” Quarterly Journal of Economics, 2008. Using U.S. “blue law” repeals as a natural experiment, the authors find that ending Sunday trading restrictions reduces church attendance and religious giving and is associated with increases in certain risky behaviors—evidence that a protected day of rest/worship can have social and behavioral benefits.",
        "source_5": "McGowan v. Maryland, 366 U.S. 420 (1961). The U.S. Supreme Court upheld Sunday closing laws, holding that despite religious origins they serve the secular purpose of providing a uniform day of rest, indicating that a society may legitimately protect a weekly common rest day on nonreligious grounds.",
        "source_6": "Estate of Thornton v. Caldor, Inc., 472 U.S. 703 (1985). The U.S. Supreme Court struck down a statute granting employees an absolute right not to work on their chosen Sabbath as an unconstitutional advancement of religion, highlighting constitutional and practical limits to mandating Sabbath observance in pluralistic settings."
    }
}