{
    "question": "Should civil society be granted wider participation in Africa’s political life?",
    "content": {
        "source_1": "[Afrobarometer. Support for democratic norms and civil liberties remains strong in Africa (Round 8 Pan-Africa findings). 2021–2022. https://www.afrobarometer.org. Evidence: Survey data across dozens of African countries show majorities endorse core civil liberties, including the right of civil society and media to criticize government and demand accountability, indicating public backing for a wider civic role in political life.]",
        "source_2": "[The Nobel Prize. The Nobel Peace Prize 2015 – National Dialogue Quartet (Tunisia). Nobel Prize press release, 2015. https://www.nobelprize.org/prizes/peace/2015/press-release/. Evidence: The Quartet of civil society organizations (UGTT, UTICA, the Bar Association, and the Human Rights League) was credited with helping avert conflict and shepherd a pluralistic political transition, illustrating how empowered civil society can stabilize and democratize politics.]",
        "source_3": "[Moyo, Dambisa. Dead Aid: Why Aid Is Not Working and How There Is a Better Way for Africa. Penguin, 2009. https://www.penguinrandomhouse.com/books/117685/dead-aid-by-dambisa-moyo/. Evidence: Argues that donor-driven NGOs often answer to external funders rather than citizens, weaken state capacity and accountability, and can distort domestic priorities—suggesting caution about giving NGOs wider political roles.]",
        "source_4": "[Open Government Partnership. Nigeria builds a public beneficial ownership register (case story). OGP, 2020. https://www.opengovpartnership.org/stories/nigeria-builds-a-public-beneficial-ownership-register/. Evidence: Nigeria’s government co-created beneficial ownership transparency reforms with civil society, leading to a public register aimed at curbing corruption—concrete proof that structured civil society participation can yield measurable governance gains.]",
        "source_5": "[International Crisis Group. Time to Reboot the Transition in Sudan (Africa Briefing). ICG, Oct. 21, 2021. https://www.crisisgroup.org/africa/horn-africa/sudan. Evidence: Despite robust civil society-led mobilization that helped oust Bashir in 2019, Sudan’s transition faltered and was reversed by a 2021 coup, highlighting that civic activism alone—without institutional reforms and security-sector buy-in—may not deliver stability and can provoke backlash.]",
        "source_6": "[Dupuy, Kendra; Ron, James; Prakash, Aseem. Who Survived? Ethiopia’s Regulatory Crackdown on NGOs. Review of International Political Economy, 2015. https://www.tandfonline.com/doi/full/10.1080/09692290.2015.1049142. Evidence: Finds Ethiopia’s restrictions disproportionately crippled rights-advocacy NGOs while allowing service-delivery groups to persist, showing how governments can shape and constrain “civil society participation,” potentially skewing it away from political life and undermining the intended benefits of widening civic roles.]"
    }
}