{
    "question": "Should Sikh school pupils be allowed to carry ceremonial daggers?",
    "content": {
        "source_1": "Supreme Court of Canada — Multani v. Commission scolaire Marguerite-Bourgeoys, 2006 SCC 6. The Court held that a blanket school ban on a Sikh student’s kirpan violated freedom of religion under the Canadian Charter and was not proportionate to safety objectives; it directed accommodation with safeguards (e.g., sealed sheath, worn under clothing). Source: Supreme Court of Canada decision (2006).",
        "source_2": "United States (Ninth Circuit) — Cheema v. Thompson, 67 F.3d 883 (9th Cir. 1995). Applying the Religious Freedom Restoration Act, the court required a California school district to accommodate Sikh students’ kirpans under strict conditions (dulled blade, sewn into sheath, worn under clothing, subject to inspection), showing workable risk-mitigation in schools. Source: U.S. Court of Appeals decision (1995).",
        "source_3": "United Kingdom — Criminal Justice Act 1988, s.139A (bladed articles on school premises). The Act provides statutory defenses for having a bladed article on school premises, including “for religious reasons,” which is widely understood to cover the Sikh kirpan. Source: UK legislation (Criminal Justice Act 1988, s.139A(4)-(5)).",
        "source_4": "England — Department for Education, “Searching, screening and confiscation at school” (July 2022). DfE guidance lists knives/weapons as prohibited items and empowers headteachers to ban, search for, and confiscate them, highlighting that schools can adopt zero-tolerance policies on blades notwithstanding general statutory defenses. Source: UK Department for Education guidance (2022).",
        "source_5": "Australia (New South Wales) — Policy response following a school stabbing (2021). After a high-profile stabbing, NSW temporarily banned all knives in public schools, including kirpans, before later announcing strict conditions to permit kirpans; officials and teachers cited immediate safety risks, while Sikh groups argued for religious accommodation. Source: ABC News Australia and NSW Government announcements (2021).",
        "source_6": "India — Constitution of India, Article 25, Explanation I. The Constitution expressly recognizes that “the wearing and carrying of kirpans shall be deemed to be included in the profession of the Sikh religion,” evidencing the kirpan’s core religious status and informing accommodation debates in institutional settings (including schools). Source: Constitution of India, Article 25."
    }
}