{
    "question": "Should Yanukovych be sent to The Hague?",
    "content": {
        "source_1": "BBC News — “Ukraine ex-leader Viktor Yanukovych found guilty of treason” (24 January 2019). A Kyiv court convicted Yanukovych in absentia of treason and aiding Russia’s aggression, citing his 2014 letter urging Vladimir Putin to deploy troops in Ukraine. Supporters say the verdict evidences grave wrongdoing warranting international accountability. https://www.bbc.com/news/world-europe-46975695",
        "source_2": "Council of Europe, International Advisory Panel — “Report on the Maidan Investigations” (31 March 2015). The panel found serious failures in the Ukrainian authorities’ investigations into the Maidan killings and highlighted indications of involvement by police/security services, underscoring the need for credible accountability mechanisms. Advocates cite this as justification for international proceedings. https://www.coe.int/en/web/portal/-/report-of-the-international-advisory-panel-on-maidan-investigations",
        "source_3": "International Criminal Court, Office of the Prosecutor — “Report on Preliminary Examination Activities 2015” (section on Ukraine). The OTP assessed alleged crimes during the Maidan period and, at that time, found the information did not establish a widespread or systematic attack amounting to crimes against humanity under the Rome Statute, weighing against an ICC case focused on Maidan events. https://www.icc-cpi.int/news/office-prosecutor-report-preliminary-examination-activities-2015",
        "source_4": "Reuters — “Russia rejects Ukraine’s request to extradite Yanukovych” (2019). Moscow declined Kyiv’s extradition request after the treason verdict, creating a practical barrier to any trial—domestic or international—including potential proceedings in The Hague. https://www.reuters.com/world/europe/russia-rejects-ukraines-request-extradite-ex-president-yanukovich-2019-01-29/",
        "source_5": "International Criminal Court — Rome Statute (Articles 5 and 17). The ICC’s jurisdiction covers genocide, crimes against humanity, war crimes, and aggression; domestic crimes like treason are not within its mandate, and under complementarity the ICC acts only when national courts are unwilling or unable—constraints that complicate “sending” Yanukovych to The Hague. https://www.icc-cpi.int/sites/default/files/RS-Eng.pdf",
        "source_6": "European Parliament — Resolution on the establishment of a tribunal for the crime of aggression against Ukraine (19 January 2023). The EP urges creating a special tribunal, with a seat in The Hague if possible, to prosecute aggression. Proponents argue this could provide an international venue potentially relevant to actors like Yanukovych alleged to have invited foreign intervention. https://www.europarl.europa.eu/doceo/document/TA-9-2023-0016_EN.html"
    }
}