{
    "question": "Should cultural property residing in museums be returned to its place of origin?",
    "content": {
        "source_1": "UNESCO 1970 Convention on the Means of Prohibiting and Preventing the Illicit Import, Export and Transfer of Ownership of Cultural Property (and the 1995 UNIDROIT Convention) — establishes that states should prevent illicit trade and enable restitution of unlawfully exported cultural property to countries of origin, providing a legal and ethical foundation for repatriation claims.",
        "source_2": "2002 Declaration on the Importance and Value of Universal Museums (signed by major institutions including the British Museum, Louvre, and the Met) — argues against blanket repatriation, claiming many acquisitions were legal under the laws of their time and that encyclopedic museums serve a global public by contextualizing world cultures side-by-side.",
        "source_3": "U.S. Native American Graves Protection and Repatriation Act (NAGPRA, 1990) — mandates the return of Native American human remains and certain cultural items from federally funded institutions to affiliated tribes; high-profile outcomes like the 2017 reburial of the “Kennewick Man” illustrate that repatriation can rectify historical injustices and is practically implementable.",
        "source_4": "Recent Benin Bronzes restitutions — Germany’s 2021 decision to restitute Benin Bronzes and subsequent returns by several UK and U.S. institutions to Nigeria, alongside plans for the Edo Museum of West African Art in Benin City, demonstrate a growing international norm toward returning colonial-era looted artifacts and enabling source communities to steward them.",
        "source_5": "Domestic legal barriers to deaccession — laws like the UK’s British Museum Act 1963 restrict disposals from national collections, complicating or blocking returns even where moral or diplomatic cases are strong (e.g., the Parthenon Marbles), showing that “must be returned” often conflicts with binding national statutes and property law.",
        "source_6": "Preservation and security concerns in origin countries — the 2003 looting of the Iraq National Museum during conflict is frequently cited by opponents of wholesale repatriation as evidence that returning objects to unstable regions can endanger them; proposed alternatives include long‑term loans, joint stewardship, and regional conservation hubs (e.g., post-restitution loan agreements between Italian authorities and U.S. museums)."
    }
}