{
    "question": "Should the drinking age be lowered from 21 to a younger age?",
    "content": {
        "source_1": "National Highway Traffic Safety Administration (NHTSA). “Minimum Drinking Age Laws Save Lives.” NHTSA analysis estimates that minimum legal drinking age (MLDA) 21 laws have saved tens of thousands of lives since 1975 by reducing alcohol-impaired driving fatalities among youth. https://www.nhtsa.gov/laws-regulations/minimum-legal-drinking-age-21 [Supports keeping 21 based on traffic safety outcomes]",
        "source_2": "Kypri, K., Voas, R. B., Langley, J. D., et al. “Minimum purchasing age for alcohol and traffic crash injuries among 15- to 19-year-olds in New Zealand.” American Journal of Public Health, 2006. After New Zealand lowered its alcohol purchasing age from 20 to 18 in 1999, interrupted time-series analyses found significant increases in alcohol-involved traffic crash injuries among 18–19-year-olds. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1470482/ [Evidence that lowering the age can increase harms]",
        "source_3": "National Institute on Alcohol Abuse and Alcoholism (NIAAA). “Underage Drinking.” NIAAA reports that the brain continues developing into the mid-20s and that people who begin drinking before age 15 are four times more likely to develop alcohol use disorder than those who start at 21 or older. https://www.niaaa.nih.gov/publications/brochures-and-fact-sheets/underage-drinking [Supports keeping 21 based on neurodevelopment and addiction risk]",
        "source_4": "Amethyst Initiative. “Statement.” Over 100 U.S. college and university presidents call for a public debate on MLDA 21, arguing that the current law drives alcohol use underground, fosters dangerous binge drinking, and hampers campus safety efforts; some advocate piloting alternatives (e.g., education-linked licensing at 18). http://www.amethystinitiative.org/statement/ [Argues for reconsideration/lowering on harm-reduction grounds]",
        "source_5": "International Transport Forum/OECD. Road Safety Annual Report (various years). Cross-country data show many nations with MLDA 18 achieve lower young-driver fatality rates than the U.S., which the report attributes to comprehensive measures (e.g., strict BAC limits, strong enforcement, graduated driver licensing), suggesting overall policy bundles—not the drinking age alone—drive outcomes. https://www.itf-oecd.org/road-safety-annual-report-2022 [Suggests lowering could be viable if paired with robust safeguards]",
        "source_6": "Carpenter, C. S., & Dobkin, C. “The Minimum Legal Drinking Age and Public Health.” Journal of Economic Perspectives, 2011. Regression discontinuity evidence shows sharp increases at age 21 in alcohol consumption, mortality, injuries, and crime when legal access begins, indicating legal availability has immediate harms; some interpret this as support for MLDA 21, while others argue it reveals risks of a single abrupt threshold and motivates graduated access earlier. https://www.aeaweb.org/articles?id=10.1257/jep.25.2.133 [Mixed: documents harm at the 21 threshold; implications debated]"
    }
}