{
    "question": "Is hosting the Olympic Games beneficial?",
    "content": {
        "source_1": "UK Department for Culture, Media and Sport (2013–2015), Meta-Evaluation of the Impacts and Legacy of the London 2012 Olympic and Paralympic Games — UK Government report concluding that hosting accelerated East London’s regeneration: millions of tonnes of contaminated soil were cleaned, new transport links and the Queen Elizabeth Olympic Park were delivered, and thousands of new homes and community facilities were created, indicating durable urban-development benefits.",
        "source_2": "Bent Flyvbjerg, Allison Stewart, and Alexander Budzier (2016), The Oxford Olympics Study: Cost and Cost Overrun at the Games — University of Oxford study finding that 100% of Olympic Games run over budget, with an average real cost overrun of around 156%, highlighting that hosts systematically face severe financial risk that can outweigh projected benefits.",
        "source_3": "Ferran Brunet (2002, updated analyses through 2004), The Economic Impact of the Barcelona Olympic Games — Academic and city analyses documenting that Barcelona 1992 catalyzed a sustained rise in international tourism, global city branding, and major waterfront and transport upgrades, suggesting long-run gains when the Games are integrated into a broader urban strategy.",
        "source_4": "Robert A. Baade and Victor A. Matheson (2016), Going for the Gold: The Economics of the Olympics — Journal of Economic Perspectives article reviewing evidence that host cities typically see little to no statistically significant gains in GDP or employment and often experience tourism crowd-out during the event, challenging claims of broad economic benefit.",
        "source_5": "LA84 Foundation and Official LA 1984 Reports; IOC–LA 2028 Host City Agreement (2017) — Documentation showing Los Angeles 1984 generated a surplus of over $200 million that endows youth-sport programs and that a model relying on existing venues and private financing can reduce risk; LA 2028’s plan similarly emphasizes reuse and cost-sharing, indicating the Games can be beneficial under specific governance and infrastructure conditions.",
        "source_6": "Martin Müller et al. (2021), An assessment of the sustainability of the Olympic Games — Nature Sustainability study concluding overall sustainability of recent Games is low, with large carbon footprints driven by venue construction and travel and a declining trend over time, underscoring environmental costs that complicate claims of net benefit."
    }
}