{
    "question": "Should Quebec secede from Canada?",
    "content": {
        "source_1": "Statistics Canada — The Daily (Aug 17, 2022), “English, French and official language minorities in Canada, 2021” (https://www150.statcan.gc.ca/n1/daily-quotidien/220817/dq220817a-eng.htm) - Evidence: Reports a decline in the proportion of people with French as a mother tongue and in the use of French at home, including in Quebec, between 2016 and 2021. Pro-secession advocates cite such trends to argue that sovereignty could better safeguard Quebec’s French language and culture in an English-dominant North America.",
        "source_2": "Supreme Court of Canada, Reference re Secession of Quebec, [1998] 2 S.C.R. 217; and the Clarity Act (S.C. 2000, c. 26) (SCC ruling: https://scc-csc.lexum.com/scc-csc/scc-csc/en/item/1643/index.do; Clarity Act: https://laws-lois.justice.gc.ca/eng/acts/C-31.8/) - Evidence: The SCC held that Quebec cannot unilaterally secede under the Constitution; a “clear majority” on a “clear question” would oblige all parties to negotiate, guided by principles of democracy, federalism, rule of law, and minority rights. The Clarity Act operationalizes this, underscoring significant legal and procedural hurdles to secession.",
        "source_3": "Department of Finance Canada — Major Federal Transfers (Equalization), 2024–25 (https://www.canada.ca/en/department-finance/programs/federal-transfers/major-federal-transfers.html) - Evidence: Quebec is slated to receive roughly $14 billion in Equalization in 2024–25, the largest share among provinces. Opponents argue secession risks substantial fiscal shortfalls or service cuts unless Quebec replaces foregone federal transfers.",
        "source_4": "Revenu Québec — Mission and commitments (https://www.revenuquebec.ca/en/about-us/mission-and-commitments/) - Evidence: Quebec runs its own tax administration and directly collects provincial income tax and consumption taxes. Pro-secession arguments point to such existing state-capacity institutions (e.g., Revenu Québec, Quebec Pension Plan) as building blocks for governing as an independent state.",
        "source_5": "The New York Times (Oct 26, 1995), “Cree Indians Vote to Stay in Canada” (https://www.nytimes.com/1995/10/26/world/cree-indians-vote-to-stay-in-canada.html) - Evidence: On the eve of the 1995 referendum, the Cree of northern Quebec voted overwhelmingly to remain in Canada and asserted a right to stay within Canada if Quebec seceded. This highlights Indigenous rights and territorial claims that could complicate secession and the delineation of Quebec’s borders.",
        "source_6": "Élections Québec — Official results of the 1980 and 1995 referendums (https://www.electionsquebec.qc.ca/en/) - Evidence: The 1980 referendum saw 59.56% vote “No”; in 1995, 50.58% voted “No” and 49.42% “Yes.” Opponents argue these outcomes show Quebecers have not delivered the clear, sustained majority necessary to justify or trigger negotiations for secession."
    }
}