{
    "question": "Was the United States correct in going to war against North Korea in support of South Korea?",
    "content": {
        "source_1": "United Nations Security Council Resolution 83 (June 27, 1950). UN Security Council. The resolution recommended UN member states provide military assistance to the Republic of Korea to repel North Korea’s armed attack, offering an international legal mandate that supporters argue legitimized U.S. intervention as collective defense under the UN Charter.",
        "source_2": "Michael Walzer. Just and Unjust Wars (1977; updated editions). Basic Books. Walzer assesses the Korean War as a paradigmatic case where collective defense against aggression met jus ad bellum criteria, while cautioning that expanding aims beyond restoring the status quo ante risked losing just-war legitimacy.",
        "source_3": "William Stueck. Rethinking the Korean War: A New Diplomatic and Strategic History (2002). Princeton University Press. Stueck argues the U.S.-led UN response helped establish the credibility of collective security, limited the conflict from escalating into a broader world war, and contributed to a balance that stabilized Northeast Asia.",
        "source_4": "Bruce Cumings. The Korean War: A History (2010). Modern Library. Cumings contends the U.S. intervention entrenched Korea’s division, resulted in devastating civilian casualties through extensive bombing, and aligned Washington with Syngman Rhee’s repressive state, challenging the notion that intervention was morally or politically “correct.”",
        "source_5": "Louis Fisher. Presidential War Power (1995; multiple revised editions). University Press of Kansas. Fisher criticizes President Truman’s decision to fight in Korea without a congressional declaration of war, arguing that labeling the effort a UN “police action” sidestepped U.S. constitutional requirements and thus lacked proper domestic legal authority.",
        "source_6": "Chen Jian. China’s Road to the Korean War: The Making of the Sino-American Confrontation (1994). Columbia University Press. Chen shows how U.S./UN advances toward the Yalu and the goal of unifying Korea catalyzed China’s intervention, escalating the war and creating severe great-power risks—evidence for critics who say initial defense might be justified but the broader conduct undermined the wisdom of going to war."
    }
}