{
    "question": "Should military recruitment be allowed in schools?",
    "content": {
        "source_1": "Congressional Research Service (2023) — Recruiting Challenges for the All-Volunteer Force: CRS notes recent recruiting shortfalls and declining eligibility/propensity among youth; access to high schools (including recruiter visits and JROTC) is identified as a key pipeline for sustaining force levels, implying that restricting in-school recruiting could exacerbate national defense manpower challenges.",
        "source_2": "U.S. Department of Veterans Affairs — Post-9/11 GI Bill Overview (current): VA documents that eligible servicemembers receive up to full in‑state public tuition, a monthly housing allowance, and book stipends. Proponents argue that recruiter and ROTC outreach in schools informs students—especially from underserved communities—about these education and career benefits they might not otherwise consider.",
        "source_3": "Heritage Foundation (2011), “Who Serves in the U.S. Military? The Demographics of Enlisted Troops and Officers”: An analysis of recruits’ ZIP‑code incomes and academic indicators finds enlistees disproportionately come from middle‑income neighborhoods and have above‑average educational attainment, countering claims that school-based recruiting primarily exploits the poorest students.",
        "source_4": "ProPublica and Chicago Tribune (2022) — Investigation into JROTC enrollment practices: Reported that some high schools automatically enrolled freshmen into JROTC and that programs were concentrated in schools serving Black and Latino students, raising concerns about coercion, equity, and the appropriateness of military pathways embedded in school schedules.",
        "source_5": "American Civil Liberties Union (2019–2023) — Student Privacy and Military Recruiters in Schools (Know‑Your‑Rights briefings): Explains that under 20 U.S.C. § 7908, schools must provide student “directory information” to military recruiters unless parents or students opt out; warns that minors may not fully understand consent implications and urges districts to adopt stronger privacy protections and clearer opt‑out processes.",
        "source_6": "U.N. Committee on the Rights of the Child (various concluding observations, e.g., U.S. OPAC 2013; U.K. 2016): Recommends limiting or prohibiting military recruitment activities in schools and ensuring that under‑18s are not targeted, framing in‑school recruiting as inconsistent with international child‑rights norms and the principle of free, fully informed choice by minors."
    }
}