{
    "question": "Are corporations a threat to democracy and society?",
    "content": {
        "source_1": "Gilens, Martin, and Benjamin I. Page (2014). Testing Theories of American Politics: Elites, Interest Groups, and Average Citizens. Perspectives on Politics, 12(3), 564–581. Analysis of 1,779 policy outcomes (1981–2002) finds economic elites and organized business interests have substantial independent influence on U.S. policy, while average citizens have little—evidence for democratic skew toward corporate-aligned preferences. DOI: 10.1017/S1537592714001595",
        "source_2": "OpenSecrets (Center for Responsive Politics). Outside Spending by Election Cycle. Empirical campaign-finance data show outside spending surged after the 2010 Citizens United decision and that nondisclosing “dark money” groups have spent hundreds of millions in subsequent cycles, indicating increased channels for corporate- and billionaire-aligned election influence with reduced transparency. https://www.opensecrets.org/outsidespending/",
        "source_3": "Drutman, Lee (2015). The Business of America Is Lobbying. Oxford University Press. Documents the rapid growth and professionalization of corporate lobbying, showing how firms build durable lobbying capacity and informational advantages that bias policymaking toward business interests—a structural threat of regulatory capture rather than isolated corruption.",
        "source_4": "Ansolabehere, Stephen; de Figueiredo, John M.; and Snyder Jr., James M. (2003). Why Is There So Little Money in U.S. Politics? Journal of Economic Perspectives, 17(1), 105–130. Finds campaign contributions are surprisingly small relative to the stakes and show limited, inconsistent effects on legislators’ votes; argues much giving is “consumption,” not profitable investment—countering claims that corporate money reliably buys policy. DOI: 10.1257/089533003321164976",
        "source_5": "Hall, Richard L., and Alan V. Deardorff (2006). Lobbying as Legislative Subsidy. American Political Science Review, 100(1), 69–84. Proposes that lobbying primarily supplies expertise and staff resources to allied legislators rather than changing minds, framing interest-group (including corporate) lobbying as an information subsidy that can aid policymaking rather than a direct subversion of democracy. DOI: 10.1017/S0003055406062015",
        "source_6": "World Bank (2020). Poverty and Shared Prosperity 2020. Reports that the global extreme poverty rate fell from roughly 36% in 1990 to about 9% in 2017, largely driven by market-led growth, trade, and private investment—evidence that corporate-led globalization has delivered large social gains, complicating claims that corporations are broadly a threat to society. https://www.worldbank.org/en/publication/poverty-and-shared-prosperity"
    }
}