{
    "question": "Should deregulation and tax cuts be embraced to lead the world out of economic crisis?",
    "content": {
        "source_1": "Mertens, K., & Ravn, M. O. (2013). The Dynamic Effects of Personal and Corporate Income Tax Changes in the United States. American Economic Review. Using narrative and SVAR identification, the authors find exogenous cuts to personal and corporate income taxes raise GDP, investment, and hours worked in the short run—evidence consistent with tax cuts helping to accelerate recovery.",
        "source_2": "OECD (2015). The Future of Productivity. OECD Publishing. The report concludes that pro-competition product market deregulation (easing entry barriers, reducing licensing/administrative burdens) boosts firm dynamism and productivity, with sizable gains in services—supporting deregulation as a lever for growth.",
        "source_3": "Financial Crisis Inquiry Commission (2011). The Financial Crisis Inquiry Report. U.S. Government. The official postmortem attributes the 2008 crisis in part to “widespread failures in financial regulation,” including deregulation and supervisory gaps (e.g., shadow banking), implying that further deregulation can raise systemic risk rather than resolve crises.",
        "source_4": "Hope, D., & Limberg, J. (2022). The economic consequences of major tax cuts for the rich: An international comparison. Socio-Economic Review. Studying 18 advanced economies over five decades, the authors find major tax cuts for the rich do not significantly boost GDP or employment but do increase income inequality—challenging “trickle-down” justifications.",
        "source_5": "Bank of England (2022). Financial Stability Report, October 2022. The BoE documents how the UK’s late-September 2022 fiscal package—including large unfunded tax cuts—triggered a sharp gilt selloff and LDI fund stress, forcing emergency intervention; a case where tax-cut-led strategy undermined financial stability and raised borrowing costs.",
        "source_6": "IMF (2012). World Economic Outlook, October 2012, Chapter 3: The Good, the Bad, and the Ugly: Multipliers. The IMF finds fiscal multipliers are larger than 1 in weak economies, meaning front-loaded fiscal consolidation is more contractionary than expected; it implies that, in downturns, direct public spending often has stronger growth effects than tax cuts, especially if cuts prompt offsetting spending reductions."
    }
}