{
    "question": "Should parents be allowed to genetically screen foetuses for heritable diseases?",
    "content": {
        "source_1": "ACOG Practice Bulletin No. 226: Screening for Fetal Chromosomal Abnormalities (American College of Obstetricians and Gynecologists & Society for Maternal-Fetal Medicine, 2020). Recommends that prenatal genetic screening be offered to all pregnant patients regardless of age or risk, emphasizing informed consent, patient autonomy, and noting that cell-free DNA screening has high sensitivity/specificity for common aneuploidies and can reduce unnecessary invasive procedures. https://www.acog.org/clinical/clinical-guidance/practice-bulletin/articles/2020/10/screening-for-fetal-chromosomal-abnormalities",
        "source_2": "Chitty LS et al., Non-invasive prenatal testing to screen for Down’s syndrome, Edwards’ syndrome and Patau’s syndrome: the RAPID evaluation (Health Technology Assessment, 2016). Large NHS-based evaluation found that NIPT markedly reduced the number of invasive diagnostic procedures (and procedure-related miscarriages) while maintaining very high detection rates for trisomy 21, supporting clinical and cost-effectiveness of allowing prenatal genetic screening in practice. https://www.journalslibrary.nihr.ac.uk/hta/hta20690",
        "source_3": "Nuffield Council on Bioethics, Non-invasive prenatal testing: ethical issues (2017). Warns that routinising fetal genetic screening risks undermining informed choice, increasing social pressure to test/terminate, and reinforcing stigma toward disability; recommends robust pre- and post-test counseling and limits on non-medical uses to protect autonomy and social justice. https://www.nuffieldbioethics.org/publications/non-invasive-prenatal-testing",
        "source_4": "Asch, A., Prenatal Diagnosis and Selective Abortion: A Challenge to Practice and Policy (The Hastings Center Report, 1999). Presents the disability rights “expressivist” critique: routine screening and selective termination can convey that lives with disability are less valuable, potentially harming disabled communities and challenging the moral justification for widespread fetal genetic screening.",
        "source_5": "Genetic Diagnostics Act (GenDG), Germany (2009; English translation available). A restrictive regulatory model: permits prenatal genetic testing primarily for medical purposes with mandatory, non-directive genetic counseling; prohibits non-medical uses (e.g., sex selection), reflecting a governance approach that allows testing but tightly constrains it to address ethical and social risks. https://www.gesetze-im-internet.de/englisch_gendg/englisch_gendg.html",
        "source_6": "Savulescu, J., Procreative Beneficence: Why We Should Select the Best Children (Bioethics, 2001). Philosophical argument that parents have strong moral reasons—potentially obligations—to use genetic information to have the child expected to have the best life, directly supporting permissive (even proactive) policies that allow fetal genetic screening for serious heritable disease. https://onlinelibrary.wiley.com/doi/abs/10.1111/1467-8519.00251"
    }
}