{
    "question": "Should taking food thrown out by supermarkets be legal?",
    "content": {
        "source_1": "United Nations Environment Programme — Food Waste Index Report 2024 (Mar 2024). Finds roughly 1.05 billion tonnes of food were wasted at the retail, food service, and household levels in 2022, with retail playing a measurable role; cutting retail food waste is important for reducing methane and overall greenhouse-gas emissions. This supports allowing recovery of edible supermarket discards as a waste- and climate-reduction strategy. https://www.unep.org/resources/report/food-waste-index-report-2024",
        "source_2": "NRDC & Harvard Food Law and Policy Clinic — The Dating Game: How Confusing Food Date Labels Lead to Food Waste in America (2013). Documents that most date labels (e.g., “sell by,” “best by”) are not safety indicators and that there is no uniform federal standard (except for infant formula), leading retailers to discard food that may still be safe to eat. This suggests criminalizing retrieval prevents consumption of otherwise safe, edible food. https://www.nrdc.org/resources/dating-game-how-confusing-food-date-labels-lead-food-waste-america",
        "source_3": "USDA Food Safety and Inspection Service — The “Danger Zone” (40°F–140°F) Guidance (ongoing). Advises that perishable foods kept above 40°F for more than two hours should be discarded due to pathogen growth; dumpster environments also pose cross-contamination risks. This public-health perspective supports keeping retrieval of discarded supermarket food illegal to reduce foodborne illness risk. https://www.fsis.usda.gov/food-safety/safe-food-handling-and-preparation/food-safety-basics/danger-zone-40f-140f",
        "source_4": "USDA — Bill Emerson Good Samaritan Food Donation Act (liability protections) and Food Donation Improvement Act of 2023 (expands protections, including certain direct donations and donations at reduced price). These laws create safe, traceable channels for supermarkets to donate unsold food with strong liability protection, offering a policy alternative to dumpster retrieval and reducing justification for legalization. https://www.usda.gov/foodlossandwaste/good-samaritan-act",
        "source_5": "Federal Constitutional Court of Germany — Press Release No. 71/2020 (Aug 18, 2020) on “containern” (dumpster diving). Upheld theft convictions for taking food from supermarket waste containers on private property, finding the items were not legally abandoned; emphasizes property rights and orderly disposal frameworks as reasons to criminalize such taking. https://www.bundesverfassungsgericht.de/SharedDocs/Pressemitteilungen/EN/2020/bvg20-071.html",
        "source_6": "Crown Prosecution Service (UK) — CPS drops charges in Iceland supermarket bin case (BBC News report, Jan 3, 2014). Prosecutors concluded it was not in the public interest to pursue theft charges against individuals who took discarded food, highlighting a contrasting approach that favors discretion and de facto decriminalization in low-harm contexts. https://www.bbc.com/news/uk-england-london-25585706"
    }
}