{
    "question": "Should pensions be privatised?",
    "content": {
        "source_1": "World Bank (1994). Averting the Old Age Crisis: Policies to Protect the Old and Promote Growth. Argues for multi‑pillar systems with funded, privately managed accounts to improve fiscal sustainability, raise national saving, and strengthen work incentives—presented as a case for partial privatization of pensions. https://openknowledge.worldbank.org/handle/10986/6209",
        "source_2": "OECD (2018). OECD Pensions Outlook 2018 (chapter on fees in DC plans). Finds that fees and charges in privately managed defined contribution systems can substantially erode retirement income (e.g., a 1% annual fee can reduce final balances by 20–30% over a career), challenging the case for privatization without strong fee controls. https://www.oecd.org/pensions/oecd-pensions-outlook-2018.htm",
        "source_3": "Australian Prudential Regulation Authority (APRA) (2024). Annual Superannuation Statistics. Reports that Australia’s mandatory, privately managed superannuation system has accumulated assets of roughly AUD 3.5–3.8 trillion (well over 100% of GDP), broadened coverage via compulsion, and deepened domestic capital markets—evidence cited by proponents of privatization. https://www.apra.gov.au/statistics/annual-fund-level-superannuation-statistics",
        "source_4": "OECD (2018). OECD Reviews of Pension Systems: Chile. Documents that Chile’s privatized AFP system has delivered low and unequal pensions for many workers due to contribution gaps, fees, and labor market informality, prompting expansions of the solidarity (public) pillar—evidence against full privatization on adequacy grounds. https://www.oecd.org/els/public-pensions/oecd-reviews-of-pension-systems-chile-2018.htm",
        "source_5": "OECD (2014). Economic Surveys: Poland. Describes Poland’s 2014 reversal of key elements of its funded private pillar (transfer of assets to the public system) to alleviate near‑term fiscal pressures, highlighting political and fiscal risks and the fragility of privatization in practice. https://www.oecd.org/economy/surveys",
        "source_6": "Center for Retirement Research at Boston College (2009). What the 2008 Stock Market Crash Means for Retirement Security. Shows that market downturns caused large losses in 401(k)/DC balances, especially for near‑retirees, underscoring sequence‑of‑returns risk when retirement income depends heavily on private accounts. https://crr.bc.edu/briefs/what-the-2008-stock-market-crash-means-for-retirement-security/"
    }
}