{
    "question": "Should teachers be armed?",
    "content": {
        "source_1": "FBI and Texas State University (ALERRT), “A Study of Active Shooter Incidents in the United States Between 2000 and 2013” (2014) — Finds that most active-shooter events end before police arrive and many last five minutes or less, implying faster on-site engagement reduces casualties. Proponents argue arming selected school staff could close this response-time gap.",
        "source_2": "Pearl High School shooting, Mississippi (1997) — Assistant principal Joel Myrick retrieved his personal handgun from his truck and detained the shooter, stopping further violence until police arrived. Cited by supporters as an example of armed school personnel mitigating harm.",
        "source_3": "U.S. Secret Service, National Threat Assessment Center, “Protecting America’s Schools: A U.S. Secret Service Analysis of Targeted School Violence” (2019) — Emphasizes behavioral threat assessment teams, reporting systems, and prevention; does not recommend arming teachers. Used by opponents to argue evidence-based prevention is preferable to adding more guns.",
        "source_4": "Seaside High School incident, California (March 2018) — A teacher and reserve police officer accidentally discharged a handgun during a classroom “safety” demonstration, injuring a student with debris. Raised concerns about accidental shootings and training/handling risks if teachers are armed.",
        "source_5": "EMC Insurance Companies statement regarding Kansas schools (2013) — After Kansas allowed districts to arm staff, EMC said it would not insure schools that let employees carry guns, citing increased liability. Indicates potential financial and legal risks for districts that arm teachers.",
        "source_6": "Gallup, “Most U.S. Teachers Oppose Carrying Guns in Schools” (March 2018) — National survey of teachers found 73% opposed being armed and a majority believed arming teachers would make schools less safe. Highlights stakeholder resistance among the educators themselves."
    }
}