{
    "question": "Should aid to African states that criminalise homosexuality be cut?",
    "content": {
        "source_1": "Reuters. World Bank halts new lending to Uganda over anti-LGBT law (Aug. 8, 2023). Reports the Bank’s suspension of new financing to Uganda in response to the Anti-Homosexuality Act—evidence that donors can and do condition aid on anti-LGBT laws, which proponents see as necessary leverage to uphold human rights. https://www.reuters.com/world/africa/world-bank-halts-new-lending-uganda-over-anti-lgbt-law-2023-08-08/",
        "source_2": "Reuters. Uganda’s anti-LGBTQ law would hurt HIV fight, says UNAIDS (May 1, 2023). Cites UNAIDS warning that criminalization undermines HIV prevention and treatment; cutting aid risks compounding these public health harms by disrupting essential services for vulnerable populations. https://www.reuters.com/world/africa/ugandas-anti-lgbtq-law-would-hurt-hiv-fight-says-unaids-2023-05-01/",
        "source_3": "Charles Kenny, Center for Global Development. The Case Against Linking Aid to Gay Rights (Feb. 27, 2014). Argues that broad aid conditionality is unlikely to change anti-LGBT policies, can trigger nationalist backlash, and primarily harms poor citizens rather than political elites. https://www.cgdev.org/blog/case-against-linking-aid-gay-rights",
        "source_4": "Frank Mugisha, The Guardian. Help us fight Uganda’s anti-gay law, but don’t cut aid (Feb. 26, 2014). A leading Ugandan LGBTQ activist warns that general aid cuts punish ordinary people and strengthen anti-LGBT rhetoric; urges donors to instead support local civil society and legal advocacy. https://www.theguardian.com/commentisfree/2014/feb/26/uganda-anti-gay-law-help-fight-dont-cut-aid",
        "source_5": "European Parliament. MEPs urge repeal of the Anti-Homosexuality Act in Uganda and call for sanctions and review of EU cooperation (Press release, July 13, 2023). Advocates using conditionality—reviewing and potentially suspending budget support while increasing assistance to civil society—as a rights-based response. https://www.europarl.europa.eu/news/en/press-room/20230710IPR03133/uganda-meps-urge-the-repeal-of-the-anti-homosexuality-act",
        "source_6": "ILGA World. State-Sponsored Homophobia Report (2023). Documents that more than 60 countries worldwide criminalize same-sex relations across multiple regions; highlights concerns about selectivity and consistency if aid cuts target only African states. https://ilga.org/state-sponsored-homophobia-report/"
    }
}