{
    "question": "Is space exploration a waste of money?",
    "content": {
        "source_1": "NASA Office of Inspector General — “NASA’s Management of the Artemis Missions” report (Nov 2021) and testimony (Mar 1, 2022). The IG projected NASA will spend about $93 billion on Artemis through FY2025 and estimated per‑launch operating costs for SLS/Orion at roughly $4.1 billion, calling the figure “unsustainable.” Evidence used to argue that current exploration architectures suffer from severe cost overruns and poor value.",
        "source_2": "U.S. Geological Survey — “Economic Valuation of Landsat Imagery” (2019). USGS estimated the global economic benefit of freely available Landsat Earth‑observation data at $3.45 billion in 2017 (about $2.06 billion for U.S. users alone). Evidence used to counter the claim by showing concrete, annually recurring economic returns from space programs with direct applications on Earth.",
        "source_3": "NASA — Double Asteroid Redirection Test (DART) mission results (press release, Oct 11, 2022). NASA confirmed DART successfully altered the orbit of Dimorphos; the mission cost roughly $325 million. Evidence used to argue that relatively modest investments in planetary defense can mitigate low‑probability, high‑impact existential risks—insurance value against asteroid threats.",
        "source_4": "Ryan, Marais et al. — “Impact of Rocket Launch and Re‑entry on Stratospheric Ozone and Climate” (Earth’s Future, 2022). The study finds black‑carbon soot from rocket exhaust and alumina from re‑entry can warm the climate and deplete stratospheric ozone, with risks increasing as launch and re‑entry rates grow. Evidence used to argue space activity imposes underaccounted environmental costs.",
        "source_5": "The Planetary Society — “How much does the U.S. spend on NASA?” (budget analysis updated 2023–2024). Shows NASA’s budget has hovered below 0.5% of U.S. federal spending in recent years (about 0.47% in FY2023). Evidence used to counter the claim by emphasizing that exploration spending is a very small slice of government outlays.",
        "source_6": "European Space Agency — Space Environment Report (2023). ESA reports about 36,500 tracked debris objects >10 cm, ~1 million between 1–10 cm, and hundreds of millions smaller fragments; rising collision risks threaten satellites and may require costly mitigation. Evidence used to argue that expanding space activity creates expensive externalities and long‑term sustainability challenges."
    }
}