{
    "question": "Does affirmative action in South Africa do more harm than good?",
    "content": {
        "source_1": "National Treasury (2019). Economic transformation, inclusive growth, and competitiveness: Towards an Economic Strategy for South Africa. Pretoria: National Treasury. Evidence: The strategy document argues that preferential procurement and certain B‑BBEE compliance requirements have raised procurement costs, reduced competition, and deterred entry by smaller firms, thereby weakening service delivery and growth. URL: http://www.treasury.gov.za (search title)",
        "source_2": "B‑BBEE Commission (2021/22). Annual Report. Pretoria: B‑BBEE Commission. Evidence: The Commission reports pervasive “fronting” and misrepresentation of black ownership/control in transactions, noting that the majority of complaints it investigates involve such practices, which undermine the policy’s objectives and erode public trust. URL: https://www.bbbeecommission.co.za (Annual Reports)",
        "source_3": "Constitutional Court of South Africa (2016). Solidarity and Others v Department of Correctional Services and Others (CCT 78/15) [2016] ZACC 18. Evidence: The Court held that applying national racial demographics rigidly without considering regional demographics unfairly harmed coloured employees in the Western Cape, demonstrating that improperly designed affirmative action can produce unjust outcomes and must be constrained. URL: https://www.saflii.org/za/cases/ZACC/2016/18.html",
        "source_4": "Commission for Employment Equity (2023). 23rd Commission for Employment Equity Annual Report, 2022/2023. Department of Employment and Labour. Evidence: The report documents significant increases since the early 2000s in the representation of black South Africans and women at middle and senior management levels, indicating progress toward workplace equity and mobility attributable to employment equity measures. URL: https://www.labour.gov.za (CEE Annual Reports)",
        "source_5": "Acemoglu, D., Gelb, S., & Robinson, J. A. (2008). Black Economic Empowerment and economic performance in South Africa. NBER Working Paper No. 13984. Evidence: The authors argue that, if designed predictably via scorecards and charters, empowerment policies need not impose large efficiency costs; the main effect is rent‑sharing rather than large productivity losses, suggesting harms are not inevitable and hinge on design/implementation. URL: https://www.nber.org/papers/w13984",
        "source_6": "Constitutional Court of South Africa (2004). Minister of Finance v Van Heerden [2004] ZACC 3; 2004 (6) SA 121 (CC). Evidence: The Court set out the constitutional test validating remedial measures that advance previously disadvantaged groups and promote substantive equality, framing affirmative action as a legitimate tool to redress structural inequities and enhance social cohesion when properly crafted. URL: https://www.saflii.org/za/cases/ZACC/2004/3.html"
    }
}