{
    "question": "Do prosecutions help the healing process?",
    "content": {
        "source_1": "Sikkink, Kathryn, and Carrie Booth Walling. The Impact of Human Rights Trials in Latin America. Journal of Peace Research, 2007. Cross-national analysis finds that countries holding perpetrators criminally accountable subsequently experience improved human rights practices and democratic quality, suggesting prosecutions can contribute to societal healing by reinforcing rule of law and acknowledgement of harm.",
        "source_2": "Gollwitzer, Mario, and Markus Denzler. What Makes Revenge Satisfying: Seeing the Offender Suffer or Delivering a Message? European Journal of Social Psychology, 2009. Experimental studies show that witnessing offenders being punished—especially when punishment communicates moral condemnation—reduces victims’ unresolved anger, indicating punitive accountability can facilitate individual psychological closure.",
        "source_3": "Gibson, James L. Overcoming Apartheid: Can Truth Reconcile a Divided Nation? Russell Sage Foundation, 2004. Large-scale surveys on South Africa’s Truth and Reconciliation Commission show that truth-telling and amnesty increased reconciliation and institutional legitimacy without extensive prosecutions, challenging the notion that prosecutions are necessary for healing.",
        "source_4": "Campbell, Rebecca, and Sheela Raja. Secondary Victimization of Rape Victims: Insights from Mental Health Professionals Who Work With Victims. Violence and Victims, 1999. Practitioner reports and evidence document how adversarial criminal proceedings can retraumatize survivors (“secondary victimization”), suggesting prosecutions may impede healing for some victims.",
        "source_5": "Shapland, Joanna, Anne Atkinson, Helen Atkinson, et al. Does Restorative Justice Affect Reoffending? The Fourth Report from the Evaluation of Three Schemes. UK Ministry of Justice, 2008. Randomized evaluations find victims in restorative justice conferences report higher satisfaction, reduced fear, and better emotional recovery than victims whose cases proceeded only through conventional prosecution, indicating non-prosecutorial approaches can better promote healing.",
        "source_6": "Subotić, Jelena. Hijacked Justice: Dealing with the Past in the Balkans. Cornell University Press, 2009. Analysis of ICTY-related prosecutions shows they were often reframed by domestic elites to serve nationalist agendas, in some cases deepening social divisions rather than fostering reconciliation, implying prosecutions can hinder collective healing."
    }
}