{
    "question": "Should new prisons be built to ease overcrowding?",
    "content": {
        "source_1": "U.S. Department of Justice, Civil Rights Division — Investigation of Alabama’s State Prisons for Men (2019; update 2020): Federal investigators found chronic overcrowding and severe understaffing in Alabama’s men’s prisons contributed to unconstitutional levels of violence and death. State officials advanced plans to construct large, modern facilities as part of the remedy, arguing added capacity and updated designs are needed to reduce density and improve safety.",
        "source_2": "U.S. Supreme Court — Brown v. Plata, 563 U.S. 493 (2011): The Court upheld a population cap for California’s prisons due to unconstitutional overcrowding. California primarily met the mandate through policy changes (2011 “realignment,” expanded credits, and parole adjustments) rather than new prison construction, demonstrating that decarceration strategies can ease overcrowding without building.",
        "source_3": "UK National Audit Office — Improving the prison estate (Report, 2023): The NAO found the Ministry of Justice’s program to add 20,000 prison places was delayed and over budget, forcing stopgap measures to manage crowding. The report cautions that new construction is slow, costly, and uncertain as a near-term solution to overcrowding pressures.",
        "source_4": "Council of State Governments Justice Center — Confined and Costly: How Supervision Violations Are Filling Prisons and Burdening Budgets (2019): Analysis showed that 45% of state prison admissions in 2017 stemmed from probation and parole violations (many technical). Targeted reforms to reduce violation admissions can substantially lower prison populations, offering a non-construction path to relieve overcrowding.",
        "source_5": "RAND Corporation (Davis et al.) — Evaluating the Effectiveness of Correctional Education (2013; update 2018): Meta-analysis found incarcerated people in education programs had 43% lower odds of recidivating and that every $1 invested saved $4–$5 in avoided incarceration costs. Investing in rehabilitation and reentry can reduce returns to prison, easing crowding more cost-effectively than building new facilities.",
        "source_6": "Bureau of Justice Statistics — Prisoners in 2022 (Statistical report, 2024): BJS reported the U.S. prison population remains well below its 2009 peak and that capacity utilization varies widely by state—some systems are over capacity, others under. This suggests overcrowding is not universal and may be addressed with targeted reforms, transfers, or selective expansions rather than broad new construction."
    }
}