{
    "question": "Should the national curriculum be scrapped?",
    "content": {
        "source_1": "OECD — School Autonomy and Accountability: Are They Related to Student Performance? (2011). Cross-country PISA analysis found that schools with greater autonomy over curriculum and assessment tend to achieve higher performance when paired with strong accountability. This is used to argue that devolving curriculum control to schools or local authorities—rather than maintaining a single national curriculum—can improve outcomes through flexibility and innovation.",
        "source_2": "UK Department for Education — The national curriculum in England: Framework document (2013; updated). The official framework states the national curriculum ensures a common entitlement to “essential knowledge,” comparability across schools, and easier pupil mobility between regions. This supports keeping a national curriculum to guarantee minimum standards and consistency for all students.",
        "source_3": "Center on Education Policy — Choices, Changes, and Challenges: Curriculum and Instruction in the NCLB Era (2007). Survey research reported many U.S. districts reallocated time toward tested subjects (reading/math) and away from others (science, social studies, arts) under standards-and-tests regimes. Cited by critics to argue that centralized standards tied to accountability can narrow the curriculum; scrapping a national curriculum could reduce teaching-to-the-test and restore breadth.",
        "source_4": "Education Policy Institute (UK) — Entries to arts subjects at Key Stage 4 (2017). Analysis showed a decline in arts GCSE entries in schools prioritizing EBacc performance, linking national policy levers to reduced arts participation. Used to argue that a national curriculum and associated accountability can unintentionally sideline creative subjects; scrapping or loosening the national framework could protect curricular breadth.",
        "source_5": "Bishop, John H. — The Impact of Curriculum-Based External Exit Exam Systems on Student Achievement (1997). Comparative evidence indicated that systems with centralized standards and curriculum-linked external exams see higher student achievement. This supports retaining a national curriculum as part of a coherent standards-and-assessment system that can raise attainment and reduce variability.",
        "source_6": "Eurydice (European Commission) — Citizenship Education at School in Europe (2017). Review across European systems found that clear national frameworks for citizenship education help ensure consistent coverage of civic knowledge and participation across schools. This is used to argue that a national curriculum fosters social cohesion and a shared civic foundation, cautioning against scrapping it."
    }
}