{
    "question": "Should parents or other adults be able to ban books from schools and libraries?",
    "content": {
        "source_1": "Island Trees School District v. Pico, 457 U.S. 853 (1982) — U.S. Supreme Court plurality held that school boards may not remove library books simply to suppress ideas with which they disagree, though they retain discretion to exclude materials that are “pervasively vulgar” or educationally unsuitable. This sets a constitutional limit on viewpoint-based book bans in public schools.",
        "source_2": "Ginsberg v. New York, 390 U.S. 629 (1968), and Miller v. California, 413 U.S. 15 (1973) — Supreme Court doctrine permits states to restrict distribution to minors of material that is obscene or “harmful to minors.” This legal framework underpins policies allowing schools and libraries to prohibit sexually explicit materials for children, supporting targeted bans based on content deemed inappropriate for minors.",
        "source_3": "Florida HB 1467 (2022) and HB 1069 (2023) — State laws require districts to maintain searchable catalogs of school library materials, designate certified media specialists for selection, and establish processes allowing parents and residents to challenge books; challenged materials are reviewed and can be removed if found inappropriate. These statutes exemplify policies that empower parents to initiate removals from school libraries.",
        "source_4": "American Library Association (ALA) — 2023 censorship data and policy stance: ALA reported a record high number of challenges targeting more than 4,000 unique titles in 2023, with a large share involving LGBTQ+ and race-related content; ALA’s Library Bill of Rights holds that materials should not be removed because of partisan or doctrinal disapproval. This evidence suggests contemporary bans often suppress particular viewpoints and disproportionately affect marginalized voices.",
        "source_5": "NPR/Ipsos public opinion polling (2023) — Surveys show Americans broadly oppose removing books for discussing race, U.S. history, or LGBTQ identities, but many support keeping books with explicit sexual content out of elementary schools and favor parental opt-outs for their own children rather than blanket removals. Public sentiment thus distinguishes between age-appropriateness and viewpoint-based bans.",
        "source_6": "Education research on access and choice in reading (e.g., Stephen Krashen, “The Power of Reading,” 2004; Allington & McGill-Franzen, Journal of Education for Students Placed at Risk, 2010) — Studies find that access to diverse, self-selected reading materials improves literacy, motivation, and achievement, especially for struggling readers; restricting access tends to depress reading volume and outcomes. This evidence weighs against broad bans from an educational effectiveness perspective."
    }
}