{
    "question": "Is zero-tolerance policing a good tactic for fighting crime?",
    "content": {
        "source_1": "Corman, H., & Mocan, N. (2005). Carrots, Sticks, and Broken Windows. Journal of Law and Economics, 48(1), 235–266. Using 1989–1998 NYC precinct data, the authors find that increases in misdemeanor arrests (a proxy for quality-of-life/zero-tolerance policing) significantly reduced robbery, motor vehicle theft, and grand larceny, supporting the claim that such tactics can lower certain felonies.",
        "source_2": "Harcourt, B. E., & Ludwig, J. (2006). Broken Windows: New Evidence from New York City and a Five-City Social Experiment. University of Chicago Law Review, 73(1), 271–320. Reanalysis finds no robust relationship between misdemeanor policing and violent crime in NYC, and evidence from the Moving to Opportunity experiment challenges the causal link between disorder and serious crime; crime also fell in cities without zero tolerance, undermining the claim.",
        "source_3": "Braga, A. A., Welsh, B. C., & Schnell, C. (2015). Can Policing Disorder Reduce Crime? A Systematic Review and Meta-Analysis. Journal of Research in Crime and Delinquency, 52(4), 567–588. Across 30+ studies, disorder policing shows modest crime reductions primarily when implemented as problem-oriented/community strategies; aggressive zero-tolerance crackdowns generally do not reduce crime, suggesting the tactic per se is not reliably effective.",
        "source_4": "Gelman, A., Fagan, J., & Kiss, A. (2007). An Analysis of the NYPD’s Stop-and-Frisk Policy in the Context of Claims of Racial Bias. Journal of the American Statistical Association, 102(479), 813–823. The study documents large racial disparities and low contraband “hit rates” for stops, indicating inefficiency and potential legitimacy costs of aggressive enforcement associated with zero-tolerance approaches.",
        "source_5": "Rosenfeld, R., & Fornango, R. (2014). The Impact of Police Stops on Precinct Robbery and Burglary Rates in New York City. Justice Quarterly, 31(1), 96–122. Findings show only probable-cause stops are linked to small short-term reductions in robbery and burglary; generalized, low-threshold stops typical of zero-tolerance approaches have no detectable effect on these crimes.",
        "source_6": "Legewie, J., & Fagan, J. (2019). Aggressive Policing and the Educational Performance of Minority Youth. Proceedings of the National Academy of Sciences, 116(4), 979–986. A quasi-experimental analysis ties surges in aggressive policing (e.g., stop-and-frisk intensity) to declines in test scores for Black boys, highlighting collateral harms that may weaken long-run crime-control goals."
    }
}