{
    "question": "Should prisoners be used for medical experiments without consent?",
    "content": {
        "source_1": "Nuremberg Code (1947) — U.S. v. Brandt (Doctors’ Trial) judgment Evidence: Establishes that “the voluntary consent of the human subject is absolutely essential” and that experiments must avoid unnecessary suffering. Created in response to prisoner experimentation, it directly rejects using prisoners in research without consent.",
        "source_2": "U.S. federal regulations, 45 CFR 46 Subpart C — Additional Protections for Prisoners (HHS/OHRP, most recently revised 2018) Evidence: Strictly limits categories of research with incarcerated people, requires a prisoner representative on the IRB, and mandates informed consent that is free from coercion; nonconsensual experimentation on prisoners is prohibited under U.S. research regulations.",
        "source_3": "Holmesburg Prison experiments (1950s–1970s) — documented in Allen M. Hornblum, “Acres of Skin” (1998) and archival investigations Evidence: Dermatologic and chemical exposure studies on incarcerated men often lacked valid consent and caused harms, becoming a flagship case of exploitation and long-term mistrust—cited as empirical evidence of the dangers of using prisoners without consent.",
        "source_4": "John Harris, “Scientific research is a moral duty” — Journal of Medical Ethics (2005) Evidence: Argues individuals have a moral obligation to support biomedical research for the greater good. Proponents of compulsory use of prisoners sometimes invoke this duty and analogies to wartime conscription to claim that enforced participation could be justified in extreme emergencies, though Harris himself still emphasizes informed consent.",
        "source_5": "FDA/DHHS Exception from Informed Consent for Emergency Research — 21 CFR 50.24 (1996–present) Evidence: Allows enrollment without prior consent in narrowly defined, life-threatening situations when patients cannot consent and there is potential for direct benefit, with community consultation and independent oversight. Advocates for the claim cite this as precedent that research without consent can be ethically and legally permissible under strict limits.",
        "source_6": "International human rights law — ICCPR Article 7 (1966) and UN Standard Minimum Rules for the Treatment of Prisoners (Mandela Rules, 2015) Evidence: ICCPR explicitly prohibits medical or scientific experimentation without a person’s free consent; the Mandela Rules require equivalence of care and adherence to medical ethics, including informed consent, in prisons. These norms frame nonconsensual experimentation on prisoners as a human-rights violation."
    }
}