{
    "question": "Should food labels be mandated to encourage people to eat better?",
    "content": {
        "source_1": "Taillie LS, Reyes M, Colchero MA, Popkin BM, Corvalán C. 2020. An evaluation of Chile’s Law of Food Labeling and Advertising on sugar-sweetened beverage purchases: A before-and-after study. PLoS Medicine. Finding: After Chile mandated prominent front-of-pack “high in” warning labels (alongside marketing and school-sales restrictions), household purchases of sugary drinks fell by roughly a quarter, and companies reformulated products to avoid warnings. Perspective: Supports the idea that mandatory labels can drive healthier purchasing and supply-side improvements, though effects occurred within a broader policy package.",
        "source_2": "Bollinger B, Leslie P, Sorensen A. 2011. Calorie Posting in Chain Restaurants. American Economic Journal: Economic Policy. Finding: Using millions of transactions from Starbucks, mandated calorie posting led to about a 6% reduction in calories per transaction, mainly through changes in food (not beverages), without hurting revenues. Perspective: Evidence that mandatory menu labeling can nudge lower-calorie choices in real-world retail settings.",
        "source_3": "Elbel B, Kersh R, Brescoll VL, Dixon LB. 2009. Calorie labeling and food choices: A first look at the effects on low-income people in New York City. Health Affairs. Finding: Comparing NYC (with mandatory calorie labels) to a control city, there was no significant overall change in calories purchased among low-income adults and adolescents at fast-food chains. Perspective: Challenges the assumption that mandates reliably improve eating; effects may be limited in key populations.",
        "source_4": "Campos S, Doxey J, Hammond D. 2011. Nutrition labels on pre-packaged foods: a systematic review. Public Health Nutrition. Finding: Label use and understanding are higher among individuals with greater education, income, and nutrition knowledge; many consumers find labels confusing or do not use them. Perspective: Raises equity and effectiveness concerns—mandates may benefit higher-SES groups more, potentially widening dietary disparities unless complemented by supportive measures.",
        "source_5": "U.S. Food and Drug Administration. 2014. Regulatory Impact Analysis: Food Labeling; Nutrition Labeling of Standard Menu Items in Restaurants and Similar Retail Food Establishments (Final Rule). Finding: FDA projected substantial compliance costs for chains (menu analysis, printing, training) and acknowledged uncertainty about the magnitude of health benefits given mixed evidence on behavior change. Perspective: Economic lens questioning a “must mandate” stance—costs are concrete while benefits, though plausible, may be modest or uncertain.",
        "source_6": "Crockett RA, King SE, Marteau TM, et al. 2018. Nutritional labelling for healthier food or non-alcoholic drink purchasing and consumption. Cochrane Database of Systematic Reviews. Finding: Low-certainty evidence suggests labeling may lead to small reductions in energy consumed or purchased; effects are inconsistent and context-dependent. Perspective: Cautions that labeling alone yields modest average impacts, implying mandates may need to be paired with other interventions (pricing, reformulation incentives, marketing limits) to meaningfully improve diets."
    }
}