{
    "question": "Should force be used to protect human rights abroad?",
    "content": {
        "source_1": "United Nations World Summit Outcome Document (2005), paras. 138–139 — UN member states endorsed the Responsibility to Protect (R2P), committing to take collective action “in a timely and decisive manner,” through the Security Council, including the use of force under Chapter VII as a last resort when national authorities fail to prevent genocide, war crimes, ethnic cleansing, and crimes against humanity. This frames force as sometimes necessary to protect human rights abroad.",
        "source_2": "International Crisis Group, “Sierra Leone: Managing Uncertainty” (Africa Report No. 35, 2001) — Analysis credits the 2000 British military intervention (Operation Palliser) with halting rebel advances, stabilizing Freetown, and creating space for demobilization and elections, which sharply curtailed atrocities by the RUF. This case is often cited as evidence that limited, targeted force can effectively protect civilians.",
        "source_3": "Watson Institute, Brown University, Costs of War Project, “Human Costs of the Post-9/11 Wars: Iraq” (ongoing dataset; summary reports 2019–2023) — Documents high civilian death tolls and long-term instability following the 2003 Iraq invasion, which was partly justified on human rights grounds. Findings suggest that using force can worsen human rights conditions through state collapse, sectarian violence, and displacement.",
        "source_4": "Hultman, Kathman, and Shannon, “United Nations Peacekeeping and Civilian Protection in Civil Wars” (American Journal of Political Science, 2014) — Quantitative evidence shows that larger UN peacekeeping deployments are associated with significant reductions in civilian killings by both governments and rebels. This indicates that consent-based peacekeeping, which relies on limited and defensive use of force rather than offensive intervention, can protect human rights without warfighting.",
        "source_5": "UN Charter (Art. 2(4), 39–42) and Christine Gray, “International Law and the Use of Force” (Oxford University Press, 2018) — The Charter prohibits the use of force except in self-defense or when authorized by the Security Council; unilateral humanitarian intervention remains legally contested and generally viewed as unlawful. This legal framework conflicts with any blanket claim that force “has to be used” to protect rights abroad.",
        "source_6": "Alan J. Kuperman, “The Moral Hazard of Humanitarian Intervention: Lessons from the Balkans” (International Studies Quarterly, 2008) — Argues that the expectation of external military rescue can incentivize rebels to provoke state retaliation to trigger intervention, inadvertently increasing civilian harm. This challenges the notion that using force reliably protects human rights and highlights potential perverse effects."
    }
}