{
    "question": "Is long-term cooperation between Russia and the United States possible?",
    "content": {
        "source_1": "NASA press release, “NASA, Roscosmos Reach Agreement to Integrate Crews on Space Station Flights,” July 15, 2022. Despite acute geopolitical tensions, NASA and Roscosmos formalized seat-swap arrangements to ensure continuous joint operations on the International Space Station through multiple missions, showing compartmentalized, sustained cooperation remains feasible.",
        "source_2": "Congressional Research Service, Amy F. Woolf, “The Nunn-Lugar Cooperative Threat Reduction (CTR) Program: Background and Issues for Congress,” R43143, updated May 23, 2014. Over two decades, the U.S. and Russia jointly secured and dismantled thousands of nuclear warheads and delivery systems, demonstrating that long-term, high-stakes security cooperation can be built and sustained.",
        "source_3": "Reuters, “Russia ships out Iran’s enriched uranium under nuclear deal,” Dec. 28, 2015. As part of implementing the JCPOA, Russia removed large quantities of Iran’s enriched uranium—a coordinated step with the United States and other parties—illustrating that Washington and Moscow can work together on complex nonproliferation goals.",
        "source_4": "Public Law 115-44 (CAATSA), Countering America’s Adversaries Through Sanctions Act, Aug. 2, 2017. U.S. law codifies and expands sanctions on Russia and constrains the executive’s ability to lift them, creating institutional barriers that complicate any durable normalization or long-term cooperative agenda.",
        "source_5": "The Kremlin, “The Foreign Policy Concept of the Russian Federation,” March 31, 2023. Russia’s official doctrine frames the U.S. and its allies as the principal source of threats, signaling an adversarial strategic posture that structurally undermines prospects for sustained bilateral cooperation.",
        "source_6": "U.S. Department of State, Fact Sheet: “Russia’s ‘Suspension’ of the New START Treaty,” Feb. 28, 2023. Moscow’s suspension of its participation in the last remaining U.S.-Russia strategic arms control treaty undercuts verification and limits—evidence that even longstanding cooperative frameworks can unravel, challenging the plausibility of long-term cooperation."
    }
}