{
    "question": "Should prostitution be legalised?",
    "content": {
        "source_1": "Prostitution Law Review Committee (New Zealand Ministry of Justice). Report on the Operation of the Prostitution Reform Act 2003 (2008). Evaluation of decriminalization found improved safety (greater ability to refuse clients, better access to health services), more willingness to report crimes to police, and no clear evidence of growth in the number of sex workers. Perspective: Supports legalization/decriminalization for worker safety and rights.",
        "source_2": "Swedish Government Official Report. Förbud mot köp av sexuell tjänst – en utvärdering 1999–2008 (SOU 2010:49). Assessment of Sweden’s “Nordic model” (criminalizing buyers, not sellers) reported substantial reductions in visible street prostitution and argued the law helped reduce demand and acted as a barrier to trafficking. Perspective: Opposes full legalization; favors demand-side criminalization.",
        "source_3": "Cho, Seo-Young; Dreher, Axel; Neumayer, Eric. Does Legalized Prostitution Increase Human Trafficking? World Development (2013). Cross-country econometric analysis found countries with legalized prostitution tend to have higher reported inflows of human trafficking, though strong enforcement can mitigate effects. Perspective: Warns legalization can increase trafficking risks.",
        "source_4": "Shannon, Kate, et al. Global epidemiology of HIV among female sex workers; and Decriminalising sex work to reduce HIV risk. The Lancet (2015, HIV and sex workers series). Modeling and reviews indicate that decriminalization could substantially reduce violence and police harassment, averting a large share of new HIV infections among sex workers over a decade. Perspective: Supports decriminalization on public health grounds.",
        "source_5": "Cunningham, Scott; Shah, Manisha. Decriminalizing Indoor Prostitution: Implications for Sexual Violence and Public Health (2014). Natural experiment from Rhode Island’s temporary decriminalization (2003–2009) found significant declines in reported rape and reductions in female gonorrhea rates. Perspective: Empirical support for decriminalization reducing sexual violence and some STIs.",
        "source_6": "Daalder, A. Prostitution in the Netherlands after the lifting of the brothel ban (WODC, Dutch Ministry of Security and Justice, 2007/2011). Government evaluations concluded legalization did not eliminate exploitation or the illegal sector, with displacement to less visible markets and ongoing regulatory enforcement challenges. Perspective: Cautions that legalization alone may not achieve intended protections and can leave significant harms unaddressed."
    }
}