{
    "question": "Should children be banned from watching shows that contain violence and other adult content?",
    "content": {
        "source_1": "American Academy of Pediatrics, Council on Communications and Media (2016), “Virtual Violence” policy statement. Summarizes evidence that exposure to violent media is associated with increased aggressive behavior, desensitization to violence, and fear/anxiety in children; recommends avoiding violent media for younger children and stronger content controls. Supports stricter limits and could be read as consistent with bans for certain ages.",
        "source_2": "American Psychological Association Task Force on Violent Media (2015), Technical report. Concludes that violent video game exposure has small but reliable effects on aggressive behavior and cognitions, but finds insufficient evidence linking exposure to criminal violence or delinquency; emphasizes important methodological limits and moderating factors (e.g., context, family environment). Argues against blanket bans and for nuanced, evidence-based guidance.",
        "source_3": "Dahl, G. A., & DellaVigna, S. (2009), “Does Movie Violence Increase Violent Crime?” Quarterly Journal of Economics. Finds violent crime decreases in the short run on evenings with popular violent movie releases, consistent with “voluntary incapacitation” and substitution effects. Challenges the assumption that exposure to violent entertainment straightforwardly increases real-world violence and questions the efficacy of broad bans.",
        "source_4": "Jeong, S.-H., Cho, H., & Hwang, Y. (2012), “Media Literacy Interventions: A Meta-Analytic Review,” Journal of Communication. Across studies, media-literacy programs improve critical viewing, reduce acceptance of risky portrayals, and mitigate negative media effects. Suggests education and active parental mediation can be effective alternatives to bans.",
        "source_5": "Chandra, A., Martino, S. C., Collins, R. L., et al. (2008), “Does Watching Sex on Television Predict Teen Pregnancy? Findings from a National Longitudinal Survey,” Pediatrics. Longitudinal evidence links higher exposure to sexual content on TV with increased risk of teen pregnancy, even after controls. Supports stricter restrictions on youth exposure to adult sexual content.",
        "source_6": "UN Committee on the Rights of the Child (2021), General Comment No. 25 on children’s rights in relation to the digital environment. Calls for balancing protection from harmful content with children’s rights to access information, expression, and participation; recommends proportionate, age-appropriate measures and design-level protections over blanket censorship. Argues that outright bans risk overreach and may undermine rights and digital literacy."
    }
}