{
    "question": "If you have done nothing wrong, should you have nothing to worry about regarding surveillance?",
    "content": {
        "source_1": "Piza, E. L., Welsh, B. C., Farrington, D. P., & Thomas, A. L. (2019). CCTV Surveillance for Crime Prevention: A 40-Year Systematic Review with Meta-Analysis. Criminology & Public Policy, 18(1). Finding: CCTV produced a statistically significant reduction in crime, especially in car parks and urban settings, suggesting surveillance primarily deters offenders rather than burdening law-abiding people. https://onlinelibrary.wiley.com/doi/full/10.1111/1745-9133.12419",
        "source_2": "Solove, D. J. (2007). “I’ve Got Nothing to Hide” and Other Misunderstandings of Privacy. San Diego Law Review, 44. Argument: Privacy harms aren’t limited to concealing wrongdoing; surveillance can enable power imbalances, aggregation harms, and bureaucratic errors that affect innocent people. https://papers.ssrn.com/sol3/papers.cfm?abstract_id=998565",
        "source_3": "Penney, J. W. (2016). Chilling Effects: Online Surveillance and Wikipedia Use. Berkeley Technology Law Journal, 31(1). Evidence: After the Snowden revelations, traffic to Wikipedia articles on security-sensitive topics dropped by roughly 20%, indicating lawful users change behavior due to perceived surveillance. https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2769645",
        "source_4": "U.S. Senate “Church Committee” (1976). Final Report of the Select Committee to Study Governmental Operations with Respect to Intelligence Activities. Finding: Intelligence agencies conducted surveillance of lawful political activists (e.g., COINTELPRO, NSA watchlists), demonstrating that surveillance has historically been used against people who had not committed crimes. https://www.intelligence.senate.gov/sites/default/files/94755_II.pdf",
        "source_5": "Hill, K. (2020). Wrongfully Accused by an Algorithm. The New York Times. Case: Detroit police wrongfully arrested Robert Williams due to a facial recognition misidentification, showing that surveillance tech errors can harm innocent individuals. https://www.nytimes.com/2020/06/24/technology/facial-recognition-arrest.html",
        "source_6": "BBC News (2021). Singapore reveals police can access COVID contact-tracing data. Example: Despite earlier assurances, data from the TraceTogether app was made available for criminal investigations, illustrating mission creep that can affect people who did nothing wrong. https://www.bbc.com/news/world-asia-55541001"
    }
}