{
    "question": "Should the UN recognize a Palestinian state?",
    "content": {
        "source_1": "UN News — “General Assembly backs enhanced Palestinian participation and says Palestine is qualified for UN membership” (10 May 2024). The GA overwhelmingly supported a resolution affirming that Palestine is qualified for UN membership and upgraded its rights in the Assembly, signaling broad international support for recognition.",
        "source_2": "International Criminal Court, Pre-Trial Chamber I — “Decision on the Prosecution request pursuant to article 19(3) for a ruling on the Court’s territorial jurisdiction in Palestine” (5 Feb 2021). The ICC confirmed it has jurisdiction over alleged crimes in Gaza, the West Bank, and East Jerusalem based on Palestine’s status as a State Party, evidencing international-legal capacity often cited to argue for recognition.",
        "source_3": "Reuters — “U.S. vetoes U.N. Security Council push for Palestinian membership” (18 Apr 2024). The United States blocked a Security Council recommendation for full UN membership, arguing Palestinian statehood should result from direct negotiations with Israel, not unilateral recognition.",
        "source_4": "Israel Ministry of Foreign Affairs/Reuters coverage — Statements by Israeli officials responding to European recognitions (late May 2024). Israel condemned unilateral recognitions by Spain, Ireland, and Norway as “rewarding terrorism” and undermining peace, citing Hamas’s role and security concerns as reasons to oppose UN-level recognition.",
        "source_5": "BBC News — “Spain formally recognizes Palestinian statehood; PM Sánchez says move aims to save two‑state solution” (28 May 2024). Spain’s government framed recognition as a tool to preserve the two‑state framework and strengthen moderate Palestinian institutions, arguing UN recognition would support a diplomatic pathway to peace.",
        "source_6": "Montevideo Convention on the Rights and Duties of States (1933), Article 1. Sets statehood criteria (permanent population, defined territory, government, capacity for foreign relations); critics of recognition argue Palestine lacks effective territorial control and unified governance, so UN recognition would be premature under these criteria."
    }
}