{
    "question": "Should Tibet be an independent state?",
    "content": {
        "source_1": "State Council Information Office of the People’s Republic of China, “Tibet — Its Ownership and Human Rights Situation” (1992). Presents the PRC’s position that Tibet has been an integral part of China since the 13th century, argues independence is illegitimate under China’s territorial integrity, and cites socio-economic gains (infrastructure, education, poverty reduction) as justification for continued rule.",
        "source_2": "United Nations General Assembly, Resolution 1723 (XVI), “Question of Tibet” (20 Dec 1961). Affirms “the principle of self-determination of peoples and nations” with respect to Tibet and calls for cessation of practices depriving Tibetans of fundamental rights—often cited as international backing for Tibetans’ claim to decide their political status.",
        "source_3": "Agreement of the Central People’s Government and the Local Government of Tibet on Measures for the Peaceful Liberation of Tibet (“Seventeen-Point Agreement,” 23 May 1951). Used by Beijing as the legal basis for Tibet’s incorporation into the PRC (asserting consent and autonomy guarantees); the Tibetan government-in-exile argues it was signed under duress and later repudiated, raising questions about its validity.",
        "source_4": "Melvyn C. Goldstein, The Snow Lion and the Dragon: China, Tibet, and the Dalai Lama (University of California Press, 1997). Concludes Tibet functioned as de facto independent from 1913–1951 but lacked broad de jure recognition; this weak international-legal standing complicates claims to full sovereign statehood today and suggests negotiated arrangements may be more viable.",
        "source_5": "UN Office of the High Commissioner for Human Rights (OHCHR), “UN experts alarmed by separation of 1 million Tibetan children in boarding schools in China” (6 Feb 2023). Special Rapporteurs warn of a vast residential-school system that erodes Tibetan language and culture, providing contemporary human-rights evidence used to argue for stronger self-determination or independence to protect cultural survival.",
        "source_6": "Central Tibetan Administration (CTA), “The Middle Way Approach: A Framework for Resolving the Issue of Tibet” (policy document). The CTA—representing the Dalai Lama’s position—explicitly seeks genuine autonomy within the PRC rather than independence, positing that robust self-governance over culture, religion, education, and environment could meet Tibetan needs without secession."
    }
}