{
    "question": "Should governments be allowed to disrupt Internet service on grounds of national security?",
    "content": {
        "source_1": "[BBC News, “Sri Lanka blocks social media after Easter Sunday attacks,” April 21, 2019] — The Sri Lankan government justified a nationwide block on Facebook, WhatsApp, and other platforms immediately after coordinated bombings, arguing it was necessary to curb the spread of misinformation and prevent further violence, illustrating a national-security rationale for short-term disruptions.",
        "source_2": "[47 U.S.C. § 606 (United States Code), “War powers of the President”] — U.S. federal law grants the President authority, during war or a proclaimed national emergency, to control or close wire communications facilities, demonstrating that some legal systems explicitly allow communications disruptions on national-security grounds.",
        "source_3": "[UN Office of the High Commissioner for Human Rights (OHCHR), Report A/HRC/50/55, “Internet shutdowns: trends, causes, legal implications,” June 2022] — Finds that blanket or network-level shutdowns are generally incompatible with international human rights law because they fail legality, necessity, and proportionality tests; urges states to refrain from shutdowns even during security crises.",
        "source_4": "[Supreme Court of India, Anuradha Bhasin v. Union of India, Judgment dated January 10, 2020] — Held that indefinite internet shutdowns are unconstitutional, orders must be public and subject to periodic review, and restrictions must be necessary and proportionate, setting a legal precedent that sharply limits security-justified disruptions.",
        "source_5": "[Jan Rydzak, “Of Blackouts and Bandhs: The Strategy and Structure of Disconnected Protest in India,” Stanford Global Digital Policy Incubator/SSRN working paper, 2018] — Empirical analysis suggests network shutdowns can increase violent collective action by removing channels used for nonviolent coordination, challenging the claim that shutdowns reduce unrest or enhance security.",
        "source_6": "[Brookings Institution (Darrell M. West), “Internet shutdowns cost countries $2.4 billion in 2016,” October 2016] — Estimates large economic losses from shutdowns and notes knock-on harms to businesses and public services, implying that security rationales must be weighed against substantial economic and societal costs."
    }
}