{
    "question": "Does the media's selective coverage of certain issues worsen societal problems and create new problems?",
    "content": {
        "source_1": "Towers, Sherry et al. “Contagion in Mass Killings and School Shootings.” PLOS ONE, 2015. https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0117259 - Statistical analysis finds a measurable “contagion” window (~13 days) after highly publicized mass killings/school shootings, consistent with media-amplified imitation dynamics, suggesting intense coverage can exacerbate the problem.",
        "source_2": "World Health Organization. “Preventing suicide: A resource for media professionals – update 2017.” WHO, 2017. https://apps.who.int/iris/handle/10665/258814 - Summarizes evidence for the Werther effect (sensational or detailed suicide reporting increasing suicide rates) and the Papageno effect (responsible, help-focused stories reducing risk), indicating selective reporting choices can either worsen or alleviate a social problem.",
        "source_3": "Romer, Daniel; Jamieson, Kathleen Hall; Aday, Sean. “Television News and the Cultivation of Fear of Crime.” Journal of Communication, 2003. https://doi.org/10.1111/j.1460-2466.2003.tb03007.x - Finds that heavy exposure to crime-focused TV news cultivates disproportionate fear of crime and support for punitive policies even when crime rates are declining, showing selective issue emphasis can distort public perceptions with societal consequences.",
        "source_4": "Snyder, James M.; Strömberg, David. “Press Coverage and Political Accountability.” Journal of Political Economy, 2010. https://www.journals.uchicago.edu/doi/10.1086/653086 - Demonstrates that greater local press coverage of representatives improves voter knowledge and aligns policy (e.g., federal spending) more closely with constituent interests, countering the claim by showing selective coverage can enhance governance rather than worsen problems.",
        "source_5": "Soroka, Stuart; Fournier, Patrick; Nir, Lilach. “Cross-national evidence of a negativity bias in psychophysiological reactions to news.” PNAS, 2019. https://www.pnas.org/doi/10.1073/pnas.1908369116 - Provides evidence that audiences across countries react more strongly to negative news, implying that news selection often reflects human attention biases and market demand, complicating claims that media selectivity itself is the primary driver of societal harms.",
        "source_6": "Vosoughi, Soroush; Roy, Deb; Aral, Sinan. “The spread of true and false news online.” Science, 2018. https://www.science.org/doi/10.1126/science.aap9559 - Shows false news diffuses faster and farther on social media due to user-sharing dynamics and platform incentives, suggesting that algorithmic amplification and peer networks—rather than traditional editorial selectivity—may be central in creating or worsening certain social problems."
    }
}