{
    "question": "Should cyberbullies be punished with prison even if they are under 18?",
    "content": {
        "source_1": "Centers for Disease Control and Prevention (CDC) — Youth Risk Behavior Survey (YRBS) Data Summary & Trends Report 2011–2021 (2023). Reports that 16% of U.S. high school students were electronically bullied in the prior 12 months, with significantly higher rates among girls and LGBTQ+ youth; electronic bullying is strongly associated with persistent sadness/hopelessness and suicide risk. This public-health burden is often cited to justify stronger sanctions, including criminal penalties, to deter severe youth cyberbullying. https://www.cdc.gov/healthyyouth/data/yrbs/",
        "source_2": "State v. Bishop, 368 N.C. 869 (N.C. Sup. Ct. 2016). North Carolina’s Supreme Court struck down the state’s criminal cyberbullying statute as a content-based, overbroad restriction on speech violating the First Amendment. The ruling highlights constitutional obstacles to criminalizing teens’ online speech—and, by extension, to imposing mandatory prison for minors for cyberbullying. https://law.justia.com/cases/north-carolina/supreme-court/2016/5pa15-1.html",
        "source_3": "Aizer, A. & Doyle Jr., J. J. — Juvenile Incarceration, Human Capital, and Future Crime: Evidence from Randomly Assigned Judges (Quarterly Journal of Economics, 2015). Using quasi-experimental variation, the authors find that juvenile incarceration increases the likelihood of future criminal justice involvement and decreases educational attainment, indicating incarceration can worsen outcomes for youth. This evidence weighs against prison as a default response to cyberbullying by minors. https://academic.oup.com/qje/article/130/2/759/2330465",
        "source_4": "Canada Criminal Code s.162.1 (Non-consensual distribution of intimate images) and Youth Criminal Justice Act (YCJA). The Criminal Code makes certain severe forms of cyberbullying—such as sharing intimate images without consent—an indictable offence punishable by up to 5 years’ imprisonment; under the YCJA, youth (12–17) can receive custodial sentences in serious cases (though custody is a last resort). This framework shows that some jurisdictions explicitly allow incarceration of minors for severe cyberbullying-related conduct. Criminal Code s.162.1: https://laws-lois.justice.gc.ca/eng/acts/C-46/section-162.1.html; YCJA: https://laws-lois.justice.gc.ca/eng/acts/y-1.5/",
        "source_5": "Gaffney, H., Farrington, D. P., Espelage, D. L., & Ttofi, M. M. — Are cyberbullying intervention and prevention programs effective? A systematic and meta-analytical review (Aggression and Violent Behavior, 2019). The meta-analysis finds that school- and community-based programs produce significant reductions in cyberbullying perpetration and victimization, indicating non-carceral strategies can be effective and calling into question the necessity of prison-focused policies for minors. https://www.sciencedirect.com/science/article/pii/S1359178918303380"
    }
}