{
    "question": "Should we negotiate with terrorists?",
    "content": {
        "source_1": "Audrey Kurth Cronin, How Terrorism Ends: Understanding the Decline and Demise of Terrorist Campaigns (Princeton University Press, 2009). Synthesizing dozens of cases, Cronin shows that many terrorist campaigns wind down through political processes that include negotiation and integration of moderates, arguing that talks can fracture movements and create off-ramps that violence alone rarely achieves.",
        "source_2": "Rukmini Callimachi, “Paying Ransoms, Europe Bankrolls Qaeda Terror,” The New York Times, July 29, 2014. An investigative report documenting how European government ransom payments funneled hundreds of millions of dollars to al-Qaeda affiliates and coincided with a surge in kidnappings—evidence that negotiating concessions (e.g., cash) can incentivize more terrorism.",
        "source_3": "Centre of Competence on Humanitarian Negotiation (CCHN), Frontline Humanitarian Negotiation: A Field Manual for Practitioners, 2018 (ICRC, WFP, UNHCR, MSF, HD Centre). Outlines best practices for negotiating with armed non-state actors for humanitarian access, arguing that carefully framed, principled negotiations (distinct from political concessions) are often necessary to save lives without conferring political legitimacy.",
        "source_4": "House of Commons Library, “The Belfast/Good Friday Agreement at 25,” Research Briefing, April 6, 2023. Reviews the 1998 settlement with parties linked to the IRA and Loyalist paramilitaries; notes that sustained negotiations and power-sharing institutions were followed by a dramatic, durable reduction in conflict-related killings—evidence that talks with groups branded “terrorist” can underpin long-term peace.",
        "source_5": "Virginia Page Fortna, “Do Terrorists Win? Rebels’ Use of Terrorism and Civil War Outcomes,” International Organization, 69(3), 2015. Using cross-national data, Fortna finds that rebel groups employing terrorism are less likely to achieve concessions and more likely to be defeated, suggesting negotiations with such actors are comparatively less fruitful than with non-terroristic insurgents.",
        "source_6": "Special Inspector General for Afghanistan Reconstruction (SIGAR), “Collapse of the Afghan National Defense and Security Forces: An Assessment of the Factors That Led to Its Demise,” May 2023. Concludes that the 2020 Doha Agreement’s negotiation framework (including prisoner releases and exclusion of the Afghan government) undermined Afghan forces’ morale and legitimacy, helping precipitate state collapse—an example of negotiations backfiring by legitimizing and empowering a terrorist-designated group."
    }
}