{
    "question": "Should university education be free?",
    "content": {
        "source_1": "OECD (2023), Education at a Glance 2023 – “Tuition fees and student support.” Evidence: Countries with zero or very low tuition for domestic students (e.g., the Nordics, Germany) combine high tertiary entry rates with lower reliance on loans than high‐tuition systems, indicating that removing tuition can broaden access and reduce debt burdens.",
        "source_2": "Dynarski, S. (2016), “Why Free College Is Not the Answer,” Brookings Institution. Evidence: Universal free tuition is regressive because higher‐income youth are more likely to attend and therefore capture a larger share of subsidies; better-targeted grants deliver more progressive equity outcomes than making college free for all.",
        "source_3": "Mezza, A., Ringo, D., & Sherlund, S. (2019), “Student Loans and Homeownership,” FEDS Working Paper 2019-010, Federal Reserve Board. Evidence: Increases in student debt causally reduce homeownership among young adults by about 1–2 percentage points and delay household formation, suggesting that eliminating tuition (and associated borrowing) could yield broader economic benefits.",
        "source_4": "Institute for Fiscal Studies (2017), Belfield, C., Britton, J., Dearden, L., & van der Erve, L., “Higher Education funding in England: Past, present and options for the future.” Evidence: After England tripled tuition fees to £9,000 with income-contingent loans, university entry rates— including for disadvantaged 18-year-olds—continued to rise, implying that up-front free tuition is not necessary for maintaining access if repayment is income-based.",
        "source_5": "MDRC (2015; 2020 follow-up), Scrivener, S., Weiss, M. J., Ratledge, A., et al., “Doubling Graduation Rates: Three-Year Effects of CUNY’s Accelerated Study in Associate Programs (ASAP).” Evidence: Tuition waivers paired with intensive advising, scheduling support, and financial assistance doubled three-year graduation rates, indicating that making tuition free alone is insufficient; wraparound supports are critical to student success.",
        "source_6": "OECD (2020), Education at a Glance 2020 – Indicator A5 “The economic benefits of education.” Evidence: The public net present value of funding a tertiary graduate is positive in most OECD countries due to higher lifetime tax revenues and lower welfare use, supporting the view that fully publicly funded (free-to-students) university can yield net fiscal gains."
    }
}