{
    "question": "Should police body cameras be allowed?",
    "content": {
        "source_1": "Ariel, Barak; Farrar, Tony; Sutherland, Alex (2015). The Effect of Police Body-Worn Cameras on Use of Force and Citizens’ Complaints: A Randomized Controlled Trial. Journal of Quantitative Criminology. Findings from the Rialto, CA RCT showed a 59% reduction in use-of-force and an 87% reduction in citizen complaints when officers wore body cameras. https://link.springer.com/article/10.1007/s10940-014-9236-3",
        "source_2": "Yokum, David; Ravishankar, Anita; Coppock, Alexander (2017). Evaluating the Effects of Police Body-Worn Cameras: A Randomized Controlled Trial. The Lab @ DC. A large RCT in Washington, DC found no statistically significant effects of body cameras on use-of-force or citizen complaints, suggesting cameras may not change outcomes absent other policy changes. https://bwc.thelab.dc.gov/",
        "source_3": "Lum, Cynthia; Koper, Christopher S.; Wilson, David B. (2019, updated 2020). Body-worn cameras’ effects on police officers and citizen behavior: A systematic review. Campbell Systematic Reviews. Synthesizing dozens of studies, the review finds consistent reductions in complaints but mixed or null effects on use-of-force, with outcomes moderated by activation policies and supervision. https://onlinelibrary.wiley.com/doi/10.1002/cl2.1059",
        "source_4": "ACLU (Jay Stanley) (2015). Police Body-Mounted Cameras: With Right Policies in Place, a Win for All. The ACLU supports allowing body cameras but only with strict safeguards (e.g., limits on retention, public access rules, protections for sensitive victims) to balance accountability with privacy. https://www.aclu.org/issues/privacy-technology/surveillance-technologies/police-body-cameras",
        "source_5": "Police Executive Research Forum (2014). Implementing a Body-Worn Camera Program: Recommendations and Lessons Learned. PERF documents substantial costs and operational burdens (data storage, FOIA processing, training, policy development) and highlights privacy concerns for officers and civilians, cautioning that implementation is complex and resource-intensive. https://www.policeforum.org/assets/bodyworncameraguide.pdf",
        "source_6": "Georgetown Law Center on Privacy & Technology (2016). The Perpetual Line-Up: Unregulated Police Face Recognition in America. Warns that integrating face recognition with body cameras could enable real-time, pervasive surveillance and exacerbate bias, underscoring civil liberties risks if cameras are allowed without strong prohibitions on such uses. https://www.perpetuallineup.org/"
    }
}