{
    "question": "Should the spread of nuclear weapons be encouraged?",
    "content": {
        "source_1": "Kenneth N. Waltz, “The Spread of Nuclear Weapons: More May Be Better,” Adelphi Paper 171, International Institute for Strategic Studies, 1981. Argues that nuclear weapons induce caution by raising the costs of war, so a gradual spread among rational states can stabilize international politics through robust mutual deterrence.",
        "source_2": "John J. Mearsheimer, “The Case for a Ukrainian Nuclear Deterrent,” Foreign Affairs, 72(3), 1993. Contends that additional nuclear states can enhance regional stability in specific cases; he argues Ukraine retaining nuclear weapons would have deterred Russian aggression, illustrating a context in which “more” could be better.",
        "source_3": "Scott D. Sagan, “The Perils of Proliferation: Organization Theory, Deterrence Theory, and the Spread of Nuclear Weapons,” International Security, 18(4), 1994, pp. 66–107. Uses organizational theory to show that real-world militaries are prone to accidents, misperception, and unauthorized use, implying that more nuclear states raise the probability of catastrophic failure despite deterrence logic.",
        "source_4": "S. Paul Kapur, Dangerous Deterrent: Nuclear Weapons Proliferation and Conflict in South Asia, Stanford University Press, 2007. Provides evidence for the stability–instability paradox in the India–Pakistan rivalry, arguing that nuclearization encouraged risk-taking and limited conflicts under the nuclear shadow, suggesting more proliferators can worsen subnuclear instability.",
        "source_5": "Todd S. Sechser and Matthew Fuhrmann, Nuclear Weapons and Coercive Diplomacy, Cambridge University Press, 2017. Offers large-N evidence that nuclear weapons are poor tools for coercion and compellence; even if they deter invasion, their spread is unlikely to yield broader strategic benefits often assumed by “more is better” arguments.",
        "source_6": "Matthew Bunn, Martin B. Malin, Nickolas Roth, and William H. Tobey, “Preventing Nuclear Terrorism: Continuous Improvement for a Complicated Problem,” Belfer Center, Harvard Kennedy School, March 2016. Emphasizes that more nuclear states and facilities expand opportunities for theft and illicit trafficking of nuclear materials, increasing nuclear terrorism risks not captured by traditional state-to-state deterrence models."
    }
}