{
    "question": "Should the Keystone XL pipeline be built?",
    "content": {
        "source_1": "U.S. Department of State, Final Supplemental Environmental Impact Statement (Jan 2014) — Estimates the Keystone XL project would support about 42,100 direct, indirect, and induced jobs during the two-year construction period (with roughly $2 billion in associated worker earnings) but only about 35 permanent operations jobs thereafter; also projects substantial, short-term local spending and state/local tax revenues along the route. Perspective: pro (near-term economic activity and tax base).",
        "source_2": "Erickson, P. & Lazarus, M., Nature Climate Change (2014), “Impact of the Keystone XL pipeline on global oil markets and greenhouse gas emissions.” — Finds that by lowering transportation costs and enabling additional oil sands output, KXL could increase global oil consumption and add on the order of ~27 million metric tons CO2 per year, offsetting claims that the pipeline would have negligible climate effects. Perspective: con (stimulates additional emissions via induced supply).",
        "source_3": "Fraser Institute (2015), “Intermodal Safety in the Transport of Oil.” — Using U.S. and Canadian incident data, concludes that, per barrel-mile moved, pipelines experience fewer accidents and injuries than rail, implying that if the crude moves regardless, pipelines reduce transport accident risk compared to rail shipment. Perspective: pro (relative safety advantage over rail).",
        "source_4": "U.S. Department of Transportation, PHMSA Corrective Action Order to TC Oil Pipeline Operations, Inc. (Dec 8, 2022) — Documents the Keystone system rupture near Washington County, Kansas, spilling about 14,000 barrels of crude—among the largest U.S. onshore pipeline spills in years—highlighting risks of high-volume spills, environmental damage, and costly cleanups even on modern systems. Perspective: con (demonstrated spill risk and consequences).",
        "source_5": "Congressional Research Service, “Keystone XL Pipeline: Background and Selected Issues” (e.g., CRS Report R41668, multiple updates circa 2013–2017) — Assesses that because U.S. gasoline prices are tied to global crude markets, KXL’s effect on U.S. retail fuel prices would likely be minimal, challenging claims of consumer price relief from the project. Perspective: con (limited benefit to U.S. gasoline consumers).",
        "source_6": "U.S. Energy Information Administration (EIA), Today in Energy analyses (2014–2016) on Gulf Coast refinery configurations and crude slates — Reports that many Gulf Coast refineries are configured to run heavy sour crude and have increasingly substituted Canadian heavy crude for declining Venezuelan/Mexican supplies; additional pipeline capacity from Canada would support secure feedstock for these refineries and reduce reliance on less stable sources. Perspective: pro (energy security and refining-fit rationale)."
    }
}