{
    "question": "Should companies be prohibited from collecting and selling their clients' personal data?",
    "content": {
        "source_1": "Federal Trade Commission (2014). Data Brokers: A Call for Transparency and Accountability. Key finding: data brokers aggregate and sell detailed, sensitive profiles about individuals with little transparency or consumer control, creating risks of discrimination and misuse. Link: https://www.ftc.gov/reports/data-brokers-call-transparency-accountability-report-federal-trade-commission-may-2014",
        "source_2": "UK Information Commissioner’s Office (2018). Investigation into the use of data analytics in political campaigns. Key finding: large-scale harvesting and sale of personal data (e.g., via Facebook) enabled microtargeting and voter manipulation, undermining democratic processes and highlighting harms of commercial data trading. Link: https://ico.org.uk/media/action-weve-taken/2259369/investigation-into-data-analytics-in-political-campaigns-final-20181105.pdf",
        "source_3": "U.S. Government Accountability Office (2018). Data Protection: Actions Taken by Equifax and Federal Agencies in Response to the 2017 Breach (GAO-18-559). Key finding: the Equifax breach exposed highly sensitive personal data of over 145 million people, illustrating systemic security risks when companies collect and warehouse client data at scale. Link: https://www.gao.gov/products/gao-18-559",
        "source_4": "Goldfarb, A. & Tucker, C. (2011). Privacy Regulation and Online Advertising. Management Science, 57(1), 57–71. Key finding: stricter privacy rules in the EU reduced the effectiveness of online advertising, implying revenue harms to publishers and potential reductions in free, ad-supported content if data collection/sale is curtailed. Link: https://pubsonline.informs.org/doi/abs/10.1287/mnsc.1100.1246",
        "source_5": "Jappelli, T. & Pagano, M. (1993). Information Sharing in Credit Markets. The Journal of Finance, 48(5), 1693–1718. Key finding: sharing personal credit data (via bureaus/registries) reduces default and expands access to credit, indicating that outright bans on collecting/selling certain personal data could harm financial inclusion and market efficiency. Link: https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1540-6261.1993.tb05124.x",
        "source_6": "Chang, S. et al. (2020). Mobility network models of COVID-19 explain inequities and inform reopening. Nature, 589, 82–87. Key finding: aggregated, anonymized mobile location data enabled accurate modeling of disease spread and targeted policy responses, demonstrating societal benefits from some forms of personal data collection (even if sale is restricted). Link: https://www.nature.com/articles/s41586-020-2923-3"
    }
}