{
    "question": "Should financial assistance for the poor be the responsibility of charities rather than the government?",
    "content": {
        "source_1": "Giving USA 2024: The Annual Report on Philanthropy for the Year 2023 (Lilly Family School of Philanthropy, 2024). Evidence: While total U.S. charitable giving is large, only a minority goes to human services/poverty relief; the largest shares flow to religion and education. Human services typically receive roughly 12–14% of donations, indicating donor priorities don’t systematically target the poorest. https://givingusa.org/",
        "source_2": "Auten, G., Sieg, H., & Clotfelter, C. (2002). Charitable Giving, Income, and Taxes: An Analysis of Panel Data. American Economic Review. Evidence: Charitable giving is highly responsive to income (income elasticity near or above 1 in many estimates), implying donations fall when incomes fall—precisely when need rises—highlighting the procyclical fragility of relying on charity during downturns. (Working paper version: NBER Working Paper No. 7534) https://www.nber.org/papers/w7534",
        "source_3": "Andreoni, J., & Payne, A. A. (2011). Is crowding out due entirely to fundraising? Evidence from a panel of charities. Journal of Public Economics. Evidence: Increases in government grants substantially “crowd out” private donations, primarily by reducing charities’ fundraising; estimates suggest large displacement of private giving per public dollar, supporting the view that government expansion can supplant, rather than complement, private charity. https://doi.org/10.1016/j.jpubeco.2011.03.011",
        "source_4": "Haushofer, J., & Shapiro, J. (2016). The Short-Term Impact of Unconditional Cash Transfers to the Poor: Experimental Evidence from Kenya. Quarterly Journal of Economics. Evidence: An NGO-delivered, privately funded intervention (unconditional cash transfers) produced significant gains in consumption, assets, and psychological well-being, showing that private charitable aid can be efficient, targeted, and impactful at improving welfare. https://doi.org/10.1093/qje/qjw025",
        "source_5": "U.S. Census Bureau (2022). The Supplemental Poverty Measure: 2021 (P60-275). Evidence: Government programs kept tens of millions out of poverty; Social Security alone kept about 26 million people above the poverty line, refundable tax credits about 9–10 million, and SNAP about 2–3 million—demonstrating the scale and reliability of public transfers relative to private aid. https://www.census.gov/library/publications/2022/demo/p60-275.html",
        "source_6": "Beito, D. T. (2000). From Mutual Aid to the Welfare State: Fraternal Societies and Social Services, 1890–1967. University of North Carolina Press. Evidence: Before the modern welfare state, voluntary mutual-aid and fraternal societies provided sickness, burial, and income support to large shares of workers, illustrating civil society’s historical capacity to deliver assistance—albeit with uneven coverage and exclusions. https://uncpress.org/book/9780807848418/from-mutual-aid-to-the-welfare-state/"
    }
}