{
    "question": "Should corporal punishment be reintroduced?",
    "content": {
        "source_1": "American Academy of Pediatrics (2018). Effective Discipline to Raise Healthy Children. Pediatrics, 142(6):e20183112. Summary: Reviews neuroscience and longitudinal evidence, concluding corporal punishment increases aggression and behavior problems, does not improve long-term compliance, and should be avoided in favor of nonviolent discipline.",
        "source_2": "Gershoff, E. T., & Grogan-Kaylor, A. (2016). Spanking and child outcomes: Old controversies and new meta-analyses. Journal of Family Psychology, 30(4), 453–469. Summary: Meta-analysis of 75 studies finds spanking is associated with higher aggression, antisocial behavior, mental health problems, and worse parent–child relationships, with no evidence of positive outcomes.",
        "source_3": "Larzelere, R. E., & Kuhn, B. R. (2005). Comparing child outcomes of physical punishment and alternative disciplinary tactics: A meta-analysis. Clinical Child and Family Psychology Review, 8(1), 1–37. Summary: Reports that “conditional” nonabusive spanking used with 2–6-year-olds to back up time-out can produce greater immediate compliance than many alternatives, suggesting potential limited, context-specific effectiveness.",
        "source_4": "Baumrind, D., Larzelere, R. E., & Cowan, P. A. (2002). Ordinary physical punishment: New findings and policy implications. Psychological Bulletin, 128(4), 580–589. Summary: Argues that customary, nonabusive physical punishment within supportive family contexts is not reliably linked to detrimental outcomes, and cautions against blanket prohibitions—supporting a more nuanced, limited-use perspective.",
        "source_5": "UN Committee on the Rights of the Child (2006). General Comment No. 8: The right of the child to protection from corporal punishment and other cruel or degrading forms of punishment. Summary: Interprets corporal punishment as a violation of children’s rights to dignity and protection from violence; alongside global tracking by organizations such as End Corporal Punishment shows a growing international trend toward full legal prohibition, weighing against reintroduction on human-rights grounds.",
        "source_6": "National Institute of Justice (2016). Five Things About Deterrence. Summary: Synthesizes criminological evidence that certainty (not severity) of punishment is the key deterrent; increasing severity alone rarely deters misbehavior—undercutting claims that reintroducing corporal punishment would be an effective deterrent in justice or school settings."
    }
}