{
    "question": "Should nuclear technology be adopted?",
    "content": {
        "source_1": "[IPCC AR6 Working Group III (2022), Chapter 6 – Energy Systems: Finds nuclear power’s lifecycle greenhouse gas emissions are among the lowest of all electricity sources (median ~12 gCO2-e/kWh), comparable to wind and far below fossil fuels. Many 1.5–2°C mitigation pathways include maintaining or expanding nuclear capacity, while noting constraints such as costs, siting, and public acceptance. https://www.ipcc.ch/report/ar6/wg3/]",
        "source_2": "[Lazard Levelized Cost of Energy Analysis, Version 16.0 (2023): Estimates new-build nuclear has among the highest LCOE of major generation options ($141–$221/MWh), significantly above utility-scale wind and solar. Suggests that, on cost grounds, expanding renewables and storage is generally more economical than building new nuclear. https://www.lazard.com/perspective/levelized-cost-of-energy-levelized-cost-of-storage-and-levelized-cost-of-hydrogen/]",
        "source_3": "[Sepulveda, Jenkins, de Sisternes, Lester (2018), Joule – The Role of Firm Low-Carbon Electricity Resources: System modeling shows decarbonized grids that include firm low-carbon resources (e.g., nuclear, CCS, geothermal) are substantially cheaper and more reliable than portfolios relying only on variable renewables plus storage; in some scenarios, excluding firm resources drives system costs multiple times higher. https://doi.org/10.1016/j.joule.2018.08.006]",
        "source_4": "[U.S. Government Accountability Office (2021–2023), Commercial Spent Nuclear Fuel reports: The U.S. lacks a permanent geological repository; over 86,000 metric tons of spent fuel remain stored at reactor sites, creating long-term safety, security, and financial liabilities. Progress on consent-based interim storage and disposal has been slow. https://www.gao.gov/products/gao-21-603 and https://www.gao.gov/nuclear-waste]",
        "source_5": "[Reuters (2024), Vogtle Units 3 & 4 case study: The first new U.S. reactors in decades entered service years late and massively over budget—project costs exceeded $30 billion versus initial estimates around $14 billion—highlighting schedule and cost overrun risks that can hinder rapid nuclear deployment. https://www.reuters.com/business/energy/us-oks-operation-georgia-nuclear-reactor-first-built-since-90s-2023-07-31/]",
        "source_6": "[Jarvis, Deschenes, Kaestner (2022), Nature Energy – Impacts of Germany’s Nuclear Phase-out: Empirical analysis finds the shutdown increased coal-fired generation, raising CO2 emissions and air pollution, with an estimated ~1,100 additional premature deaths per year—illustrating potential environmental and health costs of forgoing nuclear. https://doi.org/10.1038/s41560-022-01076-2]"
    }
}