{
    "question": "Is aid killing Africa?",
    "content": {
        "source_1": "Dambisa Moyo (2009). Dead Aid: Why Aid Is Not Working and How There Is a Better Way for Africa. Farrar, Straus and Giroux. — Argues that long-term government-to-government aid entrenches corruption, undermines tax collection and accountability, and creates dependency, ultimately depressing growth; advocates replacing aid with market financing and trade.",
        "source_2": "Nathan Nunn and Nancy Qian (2014). US Food Aid and Civil Conflict. American Economic Review, 104(6): 1630–1666. — Using instrumental variables linked to US wheat surpluses, finds that increases in US food aid raise the incidence and duration of civil conflict in recipient countries, showing a channel through which certain aid flows can inadvertently fuel violence.",
        "source_3": "Eran Bendavid, Charles Bhattacharya, and Jay Bhattacharya (2012). The Effect of the President’s Emergency Plan for AIDS Relief on HIV-Related Outcomes. JAMA, 307(21): 2060–2067. — Evaluating PEPFAR’s rollout in Africa, finds a roughly 10% reduction in all-cause adult mortality in focus countries relative to comparators, indicating large, measurable life-saving benefits from targeted health aid.",
        "source_4": "Raghuram G. Rajan and Arvind Subramanian (2011). Aid, Dutch Disease, and Manufacturing Growth. Journal of Development Economics, 94(1): 106–118. — Provides evidence that sizable aid inflows appreciate real exchange rates and are associated with slower growth in export-oriented manufacturing, suggesting macroeconomic side effects that can weaken structural transformation.",
        "source_5": "Craig Burnside and David Dollar (2000). Aid, Policies, and Growth. American Economic Review, 90(4): 847–868. — Finds that aid raises growth in countries with sound fiscal, monetary, and trade policies but not in poor-policy environments, implying that the effectiveness of aid depends on domestic governance and policy quality rather than aid being inherently harmful or beneficial.",
        "source_6": "Johannes Haushofer and Jeremy Shapiro (2016). The Short-Term Impact of Unconditional Cash Transfers to the Poor: Experimental Evidence from Kenya. Quarterly Journal of Economics, 131(4): 1973–2042. — A randomized trial of cash transfers finds substantial gains in consumption, assets, and psychological well-being, with limited price inflation or distortions, demonstrating that certain aid modalities (direct cash) can produce tangible welfare improvements without the governance pitfalls of government-to-government aid."
    }
}