{
    "question": "Should there be a progressive tax rate?",
    "content": {
        "source_1": "Piketty, Saez, and Stantcheva (2014), “Optimal Taxation of Top Labor Incomes: A Tale of Three Elasticities.” Argues that when top incomes reflect rents and avoidance is curbed, the revenue-maximizing top marginal rate can be very high (around 70%), supporting strong progressivity to reduce inequality with limited efficiency costs. https://www.nber.org/papers/w17616",
        "source_2": "Ostry, Berg, and Tsangarides (2014), IMF Staff Discussion Note “Redistribution, Inequality, and Growth.” Finds that redistribution through taxes and transfers is generally not harmful to growth and that inequality undermines growth, implying well-designed progressive taxation can support both equity and long-run performance. https://www.imf.org/en/Publications/Staff-Discussion-Notes/Issues/2016/12/31/Redistribution-Inequality-and-Growth-41291",
        "source_3": "Mertens and Montiel Olea (2018), “Marginal Tax Rates and Income: New Time Series Evidence,” Quarterly Journal of Economics. Estimates that reductions in marginal tax rates significantly raise taxable income and output, suggesting steep progressivity can depress incentives and growth. https://academic.oup.com/qje/article/133/4/1803/5025668",
        "source_4": "Slemrod and Yitzhaki (2002), “Tax avoidance, evasion, and administration,” Handbook of Public Economics. Shows higher marginal rates increase avoidance/evasion and compliance costs; without strong enforcement and base-broadening, greater progressivity can yield high efficiency losses and limited revenue. https://www.nber.org/chapters/c11054",
        "source_5": "Auerbach and Feenberg (2000), “The Significance of Federal Taxes as Automatic Stabilizers,” NBER Working Paper 7662. Documents that a progressive income tax dampens business-cycle volatility by automatically adjusting net incomes with shocks, a macroeconomic benefit of progressivity. https://www.nber.org/papers/w7662",
        "source_6": "Ivanova, Keen, and Klemm (2005), “The Russian Flat Tax Reform,” IMF Working Paper 05/16. Case study showing that moving to a flat (less progressive) 13% income tax in 2001 led to large increases in reported incomes and revenues via improved compliance, challenging the view that progressivity is necessary for revenue or efficiency. https://www.imf.org/en/Publications/WP/Issues/2016/12/31/The-Russian-Flat-Tax-Reform-17981"
    }
}