{
    "question": "Should smoking be further restricted?",
    "content": {
        "source_1": "World Health Organization — MPOWER tobacco control reports: Synthesizes global evidence that stronger smoke-free laws, higher excise taxes, plain packaging, and advertising bans reduce smoking prevalence and prevent tobacco-related disease and deaths. Finds countries that fully implement comprehensive restrictions see faster declines in use. Perspective: Supports further restrictions to improve population health.",
        "source_2": "U.S. Surgeon General — Report on the Health Consequences of Involuntary Exposure to Tobacco Smoke: Concludes there is no risk-free level of secondhand smoke and that smoke-free policies protect workers and children, reducing cardiovascular and respiratory events. Emphasizes that voluntary measures are insufficient in shared indoor spaces. Perspective: Supports further restrictions in public and workplaces to protect non-smokers.",
        "source_3": "Cochrane Review — Electronic cigarettes for smoking cessation: Meta-analysis finds nicotine e‑cigarettes can help adults quit smoking more effectively than nicotine replacement therapy or no aid, with substantially lower toxicant exposure than combustible cigarettes. Warns that sweeping restrictions that also limit vaping access may reduce quitting and unintentionally sustain cigarette use. Perspective: Opposes broad-brush restrictions; favors targeted limits on smoking while preserving harm-reduction options.",
        "source_4": "ACLU and civil rights groups — Statements on menthol/flavor bans and enforcement: Argue that expansive bans risk increasing police–community interactions and enforcement disparities, especially in Black communities with higher menthol use. Recommend public-health approaches (education, cessation support) over criminalizing retail or consumer behavior. Perspective: Questions further restrictive policies if they expand punitive enforcement; urges non-carceral alternatives.",
        "source_5": "Tax Foundation — Analyses of cigarette taxes and flavor bans: Documents that large tax differentials and product bans can spur cross-border purchasing and illicit trade, undermining public-health goals and state revenues (e.g., post-ban shifts to neighboring jurisdictions). Notes that without strong anti-smuggling measures, restrictions may be partially circumvented. Perspective: Cautions that further restrictions can have unintended market consequences unless paired with enforcement against illicit supply.",
        "source_6": "National Association of Convenience Stores (NACS) — Industry submissions on flavor/menthol policies: Claims bans significantly reduce legitimate retail sales, harm small businesses, and shift consumers to illegal markets or unregulated sellers. Proposes alternative measures such as strict age-verification, retailer licensing, and targeted enforcement against bad actors. Perspective: Opposes further restrictions that remove legal products from regulated channels; favors compliance-focused approaches."
    }
}