{
    "question": "Should universities make all academic work they produce, including scholarly articles, course handbooks, and recorded lectures, available to the general public?",
    "content": {
        "source_1": "White House Office of Science and Technology Policy (2022) — “Ensuring Free, Immediate, and Equitable Access to Federally Funded Research.” Directs U.S. agencies to ensure peer‑reviewed publications and supporting data from federally funded research are publicly accessible without embargo by 2026, arguing this accelerates discovery and equitable access. Supports public release of scholarly articles.",
        "source_2": "UNESCO (2019) — “Recommendation on Open Educational Resources (OER).” Urges member states to adopt open licensing for publicly funded educational materials to expand access, reduce costs, and improve quality through collaboration, aligning with making course handbooks and recorded lectures openly available.",
        "source_3": "MIT OpenCourseWare — Program overview and impact reports. MIT has openly published materials from over 2,400 courses, including many recorded lectures, used by millions of learners and educators worldwide; surveys indicate reuse in teaching and measurable self‑learning benefits. Demonstrates feasibility and public value of releasing course content.",
        "source_4": "UC Berkeley News (2017) — Announcement on restricting public access to lecture videos after DOJ findings. Following a U.S. Department of Justice determination that many public lectures lacked required captions under disability law, Berkeley removed or limited thousands of recordings rather than incur remediation costs, highlighting legal and financial burdens of making all recorded lectures public.",
        "source_5": "U.S. Department of Education (2019) — “FAQs on Photos and Videos under FERPA.” Clarifies that class recordings with identifiable students are education records; public release generally requires consent or redaction. Indicates that mandatory public posting of recorded lectures can conflict with student privacy protections and chill classroom participation.",
        "source_6": "U.S. Patent and Trademark Office — 35 U.S.C. §102 novelty guidance and public disclosure rules. Public disclosure of an invention before filing can forfeit patent rights in many jurisdictions (and constrain them in the U.S.); universities’ tech‑transfer programs rely on patentability for licensing and startups. Suggests that blanket immediate openness of all research outputs could impede commercialization and societal uptake via patents."
    }
}