{
    "question": "Is the ICC an effective deterrent?",
    "content": {
        "source_1": "Hyeran Jo and Beth A. Simmons, “Can the International Criminal Court Deter Atrocity?” International Organization 70(3), 2016. https://doi.org/10.1017/S0020818316000114 - Large-N analysis finds ICC membership and prosecutorial activity are associated with reductions in intentional killing by governments and rebels under certain domestic conditions, suggesting a measurable (conditional) deterrent effect.",
        "source_2": "International Criminal Court, “Cases” (official docket and outcomes). https://www.icc-cpi.int/cases - The Court’s own case record shows relatively few final convictions and very lengthy proceedings over more than two decades, evidence critics cite to argue that low certainty and slowness of punishment limit any general deterrent effect.",
        "source_3": "International Crisis Group, “Sudan: Justice, Peace and the ICC,” Africa Report No. 152, 17 June 2009. https://www.crisisgroup.org/africa/horn-africa/sudan/sudan-justice-peace-and-icc - Case study of the 2009 arrest warrant for President al-Bashir concludes it did not curb violence in Darfur and initially provoked regime backlash (including NGO expulsions), reinforcing claims that ICC action may fail to deter—and can even worsen—short-term behavior by targeted leaders.",
        "source_4": "Jack Snyder and Leslie Vinjamuri, “Trials and Errors: Principle and Pragmatism in Strategies of International Justice,” International Security 28(3), 2003/04. https://www.jstor.org/stable/4137515 - Theoretical and historical analysis argues prosecutions often lack deterrent power absent robust political incentives and enforcement, and can be counterproductive in ongoing conflicts where perpetrators expect impunity or retaliation.",
        "source_5": "Nic Cheeseman, Gabrielle Lynch, and Justin Willis, “Kenya’s 2013 elections: Choosing peace over democracy?” African Affairs 113(450), 2014. https://academic.oup.com/afraf/article/113/450/311/182993 - Finds Kenya’s markedly reduced electoral violence stemmed from multiple factors—security preparations, elite pacts, and “peace” messaging—with some actors explicitly citing the ICC’s scrutiny; suggests any ICC deterrence is context-dependent and indirect.",
        "source_6": "BBC News, “Putin to skip South Africa BRICS summit after ICC arrest warrant,” 19 July 2023. https://www.bbc.com/news/world-africa-66247864 - The ICC warrant constrained a head of state’s international travel plans, indicating the Court can impose real costs on leaders—an effect some interpret as limited deterrence, though it falls short of deterring alleged core crimes."
    }
}