{
    "question": "Should there be a limit on homework?",
    "content": {
        "source_1": "Cooper, Harris; Robinson, Jorgianne; Patall, Erika (2006). “Does Homework Improve Academic Achievement? A Synthesis of Research, 1987–2003.” Review of Educational Research. Finds negligible academic benefits of homework in elementary grades, moderate in middle school, and stronger in high school; popularized the “10‑minute rule” guideline (10 minutes per grade level), supporting age-based limits to avoid diminishing returns.",
        "source_2": "Galloway, Mollie K.; Conner, Jerusha; Pope, Denise (2013). “Nonacademic Effects of Homework in Privileged, High-Performing High Schools.” Journal of Experimental Education, 81(4), 490–510. In high-achieving schools, students averaging over 3 hours of homework nightly reported higher stress, physical health complaints, and sleep deprivation, indicating that excessive homework can harm well-being and suggesting a rationale for caps.",
        "source_3": "OECD (2014). PISA in Focus No. 46: “Does homework perpetuate the advantages of the wealthy?” Cross-national analysis shows students from advantaged homes spend more time on homework and gain more from it; systems with greater homework time tend to have wider socio-economic achievement gaps, implying that limits or structured support may be needed to reduce inequity.",
        "source_4": "Education Endowment Foundation (EEF) Teaching and Learning Toolkit – “Homework (Secondary)” (most recent update). Synthesizes experimental evidence showing a positive average impact of secondary homework (around +5 months progress), particularly when tasks are purposeful and receive feedback; does not identify an optimal time cap, suggesting quality and design matter more than blanket limits.",
        "source_5": "Roediger, Henry L.; Karpicke, Jeffrey D. (2006). “Test-Enhanced Learning: Taking Memory Tests Improves Long-Term Retention.” Psychological Science, 17(3), 249–255. Demonstrates that frequent retrieval practice and spacing enhance long-term retention; implies that learning gains come from regular, distributed practice rather than total minutes, cautioning that rigid time caps could constrain effective practice in skills-heavy subjects.",
        "source_6": "Loveless, Tom (2014). The 2014 Brown Center Report on American Education: How Well Are American Students Learning? Brookings Institution. Uses NAEP and other data to show most U.S. students report about an hour or less of homework per night and that very heavy loads are uncommon, arguing that system-wide limits may target a problem that is not widespread."
    }
}