{
    "question": "Should music that glorifies violence against women be banned?",
    "content": {
        "source_1": "Barongan, C., & Hall, G. C. N. (1995). The influence of misogynous rap music on sexual aggression against women. Psychology of Women Quarterly, 19(2), 195–207. https://onlinelibrary.wiley.com/doi/10.1111/j.1471-6402.1995.tb00286.x - Experimental study finding that men exposed to misogynistic rap were more likely to choose sexually aggressive fantasies toward women than those exposed to neutral music, suggesting such lyrics can prime aggression against women.",
        "source_2": "UN Committee on the Elimination of Discrimination against Women (2017). General recommendation No. 35 on gender-based violence against women, updating general recommendation No. 19. https://www.ohchr.org/en/documents/general-comments-and-recommendations/general-recommendation-no35-gender-based-violence - Calls on states to regulate and monitor media and advertising that perpetuate harmful gender stereotypes and condone gender-based violence, providing a human-rights basis for restricting content that glorifies violence against women.",
        "source_3": "Brown v. Entertainment Merchants Association, 564 U.S. 786 (2011). U.S. Supreme Court. https://supreme.justia.com/cases/federal/us/564/786/ - The Court struck down a content-based restriction on violent media, affirming that violent expression is protected speech; this precedent suggests government bans on music for violent or misogynistic content would face serious constitutional hurdles in the United States.",
        "source_4": "Nielson, E., & Dennis, A. L. (2019). Rap on Trial: Race, Lyrics, and Guilt in America. The New Press. https://thenewpress.com/books/rap-on-trial - Documents how authorities have used rap lyrics as evidence, disproportionately targeting Black artists; raises concerns that bans or policing of “violent” or “misogynistic” music risk discriminatory enforcement and chilling artistic expression.",
        "source_5": "Germany’s Federal Department for Media Harmful to Young Persons indexes Bushido’s “Sonny Black” for misogyny and homophobia (2015). Deutsche Welle. https://www.dw.com/en/germany-indexes-bushidos-album-for-homophobia-and-misogyny/a-18253901 - Example of a democratic country restricting distribution and promotion (especially to minors) of music deemed harmful due to misogynistic content, illustrating a regulatory approach short of outright bans."
    }
}