{
    "question": "Should there be child curfews?",
    "content": {
        "source_1": "Wilson, D.B., Olaghere, A., & Kimbrell, C. (2016). Campbell Systematic Review on juvenile curfews. Synthesis of quasi-experimental evaluations found curfews do not meaningfully reduce juvenile crime or victimization on average; some estimates even suggested slight increases during curfew hours, indicating weak or counterproductive effects.",
        "source_2": "Carr, J.J., & Doleac, J.L. (2016/2017). “Keep the Kids Inside? Juvenile Curfews and Urban Gun Violence.” Using Washington, DC’s ShotSpotter data in a difference-in-differences design, the authors found gunfire incidents increased substantially (roughly 150%) during curfew hours, consistent with an “eyes on the street” mechanism where emptying public spaces can embolden offenders.",
        "source_3": "Office of Juvenile Justice and Delinquency Prevention (OJJDP). Juvenile Offenders and Victims: National Report (e.g., Sickmund & Puzzanchera, 2014/2019 updates). Time-of-day analyses show juvenile violent offending peaks in the after-school period (approximately 3–7 p.m. on school days) and is far lower late at night, suggesting general nighttime curfews target hours with comparatively less juvenile crime.",
        "source_4": "Qutb v. Strauss, 11 F.3d 488 (5th Cir. 1993). The Fifth Circuit upheld Dallas’s juvenile curfew, finding a compelling government interest in reducing juvenile crime and victimization and concluding the ordinance was narrowly tailored with multiple exceptions. This precedent supports the position that, when crafted carefully, child curfews can be constitutionally permissible tools for public safety.",
        "source_5": "U.S. Conference of Mayors (1997). “A Status Report on Juvenile Curfews in America’s Cities.” A national survey of municipalities reported that a majority of cities implementing curfews believed they experienced declines in juvenile crime and victimization following adoption, reflecting practitioner perceptions of benefits (though the survey is descriptive and not causal evidence).",
        "source_6": "Insurance Institute for Highway Safety (IIHS) syntheses on Graduated Driver Licensing (various reports; see also Masten & Foss, Journal of Safety Research, 2010). Nighttime driving restrictions—a targeted form of youth curfew within GDL systems—are consistently associated with substantial reductions in crash and injury rates among 16–17-year-olds, indicating that narrowly focused, risk-specific curfews can be effective in improving youth safety."
    }
}