{
    "question": "Should adults have the right to carry a concealed handgun?",
    "content": {
        "source_1": "Lott, John R. More Guns, Less Crime (University of Chicago Press, 3rd ed., 2010). Using county-level panel data, Lott argues that “shall-issue” right-to-carry laws deter criminals and are associated with reductions in violent crimes such as murder, rape, and robbery—supporting the view that allowing concealed carry can improve public safety through deterrence.",
        "source_2": "Donohue, John J., Abhay Aneja, and Kyle D. Weber. Right-to-Carry Laws and Violent Crime: A Comprehensive Assessment Using Panel Data and a State-Level Synthetic Controls Analysis (NBER Working Paper No. 23510, 2017; updated 2019). This analysis finds that right-to-carry laws are associated with long-run increases in violent crime (on the order of roughly 13–15% a decade after adoption), indicating that expanding concealed carry may worsen public safety.",
        "source_3": "National Research Council. Firearms and Violence: A Critical Review (National Academies Press, 2004). A methodological review concluding that the evidence available at the time was too mixed and limited to determine whether right-to-carry laws decrease or increase crime—highlighting substantial empirical uncertainty about the net effects of concealed carry.",
        "source_4": "Kleck, Gary, and Marc Gertz. Armed Resistance to Crime: The Prevalence and Nature of Self-Defense with a Gun. Journal of Criminal Law & Criminology, 86(1), 1995. Survey-based research estimating roughly 2.5 million defensive gun uses annually, with many incidents resolved without shots fired—used by proponents to argue that the ability to carry concealed handguns materially aids self-defense.",
        "source_5": "Texas Department of Public Safety. Conviction Rates for Texas License to Carry (LTC) Holders (Annual Reports, e.g., 2021). Administrative data showing Texas LTC holders are convicted of crimes at substantially lower rates than non-LTC adults—cited to argue that vetted permit holders are highly law-abiding and pose limited risk when allowed to carry concealed.",
        "source_6": "New York State Rifle & Pistol Association, Inc. v. Bruen, 597 U.S. ___ (2022). The U.S. Supreme Court held that the Second Amendment protects an individual’s right to carry a handgun in public for self-defense and struck down “proper cause” permitting schemes—framing concealed carry as a constitutional right grounded in text and historical tradition rather than solely empirical public-safety outcomes."
    }
}