{
    "question": "Should EU member states guarantee people under 25 a temporary workplace after six months of unemployment?",
    "content": {
        "source_1": "European Commission — Reinforced Youth Guarantee (2020) and prior Youth Guarantee results - Evidence: The EU’s Youth Guarantee model (offer of a job, education, apprenticeship, or traineeship within four months) is credited with helping reduce the EU NEET rate from about 13.2% (2012) to around 10.1% (2019, pre‑pandemic), with millions of young people receiving offers each year. The Commission argues that timely, short-term placements can prevent long-term scarring and ease school-to-work transitions. - Relevance: Supports the idea that guaranteed, time-bound offers for young unemployed people can improve outcomes; suggests feasibility of a structured guarantee model in member states.",
        "source_2": "European Court of Auditors — Special Report No 5/2017: Youth unemployment — have EU policies made a difference? - Evidence: The ECA found that many Youth Guarantee offers were delayed, short-term, or of variable quality, with limited evidence of sustainable employment outcomes and risks of “deadweight” and “substitution” (replacing unsubsidised jobs). Monitoring often overstated success by not tracking longer-term results. - Relevance: Cautions that guaranteeing temporary placements (especially if rushed at a set duration) may yield fleeting gains without lasting employment, and can crowd out regular jobs unless quality and progression pathways are ensured.",
        "source_3": "OECD — Evidence on Active Labour Market Policies (e.g., Employment Outlook 2018; ALMP evaluations) - Evidence: Meta-analyses/findings indicate that public works and subsidised public-sector jobs tend to have weak or even negative long-term employment effects due to lock-in, whereas targeted hiring subsidies in the private sector and apprenticeships often deliver better, more durable outcomes for youth. - Relevance: Challenges a blanket “temporary workplace guarantee” after six months if it predominantly channels young people into public or low-quality temporary jobs; suggests focusing on private hiring incentives and apprenticeship pathways instead.",
        "source_4": "UK Department for Work and Pensions — Evaluation of the Future Jobs Fund (2012/2013) - Evidence: The large-scale programme offering six-month jobs to long-term unemployed young people showed significantly higher subsequent employment and earnings for participants versus comparable non-participants, with positive net benefits to participants and society. - Relevance: Supports the claim by showing that time-limited guaranteed jobs for young long-term unemployed can work when designed with real job experience, additionality, and support.",
        "source_5": "Eurofound — NEETs: Characteristics, costs and policy responses in Europe (2012) - Evidence: Estimated the economic loss associated with NEETs at about €153 billion per year (roughly 1.2% of EU GDP), highlighting large fiscal and social costs of inaction. - Relevance: Bolsters the case for guarantees by arguing that the cost of not intervening early is high; temporary placements could be a cost-effective bridge that mitigates long-term scarring and public expenditure.",
        "source_6": "BusinessEurope — Position on Youth Guarantee implementation (circa 2013–2014) - Evidence: Employer representatives warned that one-size-fits-all job guarantees risk administrative burden, low-quality placements, and displacement effects; advocated instead for measures improving skills matching, work-based learning, and reducing non-wage labour costs to spur genuine hiring. - Relevance: Opposes a mandated temporary workplace guarantee at a fixed six-month threshold; argues for employer-led, demand-driven approaches over blanket guarantees."
    }
}