{
    "question": "Should the use of animals as objects of sport and entertainment be banned?",
    "content": {
        "source_1": "Iossa, G., Soulsbury, C. D., & Harris, S. (2009). Are wild animals suited to a travelling circus life? Animal Welfare, 18, 129–140. Review of empirical studies concluding that wild animals in travelling circuses experience compromised welfare due to frequent transport, confinement, training methods, and inability to perform natural behaviors—evidence supporting bans on circus use of animals.",
        "source_2": "Lindsey, P. A., Roulet, P. A., & Romanach, S. S. (2007). Economic and conservation significance of the trophy hunting industry in sub-Saharan Africa. Biological Conservation, 134(4), 455–469. Analysis showing trophy hunting generates conservation funding, maintains large tracts of wildlife habitat, and provides community incentives; authors argue that outright bans risk reducing funds and land for biodiversity.",
        "source_3": "SeaWorld of Florida, LLC v. Perez, 748 F.3d 1202 (D.C. Cir. 2014). U.S. appellate decision upholding OSHA safety measures after a trainer’s death, recognizing inherent hazards of close-contact marine mammal performances—evidence of significant human safety risks in animal entertainment that motivates calls for prohibitions or stringent restrictions.",
        "source_4": "Spanish Constitutional Court, Judgment STC 177/2016, and Law 18/2013 (Protección de la Tauromaquia). Spain’s high court struck down Catalonia’s bullfighting ban, citing national law that designates bullfighting as protected cultural heritage—illustrates a legal and cultural heritage argument against bans on certain animal spectacles.",
        "source_5": "Falk, J. H., Reinhard, E. M., Vernon, C. L., Bronnenkant, K., Deans, N. L., & Heimlich, J. E. (2007). Why Zoos & Aquariums Matter: Assessing the Impact of a Visit to a Zoo or Aquarium. Association of Zoos & Aquariums. Multi-institution study reporting measurable gains in visitor conservation knowledge and attitudes from zoo/aquarium visits—used to argue that some animal-based entertainment has educational and pro-conservation benefits, complicating blanket bans.",
        "source_6": "Special Commission of Inquiry into the Greyhound Racing Industry in New South Wales (McHugh Report), 2016. Official inquiry found systemic animal cruelty including live baiting and the destruction of tens of thousands of dogs deemed uncompetitive over a 12-year period—strong evidence that certain animal sports entail endemic welfare abuses warranting prohibition."
    }
}