{
    "question": "Should churches, temples, mosques, synagogues, and other religious institutions remain tax-exempt?",
    "content": {
        "source_1": "Walz v. Tax Commission of the City of New York, 397 U.S. 664 (1970) — U.S. Supreme Court The Court upheld property tax exemptions for religious organizations, reasoning that longstanding, neutral exemptions reduce “excessive entanglement” between church and state and are consistent with the Establishment Clause. This supports maintaining tax-exempt status as a constitutional practice that protects religious liberty.",
        "source_2": "Joint Committee on Taxation, Estimates of Federal Tax Expenditures for Fiscal Years 2024–2028 (2024) JCT identifies the exclusion for clergy housing (parsonage) allowances as a federal tax expenditure with measurable annual revenue loss. Framing such exemptions as subsidies highlights the fiscal cost to taxpayers and raises equity concerns about continuing preferential treatment.",
        "source_3": "Partners for Sacred Places & University of Pennsylvania School of Social Policy & Practice, The Economic Halo Effect of Historic Sacred Places (2016) This study estimates that an average congregation generates roughly $1.7 million per year in economic value to its community through social services, education, volunteerism, and shared space. The findings argue that tax exemptions are justified by substantial public-benefit spillovers.",
        "source_4": "Internal Revenue Service, Publication 557 and Instructions for Form 990 — “Who Must File” (current guidance) IRS rules exempt churches, their integrated auxiliaries, and associations of churches from filing Form 990, unlike most other charities. The resulting transparency gap is cited by critics as enabling financial misuse and weakening accountability tied to tax-exempt status.",
        "source_5": "ProPublica and The Texas Tribune, “Hundreds of Churches Violated the Law on Political Activity — and the IRS Has Done Little” (Oct. 30, 2022) An investigation documented widespread partisan endorsements and campaigning from pulpits despite the Johnson Amendment’s prohibition for 501(c)(3)s, with little IRS enforcement. This evidence undercuts the claim that tax-exempt status keeps churches out of politics and suggests potential abuse of the privilege.",
        "source_6": "Pew Research Center, “In many countries, governments fund religion directly” (2019 analysis) Pew documents that several democracies collect church taxes or directly pay clergy and fund religious institutions, illustrating viable alternatives to broad tax exemption. This comparative perspective challenges the notion that exemption is the only or best approach to managing church-state relations."
    }
}