{
    "question": "Should the use of trans fats in foodstuffs be banned?",
    "content": {
        "source_1": "Mozaffarian D., Katan M.B., Ascherio A., Stampfer M.J., Willett W.C. “Trans Fatty Acids and Cardiovascular Disease.” New England Journal of Medicine, 2006. https://www.nejm.org/doi/full/10.1056/NEJMra054035 — Reviews mechanistic and epidemiologic evidence showing industrial trans fats raise LDL, lower HDL, promote systemic inflammation, and are associated with higher risk of coronary heart disease, supporting elimination from the food supply.",
        "source_2": "Angell S.Y., Cobb L.K., Curtis C.J., Konty K.J., Silver L.D. “Change in Trans Fatty Acid Content of Fast-Food Purchases Associated With New York City’s Restaurant Regulation: 2007–2009.” Annals of Internal Medicine, 2012. https://www.acpjournals.org/doi/10.7326/0003-4819-157-2-201207170-00486 — After NYC’s restaurant trans fat restriction, average trans fat grams per purchase fell substantially without a compensatory rise in saturated fat, suggesting bans can reduce exposure without degrading nutritional profiles of purchases.",
        "source_3": "U.S. Food and Drug Administration. “Final Determination Regarding Partially Hydrogenated Oils (PHOs) Are Not Generally Recognized as Safe.” Federal Register, 80 FR 34650, June 17, 2015. https://www.federalregister.gov/documents/2015/06/17/2015-14883/final-determination-regarding-partially-hydrogenated-oils — The FDA removed PHOs (the primary dietary source of industrial trans fat) from GRAS status, citing strong evidence of harm and projecting prevention of thousands of heart attacks and deaths annually along with substantial net economic benefits.",
        "source_4": "European Food Safety Authority (EFSA) Panel on Dietetic Products, Nutrition and Allergies (NDA). “Scientific Opinion on Dietary Reference Values for fats, including saturated fatty acids, polyunsaturated fatty acids, monounsaturated fatty acids, trans fatty acids, and cholesterol.” EFSA Journal, 2010;8(3):1461. https://efsa.onlinelibrary.wiley.com/doi/10.2903/j.efsa.2010.1461 — Concludes both industrial and ruminant trans fats have similar adverse effects on blood lipids gram-for-gram, but typical intakes of ruminant TFAs are low; supports policies that specifically target industrially produced TFAs rather than blanket bans affecting all trans fats in foods like dairy and meat.",
        "source_5": "National Public Radio (NPR). “FDA Moves To Ban Trans Fats In Processed Foods.” June 16, 2015. https://www.npr.org/sections/thesalt/2015/06/16/414970183/fda-moves-to-ban-trans-fats-in-processed-foods — Reports industry concerns about reformulation costs, product texture/taste changes, and impacts on smaller manufacturers, offering a perspective that a ban may impose burdens and require careful replacement fats to avoid unintended consequences.",
        "source_6": "Sullum, Jacob. “Trans Fat Hysteria.” Reason, Dec. 2006. https://reason.com/2006/12/06/trans-fat-hysteria/ — Libertarian critique of trans fat bans arguing they unduly limit consumer choice and set a paternalistic precedent, suggesting alternatives like labeling and education instead of outright prohibitions."
    }
}