{
    "question": "Would leaving the EU increase British security?",
    "content": {
        "source_1": "European Commission — “EU–UK Trade and Cooperation Agreement: Law enforcement and judicial cooperation in criminal matters (Q&A)” (24 Dec 2020). Evidence: Confirms the UK lost real‑time access to the Schengen Information System (SIS II) and replaced the European Arrest Warrant with a more limited extradition system, implying slower, less comprehensive cross‑border policing—suggesting leaving the EU can reduce UK security.",
        "source_2": "UK Government Press Release — “UK to end participation in Galileo” (30 Nov 2018). Evidence: States the UK would be excluded from Galileo’s encrypted Public Regulated Service (PRS) used by government and military, meaning loss of access to an EU secure satellite navigation capability—suggesting a security downgrade from leaving.",
        "source_3": "Foreign, Commonwealth & Development Office — “UK establishes Global Human Rights Sanctions Regime” (6 July 2020). Evidence: Launch of autonomous Magnitsky‑style sanctions enabled the UK to quickly target hostile actors without requiring EU unanimity, indicating greater agility and leverage that can enhance national security after leaving.",
        "source_4": "Home Office — “The UK’s points‑based immigration system: policy statement” (2020). Evidence: Ending EU free movement allowed the UK to apply its own, uniform criminality thresholds to exclude or remove offenders, potentially strengthening border security relative to EU rules.",
        "source_5": "UK Parliament Northern Ireland Affairs Committee — Oral evidence from the Police Service of Northern Ireland on the land border (2018–19). Evidence: Senior PSNI officers warned that post‑Brexit border frictions risk exploitation by paramilitaries and smugglers, increasing security challenges in Northern Ireland—suggesting leaving can reduce security in that context.",
        "source_6": "UK Ministry of Defence — Updates/communiqués on the Joint Expeditionary Force (e.g., 2022 leaders’ meetings on Baltic security). Evidence: The UK leads a 10‑nation defence coalition outside EU structures that has been rapidly activated for regional security, implying that non‑EU frameworks (JEF/NATO) can maintain or even enhance UK security after leaving."
    }
}