{
    "question": "Is proportional representation necessary?",
    "content": {
        "source_1": "Arend Lijphart (1999), Patterns of Democracy (Yale University Press) — Cross-national comparison finds consensus systems (typically using proportional representation) produce higher voter turnout, more inclusive legislatures (greater representation of women and minorities), and fewer “manufactured majorities,” supporting the view that PR is necessary for broad-based representation.",
        "source_2": "G. Bingham Powell Jr. (2000), Elections as Instruments of Democracy (Yale University Press) — Shows that proportional systems yield greater congruence between citizens’ policy preferences and government policy outputs than majoritarian systems, suggesting PR is necessary if the goal is accurate translation of votes into policy.",
        "source_3": "Torben Iversen & David Soskice (2006), Electoral Institutions and the Politics of Coalitions: Why Some Democracies Redistribute More Than Others (American Political Science Review) — Demonstrates that PR encourages center-left coalition governments and higher redistribution, reducing inequality; implies PR is necessary if egalitarian policy outcomes are prioritized.",
        "source_4": "John Carey & Simon Hix (2011), The Electoral Sweet Spot: Low-Magnitude Proportional Electoral Systems (American Journal of Political Science) — Argues the best balance of proportionality and accountability occurs with low district magnitudes (around 3–8), implying that pure PR is not necessary; moderate PR or mixed designs can achieve core goals without excessive fragmentation.",
        "source_5": "Giovanni Sartori (1994), Comparative Constitutional Engineering (NYU Press) — Using cases like Italy (pre-1994) and Israel, contends highly proportional systems foster party system fragmentation and cabinet instability; challenges the necessity claim by highlighting governability costs of “extreme” PR and advocating thresholds/majority-assuring mechanisms.",
        "source_6": "Donald L. Horowitz (1985), Ethnic Groups in Conflict (University of California Press) — In deeply divided societies, list PR can entrench ethnic parties and harden cleavages; proposes vote-pooling alternatives (e.g., alternative vote) to incentivize interethnic moderation, arguing PR is not necessary—and may be counterproductive—for conflict management."
    }
}