{
    "question": "Is human activity primarily responsible for global climate change?",
    "content": {
        "source_1": "IPCC AR6 WGI Summary for Policymakers (2021) — Intergovernmental Panel on Climate Change. Concludes it is unequivocal that human influence has warmed the atmosphere, ocean, and land; best estimate of human-induced warming in 2010–2019 is about 1.07°C, essentially all of the observed warming, with natural forcings contributing close to zero net effect. https://www.ipcc.ch/report/ar6/wg1/",
        "source_2": "Lean, J. L., & Rind, D. H. (2008). How natural and anthropogenic influences alter global and regional surface temperatures: 1889–2006. Geophysical Research Letters. Uses multivariate regression to separate solar, volcanic, ENSO, and anthropogenic influences; finds recent (post-1980) warming is dominated by anthropogenic forcing, while natural factors explain much of shorter-term variability. https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2008GL034864",
        "source_3": "Cook, J. et al. (2016). Consensus on consensus: a synthesis of consensus estimates on human-caused global warming. Environmental Research Letters. Synthesizes multiple studies and surveys, finding 90–100% agreement among publishing climate experts that humans are the primary cause of recent global warming, indicating strong expert consensus behind the attribution. https://iopscience.iop.org/article/10.1088/1748-9326/11/4/048002",
        "source_4": "Soon, W., Connolly, R., & Connolly, M. (2015). Re-evaluating the role of solar variability on Northern Hemisphere temperature trends since the 19th century. Earth-Science Reviews. Argues that solar variability may account for a larger share of observed temperature changes than mainstream assessments conclude, challenging the primacy of anthropogenic forcing. https://www.sciencedirect.com/science/article/pii/S0012825215000615",
        "source_5": "McKitrick, R. R., & Michaels, P. J. (2007). Quantifying the influence of anthropogenic surface processes and inhomogeneities on gridded global climate data. Journal of Geophysical Research. Claims socioeconomic and urbanization factors contaminate some land temperature records, potentially overstating global warming trends attributed to human GHG emissions. https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2007JD008465",
        "source_6": "Spencer, R. W., & Braswell, W. D. (2011). On the Misdiagnosis of Surface Temperature Feedbacks from Variations in Earth’s Radiant Energy Balance. Remote Sensing. Interprets satellite radiation data as evidence that climate models overstate positive cloud feedbacks, implying a larger role for natural variability and a smaller anthropogenic contribution than commonly assessed. https://www.mdpi.com/2072-4292/3/8/1603"
    }
}