{
    "question": "Should the penny stay in circulation?",
    "content": {
        "source_1": "United States Mint, 2023 Annual Report (U.S. Department of the Treasury, 2023) — Reports that the unit cost to produce and distribute a one-cent coin exceeded its face value in FY 2023 (e.g., per‑coin cost greater than one cent), resulting in negative seigniorage for the penny. https://www.usmint.gov/about/leadership/annual-reports",
        "source_2": "Americans for Common Cents, “Rounding” Brief (Americans for Common Cents, accessed 2025) — Advocacy group supporting the penny argues that eliminating it would trigger cash rounding that tends to round purchases up more often than down, potentially costing consumers, and therefore the penny should remain in circulation. https://www.pennies.org/rounding",
        "source_3": "Department of Finance Canada, “Phasing Out the Penny” (Government of Canada, 2013; page maintained with guidance) — After Canada ended distribution of its penny in 2013, the government reported ongoing budgetary savings (estimated at roughly C$11 million annually) and implemented symmetric cash-rounding rules; electronic payments were unaffected and officials indicated minimal impact on prices/inflation. https://www.fin.gc.ca/1cent/index-eng.asp",
        "source_4": "Federal Reserve, Findings from the 2023 Diary of Consumer Payment Choice (Federal Reserve Cash Product Office, 2024) — Shows cash still accounts for a meaningful share of transactions (especially small-dollar purchases) and is used disproportionately by lower-income and older consumers, implying any penny withdrawal and cash-rounding policy would primarily affect these groups. https://www.frbsf.org/cash/publications/fed-notes/2024/january/findings-from-the-2023-diary-of-consumer-payment-choice/",
        "source_5": "YouGov America, “Most Americans want to keep the penny” (YouGov, Apr. 19, 2022) — National polling finds a majority of Americans prefer keeping the penny in circulation, with only a minority favoring elimination, indicating cultural and public-opinion support for retaining the coin. https://today.yougov.com/politics/articles/41460-keep-the-penny-poll-americans-opinion"
    }
}