{
    "question": "Should media reporting on violent crimes be restricted?",
    "content": {
        "source_1": "Towers, S., Gomez-Lievano, A., Khan, M., Mubayi, A., Castillo-Chavez, C. (2015). Contagion in Mass Killings and School Shootings. PLOS ONE. Using time-series models, the authors find evidence of a short-term contagion effect following extensive media coverage of mass shootings, suggesting that high-profile reporting can increase the likelihood of copycat events—supporting calls to limit perpetrator-centric publicity.",
        "source_2": "Nebraska Press Association v. Stuart, 427 U.S. 539 (1976). U.S. Supreme Court precedent holds prior restraints on news about criminal proceedings presumptively unconstitutional, underscoring that broad restrictions on reporting violent crimes conflict with the First Amendment and the public’s right to know.",
        "source_3": "Holman, E. A., Garfin, D. R., Silver, R. C. (2014). Media exposure to collective trauma is associated with acute stress: The Boston Marathon bombings. Proceedings of the National Academy of Sciences. The study finds that heavy exposure to graphic bombing coverage was linked to higher acute stress symptoms than some levels of direct exposure, indicating public health harms from repetitive, sensational reporting and bolstering arguments for limits on graphic content.",
        "source_4": "Mills, S., Armstrong, K. (1999–2000). Chicago Tribune investigative series on Illinois death penalty. The reporting uncovered systemic errors in violent-crime prosecutions (including false confessions and flawed forensics), contributing to Illinois’s 2000 death penalty moratorium—evidence that open reporting on violent crimes can correct injustices and should not be broadly curtailed.",
        "source_5": "United Kingdom: Contempt of Court Act 1981 and Sexual Offences (Amendment) Act 1992. UK law imposes targeted restrictions (e.g., limiting prejudicial reporting of active cases to protect fair trials and granting lifetime anonymity to sexual offense victims), demonstrating a middle-ground model of narrow, purpose-built limits rather than blanket suppression.",
        "source_6": "FBI (April 18, 2013). Release of suspect photos in the Boston Marathon bombing. The FBI’s public appeal, amplified by news outlets, generated tips that helped identify the Tsarnaev brothers, illustrating how timely, detailed crime reporting can serve public safety and aid investigations."
    }
}