{
    "question": "Should the world arm the Syrian rebels?",
    "content": {
        "source_1": "OPCW–UN Joint Investigative Mechanism (2016–2017 reports): Attributed multiple chemical attacks, including the April 2017 Khan Shaykhun sarin strike, to Syrian government forces, documenting systematic atrocities against civilians. Supporters of arming vetted rebel units cite these findings as a moral imperative to enable self-defense and deterrence of further mass crimes.",
        "source_2": "Charles Lister, The Syrian Jihad (2015) and subsequent analysis/testimony: Documents how mainstream Free Syrian Army factions fought and expelled ISIS from much of northwest Syria in early 2014 before being outgunned by the regime and jihadists. Argues that earlier, robust, and consistent support to vetted rebels could have marginalized extremists and increased leverage on Assad—supportive of the arming case.",
        "source_3": "U.S. Department of Defense/Global Coalition to Defeat ISIS reporting (2017–2019): With U.S. training and arms, the Syrian Democratic Forces led successful campaigns that liberated Raqqa (2017) and dismantled ISIS’s territorial “caliphate” by 2019. Cited by proponents as evidence that arming carefully vetted Syrian non-state forces can achieve strategic objectives and protect civilians.",
        "source_4": "Conflict Armament Research, “Weapons of the Islamic State” (2017): Traces Eastern European weapons procured by the U.S. and Gulf partners for Syrian opposition groups that were later found in ISIS stocks—sometimes within months—demonstrating significant diversion and capture risks. Used to argue that arming rebels can inadvertently strengthen extremists.",
        "source_5": "International Crisis Group (e.g., “Syria’s Metastasising Conflicts,” 2013; later briefings): Warns that increasing external arms to fragmented rebel factions risks prolonging and intensifying the civil war, deepening sectarian dynamics, and escalating regional confrontation (with Russia/Iran), and urges prioritizing political processes over more weapons.",
        "source_6": "International Court of Justice, Nicaragua v. United States (1986): Held that arming rebels in another sovereign state violates the non-intervention principle and the prohibition on the use of force absent UN Security Council authorization or a valid self-defense claim. Cited to argue that broadly “arming the Syrian rebels” would face serious international law obstacles."
    }
}