{
    "question": "Should workers in the transport sectors be banned from going on strike?",
    "content": {
        "source_1": "ILO Committee on Freedom of Association, “Freedom of Association: Compilation of decisions (6th ed.)” (2018). The ILO affirms the right to strike as a fundamental element of freedom of association and permits restrictions only in “essential services in the strict sense,” defined as those whose interruption would endanger the life, personal safety, or health of the population. It has repeatedly held that most transport services (e.g., urban transit, railways) are generally not “essential” under this definition, so blanket bans on transport strikes conflict with international labor standards. https://www.ilo.org/global/publications/books/WCMS_632659",
        "source_2": "Association of American Railroads, “The economic impact of a rail shutdown” (Sept. 2022). The AAR estimated a nationwide freight rail shutdown would cost the U.S. economy roughly $2 billion per day, disrupting supply chains for critical goods. The scale of potential harm was central to the 2022 decision by U.S. policymakers to intervene and avert a rail strike, illustrating arguments for strong limits or temporary prohibitions on transport strikes to protect the broader economy. https://www.aar.org/article/the-economic-impact-of-a-rail-shutdown/",
        "source_3": "U.S. Government Accountability Office, “Rail Safety: Freight Railroads and Federal Agencies Should Take Additional Actions to Address Long-Standing Oversight Challenges” GAO-23-105970 (June 2023). GAO documents persistent safety concerns in freight rail, including crew fatigue and limited sick leave—issues central to recent labor disputes. This supports the view that the threat or use of strikes can be a crucial lever for workers to address safety risks; outright bans could suppress needed corrective action and potentially worsen safety outcomes. https://www.gao.gov/products/gao-23-105970",
        "source_4": "UK Government, “The Strikes (Minimum Service Levels: Passenger Rail) Regulations 2023” (SI 2023/1306). The UK adopted minimum service level rules for passenger rail, requiring a specified level of operation during strikes. This policy exemplifies a middle-ground approach: mitigating disproportionate disruption to the public without imposing a total ban, and is offered by proponents as a more proportionate alternative to banning transport strikes. https://www.legislation.gov.uk/uksi/2023/1306/contents/made",
        "source_5": "Reuters, “UK rail strikes bring network to a standstill, only around 20% of services running” (Dec. 13, 2022). Reporting shows how transport strikes can sharply curtail mobility—only about 20% of trains ran on some strike days—causing cascading impacts on commuters, businesses, and public services. Such evidence is used to argue that transport strikes impose disproportionate social and economic costs, bolstering the case for bans or stricter limits. https://www.reuters.com/world/uk/uk-rail-strikes-bring-network-standstill-2022-12-13/",
        "source_6": "European Court of Human Rights, National Union of Rail, Maritime and Transport Workers (RMT) v. United Kingdom, no. 31045/10 (Judgment of Apr. 8, 2014). The Court upheld significant restrictions on industrial action (a ban on secondary strikes), emphasizing states’ wide margin of appreciation under Article 11. While not endorsing blanket bans, this jurisprudence indicates that robust limitations on strike action in sensitive sectors like transport can be compatible with human rights law when justified and proportionate. https://hudoc.echr.coe.int/eng?i=001-144231"
    }
}