{
    "question": "Should governments lower the voting age to 16?",
    "content": {
        "source_1": "Zeglovits, Eva, and Julian Aichholzer (2014). “Are people more inclined to vote at 16 than at 18? Evidence from Austria.” Electoral Studies. Evidence from Austria’s nationwide voting-at-16 reform found that 16–17-year-olds’ turnout was comparable to that of 18–20-year-old first-time voters, and the quality of their vote choices (consistency with their political preferences) was not inferior to adults’.",
        "source_2": "Electoral Commission (UK) (2014). “Scottish Independence Referendum: Report on the referendum held on 18 September 2014.” The Commission reported that newly enfranchised 16–17-year-olds registered and participated in large numbers and expressed high satisfaction and confidence in the process, indicating practical feasibility and effective engagement when the franchise is lowered.",
        "source_3": "National Research Council (U.S.) (2013). Reforming Juvenile Justice: A Developmental Approach. National Academies Press. Synthesizes developmental science showing that by around age 16 adolescents’ “cold” cognitive capacities (reasoning and information processing) approximate adults’, but psychosocial maturity (impulse control, resistance to peer pressure, future orientation) continues developing into the early 20s—interpreted by some as cautioning against expanding the franchise, given potential susceptibility to social influence.",
        "source_4": "Guess, Andrew, Jonathan Nagler, and Joshua Tucker (2019). “Less than you think: Prevalence and predictors of fake news dissemination on Facebook.” Science Advances 5(1): eaau4586. An analysis of Facebook sharing during the 2016 U.S. election found users aged 65+ shared about seven times more links from fake news domains than those aged 18–29, undermining claims that younger cohorts are uniquely vulnerable to misinformation in ways that would compromise electoral choices.",
        "source_5": "Hill-HarrisX Poll (2019). “Poll: Most voters oppose lowering the voting age to 16.” The Hill, March 22, 2019. A nationally representative U.S. survey reported that 84% of registered voters opposed lowering the voting age to 16 (16% supported), highlighting significant public resistance to the reform.",
        "source_6": "Bhatti, Yosef, Kasper M. Hansen, and Hanna Wass (2012). “The relationship between age and turnout: A roller-coaster pattern.” Electoral Studies 31(3): 588–593. Using administrative turnout data, the authors show turnout peaks at age 18 (when many still live with parents) and dips at 19–20 after leaving home; this supports the argument that earlier enfranchisement could leverage the home environment to build durable voting habits."
    }
}