{
    "question": "Should criminal trials, including those at the ICC, be televised?",
    "content": {
        "source_1": "U.S. Supreme Court, Estes v. Texas, 381 U.S. 532 (1965) - Holding that live television coverage and extensive courtroom broadcasting created inherent prejudicial effects that denied the defendant due process. Cited by critics of cameras to show that televising criminal trials can distort proceedings and harm fairness.",
        "source_2": "U.S. Supreme Court, Chandler v. Florida, 449 U.S. 560 (1981) - Upholding a state experiment permitting televised trials and rejecting any per se constitutional ban on cameras in courtrooms absent a showing of actual prejudice. Used to argue that with safeguards and judicial control, televising need not compromise fair trial rights.",
        "source_3": "Human Rights Watch, “Kenya: Witness Intimidation Threatens ICC Cases” (2013) - Documents widespread witness tampering and intimidation in the ICC’s Kenya cases, highlighting how public exposure can endanger witnesses and undermine prosecutions. Supports the view that broadcasting international criminal proceedings can heighten security risks and chill testimony.",
        "source_4": "International Criminal Court legal framework: Rome Statute arts. 67(1) (public hearing) and 68 (protection of victims and witnesses); ICC Rules of Procedure and Evidence, Rule 87 (protective measures) - Establishes that ICC trials are presumptively public but allows in camera sessions, anonymity, and other measures to protect participants. Often paired with delayed, redacted webcasts in practice, this framework supports a tailored approach rather than a blanket ban on televising.",
        "source_5": "Judicial Conference of the United States, Committee on Court Administration and Case Management, Report on the Federal Cameras-in-the-Courtroom Pilot (2016) - Evaluation of a multi-year pilot allowing video coverage of civil proceedings in selected federal district courts found no systemic adverse effects on trial participants or outcomes. While limited to civil cases, it is cited to argue fears about cameras are overstated when guidelines are in place.",
        "source_6": "United Nations International Criminal Tribunal for the former Yugoslavia (ICTY), Outreach Programme and Courtroom Broadcast/Archives (1990s–2017) - The ICTY widely broadcast proceedings and built an accessible video archive, which scholars and practitioners credit with enhancing transparency, public understanding, and the historical record of atrocities. Used to contend that televising international criminal trials can advance legitimacy and education."
    }
}