{
    "question": "Are increased taxes good for America?",
    "content": {
        "source_1": "IMF Staff Discussion Note SDN/14/02 — Ostry, Berg, and Tsangarides (2014), “Redistribution, Inequality, and Growth.” Finds that lower inequality is robustly associated with longer growth spells and that typical fiscal redistribution (e.g., progressive taxes and transfers) is generally not harmful to growth, implying some tax increases aimed at redistribution can be good for long-run performance. https://www.imf.org/en/Publications/Staff-Discussion-Notes/Issues/2016/12/31/Redistribution-Inequality-and-Growth-41279",
        "source_2": "Congressional Budget Office (2016), “The Economic Effects of Federal Infrastructure Investment.” Concludes that well-targeted infrastructure investment can raise productivity and output in the long run; even when financed by taxes, the net long-run effect on GDP can be positive if projects have sufficiently high returns, supporting the case for tax-funded public investment. https://www.cbo.gov/publication/51739",
        "source_3": "Yagan, Danny (2015), “Capital Tax Reform and the Real Economy: The Effects of the 2003 Dividend Tax Cut,” American Economic Review. Finds no significant increase in investment or employee compensation at firms that benefited most from the dividend tax cut, suggesting that reversing such cuts (i.e., higher dividend taxes) may raise revenue with limited real economic costs. https://www.aeaweb.org/articles?id=10.1257/aer.20130686",
        "source_4": "Romer, Christina D., and David H. Romer (2010), “The Macroeconomic Effects of Tax Changes: Estimates Based on a New Measure of Fiscal Shocks,” American Economic Review. Estimates that exogenous tax increases equal to 1% of GDP reduce real GDP by about 3% after several years, evidence that higher taxes can harm growth and contradict the claim that tax increases are broadly “good.” https://www.aeaweb.org/articles?id=10.1257/aer.100.3.763",
        "source_5": "OECD Economics Department Working Paper No. 620 (2008) — Johansson, Heady, Arnold, Brys, and Vartia, “Tax and Economic Growth.” Cross-country analysis indicating that corporate income taxes are the most harmful to growth (relative to consumption and property taxes), implying that increases in corporate taxes, in particular, are likely detrimental to economic performance. https://www.oecd.org/tax/tax-policy/41000592.pdf",
        "source_6": "Akcigit, Ufuk; John Grigsby; Tom Nicholas; and Stefanie Stantcheva (2022), “Taxation and Innovation in the 20th Century,” Quarterly Journal of Economics. Shows that higher top marginal income tax rates are associated with fewer patents and reduced innovation by top inventors, suggesting that raising top rates can discourage innovative activity important for long-run growth. https://academic.oup.com/qje/article/137/1/329/6373678"
    }
}