{
    "question": "Should hydroelectric dams be built?",
    "content": {
        "source_1": "International Energy Agency (IEA), Hydropower Special Market Report (2021) — Finds hydropower is the largest source of renewable electricity worldwide and a key provider of grid flexibility; pumped-storage hydro supplies the vast majority of grid-scale energy storage, helping integrate variable wind and solar, with typically low life-cycle greenhouse gas emissions relative to fossil generation.",
        "source_2": "World Commission on Dams, Dams and Development: A New Framework for Decision-Making (2000) — Documents that large dams have displaced an estimated 40–80 million people globally, with frequent adverse impacts on indigenous communities and livelihoods; concludes that many projects underdelivered promised benefits and calls for stricter social and environmental safeguards.",
        "source_3": "Deemer, B.R. et al., “Greenhouse Gas Emissions from Reservoir Water Surfaces: A New Global Synthesis,” BioScience (2016) — Meta-analysis shows reservoirs are a significant global source of methane, especially in tropical regions with high organic inputs; indicates that hydropower’s climate benefits can be substantially reduced by reservoir emissions under certain conditions.",
        "source_4": "IEA, Electricity Market Report (2022) — Highlights that severe droughts in multiple regions (e.g., western United States, Brazil, parts of Europe and China) markedly reduced hydropower output, stressing power systems and increasing reliance on fossil generation; underscores growing climate and hydrological risks to hydropower reliability.",
        "source_5": "Ansar, A., Flyvbjerg, B., Budzier, A., Lunn, D., “Should we build more large dams? The actual costs of hydropower megaproject development,” Energy Policy (2014) — Analyzing hundreds of projects, the study finds large dams frequently suffer major cost overruns and schedule delays, often rendering them economically inferior to alternatives when accounting for risk and time-to-delivery.",
        "source_6": "U.S. Department of Energy, Hydropower Vision (2016) and Pumped Storage Hydropower Valuation Reports (2021) — Identifies substantial potential to add generation at existing non-powered dams and through upgrades/modernization, and emphasizes closed-loop pumped storage for long-duration energy storage with lower riverine impacts compared to new conventional river-blocking dams."
    }
}