{
    "question": "Was the use of atomic bombs against Hiroshima and Nagasaki justified?",
    "content": {
        "source_1": "Imperial Rescript on the Termination of the War (Emperor Hirohito, Aug 15, 1945). The emperor explicitly cited “a new and most cruel bomb” whose destructive power was “incalculable” as a key reason for accepting surrender, arguing continued resistance would risk the “ultimate collapse and obliteration” of the Japanese nation—evidence that the atomic bombings directly precipitated Japan’s decision to end the war.",
        "source_2": "Henry L. Stimson, “The Decision to Use the Atomic Bomb,” Harper’s Magazine (Feb 1947). The U.S. Secretary of War defended the use as necessary to avoid an invasion he believed would cause enormous American and Japanese casualties, presenting a utilitarian justification that the bombs shortened the war and saved lives.",
        "source_3": "United States Strategic Bombing Survey, Summary Report (Pacific War) (U.S. Government, 1946). After reviewing Japanese records and wartime conditions, the Survey concluded Japan would likely have surrendered before the end of 1945 even without the atomic bombs, Soviet entry, or a U.S. invasion—evidence against necessity and thus against the claim of justification.",
        "source_4": "Tsuyoshi Hasegawa, Racing the Enemy: Stalin, Truman, and the Surrender of Japan (Harvard University Press, 2005). Using Japanese and Soviet archives, Hasegawa argues the decisive shock was the Soviet declaration of war on August 8, 1945, which destroyed Tokyo’s strategy to seek Moscow’s mediation; the bombs alone did not break the deadlock—challenging the view that atomic attacks were the crucial cause of surrender.",
        "source_5": "The Franck Report (James Franck and Manhattan Project colleagues, June 1945). Leading scientists urged a noncombat “demonstration” of the bomb and warned that first-use against cities would damage U.S. moral leadership and spur a nuclear arms race—evidence that viable alternatives and ethical objections were known before the decision.",
        "source_6": "International Court of Justice, Advisory Opinion on the Legality of the Threat or Use of Nuclear Weapons (1996). The ICJ stated that nuclear use would generally be contrary to international humanitarian law principles due to indiscriminate and disproportionate effects on civilians, though it left a narrow, unresolved exception for extreme self-defense—providing a legal framework that casts doubt on the bombings’ legitimacy under humanitarian norms."
    }
}