{
    "question": "Is euthanasia or mercy killing justified?",
    "content": {
        "source_1": "Oregon Health Authority — Death with Dignity Act: 2022 Data Summary. Reports that medical aid-in-dying accounts for a small fraction of Oregon deaths, with most patients enrolled in hospice, dying at home, and citing loss of autonomy and ability to enjoy life as primary reasons; state oversight has not identified systemic abuse. This is used to argue that, under strict regulation, assisted dying can be a limited, patient-centered option focused on alleviating suffering.",
        "source_2": "Kim SYH, De Vries RG, Peteet JR. Euthanasia and Assisted Suicide of Patients With Psychiatric Disorders in the Netherlands. JAMA Psychiatry. 2016. An analysis showing growth in euthanasia for psychiatric conditions, highlighting cases with treatment refusal or disputed irremediability and raising concerns about assessment standards and the potential for boundary expansion beyond terminal illness. This is used to argue against justification due to slippery-slope and evaluation challenges.",
        "source_3": "UN Special Rapporteurs (on the rights of persons with disabilities, older persons, etc.). Communication to the Government of Canada regarding Bill C-7 (2021). Warns that expanding MAID may have a discriminatory impact on persons with disabilities by normalizing death as a solution to suffering rooted in lack of supports, poverty, or inadequate care. This perspective argues euthanasia is not justified where structural coercion and inequity can influence “choice.”",
        "source_4": "American Medical Association, Code of Medical Ethics, Opinion 5.7 (Physician-Assisted Suicide). States that physician-assisted suicide is fundamentally incompatible with the physician’s role as healer, emphasizing the duties to alleviate suffering without intentionally causing death and to protect vulnerable patients. This professional-ethics stance argues euthanasia is not justified within medicine’s core commitments.",
        "source_5": "Temel JS et al. Early Palliative Care for Patients with Metastatic Non–Small-Cell Lung Cancer. New England Journal of Medicine. 2010. Randomized trial showing early palliative care improves quality of life, reduces depressive symptoms, lowers aggressive end-of-life care, and is associated with longer survival. Cited to argue that enhancing palliative services offers a humane alternative, challenging the necessity or justification of euthanasia.",
        "source_6": "Gallup Poll (2023) — U.S. Public Opinion on Physician-Assisted Death. Finds a consistent majority of Americans support allowing doctors to help terminally ill patients end their lives upon request, framing the issue in terms of personal autonomy and relief of suffering. This public-attitudes evidence is used to argue euthanasia can be morally and socially justified under defined conditions."
    }
}