{
    "question": "Should we give money to beggars?",
    "content": {
        "source_1": "Foundations for Social Change & University of British Columbia (2020) — The New Leaf Project randomized trial gave one-time cash transfers (~$7,500 CAD) to adults experiencing homelessness in Vancouver and found faster exits from homelessness, improved food security and savings, and no increase in spending on alcohol, drugs, or tobacco; researchers also estimated net public cost savings due to reduced shelter use.",
        "source_2": "Evans, D. & Popova, A. (2017). Cash Transfers and Temptation Goods: A Review of Global Evidence. World Bank Policy Research Working Paper — Meta-review across dozens of cash transfer evaluations finds no systematic increase in spending on alcohol or tobacco when people receive unconditional cash, countering a common objection to giving money directly.",
        "source_3": "City and County of Denver — “Give Smart Denver” campaign (municipal guidance) — Advises residents not to give cash to panhandlers and instead donate to service providers, arguing that direct handouts can inadvertently sustain harmful cycles while professional outreach connects people to housing, treatment, and employment supports.",
        "source_4": "Giving What We Can (Effective Altruism) — “Should I give money to people who are begging?” (analysis) — Argues that while the moral impulse to help is good, discretionary street giving is typically far less cost-effective than donating to proven, evidence-backed charities or interventions that measurably improve outcomes at scale.",
        "source_5": "Mental Health Commission of Canada (2014). At Home/Chez Soi Final Report — Large randomized trial of Housing First found substantial, sustained improvements in housing stability and reductions in service use for people with chronic homelessness and mental illness, suggesting resources are better directed to systemic, evidence-based programs rather than ad hoc cash on the street.",
        "source_6": "National Coalition for the Homeless — “Panhandling: Get the Facts” (advocacy fact sheet) — Emphasizes that many people who beg use cash for necessities like food and transportation, defends the right to give as an expression of compassion and respect for autonomy, and opposes policies discouraging direct giving."
    }
}