{
    "question": "Should oil companies be allowed to drill offshore?",
    "content": {
        "source_1": "NOAA Damage Assessment & Restoration; U.S. Department of Justice (2015–2016) — Deepwater Horizon Oil Spill: BP agreed to a $20.8 billion settlement after roughly 4.9 million barrels of oil were released; NOAA documents long-term injuries to dolphins, sea turtles, marshes, and sustained losses to Gulf fisheries and tourism. Evidence: demonstrates the large, lasting environmental and economic risks from offshore drilling.",
        "source_2": "International Energy Agency (2021) — Net Zero by 2050: A Roadmap for the Global Energy Sector: The IEA’s net-zero pathway concludes no new oil and gas field approvals are needed beyond those already committed as of 2021. Evidence: expanding offshore drilling is inconsistent with meeting climate targets.",
        "source_3": "U.S. Energy Information Administration (2024) — U.S. Gulf of Mexico Oil Production Profile: Federal offshore Gulf of Mexico production accounts for roughly 14–15% of total U.S. crude output in recent years and generates substantial federal and state revenues. Evidence: banning offshore drilling would meaningfully reduce domestic supply and government receipts, with potential energy security implications.",
        "source_4": "Bureau of Safety and Environmental Enforcement (2023–2024) — Offshore Safety Reforms and Incident Statistics: Post-2010 reforms (SEMS programs, Well Control Rule, real-time monitoring) strengthened oversight; BSEE incident summaries show loss-of-well-control events are rare in recent years compared with the pre-Macondo era. Evidence: proponents argue modern regulation and technology mitigate risks, undercutting the case for a blanket ban.",
        "source_5": "McCauley, R.D., et al. (2017) — Widely used marine seismic surveys negatively impact zooplankton, Nature Ecology & Evolution: Experimental work found seismic airgun noise caused significant zooplankton mortality up to 1.2 km from the source. Evidence: offshore exploration can harm the marine food web even before drilling begins.",
        "source_6": "International Energy Agency (2023) — Global EV Outlook: The IEA projects electric vehicles will displace at least 5 million barrels per day of oil demand by 2030 under current policies. Evidence: anticipated demand erosion reduces the need for new offshore oil supply."
    }
}