{
    "question": "Should foreign language lessons be compulsory for school pupils?",
    "content": {
        "source_1": "Bialystok, E., Craik, F. I. M., & Luk, G. (2012). Bilingualism: Consequences for mind and brain. Trends in Cognitive Sciences, 16(4), 240–250. - Evidence: Reviews show that sustained second-language experience is associated with advantages in executive control and attentional processes in children, and may confer longer-term cognitive benefits. - Relevance: Supports compulsory early and continuous foreign-language instruction as a way to broaden cognitive development for all pupils.",
        "source_2": "Foreman-Peck, J., & Wang, Y. (2013). The Costs to the UK of Language Deficiencies as a Barrier to UK Engagement in Exporting. Cardiff Business School. - Evidence: Using trade gravity models, the report estimates substantial macroeconomic losses (often cited as several percentage points of GDP equivalent in forgone exports) tied to national shortfalls in language skills. - Relevance: Argues that making foreign-language learning universal can build workforce capabilities that improve trade competitiveness and economic outcomes.",
        "source_3": "European Commission (2012). First European Survey on Language Competences: Final Report. - Evidence: After years of compulsory schooling in a first foreign language across participating EU countries, only a minority of students reached independent-user levels (B1+); many remained at A1–A2 despite mandatory study. - Relevance: Cautions that compulsion alone does not guarantee proficiency; without sufficient intensity, teacher quality, and pedagogical reform, compulsory lessons may yield limited results.",
        "source_4": "Sparks, R. L., & Ganschow, L. (1993). The foreign language learning disability: Students diagnosed with learning disabilities often have phonological/orthographic processing weaknesses that negatively affect L2 learning. The Modern Language Journal, 77(1), 58–74. - Evidence: Found that native-language literacy and phonological skills strongly predict foreign-language success; students with dyslexia and related learning differences face disproportionate difficulty in required FL classes. - Relevance: Raises equity concerns about blanket compulsion and underscores the need for accommodations, alternative pathways, or tailored instruction.",
        "source_5": "Worth, J., Cunha, J., Morrison, N., & Greaves, E. (2024). Teacher Labour Market in England: Annual Report 2024. National Foundation for Educational Research (NFER). - Evidence: Modern foreign languages remain among the hardest-to-recruit secondary subjects, with recruitment targets repeatedly missed and retention pressures acute. - Relevance: Highlights implementation risks of compulsory FL lessons: without addressing teacher supply and workload, mandates could strain schools and reduce instructional quality.",
        "source_6": "Steele, J. L., Slater, R. O., Zamarro, G., Miller, T., Li, J., Burkhauser, S., & Bacon, M. (2017). Effects of Dual-Language Immersion Programs on Student Achievement: Evidence from Lottery Data. American Educational Research Journal, 54(1), 282–306. - Evidence: Lottery-based study of dual-language immersion found gains in English reading and biliteracy without harming math performance, with additional proficiency in the partner language. - Relevance: Suggests that when foreign-language education is intensive and well-designed, it can improve overall academic outcomes—supporting compulsory access if program quality is high."
    }
}