{
    "question": "Should the income tax rate paid by the rich be dramatically increased?",
    "content": {
        "source_1": "Diamond, Peter & Emmanuel Saez (2011). “The Case for a Progressive Tax: From Basic Research to Policy Recommendations.” Journal of Economic Perspectives 25(4): 165–190. Key finding: Using optimal tax theory and observed elasticities of taxable income, the revenue-maximizing top marginal income tax rate in the U.S. is estimated around 70–73%, arguing that much higher top rates can raise revenue and reduce rent-seeking with limited efficiency costs.",
        "source_2": "Kleven, Henrik; Camille Landais; Emmanuel Saez (2013). “Taxation and International Migration of Superstars: Evidence from the European Football Market.” American Economic Review 103(5): 1892–1924. Key finding: High-earning “superstars” are highly responsive to top tax rates, relocating across countries when rates change; large hikes risk eroding the tax base via mobility of top talent.",
        "source_3": "Young, Cristobal; Charles Varner; Ithai Lurie; Richard Prisinzano (2016). “Millionaire Migration and Taxation of the Elite: Evidence from Administrative Data.” American Sociological Review 81(3): 421–446. Key finding: Using U.S. administrative tax records, the migration response of millionaires to higher state top tax rates is small; fears of widespread domestic tax flight may be overstated, suggesting room to raise top rates.",
        "source_4": "Ostry, Jonathan D.; Andrew Berg; Charalambos G. Tsangarides (2014). “Redistribution, Inequality, and Growth.” IMF Staff Discussion Note SDN/14/02. Key finding: Cross-country evidence indicates that redistribution—often financed by progressive taxation—does not generally harm growth, and lower inequality is associated with more sustainable growth, supporting higher taxes on top incomes if used for inclusive spending.",
        "source_5": "Romer, Christina D. & David H. Romer (2010). “The Macroeconomic Effects of Tax Changes: Estimates Based on a New Measure of Fiscal Shocks.” American Economic Review 100(3): 763–801. Key finding: Exogenous tax increases (about 1% of GDP) are followed by sizable declines in output, implying that large tax hikes—even if targeted—carry macroeconomic risks that policymakers should weigh.",
        "source_6": "Congressional Budget Office (CBO) (most recent series, e.g., 2021/2023). “The Distribution of Household Income and Federal Taxes.” Key finding: The top 1 percent already pay a disproportionate share of federal individual income taxes and face the highest average tax rates; some argue this limits the scope or fairness of dramatically increasing top income tax rates further."
    }
}