{
    "question": "Should retailers be allowed to import \"grey\" goods from abroad for resale?",
    "content": {
        "source_1": "Impression Products, Inc. v. Lexmark International, Inc., 581 U.S. 152 (2017) — The U.S. Supreme Court held that an authorized sale abroad exhausts U.S. patent rights, preventing manufacturers from using patent law to block reimportation and resale of genuine goods in the U.S. This strengthens legal room for parallel imports and retail resale of “grey” goods. https://supreme.justia.com/cases/federal/us/581/15-1189/",
        "source_2": "U.S. Customs and Border Protection, Gray Market Trademarked Goods (19 CFR §133.23) and Lever Brothers Co. v. United States, 981 F.2d 1330 (D.C. Cir. 1993) — CBP can detain or exclude genuine goods bearing a U.S.-registered trademark if they are “materially different” from authorized domestic versions, to prevent consumer confusion and protect trademark integrity. This underscores consumer-protection and brand-control limits on allowing gray imports. https://www.ecfr.gov/current/title-19/part-133/section-133.23; https://law.justia.com/cases/federal/appellate-courts/F2/981/1330/463510/",
        "source_3": "Ganslandt, M. & Maskus, K. E. (2004). Parallel Imports and the Pricing of Pharmaceutical Products: Evidence from the European Union. Journal of Health Economics, 23(5), 1035–1057 — Empirical analysis finds that the presence of parallel imports exerted significant competitive pressure and reduced drug prices in destination EU markets, indicating consumer savings when gray-market resale is permitted. https://doi.org/10.1016/j.jhealeco.2003.12.006",
        "source_4": "Danzon, P. M. & Towse, A. (2003). Differential Pricing for Pharmaceuticals: Reconciling Access, R&D and Patents. International Journal of Health Care Finance and Economics, 3, 183–205 — Argues that allowing parallel imports undermines international differential pricing, which can raise prices in poorer countries and weaken incentives for R&D, highlighting potential long-run welfare losses from broad gray-market allowances. https://doi.org/10.1023/A:1025447602009",
        "source_5": "European Court of Justice, Silhouette International Schmied GmbH & Co. KG v. Hartlauer Handelsgesellschaft mbH, Case C-355/96 (1998) — The ECJ rejected “international exhaustion” of trademark rights, limiting exhaustion to the EEA. EU policy thus permits parallel trade within the EEA but restricts imports from outside, illustrating a controlled approach rather than blanket allowance of gray imports. https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX%3A61996CJ0355",
        "source_6": "Antia, K. D., Bergen, M., & Dutta, S. (2004). Competing with Gray Markets. MIT Sloan Management Review, 46(1), 69–76 — Management research documents harms from gray-market resales, including channel conflict, reduced service quality and warranty support, and erosion of brand equity, suggesting that allowing retailer imports can impose real costs on both brands and consumers beyond price. https://sloanreview.mit.edu/article/competing-with-gray-markets/"
    }
}