{
    "question": "Should teachers have the right to physically punish pupils if the parents consent?",
    "content": {
        "source_1": "Ingraham v. Wright, 430 U.S. 651 (1977) — U.S. Supreme Court. https://www.oyez.org/cases/1976/75-6527 Holding that reasonable corporal punishment in public schools does not violate the Eighth Amendment and that states/localities may set policy, this case establishes a legal baseline that teachers can administer physical discipline under state authority—supporting arguments that, with parental consent and within limits, such practices can be lawful.",
        "source_2": "National Conference of State Legislatures (NCSL). “Corporal Punishment in Public Schools.” https://www.ncsl.org/education/corporal-punishment-in-public-schools State-by-state overview showing that most states ban corporal punishment in public schools, while a minority still permit it, often leaving details (including parental opt-in/opt-out consent provisions) to local districts. This demonstrates that parental consent models already exist in some jurisdictions, while many others prohibit the practice outright.",
        "source_3": "NPR (Aug. 26, 2022). “A Missouri school district is bringing back corporal punishment, with parents’ permission.” https://www.npr.org/2022/08/26/1119608431/missouri-school-district-corporal-punishment Reports on Cassville School District’s policy reinstating paddling as a last resort only with written parental permission, including quotes from administrators and parents who support the option as a deterrent—evidence of community-level backing for a consent-based approach.",
        "source_4": "American Academy of Pediatrics (2018). “Effective Discipline to Raise Healthy Children.” Pediatrics, 142(6):e20183112. https://publications.aap.org/pediatrics/article/142/6/e20183112/37342 The leading U.S. pediatric body concludes physical punishment is associated with increased aggression, mental health problems, and poorer academic outcomes, and recommends prohibiting corporal punishment in all settings, including schools—arguing that parental consent does not mitigate health risks.",
        "source_5": "UN Committee on the Rights of the Child (2006). General Comment No. 8: The right of the child to protection from corporal punishment and other cruel or degrading forms of punishment. https://www.ohchr.org/en/documents/general-comments-and-recommendations/general-comment-no-8-2006-right-child-protection Interprets the Convention on the Rights of the Child to require prohibition of corporal punishment in all settings, including schools, and rejects cultural norms or parental permission as justification—framing school corporal punishment as a child rights violation regardless of consent.",
        "source_6": "Human Rights Watch & ACLU (2008). “A Violent Education: Corporal Punishment of Children in U.S. Public Schools.” https://www.hrw.org/report/2008/08/19/violent-education/corporal-punishment-children-us-public-schools Documents injuries, inconsistent standards, and disproportionate impact on Black students and students with disabilities in U.S. schools that use corporal punishment, and calls for bans—raising civil rights and equity concerns that persist even where parental consent is obtained."
    }
}