{
    "question": "Should African states withdraw from the ICC?",
    "content": {
        "source_1": "African Union, Extraordinary Session on Africa’s Relationship with the International Criminal Court, Decision Ext/Assembly/AU/Dec.1 (Oct. 2013). The AU asserted that no charges should be pursued against sitting heads of state and urged deferrals for Kenya’s leaders, arguing ICC prosecutions can undermine sovereignty and stability—an argument some use to justify withdrawal. (https://au.int)",
        "source_2": "ICC Press Release, “The Prosecutor v. Bosco Ntaganda: Trial Chamber VI sentences Bosco Ntaganda to 30 years of imprisonment” (7 November 2019). Demonstrates the ICC’s concrete delivery of accountability for grave crimes in the DRC, with convictions and reparations benefiting African victims—evidence cited against withdrawal. (https://www.icc-cpi.int)",
        "source_3": "Minister of Justice and Constitutional Development v Southern Africa Litigation Centre (867/15) [2016] ZASCA 17 (15 March 2016). South Africa’s Supreme Court of Appeal held the government had a duty to arrest Sudan’s Omar al-Bashir under the Rome Statute, highlighting how ICC obligations can clash with diplomatic immunity and national policy—fueling arguments for withdrawal to avoid such conflicts. (http://www.saflii.org/za/cases/ZASCA/2016/17.html)",
        "source_4": "ICC Press Release, “Warrants of arrest issued for Vladimir Vladimirovich Putin and Maria Alekseyevna Lvova-Belova” (17 March 2023). Illustrates the ICC’s expanding global reach beyond Africa (e.g., Ukraine, Afghanistan, Georgia, Palestine, Venezuela), countering claims of anti-Africa bias and supporting continued African participation. (https://www.icc-cpi.int)",
        "source_5": "Amnesty International, “African Union: ICC withdrawal strategy a dangerous regression” (31 January 2017). African and international human rights groups argue withdrawal would strip victims of a critical avenue for justice, weaken deterrence, and embolden abusive leaders—reasons to remain and push reforms instead. (https://www.amnesty.org)",
        "source_6": "Amnesty International, “Malabo Protocol: Legal and Institutional Implications of the Establishment of a Criminal Jurisdiction for the African Court” (2016). Reviews the AU’s proposed regional alternative: not yet in force and contains immunity for sitting officials, raising risks of impunity; critics say withdrawing from the ICC without a credible operational substitute would harm accountability. (https://www.amnesty.org)"
    }
}