{
    "question": "Should smoking be made illegal?",
    "content": {
        "source_1": "World Health Organization — Tobacco Fact Sheet (2023/2024). WHO estimates tobacco kills more than 8 million people each year worldwide, including about 1.3 million non-smokers exposed to second-hand smoke, underscoring the population-level harm used to justify prohibition. https://www.who.int/news-room/fact-sheets/detail/tobacco",
        "source_2": "Centers for Disease Control and Prevention — Fast Facts: Smoking & Tobacco Use (updated). CDC estimates cigarette smoking costs the United States over $300 billion annually, including more than $170 billion in direct medical care and over $150 billion in lost productivity, a fiscal rationale some cite for making smoking illegal. https://www.cdc.gov/tobacco/data_statistics/fact_sheets/fast_facts/index.htm",
        "source_3": "Research Unit on the Economics of Excisable Products (University of Cape Town) — Lighting up the illicit market: Smoker behavior during South Africa’s COVID-19 tobacco sales ban (2020). Survey-based analysis found over 90% of smokers continued purchasing cigarettes during the sales ban, with sharp price increases and entrenched illicit supply, indicating prohibition can fuel black markets without eliminating consumption. https://reep.uct.ac.za/",
        "source_4": "ACLU and civil rights coalition — Letter regarding FDA menthol cigarette regulations (April 29, 2021). The coalition warned that bans risk exacerbating policing and criminalization in communities of color if possession or low-level sales are enforced punitively, highlighting civil liberties and equity concerns about making tobacco illegal. https://www.aclu.org/letter/aclu-and-coalition-urge-fda-to-consider-racial-justice-impact-of-menthol-cigarette-ban",
        "source_5": "Cochrane Review — Electronic cigarettes for smoking cessation (most recent update 2023/2024). High-certainty evidence indicates nicotine e‑cigarettes increase quit rates compared with nicotine replacement therapy and behavioral support, suggesting harm-reduction and regulated alternatives may outperform blanket illegality in reducing smoking prevalence. https://www.cochranelibrary.com/cdsr/doi/10.1002/14651858.CD010216.pub7/full",
        "source_6": "BBC News — New Zealand scraps world-leading smoking ban to fund tax cuts (April 2024). The government repealed a planned generational tobacco sales ban, citing fiscal policy and revenue implications, illustrating the political and practical challenges of prohibition-style measures even in strong tobacco-control environments. https://www.bbc.com/news/world-asia-68721623"
    }
}