{
    "question": "Should the UK police service be armed?",
    "content": {
        "source_1": "Home Office — Police use of firearms statistics, England and Wales (latest annual release). GOV.UK. https://www.gov.uk/government/collections/police-use-of-firearms-statistics-england-and-wales. Evidence: Despite many thousands of armed deployments each year, police firearms are discharged only on a handful of occasions, suggesting specialist armed units manage threats effectively without routine arming of all officers.",
        "source_2": "Police Federation of England and Wales — Firearms Survey 2017 results. PFEW. https://www.polfed.org/our-work/firearms-survey/. Evidence: A majority of rank‑and‑file officers reported they do not support routine arming, while strongly backing wider access to Taser—indicating limited internal support for arming all officers.",
        "source_3": "HMICFRS — The London Bridge attack: An independent review of the police response (2019). https://www.justiceinspectorates.gov.uk/hmicfrs/publications/london-bridge-attack-review/. Evidence: Armed officers fatally stopped the attackers within minutes of the first call; proponents argue broader routine arming could reduce response times further, especially outside major cities.",
        "source_4": "Home Office news release — £143 million to boost armed policing and protect the public (2016). GOV.UK. https://www.gov.uk/government/news/home-secretary-announces-143-million-to-boost-armed-policing-and-protect-public. Evidence: Government funded thousands more armed deployments and increased Authorised Firearms Officers, reflecting a view that a stronger armed capability is needed against terrorism—used to argue for expanding armed capacity.",
        "source_5": "Office for National Statistics — Crime in England and Wales, year ending March 2023 (and related series on “assaults on emergency workers”). ONS. https://www.ons.gov.uk/releases/crimeinenglandandwalesyearendingmarch2023. Evidence: Police‑recorded “assault on an emergency worker” offences have risen markedly in recent years; supporters of routine arming cite rising violence against officers as justification for sidearms.",
        "source_6": "New Zealand Police — Armed Response Teams trial concludes (June 2020). https://www.police.govt.nz/news/release/armed-response-teams-trial-concludes. Evidence: NZ ended armed response patrols after community concerns and findings of disproportionate impact, a cautionary example that routine arming/militarised patrols can erode trust and harm policing by consent."
    }
}