{
    "question": "Should governments prioritise spending money on youth?",
    "content": {
        "source_1": "Heckman, J. J. (2006). Skill Formation and the Economics of Investing in Disadvantaged Children. Science. DOI: 10.1126/science.1128898. Evidence shows the highest social returns to public investment occur in early childhood, with substantial long-run gains in earnings and reduced remediation and crime—supporting prioritizing youth spending.",
        "source_2": "European Commission (2021). The 2021 Ageing Report: Economic and budgetary projections for the EU Member States (2019–2070). https://economy-finance.ec.europa.eu/publications/2021-ageing-report-economic-and-budgetary-projections-eu-member-states-2019-2070_en. Projections show age-related public spending (pensions, health, long-term care) rising as populations age, creating fiscal pressures that may necessitate prioritizing resources toward older cohorts and system sustainability rather than youth.",
        "source_3": "Card, D., Kluve, J., & Weber, A. (2018). What Works? A Meta Analysis of Active Labor Market Program Evaluations. Journal of the European Economic Association, 16(4), 894–931. DOI: 10.1093/jeea/jvx028. Meta-analysis finds mixed effectiveness of youth training and employment programs, with smaller short-run impacts than for adults, cautioning that “spend on youth” does not automatically yield high returns without careful program design.",
        "source_4": "Poterba, J. M. (1996). Demographic Structure and the Political Economy of Public Education. NBER Working Paper No. 5677. https://www.nber.org/papers/w5677. Finds that jurisdictions with larger elderly populations tend to spend less on K–12 education per child, highlighting intergenerational political trade-offs and providing a rationale for deliberately prioritizing youth to counterbalance existing budgetary biases.",
        "source_5": "Hanushek, E. A., & Woessmann, L. (2012). Do Better Schools Lead to More Growth? Cognitive Skills, Economic Outcomes, and Causation. Journal of Economic Growth, 17, 267–321. DOI: 10.1007/s10887-012-9081-x. Cross-country evidence links higher student cognitive skills (test scores) to markedly faster long-run GDP growth, implying that prioritizing youth education quality has large macroeconomic payoffs.",
        "source_6": "Duflo, E. (2003). Grandmothers and Granddaughters: Old-Age Pensions and Intrahousehold Allocation in South Africa. World Bank Economic Review, 17(1), 1–25. DOI: 10.1093/wber/lhg013. Shows that increased spending on elderly women (pensions) improved young girls’ nutritional status, suggesting that prioritizing older cohorts can indirectly benefit youth in multigenerational households, challenging a youth-only focus."
    }
}