{
    "question": "Should NATO countries and the government of Afghanistan negotiate a power-sharing deal with the Taliban?",
    "content": {
        "source_1": "Hartzell, Caroline A., and Matthew Hoddie. “Institutionalizing Peace: Power Sharing and Post–Civil War Conflict Management.” American Journal of Political Science 47(2), 2003. Cross-national analysis finds settlements that include political, territorial, and military power-sharing arrangements are significantly more durable, suggesting a power-sharing deal can reduce relapse risk in civil wars like Afghanistan’s.",
        "source_2": "McChrystal, Stanley A. “COMISAF Initial Assessment.” ISAF, August 30, 2009 (unclassified/FOUO). The top U.S./NATO commander assessed the war could not be won by force alone and called for Afghan-led reconciliation and reintegration of insurgents as part of a political settlement, bolstering arguments for negotiating with the Taliban.",
        "source_3": "Amnesty International. “Death in Slow Motion: Women and Girls Under Taliban Rule.” July 2022. Documents systematic restrictions and abuses against women and girls under Taliban rule since 2021, raising the concern that any power-sharing arrangement risks entrenching actors responsible for grave human rights violations.",
        "source_4": "Special Inspector General for Afghanistan Reconstruction (SIGAR). “Collapse of the Afghan National Defense and Security Forces: An Assessment of the Factors That Led to Its Demise.” May 2022. Concludes the 2020 Doha Agreement and subsequent negotiation trajectory sidelined Kabul and severely eroded ANDSF morale and support, enabling a Taliban military victory rather than a genuine negotiated power-sharing outcome.",
        "source_5": "The Asia Foundation. “A Survey of the Afghan People: Afghanistan in 2019.” 2019. Nationwide polling found many Afghans supported government negotiations with the Taliban to end the war but simultaneously insisted on preserving constitutional and women’s rights—indicating conditional public backing for any power-sharing deal.",
        "source_6": "Reuters. “Exclusive: Taliban aim to rule Afghanistan by council, no elections, senior member says.” August 18–19, 2021. Citing senior Taliban figure Waheedullah Hashimi, Reuters reports the movement’s rejection of elections and intent to rule via an Islamic emirate, signaling little appetite for inclusive power-sharing with rivals."
    }
}