{
    "question": "Should the school leaving age be raised to 18?",
    "content": {
        "source_1": "Oreopoulos, Philip (2006). “Estimating Average and Local Average Treatment Effects of Education When Compulsory Schooling Laws Really Matter.” American Economic Review. Uses changes in compulsory schooling laws in the US, UK, and Canada to show sizable earnings gains (on the order of 10% or more) for individuals compelled to stay in school longer, supporting the idea that raising the leaving age can increase lifetime income.",
        "source_2": "Lochner, Lance, and Enrico Moretti (2004). “The Effect of Education on Crime: Evidence from Prison Inmates, Arrests, and Self-Reports.” Quarterly Journal of Economics. Finds that additional schooling substantially reduces criminal activity; by increasing compulsory schooling, policymakers can generate crime-reduction externalities and social cost savings.",
        "source_3": "Department for Education (England) (various years; e.g., “Participation in education, training and employment: 16- to 18-year-olds in England”). Official statistics show that after England’s Raising the Participation Age to 18 (phased in by 2015), participation among 16–17-year-olds rose and NEET rates in these ages reached historically low levels, indicating the policy increased engagement in education or training.",
        "source_4": "Hanushek, Eric A., and Ludger Woessmann (2008). “The Role of Cognitive Skills in Economic Development.” Journal of Economic Literature. Argues that learning outcomes (cognitive skills) drive economic growth more than years of schooling alone; warns that simply extending compulsory schooling without improving quality may yield limited benefits.",
        "source_5": "OECD (2010). Learning for Jobs. OECD Publishing. Emphasizes that strong vocational education and training (including apprenticeships) improves youth transitions and labor-market outcomes; suggests that if leaving age is raised, allowing high-quality work-based pathways is crucial to avoid disengagement and maximize benefits.",
        "source_6": "Pischke, Jörn-Steffen, and Till von Wachter (2008). “Zero Returns to Compulsory Schooling in Germany? Evidence and Interpretation.” Quarterly Journal of Economics. Using German reforms, finds little to no earnings return from additional compulsory schooling in that context, highlighting that effects of raising the school-leaving age can be small where the marginal added schooling is low quality or poorly aligned with labor-market needs."
    }
}