{
    "question": "Should teachers be banned from interacting with students via social networking websites?",
    "content": {
        "source_1": "Texas Education Agency (TEA), “TEA reports increase in inappropriate student–educator relationships,” press release and annual discipline data (2016–2018). TEA documented record-high cases of inappropriate educator–student relationships, noting many began through text messaging and social media/private messaging apps. This pattern is cited by TEA leadership as justification for tighter restrictions on electronic communications to protect students.",
        "source_2": "Safer Recruitment Consortium (UK), “Guidance for Safer Working Practice for those working with children and young people in education settings” (updated 2019/2022). The advisory explicitly warns staff not to have personal online ‘friend’ relationships with pupils and to avoid one-to-one, unsupervised electronic communication, citing grooming risks and blurred professional boundaries. It frames strict separation on social platforms as a core safeguarding measure.",
        "source_3": "Junco, Heiberger, & Loken, “The effect of Twitter on college student engagement and grades,” Journal of Computer Assisted Learning (2011). A randomized classroom study found that structured, instructor-led Twitter use increased student engagement and modestly improved grades compared to control sections. The findings suggest that supervised social media interaction can be educationally beneficial, arguing against blanket bans.",
        "source_4": "UNESCO, “COVID-19 Education Response: Distance learning solutions” (2020). UNESCO recommended leveraging widely available tools such as WhatsApp and Facebook groups to maintain teacher–student contact where learning-management systems were unavailable, especially in low-bandwidth contexts. This highlights equity and continuity-of-learning concerns that broad bans could exacerbate.",
        "source_5": "Missouri “Amy Hestir Student Protection Act” (SB 54, 2011) and subsequent repeal/amendment (Special Session SB 1, 2011), plus ACLU statements. The original law restricted private online communication between teachers and students; it faced immediate legal challenges for overbreadth and was quickly revised. The episode illustrates that outright bans may be unconstitutional and impede legitimate pedagogical or mentoring communications.",
        "source_6": "New York City Department of Education, “Social Media Guidelines for DOE Staff” (2012, updated). NYC DOE permits teacher–student interaction on social networks under strict conditions: use of professional accounts, transparency, archiving, and prohibition on personal “friending.” This policy demonstrates a middle path—risk-managed professional use rather than categorical bans."
    }
}