{
    "question": "Should prostitution be legalised to protect sex workers from HIV/AIDS?",
    "content": {
        "source_1": "The Lancet Series on HIV and sex workers (Shannon et al., 2015). Using epidemiological modeling across high-burden settings, the series concluded that removing criminal penalties for sex work could avert roughly 33–46% of new HIV infections among sex workers and clients over a decade, primarily by reducing violence and police harassment and improving condom negotiation and service access. This supports the idea that legal reform can materially reduce HIV risk, though the authors specifically emphasize decriminalization rather than regulatory “legalization” models.",
        "source_2": "New Zealand Prostitution Law Review Committee, Report on the Prostitution Reform Act (2008). After New Zealand decriminalized sex work in 2003, the government’s multi-year evaluation found that sex workers reported greater ability to refuse clients and insist on condom use, improved access to health and police protection, and no evidence of a large increase in the number of sex workers. These outcomes indicate that removing criminal penalties can enhance HIV/STI prevention conditions.",
        "source_3": "Brents, Barbara G., and Kathryn Hausbeck, research on Nevada’s legal brothels (mid-2000s), and Nevada state public health records. Nevada’s licensed brothels require condom use for all sexual services and frequent STI/HIV screening; state records and academic studies have repeatedly noted no documented HIV transmissions among licensed brothel workers under this regulatory regime. This is often cited as evidence that tightly regulated legalization can minimize HIV risk in the regulated sector.",
        "source_4": "Dutch Ministry of Security and Justice (WODC) evaluations of the lifting of the brothel ban (e.g., Daalder, 2007; subsequent updates) and Vanwesenbeeck (2011) review. The Netherlands’ legalization improved oversight in licensed venues but left a substantial unlicensed/irregular sector, especially affecting migrant workers who faced barriers to licensing. Public health outreach and consistent condom use were harder to ensure in the unregulated sector, suggesting legalization alone may not protect those outside the licensed system, with mixed implications for HIV prevention.",
        "source_5": "Cho, Seo-Young; Dreher, Axel; Neumayer, Eric (2013), World Development. This cross-national study found that countries with legalized prostitution tend to experience higher reported inflows of human trafficking. If legalization expands the overall market and draws more coerced or marginalized workers into poorly regulated or hidden segments, the net effect could increase vulnerability to HIV, countering claims that legalization necessarily protects health.",
        "source_6": "WHO (2012) “Prevention and treatment of HIV and other STIs for sex workers” and UNAIDS (various guidance, e.g., 2021). Major global health bodies recommend decriminalization of sex work and oppose mandatory testing and registration often found in legalization schemes, arguing that rights-based, voluntary services are more effective for HIV prevention. Their position challenges the claim that “legalization” per se is the optimal pathway; they emphasize removing punitive laws without creating two-tiered regulatory systems that can leave many workers at heightened risk."
    }
}