{
    "question": "Should former colonial powers pay reparations to former colonies?",
    "content": {
        "source_1": "CARICOM Reparations Commission — Ten Point Plan for Reparatory Justice (Caribbean Community, ongoing). Outlines a government-backed case for reparations from former European colonial powers, specifying measures such as formal apologies, debt cancellation, technology transfer, and health/education investments as remedies for slavery and indigenous genocide. https://caricomreparations.org/ten-point-plan/",
        "source_2": "Jason Hickel, “How Britain stole $45 trillion from India” (The Guardian, Dec. 19, 2018), summarizing economist Utsa Patnaik’s archival estimates of the colonial “drain” (1765–1938). Presents a quantified claim of massive resource extraction from India to Britain, used by advocates to argue the scale of harm warrants reparations. https://www.theguardian.com/commentisfree/2018/dec/19/britain-ruined-india-colonialism",
        "source_3": "Nigel Biggar, Colonialism: A Moral Reckoning (William Collins/HarperCollins, 2023). Argues against blanket reparations, emphasizing the moral and historical complexity of empire (mixtures of harm and benefit), the difficulty of assigning liability across generations, and risks of collective guilt; favors forward-looking cooperation over retroactive payments.",
        "source_4": "United Nations, Durban Declaration and Programme of Action (World Conference against Racism, 2001). Recognizes slavery and the slave trade as crimes against humanity and acknowledges the suffering caused by colonialism, encouraging measures like apologies and debt relief, but does not establish a binding legal obligation for reparations—highlighting legal and jurisdictional limits. https://www.ohchr.org/en/instruments-mechanisms/instruments/durban-declaration-and-programme-action",
        "source_5": "UK Foreign & Commonwealth Office, Statement to Parliament on settlement of Mau Mau claims (June 6, 2013). The UK issued an apology and paid £19.9 million to over 5,000 Kenyan claimants for colonial-era torture, demonstrating that targeted, evidentiary-based compensation for specific abuses is possible, though it falls short of broad colonial reparations. https://www.gov.uk/government/speeches/statement-to-parliament-on-settlement-of-mau-mau-claims",
        "source_6": "Paul Collier, The Bottom Billion (Oxford University Press, 2007). From a development-effectiveness perspective, contends that large financial transfers to poor countries often fail without governance and policy reforms; suggests that reparations framed as cash transfers risk misallocation and that institutional and security interventions may yield better outcomes."
    }
}