{
    "question": "Should we force feed sufferers of Anorexia Nervosa?",
    "content": {
        "source_1": "National Institute for Health and Care Excellence (NICE), Eating disorders: recognition and treatment (NG69, 2017; updated). UK guideline stating that compulsory treatment, including nasogastric feeding, may be necessary as a last resort to prevent serious deterioration or death when a person with anorexia refuses life-saving care, and should be undertaken within legal frameworks (e.g., Mental Health Act), with ongoing attempts to obtain consent and use the least restrictive options.",
        "source_2": "Royal College of Psychiatrists, MARSIPAN: Management of Really Sick Patients with Anorexia Nervosa (guideline, updated editions). Clinical guidance emphasizing that nasogastric feeding (sometimes under restraint) can be lifesaving in severe anorexia but carries significant medical risks (e.g., refeeding syndrome, electrolyte disturbances) and must be done in specialist settings with senior oversight and careful monitoring—highlighting the potential harms and the need for stringent safeguards.",
        "source_3": "Systematic review in a peer‑reviewed eating disorders journal (e.g., International Journal of Eating Disorders/Journal of Eating Disorders, late 2010s): Evidence synthesis reporting mixed outcomes of involuntary treatment in anorexia nervosa—short‑term weight restoration is often achievable, but long‑term benefits are unclear; studies note possible longer hospital stays, higher readmission rates, and strained therapeutic relationships compared with voluntary care, suggesting uncertain net benefit.",
        "source_4": "United Nations Committee on the Rights of Persons with Disabilities, General Comment No. 1 (2014) and subsequent statements. Human‑rights position arguing that involuntary treatment and feeding without free and informed consent are incompatible with the CRPD, constitute discrimination on the basis of disability, and should be replaced by supported decision‑making—presenting a principled objection to force‑feeding regardless of clinical intent.",
        "source_5": "Lock, Le Grange, et al., randomized trials of Family‑Based Treatment (FBT) for adolescent anorexia nervosa (e.g., Arch Gen Psychiatry, 2010). RCT evidence showing higher remission rates and faster weight restoration with non‑coercive, family‑centered outpatient care compared with individual therapies, indicating that effective alternatives can reduce reliance on coercive measures in many cases.",
        "source_6": "American Psychiatric Association, Practice Guideline for the Treatment of Patients With Eating Disorders (3rd ed., 2023). U.S. guideline noting that involuntary hospitalization or treatment may be ethically and clinically justified when there is imminent risk to life and impaired decision‑making capacity, but recommending rigorous capacity assessment, due process, time‑limited use, and active efforts to preserve the therapeutic alliance—supporting tightly circumscribed, criteria‑based use rather than a blanket endorsement."
    }
}