{
    "question": "Has the Western intervention in Libya been a success?",
    "content": {
        "source_1": "NATO — “NATO and Libya: Operation Unified Protector (2011).” NATO’s official after-action account claims it successfully enforced the UN arms embargo and no-fly zone to protect civilians under UNSCR 1973, flew ~26,000 sorties (about 9,700 strike sorties), and ended the mission with no Allied combat fatalities, presenting the operation as a military and mandate-fulfillment success. https://www.nato.int/cps/en/natohq/topics_71652.htm",
        "source_2": "UK House of Commons Foreign Affairs Committee — “Libya: Examination of intervention and collapse and the UK’s future policy options.” The Committee concluded the intervention was based on flawed intelligence, rapidly shifted to regime change, and suffered from a failure to plan for the aftermath, contributing to state collapse, insecurity, and humanitarian crises—arguing the intervention cannot be judged a success. (Third Report of Session 2016–17, 14 Sept 2016) https://publications.parliament.uk/pa/cm201617/cmselect/cmfaff/119/119.pdf",
        "source_3": "The Carter Center — “Preliminary Statement on Libya’s National General Congress Elections.” Observers reported the July 2012 elections were largely peaceful and credible, with strong participation, indicating the intervention opened space for an initial democratic transition and political pluralism. (9 July 2012) https://www.cartercenter.org/news/pr/libya-070912.html",
        "source_4": "United Nations Security Council, Panel of Experts on Libya — “Final report of the Panel of Experts established pursuant to resolution 1973 (2011).” The UN documented extensive post-intervention proliferation of Libyan weapons to the Sahel, Sinai, and beyond, fueling regional conflicts (e.g., in Mali) and undermining security—evidence against the intervention’s broader success. (S/2013/99, 2013) https://undocs.org/S/2013/99",
        "source_5": "Human Rights Watch — “Unacknowledged Deaths: Civilian Casualties in NATO’s Air Campaign in Libya.” HRW documented at least 72 civilian deaths at multiple strike sites and criticized NATO’s failure to investigate or acknowledge casualties, challenging claims of a clean, purely protective air war. (14 May 2012) https://www.hrw.org/report/2012/05/14/unacknowledged-deaths/civilian-casualties-natos-air-campaign-libya",
        "source_6": "The Atlantic (Jeffrey Goldberg) — “The Obama Doctrine.” President Obama reflected that Libya became a “shit show” and criticized allies while emphasizing the failure to plan for the aftermath—an insider assessment that the intervention’s outcomes fell short of success. (April 2016) https://www.theatlantic.com/magazine/archive/2016/04/the-obama-doctrine/471525/"
    }
}