{
    "question": "Are prescription drugs overpriced?",
    "content": {
        "source_1": "RAND Corporation (2021) — International price comparison finds U.S. brand-name drug prices far higher than peers. RAND estimated that U.S. prescription drug prices overall were 2.56 times those in 32 OECD countries on average, and brand-name drugs were 3.44 times higher, suggesting U.S. prices are elevated relative to other wealthy nations (Mulcahy et al., “International Prescription Drug Price Comparisons”).",
        "source_2": "Congressional Budget Office (2021) — High prices support R&D; lowering them risks fewer new drugs. CBO concluded that policies reducing pharmaceutical revenues would lead to fewer new drug approvals over time (e.g., a 10% drop in expected returns is associated with roughly a 6% decrease in new drugs), framing current pricing as tied to incentives for innovation (“Research and Development in the Pharmaceutical Industry”).",
        "source_3": "Institute for Clinical and Economic Review (2020) — Many U.S. price hikes lack new evidence, adding large costs. ICER’s Unsupported Price Increase report found that net price hikes for several widely used drugs, not justified by new clinical evidence, increased U.S. spending by about $1.7 billion in a single year, indicating some increases are not value-based (“Unsupported Price Increase Report 2020”).",
        "source_4": "IQVIA (2024) — Net prices for brand medicines have been flat to declining, and generics dominate use. IQVIA reports that after accounting for rebates and discounts, net manufacturer prices for branded drugs have declined annually since 2018, and roughly 90% of prescriptions are low-cost generics—evidence that headline list prices can overstate what the system actually pays (“The Use of Medicines in the U.S. 2024”).",
        "source_5": "Federal Trade Commission (2024) — PBM rebate incentives can push list prices higher and raise patient costs. The FTC’s interim staff report from its 6(b) study found that pharmacy benefit manager practices—such as rebate structures and “rebate walls”—can favor higher list price drugs and exclude lower-cost competitors, causing patients with coinsurance tied to list prices to pay more (“Interim Staff Report on Pharmacy Benefit Managers,” 2024).",
        "source_6": "World Health Organization (2018) — Medicine prices often aren’t linked to R&D costs or clinical value. A WHO technical report on cancer medicine pricing found no clear relationship between R&D expenditures and launch prices; prices often reflect what markets will bear rather than development costs, suggesting overpricing relative to value in many cases (“Pricing of cancer medicines and its impacts”)."
    }
}