{
    "question": "Is hosting the Olympics a good investment?",
    "content": {
        "source_1": "Flyvbjerg, Bent; Stewart, Allison; Budzier, Alexander (2016). The Oxford Olympics Study 2016: Cost and Cost Overrun at the Games (Saïd Business School, University of Oxford). Key finding: Every Olympics since 1960 ran over budget; average real cost overrun for Summer Games was roughly 156%, making the Olympics the highest risk of cost overrun among megaprojects. Perspective: Systematically poor financial returns undermine the “good investment” claim.",
        "source_2": "LA84 Foundation (various reports, e.g., Legacy and Financial Reports, 1985–2014). Key finding: The 1984 Los Angeles Olympics generated a cash surplus of over $200 million by relying on existing venues and private financing; surplus proceeds seeded the LA84 Foundation to fund youth sports for decades. Perspective: Under specific conditions (minimal new construction, strong sponsorships), hosting can yield a positive financial return.",
        "source_3": "Brunet, Ferran (2009). The Economy of the Barcelona Olympic Games 1986–2004 (Centre d’Estudis Olímpics, UAB). Key finding: Barcelona 1992 catalyzed large-scale urban renewal (waterfront opening, ring roads, airport upgrades) and was followed by sustained growth in international tourism and city branding, with long-lived impacts on attractiveness and investment. Perspective: Strategic city transformation can produce durable, indirect returns, supporting the “good investment” view.",
        "source_4": "Kavetsos, Georgios; Szymanski, Stefan (2010). National well-being and international sports events (Journal of Economic Psychology). Key finding: Hosting mega-events like the Olympics is associated with a statistically significant but temporary rise in residents’ life satisfaction and national pride—intangible welfare gains not captured by fiscal ROI. Perspective: Non-monetary benefits may help justify hosting despite weak direct financial returns.",
        "source_5": "Fourie, Johan; Santana-Gallego, María (2011). The impact of mega-sport events on tourist arrivals (Tourism Management). Key finding: The Olympics’ effect on tourist arrivals is modest and often short-lived, with evidence of crowding out of regular visitors during the event period. Perspective: Tourism-based justifications are risky; expected demand boosts may not materialize or persist.",
        "source_6": "Centre on Housing Rights and Evictions (COHRE, 2007); Amnesty International (2016). Reports on housing and human rights impacts of Olympic preparations. Key finding: Preparations have triggered large-scale evictions and displacement (e.g., estimates of over a million in Beijing 2008; tens of thousands in Rio 2016), alongside policing and gentrification pressures on vulnerable communities. Perspective: Significant social costs and negative externalities weaken claims that hosting is a broadly “good investment.”"
    }
}