{
    "question": "Should celebrities be allowed to switch off the limelight?",
    "content": {
        "source_1": "Leveson Inquiry Report (UK, 2012) — An official investigation into press standards found systemic privacy intrusions (e.g., phone hacking of celebrities and private individuals) and recommended stronger protections against undue media intrusion. Evidence that constant limelight can cause demonstrable harm and justifies mechanisms to opt out of exposure.",
        "source_2": "Bartnicki v. Vopper, 532 U.S. 514 (2001) — The U.S. Supreme Court held that publishing truthful, lawfully obtained information on matters of public concern is protected by the First Amendment. This underscores a legal and normative limit on any broad “switch off the limelight” right for public figures, given press and public-interest protections.",
        "source_3": "Sherwin Rosen, “The Economics of Superstars,” American Economic Review (1981) — Found that small differences in talent can yield outsized rewards due to mass audiences, making visibility a core driver of income in celebrity markets. A broad right to switch off exposure could reduce market efficiency, fan access, and overall cultural output tied to attention-driven industries.",
        "source_4": "California privacy and anti-paparazzi laws (Cal. Civ. Code §1708.8; SB 606, 2013) — Targeted statutes penalize intrusive image capture and harassment, especially of celebrities’ children, without banning news coverage. Demonstrates a middle-ground policy: narrow protections against harassment rather than a general right to exit public scrutiny.",
        "source_5": "The “Streisand Effect” (Barbra Streisand v. Pictopia, 2003) — An attempt to suppress an aerial photo of Streisand’s home drew massive additional attention, illustrating how efforts to “switch off” publicity can backfire technologically and socially, making enforceability of a broad opt-out impractical.",
        "source_6": "Investigative reporting on Harvey Weinstein (New York Times, Oct. 2017; New Yorker, Oct. 2017) — High-profile journalism exposed patterns of abuse by a powerful entertainment figure, catalyzing accountability and industry reform. Shows that restricting scrutiny of celebrities could impede the public interest and harm victims who rely on media attention to surface wrongdoing."
    }
}