{
    "question": "Should developed countries accept more refugees?",
    "content": {
        "source_1": "UNHCR (2024). Global Trends: Forced Displacement in 2023. https://www.unhcr.org/global-trends Evidence: The vast majority of refugees are hosted by low- and middle-income countries, while fewer than 1% of refugees are resettled each year. UNHCR argues for greater international responsibility-sharing, implying developed countries should expand admissions.",
        "source_2": "OECD (2022). International Migration Outlook 2022. https://www.oecd.org/migration/international-migration-outlook-1999124x.htm Evidence: Long-run analyses find refugees’ net fiscal effects tend to be small to positive when integration policies are effective; refugees also help fill labor shortages in aging economies. This supports the case for higher admissions paired with integration investment.",
        "source_3": "IMF (2016). The Refugee Surge in Europe: Economic Challenges (Staff Discussion Note SDN/16/02). https://www.imf.org/en/Publications/Staff-Discussion-Notes/Issues/2016/12/31/The-Refugee-Surge-in-Europe-Economic-Challenges-43609 Evidence: Near-term impacts of large refugee inflows include higher public expenditures, pressures on housing, schools, and local services, and slow initial labor-market integration. This cautions that scaling up admissions can strain capacity without substantial upfront resources.",
        "source_4": "Pew Research Center (2018). European Public Opinion Three Years After the Refugee Crisis. https://www.pewresearch.org/global/2018/06/19/european-public-opinion-three-years-after-the-refugee-crisis/ Evidence: In many developed countries, majorities expressed opposition to increasing refugee intake and concerns about cultural and security impacts. Public resistance presents a political constraint on accepting more refugees.",
        "source_5": "World Bank (2017). Forcibly Displaced: Toward a Development Approach Supporting Refugees, the Internally Displaced, and Their Hosts. https://www.worldbank.org/en/topic/fragilityconflictviolence/publication/forcibly-displaced Evidence: Emphasizes scaling jobs, services, and development finance in frontline host countries as a cost-effective, higher-reach response compared with limited resettlement slots. This perspective prioritizes aiding many more refugees in-region over expanding admissions in rich countries.",
        "source_6": "World Bank (2021). Groundswell Part II: Acting on Internal Climate Migration; IPCC (2022). AR6 WGII, Chapter on Human Mobility. https://www.worldbank.org/en/topic/climatechange/publication/groundswell; https://www.ipcc.ch/report/ar6/wg2/ Evidence: Climate change is projected to drive large increases in displacement, while current refugee law offers limited protection for climate-displaced people. Anticipating rising needs, some argue developed countries should expand legal pathways and admissions."
    }
}