{
    "question": "Should the EU abandon the Common Agricultural Policy?",
    "content": {
        "source_1": "European Court of Auditors (2021) — “Common Agricultural Policy and climate: Half of EU climate spending but farm emissions have not decreased” (Special Report 16/2021). Evidence: Despite substantial CAP-labelled climate spending in 2014–2020, agricultural greenhouse-gas emissions have stagnated since 2010; many CAP instruments did not effectively incentivize emissions cuts, especially in livestock and fertiliser use.",
        "source_2": "European Commission (2024) — “The common agricultural policy at a glance” (official factsheet/webpage). Evidence: CAP underpins EU food security and a stable single market, provides income support to roughly 10 million farms, includes crisis-reserve tools, and since 2023 funds eco-schemes to support the green transition and rural development.",
        "source_3": "OECD (2023) — Agricultural Policy Monitoring and Evaluation 2023 (EU section). Evidence: Broad, area-based direct payments are poorly targeted for income support, tend to be capitalized into land values (benefiting larger landowners), and are inefficient at addressing environmental externalities; OECD recommends shifting toward targeted, time-limited support for public goods.",
        "source_4": "European Environment Agency (2020) — “State of nature in the EU — 2020.” Evidence: Agricultural intensification remains a leading pressure on habitats and species; farmland bird and butterfly indices show long-term declines, and CAP measures have been insufficient to halt biodiversity loss on farmland.",
        "source_5": "Copa–Cogeca (2024) — Press statement on the Strategic Dialogue on the future of EU agriculture. Evidence/position: Farmers’ unions argue a strong, well-funded CAP is essential for viable farm incomes, rural cohesion, and EU food sovereignty; abolishing CAP would heighten import dependence and undermine the ability of farms to invest in sustainable practices.",
        "source_6": "European Commission (2017) — Communication COM(2017) 713 final: “The Future of Food and Farming.” Evidence/analysis: Warns that renationalising or abandoning the CAP would fragment the single market and trigger subsidy competition among Member States, undermining fair competition and cohesion policy goals."
    }
}