{
    "question": "Should cell phones be allowed in schools?",
    "content": {
        "source_1": "Beland, L., & Murphy, R. (2016). Ill Communication: Technology, Distraction & Student Performance — Labour Economics. Natural experiment across English secondary schools found that banning student cell phones raised test scores by 6.4% on average, with the largest gains among lower-achieving and disadvantaged students. Evidence that in-school phone access can harm academic performance.",
        "source_2": "Sung, Y.-T., Chang, K.-E., & Liu, T.-C. (2016). The effects of integrating mobile devices with teaching and learning on students’ learning performance: A meta-analysis — Computers & Education. Synthesizing 100+ studies, the meta-analysis reports a significant positive effect of mobile device–supported instruction on learning outcomes when aligned with pedagogy. Evidence that, when purposefully integrated, student phones can improve learning.",
        "source_3": "Pew Research Center (2023). Parenting Children in the Age of Screens. National survey shows parents widely rely on phones to coordinate with and check on their teens and view them as important safety tools for logistics and emergencies. Evidence that allowing student phone access supports family communication and perceived safety.",
        "source_4": "U.S. Department of Education, Readiness and Emergency Management for Schools (REMS) TA Center (Guides on School EOPs and Family Reunification, 2013–2021). Federal emergency planning guidance warns that uncontrolled student use of cell phones during crises can spread misinformation, impede accountability, and complicate reunification and responder operations. Evidence that restricting student phone use—especially during incidents—can improve emergency response.",
        "source_5": "OECD (2015). Students, Computers and Learning: Making the Connection. Cross-national analysis finds that heavy in-school ICT use is associated with poorer student outcomes and that technology access can mirror and magnify socioeconomic disparities; BYOD policies risk widening gaps. Evidence that broad allowances for phones may harm learning and equity.",
        "source_6": "U.S. Department of Education, Office of Educational Technology (2024). National Education Technology Plan. Highlights mobile accessibility features (e.g., text-to-speech, speech-to-text, translation, visual supports) as critical supports for students with disabilities and English learners. Evidence that permitting phones can provide essential accessibility and language supports."
    }
}