{
    "question": "Do the health benefits of genetically modified foods outweigh their risks?",
    "content": {
        "source_1": "National Academies of Sciences, Engineering, and Medicine (2016). Genetically Engineered Crops: Experiences and Prospects. The comprehensive review found no substantiated evidence that foods from currently commercialized GE crops are less safe than their non-GE counterparts, and noted potential direct health benefits (for example, reduced mycotoxins and improved nutrient profiles) while emphasizing case-by-case assessment.",
        "source_2": "Pellegrino, E. et al. (2018). Impact of Bt maize on agronomic performance and target/non-target organisms: A meta-analysis. Scientific Reports. Synthesizing decades of field data, the study reported significantly lower mycotoxin contamination in Bt maize relative to conventional maize, a direct human health benefit given mycotoxins’ links to liver cancer and birth defects.",
        "source_3": "Tang, G. et al. (2012). Beta-carotene in Golden Rice is as good as beta-carotene in oil at providing vitamin A to children. American Journal of Clinical Nutrition. A controlled feeding trial in children showed that beta-carotene from Golden Rice is efficiently converted to vitamin A, supporting the potential of GM biofortified foods to reduce vitamin A deficiency–related morbidity and mortality.",
        "source_4": "International Agency for Research on Cancer (IARC) (2015). Monograph 112: Glyphosate. IARC classified glyphosate—the herbicide closely associated with many herbicide-tolerant GM crops—as “probably carcinogenic to humans” (Group 2A), raising a potential health risk concern tied to GM crop production systems.",
        "source_5": "European Chemicals Agency (ECHA, 2022) and European Food Safety Authority (EFSA, 2023) assessments of glyphosate; U.S. EPA (2020) cancer classification. These regulators concluded glyphosate should not be classified as a carcinogen and that, under approved uses, risks are within acceptable bounds—an opposing evaluation that supports the view that GM-associated herbicide risks can be managed to low health concern.",
        "source_6": "Nordlee, J.A. et al. (1996). Identification of a Brazil-nut allergen in transgenic soybeans. New England Journal of Medicine. Researchers showed that transferring a Brazil nut gene into soy introduced a known allergen recognized by sera from Brazil nut–allergic individuals; the GM line was halted, illustrating a credible pathway for novel allergenicity and the importance of stringent premarket testing."
    }
}