{
    "question": "Should we believe in the woman's right to choose?",
    "content": {
        "source_1": "World Health Organization, Abortion care guideline (2022). https://www.who.int/publications/i/item/9789240039483 — Synthesizes global evidence that access to safe, legal abortion is essential health care; restrictive laws do not reduce abortion incidence but increase unsafe procedures and maternal morbidity/mortality, supporting the view that protecting choice improves health outcomes.",
        "source_2": "Dobbs v. Jackson Women’s Health Organization, 142 S. Ct. 2228 (U.S. 2022). Opinion: https://www.supremecourt.gov/opinions/21pdf/19-1392_6j37.pdf — The U.S. Supreme Court held the Constitution does not confer a right to abortion and returned the issue to the states based on history-and-tradition reasoning, a legal perspective that challenges the claim of a protected right to choose.",
        "source_3": "Judith Jarvis Thomson, A Defense of Abortion, Philosophy & Public Affairs 1(1): 47–66 (1971). JSTOR: https://www.jstor.org/stable/2265091 — Classic philosophical argument (e.g., the “violinist” analogy) that even if a fetus has personhood, a pregnant woman’s bodily autonomy can justify abortion, offering a rights-based rationale for choice.",
        "source_4": "Don Marquis, Why Abortion Is Immoral, The Journal of Philosophy 86(4): 183–202 (1989). JSTOR: https://www.jstor.org/stable/2026961 — Argues abortion is prima facie seriously wrong because it deprives the fetus of a “future like ours,” a moral framework that weighs against abortion and thus against an unqualified right to choose.",
        "source_5": "Diana Greene Foster et al., The Turnaway Study (ANSIRH/UCSF), book (2020) and related peer-reviewed papers. Overview: https://www.ansirh.org/research/turnaway-study — Longitudinal U.S. evidence showing women denied wanted abortions experience greater economic hardship, higher odds of poverty and debt, and worse short-term health outcomes compared to those who received abortions, supporting the claim from socioeconomic and wellbeing perspectives.",
        "source_6": "Stuart W. G. Derbyshire & John C. Bockmann, Reconsidering fetal pain, Journal of Medical Ethics 46(1): 3–6 (2020). https://jme.bmj.com/content/46/1/3 — Reviews neurodevelopment literature to argue fetal pain may be possible earlier than traditionally thought (12–24 weeks), suggesting ethical grounds for gestational limits or analgesia, a consideration that complicates or constrains a broad right to choose."
    }
}