{
    "question": "Should retailers be prohibited from selling certain items at a loss as a marketing device?",
    "content": {
        "source_1": "U.S. Supreme Court, Brooke Group Ltd. v. Brown & Williamson Tobacco Corp., 509 U.S. 209 (1993). Sets the modern U.S. standard for predatory pricing, holding that below-cost pricing is not unlawful absent a dangerous probability of recoupment; underscores that aggressive price-cutting often benefits consumers and that blanket bans risk chilling procompetitive behavior.",
        "source_2": "European Court of Justice, Joined Cases C‑267/91 and C‑268/91, Keck and Mithouard (1993). Upholds France’s prohibition on resale at a loss as a permissible “selling arrangement,” establishing that EU Member States may lawfully ban below-cost retailing to pursue fairness or market-order objectives, provided rules apply equally to domestic and imported goods.",
        "source_3": "Biscourp, L., Boutin, X., and Vergé, T. (2013), “The Effects of Retail Regulations on Prices: Evidence from the Loi Galland,” Journal of Regulatory Economics. Empirical analysis of France’s ban on resale below cost finds it raised retail prices and margins, especially for lower-end and private-label products, indicating consumer harm from such prohibitions.",
        "source_4": "World Health Organization (2018/2019), SAFER initiative and Global status reports on alcohol and health. Reviews public-health evidence that restricting deep discounting (including bans on below-cost alcohol sales) reduces harmful consumption and related harms; supports targeted prohibitions for specific products like alcohol on health grounds.",
        "source_5": "UK Competition Commission, “The supply of groceries in the UK market investigation,” Final Report (April 2008). Concludes that supermarket loss-leading on a small number of items was not a primary competition problem overall, though “local price flexing” could disadvantage nearby convenience stores; recommended supply-chain and transparency remedies rather than prohibiting below-cost retailing.",
        "source_6": "Australian Competition and Consumer Commission (2013), Enforceable undertakings by Coles and Woolworths to limit fuel shopper-docket discounts. ACCC secured limits on large fuel discounts funded by grocery sales, citing concerns about distortion of fuel competition; illustrates that targeted restrictions on cross-subsidized loss-leading can protect competition in specific markets without a blanket ban."
    }
}