{
    "question": "Should home schooling be banned?",
    "content": {
        "source_1": "Elizabeth Bartholet, “Homeschooling: Parent Rights Absolutism vs. Child Rights to Education and Protection,” Arizona Law Review, Vol. 62 (2020). https://arizonalawreview.org/homeschooling-parent-rights-absolutism-vs-child-rights-to-education-and-protection/ - Argues for a presumptive ban or severe restrictions on homeschooling, citing risks to children’s rights to a meaningful education, exposure to diverse ideas, and protection from maltreatment, as well as concerns about extremist indoctrination and lack of oversight.",
        "source_2": "European Court of Human Rights, Wunderlich v. Germany (App. No. 18925/15), Judgment of 10 Jan. 2019. https://hudoc.echr.coe.int/eng?i=001-188142 - Upholds Germany’s prohibition on homeschooling as compatible with the European Convention on Human Rights, accepting the state’s interest in ensuring social integration and minimum educational standards; presents a legal precedent that a ban can be justified on social-cohesion grounds.",
        "source_3": "Pierce v. Society of Sisters, 268 U.S. 510 (1925), U.S. Supreme Court. Oyez summary: https://www.oyez.org/cases/1900-1940/268us510 - Establishes that the state may not compel only public schooling and must respect parents’ rights to direct their children’s education, implying that a categorical ban on homeschooling in the U.S. would face serious constitutional barriers.",
        "source_4": "National Center for Education Statistics (NCES), “Homeschooled Students” (Condition of Education Indicator). https://nces.ed.gov/programs/coe/indicator/cgg - Provides data on the size and characteristics of the homeschool population and parents’ stated reasons (e.g., concerns about school environment/safety, dissatisfaction with academics, special needs). Indicates many families homeschool for pragmatic or protective reasons, suggesting a ban could harm students seeking tailored or safer options.",
        "source_5": "Brian D. Ray, “A Systematic Review of the Empirical Research on Selected Aspects of Homeschooling as a School Choice,” Journal of School Choice 11(4): 604–621 (2017). https://www.tandfonline.com/doi/full/10.1080/15582159.2017.1395638 - Reviews studies finding homeschooled students often perform at or above average academically and report positive social outcomes; while noting methodological caveats, the evidence challenges the notion that outcomes justify a blanket ban.",
        "source_6": "Coalition for Responsible Home Education, “Homeschooling’s Invisible Children” case archive. https://hsinvisiblechildren.org/ - Documents cases where homeschooling status was used to conceal severe abuse or educational neglect, highlighting oversight gaps in some jurisdictions; used by advocates to argue that weak regulation can endanger children and to support calls for tighter controls or bans."
    }
}