{
    "question": "Should traditional universities be replaced by online learning?",
    "content": {
        "source_1": "U.S. Department of Education (Means, Toyama, Murphy, Bakia, & Jones), 2010, “Evaluation of Evidence-Based Practices in Online Learning: A Meta-Analysis and Review of Online Learning Studies” (https://www2.ed.gov/rschstat/eval/tech/evidence-based-practices/finalreport.pdf). Finding: Across dozens of rigorous studies, students in online courses performed modestly better, on average, than those in face-to-face settings, with blended learning performing best—evidence that online modalities can match or exceed traditional instruction academically.",
        "source_2": "Di Xu & Shanna Smith Jaggars, 2013, “The Impact of Online Learning on Students’ Course Outcomes: Evidence from a Large Community and Technical College System” (CCRC Working Paper No. 54) (https://ccrc.tc.columbia.edu/publications/online-learning-student-outcomes.html). Finding: In a large-scale naturalistic study, community college students were more likely to withdraw and earned lower grades in online courses, with the negative effects larger for less-prepared and underrepresented students—indicating equity and completion challenges if fully replacing in-person college.",
        "source_3": "David J. Deming, Claudia Goldin, Lawrence F. Katz, & Noam Yuchtman, 2016 (NBER Working Paper 20528, 2014), “The Value of Postsecondary Credentials in the Labor Market: An Experimental Study” (https://www.nber.org/papers/w20528). Finding: Resume-audit experiments showed significantly fewer employer callbacks for applicants listing online for-profit degrees versus comparable non-selective public degrees—suggesting some online credentials are discounted in the labor market relative to traditional pathways.",
        "source_4": "Raj Chetty et al., 2022, “Social capital II: Determinants of economic connectedness” (Nature 608:122–134) (https://www.nature.com/articles/s41586-022-04997-8). Finding: Using large-scale social network data, the study identifies schools and colleges as key places where cross-class friendships form, and such ties strongly predict upward mobility—implying in-person campus environments create social capital that may be hard to replicate purely online.",
        "source_5": "Georgia Tech College of Computing, OMSCS Program Overview (accessed 2024), “Online Master of Science in Computer Science (OMSCS)” (https://omscs.gatech.edu/about). Evidence: The OMSCS delivers an identical degree at scale (10,000+ active students) with total tuition under roughly $7,000, demonstrating that high-quality, accredited degrees can be offered online globally at dramatically lower cost than traditional on-campus programs.",
        "source_6": "American Chemical Society, 2020, “ACS Guidelines for Bachelor’s Degree Programs in Chemistry” (https://www.acs.org/education/policies/acs-guidelines-for-bachelor-degree-programs.html). Requirement: For ACS-certified degrees, substantial hands-on laboratory experience is mandatory and virtual labs are not accepted as substitutes—indicating that in some disciplines, core learning outcomes require physical facilities and in-person practice, challenging full replacement by online learning."
    }
}