{
    "question": "Should religious symbols in public buildings be banned?",
    "content": {
        "source_1": "German Federal Constitutional Court, Kruzifix decision (BVerfGE 93, 1), 1995 — Struck down a Bavarian rule mandating crucifixes in public school classrooms as violating students’ negative freedom of religion and the state’s duty of religious neutrality. Supports bans on state-imposed religious symbols in public educational buildings to protect individual rights.",
        "source_2": "Supreme Court of Canada, Mouvement laïque québécois v. Saguenay (City), 2015 SCC 16 — Held that reciting a religious prayer at city council meetings breached the state’s duty of religious neutrality and discriminated against non-believers. Provides evidence that official religious expressions in civic spaces can exclude and stigmatize, bolstering arguments for removing religious symbols from public venues.",
        "source_3": "U.S. Supreme Court, McCreary County v. ACLU of Kentucky, 545 U.S. 844 (2005) — Struck down Ten Commandments displays inside courthouses because their predominant purpose was religious, violating the Establishment Clause. Illustrates that overt religious displays in public buildings can be unconstitutional, supporting bans in such settings.",
        "source_4": "European Court of Human Rights, Lautsi and Others v. Italy, App. No. 30814/06 (Grand Chamber, 2011) — Upheld crucifixes in Italian public school classrooms, viewing them as “passive symbols” and granting states a margin of appreciation under the European Convention. Counters blanket bans by indicating such symbols do not necessarily amount to indoctrination or a rights violation.",
        "source_5": "U.S. Supreme Court, The American Legion v. American Humanist Association, 588 U.S. ___ (2019) — Upheld a longstanding cross monument on public land, presuming constitutionality for historical displays with religious associations and cautioning against “purging” religious references from the public sphere. Undercuts categorical bans by emphasizing tradition, history, and the risk of hostility to religion.",
        "source_6": "Conseil d’État (France), Ass., 9 Nov. 2016, Fédération de la libre pensée de Vendée, Nos. 395122 & 395223 — Ruled that nativity scenes in public buildings may be permissible when they serve cultural, artistic, or festive purposes, but not when they amount to proselytism. Supports a contextual, case-by-case approach rather than an absolute prohibition on religious symbols in public buildings."
    }
}