{
    "question": "Should people be allowed to sell their own organs?",
    "content": {
        "source_1": "Ghods, A. J., & Savaj, S. (2006). The Iranian model of paid and regulated living-unrelated kidney donation. Clinical Journal of the American Society of Nephrology. Evidence that a regulated compensation system in Iran virtually eliminated the kidney transplant waiting list and increased transplant rates, suggesting that allowing sales (under strict oversight) can expand supply and save lives.",
        "source_2": "Goyal, M., Mehta, R. L., Schneiderman, L. J., & Sehgal, A. R. (2002). Economic and health consequences of selling a kidney in India. JAMA. Survey of kidney sellers found most remained in debt and reported worsened health and reduced work capacity after selling, indicating that organ markets can harm poor donors even when transactions are “consensual.”",
        "source_3": "Radcliffe-Richards, J., Daar, A. S., Guttmann, R. D., Hoffenberg, R., Kennedy, I., Lock, M., Sells, R. A., & Kennedy, R. (1998). The case for allowing kidney sales. The Lancet. Ethical analysis arguing that prohibiting organ sales violates individual autonomy and pushes trade underground; proposes regulated markets as a harm-reduction approach that can benefit both donors and recipients.",
        "source_4": "World Health Organization (2010). WHO Guiding Principles on Human Cell, Tissue and Organ Transplantation (revised). Policy statement rejecting organ sales on the grounds of exploitation, coercion, and inequity, and endorsing voluntary, unpaid donation to protect vulnerable populations and maintain fairness in access.",
        "source_5": "Becker, G. S., & Elias, J. J. (2007). Introducing incentives in the market for live and cadaveric organ donations. Journal of Economic Perspectives. Economic modeling suggests that modest, regulated payments (e.g., on the order of tens of thousands of dollars per kidney) could eliminate shortages and be highly cost-effective by reducing dialysis and mortality costs.",
        "source_6": "Lavee, J., Ashkenazi, T., Gurman, G., & Steinberg, D. (2013). A new law in Israel increased organ donation and decreased transplant tourism. American Journal of Transplantation. Empirical evidence that noncash, nonmarket reforms—such as donor-priority in allocation and stronger infrastructure—significantly increased donation rates, indicating alternatives to organ sales can address shortages."
    }
}