{
    "question": "Should inheritance tax be raised to 100% for everyone born in the UK?",
    "content": {
        "source_1": "Thomas Piketty, Capital and Ideology (Harvard University Press, 2020) — Documents the rising role of inheritance in wealth concentration in advanced economies and argues for very progressive inheritance and wealth taxes (including extremely high marginal rates on large bequests) to democratize capital. Provides empirical and normative support for using inheritance taxation to curb dynastic inequality, a rationale sometimes invoked to justify near-confiscatory rates at the top.",
        "source_2": "Joel Slemrod and Wojciech Kopczuk, Dying to Save Taxes: Evidence from Estate Tax, Review of Economics and Statistics, 2003 — Finds measurable behavioral responses to the U.S. estate tax, including shifting the timing of death around tax changes, and broader evidence of avoidance and timing/planning responses. Indicates that very high rates could trigger substantial avoidance, potentially undermining revenue and policy goals.",
        "source_3": "Daniel Waldenström, Magnus Henrekson, and Gunnar Du Rietz, The Swedish Inheritance and Gift Tax, 1884–2004, Econ Journal Watch, 2015 — Analyzes Sweden’s experience with inheritance/gift taxation, concluding it raised little revenue, imposed high administrative and economic costs (especially for family firms), and encouraged avoidance; Sweden ultimately abolished the tax in 2004. Suggests that pushing rates toward confiscation risks eroding the base and damaging entrepreneurship.",
        "source_4": "European Court of Human Rights, Guide on Article 1 of Protocol No. 1 (Protection of Property) and Article 14 (Prohibition of Discrimination), latest consolidated guidance — Affirms states’ wide tax-setting latitude but requires a “fair balance” and non-discrimination. A 100% inheritance tax applied only to people “born in the UK” would likely face serious Article 14 concerns (discrimination on grounds of birth/other status) and proportionality challenges under A1P1, raising legal feasibility issues.",
        "source_5": "YouGov, Inheritance tax remains Britain’s most unpopular tax (UK polling analysis, 2023) — Repeated polls show net opposition to inheritance tax and limited public support for raising it; a significant share favors reducing or abolishing it. Signals major political and social resistance to any substantial rate hike, let alone a universal 100% levy.",
        "source_6": "UK Office of Tax Simplification, Inheritance Tax Review: Second Report (2019) — Documents complexity, valuation difficulties, and distortions from reliefs (e.g., business and agricultural property) and lifetime gifts rules even at current rates. Highlights administrative and design challenges that would likely intensify under a 100% rate, risking greater avoidance, inequities, and enforcement burdens for HMRC."
    }
}