{
    "question": "Should military recruiting be allowed in schools?",
    "content": {
        "source_1": "20 U.S.C. § 7908 — Armed forces recruiters’ access to students and student recruiting information (U.S. Code). Federal law requires public schools receiving federal funds to provide military recruiters the same access to students as is provided to colleges and employers, and to share “directory information” unless parents/students opt out. This establishes a legal basis for allowing recruiting in schools. https://www.law.cornell.edu/uscode/text/20/7908",
        "source_2": "U.S. Department of Defense News, “DOD, Service Branches Continue to Face Recruiting Challenges” (Sept. 20, 2023). The Pentagon reports significant shortfalls in meeting enlistment goals and identifies expanded outreach—including in schools—as important to sustaining an all-volunteer force, tying school access to national security staffing needs. https://www.defense.gov/News/News-Stories/Article/Article/3528785/dod-service-branches-continue-to-face-recruiting-challenges/",
        "source_3": "U.S. Department of Veterans Affairs, “Post‑9/11 GI Bill (Chapter 33) Benefits.” The VA details substantial education benefits (tuition, housing allowance, books) and training opportunities available to service members, indicating that on-campus recruiting can inform students about pathways to college and careers they might not otherwise access. https://www.va.gov/education/about-gi-bill-benefits/post-9-11/",
        "source_4": "American Public Health Association, Policy Statement 20095: “Opposing Military Recruiting in Public Elementary & Secondary Schools” (2009). APHA argues that adolescents’ developmental vulnerabilities and recruiters’ high-pressure marketing make school-based recruitment a public health concern, recommending restrictions to protect youth. https://www.apha.org/policies-and-advocacy/public-health-policy-statements/policy-database/2014/07/08/09/28/opposing-military-recruiting-in-public-elementary-and-secondary-schools",
        "source_5": "UN Committee on the Rights of the Child, Concluding observations on the United States under the Optional Protocol on the involvement of children in armed conflict (CRC/C/OPAC/USA/CO/2, 2013). The Committee expresses concern about recruitment of minors (17-year-olds) and school-based practices (e.g., JROTC/recruiter access), urging the U.S. to review and limit such activities to better safeguard children’s rights. https://tbinternet.ohchr.org/_layouts/15/treatybodyexternal/Download.aspx?symbolno=CRC/C/OPAC/USA/CO/2&Lang=En",
        "source_6": "Milliken et al., “Longitudinal Assessment of Mental Health Problems Among Active and Reserve Component Soldiers Returning From Iraq,” JAMA (2007). This study found significant increases in PTSD and other mental health problems after deployment, highlighting the real risks of military service and informing arguments that schools should avoid facilitating recruitment into hazardous occupations for minors. https://jamanetwork.com/journals/jama/fullarticle/207515"
    }
}