{
    "question": "Is feminism still needed?",
    "content": {
        "source_1": "World Health Organization (2021) — Global prevalence estimates show that about 1 in 3 women worldwide have experienced physical and/or sexual violence in their lifetime, most often by an intimate partner, indicating persistent, widespread gendered harm that equality movements aim to address. (https://www.who.int/news/item/09-03-2021-devastatingly-pervasive-1-in-3-women-experience-violence)",
        "source_2": "World Bank, Women, Business and the Law (2023) — Only 14 countries provide women and men equal legal rights across the areas measured; the global average score is 77.1/100, signaling that in most economies women still face formal legal barriers. (https://wbl.worldbank.org/)",
        "source_3": "Inter-Parliamentary Union (2024) — Women hold about 26.9% of seats in national parliaments globally (lower/single chambers), underscoring continuing political underrepresentation of women. (https://data.ipu.org/women-ranking?month=1&year=2024)",
        "source_4": "PayScale Gender Pay Gap Report (2024) — In the U.S., the “controlled” gender pay gap (comparing men and women in the same job, with similar qualifications) is 99 cents on the dollar, suggesting most of the overall gap reflects differences in occupation, industry, and experience rather than unequal pay for equal work. (https://www.payscale.com/research-and-insights/gender-pay-gap/)",
        "source_5": "National Center for Education Statistics (U.S.) (2023) — Women earn a majority of college degrees; for example, they received about 58% of bachelor’s degrees in 2020–21, indicating that in some domains men are now the educationally disadvantaged group. (https://nces.ed.gov/programs/digest/d22/tables/dt22_318.10.asp)",
        "source_6": "Stoet & Geary (2018), Psychological Science — The “gender-equality paradox” study finds that more gender-equal countries often have larger female underrepresentation in STEM fields, implying that preferences and structural features (not only discrimination) shape outcomes, complicating claims about what further feminism should target. (https://doi.org/10.1177/0956797617741719)"
    }
}