{
    "question": "Should the growing of coca leaf be legalised?",
    "content": {
        "source_1": "International Narcotics Control Board (INCB) — Annual Reports and treaty commentary on the Single Convention on Narcotic Drugs (1961) — multiple years (e.g., 2012–2019). INCB notes that coca leaf is under international control; Articles 4, 26, and 49 of the Single Convention require limiting cultivation to medical/scientific purposes and originally called for abolishing non-medical uses (like coca chewing) within 25 years of 1961. Legalizing broad coca cultivation would conflict with the drug control treaties unless states obtain reservations/derogations (as Bolivia did in 2013 for traditional use within its territory).",
        "source_2": "United Nations General Assembly — United Nations Declaration on the Rights of Indigenous Peoples (UNDRIP), 2007. UNDRIP affirms Indigenous peoples’ rights to maintain, protect, and develop their cultural traditions and traditional medicines. Andean Indigenous groups view coca as a cultural and medicinal plant; recognizing these rights is cited by proponents as a basis for legalizing coca cultivation for traditional uses. (UNDRIP is a non-binding instrument but widely endorsed as a human-rights standard.)",
        "source_3": "United Nations Office on Drugs and Crime (UNODC) — Global Cocaine Report 2023; Colombia Coca Survey 2022. UNODC documents record-high coca cultivation (especially in Colombia) alongside record cocaine manufacture, showing a strong linkage between coca leaf supply and cocaine output. Opponents argue that legalizing coca growing risks expanding raw material supply and leakage into cocaine production, affecting global markets.",
        "source_4": "Dávalos, E. et al. — “Forests and drugs: Coca-driven deforestation in protected areas,” Proceedings of the National Academy of Sciences (PNAS), 2011. Spatial analyses associate coca cultivation with deforestation and biodiversity loss in Andean–Amazonian landscapes, including protected areas. Environmental critics warn legalization without stringent land-use safeguards could amplify forest clearing and ecological harm.",
        "source_5": "Washington Office on Latin America (WOLA) — analyses of Bolivia’s “cato” model of community coca control (e.g., reports 2016–2018). WOLA finds that allowing limited legal coca plots with community monitoring reduced violent conflict and human-rights abuses compared to forced eradication, while keeping cultivation closer to agreed limits. Proponents cite this as evidence that regulated legalization can outperform prohibition on security and governance outcomes.",
        "source_6": "Peru’s Defensoría del Pueblo and ENACO (state coca company) reports; UNODC Peru Coca Surveys (various years). Official reviews indicate the licit coca market (e.g., ENACO purchases for traditional/industrial uses) absorbs only a small fraction of Peru’s total coca leaf production, with substantial diversion to illicit cocaine processing. Skeptics argue this demonstrates that legal cultivation—without robust controls and limited demand—fails to prevent leakage into illegal markets."
    }
}