{
    "question": "Is community radio good for democracy?",
    "content": {
        "source_1": "Field study in rural Nepal on new community radio stations and civic participation (case-study interviews and before/after surveys). Evidence: after station launches, residents reported greater awareness of local government processes and higher attendance at ward meetings and public hearings, suggesting community radio can spur local democratic engagement.",
        "source_2": "Policy report on accountability call-in programs in the Philippines (monitoring of municipal affairs shows). Evidence: community radio phone-ins and town-hall broadcasts enabled citizens to question officials on-air, leading to concrete responses (e.g., repairs to local roads and public water points), indicating radio can strengthen vertical accountability.",
        "source_3": "Ethnographic research on elite capture of community stations in East Africa (governance and media ownership analysis). Evidence: station boards dominated by local political and business elites steered coverage and endorsed preferred candidates during election periods, undermining pluralism and suggesting community radio can be co-opted in ways harmful to democracy.",
        "source_4": "Audience measurement and media-use surveys in urban Brazil comparing community radio to social media. Evidence: younger and urban audiences overwhelmingly consume political information via WhatsApp/Instagram, with community radio reach small and effects on turnout or issue knowledge not detectable at city level, implying limited democratic impact where digital platforms dominate.",
        "source_5": "Media freedom and sustainability brief on community radio financing and regulation in Mexico. Evidence: reliance on precarious donor grants and restrictive licensing regimes pushed stations toward self-censorship and dependence on municipal advertising, weakening editorial independence and curbing watchdog roles essential to democratic oversight.",
        "source_6": "Inclusion-focused case studies of indigenous-language community radio in Guatemala. Evidence: programming in K’iche’ and Q’eqchi’ increased access to public service information, civic education, and participation by women and indigenous listeners who were underserved by national media, correlating with higher reported trust in local institutions and deliberative inclusion."
    }
}