{
    "question": "Should rich countries actively recruit medical personnel from poorer countries?",
    "content": {
        "source_1": "OECD (2019), “Recent Trends in International Migration of Doctors, Nurses and Medical Students” — OECD data show foreign-trained clinicians make up a substantial share of the workforce in many high‑income countries (roughly one-fifth of physicians on average, and as high as ~40% in places like Ireland and New Zealand), helping to alleviate acute staffing shortages and maintain patient access. This supports the argument that active recruitment can be an effective tool for rich countries facing immediate gaps.",
        "source_2": "World Health Organization (2010, updated guidance 2023), Global Code of Practice on the International Recruitment of Health Personnel and the WHO Health Workforce Support and Safeguards List (55 countries) — WHO discourages active recruitment from countries with critical health worker shortages (often below the 44.5 doctors, nurses and midwives per 10,000 population threshold needed for UHC). This opposes the claim by warning that recruiting from poorer countries can exacerbate life‑threatening service gaps.",
        "source_3": "GIZ (Germany) “Triple Win Programme” and Global Skills Partnerships model (as advocated by the Center for Global Development) — Bilateral, ethics‑based recruitment schemes (e.g., Germany’s recruitment of nurses from partner countries while investing in training and avoiding WHO‑listed shortage countries) aim for “triple wins” (for migrants, origin, and destination) via skills development, remittances, and safeguards. This offers a conditional pro‑recruitment perspective: active recruitment can be justified if structured to create net benefits for source countries.",
        "source_4": "Mills et al. (2011), BMJ, “The financial cost of doctors emigrating from sub‑Saharan Africa” — The study estimated that sub‑Saharan African governments lose billions of dollars in training investments when doctors emigrate, while destination countries save substantially by not bearing those education costs. This challenges the claim by highlighting how active recruitment can amount to a transfer of public resources from poor to rich countries.",
        "source_5": "United Nations, Universal Declaration of Human Rights (Article 13[2]); International Labour Organization, General Principles and Operational Guidelines for Fair Recruitment — Human rights and fair‑recruitment frameworks emphasize workers’ freedom to migrate and the need for transparent, non‑coercive recruitment. This perspective cautions against restricting recruitment and, by implication, supports policies that allow (and regulate) active recruitment to respect individual autonomy and labour rights.",
        "source_6": "UK House of Commons Health and Social Care Committee (2022), “Workforce: recruitment, training and retention in health and social care” — The Committee concluded that heavy reliance on international recruitment is not a sustainable long‑term strategy and reflects failures in domestic workforce planning and training. This perspective opposes the claim by arguing rich countries should prioritize building their own pipelines rather than actively recruiting from poorer nations."
    }
}