{
    "question": "Should sadomasochism be decriminalized?",
    "content": {
        "source_1": "Laskey, Jaggard and Brown v. United Kingdom, European Court of Human Rights (1997). The Court upheld the UK’s criminal convictions of consenting adults for sadomasochistic injuries, ruling that prosecuting such conduct did not violate the right to private life (Article 8) because states may restrict consensual harm to protect health and morals. Perspective: supports continued criminalization/limits on consent.",
        "source_2": "German Criminal Code §228 (Einwilligung). German law recognizes consent as a defense to bodily injury unless the act violates good morals, and courts/legal commentators generally treat consensual BDSM as lawful when it does not create a serious danger to life or cause grave injury. Perspective: shows a workable decriminalization model with safeguards.",
        "source_3": "World Health Organization, ICD-11 (2019), “Sexual health” chapter. Consensual sadomasochistic behaviors were removed from mental disorder classifications; only non-consensual/coercive paraphilic disorders remain pathologized. Perspective: health authority depathologization supports decriminalization of consensual BDSM.",
        "source_4": "Wismeijer, A. A. J., & van Assen, M. A. L. M. (2013). Psychological Characteristics of BDSM Practitioners. Journal of Sexual Medicine. The study found BDSM practitioners, as a group, showed equal or better mental health indicators (e.g., lower neuroticism, higher subjective well-being) compared to controls, undermining assumptions that consensual BDSM is inherently harmful. Perspective: empirical psychosocial evidence favoring decriminalization.",
        "source_5": "R v JA, 2011 SCC 28 (Supreme Court of Canada). The Court held that a person cannot give advance consent to sexual activity that occurs while they are unconscious, highlighting categorical limits on consent relevant to some BDSM scenarios. Perspective: supports maintaining criminal prohibitions or strict boundaries to protect against serious harm and exploitation.",
        "source_6": "National Coalition for Sexual Freedom, “Consent Counts” reports (policy analyses, 2016–2020). Documents arrests and prosecutions of consenting BDSM participants and argues that criminalization chills safety education and deters victims from reporting actual abuse or seeking medical care; recommends explicit legal recognition of consent standards for BDSM. Perspective: harm-reduction and civil liberties case for decriminalization."
    }
}