{
    "question": "Should anti-bribery laws on corporations be abolished?",
    "content": {
        "source_1": "U.S. Chamber Institute for Legal Reform — Restoring Balance: Proposed Amendments to the Foreign Corrupt Practices Act (2010). https://instituteforlegalreform.com/research/restoring-balance-proposed-amendments-to-the-foreign-corrupt-practices-act/ — Argues that corporate anti-bribery laws like the FCPA impose heavy, uncertain, and extraterritorial compliance burdens that disadvantage companies internationally; proposes major rollbacks (e.g., narrowing parent/subsidiary and successor liability, adding a compliance defense), a perspective often cited to justify abolition rather than reform.",
        "source_2": "The FCPA Blog — The Top Ten FCPA Cases of All Time (continuously updated). https://fcpablog.com/top-ten/ — Lists the largest FCPA enforcement actions, showing that many of the biggest penalties have been paid by non-U.S. firms (e.g., Siemens, Telia, Airbus, Odebrecht/Petrobras, Alstom). Critics use this pattern to argue the regime functions as expansive U.S. extraterritoriality that can distort competition and international comity—an argument sometimes advanced to support abolishing corporate anti-bribery laws.",
        "source_3": "OECD — Foreign Bribery Report: An Analysis of the Crime of Bribery of Foreign Public Officials (2014). https://www.oecd.org/corruption/oecd-foreign-bribery-report-9789264226616-en.htm — Based on enforcement data from OECD countries, finds foreign bribery is widespread, often involves senior management and intermediaries, and frequently targets public procurement; concludes bribery distorts fair competition and trade, supporting the case for robust corporate anti-bribery laws rather than abolition.",
        "source_4": "Fisman, Raymond and Svensson, Jakob — Are corruption and taxation really harmful to growth? Firm-level evidence (Journal of Development Economics, 2007). https://doi.org/10.1016/j.jdeveco.2006.12.003 — Using firm-level data from Uganda, shows that higher bribery payments are strongly associated with lower firm growth (with effects comparable to a tax on business), providing microeconomic evidence that bribery harms productivity and investment; this underpins arguments against abolishing anti-bribery laws.",
        "source_5": "U.S. Department of Justice and SEC — A Resource Guide to the U.S. Foreign Corrupt Practices Act, Second Edition (2020) and DOJ Safe Harbor Policy for Voluntary Self-Disclosures in M&A (2023). Guide: https://www.justice.gov/criminal-fraud/file/1292051/download Safe Harbor announcement: https://www.justice.gov/opa/speech/deputy-attorney-general-lisa-monaco-announces-new-safe-harbor-policy-voluntary-self — Provides detailed compliance expectations, declination factors, and recent safe-harbor incentives for self-disclosure, signaling that governments can calibrate enforcement to reduce burdens and encourage prevention—evidence for reforming, not abolishing, corporate anti-bribery regimes."
    }
}