{
    "question": "Should public transport be free?",
    "content": {
        "source_1": "Cats, Oded; Susilo, Yusak O.; Reimal, Triin (2017). The effects of fare-free public transport: Evidence from Tallinn, Estonia. Transport Policy. Findings from Tallinn’s citywide fare-free policy show ridership rose but car use did not fall meaningfully; much of the added transit use came from people who previously walked, suggesting limited congestion or emissions benefits. https://www.sciencedirect.com/science/article/pii/S0967070X17304106",
        "source_2": "City of Boston (2023). Fare-Free Bus Pilot Evaluation (Routes 23, 28, 29). Official evaluation of Boston’s multi-route fare-free pilot found higher ridership recovery than the system average, shorter dwell times (faster boarding), and improved access for low-income riders—indicating operational and equity gains from removing fares on targeted high-ridership corridors. https://www.boston.gov/transportation/fare-free-bus-pilot",
        "source_3": "American Public Transportation Association (2021). Public Transportation Fact Book. Pre-pandemic data show passenger fares covered a substantial share of U.S. transit operating costs (roughly one-quarter to one-third systemwide, higher on some rail modes). Eliminating fares at scale creates a recurring funding gap that must be replaced to avoid service cuts. https://www.apta.com/research-technical-resources/transit-statistics/fact-book/",
        "source_4": "Transit Cooperative Research Program (TCRP) Synthesis 101 (2013). Implementation and Outcomes of Fare-Free Transit Programs. A synthesis of agencies that tried fare-free policies finds large ridership gains—especially on smaller and university systems—but also reports challenges like overcrowding, increases in non-travel-related activity on vehicles, and higher operating costs to add service and manage behavior, often offsetting fare-collection savings. https://www.trb.org/Publications/Blurbs/169557.aspx",
        "source_5": "Euronews Next (2023). Luxembourg made public transport free — has it cut traffic and emissions? Three years after making all public transport free nationwide, Luxembourg still struggles with congestion, highlighting that fare abolition alone may not shift drivers without concurrent measures (e.g., service upgrades, parking/road pricing, land-use changes). https://www.euronews.com/next/2023/02/28/luxembourg-made-public-transport-free-has-it-worked",
        "source_6": "Wiener Linien (Vienna’s transit operator) — Facts & Figures; and policy reports on the €365 annual pass (2012–present). Vienna’s deep-discount annual pass (about €1/day, not fully free) led to a large increase in annual pass holders and sustained ridership growth, illustrating an alternative pricing strategy that boosts use and equity while retaining some fare revenue for operations. https://www.wienerlinien.at/web/wl-en/facts-figures"
    }
}