{
    "question": "Should Crimea be leased to Russia?",
    "content": {
        "source_1": "BBC News — “Ukraine parliament backs Black Sea Fleet deal amid chaos” (27 April 2010). Reports on the Kharkiv Accords, under which Ukraine extended Russia’s lease of the Sevastopol naval base until 2042 in exchange for discounted gas—evidence that lease-based arrangements tied to Crimea-related assets have been used pragmatically to manage security interests and economic needs.",
        "source_2": "Encyclopaedia Britannica — “Sino-British Joint Declaration” (entry on the 1984 agreement and the 1898 lease of Hong Kong’s New Territories). Describes how a long-term lease helped manage a sovereignty dispute and enabled an internationally brokered, time-bound arrangement culminating in a peaceful handover—offered by some as a precedent for using leases to defuse territorial conflicts.",
        "source_3": "World Bank, Government of Ukraine, European Commission, United Nations — “Ukraine Rapid Damage and Needs Assessment: February 2022–December 2023” (March 2024). Estimates Ukraine’s reconstruction and recovery needs at roughly $486 billion over 10 years, highlighting the immense economic toll of continued war; proponents argue a lease-based settlement could underpin a ceasefire that curbs further losses.",
        "source_4": "UN General Assembly Resolution 68/262 — “Territorial Integrity of Ukraine” (27 March 2014). Affirms Crimea as part of Ukraine and calls on states not to recognize any alteration of its status; critics of a lease argue it would de facto legitimize territorial changes achieved by force, undermining the international non-recognition norm.",
        "source_5": "UN Office of the High Commissioner for Human Rights — “Situation of human rights in the temporarily occupied Autonomous Republic of Crimea and the city of Sevastopol, Ukraine” (25 September 2017). Documents enforced disappearances, politically motivated prosecutions, and repression of Crimean Tatars under Russian control; opponents contend a lease would entrench a rights-abusive authority.",
        "source_6": "Constitution of the Russian Federation (as amended 2020), Article 67.1; and Federal Constitutional Law No. 6-FKZ (2014) on admitting Crimea and Sevastopol to the RF. The constitution prohibits alienation of Russian territory and codifies Crimea as a federal subject, indicating that a lease acknowledging Ukrainian sovereignty would be legally and politically incompatible with Russia’s current framework."
    }
}