{
    "question": "Should the United States continue its use of drone strikes abroad?",
    "content": {
        "source_1": "Johnston, Patrick B., and Anoop K. Sarbahi. “The Impact of U.S. Drone Strikes on Terrorism in Pakistan.” International Studies Quarterly, 2016. A statistical analysis of FATA districts finds that U.S. drone strikes were followed by significant short-term reductions in militant attacks and casualties in the affected areas, suggesting operational effectiveness of drones against insurgent networks.",
        "source_2": "The Bureau of Investigative Journalism (TBIJ). “Drone strikes in Pakistan, 2004–2018” (dataset and analysis). TBIJ’s compiled field reports estimate that U.S. drone strikes in Pakistan killed 2,515–4,026 people, including 424–969 civilians and 172–207 children, highlighting the risk of civilian harm and the difficulty of reliable target identification.",
        "source_3": "UN Special Rapporteur on extrajudicial, summary or arbitrary executions (Agnes Callamard). Report A/HRC/44/38, July 2020. Concludes that the January 2020 U.S. drone strike killing Iranian General Qassem Soleimani was unlawful under international law and stresses that cross-border targeted killings by drones outside active battlefields undermine state sovereignty and erode legal norms.",
        "source_4": "U.S. Department of Defense. “Civilian Harm Mitigation and Response Action Plan (CHMR-AP),” August 2022. DoD lays out institutional reforms—new procedures, training, data analysis, and after-action reviews—to reduce civilian harm and improve accountability in U.S. strikes, supporting the view that continued drone operations can be conducted with stronger safeguards and lower risks to U.S. personnel than ground raids.",
        "source_5": "Stanford Law School & NYU School of Law. “Living Under Drones: Death, Injury, and Trauma to Civilians from U.S. Drone Practices in Pakistan,” 2012. Field interviews document pervasive fear, psychological trauma, disruption of daily life, and “double-tap” strike patterns that deter rescue efforts—evidence often cited to argue drone campaigns generate blowback and anti-U.S. sentiment that can aid militant recruitment.",
        "source_6": "U.S. Department of Justice. “Lawfulness of a Lethal Operation Directed Against a U.S. Citizen Who Is a Senior Operational Leader of Al-Qa’ida or An Associated Force” (White Paper), 2013. Sets out the U.S. government’s legal rationale—under the 2001 AUMF and the inherent right of self-defense—for targeted lethal force abroad, arguing such strikes can be lawful when necessity, imminence, and proportionality criteria are met."
    }
}