{
    "question": "Should an international ban be placed on the export of nuclear reactor technology?",
    "content": {
        "source_1": "Fuhrmann, Matthew (2012). Atomic Assistance: How “Atoms for Peace” Programs Cause Nuclear Insecurity (Cornell University Press). Finding from cross-national data that states receiving civilian nuclear assistance are statistically more likely to initiate nuclear weapons programs, suggesting reactor technology transfers can raise proliferation risks that support arguments for a ban.",
        "source_2": "IPCC AR6, Working Group III (2022), Mitigation of Climate Change. Assesses nuclear power as a low lifecycle-emissions technology (comparable to wind) and includes nuclear expansion in many mitigation pathways; an export ban could impede decarbonization options for countries without indigenous nuclear supply chains.",
        "source_3": "U.S. Congressional Research Service (2021), “U.S. Nuclear Cooperation with Other Countries: A Primer” (RL34541). Explains how 123 Agreements, IAEA safeguards, the Additional Protocol, and Nuclear Suppliers Group guidelines create enforceable nonproliferation conditions (e.g., the UAE’s “gold standard” renunciation of enrichment/reprocessing), arguing targeted controls are a safer alternative to a blanket export ban.",
        "source_4": "World Nuclear Association (2023), “Emerging Nuclear Energy Countries.” Documents how first-time programs in Bangladesh (Rooppur), Egypt (El Dabaa), Turkey (Akkuyu), and others depend on foreign vendors, financing, and technology; a ban would likely stall newcomers’ entry into nuclear, affecting energy access, industrialization, and grid reliability goals.",
        "source_5": "IAEA (2020), Status and Trends in Spent Fuel and Radioactive Waste Management. Notes that long-term disposal solutions remain limited—Finland is the first to advance a deep geological repository, while most countries lack operational final repositories—supporting concerns that expanding reactor exports multiplies unresolved transboundary waste and stewardship burdens.",
        "source_6": "International Energy Agency (2022), Nuclear Power and Secure Energy Transitions. Highlights Russia’s dominant role in reactor exports and enrichment services, creating long-term fuel and service dependencies for recipient states; this geopolitical leverage risk is cited by proponents of restricting or banning reactor technology exports."
    }
}