{
    "question": "Should animals be used for scientific or commercial testing?",
    "content": {
        "source_1": "Corbett, K. S., et al. “Evaluation of the mRNA-1273 Vaccine against SARS-CoV-2 in Nonhuman Primates.” New England Journal of Medicine, 2020. Evidence: Preclinical studies in rhesus macaques demonstrated robust immune responses and protection from viral replication, supporting the decision to advance to human trials—an example of animal models informing vaccine development.",
        "source_2": "Perel, P., et al. “Comparison of treatment effects between animal experiments and clinical trials: systematic review.” BMJ, 2007. Evidence: Found frequent discrepancies between results in animal studies and human clinical outcomes across several disease areas, raising concerns about the translatability of animal data to humans.",
        "source_3": "World Health Organization. “Guidelines on nonclinical evaluation of vaccines.” WHO Technical Report Series, various editions (e.g., TRS 927 Annex 1; updates). Evidence: International regulatory guidance has traditionally required relevant animal studies to assess immunogenicity, toxicity, and dosing before first-in-human vaccine trials, reflecting a view that animal data are an important safety gate.",
        "source_4": "U.S. Congress. “FDA Modernization Act 2.0,” Public Law 117-328, Sec. 3209 (2022). Evidence: Amends the Food, Drug, and Cosmetic Act to allow nonclinical tests other than animal tests (e.g., cell-based assays, organ-on-chip, computational models) to support INDs, signaling regulatory acceptance of alternatives and challenging the necessity of animal testing in all cases.",
        "source_5": "U.S. Department of Agriculture, APHIS. “Annual Report Animal Usage by Fiscal Year (e.g., FY 2022).” Evidence: Reports roughly hundreds of thousands of AWA-covered animals used yearly in U.S. research and testing, while noting that mice, rats, and birds bred for research are not counted—highlighting both the ethical concern over scale and transparency limitations in animal-use statistics.",
        "source_6": "European Commission. “EU ban on animal testing for cosmetics (Regulation (EC) No 1223/2009; full marketing ban effective 2013).” Evidence: The EU prohibits animal testing for cosmetic products and the marketing of cosmetics tested on animals, embodying a regulatory and ethical stance that animal use for commercial testing (cosmetics) is unacceptable even if alternatives are imperfect."
    }
}