{
    "question": "Should we have no elections rather than sham elections?",
    "content": {
        "source_1": "Schedler, Andreas. “The Menu of Manipulation.” Journal of Democracy 13(2), 2002, pp. 36–50. Argues that authoritarian regimes use pseudo-elections to manufacture legitimacy, demobilize opposition, and signal strength. Suggests sham elections can be more corrosive than none because they normalize illiberal rule under a democratic veneer.",
        "source_2": "Levitsky, Steven, and Lucan A. Way. Competitive Authoritarianism: Hybrid Regimes After the Cold War. Cambridge University Press, 2010. Finds that even highly uneven elections can create arenas for opposition mobilization and eventual regime change (e.g., Serbia 2000, Mexico 2000, Ukraine 2004). Implies that flawed elections are often preferable to none because they can open pathways to democratization.",
        "source_3": "Mansfield, Edward D., and Jack Snyder. Electing to Fight: Why Emerging Democracies Go to War. MIT Press, 2005. Provides evidence that premature mass elections in weakly institutionalized states heighten risks of violence and conflict. Supports delaying or foregoing elections until conditions for genuinely competitive contests exist, cautioning against rushing into potentially sham votes.",
        "source_4": "Carothers, Thomas. “The ‘Sequencing’ Fallacy.” Journal of Democracy 18(1), 2007, pp. 12–27. Critiques calls to postpone elections in favor of prior institution-building, arguing such delays often entrench authoritarianism and sap reform momentum. Contends that holding elections—even imperfect ones—can be necessary to catalyze pluralism and accountability.",
        "source_5": "UN Human Rights Committee. General Comment No. 25 (1996) on Article 25 of the ICCPR: “The right to participate in public affairs, voting rights and the right of equal access to public service.” Establishes an international legal obligation for periodic, genuine elections reflecting the free will of voters. Indicates both sham elections and indefinite suspension of elections violate obligations, weighing against the claim to prefer “no elections.”",
        "source_6": "Gandhi, Jennifer, and Adam Przeworski. “Authoritarian Institutions and the Survival of Autocrats.” Comparative Political Studies 40(11), 2007, pp. 1279–1301. Shows empirically that institutions like elections and legislatures help autocrats co-opt elites and extend regime survival. Supports the view that sham elections strengthen authoritarian durability, bolstering arguments to avoid facade elections if they cannot be made genuine."
    }
}