{
    "question": "Does the United Nations have a responsibility to protect?",
    "content": {
        "source_1": "United Nations General Assembly, 2005 World Summit Outcome Document (A/RES/60/1), paras. 138–139, 24 October 2005. Evidence: Member states agreed that “the international community, through the United Nations, also has the responsibility to use appropriate diplomatic, humanitarian and other peaceful means… to help to protect populations” and, if a state is “manifestly failing,” they are “prepared to take collective action… through the Security Council.” Supports the claim that the UN framework embodies a responsibility to protect.",
        "source_2": "UN Security Council Resolution 1973 on Libya (S/RES/1973), 17 March 2011. Evidence: Authorized Member States to take “all necessary measures… to protect civilians” in Libya, while recalling “the responsibility of the Libyan authorities to protect the Libyan population.” Demonstrates the UN operationalizing R2P via Chapter VII action.",
        "source_3": "UN General Assembly Resolution 63/308, “The responsibility to protect,” 14 September 2009. Evidence: The Assembly “takes note of the report of the Secretary-General… and the subsequent interactive dialogue” and “decides to continue its consideration” of R2P. Indicates R2P’s status as a political commitment under ongoing consideration, not a binding legal duty of the UN as such—challenging the claim’s implication of a strict legal responsibility.",
        "source_4": "Brazil, “Responsibility while Protecting: elements for the development and promotion of a concept,” circulated to the UN as A/66/551–S/2011/701, 11 November 2011. Evidence: Warns that “the use of force must produce as little violence and instability as possible and under no circumstances can it generate more harm than it was authorized to prevent,” urging criteria, monitoring, and accountability for R2P mandates. Argues the UN’s protective role is conditional and constrained to avoid misuse, complicating a blanket “responsibility to protect.”",
        "source_5": "UN Dag Hammarskjöld Library, “Security Council — Veto List,” entries for draft resolutions on Syria (e.g., S/2011/612 of 4 Oct 2011; S/2012/77 of 4 Feb 2012). Evidence: Multiple Syria drafts were vetoed by permanent members, blocking robust collective action. Shows that, despite R2P language, the UN often cannot act to protect due to Security Council paralysis—undermining the claim in practice.",
        "source_6": "UN Secretary-General, “Implementing the Responsibility to Protect” (A/63/677), 12 January 2009. Evidence: Clarifies the three pillars and that “the primary responsibility for protecting its populations lies with the State itself,” with the UN’s role being supportive and, if necessary, collective action through the Council. Nuances the claim by placing responsibility first on states, not the UN institution per se."
    }
}