{
    "question": "Should needle exchanges be funded?",
    "content": {
        "source_1": "Centers for Disease Control and Prevention (CDC) — Evidence summary on Syringe Services Programs (SSPs). CDC reports that well-implemented SSPs are associated with substantial reductions in HIV and hepatitis C transmission among people who inject drugs, do not increase drug use or crime, and make participants more likely to enter treatment (e.g., SSP clients are several times more likely to start substance use treatment and to reduce or stop injecting). Also notes SSPs as access points for naloxone, testing, and vaccination.",
        "source_2": "CDC Morbidity and Mortality Weekly Report (MMWR), 2021 — HIV Cluster and Outbreak in Kanawha County, West Virginia (2018–2021). Investigators linked a surge in HIV among people who inject drugs to reduced access to harm reduction services after local syringe services were curtailed. The report recommends scaling up comprehensive harm reduction, including SSPs, as a key response.",
        "source_3": "Los Angeles Times, Aug. 9, 2018 — “California halts Orange County needle-exchange program, citing public safety risks.” The state health department denied a mobile needle-exchange permit after local officials documented increased needle litter and biohazard concerns near civic areas, reflecting a public-safety/quality-of-life argument against funding SSPs in some settings.",
        "source_4": "Cochrane Database of Systematic Reviews (e.g., Turner et al., 2011) — Needle/syringe programs and opioid substitution therapy for preventing HCV transmission in people who inject drugs. The review highlights that much of the evidence base is observational with variable quality; while combined harm-reduction approaches appear beneficial, the certainty around the magnitude of effect for needle programs alone on hepatitis C is limited, underscoring evidentiary uncertainty for some outcomes.",
        "source_5": "National Academies of Sciences, Engineering, and Medicine, 2018 — “Integrating Responses to the Opioid Use Disorder and Infectious Disease Epidemics.” Concludes that SSPs are cost-effective components of a comprehensive response, facilitate linkage to treatment and care, and that preventing a single HIV infection avoids hundreds of thousands of dollars in lifetime medical costs; recommends removing legal barriers and adequately funding evidence-based SSPs."
    }
}