{
    "question": "Is working from home better for companies than maintaining an office?",
    "content": {
        "source_1": "Bloom, Liang, Roberts, and Ying (Quarterly Journal of Economics, 2015) — Randomized WFH experiment at Ctrip found a 13% productivity increase and 50% lower attrition among home-based call-center employees; the firm also saved on office costs. When WFH was later offered firmwide, performance gains rose as less-suited workers self-selected back to the office, suggesting company-level benefits from remote work.",
        "source_2": "Yang, Holtz, Jaffe et al. (Nature Human Behaviour, 2021) — Large-scale analysis at Microsoft showed remote work made collaboration networks more siloed and static, reduced synchronous communication, and impeded information flow across teams. Authors warn this may hurt long-run innovation and knowledge sharing, implying drawbacks for companies that go fully remote.",
        "source_3": "Global Workplace Analytics (Cost-Benefit Analysis Brief, 2020/2023 updates) — Estimates employers can save roughly $11,000 per employee per year for half-time remote arrangements via reduced real estate, lower absenteeism/turnover, and productivity gains. Presents a cost-based case that WFH materially improves a company’s bottom line.",
        "source_4": "Meta (Internal analysis summarized by Mark Zuckerberg, 2023) — Company-wide performance review data indicated engineers, especially early-career hires, performed better on average with regular in-person time (e.g., at least three days a week). Used to justify a more office-centric policy for roles where apprenticeship and rapid feedback matter, challenging the “WFH is better” claim for such work.",
        "source_5": "LinkedIn (Global job market data, 2022) — Remote roles constituted a minority of postings but attracted a disproportionate share of applications (e.g., ~14% of postings drew ~50%+ of applications at peak), indicating companies offering remote options gain a recruiting advantage and access to broader, often lower-cost, talent pools.",
        "source_6": "Bloom, Han, and Liang (Trip.com hybrid RCT, working paper 2023/2024) — Randomized hybrid schedule (two days WFH per week) produced no measurable decline in performance compared with full office schedules, while enabling flexibility. Suggests a middle ground where companies retain some office benefits without losing output, complicating the claim that fully working from home is categorically better than maintaining an office."
    }
}