{
    "question": "Should the EU return power to national governments?",
    "content": {
        "source_1": "European Commission, “Report of the Task Force on Subsidiarity, Proportionality and ‘Doing Less More Efficiently’” (10 July 2018). The Task Force concluded the Union should focus only where there is clear EU added value and recommended strengthened subsidiarity tools (e.g., a “subsidiarity grid”) to keep decisions closer to citizens. This supports the view that some competences should shift back to national or regional levels.",
        "source_2": "European Commission, “The Single Market at 30” (COM(2023) 162 final, 16 March 2023). The Commission quantifies large growth and productivity gains from EU-level harmonization and warns that national fragmentation and divergent rules would impose significant economic costs. This argues against returning powers, as deeper integration yields measurable benefits that unilateral national policies would erode.",
        "source_3": "Court of Justice of the European Union, Judgments in Cases C‑156/21 and C‑157/21 (Hungary and Poland v Parliament and Council), 16 February 2022. The Court upheld the EU’s rule-of-law conditionality mechanism for protecting the EU budget, affirming the legality of EU-level tools to address systemic breaches in member states. This supports retaining or strengthening EU powers to enforce common standards that national authorities may not police effectively.",
        "source_4": "European Court of Auditors, Special Report on the EU’s emergency relocation and return schemes during the 2015 migration crisis (2019). The ECA found that centrally designed relocation targets were met only in part and implementation was hampered by design flaws and member-state non-compliance, leading to limited results. This is used by proponents of devolution to argue EU central schemes can be ineffective and that greater national control or flexibility may work better.",
        "source_5": "Joseph E. Stiglitz, “The Euro and Its Threat to the Future of Europe” (W.W. Norton, 2016). Stiglitz argues the euro’s institutional design removed key national policy levers (exchange rate, monetary and fiscal flexibility), contributing to pro‑cyclical austerity and divergence; he proposes either deep fiscal union or restoring more national economic sovereignty. This supports returning powers to national governments in macroeconomic policy absent full federalization.",
        "source_6": "European Commission, “Standard Eurobarometer 99 — Spring 2023” (2023). Survey results show that, in most member states, trust in the EU exceeds trust in national governments, and citizens often favor EU action on cross-border issues (e.g., climate, security, digital). This undercuts the claim by suggesting democratic and public‑confidence grounds for EU‑level decision‑making rather than repatriation of powers."
    }
}