{
    "question": "Are polls accurate predictors of election results?",
    "content": {
        "source_1": "Jennings, W., & Wlezien, C. (2018). Election polling errors across time and space. Nature Human Behaviour. https://www.nature.com/articles/s41562-018-0255-0 - Meta-analysis of 30,000+ polls from 351 elections (1942–2017) finds average absolute polling error is small (on the order of a couple of percentage points) and has not systematically worsened over time. Suggests that, in aggregate and near Election Day, polls are generally reasonably accurate predictors.",
        "source_2": "American Association for Public Opinion Research (AAPOR) Task Force. (2021). An Evaluation of 2020 General Election Polls in the U.S. https://www.aapor.org/Education-Resources/Reports/An-Evaluation-of-2020-General-Election-Polls.aspx - Concludes 2020 polls had the largest systematic error in four decades, overstating Democratic support by about 4 points nationally and in key states, likely due to differential nonresponse. Indicates that polls can fail as predictors under certain conditions.",
        "source_3": "Shirani-Mehr, H., Rothschild, D., Goel, S., & Gelman, A. (2018). Disentangling bias and variance in election polls. Journal of the American Statistical Association. Preprint: https://arxiv.org/abs/1703.06252 - Shows that individual polls are noisy and subject to “house effects,” but averaging polls across organizations and time materially reduces error. Argues that poll aggregates (rather than single polls) are effective predictors, especially close to elections.",
        "source_4": "YouGov (2017). How our 2017 general election model worked. https://yougov.co.uk/topics/politics/articles-reports/2017/06/09/how-our-2017-general-election-model-worked - YouGov’s MRP-based model, built on large-sample polling, correctly anticipated a hung parliament in the UK 2017 general election when many traditional polls suggested a Conservative majority. Evidence that methodological innovations in polling can yield highly accurate predictions.",
        "source_5": "British Polling Council & Market Research Society (Sturgis Inquiry). (2016). Report of the Inquiry into the 2015 British general election opinion polls. https://www.britishpollingcouncil.org/2015-general-election-opinion-polls-inquiry/ - Finds 2015 UK pre-election polls systematically understated Conservative support due to unrepresentative samples rather than late swings. Demonstrates that structural sampling issues can make polls inaccurate predictors.",
        "source_6": "Pew Research Center. (2019). What low response rates mean for telephone surveys. https://www.pewresearch.org/methods/2019/01/30/what-low-response-rates-mean-for-telephone-surveys/ - Documents very low survey response rates and explains how nonresponse bias can threaten representativeness even after weighting. Highlights growing structural challenges that can reduce polls’ predictive accuracy, particularly when turnout and engagement differ across groups."
    }
}