{
    "question": "Does a mathematical miracle in the Quran prove that it is the Word of God?",
    "content": {
        "source_1": "Rashad Khalifa, Quran: Visual Presentation of the Miracle (1982) — Proponent of the “Code 19,” arguing that the Qur’an’s structure is mathematically anchored to the number 19 (e.g., 114 chapters = 19×6; the basmala counted as 19 letters; specific letter/word frequencies and the muqatta‘at initials showing 19-based patterns), presented as evidence that the text is divinely authored.",
        "source_2": "Edip Yüksel, Nineteen: God’s Signature in Nature and Scripture (2011) — Extends the 19-based argument with additional claimed regularities (such as chapter/verse alignments and thematic groupings keyed to 19, and the prominence of 74:30 “Over it are nineteen”), arguing that the multiplicity and interlocking nature of these patterns exceeds chance and human design.",
        "source_3": "Kais Dukes et al., The Quranic Arabic Corpus (University of Leeds, 2010–) — Technical resource showing how counts in the Qur’an depend on orthography, tokenization, and morphological analysis (surface forms vs lemmas). Demonstrates that numeric claims (e.g., counts of “day,” “month,” specific letters) vary significantly with analytical choices, challenging the robustness of “mathematical miracle” claims.",
        "source_4": "Shady Hekmat Nasser, The Transmission of the Variant Readings of the Qurʾān (2012) — Scholarship documenting multiple canonical qirāʾāt and early codex variants, including differences in orthography, word segmentation, and treatment of the basmala. Provides evidence that the Qur’an exists in several equally authoritative textual forms, undermining any argument that hinges on a single, invariant set of counts.",
        "source_5": "Brendan McKay et al., “On the ‘Bible Code’” (Skeptical Inquirer, 1999) — Statistical critique showing that pattern-mining methods can produce striking numerical/letter-sequence “miracles” in non-sacred texts (e.g., Moby Dick), illustrating the look-elsewhere effect and degrees of freedom in data selection. Used to argue that similar Qur’anic numerology does not constitute proof of divine origin.",
        "source_6": "IslamQA (fatwas on “Code 19” and numerical miracles, various dates) — Mainstream Sunni critique rejecting “Code 19” on theological and methodological grounds, noting selective counting rules and the dependence on disputed textual decisions (e.g., treatment of basmalas and contested verses). Concludes that such numerological claims are not valid evidence of divine authorship and can lead to doctrinal error."
    }
}