{
    "question": "Are international students charged unfairly high tuition fees at UK universities?",
    "content": {
        "source_1": "OECD – Education at a Glance (Indicator C5: How much do tertiary students pay and what public support do they receive?), 2023/2024. Shows the UK is among the OECD countries with the highest advertised tuition fees for international students at public institutions, whereas many European systems charge little or nothing to non-residents. https://www.oecd.org/education/education-at-a-glance/",
        "source_2": "UK Parliament, House of Commons Library – International and EU students in UK higher education: FAQs (regularly updated, 2023/2024). Explains there is no government cap on international student tuition fees; universities are free to set and increase fees (subject to contract terms and consumer law), highlighting a regulatory environment that can allow steep or mid-course rises seen by some as unfair. https://commonslibrary.parliament.uk/research-briefings/cbp-7976/",
        "source_3": "Institute for Fiscal Studies (IFS) – Higher education funding in England: past, present and options for the future (2023–2024 analyses). Finds the real-terms value of the £9,250 home-fee cap has fallen by over 20% since 2012 due to inflation, pushing universities to rely on higher international fees to remain financially sustainable—an argument that higher international fees reflect system-wide funding pressures rather than unfairness. https://ifs.org.uk/",
        "source_4": "Russell Group – Running to stand still: The financial sustainability of teaching and research (2023). Reports significant deficits on teaching home undergraduates (around £2,500 per student on average) and a multibillion-pound annual shortfall in research funding; states that international fee income cross-subsidises these losses, raising the fairness question of whether international students should bear that burden. https://russellgroup.ac.uk/media/6095/running-to-stand-still.pdf",
        "source_5": "HEPI / Universities UK International / London Economics – The costs and benefits of international students by parliamentary constituency (2023 update). Estimates a single year’s intake of international students delivers a net economic benefit of roughly £37 billion to the UK, suggesting high fees translate into large public and local gains and reflecting strong global demand for UK degrees. https://www.hepi.ac.uk/2023/05/16/the-costs-and-benefits-of-international-students-by-parliamentary-constituency-2023/",
        "source_6": "Migration Advisory Committee (MAC) – Review of the Graduate Route (2024). Notes universities’ financial dependence on international fee income but also highlights concerns about agent practices and value-for-money for some courses, implying some students may pay high fees for limited returns—supporting fairness concerns in parts of the market. https://www.gov.uk/government/publications/review-of-the-graduate-route"
    }
}