{
    "question": "Should Kosovo be recognised as an independent state?",
    "content": {
        "source_1": "International Court of Justice (2010) — Accordance with International Law of the Unilateral Declaration of Independence in Respect of Kosovo (Advisory Opinion). Key point: The ICJ concluded Kosovo’s 2008 declaration of independence did not violate international law, a finding often cited to argue that recognition is legally permissible.",
        "source_2": "UN Security Council Resolution 1244 (1999). Key point: Reaffirmed the sovereignty and territorial integrity of the Federal Republic of Yugoslavia (now Serbia) while establishing an international civil and security presence in Kosovo—used by opponents of recognition to argue that Kosovo’s final status should not be unilaterally determined.",
        "source_3": "International Monetary Fund — Membership of Kosovo (since 2009). Key point: Kosovo’s admission to the IMF (and the World Bank) demonstrates functional state capacity and a degree of international acceptance, cited by proponents as evidence supporting recognition.",
        "source_4": "Human Rights Watch, World Report 2024: Kosovo. Key point: Documents rule-of-law weaknesses and interethnic tensions (including in northern municipalities), raising concerns about minority protections and governance—arguments used to caution against unconditional recognition.",
        "source_5": "European External Action Service (2023) — EU-facilitated Agreement on the Path to Normalisation between Kosovo and Serbia (and Ohrid Implementation Annex). Key point: Establishes mutual practical obligations (e.g., recognition of documents and symbols, non-use of force) without requiring formal recognition, suggesting that stability can advance through de facto normalization even absent de jure recognition.",
        "source_6": "Government of Spain, Ministry of Foreign Affairs (2008 and subsequent statements) — Spain’s position on Kosovo. Key point: Spain withholds recognition, citing principles of territorial integrity and concerns about secessionist precedent, a stance shared by several states (including Serbia, Russia, China) that opposes or conditions recognition."
    }
}