{
    "question": "Should smoking in public spaces be banned?",
    "content": {
        "source_1": "World Health Organization — Tobacco Fact Sheet (2024): WHO estimates that more than 1.3 million non-smokers die annually from secondhand smoke and recommends comprehensive smoke-free policies in public places to protect bystanders, citing there is no safe level of exposure. Perspective: Supports public smoking bans to prevent involuntary exposure.",
        "source_2": "Institute of Medicine (National Academies) — “Secondhand Smoke Exposure and Cardiovascular Effects” (2009): Reviewing multiple jurisdictions, the IOM concluded that smoke-free laws are followed by rapid, measurable declines in heart-attack hospitalizations, consistent with cardiovascular harms from even brief secondhand smoke exposure. Perspective: Empirical health-outcome evidence in favor of bans, especially indoors.",
        "source_3": "Klepeis, Ott, and Switzer — Outdoor secondhand smoke measurements (2007, Journal of the Air & Waste Management Association): Field and modeling data show very high particulate concentrations within about 0.5–2 meters of a lit cigarette outdoors, but levels drop sharply with distance and wind; semi-enclosed patios can retain higher concentrations. Perspective: Suggests targeted or proximity-based restrictions may be sufficient outdoors, questioning blanket outdoor bans.",
        "source_4": "U.S. Centers for Disease Control and Prevention — Economic analyses and summaries of smoke-free laws (various reports/fact sheets): Systematic reviews find that comprehensive smoke-free policies generally have no adverse effect on restaurant and bar revenues or employment, and sometimes correlate with neutral-to-positive economic outcomes. Perspective: Counters the claim that bans harm local business economies.",
        "source_5": "Stuber, Galea, and Link — “Smoking and the emergence of a stigmatized social status” (2008, Social Science & Medicine): Documents rising stigma toward people who smoke and discusses potential social and equity consequences of denormalization strategies. Perspective: Warns that punitive or sweeping public bans can exacerbate stigma and disproportionately impact lower-income populations, urging supportive, non-punitive approaches.",
        "source_6": "Hospitality industry trade groups (e.g., British Beer & Pub Association; industry submissions post-2007 UK ban): Attribute pub closures, revenue declines, and compliance costs in part to smoking bans, arguing for exemptions, ventilated rooms, or designated areas to preserve customer choice. Perspective: Opposes blanket bans on economic and customer-freedom grounds, advocating more flexible policies."
    }
}