{
    "question": "Is India’s ban on The Satanic Verses justified?",
    "content": {
        "source_1": "India Bars Import of Book by Rushdie (The New York Times, Oct 8, 1988). Reports the Government of India’s decision to prohibit import of The Satanic Verses under the Customs Act, citing risks to public order and communal harmony—evidence that the ban was framed as a preventive public-order measure. https://www.nytimes.com/1988/10/08/world/india-bars-import-of-book-by-rushdie.html",
        "source_2": "Ramji Lal Modi v. State of Uttar Pradesh, 1957 SCR 860 (Supreme Court of India). The Court upheld IPC Section 295A as a “reasonable restriction” on free speech for deliberate and malicious insults to religion, indicating a constitutional basis India could invoke to justify restricting works perceived to outrage religious feelings. https://indiankanoon.org/doc/1285105/",
        "source_3": "Shreya Singhal v. Union of India, (2015) 5 SCC 1 (Supreme Court of India). The Court held that speech can be restricted only when it amounts to incitement to violence or creates a clear and present danger; mere offense or annoyance is insufficient—an argument that an outright ban on a novel for hurting sentiments is constitutionally disproportionate. https://indiankanoon.org/doc/110813550/",
        "source_4": "UN Human Rights Committee, General Comment No. 34 on Article 19 (2011), CCPR/C/GC/34. States that “blasphemy” laws are generally incompatible with ICCPR obligations unless they meet the strict test of incitement under Article 20(2), suggesting bans like India’s are difficult to justify under international free-expression norms. https://undocs.org/CCPR/C/GC/34",
        "source_5": "The Satanic Verses: The controversy (Encyclopaedia Britannica). Documents serious real-world violence linked to the controversy—including the murder of the Japanese translator and attacks on publishers—supporting the rationale that authorities could foresee grave risks to public order and safety. https://www.britannica.com/topic/The-Satanic-Verses-novel-by-Rushdie/The-controversy",
        "source_6": "Markandey Katju, Lift the ban on The Satanic Verses (The Indian Express, Jan 2012). A former Supreme Court judge argues the ban is unconstitutional, misapplies IPC 295A (which requires deliberate and malicious intent), and capitulates to a “heckler’s veto,” urging its withdrawal. https://indianexpress.com/article/opinion/columns/lift-the-ban-on-the-satanic-verses/"
    }
}