{
    "question": "Should a Christian church allow the ordination of gay and lesbian priests?",
    "content": {
        "source_1": "The Episcopal Church (USA) — “LGBTQ+ Welcome & Inclusion” (EpiscopalChurch.org). The church explicitly states LGBTQ people may be ordained; it has consecrated openly gay and lesbian bishops (e.g., Gene Robinson in 2003; Mary Glasspool in 2010), evidencing a policy of allowing ordination of gay and lesbian priests.",
        "source_2": "Congregation for Catholic Education (Vatican) — Instruction Concerning the Criteria for the Discernment of Vocations Regarding Persons with Homosexual Tendencies (2005; reaffirmed in the 2016 Ratio Fundamentalis). States the Church “cannot admit to the seminary or to holy orders those who practice homosexuality, present deep-seated homosexual tendencies, or support the so‑called ‘gay culture,’” evidencing a ban in the Roman Catholic Church.",
        "source_3": "Church of England — House of Bishops Pastoral Guidance on Same Sex Marriage (February 2014). Affirms that gay and lesbian people may be ordained but requires celibacy for clergy in same-sex relationships and deems entering a same-sex marriage “incompatible” with holy orders, showing a conditional/limited acceptance.",
        "source_4": "Church of Sweden — Official communications on marriage and ordination (Svenska kyrkan). Following the 2009 decision to perform same-sex marriages, openly gay and lesbian people serve as priests; the church affirms equal access to ordination irrespective of sexual orientation, evidencing full acceptance.",
        "source_5": "Orthodox Church in America — Synodal Affirmations on Marriage, Family, Sexuality, and the Sanctity of Life (1992; reaffirmed subsequently). Declares homosexual acts sinful and subjects clergy engaging in such acts to canonical penalties, including deposition, evidencing that Orthodox churches do not ordain or retain openly gay/lesbian priests.",
        "source_6": "Anglican Church in North America (ACNA) — College of Bishops Pastoral Statement on Sexuality and Identity (2019). States that homosexual behavior is incompatible with Scripture and that clergy must conform to the church’s traditional sexual ethics, indicating that ACNA does not permit ordination of non‑celibate gay or lesbian candidates."
    }
}