{
    "question": "Was the War in Iraq worth the cost?",
    "content": {
        "source_1": "Human Rights Watch, “Genocide in Iraq: The Anfal Campaign Against the Kurds” (1993). Documents 50,000–100,000 Kurdish civilians killed and the regime’s chemical attacks under Saddam Hussein; proponents argue the 2003 war was justified by ending a regime responsible for mass atrocities and systemic repression.",
        "source_2": "Brown University, Costs of War Project, “U.S. Budgetary Costs and Human Toll of the Post‑9/11 Wars: Iraq (OIF/OIR)” (updated 2021–2023). Estimates more than $2 trillion in U.S. obligations tied to Iraq and related operations, over 4,400 U.S. military fatalities, and hundreds of thousands of Iraqi civilian deaths—evidence used to argue the war’s costs outweighed its benefits.",
        "source_3": "The Iraq Inquiry (Chilcot Report), UK (2016). Concludes the UK chose to join the invasion before peaceful options were exhausted, intelligence on WMD was presented with unwarranted certainty, and post‑war planning was inadequate—undercutting claims that the intervention’s rationale and outcomes justified the costs.",
        "source_4": "Brookings Institution, “Iraq Index: Tracking Variables of Reconstruction & Security in Post‑Saddam Iraq” (e.g., 2007–2010 updates). Shows sharp declines in sectarian violence after the 2007 surge and the Sunni Awakening, alongside milestones like the 2008–2010 elections and the U.S.–Iraq Status of Forces Agreement—evidence cited to argue the war enabled improved security and a nascent democratic process.",
        "source_5": "U.S. National Intelligence Estimate, “Trends in Global Terrorism: Implications for the United States” (Key Judgments declassified, Sept. 2006). Assesses that the Iraq conflict became a “cause célèbre” for jihadists, boosting recruitment and radicalization—used to argue the war undermined U.S. security and thus was not worth the cost.",
        "source_6": "U.S. Energy Information Administration, “Country Analysis Brief: Iraq” (e.g., 2019/2022). Reports that Iraq’s crude oil production surpassed pre‑2003 levels, exceeding 4 million barrels per day by the mid‑2010s and hitting record highs by 2018–2019, providing the majority of state revenues—evidence used to claim the war ultimately facilitated economic recovery and global energy supply stability."
    }
}