{
    "question": "Should we support the use of truth and reconciliation commissions?",
    "content": {
        "source_1": "Priscilla B. Hayner, “Unspeakable Truths: Transitional Justice and the Challenge of Truth Commissions” (2nd ed., 2010) — A comparative survey of dozens of commissions finds that well-designed TRCs can acknowledge victims, establish an official record, and catalyze reforms and reparations, especially where prosecutions are initially infeasible.",
        "source_2": "Tricia D. Olsen, Leigh A. Payne, and Andrew G. Reiter, “Transitional Justice in Balance: Comparing Processes, Weighing Efficacy” (2010) — Cross-national quantitative analysis (1970–2007) shows that countries using combinations that include truth commissions and trials tend to experience improved human rights and democratization compared to doing nothing, supporting TRCs as part of a broader accountability package.",
        "source_3": "Argentina’s National Commission on the Disappearance of Persons (CONADEP), “Nunca Más” report (1984) — Documented thousands of forced disappearances; its findings and archives were later used when amnesty laws were overturned in the 2000s to prosecute perpetrators, indicating TRCs can lay groundwork for delayed accountability.",
        "source_4": "Mahmood Mamdani, “Amnesty or Impunity? A Preliminary Critique of the Report of the Truth and Reconciliation Commission of South Africa” (2002) — Argues the South African TRC traded justice for truth, individualized wrongdoing while obscuring structural violence, and entrenched impunity via amnesty, cautioning against blanket support for TRCs that sideline prosecutions.",
        "source_5": "International Center for Transitional Justice (ICTJ) analysis of Liberia’s Truth and Reconciliation Commission (post-2009) — Finds that core recommendations (prosecutions, lustration) were largely unimplemented and some alleged perpetrators remained in public office, illustrating how TRCs can prove toothless without political will and institutional follow-through.",
        "source_6": "Karen Brounéus, “Truth-Telling as Talking Cure? Insecurity and Retraumatization in the Rwandan Gacaca Courts” (2010) — Empirical research shows participation in truth-telling forums correlated with higher PTSD and depression among survivors, highlighting potential psychological harms when truth processes are not designed with robust survivor protections."
    }
}