{
    "question": "Would Hillary Clinton make a better president for America?",
    "content": {
        "source_1": "New York Times Editorial Board (Sept. 24, 2016) — “Hillary Clinton for President.” The editorial argues Clinton’s deep government experience and policy fluency make her exceptionally prepared for the presidency compared with her opponent. https://www.nytimes.com/2016/09/25/opinion/sunday/hillary-clinton-for-president.html",
        "source_2": "Moody’s Analytics (Zandi et al., June 27, 2016) — “The Macroeconomic Consequences of Secretary Clinton’s Economic Policies.” A macroeconomic model projects Clinton’s proposals would modestly boost job growth and GDP relative to baseline, and outperform projections for her opponent’s plan on employment and growth. https://www.economy.com/mark-zandi/documents/2016-06-27-The-Macroeconomic-Consequences-of-Secretary-Clintons-Economic-Policies.pdf",
        "source_3": "Committee for a Responsible Federal Budget (Sept.–Oct. 2016 updates) — “Promises and Price Tags: A Fiscal Guide to the 2016 Election.” Independent budget scoring estimated Clinton’s agenda would add far less to federal debt over 10 years than her opponent’s, suggesting comparatively greater fiscal restraint. https://www.crfb.org/papers/promises-and-price-tags-fiscal-guide-2016-election",
        "source_4": "FBI (July 5, 2016) — Statement by Director James B. Comey on the investigation of Clinton’s use of a private email server. The FBI found Clinton and her staff were “extremely careless” in handling classified information, raising concerns about judgment and compliance. https://www.fbi.gov/news/press-releases/statement-by-fbi-director-james-b-comey-on-the-investigation-of-secretary-hillary-clintons-use-of-a-personal-e-mail-system",
        "source_5": "U.S. State Department Accountability Review Board (Dec. 2012) — Benghazi Report. The ARB concluded there were “systemic failures and leadership and management deficiencies” in State Department security processes prior to the Benghazi attack, reflecting critically on departmental management during Clinton’s tenure. https://2009-2017.state.gov/documents/organization/202446.pdf",
        "source_6": "PolitiFact (Oct. 6, 2016) — “Hillary Clinton flip-flops on TPP.” Fact-checkers document Clinton’s shift from praising the Trans-Pacific Partnership as secretary of state to opposing it in 2016, fueling critiques about political expediency and policy consistency. https://www.politifact.com/factchecks/2016/oct/06/hillary-clinton/hillary-clinton-flip-flops-tpp/"
    }
}