{
    "question": "Should New York City have the right to regulate the size of sodas bought on the market?",
    "content": {
        "source_1": "Matter of New York Statewide Coalition of Hispanic Chambers of Commerce v. New York City Department of Health & Mental Hygiene, 23 N.Y.3d 681 (N.Y. Ct. App. 2014) — New York’s highest court struck down NYC’s 16-ounce “Portion Cap Rule,” holding the Board of Health exceeded its administrative authority and made legislative policy choices, indicating the City (acting through the Board) did not have the right to impose the soda size limit in that manner.",
        "source_2": "New York City Charter §§ 556, 558 (powers of the Department of Health and Mental Hygiene and the Board of Health) — The Charter authorizes the City to “preserve and promote the health of the inhabitants” and empowers the Board of Health to amend the Health Code and regulate matters affecting health, including food service establishments, supporting the City’s general authority to regulate beverage service for public health purposes.",
        "source_3": "New York State Restaurant Association v. New York City Board of Health, 556 F.3d 114 (2d Cir. 2009) — The Second Circuit upheld NYC’s calorie-posting requirement for chain restaurants against preemption and constitutional challenges, showing that local health regulations of restaurant practices can be lawful when within delegated authority.",
        "source_4": "Jacobson v. Massachusetts, 197 U.S. 11 (1905) — The U.S. Supreme Court recognized broad state police powers to enact public health measures even when they restrict individual liberty, providing a constitutional foundation for portion-size regulations when duly authorized by the appropriate legislative body.",
        "source_5": "NYC Department of Health and Mental Hygiene, Notice of Adoption of an Amendment to Article 81 of the Health Code (“Sugary Drinks Portion Cap Rule”), adopted Sept. 13, 2012; effective Mar. 12, 2013 — The official rule limited sugary drink portions in City-regulated food service establishments but exempted convenience stores and certain beverages due to jurisdictional limits, a design choice that both reflected the City’s constrained authority and contributed to later findings of arbitrariness.",
        "source_6": "Boreali v. Axelrod, 71 N.Y.2d 1 (N.Y. Ct. App. 1987) — The Court invalidated agency-made anti-smoking rules for exceeding delegated authority and articulated a separation-of-powers test later applied in the soda case, underscoring that agencies lack the right to make major policy decisions without clear legislative guidance."
    }
}