{
    "question": "Should Google not censor its search results in China?",
    "content": {
        "source_1": "Google Official Blog — “A New Approach to China” (Jan 12, 2010). Google announced it would stop censoring search on google.cn after targeted cyberattacks against Gmail accounts of Chinese human rights activists and ongoing limits on free expression, arguing censorship conflicted with user security and company values. https://googleblog.blogspot.com/2010/01/new-approach-to-china.html",
        "source_2": "United Nations, Office of the High Commissioner for Human Rights — Guiding Principles on Business and Human Rights (2011). Establishes that companies should avoid infringing on human rights, including freedom of expression and privacy, and address adverse impacts they are involved in—used by advocates to argue that cooperating with state censorship risks corporate complicity in rights abuses. https://www.ohchr.org/documents/publications/guidingprinciplesbusinesshr_en.pdf",
        "source_3": "Cyberspace Administration of China — Provisions on the Administration of Internet Search Services (effective Aug 1, 2016). Mandates search providers operating in China to filter “prohibited” content, enforce real-name requirements, and promote “core socialist values,” indicating that operating legally in China requires censorship. http://www.cac.gov.cn/2016-06/25/c_1119127666.htm",
        "source_4": "WIRED — “Sundar Pichai Defends Potential Return to China at WIRED 25 Summit” (Oct 15, 2018). Google’s CEO argued that even with restrictions, a tailored search could serve the vast majority of user queries and deliver better quality information than domestic alternatives—an engagement-based case for limited compliance. https://www.wired.com/story/sundar-pichai-china-wired-25/",
        "source_5": "Freedom House — Freedom on the Net 2023: China. Rates China as the world’s worst environment for internet freedom, documenting pervasive censorship, surveillance, and punishment for online speech—evidence that participating in state filtering would likely contribute to serious rights harms. https://freedomhouse.org/report/freedom-net/2023/china",
        "source_6": "Human Rights Watch — “Race to the Bottom: Corporate Complicity in Chinese Internet Censorship” (Aug 2006). Details how Western tech firms’ compliance with Chinese censorship and surveillance facilitated rights violations and sparked global backlash, a cautionary precedent suggesting companies like Google should not censor. https://www.hrw.org/report/2006/08/10/race-bottom/corporate-complicity-chinese-internet-censorship"
    }
}