{
    "question": "Should African nations ban the sale of skin whitening creams and similar products?",
    "content": {
        "source_1": "World Health Organization (2019) — “Mercury in skin lightening products: Information sheet” (WHO/CED/PHE/EPE/19.13). Evidence: WHO documents serious health harms from mercury used in some skin lightening creams (e.g., kidney damage, neurotoxicity) and finds many products exceed the 1 ppm mercury limit; it urges eliminating mercury-added skin lighteners from markets. https://www.who.int/publications/i/item/WHO-CED-PHE-EPE-19.13",
        "source_2": "Minamata Convention on Mercury (UNEP, Annex A; obligations effective 2020). Evidence: The treaty requires Parties (including many African states) to phase out the manufacture, import, and export of cosmetics with mercury content above 1 ppm, providing a legal basis for banning sales of mercury-added skin lightening products to meet international commitments. https://www.mercuryconvention.org/en/parties/annexes",
        "source_3": "Zero Mercury Working Group (2022) — “Skin lightening creams with dangerous mercury are still widely available.” Evidence: Testing of hundreds of products purchased in stores and online found many with illegal mercury levels still easily accessible in African markets despite national prohibitions, indicating bans alone face major enforcement gaps and displacement to informal and e-commerce channels. https://www.zeromercury.org/mercury-added-products/skin-lightening-creams/",
        "source_4": "U.S. Food and Drug Administration (2020) — Implementation of the CARES Act for OTC drugs (hydroquinone). Evidence: The FDA removed nonprescription (OTC) hydroquinone skin-lightening products from the OTC monograph due to safety concerns; hydroquinone is now permitted only by prescription, illustrating a regulatory alternative that targets risk while preserving medically supervised use for conditions like melasma or post-inflammatory hyperpigmentation. https://www.fda.gov/drugs/over-counter-otc-drug-monograph-reform/otc-monograph-reform-cares-act",
        "source_5": "Lynn M. Thomas (2020) — “Beneath the Surface: A Transnational History of Skin Lighteners” (Duke University Press). Evidence: Historical and sociocultural analysis shows enduring demand for lighteners is driven by colorism, beauty norms, and socioeconomic incentives; the work argues that bans, without tackling advertising, media imagery, and discrimination, risk pushing use underground rather than eliminating it. https://www.dukeupress.edu/beneath-the-surface",
        "source_6": "Office of the UN High Commissioner for Human Rights (2023) — Human-rights-based approaches to skin lightening. Evidence: OHCHR statements and guidance frame skin lightening as intertwined with racial discrimination and gendered pressures; they recommend regulating marketing, ensuring product safety, and public education while cautioning against punitive measures that criminalize users and disproportionately impact women in the informal economy. https://www.ohchr.org/"
    }
}