{
    "question": "Should online gambling be banned?",
    "content": {
        "source_1": "Public Health England — Gambling-related harms evidence review (2021): A comprehensive assessment framed gambling as a public health issue, documenting links between online availability and increased harms including debt, relationship breakdown, mental ill-health, and suicide risk, alongside substantial costs to health and social services. It recommended population-level measures such as tighter controls on product design, availability, and advertising.",
        "source_2": "Financial Action Task Force (FATF) — Report on money laundering and terrorist financing risks in the gambling sector (2020/2022 updates): Identifies online gambling and remote sports betting as high-risk for cross-border money laundering due to rapid transactions, anonymity, and use of intermediaries/crypto, and notes enforcement difficulties with offshore operators. Recommends stringent AML/KYC controls and enhanced supervision to mitigate systemic risks.",
        "source_3": "BMC Public Health — Systematic review of gambling marketing exposure and youth outcomes (2022): Finds consistent associations between exposure to gambling advertising (including on digital and social media) and increased gambling susceptibility, intentions, and participation among children and adolescents. Highlights the pervasive reach of online marketing and the normalization of gambling for young audiences.",
        "source_4": "Danish Gambling Authority (Spillemyndigheden) — Channelization and market monitoring reports (2023–2024): Reports that over 90% of online gambling in Denmark occurs within the licensed market, with strong consumer protections and monitoring enabled by regulation. Notes that restrictive or prohibitive approaches in other jurisdictions are linked to higher use of unlicensed sites, undermining oversight and harm-reduction.",
        "source_5": "New Jersey Division of Gaming Enforcement — Annual Internet Gaming and Sports Wagering reports (2023–2024): Documents substantial, recurring state tax revenues from regulated iGaming and online sports betting, along with mandated consumer protections (self-exclusion, deposit limits, activity monitoring, and operator interventions for high-risk behavior). Presents regulated online gambling as a way to capture economic benefits while enforcing safeguards.",
        "source_6": "Cato Institute — Policy analysis on gambling prohibition and personal liberty (various): Argues that prohibiting online gambling is paternalistic and tends to push activity into unregulated markets, reducing transparency and consumer protection. Advocates for a regulated, harm-reduction approach that preserves adult autonomy while targeting problem gambling with evidence-based interventions."
    }
}