{
    "question": "Should the UK hold a referendum on its EU membership?",
    "content": {
        "source_1": "House of Lords Select Committee on the Constitution, “Referendums in the United Kingdom” (12th Report of Session 2009–10, HL Paper 99, 7 April 2010). The Committee concluded that referendums are most appropriate for fundamental constitutional issues—an argument that EU membership, as a foundational constitutional question, merits a direct popular vote. https://publications.parliament.uk/pa/ld200910/ldselect/ldconst/99/9902.htm",
        "source_2": "UCL Constitution Unit (Alan Renwick and Michela Palese), “Doing Referendums Differently: The Case for Reform” (2018). Drawing on the 2016 EU vote, the report finds that referendums on complex, multi-dimensional issues are vulnerable to misinformation and poor deliberation unless redesigned (e.g., better information rules, citizen deliberation), challenging the idea that a referendum “must” be used in its current form. https://www.ucl.ac.uk/constitution-unit/sites/constitution_unit/files/182_-_doing_referendums_differently_final.pdf",
        "source_3": "Bank of England, Financial Stability Report, Issue No. 39 (July 2016). The BoE reports that the EU referendum result triggered a material increase in uncertainty and market volatility, indicating that holding such a vote can itself impose economic stability risks that policymakers should weigh against any perceived necessity to hold one. https://www.bankofengland.co.uk/financial-stability-report/2016/july-2016",
        "source_4": "UK Parliament, European Union Act 2011 (2011 c.12). The Act introduced a “referendum lock” requiring a public vote before future transfers of powers to the EU, suggesting an alternative mechanism for democratic consent on EU matters without necessitating an immediate in/out referendum. https://www.legislation.gov.uk/ukpga/2011/12/contents",
        "source_5": "The Conservative Party, General Election Manifesto 2015, “Strong Leadership, A Clear Economic Plan, A Brighter, More Secure Future” (2015). The governing party explicitly pledged an in/out referendum on EU membership by the end of 2017; its election victory is cited by proponents as a democratic mandate that the referendum should (indeed must) be held. https://webarchive.nationalarchives.gov.uk/ukgwa/20170705225009/https://s3-eu-west-1.amazonaws.com/manifesto2015/ConservativeManifesto2015.pdf",
        "source_6": "UK Supreme Court, R (Miller) v Secretary of State for Exiting the European Union [2017] UKSC 5 (24 January 2017). The Court held that the 2016 referendum had no automatic legal effect and that Parliament had to legislate to trigger Article 50, underscoring that referendums are not constitutionally required or binding in UK law—countering any claim of a legal “must.” https://www.supremecourt.uk/cases/uksc-2016-0196.html"
    }
}