{
    "question": "Does CO2 not cause global warming?",
    "content": {
        "source_1": "IPCC AR6 Working Group I, Summary for Policymakers (2021) — The UN climate assessment concludes it is unequivocal that human influence has warmed the atmosphere, ocean and land, with CO2 the largest contributor to total anthropogenic radiative forcing (best estimate ~+2.16 W/m² since 1750). https://www.ipcc.ch/report/ar6/wg1/",
        "source_2": "Feldman, D. R., et al. “Observational determination of surface radiative forcing by CO2 from 2000 to 2010.” Nature (2015) — Direct spectroscopic measurements at two sites show an increase in downwelling longwave radiation attributable specifically to rising atmospheric CO2, empirically demonstrating CO2’s warming influence at Earth’s surface. https://www.nature.com/articles/nature14240",
        "source_3": "Caillon, N., et al. “Timing of atmospheric CO2 and Antarctic temperature changes across Termination III.” Science (2003) — Antarctic ice-core data show CO2 concentrations lagging Antarctic temperature by several hundred years during a past deglaciation; often cited to argue CO2 is not the initial trigger of warming (the authors interpret CO2 as an amplifying feedback rather than the primary trigger). https://www.science.org/doi/10.1126/science.1078758",
        "source_4": "Lindzen, R. S., & Choi, Y.-S. “On the determination of climate feedbacks from ERBE data.” Geophysical Research Letters (2009) — An analysis of satellite radiation and sea surface temperature variations arguing for net negative feedbacks and a lower climate sensitivity to CO2 than commonly estimated, used by some to claim CO2-driven warming will be modest; this interpretation is contested in subsequent literature. https://agupubs.onlinelibrary.wiley.com/doi/full/10.1029/2009GL039628",
        "source_5": "Santer, B. D., et al. “Human and natural influences on the changing thermal structure of the atmosphere.” PNAS (2013) — Detection of the “fingerprint” pattern of tropospheric warming combined with stratospheric cooling that is characteristic of increased greenhouse gases and inconsistent with solar variability as the main driver, supporting a causal role for CO2 and other GHGs. https://www.pnas.org/doi/10.1073/pnas.1305332110",
        "source_6": "Lewis, N., & Curry, J. “The impact of recent forcing and ocean heat uptake data on estimates of climate sensitivity.” Journal of Climate (2018) — Energy-balance-based estimates yield an equilibrium climate sensitivity near the low end of IPCC ranges, implying CO2 does cause warming but potentially less than many models project; offers a moderating perspective rather than a denial of CO2’s effect. https://journals.ametsoc.org/view/journals/clim/31/15/jcli-d-17-0667.1.xml"
    }
}