{
    "question": "Is the ‘war on terror’ winnable?",
    "content": {
        "source_1": "Jones, Seth G., and Martin C. Libicki. How Terrorist Groups End: Lessons for Countering al Qa’ida. RAND Corporation, 2008. Evidence: Analyzing 648 groups (1968–2006), they find most terrorist groups end via policing/intelligence or political accommodation, with only a small minority defeated primarily by military force—implying the “war on terror” is winnable only when reframed away from open-ended war toward law enforcement and politics.",
        "source_2": "Johnston, Patrick B. “Does Decapitation Work? Assessing the Effectiveness of Leadership Targeting in Counterinsurgency Campaigns.” International Security 36, no. 4 (2012): 47–79. Evidence: Quantitative study concludes removing militant leaders significantly increases the chances conflicts end and reduces violence, supporting the claim that targeted kinetic operations can produce decisive counterterrorism gains.",
        "source_3": "Jordan, Jenna. “When Heads Roll: Assessing the Effectiveness of Leadership Decapitation.” Security Studies 18, no. 4 (2009): 719–755. Evidence: Cross-case analysis finds leadership decapitation is often ineffective—particularly against large, religiously motivated, or bureaucratized groups—undercutting the notion that a militarized “war on terror” can be conclusively won through killing/capturing leaders.",
        "source_4": "Institute for Economics & Peace. Global Terrorism Index 2023. Evidence: Reports that while terrorism has markedly declined in many OECD countries since the mid-2010s, it has surged and concentrated in the Sahel and parts of South Asia—suggesting the “war on terror” has displaced rather than definitively defeated the threat, challenging claims of global winnability.",
        "source_5": "Brown University, Watson Institute “Costs of War” Project. The U.S. Budgetary Costs of the Post‑9/11 Wars; Human Cost of Post‑9/11 Wars (various reports, 2019–2023). Evidence: Estimates at least $8 trillion in U.S. costs and roughly 900,000 direct war deaths, with enduring instability in several theaters—evidence that, at scale, the “war on terror” has delivered mixed results at very high cost, casting doubt on its overall winnability.",
        "source_6": "International Crisis Group. War Crimes in Sri Lanka. Asia Report No. 191, 2010. Evidence: Documents how Sri Lanka militarily defeated the LTTE in 2009, ending a decades‑long terrorist/insurgent campaign—an existence proof that, in some contexts, a state can achieve a decisive (if costly) “win,” supporting the claim that parts of the “war on terror” are winnable under specific conditions."
    }
}