{
    "question": "Should shark fin soup be banned to protect sharks from extinction?",
    "content": {
        "source_1": "Pacoureau, M., et al. (2021). Half a century of global decline in oceanic sharks and rays. Nature, 589, 567–571. Evidence: Oceanic shark and ray populations have declined by ~71% since 1970 due primarily to increased fishing pressure. This scale of decline is consistent with the need for strong demand-side measures (such as banning shark fin soup) alongside fisheries management to reduce mortality.",
        "source_2": "Clarke, S. C., et al. (2006). Global estimates of shark numbers killed for the fin trade. Ecology Letters, 9(10), 1115–1126. Evidence: Market-based and DNA analyses estimated 26–73 million sharks per year were entering the fin trade, indicating that demand for fins (including for shark fin soup) is a major driver of shark mortality, supporting the rationale for demand-reduction via soup bans.",
        "source_3": "Dent, F., & Clarke, S. (2015). State of the global market for shark products. FAO Fisheries and Aquaculture Technical Paper No. 590. Evidence: The report documents a post-2011 decline in fin prices and a growing global trade in shark meat; in many fisheries sharks are retained for meat or caught as bycatch. It argues that focusing solely on fin/soup bans may miss key mortality drivers and that comprehensive fisheries management is essential.",
        "source_4": "Shiffman, D. S., & Hueter, R. E. (2017). A United States shark fin ban would undermine sustainable shark fisheries. Marine Policy, 85, 138–140. Evidence: The authors argue product bans are a blunt tool that can penalize well-managed, sustainable shark fisheries without meaningfully reducing global shark mortality, suggesting regulated sustainable use and bycatch reduction are preferable to soup/fin bans.",
        "source_5": "WildAid (2014). Shark Fin Demand in China Down by 50–70% (market surveys and price data). Evidence: Following China’s ban on shark fin soup at official banquets and public-awareness campaigns, retail prices and consumption of shark fin reportedly fell sharply. This suggests soup bans can rapidly curb demand and may contribute to reduced fishing pressure on sharks.",
        "source_6": "Cardeñosa, D., Fields, A. T., Babcock, E. A., & Chapman, D. D. (2020). CITES-listed sharks remain among the top species in the Hong Kong fin market despite reporting improvements. Science Advances, 6(39), eabb3696. Evidence: DNA testing showed threatened, CITES-listed sharks still common in the fin market, highlighting enforcement gaps and the persistence of illegal/unsustainable trade; this challenges the sufficiency of bans alone without robust monitoring and international enforcement."
    }
}