{
    "question": "Should Puerto Rico seek American statehood?",
    "content": {
        "source_1": "Kaiser Family Foundation — “Medicaid and CHIP in the Territories” (Issue Brief, updated 2023). Documents that Puerto Rico’s federal Medicaid funding is capped and subject to different rules than states, leading to financing shortfalls and coverage challenges; in contrast, states receive uncapped federal matching under standard FMAP rules. https://www.kff.org/medicaid/issue-brief/medicaid-and-chip-in-the-territories/",
        "source_2": "United States v. Vaello Madero, 596 U.S. ___ (2022). The Supreme Court upheld Congress’s exclusion of Puerto Rico residents from Supplemental Security Income (SSI), underscoring that, as a territory, Puerto Rico does not receive certain federal safety-net benefits on the same terms as states. https://www.supremecourt.gov/opinions/21pdf/20-303_new_j4ek.pdf",
        "source_3": "Ballotpedia — “Puerto Rico Statehood Referendum (2020).” Reports official results showing 52.52% voting “Yes” and 47.48% “No” on statehood, with turnout around 55%, indicating a divided electorate and contested mandate. https://ballotpedia.org/Puerto_Rico_Statehood_Referendum_(2020)",
        "source_4": "Congress.gov — H.R. 8393 (117th): Puerto Rico Status Act (Passed House, Dec. 15, 2022). Details a congressional proposal for a binding self-determination vote offering statehood, independence, or free association, highlighting that any status change, including statehood, requires congressional action and that non-statehood options remain on the table. https://www.congress.gov/bill/117th-congress/house-bill/8393",
        "source_5": "United Nations Press — “Special Committee on Decolonization Approves Draft Resolution Calling upon United States to Expedite a Process Enabling Puerto Rico to Exercise Its Right to Self-Determination and Independence” (GA/COL/3356, 2022). Reflects an international perspective emphasizing decolonization and the legitimacy of independence/free association, offering a viewpoint that prioritizes sovereignty over integration as a U.S. state. https://press.un.org/en/2022/gacol3356.doc.htm",
        "source_6": "Internal Revenue Service — Publication 570: Tax Guide for Individuals With Income From U.S. Possessions. Explains that bona fide residents of Puerto Rico generally do not pay U.S. federal income tax on Puerto Rico–source income under current territorial status, a benefit that would not apply in the same way under statehood, implying increased federal tax liabilities for many residents. https://www.irs.gov/publications/p570"
    }
}