{
    "question": "Should the darker side of the nation's formation be shown?",
    "content": {
        "source_1": "Roxanne Dunbar-Ortiz, An Indigenous Peoples’ History of the United States (Beacon Press, 2014). Argues U.S. nation-building was fundamentally a settler-colonial project premised on the “elimination of the Native,” documenting state-sanctioned land seizures, massacres, and removal policies as core—not peripheral—to national formation.",
        "source_2": "Nikole Hannah-Jones, “America Wasn’t a Democracy Until Black Americans Made It One,” The 1619 Project, The New York Times Magazine (2019). Contends that slavery and the struggle of Black Americans are central to the nation’s founding story, showing how the ideals of liberty were built alongside bondage and only made real through Black activism.",
        "source_3": "Sven Beckert, Empire of Cotton: A Global History (Knopf, 2014). Demonstrates that enslaved labor and the cotton economy underwrote early American industrialization and national growth, tying Northern finance, insurance, and manufacturing directly to plantation slavery rather than treating it as a regional aberration.",
        "source_4": "Sean Wilentz, No Property in Man: Slavery and Antislavery at the Nation’s Founding (Harvard University Press, 2018). Challenges the claim that the United States was “founded on slavery,” arguing the Constitution deliberately avoided recognizing human property, creating openings that antislavery politics later exploited.",
        "source_5": "Maya Jasanoff, Liberty’s Exiles: The Loss of America and the Remaking of the British Empire (Knopf, 2011). Recasts the Revolution’s aftermath by tracing the Loyalist diaspora—confiscations, exile, and displacement—while highlighting how thousands of enslaved people fled with the British, complicating triumphalist national narratives.",
        "source_6": "Woody Holton, Unruly Americans and the Origins of the Constitution (Hill and Wang, 2007). Presents the founding as a counterrevolution in part against debtors, small farmers, and popular democracy, arguing elites engineered the Constitution to curb grassroots economic demands and civil unrest."
    }
}