{
    "question": "Is it selfish to have more than two children?",
    "content": {
        "source_1": "Wynes, S., & Nicholas, K. A. (2017). The climate mitigation gap: education and government recommendations miss the most effective individual actions. Environmental Research Letters. https://iopscience.iop.org/article/10.1088/1748-9326/aa7541 - Finding: In high-income countries, having one fewer child is estimated to reduce a parent’s carbon footprint by about 58.6 tCO2e per year (attributing a portion of descendants’ emissions to parents). This supports the view that larger families impose substantial environmental externalities, bolstering the “selfish” framing on climate grounds.",
        "source_2": "Oxfam (2020). Confronting Carbon Inequality: Putting climate justice at the heart of the COVID-19 recovery. https://policy-practice.oxfam.org/resources/confronting-carbon-inequality-621052/ - Finding: The richest 10% of people accounted for 52% of cumulative global emissions added between 1990 and 2015, while the poorest 50% accounted for just 7%. This challenges the idea that family size per se is “selfish,” arguing that high-consumption lifestyles—far more than births in low-income contexts—drive climate harm.",
        "source_3": "United Nations, Department of Economic and Social Affairs (2022). World Population Prospects 2022. https://population.un.org/wpp/ - Finding: Many countries now face sustained below-replacement fertility and rapid population aging, raising old-age dependency ratios and fiscal pressures. From this perspective, families with more than two children can be seen as providing positive social externalities by helping stabilize workforces and pension systems.",
        "source_4": "UNFPA (2018). The State of World Population 2018: The Power of Choice. https://www.unfpa.org/swop-2018 - Finding: Reproductive rights include the freedom to decide the number and spacing of children without coercion. Labeling larger families as “selfish” risks undermining autonomy and rights-based family planning, a core principle of international agreements since the 1994 ICPD Programme of Action.",
        "source_5": "Downey, D. B. (1995). When Bigger Is Not Better: Family Size, Parental Resources, and Children’s Educational Performance. American Sociological Review, 60(5), 746–761. https://www.jstor.org/stable/2096320 - Finding: Evidence consistent with the “resource dilution” model shows that children in larger families receive fewer parental resources and tend to have lower educational outcomes. This suggests a potential intra-family cost of having more than two children, framing the choice as potentially disadvantageous to existing children.",
        "source_6": "Jones, C. I. (2020). The End of Economic Growth? Unintended Consequences of a Declining Population (NBER Working Paper No. 26651). https://www.nber.org/papers/w26651 - Finding: Idea production and innovation scale with the number of people; declining populations may slow technological progress and economic growth. This implies larger families can generate positive innovation externalities, countering the notion that having more than two children is socially “selfish.”"
    }
}