{
    "question": "Should goal-line technology be used in football?",
    "content": {
        "source_1": "IFAB media release — “IFAB approves goal-line technology” (July 5, 2012). After laboratory and stadium trials, football’s law-making body approved GLT systems (e.g., Hawk‑Eye, GoalRef), requiring sub‑second signals to referees. Evidence cited by IFAB emphasized accuracy and minimal disruption, supporting the view that GLT improves decision-making with little downside.",
        "source_2": "BBC Sport — “World Cup 2014: Goal-line technology used in France win over Honduras” (June 15, 2014). GLT conclusively determined a contentious goal in real time during France–Honduras, preventing prolonged debate and aiding a correct call without delaying play—an example of tangible on-field benefits.",
        "source_3": "The Guardian — “Hawk-Eye apologises after goal-line technology error in Aston Villa v Sheffield United” (June 17, 2020). A rare but high-profile failure meant a clear goal was not awarded; Hawk‑Eye said it was the first error in over 9,000 matches due to camera occlusion. This undercuts the claim that GLT “can only lead to benefits” and shows technology is fallible.",
        "source_4": "EFL (English Football League) announcement — “Goal-line technology to be introduced in the Championship” (2017). The EFL adopted GLT for the Championship but not for League One and Two, highlighting affordability constraints for lower divisions and the resulting competitive inconsistency—evidence against universal, unqualified benefit.",
        "source_5": "ESPN FC — “MLS unlikely to adopt goal-line technology due to cost, with VAR preferred” (interviews with Commissioner Don Garber, circa 2015–2017). MLS leadership cited high installation/maintenance costs and the low frequency of goal-line incidents, opting to rely on VAR instead. This challenges the notion that GLT is “overdue” or the only beneficial solution.",
        "source_6": "Reuters — “UEFA’s Michel Platini rejects goal-line technology, prefers additional assistants” (2010–2012 coverage). Platini argued that technology undermines the game’s universality and that many competitions cannot afford it, advocating human officials over tech. This perspective contests both the “overdue” framing and the assumption of net-only benefits."
    }
}