{
    "question": "Should the ICC have its own enforcement arm?",
    "content": {
        "source_1": "International Criminal Court, “Cooperation” (ICC official page). States that the Court has no police force and must rely on States to arrest and surrender suspects, highlighting the core enforcement gap the proposal seeks to address. https://www.icc-cpi.int/about/cooperation",
        "source_2": "ICC Pre-Trial Chamber II, Decision under Article 87(7) on non-compliance by South Africa in the Al-Bashir case (6 July 2017). Judges found South Africa failed to arrest and surrender Omar al-Bashir despite ICC requests, illustrating how state non-cooperation can nullify arrest warrants without an independent enforcement capability. https://www.icc-cpi.int/news/icc-judges-find-south-africa-failed-comply-its-obligations-arrest-surrender-omar-al-bashir",
        "source_3": "Independent Expert Review of the ICC and Rome Statute System, Final Report (30 September 2020). Concludes arrests and cooperation are persistent weaknesses but recommends strengthening state cooperation frameworks and arrest strategies rather than creating an ICC police force—warning of resource limits and political feasibility constraints. https://asp.icc-cpi.int/icc-asp/independent-expert-review",
        "source_4": "African Union Assembly, Decision on the Meeting of African States Parties to the Rome Statute of the ICC (Assembly/AU/Dec.245(XIII), Sirte, July 2009). Decides AU Member States shall not cooperate in the arrest and surrender of Sudan’s President al-Bashir, evidencing regional political resistance that could intensify against an ICC enforcement arm. https://au.int/en/decisions/assemblyau-dec-245xiii",
        "source_5": "BBC News, “SFOR arrests suspected war criminals” (10 July 1997). Reports NATO-led SFOR troops detained ICTY indictees in Bosnia, showing that when an international tribunal has access to robust on-the-ground arrest capability, fugitives can be apprehended—supporting arguments for a dedicated enforcement capacity. http://news.bbc.co.uk/2/hi/europe/321154.stm",
        "source_6": "United States Code, American Servicemembers’ Protection Act (22 U.S.C. Chapter 76), including §7427. Bars many forms of U.S. cooperation with the ICC and authorizes the President to use “all means necessary and appropriate” to free covered persons detained by the ICC, signaling strong great-power opposition that would complicate any ICC-controlled enforcement arm. https://uscode.house.gov/view.xhtml?path=/prelim@title22/chapter76"
    }
}