{
    "question": "Should we pursue manned space flight?",
    "content": {
        "source_1": "National Research Council (2014). Pathways to Exploration: Rationales and Approaches for a U.S. Program of Human Space Exploration. National Academies Press. Key finding: science alone does not justify the high costs of human spaceflight relative to robotic missions; the most defensible rationales are geopolitical leadership, inspiration, and long-term survival, and success requires sustained, realistic budgets. https://nap.edu/18801",
        "source_2": "Columbia Accident Investigation Board (2003). Report Volume 1. Key evidence: the Space Shuttle suffered two fatal accidents in 135 missions (Challenger and Columbia), and the Board identified systemic organizational and technical shortcomings—illustrating the inherently high risk of crewed spaceflight. https://history.nasa.gov/columbia/CAIB_reports.html",
        "source_3": "NASA Office of Inspector General (2020). NASA’s Management of Crew Transportation to the International Space Station (IG-20-016). Key data: Commercial Crew pricing reduced per-seat costs to the ISS (SpaceX ~$55 million vs. Boeing ~$90 million vs. recent Soyuz averages ~$86 million), suggesting improved affordability and access for human spaceflight. https://oig.nasa.gov/docs/IG-20-016.pdf",
        "source_4": "NASA Office of Inspector General (2021). NASA’s Management of the Artemis Missions (IG-22-003). Key data: NASA is projected to spend about $93 billion on Artemis through FY2025, with per-launch production and operations costs for SLS/Orion estimated at ~$4.1 billion—raising concerns about program sustainability and opportunity cost. https://oig.nasa.gov/docs/IG-22-003.pdf",
        "source_5": "Garrett-Bakelman et al. (2019). The NASA Twins Study: A multidimensional analysis of a year-long human spaceflight. Science, 364(6436), eaau8650. Key findings: prolonged spaceflight produces genomic, immune, vascular, and cognitive changes—some persisting after return—highlighting significant biomedical risks that complicate long-duration crewed missions. https://www.science.org/doi/10.1126/science.aau8650",
        "source_6": "NASA (2020–ongoing). The Artemis Accords: Principles for Cooperation in the Civil Exploration and Use of the Moon, Mars, Comets, and Asteroids. Key point: dozens of nations have signed onto a U.S.-led framework tied to crewed lunar exploration, indicating that human missions serve as a tool for international coalition-building and norm-setting in space governance. https://www.nasa.gov/artemis-accords/"
    }
}