{
    "question": "Should the 2022 Football World Cup be moved to the winter?",
    "content": {
        "source_1": "FIFA Task Force recommendation — FIFA.com (2015): The FIFA Task Force for the International Match Calendar 2018–24 recommended staging Qatar 2022 in November–December, citing player and spectator welfare due to extreme summer heat, and proposed a shortened, 28‑day tournament. Evidence supports moving the World Cup to winter for safety and feasibility.",
        "source_2": "Qatar 2022 Supreme Committee statement — BBC Sport reporting (2013–2014): Qatar’s organizing leaders, including Hassan Al‑Thawadi, argued the tournament could be safely played in June/July thanks to advanced cooling technology in stadiums, training sites, and fan zones. Evidence suggests a summer World Cup could be viable without moving to winter.",
        "source_3": "Qatar climate data — Qatar Civil Aviation Authority Meteorology/Climate of Qatar: Long‑term climate normals show Doha’s average highs exceed 40°C in June–August, with high humidity that elevates heat stress. Evidence indicates typical summer conditions are hazardous for prolonged outdoor exertion, supporting a winter move.",
        "source_4": "Heat-risk guidelines — American College of Sports Medicine position statements on exertional heat illness: ACSM guidance flags heightened risk for sustained high‑intensity sport when WBGT exceeds ~28°C and recommends cancelation/modification at very high WBGT. When combined with Qatar’s summer WBGT levels, the medical evidence favors shifting to cooler months.",
        "source_5": "Domestic league/calendar impact — European Club Association and European Professional Football Leagues statements (2015): European clubs and leagues warned a winter World Cup would severely disrupt domestic seasons, congest calendars, and complicate player contracts. Evidence argues against moving the tournament due to major systemic costs.",
        "source_6": "Broadcaster conflicts — The New York Times coverage of FIFA’s 2026 U.S. rights deal with Fox (2015): Reporting indicated FIFA extended future rights to Fox in part to mollify the fallout from shifting Qatar 2022 to winter, which clashed with the NFL and advertising commitments. Evidence highlights significant commercial downsides to a winter move."
    }
}