{
    "question": "Should the United States ban assault weapons?",
    "content": {
        "source_1": "DiMaggio, C., Avraham, J., Berry, C., Bukur, M., Feldman, J., Klein, M., Shah, N., & Frangos, S. (2019). Changes in US mass shooting deaths associated with the 1994–2004 federal assault weapons ban. Injury Epidemiology. Analysis found mass-shooting fatalities were substantially lower during the federal ban period and rose after its expiration, suggesting the ban may have reduced mass-shooting lethality.",
        "source_2": "Koper, C. S. (2004). An Updated Assessment of the Federal Assault Weapons Ban: Impacts on Gun Markets and Gun Violence, 1994–2003. U.S. Department of Justice, NIJ. The evaluation reported limited or mixed effects of the federal ban on overall gun violence due to grandfathered weapons and the small share of crimes involving banned models; it suggested any benefits might accrue over a longer period, especially via limits on large-capacity magazines.",
        "source_3": "FBI, Uniform Crime Reports (multiple years, e.g., “Murder Victims by Weapon” tables). Rifles account for a small fraction of U.S. murders each year (typically about 2–4%), with handguns used far more often, implying an assault-weapon ban would have limited impact on overall homicide rates.",
        "source_4": "RAND Corporation (2023 update). The Effects of Assault Weapon and High-Capacity Magazine Bans. Evidence review concludes effects of assault-weapon bans on overall violent crime are uncertain; there is limited, suggestive evidence of reductions in mass-shooting deaths, with stronger evidence for bans on large-capacity magazines than for bans defined by weapon features.",
        "source_5": "National Shooting Sports Foundation (NSSF) (2023). Common Use Estimates of “Modern Sporting Rifles.” Industry data estimate over 24 million AR-15–style rifles in circulation, indicating widespread ownership; in light of Supreme Court precedents emphasizing weapons “in common use” (e.g., Heller 2008; Bruen 2022), this prevalence raises constitutional and practical challenges to a broad ban.",
        "source_6": "Chapman, S., Alpers, P., Agho, K., & Jones, M. (2006; updated analyses 2016). Australia’s 1996 National Firearms Agreement and mass shootings. Journal of Public Health Policy and subsequent work report no mass shootings for two decades after Australia implemented a sweeping semiautomatic rifle ban with buybacks, coinciding with declines in firearm mortality; however, the reforms were comprehensive and in a different context than the U.S."
    }
}