{
    "question": "Should the teaching of Shakespeare be compulsory?",
    "content": {
        "source_1": "UK Department for Education, National Curriculum in England: English Programmes of Study (2014). Evidence: Makes the study of Shakespeare statutory in secondary English (e.g., a Shakespeare play is mandatory at GCSE), reflecting a policy view that shared cultural heritage and canonical knowledge warrant compulsory teaching.",
        "source_2": "Greene, Jay P.; Kisida, Brian; Bowen, Daniel H. “Learning from Live Theater.” Education Next (2015). Evidence: A randomized study of students attending live performances (including Hamlet) found gains in content knowledge, vocabulary, empathy, and tolerance—supporting claims that Shakespeare yields measurable educational benefits that could justify compulsory inclusion.",
        "source_3": "Crystal, David. Think on My Words: Exploring Shakespeare’s Language (2008). Evidence: Documents how Shakespeare’s phrases and rhetorical patterns permeate modern English and public discourse; argues that familiarity with Shakespeare enhances cultural and linguistic literacy—used to support compulsory study.",
        "source_4": "National Council of Teachers of English (NCTE), Position Statements on Text Selection and Students’ Right to Read (e.g., 2018 update). Evidence: Advocates for teacher autonomy and culturally responsive, diverse reading lists; cautions against prescriptive, one-author mandates—used to argue against making Shakespeare compulsory.",
        "source_5": "OECD, PISA 2018 Reading Framework. Evidence: Emphasizes developing reading literacy through engagement with a variety of complex, authentic texts; does not prescribe specific authors—suggesting that literacy goals can be met without mandating Shakespeare specifically.",
        "source_6": "Ngũgĩ wa Thiong’o. Decolonising the Mind (1986). Evidence: Argues that privileging colonial-language canons in curricula can marginalize local languages and literatures; making Shakespeare compulsory may perpetuate cultural dominance—used to oppose compulsory teaching, especially in postcolonial contexts."
    }
}