{
    "question": "Should homosexuals be able to adopt?",
    "content": {
        "source_1": "American Academy of Pediatrics (2013), “Promoting the Well-Being of Children Whose Parents Are Gay or Lesbian.” Policy statement concludes that children raised by gay or lesbian parents fare as well on measures of health, adjustment, and development as those raised by heterosexual parents, and supports second-parent adoption to secure children’s legal ties to both parents. https://publications.aap.org",
        "source_2": "Gates, G., Badgett, M. V. L., Macomber, J. E., & Chambers, K. (2011). Adoption and Foster Care by Gay and Lesbian Parents in the United States. The Williams Institute/Urban Institute. Empirical data show same-sex couples are significantly more likely than different-sex couples to be raising adopted and foster children, and that over 100,000 children in U.S. foster care are waiting to be adopted—indicating that allowing same-sex adoptions can expand the pool of qualified parents. https://williamsinstitute.law.ucla.edu/publications/adoption-foster-care-lgbt-parents/",
        "source_3": "Regnerus, M. (2012). “How different are the adult children of parents who have same-sex relationships?” Social Science Research, 41(4), 752–770. Using the New Family Structures Study, this paper reported worse outcomes on several indicators for young adults with a parent who had a same-sex relationship, a finding often cited by opponents of same-sex adoption (though the study’s methodology and relevance to stable same-sex parenting have been widely disputed). https://doi.org/10.1016/j.ssresearch.2012.03.009",
        "source_4": "European Court of Human Rights, X and Others v. Austria (Grand Chamber), App. No. 19010/07 (2013). The Court held that denying second‑parent adoption to same-sex couples while allowing it for unmarried different-sex couples violated Articles 14 and 8 (non‑discrimination and family life), supporting equal legal access to adoption for same-sex families. https://hudoc.echr.coe.int/eng?i=001-116735",
        "source_5": "Congregation for the Doctrine of the Faith (Vatican) (2003), “Considerations Regarding Proposals to Give Legal Recognition to Unions Between Homosexual Persons.” Argues against same-sex adoption on moral and child‑welfare grounds, asserting that children have a right to both a mother and a father and that placing children with same-sex couples does not serve the child’s best interests. https://www.vatican.va/roman_curia/congregations/cfaith/documents/rc_con_cfaith_doc_20030731_homosexual-unions_en.html",
        "source_6": "Fulton v. City of Philadelphia, 593 U.S. ___ (2021). U.S. Supreme Court held that excluding a Catholic foster care agency for declining to certify same‑sex couples violated the Free Exercise Clause given the city’s discretionary exemptions, highlighting a policy tension between anti-discrimination goals and religious liberty in the context of adoption/foster care services. https://supreme.justia.com/cases/federal/us/593/19-123/"
    }
}