{
    "question": "Should the development of a missile defence system be supported?",
    "content": {
        "source_1": "CSIS Missile Defense Project — Iron Dome profile (updated) — Summarizes real-world performance data showing Israel’s Iron Dome has intercepted a high percentage of short-range rockets aimed at populated areas, significantly reducing casualties and infrastructure damage during conflicts. Demonstrates that layered missile defense can measurably save lives in practice. (https://missilethreat.csis.org/defsys/iron-dome/)",
        "source_2": "Royal United Services Institute (RUSI) — Analysis of Ukraine’s air and missile defense (2023–2024) — Documents how Patriot systems in Ukraine have intercepted advanced Russian ballistic threats, including Kinzhal missiles, underscoring that modern, networked air and missile defenses can blunt coercive strike campaigns and protect critical infrastructure. Provides operational evidence beyond short-range rockets. (https://rusi.org/)",
        "source_3": "National Academies of Sciences, Engineering, and Medicine — Making Sense of Ballistic Missile Defense (2012) — Concludes boost-phase missile defense is not practical with current or near-term technology and that midcourse intercepts face serious countermeasure challenges (e.g., decoys). Argues large investments may not yield reliable protection against sophisticated adversaries. (https://nap.edu/13189)",
        "source_4": "Stockholm International Peace Research Institute (SIPRI) Yearbook — Nuclear forces and missile defense (recent editions) — Assesses how national missile defense deployments can undermine strategic stability by incentivizing adversaries to expand or diversify offensive arsenals (MIRVs, hypersonics) to overwhelm or evade defenses. Highlights the post-ABM Treaty dynamics contributing to arms racing pressures. (https://www.sipri.org/yearbook)",
        "source_5": "U.S. Government Accountability Office (GAO) — Annual assessments of the Missile Defense Agency (e.g., Testing and Delivery Progress Updates) — Finds persistent shortfalls: limited operational realism in testing, concurrency and schedule risks, cost growth, and unresolved cybersecurity vulnerabilities. Raises doubts about reliability claims and cost-effectiveness without rigorous, realistic testing and oversight. (https://www.gao.gov/missile-defense)",
        "source_6": "NATO — Ballistic Missile Defence policy page — States NATO’s BMD is a purely defensive mission aimed at protecting Allied populations, territory, and forces against ballistic missile threats from outside the Euro-Atlantic area. Frames support for missile defense as central to collective defense, deterrence by denial, and Alliance cohesion. (https://www.nato.int/cps/en/natohq/topics_49635.htm)"
    }
}