{
    "question": "Is the threat of climate change exaggerated?",
    "content": {
        "source_1": "Richard S. J. Tol (2018), “The Economic Impacts of Climate Change,” Journal of Economic Perspectives 32(2):31–52. Finds that aggregate global damages from 2–3°C warming are likely on the order of a few percent of GDP, which some interpret as evidence that apocalyptic narratives exaggerate the threat. https://www.aeaweb.org/articles?id=10.1257/jep.32.2.31",
        "source_2": "Laurens M. Bouwer (2011), “Have Disaster Losses Increased Due to Anthropogenic Climate Change?” Bulletin of the American Meteorological Society 92(1):39–46. Review concludes that, after normalizing for population and wealth, there is no clear global trend of increasing disaster losses attributable to climate change, suggesting heightened threat claims may conflate hazard with exposure. https://journals.ametsoc.org/view/journals/bams/92/1/2010bams3092_1.xml",
        "source_3": "Hannah Ritchie and Max Roser (Our World in Data), “Natural Disasters” (updated regularly, EM-DAT based). Documents a >90% decline in climate-related disaster deaths since the early 20th century, often cited to argue human vulnerability has fallen and the threat may be overstated in terms of mortality. https://ourworldindata.org/natural-disasters",
        "source_4": "IPCC (2022), Sixth Assessment Report, Working Group II: Impacts, Adaptation and Vulnerability – Summary for Policymakers. Assesses that climate change is already causing widespread adverse impacts and that risks escalate with each increment of warming, contradicting claims that the threat is exaggerated. https://www.ipcc.ch/report/ar6/wg2/",
        "source_5": "Armstrong McKay et al. (2022), “Exceeding 1.5°C global warming could trigger multiple climate tipping points,” Science 377:eabn7950. Synthesizes evidence that several Earth system tipping elements may activate around 1.5–2°C, implying potentially abrupt, severe impacts and that risks may be underestimated rather than exaggerated. https://www.science.org/doi/10.1126/science.abn7950",
        "source_6": "Burke, Hsiang, and Miguel (2015), “Global non-linear effect of temperature on economic production,” Nature 527:235–239. Empirical analysis projects large economic damages that rise nonlinearly with temperature, indicating substantial welfare losses under continued warming and challenging the notion that the threat is overstated. https://www.nature.com/articles/nature15725"
    }
}