{
    "question": "Are women the key to Africa’s economic future?",
    "content": {
        "source_1": "McKinsey Global Institute (2019), “The power of parity: Advancing women’s equality in Africa.” https://www.mckinsey.com/featured-insights/middle-east-and-africa/the-power-of-parity-advancing-womens-equality-in-africa - Estimates that advancing women’s equality could add about $316 billion to Africa’s GDP by 2025 (roughly a 10% boost), arguing that closing gender gaps in work, education, and legal rights is a significant macroeconomic growth lever.",
        "source_2": "FAO (2011), “The State of Food and Agriculture 2010-11: Women in Agriculture—Closing the gender gap for development.” https://www.fao.org/3/i2050e/i2050e.pdf - Finds that equalizing women’s access to agricultural inputs could raise farm yields by 20–30% and total agricultural output in developing countries by 2.5–4%, suggesting large productivity gains in a sector employing many Africans.",
        "source_3": "World Bank (2019), “Profiting from Parity: Unlocking the Potential of Women’s Businesses in Africa.” https://openknowledge.worldbank.org/handle/10986/31421 - Documents that women comprise a large share of the self-employed in Africa but are concentrated in lower-return sectors and face capital constraints; shows that easing these constraints and enabling entry into higher-return sectors could substantially raise firm productivity and incomes.",
        "source_4": "ILO (2018), “Women and Men in the Informal Economy: A Statistical Picture (3rd ed.).” https://www.ilo.org/global/publications/books/WCMS_626831/lang--en/index.htm - Reports that about 90% of women’s employment in Sub-Saharan Africa is informal, indicating women already participate heavily in the economy; the core growth challenge is low productivity and informality rather than sheer participation, tempering the idea that women’s inclusion alone is “the key.”",
        "source_5": "IMF (2023), “Regional Economic Outlook: Sub-Saharan Africa—The Big Funding Squeeze.” https://www.imf.org/en/Publications/REO/SSA/Issues/2023/04/14/regional-economic-outlook-for-sub-saharan-africa-april-2023 - Attributes growth dynamics chiefly to macro factors—debt pressures, inflation, investment, energy supply, and external demand—implying that while gender reforms can help, structural and macroeconomic constraints are pivotal for the region’s near-term economic trajectory.",
        "source_6": "Fafchamps, McKenzie, Quinn, and Woodruff (2014), “Microenterprise growth and the flypaper effect: Evidence from a randomized experiment in Ghana,” Journal of Development Economics. https://www.sciencedirect.com/science/article/pii/S0304387814000265 - Shows cash grants increased profits for male-owned firms but not for most female-owned firms (unless in-kind), highlighting intra-household and contextual constraints; cautions that women-focused enterprise finance alone may not reliably translate into broad-based growth."
    }
}