{
    "question": "Should pharmaceutical companies be allowed to advertise directly to consumers?",
    "content": {
        "source_1": "U.S. Food and Drug Administration (CDER). Patient and Physician Attitudes and Behaviors Associated With DTC Promotion of Prescription Drugs—Summary of FDA Survey Research Results (Nov 2004). Finding: DTC ads commonly prompt patients to seek information and initiate doctor visits; many physicians reported that these conversations were clinically useful, though some also noted patient requests for specific brand-name drugs. https://www.fda.gov/media/112371/download",
        "source_2": "Donohue, J.M., Cevasco, M., Rosenthal, M.B. A Decade of Direct-to-Consumer Advertising of Prescription Drugs. New England Journal of Medicine, 357:673–681 (2007). Finding: DTC advertising expenditures rose to $4.2 billion by 2005 and were associated with large increases in sales, especially through expansion of entire drug classes—implicating higher overall spending without clear evidence of proportional health gains. https://www.nejm.org/doi/full/10.1056/NEJMsa070502",
        "source_3": "American Medical Association. AMA Calls for Ban on Direct-to-Consumer Advertising of Prescription Drugs and Medical Devices (Press release, Nov 17, 2015). Position: The nation’s largest physician group urged a ban on DTC ads, arguing they drive demand for expensive, often unnecessary treatments and contribute to rising drug prices and inappropriate prescribing. https://www.ama-assn.org/press-center/press-releases/ama-calls-ban-direct-consumer-advertising",
        "source_4": "Iizuka, T., Jin, G.Z. The Effect of Prescription Drug Advertising on Doctor Visits. Journal of Economics & Management Strategy, 14(4):701–727 (2005). Finding: Greater exposure to DTC advertising increased outpatient visits for the targeted conditions, with spillovers to nonadvertised brands—evidence that ads can stimulate diagnosis and treatment discussions rather than just brand switching. https://doi.org/10.1111/j.1530-9134.2005.00123.x",
        "source_5": "U.S. Government Accountability Office. Prescription Drugs: Improvements Needed in FDA’s Oversight of Direct-to-Consumer Advertising (GAO-07-54, Nov 2006). Finding: FDA’s capacity to review and act on misleading DTC ads was limited; many ads with incomplete or unbalanced risk information aired before corrective action, highlighting enforcement and public-safety concerns. https://www.gao.gov/products/gao-07-54",
        "source_6": "European Union. Directive 2001/83/EC (as amended by 2004/27/EC) on the Community code relating to medicinal products for human use. Policy: The EU prohibits advertising of prescription-only medicines to the general public (Art. 88), reflecting a precautionary stance to protect public health and promote rational medicine use—contrasting with U.S./New Zealand permissiveness. https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX%3A02001L0083-20121116"
    }
}