{
    "question": "Should it be compulsory for all mothers to breastfeed for the first six months of their babies' lives?",
    "content": {
        "source_1": "World Health Organization (Infant and young child feeding recommendations): WHO recommends exclusive breastfeeding for the first 6 months because it substantially reduces infant morbidity and mortality from diarrhea and respiratory infections, supports healthy growth, and provides immunological protection. This evidence supports prioritizing breastfeeding on public health grounds.",
        "source_2": "U.S. Centers for Disease Control and Prevention (Contraindications to breastfeeding): The CDC lists clear medical situations where breastfeeding should not occur or may require individual risk–benefit assessment, including classic galactosemia in the infant, maternal HIV infection (in high-resource settings), human T-cell lymphotropic virus (HTLV I/II), certain chemotherapy or radiotherapy, and untreated active tuberculosis. This shows that making breastfeeding compulsory for all mothers would be unsafe in specific, nontrivial circumstances.",
        "source_3": "American College of Obstetricians and Gynecologists (Policy on breastfeeding support and patient autonomy): ACOG policy statements emphasize informed choice, noncoercive counseling, and respect for maternal autonomy, noting that while breastfeeding is strongly supported, not all women can or will breastfeed and care should avoid stigma or compulsion. This raises ethical and human rights concerns with any “compulsory” mandate.",
        "source_4": "Colen, C. G., & Ramey, D. M. (2014). Is Breast Truly Best? Estimating the Effect of Breastfeeding on Long-term Child Outcomes Using Sibling Comparisons (Social Science & Medicine): Using within-family (sibling) comparisons, the study finds many purported long-term advantages of breastfeeding (e.g., cognitive and behavioral outcomes) attenuate substantially when controlling for family-level confounders. This challenges arguments that large, universal long-term benefits justify compulsion, especially in high-income settings.",
        "source_5": "McFadden, A. et al. (2017). Support for healthy breastfeeding mothers with healthy term babies (Cochrane Review): Additional professional or peer support increases the duration and exclusivity of breastfeeding. The review suggests that supportive, system-level interventions (e.g., trained support, Baby-Friendly practices) effectively raise breastfeeding rates without coercion, indicating mandates are not necessary to achieve public health goals.",
        "source_6": "Borra, C., Iacovou, M., & Sevilla, A. (2015). New evidence on breastfeeding and postpartum depression: The importance of breastfeeding intentions (Journal of Health Economics): Using longitudinal UK data, the authors find that breastfeeding is associated with lower postpartum depression risk when it aligns with maternal intentions, whereas discordance (intending to breastfeed but being unable to, or being pressured to breastfeed against preference) is associated with higher depression risk. This highlights potential mental health harms of making breastfeeding compulsory."
    }
}