{
    "question": "Should the Church of England be separated from the British state?",
    "content": {
        "source_1": "House of Lords Library – “Lords Spiritual” (UK Parliament, explainer/briefing). Explains that 26 Church of England bishops (the Lords Spiritual) hold automatic seats in the House of Lords and participate in lawmaking, a constitutional privilege unique to one denomination. This is central to arguments that establishment grants unequal political influence to a specific church. https://lordslibrary.parliament.uk",
        "source_2": "Office for National Statistics – “Religion, England and Wales: Census 2021” (Nov 2022). Reports that Christians are now 46.2% of the population in England and Wales, while “No religion” rose to 37.2%, highlighting a more secular and religiously diverse society than when establishment was formed—used to argue that a state church is misaligned with current demographics. https://www.ons.gov.uk/peoplepopulationandcommunity/culturalidentity/religion/bulletins/religionenglandandwales/census2021",
        "source_3": "National Secular Society – Campaign: Disestablish the Church of England. Argues that constitutional separation is needed for state neutrality and equal citizenship, including ending the bishops’ automatic seats in the Lords and removing Anglican privilege in public life; frames disestablishment as a fairness and human-rights-consistent reform. https://www.secularism.org.uk",
        "source_4": "Church of England – “Lords Spiritual”/Church in Parliament pages (official site). Sets out the Church’s case for establishment: bishops in the Lords contribute a non-partisan ethical and pastoral perspective, the parish system serves communities nationwide, and the Church’s public role supports the common good—used to argue against separation. https://www.churchofengland.org",
        "source_5": "Church in Wales – History of disestablishment (Welsh Church Act 1914; took effect 1920). Describes how the Church in Wales was disestablished within the UK constitutional framework, with property/financial settlements and removal of parliamentary privilege—cited to show that orderly disestablishment is feasible and has UK precedent. https://churchinwales.org.uk/en/about-us/history",
        "source_6": "European Court of Human Rights – Factsheet: Freedom of religion. Summarises case law indicating that state churches are not per se incompatible with the European Convention on Human Rights, provided individual rights are protected (e.g., Darby v. Sweden on church taxes). Used to argue that disestablishment is not legally required under human-rights law. https://www.echr.coe.int/documents/factsheets.xhtml"
    }
}