{
    "question": "Should the private education system be abolished?",
    "content": {
        "source_1": "OECD (2012), “Public and Private Schools: How management and funding relate to their socio-economic profile,” OECD Publishing. Finding: After accounting for students’ socio‑economic background, private schools do not systematically outperform public schools, and systems with a higher private-school share tend to exhibit greater socio‑economic segregation. Relevance: Supports claims that private schooling can exacerbate inequality without clear learning gains.",
        "source_2": "Hsieh, C.-T. & Urquiola, M. (2006), “The Effects of Generalized School Choice on Achievement and Stratification: Evidence from Chile,” Journal of Public Economics. Finding: Chile’s nationwide voucher reform increased sorting by ability and income and did not raise average test scores. Relevance: Case-study evidence that expanding private schooling can heighten stratification without improving achievement, bolstering arguments for abolition.",
        "source_3": "Böhlmark, A. & Lindahl, M. (2015), “Independent Schools and Long-Run Educational Outcomes: Evidence from Sweden’s Large-Scale Voucher Reform,” Economica. Finding: Greater exposure to competition from independent (private) schools raised long-run outcomes (e.g., university attendance, earnings) with modest positive effects on test scores. Relevance: Suggests private-school competition can yield system-wide benefits, countering calls for abolition.",
        "source_4": "Muralidharan, K. & Sundararaman, V. (2015), “The Aggregate Effect of School Choice: Evidence from a Two-Stage Experiment in India,” Quarterly Journal of Economics. Finding: Vouchers enabling attendance at low-fee private schools produced similar or better learning in some subjects at substantially lower cost per pupil. Relevance: Indicates private schools can deliver cost-effective education, arguing against abolishing them, especially in low-resource settings.",
        "source_5": "United Nations, Universal Declaration of Human Rights (1948) Art. 26(3); International Covenant on Economic, Social and Cultural Rights (ICESCR) Art. 13(3) and CESCR General Comment No. 13 (1999). Finding: International human rights law recognizes parents’ liberty to choose schools other than those established by public authorities, provided minimum standards are met. Relevance: Abolishing private schools may conflict with recognized parental rights and freedom of education.",
        "source_6": "The Sutton Trust & Social Mobility Commission (2019), “Elitist Britain 2019.” Finding: Alumni of fee-charging private schools are vastly overrepresented in top positions across politics, media, law, and business relative to their small share of the population. Relevance: Evidence that private schooling entrenches elite reproduction and social inequality, supporting arguments for abolition."
    }
}