{
    "question": "Are sanctuary cities beneficial?",
    "content": {
        "source_1": "Hausman, David (2020), Proceedings of the National Academy of Sciences (PNAS) — Peer‑reviewed study analyzing jurisdictions with sanctuary policies found no statistically significant increase in violent or property crime after adoption, while deportations of people without serious criminal records declined, indicating public safety was not compromised as enforcement priorities shifted.",
        "source_2": "Major Cities Chiefs Association (2017), “Immigration Policy” Position Statement — Police chiefs from large U.S. departments argue that local involvement in civil immigration enforcement undermines trust, reduces crime reporting by victims and witnesses, and harms public safety; they support policies that limit such involvement to strengthen community cooperation.",
        "source_3": "Wong, Tom K. (2017), Center for American Progress & National Immigration Law Center, “The Effects of Sanctuary Policies on Crime and the Economy” — Comparative county‑level analysis reports that sanctuary counties tend to have stronger economic indicators (e.g., higher median household income, lower poverty and unemployment) than non‑sanctuary counties, suggesting potential economic benefits.",
        "source_4": "Lott, John R. Jr. (2018), Crime Prevention Research Center/SSRN, “Sanctuary Cities and Crime” — Working paper contends that sanctuary jurisdictions experience increases in certain violent crimes (e.g., homicide, rape) relative to comparable non‑sanctuary areas after adopting such policies, arguing they harm public safety; findings are contested by other researchers.",
        "source_5": "Federation for American Immigration Reform (FAIR) (2023), “The Fiscal Burden of Illegal Immigration on U.S. Taxpayers” — Estimates substantial state and local costs associated with unauthorized immigration and argues that sanctuary policies attract and retain unauthorized residents, thereby increasing fiscal burdens on public services in sanctuary jurisdictions.",
        "source_6": "City of Philadelphia v. Attorney General of the United States, 916 F.3d 276 (3d Cir. 2019) — Federal appellate court held the DOJ lacked authority to condition Byrne JAG law‑enforcement grants on immigration‑enforcement cooperation, reducing the threat of losing key federal funds and supporting the viability of sanctuary policies from a fiscal and governance standpoint."
    }
}