{
    "question": "Should safe sex be promoted through education at schools?",
    "content": {
        "source_1": "UNESCO (2018). International Technical Guidance on Sexuality Education. Synthesizes global evidence that age-appropriate, comprehensive sexuality education improves knowledge and condom/contraceptive use, can delay sexual initiation, and does not increase sexual activity or risk-taking among adolescents.",
        "source_2": "Oringanje et al. (2016). Interventions for preventing unintended pregnancies among adolescents (Cochrane Review). Finds that education-only, school-based programs showed little or no impact on adolescent pregnancy; multi-component approaches that also improve access to contraception are more effective—cautioning that education alone may be insufficient.",
        "source_3": "Jemmott, J.B., Jemmott, L.S., & Fong, G.T. (2010). Efficacy of a theory-based abstinence-only intervention over 24 months (Archives of Pediatrics & Adolescent Medicine). Randomized trial showing an abstinence-only program reduced sexual initiation without decreasing condom use among those who became sexually active—supporting an abstinence-focused school approach.",
        "source_4": "Blake, S.M., et al. (2003). Condom availability programs in Massachusetts high schools: relationships with condom use and sexual behavior (Archives of Pediatrics & Adolescent Medicine). Schools with condom-availability programs reported higher condom use among sexually active students without increases in sexual initiation or number of partners—supporting school-based harm reduction.",
        "source_5": "Proulx, C.N., et al. (2019). Associations of LGBTQ-inclusive sex education with mental health, victimization, and sexual health outcomes (Journal of Adolescent Health). State-level and school-level LGBTQ-inclusive curricula were associated with lower school-based victimization and improved sexual health indicators among sexual minority youth—arguing that inclusive school sex education addresses inequities and safety.",
        "source_6": "Heritage Foundation (various briefs, e.g., 2018–2020). Policy analyses critical of comprehensive sex education. Argues school-based CSE can conflict with family values, should be opt-in, and that abstinence-centered education better aligns with parental rights and moral development—presenting a values-based critique of promoting safe sex education in schools."
    }
}