{
    "question": "Should children have the right to vote in elections?",
    "content": {
        "source_1": "Steinberg, Laurence (2013). The Age of Opportunity: Lessons from the New Science of Adolescence. Basic Books. Developmental psychology and neuroscience syntheses indicate that by about age 16 adolescents have adult-like “cold” cognitive capacities (reasoned, deliberative decision-making), suggesting they can make reflective choices such as voting; the main immaturities persist in “hot” contexts (impulsivity, peer pressure), which are less relevant to secret-ballot elections.",
        "source_2": "Zeglovits, Eva; Aichholzer, Julian (2014). Are people at 16 as politically mature as at 18? Electoral Studies, 33, 321–331. Using Austria’s nationwide voting age of 16, the study finds that 16–17-year-olds’ quality of vote choice (e.g., ideological congruence) is on par with older cohorts when controlling for education and interest, undermining claims that their participation would be uninformed or erratic.",
        "source_3": "Delli Carpini, Michael X.; Keeter, Scott (1996). What Americans Know about Politics and Why It Matters. Yale University Press. Foundational evidence that political knowledge is generally lower among younger people and rises with age and education; critics of child suffrage use this to argue that extending the vote to minors would expand a less-informed electorate and could reduce decision quality.",
        "source_4": "United Nations Committee on the Rights of the Child (2009). General Comment No. 12: The right of the child to be heard. Interprets Article 12 of the UN Convention on the Rights of the Child to require that children’s views be given due weight in all matters affecting them; while not mandating voting rights, it provides a rights-based rationale that democratic systems should institutionalize children’s voice in decisions (including via the franchise).",
        "source_5": "Jennings, M. Kent; Niemi, Richard G. (1968). The Transmission of Political Values from Parent to Child. American Political Science Review, 62(1), 169–184. Classic evidence of strong intergenerational alignment in political attitudes; opponents of lowering the voting age argue this implies children’s votes may effectively duplicate parents’ preferences, raising concerns about independence and undue family influence.",
        "source_6": "FairVote (2013). Takoma Park’s First Election with 16- and 17-Year-Old Voting. FairVote report. A U.S. municipal case study showing administrative feasibility of enfranchising 16–17-year-olds for local elections and indicating these new voters participated at rates comparable to or higher than older first-time voters, suggesting early enfranchisement can foster engagement without major logistical problems."
    }
}