{
    "question": "Is Julian Assange a journalist?",
    "content": {
        "source_1": "Walkley Foundation, “WikiLeaks wins 2011 Walkley Award for Most Outstanding Contribution to Journalism” (Nov 2011) — Australia’s premier journalism awards recognized WikiLeaks’ work as a significant journalistic contribution, implicitly treating Assange, as its founder and editor-in-chief, as engaged in journalism.",
        "source_2": "Committee to Protect Journalists (CPJ), “Why CPJ didn’t include Julian Assange on its annual prison census” (Dec 2019) — CPJ explained it did not classify Assange as a journalist for its methodology at the time, distinguishing WikiLeaks’ activities from CPJ’s criteria for journalism, even while warning that prosecuting him under the Espionage Act could endanger press freedom.",
        "source_3": "U.S. Department of Justice, “WikiLeaks Founder Charged in 18-Count Superseding Indictment” (June 24, 2020) — DOJ frames Assange’s conduct as criminal (including conspiracy to obtain classified information and publishing unredacted names), arguing it goes beyond lawful newsgathering, implying he should not be treated as a journalist.",
        "source_4": "The New York Times, The Guardian, Le Monde, Der Spiegel, and El País, “Publishing is Not a Crime” joint letter (Nov 28, 2022) — Five major outlets that partnered with WikiLeaks argued that obtaining and publishing sensitive information is a core journalistic activity and called on the U.S. to drop charges against Assange.",
        "source_5": "UN Office of the High Commissioner for Human Rights, statement by UN Special Rapporteur on torture Nils Melzer, “UN expert says ‘collective persecution’ of Julian Assange must end” (May 31, 2019) — The UN expert warned that the case risks criminalizing investigative journalism and “shooting the messenger,” treating Assange’s disclosures as journalistic in nature.",
        "source_6": "Bill Keller, “Dealing With Assange and the WikiLeaks Secrets,” The New York Times Magazine (Jan 2011) — The former NYT executive editor, who worked with WikiLeaks on the cables, wrote that he regarded Assange as a source rather than a journalist or partner, challenging the idea that Assange fits within traditional journalism."
    }
}