{
    "question": "Should standardized tests for university admission be abolished?",
    "content": {
        "source_1": "Hiss, W., & Franks, V. (2014). Defining Promise: Optional Standardized Testing Policies in American College and University Admissions. National Association for College Admission Counseling (NACAC). - Across 33 test-optional institutions and 123,000+ students, non-submitters had college GPAs and graduation rates comparable to submitters, while test-optional policies modestly increased enrollment of first-generation, low-income, and underrepresented minority students. Evidence supports the feasibility of abolishing tests without harming outcomes. (https://www.nacacnet.org/globalassets/documents/publications/research/defining-promise.pdf)",
        "source_2": "Allensworth, E. M., & Clark, K. (2020). High School GPAs and ACT Scores as Predictors of College Completion: Examining Assumptions About Consistency Across High Schools. UChicago Consortium on School Research. - Using a large sample of Chicago Public Schools graduates, high school GPA was far more predictive of college graduation than ACT scores, and this held across high schools and student groups. Suggests standardized tests add limited value compared to sustained classroom performance. (https://consortium.uchicago.edu/publications/high-school-gpas-and-act-scores-predictors-college-completion)",
        "source_3": "University of California Academic Council Standardized Testing Task Force (STTF). (2020). Standardized Testing in UC Admissions. - UC’s faculty task force found SAT/ACT scores add substantial incremental validity beyond high school GPA in predicting first-year GPA and retention, and can help identify high-achieving students from disadvantaged schools. It recommended retaining tests until an improved alternative was developed. (https://senate.universityofcalifornia.edu/_files/committees/sttf/sttf-report.pdf)",
        "source_4": "Sackett, P. R., Kuncel, N. R., Arneson, J. J., Cooper, S. R., & Waters, S. D. (2009). Socioeconomic Status and the Relationship Between the SAT and Freshman GPA: An Analysis of Data From 41 Colleges and Universities. Review of Educational Research, 79(3), 1302–1320. - The SAT’s validity for predicting freshman GPA was similar across socioeconomic groups, countering claims that the test is substantively less valid for low-SES students; SAT also added predictive power beyond GPA. This argues against abolishing tests on fairness/validity grounds. (https://journals.sagepub.com/doi/10.3102/0034654309333067)",
        "source_5": "Chetty, R., Friedman, J. N., Kraft-Todd, G., Manduca, R., & Nellen, S. (2023). Diversifying Society’s Leaders? The Determinants of Admission to Highly Selective Colleges. NBER Working Paper No. 31401, Opportunity Insights. - Test scores are strong predictors of admissions and later-life outcomes (leadership positions, earnings). Simulations indicate admissions that rely more on academic achievement (including tests) would increase low-income representation relative to systems emphasizing non-academic preferences. Removing tests could reduce transparent, scalable merit signals. (https://www.nber.org/papers/w31401 ; https://opportunityinsights.org/paper/diversifying/)",
        "source_6": "Geiser, S. (2020). The Case for Eliminating the SAT and ACT at the University of California. Research & Occasional Paper Series, Center for Studies in Higher Education (CSHE), UC Berkeley. - Analyzing UC data, Geiser finds SAT/ACT scores are strongly correlated with family income and race/ethnicity and add little beyond high school grades for predicting UC outcomes; he argues eliminating tests would improve equity without sacrificing academic performance, supporting abolition. (https://cshe.berkeley.edu/publications/case-eliminating-satact-university-california-saul-geiser-2020)"
    }
}