{
    "question": "Should positive discrimination be used to put more women in parliament?",
    "content": {
        "source_1": "Inter-Parliamentary Union (2021), “Women in parliament in 2020.” IPU’s global analysis shows that elections using legislated gender quotas or reserved seats consistently return significantly higher shares of women than elections without quotas, indicating quotas are an effective lever to increase women’s descriptive representation. https://www.ipu.org/resources/publications/reports/2021-03/women-in-parliament-2020",
        "source_2": "Beaman, Lori; Chattopadhyay, Raghabendra; Duflo, Esther; Pande, Rohini; Topalova, Petia (2009), “Powerful Women: Does Exposure Reduce Bias?” Quarterly Journal of Economics 124(4): 1497–1540. Randomized reservation of village council seats for women in India reduced gender bias among voters and raised girls’ aspirations and educational outcomes, suggesting positive discrimination can shift norms and build a long-term pipeline of female leaders. https://doi.org/10.1162/qjec.2009.124.4.1497",
        "source_3": "Matland, Richard E.; Studlar, Donley T. (1996), “The Contagion of Women Candidates in Single-Member District and Proportional Representation Systems,” Legislative Studies Quarterly 21(2): 199–226. Cross-national evidence shows proportional representation systems and party list practices can yield higher women’s representation even without mandatory quotas, indicating alternative institutional reforms can be effective. https://www.jstor.org/stable/440183",
        "source_4": "Franceschet, Susan; Piscopo, Jennifer M. (2008), “Gender Quotas and Women’s Substantive Representation: Lessons from Argentina,” Politics & Gender 4(3): 393–425. After Argentina’s quota law increased the number of female legislators, women were often steered to less powerful committees and faced barriers to policy influence, implying quotas alone may raise numbers without ensuring substantive power. https://doi.org/10.1017/S1743923X08000341",
        "source_5": "Besley, Timothy; Folke, Olle; Persson, Torsten; Rickne, Johanna (2017), “Gender Quotas and the Crisis of the Mediocre Man: Theory and Evidence from Sweden,” American Economic Review 107(8): 2204–2242. A zipper-style party quota increased overall competence by displacing lower-performing men without lowering women’s quality, countering the merit-based objection to positive discrimination. https://doi.org/10.1257/aer.20152111",
        "source_6": "Conseil constitutionnel (France) (1982), Décision n° 82-146 DC du 18 novembre 1982. France’s top court struck down a gender quota for municipal elections as unconstitutional until a 1999 constitutional amendment enabled parity laws, highlighting legal and constitutional constraints that challenge the claim that quotas “must” be used. https://www.conseil-constitutionnel.fr/decision/1982/82146dc_453dcq.htm"
    }
}