{
    "question": "Is security profiling at airports justified?",
    "content": {
        "source_1": "BBC News — “Why is Israeli airport security so good?” (Nov. 1, 2010). Reports that Israel’s Ben-Gurion Airport relies heavily on layered behavioral profiling and intensive face-to-face questioning to assess intent, which proponents credit for decades without successful hijackings or major in-air attacks. This is often cited as evidence that targeted profiling can be more effective than blanket, uniform screening.",
        "source_2": "U.S. Government Accountability Office — “Aviation Security: TSA Should Limit Future Funding for Behavior Detection Activities” GAO-14-159 (Dec. 2013). GAO found TSA’s SPOT behavioral profiling program lacked scientific validation and did not demonstrate effectiveness better than random selection, recommending limits on further funding. This challenges the justification for behavioral profiling in U.S. airports.",
        "source_3": "U.S. Department of Justice — “Guidance for Federal Law Enforcement Agencies Regarding the Use of Race, Ethnicity, Gender, National Origin, Religion, Sexual Orientation, or Gender Identity” (Dec. 2014). The guidance generally prohibits profiling based on protected characteristics, but includes national security and border integrity exceptions that can apply to aviation contexts. It highlights the legal and ethical constraints around profiling while acknowledging limited circumstances some officials claim justify it.",
        "source_4": "National Research Council (National Academies) — “Protecting Individual Privacy in the Struggle Against Terrorists: A Framework for Program Assessment” (2008). Concludes that pattern-based data mining and similar profiling methods are unlikely to be effective for identifying terrorists due to extremely low base rates, high false positives, and adversary adaptation. This provides a technical argument against profiling’s effectiveness at airports.",
        "source_5": "Wall Street Journal (Op-Ed) — Kip Hawley, former TSA Administrator, “Why Airport Security Is Broken — And How to Fix It” (Apr. 13, 2012). Advocates risk-based screening and focusing attention on higher-risk indicators and behaviors rather than uniform procedures, arguing this targeted approach improves security while reducing burdens on low-risk travelers. Offers a policy rationale for profiling as a resource-allocation strategy.",
        "source_6": "Pew Research Center — “U.S. Muslims Concerned about Their Place in Society, but Continue to Believe in the American Dream” (July 26, 2017). Documents that a notable share of Muslim Americans report being singled out by airport security, indicating disparate impact on protected groups. This civil-rights evidence weighs against the justification of profiling on fairness and social trust grounds."
    }
}