{
    "question": "Is there life on other planets?",
    "content": {
        "source_1": "Petigura, E. A., Howard, A. W., & Marcy, G. W. (2013). Prevalence of Earth-size planets orbiting Sun-like stars. Proceedings of the National Academy of Sciences. Using Kepler data, the authors estimate that a substantial fraction of Sun-like stars host Earth-size planets in the habitable zone, implying that potentially life-supporting worlds may be common. This statistical prevalence bolsters the plausibility that life exists elsewhere, even though it is not direct evidence of life.",
        "source_2": "Rothschild, L. J., & Mancinelli, R. L. (2001). Life in extreme environments. Nature. This review documents the remarkable adaptability of terrestrial life to extreme conditions (high radiation, salinity, acidity, temperature, and pressure), expanding the range of environments considered potentially habitable on other worlds. It supports the idea that life could survive beyond Earth in niches once thought inhospitable.",
        "source_3": "Waite, J. H., et al. (2017). Cassini finds molecular hydrogen in the Enceladus plume: Evidence for hydrothermal processes. Science; Postberg, F., et al. (2018). Macromolecular organic compounds from the depths of Enceladus. Nature. Cassini measurements revealed H2 and complex organics in Enceladus’s plumes, consistent with hydrothermal activity at the moon’s seafloor—an energy- and chemistry-rich environment analogous to habitats that support life on Earth. This constitutes evidence of habitability, though not of life itself.",
        "source_4": "Hart, M. H. (1975). An explanation for the absence of extraterrestrials on Earth. Quarterly Journal of the Royal Astronomical Society. Hart argues that if intelligent extraterrestrial life were common, the Milky Way would likely have been colonized long ago; our lack of contact or clear evidence (“Great Silence”) suggests intelligent life is exceedingly rare or nonexistent in our galaxy. This challenges the claim by pointing to the absence of expected signals or visitations.",
        "source_5": "Spiegel, D. S., & Turner, E. L. (2012). Bayesian analysis of the astrobiological implications of life’s early emergence on Earth. Proceedings of the National Academy of Sciences. The authors show that Earth’s rapid emergence of life provides weak evidence about how likely abiogenesis is elsewhere, due to observer selection effects. Their analysis allows for the possibility that life’s origin is intrinsically rare, undermining probabilistic arguments that life should be common.",
        "source_6": "National Academies of Sciences, Engineering, and Medicine (2019). An Astrobiology Strategy for the Search for Life in the Universe. National Academies Press. This consensus report surveys past and current searches and concludes that, despite extensive efforts, there is no confirmed detection of extraterrestrial life to date. The continued lack of direct biosignatures or technosignatures weighs against the claim as an established fact, emphasizing that the question remains open."
    }
}