{
    "question": "Is it acceptable to conduct random drug testing in schools?",
    "content": {
        "source_1": "U.S. Supreme Court, Board of Education v. Earls, 536 U.S. 822 (2002). The Court upheld suspicionless random drug testing for students in extracurricular activities, reasoning that the government’s interest in preventing drug use among students and the reduced expectation of privacy in school settings outweighed the intrusion—supporting the view that such testing can be permissible.",
        "source_2": "Office of National Drug Control Policy (ONDCP), “What You Need to Know About Drug Testing in Schools” (fact sheet/toolkit). ONDCP argues that random student drug testing can deter use and help students resist peer pressure when implemented as part of a broader prevention strategy, offering program design guidance and citing schools reporting reductions among tested groups—supportive of testing as a prevention tool.",
        "source_3": "Terry-McElrath, Y. M., O’Malley, P. M., & Johnston, L. D. (2011). “School drug testing and student illicit drug use: A national study.” Journal of Adolescent Health, 48(6), 647–655. Using nationally representative data, the study found no association between drug testing and lower overall drug use; it also noted potential substitution away from marijuana toward drugs less detectable by urine tests—evidence challenging the effectiveness of random testing.",
        "source_4": "American Academy of Pediatrics, Committee on Substance Use and Prevention. “Testing for Drugs of Abuse in Children and Adolescents” (Pediatrics, 2014; reaffirmed/updated thereafter). The AAP discourages school-based random drug testing due to limited evidence of benefit, risks of false positives/negatives, privacy concerns, and potential harm to the student–school relationship, recommending validated screening and counseling instead—medical/ethical opposition.",
        "source_5": "Washington State Supreme Court, York v. Wahkiakum School District No. 200, 163 Wn.2d 297 (2008). The court held that suspicionless random drug testing of student athletes violates Washington’s state constitutional privacy protections, illustrating that even if federally permissible, such testing may be unlawful under some state constitutions—legal constraint countering a blanket “it is fine” claim."
    }
}