{
    "question": "Should we support Scottish independence?",
    "content": {
        "source_1": "Electoral Commission — EU Referendum Results (2016): Scotland voted 62% Remain, 38% Leave, diverging sharply from the UK-wide Leave outcome. Pro-independence advocates cite this “democratic deficit” and argue independence would allow Scotland to realign with EU membership and preferences.",
        "source_2": "Institute for Fiscal Studies (IFS) — Analysis of GERS 2022–23 (Aug 2023): IFS notes Scotland’s notional fiscal deficit remained large (around 9% of GDP even after higher oil revenues), implying that independence would require substantial tax rises and/or spending cuts to reach a sustainable fiscal path.",
        "source_3": "Scottish Government — Export Statistics Scotland (latest pre- and post-pandemic releases): The rest of the UK accounts for roughly 60% of Scottish exports, far outweighing the EU share. Opponents argue that independence—especially if paired with EU accession—would create a new trade border with the rUK, increasing frictions and costs.",
        "source_4": "Crown Estate Scotland — ScotWind Leasing Results (Jan 2022): Awards totaling about 25 GW of offshore wind capacity position Scotland as a major future renewable energy exporter. Proponents contend this resource base strengthens the economic case for independence and a green industrial strategy.",
        "source_5": "UK Supreme Court — Reference by the Lord Advocate [2022] UKSC 31 (Nov 2022): The Court held that the Scottish Parliament lacks competence to legislate for an independence referendum without UK consent, highlighting significant legal and procedural barriers to achieving independence in practice.",
        "source_6": "ScotCen/What Scotland Thinks — Polling Tracker on Independence (2020–2024): Aggregated polls show a persistently divided electorate with support for Yes and No often near 50–50 and no sustained majority for independence, suggesting limited consensus for the claim that independence must be supported."
    }
}