{
    "question": "Should individuals who have committed atrocities in the Syrian Civil War be investigated by the ICC?",
    "content": {
        "source_1": "UN Human Rights Council, Independent International Commission of Inquiry on the Syrian Arab Republic, Report A/HRC/25/65 (12 Feb 2014). Documents widespread war crimes and crimes against humanity by multiple parties and explicitly recommends that the UN Security Council refer the situation in Syria to the ICC due to the gravity of crimes and pervasive impunity.",
        "source_2": "International Criminal Court, “How the Court Works” and “States Parties to the Rome Statute” (ICC official website, accessed 2025). Explains that the ICC generally only has jurisdiction over crimes committed on the territory of, or by nationals of, States Parties, or via UN Security Council referral; Syria is not a State Party, highlighting a core legal barrier to ICC investigations absent a referral or ad hoc acceptance.",
        "source_3": "BBC News, “Syria: German court jails ex-intelligence officer for life for crimes against humanity” (13 Jan 2022). Reports the Koblenz (Germany) conviction of former Syrian intelligence officer Anwar R. under universal jurisdiction, showing that robust accountability for Syrian atrocities can proceed in national courts even without ICC involvement.",
        "source_4": "UN Security Council, Official Records, S/PV.7180 (22 May 2014) — Explanations of vote on draft resolution to refer Syria to the ICC. The Russian Federation (joined by China in vetoing) argued an ICC referral would be selective, politicized, and risk undermining a negotiated political solution, reflecting a perspective against ICC involvement in the Syrian context.",
        "source_5": "Human Rights Watch, “Syria: Security Council Should Refer to ICC” (14 May 2014). Urges an ICC referral on the grounds that Syrian authorities and armed groups have committed mass atrocities with impunity, that domestic courts cannot deliver credible justice, and that ICC action could help deter further crimes and vindicate victims’ rights.",
        "source_6": "UN General Assembly Resolution 71/248 (21 Dec 2016) establishing the International, Impartial and Independent Mechanism (IIIM) for Syria. Creates an alternative accountability mechanism to collect, preserve, and prepare evidence for prosecutions in national or international courts, reflecting a pragmatic turn to non-ICC avenues due to political deadlock over an ICC referral."
    }
}