{
    "question": "Should people become vegetarian?",
    "content": {
        "source_1": "Dinu, M., Abbate, R., Gensini, G.F., Casini, A., Sofi, F. (2017). Vegetarian, vegan diets and multiple health outcomes: a systematic review with meta-analysis of observational studies. Critical Reviews in Food Science and Nutrition. Finds vegetarian/vegan patterns are associated with lower ischemic heart disease and type 2 diabetes risk, and improved cardiometabolic markers. Supports the claim on health grounds. DOI: 10.1080/10408398.2017.1317627",
        "source_2": "Poore, J., Nemecek, T. (2018). Reducing food’s environmental impacts through producers and consumers. Science. Quantifies that animal-sourced foods use most farmland and generate a large share of food-system greenhouse gases; shifting to plant-based diets can substantially cut emissions, land, and water use. Supports the claim on environmental grounds. DOI: 10.1126/science.aaq0216",
        "source_3": "Tong, T.Y.N., Appleby, P.N., Bradbury, K.E., et al. (2019). Risks of ischaemic heart disease and stroke in meat eaters, fish eaters, and vegetarians over 18 years of follow-up: results from the EPIC-Oxford study. BMJ, 366:l4897. Vegetarians had lower ischemic heart disease risk but higher hemorrhagic stroke risk versus meat eaters (with small absolute differences), indicating trade-offs and the need for careful diet planning. Challenges a simple “everyone should be vegetarian” conclusion. DOI: 10.1136/bmj.l4897",
        "source_4": "Iannotti, L.L., Lutter, C.K., Stewart, C.P., et al. (2017). Eggs in Early Complementary Feeding and Child Growth: A Randomized Controlled Trial. Pediatrics. Providing one egg per day to young children in Ecuador improved linear growth and reduced stunting, highlighting the role of animal-source foods in addressing undernutrition in low-resource settings. Challenges universal vegetarian recommendations in contexts of child malnutrition. DOI: 10.1542/peds.2016-3459",
        "source_5": "Stanley, P.L., Rowntree, J.E., Beede, D.K., DeLonge, M.S., Hamm, M.W. (2018). Impacts of soil carbon sequestration on life cycle greenhouse gas emissions in Midwestern USA beef finishing systems. Agricultural Systems. Reports that adaptive multi-paddock grazing can increase soil carbon sequestration enough to offset or substantially reduce beef system emissions. Challenges the claim from an environmental-management perspective by suggesting some livestock systems can be climate-compatible. https://www.sciencedirect.com/science/article/pii/S0308521X1830022X",
        "source_6": "Low, P., et al. (2012). The Cambridge Declaration on Consciousness. A panel of neuroscientists concluded many non-human animals possess the neurological substrates of consciousness and can experience affective states, reinforcing ethical arguments to reduce animal suffering through avoiding animal foods. Supports the claim on animal-welfare grounds. http://fcmconference.org/img/CambridgeDeclarationOnConsciousness.pdf"
    }
}