{
    "question": "Should a fat tax be implemented?",
    "content": {
        "source_1": "Hooper L, Martin N, Jimoh OF, Kirk C, Foster E, Abdelhamid AS. Reduction in saturated fat intake for cardiovascular disease. Cochrane Database of Systematic Reviews, 2020; CD011737. Finding: Across randomized trials, reducing saturated fat intake for at least two years leads to a small but important reduction in cardiovascular events (no clear effect on total mortality), supporting policies that lower population saturated fat consumption.",
        "source_2": "World Health Organization. Fiscal policies for diet and the prevention of noncommunicable diseases: Technical meeting report. WHO, 2016. Evidence: The report’s case study of Denmark’s 2011 saturated fat tax notes it was repealed within 15 months due to administrative burden, cross‑border shopping, and public opposition, with limited time to demonstrate health impact—highlighting design and implementation risks for a “fat tax.”",
        "source_3": "Batis C, Rivera JA, Popkin BM, Taillie LS. First-year evaluation of Mexico’s tax on nonessential energy-dense foods, 2014: observational study. PLOS Medicine, 2016. Result: Purchases of taxed high-calorie foods declined by about 5% overall in the first year and more among lower-income households, indicating that nutrition-focused food taxes can reduce purchases of targeted products.",
        "source_4": "Allcott H, Lockwood BB, Taubinsky D. Regressive Sin Taxes, with an Application to the Optimal Soda Tax. Quarterly Journal of Economics, 2019. Insight: Sin taxes are financially regressive, but when accounting for health benefits and internalities—and if revenues are recycled to benefit low-income groups—net welfare effects can be progressive; absent such measures, a fat tax may disproportionately burden poorer households.",
        "source_5": "Chowdhury R, Warnakula S, Kunutsor S, et al. Association of dietary, circulating, and supplement fatty acids with coronary risk: a systematic review and meta-analysis. Annals of Internal Medicine, 2014;160(6):398–406. Conclusion: This review found no significant association between saturated fat intake and coronary heart disease, casting doubt on the health rationale for specifically taxing saturated fat."
    }
}