{
    "question": "Should the words \"under God\" be removed from the American Pledge of Allegiance?",
    "content": {
        "source_1": "Dwight D. Eisenhower, “Statement by the President Upon Signing Bill To Include the Words ‘Under God’ in the Pledge to the Flag” (June 14, 1954) — Explains that “under God” was added by Congress in 1954 and signed by President Eisenhower to underscore a spiritual distinction from “the atheistic communism” of the time. This shows the phrase is a mid-20th-century, Cold War-era addition rather than part of the original pledge. Source: The American Presidency Project (UCSB), https://www.presidency.ucsb.edu/documents/statement-the-president-upon-signing-bill-include-the-words-under-god-the-pledge-the-flag",
        "source_2": "Library of Congress, “Pledge of Allegiance: Primary Documents in American History” — Documents the pledge’s origin in 1892 by Francis Bellamy without the words “under God,” and traces subsequent changes. This historical record supports the perspective that removing “under God” would restore the pledge to its original, religiously neutral form. Source: https://guides.loc.gov/pledge-of-allegiance",
        "source_3": "Newdow v. U.S. Congress, 328 F.3d 466 (9th Cir. 2003) — The Ninth Circuit held that teacher-led recitation of the pledge with “under God” in public schools violated the Establishment Clause, viewing it as an endorsement of religion that coerces participation by students from non-theistic families. This ruling supports removing the phrase to maintain constitutional neutrality in schools. Source: https://law.justia.com/cases/federal/appellate-courts/F3/328/466/",
        "source_4": "Elk Grove Unified School District v. Newdow, 542 U.S. 1 (2004) — The U.S. Supreme Court vacated the Ninth Circuit’s decision on standing grounds and did not decide the constitutionality of “under God.” Some concurrences discussed “ceremonial deism,” suggesting the phrase can be seen as historical and ceremonial rather than devotional. This leaves the legal question unresolved at the highest level and provides a perspective for retaining the phrase. Source: https://supreme.justia.com/cases/federal/us/542/1/",
        "source_5": "Newdow v. Rio Linda Union School District, 597 F.3d 1007 (9th Cir. 2010) — The Ninth Circuit later upheld the pledge’s current wording, characterizing “under God” as a predominantly patriotic and ceremonial acknowledgment rather than a prayer, and thus not an Establishment Clause violation. This supports keeping the phrase. Source: https://law.justia.com/cases/federal/appellate-courts/F3/597/1007/",
        "source_6": "West Virginia State Board of Education v. Barnette, 319 U.S. 624 (1943) — The Supreme Court held that students cannot be compelled to salute the flag or recite the pledge. This precedent provides a counterargument to removal: because recitation is voluntary, dissenters are protected without altering the pledge’s text. Source: https://supreme.justia.com/cases/federal/us/319/624/"
    }
}