{
    "question": "Should physical chastisement of children be illegal?",
    "content": {
        "source_1": "American Academy of Pediatrics (2018). Effective Discipline to Raise Healthy Children (Policy Statement). Pediatrics, 142(6):e20183112. Evidence: Synthesizes longitudinal research showing physical punishment is associated with increased aggression, externalizing problems, and poorer mental health, and is ineffective at improving long-term compliance; recommends non-violent discipline. https://publications.aap.org/pediatrics/article/142/6/e20183112/37160",
        "source_2": "Elgar, F. J., et al. (2018). Corporal punishment bans and physical fighting in adolescents: a cross-national study. BMJ Open, 8(6):e021616. Evidence: In countries with full legal bans, adolescents report significantly lower rates of frequent physical fighting (especially among girls), suggesting bans may correspond to reductions in youth violence at the population level. https://bmjopen.bmj.com/content/8/6/e021616",
        "source_3": "UN Committee on the Rights of the Child (2006). General Comment No. 8: The right of the child to protection from corporal punishment and other cruel or degrading forms of punishment (CRC/C/GC/8). Evidence: Interprets the Convention on the Rights of the Child to require prohibition of all corporal punishment in every setting, framing it as a violation of dignity and physical integrity. https://www.refworld.org/docid/460bc7772.html",
        "source_4": "Baumrind, D., Larzelere, R. E., & Cowan, P. A. (2002). Ordinary physical punishment: Is it harmful? Psychological Bulletin, 128(4), 580–589. Evidence: Argues that mild, nonabusive spanking used infrequently within warm, authoritative parenting is not reliably linked to adverse developmental outcomes and may be effective for immediate compliance—cautioning against equating all physical discipline with abuse. https://psycnet.apa.org/record/2002-15403-003",
        "source_5": "Ingraham v. Wright, 430 U.S. 651 (1977). Evidence: The U.S. Supreme Court held that corporal punishment in public schools does not violate the Eighth Amendment and that existing common-law remedies satisfy due process, reflecting a longstanding legal acceptance of physical discipline and raising questions about blanket criminal bans. https://supreme.justia.com/cases/federal/us/430/651/",
        "source_6": "New Zealand Police (2010). Review of Police Activity Following Enactment of the Crimes (Substituted Section 59) Amendment Act 2007. Evidence: Post-ban monitoring found few prosecutions for minor smacking and an emphasis on warnings and referrals, suggesting prohibition can be implemented without widespread criminalization of parents. https://www.police.govt.nz/about-us/publication/review-police-activity-following-enactment-crimes-substituted-section-59"
    }
}