{
    "question": "Should a common EU foreign policy be favored?",
    "content": {
        "source_1": "Council of the European Union — “EU restrictive measures against Russia explained” (regularly updated, 2024) — https://www.consilium.europa.eu/en/policies/sanctions/restrictive-measures-against-russia-over-ukraine/ — Evidence that when EU members act together, they can deploy one of the world’s most comprehensive sanctions regimes, amplifying Europe’s global leverage; supports favoring a common EU foreign policy to deliver scale and speed.",
        "source_2": "Euractiv — “Small countries push back against ditching unanimity in EU foreign policy” (2023) — https://www.euractiv.com — Reports that several smaller member states resist moving to qualified majority voting in foreign and security policy, arguing unanimity safeguards sovereignty and ensures their vital interests cannot be overridden by larger states; challenges the case for a stronger centralized EU foreign policy.",
        "source_3": "European Parliamentary Research Service (EPRS) — “Common Foreign and Security Policy: Decision-making rules and practices” (2023) — https://epthinktank.eu — Reviews past episodes such as the EU split over the 2003 Iraq War, showing how disunity undermined EU credibility and influence; used to argue that a more common EU foreign policy framework could prevent damaging divisions.",
        "source_4": "NATO — Remarks by the NATO Secretary General on EU-NATO cooperation (2023) — https://www.nato.int — Emphasizes that EU defense/foreign policy efforts must complement, not duplicate or replace, NATO; warns that pushing a common EU foreign and security policy too far could create redundancy and weaken transatlantic cohesion; casts doubt on favoring a fully centralized EU approach.",
        "source_5": "European Parliament — “Anti-Coercion Instrument: Parliament gives final green light” (2023) — https://www.europarl.europa.eu — Details adoption of an EU-wide tool to respond collectively to economic coercion, illustrating how common external instruments bolster the EU’s bargaining power and resilience in great-power competition; supports favoring a more common EU foreign policy.",
        "source_6": "European Council on Foreign Relations — EU Coalition Explorer 2023 (survey and analysis) — https://ecfr.eu/eucoalitionexplorer — Shows persistent divergences among member states on priorities toward China, Russia, and the neighborhood; suggests that forging a single common policy risks being brittle or unrepresentative, questioning the practicality of favoring a strongly centralized EU foreign policy."
    }
}