{
    "question": "Should the USA legal drinking age be lowered from 21 to 18?",
    "content": {
        "source_1": "National Highway Traffic Safety Administration (NHTSA). Lives Saved in 2017 by Restraint Use and Minimum Drinking Age Laws. Traffic Safety Facts Research Note, 2019. URL: https://crashstats.nhtsa.dot.gov/ (see “Lives Saved” series). Evidence: NHTSA estimates minimum legal drinking age (MLDA) 21 laws saved 31,959 lives from 1975–2017 by reducing alcohol-impaired driving deaths among youth—supporting keeping the age at 21.",
        "source_2": "Kypri, K., et al. Minimum Purchasing Age for Alcohol and Traffic Crash Injuries Among 15- to 19-Year-Olds in New Zealand. American Journal of Public Health, 96(1), 126–131, 2006. DOI: 10.2105/AJPH.2004.059204. Evidence: After New Zealand lowered its alcohol purchase age from 20 to 18 in 1999, alcohol-involved crash injuries increased among 18–19-year-olds and also among 15–17-year-olds, suggesting spillover effects—evidence against lowering the age.",
        "source_3": "Community Preventive Services Task Force (The Community Guide). Maintaining the Minimum Legal Drinking Age of 21. Updated review and recommendation. URL: https://www.thecommunityguide.org/findings/alcohol-excessive-consumption-maintaining-minimum-legal-drinking-age-21. Evidence: Systematic reviews conclude MLDA 21 reduces alcohol consumption and alcohol-related crashes, injuries, and fatalities among 18–20-year-olds; the Task Force recommends maintaining 21.",
        "source_4": "Miron, J. A., & Tetelbaum, E. Does the Minimum Legal Drinking Age Save Lives? Economic Inquiry, 47(2), 317–336, 2009. DOI: 10.1111/j.1465-7295.2008.00152.x. Evidence: Using U.S. panel data with controls for other policies and trends, the authors find the relationship between MLDA 21 and traffic fatalities is weak or not robust—casting doubt on the effectiveness of 21 and providing a basis for considering a lower age.",
        "source_5": "Carpenter, C., & Dobkin, C. The Effect of Alcohol Consumption on Mortality: Regression Discontinuity Evidence from the Minimum Drinking Age. Journal of Health Economics, 28(6), 1177–1187, 2009. DOI: 10.1016/j.jhealeco.2009.08.005. Evidence: At the 21st-birthday threshold, legal access to alcohol produces a sharp increase in alcohol consumption and an immediate jump in mortality (around 9%) from injuries and crashes—evidence some use to argue that a sudden access point at 21 may be riskier than earlier, more gradual or supervised access.",
        "source_6": "Amethyst Initiative (Statement by U.S. college and university presidents). Twenty-One Is Not Working. URL: http://www.amethystinitiative.org/statement/ Evidence: Signatories argue that MLDA 21 drives underage drinking underground, fosters unsafe binge behaviors, and call for exploring alternatives (e.g., education or licensing for 18–20-year-olds)—a perspective favoring reconsideration or lowering the age."
    }
}