{
    "question": "Was the Egyptian army right to depose Morsi?",
    "content": {
        "source_1": "New York Times (Nov. 22, 2012) — “Morsi Seizes New Powers, and Egypt Erupts in Protest.” Reports that President Morsi issued a constitutional decree placing his decisions beyond judicial review, triggering mass protests and accusations of authoritarian overreach. Evidence used by supporters of the ouster to argue the military intervened to halt democratic backsliding.",
        "source_2": "BBC News (July 3, 2013) — “Egypt crisis: Army ousts President Morsi.” Coverage of the military’s removal of Morsi after days of massive nationwide demonstrations and a 48-hour ultimatum; the army framed its move as responding to popular demand and preventing chaos. Evidence supporting the view that intervention was a response to an acute legitimacy and governance crisis.",
        "source_3": "Human Rights Watch (Aug. 2014) — “All According to Plan: The Rab’a Massacre and Mass Killings of Protesters in Egypt.” Documents that security forces killed at least 817 protesters in a single day in August 2013 and characterizes the killings as likely crimes against humanity. Evidence challenging the claim by linking the ouster to systematic, grave human rights abuses.",
        "source_4": "African Union Peace and Security Council Communiqué (July 5, 2013) — Decision to suspend Egypt from AU activities for an “unconstitutional change of government.” Provides a regional legal-normative judgment that the military removal violated continental standards, challenging the legitimacy of the ouster.",
        "source_5": "Freedom House, Freedom in the World 2014–2015 — Country reports for Egypt. Notes Egypt’s downgrade to “Not Free” following the military takeover, citing severe restrictions on political rights and civil liberties and broad repression of opposition. Evidence that the ouster led to democratic regression, challenging the idea that it was “right.”",
        "source_6": "Pew Research Center (2013–2014 surveys on Egypt) — Public opinion findings showing Egyptians were deeply divided over Morsi’s removal and the country’s direction, with substantial support for the military alongside significant opposition and rising disillusionment. Evidence that legitimacy of the ouster was contested among the public, complicating claims it was unequivocally right."
    }
}