{
    "question": "Should all countries have the right to pursue a nuclear defence?",
    "content": {
        "source_1": "UN Office for Disarmament Affairs (UNODA), “Treaty on the Non-Proliferation of Nuclear Weapons (NPT)” (1968). https://www.un.org/disarmament/wmd/nuclear/npt/ — Establishes that non–nuclear-weapon states agree not to acquire nuclear weapons (Articles I–II) and have only a “right” to peaceful nuclear energy (Article IV), directly challenging any universal right to pursue a nuclear defense.",
        "source_2": "International Court of Justice, “Legality of the Threat or Use of Nuclear Weapons” (Advisory Opinion, 1996). https://www.icj-cij.org/en/case/95 — Concludes that the threat or use of nuclear weapons would generally be contrary to international humanitarian law, while leaving narrow uncertainty in extreme self-defense when a state’s survival is at stake, highlighting legal ambiguity rather than a clear right.",
        "source_3": "Kenneth N. Waltz, “Why Iran Should Get the Bomb” (Foreign Affairs, 2012). https://www.foreignaffairs.com/articles/iran/2012-06-15/why-iran-should-get-bomb — Argues that nuclear acquisition can stabilize regions through deterrence and reduce war, implying that states should have the option to pursue nuclear defense for security balance.",
        "source_4": "Scott D. Sagan, “The Perils of Proliferation? Organizational Theory, Deterrence, and the Spread of Nuclear Weapons” (International Security, 1994/95). https://www.jstor.org/stable/2539197 — Shows that organizational flaws, accidents, and misperception make additional nuclear states dangerous and less reliably deterrent, undermining the case for a generalized right to nuclear defense.",
        "source_5": "John J. Mearsheimer, “The Case for a Ukrainian Nuclear Deterrent” (Foreign Affairs, 1993). https://www.foreignaffairs.com/articles/ukraine/1993-06-01/case-ukrainian-nuclear-deterrent — Contends that Ukraine needed its own nuclear deterrent to prevent future Russian aggression, offering a realpolitik argument that some states may require the capability for credible self-defense.",
        "source_6": "UN Office for Disarmament Affairs (UNODA), “Treaty on the Prohibition of Nuclear Weapons (TPNW)” (2017). https://www.un.org/disarmament/wmd/nuclear/tpnw/ — Creates a comprehensive ban for states parties on developing, testing, possessing, or threatening to use nuclear weapons, reflecting a growing legal-normative view that no state should have a right to pursue nuclear arms."
    }
}