{
    "question": "Should the law on self defence cover “grossly disproportionate” actions?",
    "content": {
        "source_1": "CPS Legal Guidance on Self-Defence (s.76 Criminal Justice and Immigration Act 2008, as amended by s.43 Crime and Courts Act 2013) — Sets the current UK rule for “householder cases”: force may be disproportionate yet still reasonable, but “grossly disproportionate” force is not reasonable. Establishes the legal boundary the claim proposes to remove, and the policy rationale for excluding grossly disproportionate responses.",
        "source_2": "European Court of Human Rights, McCann and Others v. United Kingdom (1995) and subsequent Article 2 jurisprudence — Article 2 (“right to life”) requires force be “absolutely necessary” and strictly proportionate when lethal outcomes are at issue. While directed at state use of force, the Court also imposes positive obligations on states to maintain legal frameworks protecting life, suggesting that authorizing “grossly disproportionate” private violence could conflict with human rights obligations.",
        "source_3": "Humphreys, Gasparrini, and Wiebe, “Evaluating the Impact of Florida’s ‘Stand Your Ground’ Law on Homicide and Suicide,” JAMA Internal Medicine (2017) — Found a 24% increase in overall homicides and a 32% increase in firearm homicides after Florida broadened self-defense protections. Empirical evidence that expanding self-defense leeway can increase lethal violence rather than deter crime, weighing against covering “grossly disproportionate” actions.",
        "source_4": "German Criminal Code (StGB) §33, “Excessive Self-Defence” (Notwehrexzess) — Provides that if someone exceeds the limits of self-defence due to confusion, fear, or terror, they are not punished. A comparative-law example supporting limited coverage of grossly disproportionate actions where human psychology under acute threat excuses excess.",
        "source_5": "R v Martin (Anthony) [2001] EWCA Crim 2245 — The farmer who shot a fleeing intruder was convicted, sparking sustained public debate that existing proportionality rules failed to protect householders under duress. Cited by advocates for expanding self-defence to shield severe responses by frightened victims confronting intruders.",
        "source_6": "Urban Institute (John K. Roman), “Race, Justifiable Homicide, and Stand Your Ground Laws” (2013) — Analysis of FBI data found killings of Black victims by white shooters were far more likely to be deemed justified, with disparities larger in Stand Your Ground states. Indicates broadened self-defence standards can exacerbate racial inequities, arguing against covering “grossly disproportionate” actions."
    }
}