{
    "question": "Should parents be held responsible for their school-going children's discipline problems?",
    "content": {
        "source_1": "Hoeve, M., Dubas, J. S., Gerris, J. R. M., van der Laan, P. H., & Smeenk, W. (2009). The relationship between parenting and delinquency: A meta-analysis. Journal of Abnormal Child Psychology. Finding: Low parental monitoring, harsh/inconsistent discipline, and rejection are significantly associated with youth delinquency, while warmth and involvement are protective. Implication: Supports holding parents responsible because parenting practices are robust predictors of behavior problems.",
        "source_2": "Dishion, T. J., & Tipsord, J. M. (2011). Peer contagion in child and adolescent social and emotional development. Annual Review of Psychology. Finding: Peer deviance training and school-based peer networks strongly drive aggression and conduct problems independent of family factors. Implication: Challenges the claim by showing peers and school context are major determinants, not just parental influence.",
        "source_3": "Cornell, D., & Limber, S. (2015). Law and policy on the concept of bullying at school. American Psychologist. Finding: Punitive policies that fine or criminalize parents for children’s bullying/truancy lack evidence of effectiveness and risk unintended harms; evidence favors school-based prevention and intervention. Implication: Argues against legally holding parents responsible for school discipline problems.",
        "source_4": "Augustine, C. H., Engberg, J., et al. (2018). Can restorative practices improve school climate and curb suspensions? RAND Corporation. Finding: Districtwide adoption of restorative practices in Pittsburgh reduced suspensions and improved school climate, especially in elementary grades, without relying on parental punishment. Implication: Shows schools can meaningfully reduce discipline problems through their own practices, suggesting responsibility is shared or school-centered.",
        "source_5": "Rhee, S. H., & Waldman, I. D. (2002). Genetic and environmental influences on antisocial behavior: A meta-analysis of twin and adoption studies. Psychological Bulletin. Finding: Antisocial behavior shows substantial heritability alongside nonshared environmental effects. Implication: Not all discipline problems are under parental control, complicating arguments for parental responsibility.",
        "source_6": "Shonkoff, J. P., & Garner, A. S. (2012). The lifelong effects of early childhood adversity and toxic stress. Pediatrics (American Academy of Pediatrics). Finding: Poverty, violence exposure, and chronic stress impair self-regulation and increase behavioral problems; recommends systemic supports for families and schools. Implication: Points to structural contributors beyond parents, arguing for societal and school responsibility rather than parental blame."
    }
}