{
    "question": "Should internet service providers be allowed to block access to extremist websites?",
    "content": {
        "source_1": "BBC News (18 Mar 2019) — “New Zealand internet providers block websites hosting Christchurch attack video.” Following the 2019 Christchurch terrorist attack, major NZ ISPs temporarily blocked sites like 8chan/4chan that were hosting the shooter’s video and manifesto; officials and ISPs framed the blocks as rapid harm-reduction to curb the viral spread of extremist propaganda, illustrating a public-safety rationale for ISP blocking.",
        "source_2": "Danaher, Smith, Telang, and Chen (2018, SSRN/Carnegie Mellon IDEA) — “Website Blocking Revisited: The Effect of Piracy Website Blocking on Consumer Behavior.” Court-ordered ISP blocking of dozens of piracy sites in the UK significantly reduced visits to the blocked domains and increased traffic to legal services among heavy users, suggesting ISP-level site blocking can meaningfully alter user behavior and reduce access to targeted content.",
        "source_3": "UN Human Rights Council, Special Rapporteur on Freedom of Expression (Frank La Rue), A/HRC/17/27 (May 2011) — Report warns that network-level blocking and whole-website bans are generally disproportionate and prone to abuse; vague categories like “extremism” risk illegitimate censorship and must meet strict legality, necessity, and proportionality tests, arguing against allowing ISPs to block such sites by default.",
        "source_4": "Federal Communications Commission (FCC) Report and Order, “Safeguarding and Securing the Open Internet” (FCC 24-52, adopted Apr 25, 2024) — Restored net neutrality rules prohibit broadband ISPs in the U.S. from blocking lawful content; many “extremist” sites host legal (if objectionable) speech, so ISP blocking would conflict with these rules absent a clear finding of illegality or a lawful order.",
        "source_5": "Open Rights Group, Blocked.org.uk project (2018–2020) — Empirical monitoring of UK ISP filters documented widespread overblocking of legitimate sites (e.g., charities, health resources, political content) when category-based filtering is used, highlighting the high false-positive risk and collateral censorship that ISP-level blocking can cause if applied to broad labels like “extremist.”",
        "source_6": "Berger and Morgan, Brookings (Mar 2015) — “The ISIS Twitter Census.” Analysis of platform moderation found that sustained account suspensions fragmented ISIS supporter networks and reduced their reach, forcing migration to less accessible channels; while platform-focused, it provides evidence that restricting access points to extremist content can diminish dissemination and influence, supporting arguments for blocking as one tool among others."
    }
}