{
    "question": "Should there be an English Parliament?",
    "content": {
        "source_1": "Institute for Government (2021), “English Votes for English Laws scrapped: why it matters.” Analysis notes the abolition of EVEL left the “English question” unresolved and highlighted the opacity of current arrangements; advocates of an English Parliament cite this as evidence that a dedicated English legislature could provide clearer accountability and legitimacy for England-only laws.",
        "source_2": "NatCen Social Research, British Social Attitudes Survey (multiple waves, e.g., 2017–2019), “Public attitudes to how England should be governed.” Findings show a consistent minority—roughly a quarter to a third of respondents in England—support creating an English Parliament, indicating a base of public backing for the idea.",
        "source_3": "House of Lords Constitution Committee (2016), “The Union and Devolution” (10th Report of Session 2015–16). Warns that an English Parliament would be by far the largest component nation institution and could destabilise the Union by overshadowing UK-wide governance and altering the balance among the nations.",
        "source_4": "House of Commons Procedure Committee (2016), “English Votes for English Laws Standing Orders: Review.” Concluded EVEL operated smoothly without major delays or legislative gridlock, suggesting procedural solutions within Westminster can address England-only legislation without creating a separate English Parliament.",
        "source_5": "House of Commons Library (2017; updated briefings), “An English Parliament.” Outlines models and practical implications, highlighting significant setup and operating costs, institutional duplication, and complex delineation of powers—practical obstacles for establishing a separate English legislature.",
        "source_6": "HM Government (2022), “Levelling Up the United Kingdom” White Paper. Sets out a strategy prioritising sub-national devolution within England (mayors, combined authorities, devolution deals) to bring decisions closer to communities—offered by proponents as a better-targeted alternative to a single England-wide Parliament."
    }
}