{
    "question": "Should suicide be a criminal offence?",
    "content": {
        "source_1": "World Health Organization (2014). Preventing suicide: A global imperative. WHO. Evidence: Recommends decriminalizing suicide attempts, noting criminalization increases stigma, deters help‑seeking, and undermines a public‑health approach to prevention. https://www.who.int/publications/i/item/9789241564779",
        "source_2": "Supreme Court of India (1996). Gian Kaur v. State of Punjab, (1996) 2 SCC 648. Evidence: Held that the constitutional right to life does not include a right to die and upheld the validity of criminalizing attempted suicide, emphasizing the state’s interest in preserving life. https://indiankanoon.org/doc/66870/",
        "source_3": "Singapore Ministry of Home Affairs (2019). Decriminalisation of Attempted Suicide (Penal Code Amendment). Evidence: Parliament repealed Section 309 after concluding criminal penalties were counterproductive and that non‑penal interventions better direct people to care. https://www.mha.gov.sg/mediaroom/press-releases/decriminalisation-of-attempted-suicide/",
        "source_4": "European Court of Human Rights (2002). Pretty v. United Kingdom, App. No. 2346/02. Evidence: Found that Article 2 (right to life) does not confer a “right to die” and affirmed states’ positive obligations to protect life, supporting strong legal measures to prevent self‑harm. https://hudoc.echr.coe.int/eng?i=001-60448",
        "source_5": "John Stuart Mill (1859). On Liberty. Evidence: Articulates the harm principle that self‑regarding conduct should not be criminalized, providing a liberal philosophical basis against making suicide a criminal offence. https://www.gutenberg.org/ebooks/34901",
        "source_6": "Immanuel Kant (1797). The Metaphysics of Morals, Doctrine of Virtue. Evidence: Argues suicide violates a duty to oneself under the categorical imperative, a deontological rationale often invoked to justify moral and legal prohibition. https://oll.libertyfund.org/title/kant-the-metaphysics-of-morals"
    }
}