{
    "question": "Does online education do more good than harm?",
    "content": {
        "source_1": "U.S. Department of Education (2010), “Evaluation of Evidence-Based Practices in Online Learning: A Meta-Analysis and Review of Online Learning Studies.” Synthesis of dozens of rigorous studies found that, on average, students in online settings performed modestly better than those in face‑to‑face classes, with the largest benefits in blended (online + in‑person) formats—evidence that well-designed online instruction can improve learning.",
        "source_2": "Nature Human Behaviour (2023) meta-analysis on pandemic-era school closures and remote learning. Aggregating international studies, researchers reported substantial learning deficits equivalent to roughly one-third of a school year on average, with larger harms for disadvantaged students—evidence that rapid, large-scale remote schooling can exacerbate inequality and depress achievement.",
        "source_3": "Goodman, Melkers, and Pallais studies of Georgia Tech’s Online M.S. in Computer Science (2019–2021). Analyses show the low-cost online degree expanded total access to graduate education (attracting older, working, and geographically distant students) with little evidence of displacing on-campus enrollment—evidence that online delivery can broaden opportunity and increase human capital formation.",
        "source_4": "Pew Research Center (2020), reports on the “homework gap” during remote schooling. In the U.S., about 15% of households with school‑age children lacked high‑speed home internet; among low‑income families, roughly one‑third did—evidence that online education can deepen digital inequality and leave many learners behind.",
        "source_5": "Xu and Jaggars (2013, 2014) large-scale studies of community and technical colleges. Students in online courses had higher withdrawal and lower pass rates than in comparable face‑to‑face courses, with the largest negative effects for less-prepared students—evidence that, in many real-world settings, online formats can reduce academic success.",
        "source_6": "Open University (UK) sustainability analyses (e.g., 2015). Distance-learning courses were estimated to use about 90% less energy and produce roughly 85% fewer CO2 emissions per student than campus-based courses—evidence that online education can deliver substantial environmental benefits."
    }
}