{
    "question": "Should the payment of welfare benefits to parents be tied to their children's school attendance records?",
    "content": {
        "source_1": "World Bank (Fiszbein, A. & Schady, N.). Conditional Cash Transfers: Reducing Present and Future Poverty. The World Bank, 2009. https://openknowledge.worldbank.org/handle/10986/2597 - Evidence: Reviews large-scale programs in Latin America showing that conditioning cash on verified school attendance substantially increased enrollment/attendance, especially at the secondary level. Also notes design lessons: positive incentives tied to attendance work best when schools are accessible and administrative systems reliably monitor attendance.",
        "source_2": "Baird, S., McIntosh, C., & Özler, B. Cash or Condition? Evidence from a Cash Transfer Experiment. World Bank Policy Research Working Paper 5259, 2010. https://documents.worldbank.org/en/publication/documents-reports/documentdetail/258541468279941627/cash-or-condition-evidence-from-a-cash-transfer-experiment - Evidence: In Malawi, conditional cash transfers (requiring school attendance) produced markedly larger gains in girls’ enrollment and attendance than unconditional transfers of similar size, indicating it is the attendance condition itself—not just the cash—that drives schooling impacts.",
        "source_3": "Australian National Audit Office (ANAO). Administration of the School Enrolment and Attendance Measure (SEAM). Report No. 18, 2014–15. https://www.anao.gov.au/work/performance-audit/administration-school-enrolment-and-attendance-measure - Evidence: Audited Australia’s policy that linked welfare sanctions to children’s enrollment/attendance in targeted communities. Found weak implementation and no clear improvement in attendance; highlighted risks of penalizing vulnerable families and recommended discontinuation. The program was subsequently ended.",
        "source_4": "MDRC. Family Rewards: New York City’s Conditional Cash Transfer Program — Findings from the Evaluation (various reports, 2010–2016). Overview: https://www.mdrc.org/project/family-rewards - Evidence: In a high-income, urban U.S. context, tying cash incentives to education conditions (attendance, test scores, credits) yielded only modest or subgroup-specific improvements in educational outcomes and limited overall effects on attendance, suggesting context and design strongly shape effectiveness.",
        "source_5": "Welfare Conditionality: Sanctions, Support and Behaviour Change (Dwyer, P. et al.). Final Findings Report, University of York, 2018. http://www.welfareconditionality.ac.uk/publications/final-findings-report/ - Evidence: Longitudinal UK research across multiple welfare domains finds sanctions-based conditionality commonly causes hardship (e.g., debt, food insecurity) while showing limited success in producing sustained behavior change—raising concerns about tying core family benefits to attendance via penalties.",
        "source_6": "U.S. Departments of Education, Health and Human Services, Housing and Urban Development, and Justice. Every Student, Every Day: A Community Toolkit to Address and Eliminate Chronic Absenteeism, 2015. https://www2.ed.gov/about/inits/ed/chronicabsenteeism/toolkit.pdf - Evidence: Federal guidance emphasizes that punitive approaches to absenteeism are typically ineffective and can exacerbate barriers (health, housing instability, transportation). Recommends supportive, multi-agency strategies over punishment—implying caution about sanctioning family benefits based on attendance records."
    }
}