{
    "question": "Should employees be compelled to disclose their HIV status to employers?",
    "content": {
        "source_1": "U.S. Equal Employment Opportunity Commission, “What You Should Know About the ADA, the Rehabilitation Act, and HIV/AIDS” (EEOC). Key point: Under U.S. federal law, employers generally may not ask about or require disclosure of an employee’s HIV status; medical inquiries must be job-related and consistent with business necessity, and confidentiality is strictly protected. This weighs against compelled disclosure for most jobs. https://www.eeoc.gov/laws/guidance/what-you-should-know-about-ada-rehabilitation-act-and-hivaids",
        "source_2": "Occupational Safety and Health Administration (OSHA), Bloodborne Pathogens Standard (29 CFR 1910.1030). Key point: OSHA’s universal precautions require treating all blood as potentially infectious, implementing engineering controls, and offering post-exposure management—without knowing any individual worker’s HIV status. This safety framework reduces justification for mandatory disclosure. https://www.osha.gov/bloodborne-pathogens",
        "source_3": "International Labour Organization, Recommendation concerning HIV and AIDS and the World of Work, 2010 (No. 200). Key point: International labor standard affirms no mandatory HIV testing or disclosure for employment purposes and requires confidentiality of HIV-related information, emphasizing human rights and anti-discrimination. This opposes compelled disclosure. https://www.ilo.org/global/standards/recommendations/WCMS_142706",
        "source_4": "U.S. Department of Defense, DoD Instruction 6485.01, “Human Immunodeficiency Virus (HIV) in Military Service Members.” Key point: The military mandates routine HIV testing and command notification, with implications for deployment and assignment. This is a clear pro-compulsion example in a specific employment context prioritizing force health protection and readiness. https://www.esd.whs.mil/Directives/issuances/dodi/ (search: 6485.01)",
        "source_5": "UK Department of Health/UK Advisory Panel for Healthcare Workers Infected with Bloodborne Viruses (UKAP), “HIV-infected healthcare workers: guidance on management and patient notification.” Key point: HIV-positive healthcare workers with sustained viral suppression may perform exposure-prone procedures, but they must engage with occupational health and comply with monitoring—entailing limited, confidential disclosure within the employer’s occupational health system to manage risk. This supports narrowly tailored, role-specific disclosure. https://www.gov.uk/government/publications/hiv-infected-healthcare-workers-guidance-on-management-and-patient-notification",
        "source_6": "U.S. Centers for Disease Control and Prevention (CDC), “Occupational HIV Transmission and Prevention among Health Care Workers.” Key point: Documented occupational HIV transmissions in healthcare are exceedingly rare, and effective precautions and post-exposure prophylaxis further minimize risk. This epidemiological evidence undercuts a general need to compel disclosure across workplaces. https://www.cdc.gov/hiv/workplace/healthcareworkers.html"
    }
}