{
    "question": "Should minors be able to obtain abortions without parental consent?",
    "content": {
        "source_1": "National Academies of Sciences, Engineering, and Medicine (2018). The Safety and Quality of Abortion Care in the United States. Key finding: Abortion is very safe in the U.S.; barriers that delay care (including parental involvement requirements for minors) can push abortions later in gestation, increasing time, complexity, and cost, which can worsen outcomes and access for adolescents.",
        "source_2": "Steinberg, L. (2009). Adolescent development and juvenile justice: Are adolescents less mature than adults? American Psychologist. Key finding: In “cold” (non-pressured) decision contexts, adolescents around age 16 show adult-like capacities for understanding, reasoning, and weighing risks/benefits, supporting their ability to give informed medical consent without mandated parental involvement.",
        "source_3": "Joyce, T., Kaestner, R., & Colman, S. (2006). Changes in Abortions and Births and the Texas Parental Notification Law. New England Journal of Medicine. Key finding: After Texas implemented a parental notification law, abortions among minors declined, with evidence that some minors delayed until age 18 or traveled out of state; some analyses found modest increases in births—used by opponents of the claim to argue such laws change behavior and may deter abortion.",
        "source_4": "Gallup (2023). U.S. Abortion Attitudes by Detail (Values and Beliefs poll). Key finding: A consistent majority of Americans—typically around two-thirds to three-quarters—say they favor requiring parental consent for minors to obtain an abortion, indicating broad public support for parental involvement requirements.",
        "source_5": "Guttmacher Institute (2013/2014, Policy Review and subsequent updates). Parental Involvement in Minors’ Abortions. Key finding: Many minors voluntarily involve a parent or another trusted adult even without legal mandates; for those who cannot safely do so (e.g., risk of abuse, coercion, or being forced to continue pregnancy), mandated consent or burdensome judicial bypass can cause harmful delays and stress.",
        "source_6": "Charlotte Lozier Institute (e.g., New, M., 2017–2020 issue analyses). Parental Involvement Laws Reduce the Incidence of Abortion Among Minors. Key finding: Synthesizing multiple state-level studies, CLI reports that parental involvement laws are associated with reductions in minors’ abortion rates and argues such laws uphold parental rights and can protect minors, a perspective used to oppose allowing abortions without parental consent."
    }
}