{
    "question": "Should Tennessee protect teachers who wish to explore the merits of creationism?",
    "content": {
        "source_1": "Tennessee Public Chapter 660 (HB 368/SB 893), 2012 — The state enacted a law directing schools to create an environment that encourages critical thinking about “scientific strengths and scientific weaknesses” of topics such as biological evolution and climate change; supporters say it protects teachers who discuss critiques, while the statute also states it “shall not be construed to promote any religious or non-religious doctrine.”",
        "source_2": "Edwards v. Aguillard, 482 U.S. 578 (1987) — The U.S. Supreme Court struck down a Louisiana law requiring “creation science” alongside evolution, holding that advancing creationism in public school science classes violates the Establishment Clause; this precedent signals constitutional risk for any policy that protects teaching the “merits” of creationism.",
        "source_3": "National Academy of Sciences, “Science, Evolution, and Creationism” (2008) — The NAS concludes creationism and intelligent design are not science and should not be presented as scientific alternatives in K–12 science classes, warning that doing so misrepresents the nature of science and undermines science education.",
        "source_4": "Evans-Marshall v. Board of Education of Tipp City, 624 F.3d 332 (6th Cir. 2010) — The Sixth Circuit (which covers Tennessee) held that K–12 teachers’ in-class curricular speech is government speech without individual First Amendment protection, reinforcing that school boards—not individual teachers—control curriculum, and that “protections” for creationism discussions may conflict with district directives.",
        "source_5": "Pew Research Center, “Public Divided on Origins of Life” (2006) — National polling reported majorities favored teaching creationism alongside evolution in public schools at the time, suggesting democratic support for policies that give teachers latitude to address creationist views.",
        "source_6": "Discovery Institute, Center for Science & Culture, “Academic Freedom” statements and model legislation (circa 2008–2012) — Proponents argue academic freedom laws rightly protect teachers who critique aspects of evolutionary theory and discuss alternative views, claiming such policies foster critical thinking and do not promote religion when they focus on scientific evidence."
    }
}