{
    "question": "Should education be made compulsory to degree level?",
    "content": {
        "source_1": "OECD (2023), Education at a Glance 2023. Finds large private and social returns to tertiary attainment across OECD countries, including substantially higher employment rates and earnings for degree holders than for those with upper-secondary education, suggesting broad societal gains from more tertiary education. https://www.oecd.org/education/education-at-a-glance/",
        "source_2": "Caplan, Bryan (2018), The Case Against Education: Why the Education System Is a Waste of Time and Money. Argues much of the college wage premium reflects signaling rather than skill acquisition; expanding compulsory education to degree level would heighten credential inflation with limited productivity benefits. Princeton University Press.",
        "source_3": "OECD (2010), Learning for Jobs: Synthesis Report of the OECD Reviews of Vocational Education and Training. Documents that countries with strong apprenticeship/dual VET systems (e.g., Germany, Switzerland) achieve low youth unemployment and efficient school-to-work transitions without universal college, indicating effective non-degree pathways that compulsion could undermine. https://www.oecd.org/education/skills-beyond-school/47334855.pdf",
        "source_4": "Haughwout, Andrew; Donghoon Lee; Joelle Scally; Wilbert van der Klaauw (2017), Student Loan Borrowing and Homeownership. Federal Reserve Bank of New York, Liberty Street Economics. Shows rising student loan burdens are associated with delayed or reduced homeownership among young adults, highlighting macroeconomic and household costs that degree-level compulsion could exacerbate absent major financing reforms. https://libertystreeteconomics.newyorkfed.org/2017/04/did-student-loan-borrowing-hurt-the-housing-market/",
        "source_5": "United Nations (1948), Universal Declaration of Human Rights, Article 26. States that elementary education shall be compulsory, while higher education should be equally accessible on the basis of merit—implying prevailing human-rights norms favor access over compulsion at the tertiary level. https://www.un.org/en/about-us/universal-declaration-of-human-rights",
        "source_6": "McGuinness, Séamus; Konstantinos Pouliakas; Paul Redmond (2017), How Useful is the Concept of Skills Mismatch? Journal of Economic Surveys, 31(5): 1353–1396. Reviews evidence that a substantial share (often 15–30%) of workers—including many tertiary graduates—are overeducated or mismatched, suggesting compulsory degrees risk amplifying inefficiencies in labor-market matching. https://doi.org/10.1111/joes.12156"
    }
}