{
    "question": "Is affirmative action necessary?",
    "content": {
        "source_1": "Bowen, William G., and Derek Bok. The Shape of the River: Long-Term Consequences of Considering Race in College and University Admissions. Princeton University Press, 1998. Longitudinal evidence from selective colleges shows race-conscious admissions increased graduation rates, professional attainment, and civic leadership among underrepresented minorities without measurable harm to institutional outcomes—supporting the view that affirmative action produces social and educational benefits.",
        "source_2": "Bleemer, Zachary. Affirmative Action, Mismatch, and Economic Mobility After California’s Proposition 209. Quarterly Journal of Economics, 2021. Using the UC system’s ban as a natural experiment, Bleemer finds that underrepresented students cascaded to less selective campuses, leading to lower STEM completion, graduate education, and earnings, with minimal gains for non-URM peers—evidence that banning affirmative action reduced mobility and diversity.",
        "source_3": "Holzer, Harry J., and David Neumark. What Does Affirmative Action Do? Industrial and Labor Relations Review, 2000. Employer-level evidence (especially among federal contractors) shows affirmative action expands recruitment, increases hiring of minorities and women, and yields small or negligible productivity penalties—suggesting it is an effective tool for reducing employment disparities at limited efficiency cost.",
        "source_4": "Sander, Richard H. A Systemic Analysis of Affirmative Action in American Law Schools. Stanford Law Review, 2004. Argues that large racial preferences create “mismatch,” placing students in academic environments where they underperform, contributing to lower grades and bar-passage rates for URM law students—evidence that affirmative action can harm intended beneficiaries.",
        "source_5": "Espenshade, Thomas J., and Alexandria Walton Radford. No Longer Separate, Not Yet Equal: Race and Class in Elite College Admission and Campus Life. Princeton University Press, 2009. Analysis of elite admissions shows substantial preferences for underrepresented minorities (and also for legacies and athletes); simulations imply higher effective thresholds for Asian American applicants—highlighting fairness and zero-sum trade-offs that challenge the necessity of race-based preferences.",
        "source_6": "Students for Fair Admissions, Inc. v. President and Fellows of Harvard College; Students for Fair Admissions, Inc. v. University of North Carolina, 600 U.S. (2023). The U.S. Supreme Court held that race-conscious admissions policies violated the Equal Protection Clause/Title VI, criticizing their lack of narrow tailoring and measurable endpoints—placing legal constraints on affirmative action and pressing institutions toward race-neutral alternatives."
    }
}