{
    "question": "Should prostitution be legal?",
    "content": {
        "source_1": "The Lancet (2015) – Sex work and HIV series: Modeling studies concluded that decriminalizing sex work would have the largest single impact on HIV prevention for sex workers globally, potentially reducing new infections among sex workers by roughly one-third to nearly one-half over a decade, by reducing violence and improving access to health services. (Shannon et al., The Lancet series on HIV and sex workers, 2015)",
        "source_2": "New Zealand Government Prostitution Law Review Committee (2008) – Post-reform evaluation: After New Zealand decriminalized sex work in 2003, the official review found no clear increase in the overall size of the sex industry, improved ability of sex workers to refuse clients and report abuse, and better occupational safety, with no evidence of widespread trafficking emerging. (Report of the Prostitution Law Review Committee on the Operation of the Prostitution Reform Act 2003)",
        "source_3": "Cho, Dreher, and Neumayer (2013) – Cross-country study on trafficking: An econometric analysis published in World Development found that countries where prostitution is legal tend to report higher inflows of human trafficking, suggesting that legalization can expand demand and create pull factors for traffickers. (World Development, “Does Legalized Prostitution Increase Human Trafficking?”)",
        "source_4": "Government of Sweden (2010) – Evaluation of the Sex Purchase Act (Nordic model): Sweden’s official review reported that criminalizing the purchase of sex while decriminalizing its sale reduced visible street prostitution, contributed to a normative shift lowering demand, and that Sweden had lower levels of trafficking relative to comparable countries—offering an alternative to full legalization. (“Förbud mot köp av sexuell tjänst. En utvärdering 1999–2008”)",
        "source_5": "Amnesty International (2016) – Human rights policy on sex work: Amnesty’s policy recommends full decriminalization of consensual adult sex work, citing evidence that criminalization fuels police abuse, extortion, and barriers to health and justice, whereas decriminalization improves rights protections and safety for sex workers. (“Policy on State Obligations to Respect, Protect and Fulfil the Human Rights of Sex Workers”)",
        "source_6": "Netherlands experience (2000s–2010s) – National Rapporteur and municipal actions: Despite legalizing prostitution in 2000, Dutch authorities reported persistent exploitation and organized crime within the legal sector; Amsterdam closed some window brothels and tightened oversight, underscoring that legalization alone does not eliminate abuse and requires strong, resource-intensive regulation. (Reports of the Dutch National Rapporteur on Trafficking and Sexual Violence against Children; City of Amsterdam policy updates)"
    }
}