{
    "question": "Should we allow the death penalty for the worst of the worst criminals?",
    "content": {
        "source_1": "Dezhbakhsh, Hashem; Rubin, Paul H.; Shepherd, Joanna M. (2003). “Does Capital Punishment Have a Deterrent Effect? New Evidence from Postmoratorium Panel Data.” Journal of Law & Economics, 46(2). Finding: Using post-1976 panel data, the authors report that executions are associated with significant reductions in murders, estimating that each execution deters several homicides—evidence often cited to support the death penalty on deterrence grounds.",
        "source_2": "National Research Council (2012). Deterrence and the Death Penalty. Washington, DC: National Academies Press. Conclusion: After reviewing the econometric literature, the NRC found it is not possible to determine whether the death penalty increases, decreases, or has no effect on homicide rates; existing studies are methodologically too flawed to guide policy—undercutting deterrence claims.",
        "source_3": "Gross, Samuel R.; O’Brien, Barbara; Hu, Chen; Kennedy, Edward H. (2014). “Rate of false conviction of criminal defendants who are sentenced to death.” Proceedings of the National Academy of Sciences (PNAS), 111(20). Result: Using survival analysis of U.S. capital cases, the authors estimate at least 4.1% of death sentences are wrongful, highlighting the irreversibility risk unique to capital punishment.",
        "source_4": "Alarcón, Arthur L.; Mitchell, Paula M. (2011). “Executing the Will of the Voters? A Roadmap to Mend or End the California Legislature’s Multi-Billion-Dollar Death Penalty Debacle.” Loyola of Los Angeles Law Review, 44(41). Evidence: Detailed state-level fiscal analysis estimates California has spent roughly $4 billion on the death penalty since 1978, with per-execution costs exceeding $300 million—indicating capital punishment is far costlier than life without parole.",
        "source_5": "U.S. Government Accountability Office (GAO) (1990). Death Penalty Sentencing: Research Indicates Pattern of Racial Disparities (GAO/GGD-90-57). Finding: A meta-review concluded that in 82% of the studies, the race of the victim influenced the likelihood of a death sentence, with killings of white victims more likely to result in capital punishment—evidence of systemic disparity.",
        "source_6": "Gregg v. Georgia, 428 U.S. 153 (1976). Holding: The U.S. Supreme Court reinstated capital punishment under guided-discretion statutes, recognizing retribution and deterrence as legitimate penological goals and allowing the death penalty to be reserved for the “worst of the worst”—a legal and moral justification for its limited use."
    }
}