{
    "question": "Is it acceptable to kill one person to save many?",
    "content": {
        "source_1": "John Stuart Mill, Utilitarianism (1863) — Classical utilitarianism holds that actions are right if they promote the greatest overall happiness; on this view, sacrificing one life can be morally permissible if it prevents greater total harm and thus maximizes aggregate welfare.",
        "source_2": "Immanuel Kant, Groundwork of the Metaphysics of Morals (1785) — Kant’s Formula of Humanity forbids using a person merely as a means. Intentionally killing one to save many violates the inviolability of persons and is impermissible regardless of consequences.",
        "source_3": "R v Dudley and Stephens, 14 QBD 273 (QBD 1884) — In a famous English case of shipwreck cannibalism, the court rejected “necessity” as a defense to murder, establishing that killing an innocent person to save others is unlawful, even under extreme duress.",
        "source_4": "Robert D. Truog and Franklin G. Miller, The Dead-Donor Rule and Organ Transplantation, New England Journal of Medicine (2008) — Mainstream medical ethics (e.g., the dead-donor rule) prohibits intentionally killing one patient to harvest organs to save several others, reflecting a strong professional norm against instrumental killing.",
        "source_5": "Michael Walzer, Just and Unjust Wars (1977; later eds.) — Walzer’s “supreme emergency” doctrine argues that in extraordinary circumstances threatening a community’s survival, otherwise forbidden harms (including targeting innocents) might be morally excused or justified, suggesting a limited, tragic exception to absolute prohibitions.",
        "source_6": "Daniel M. Bartels and David A. Pizarro, The mismeasure of morals: Antisocial personality traits predict utilitarian responses to moral dilemmas, Cognition 121(1), 2011 — Empirical studies find that endorsement of sacrificial “kill one to save many” choices correlates with psychopathic and antisocial traits, challenging the assumption that such judgments straightforwardly reflect moral concern for the greater good."
    }
}