{
    "question": "Does language control thought?",
    "content": {
        "source_1": "Winawer, I., Witthoft, N., Frank, M., Wu, L., Wade, A., & Boroditsky, L. (2007). Russian blues reveal effects of language on color discrimination. Proceedings of the National Academy of Sciences. Finding: Russian speakers (with separate basic terms for light vs. dark blue) discriminate across that boundary faster than English speakers; the advantage disappears under verbal interference. Interpretation: Language can modulate even low-level perceptual decisions, supporting a weak Whorfian influence.",
        "source_2": "Gordon, P. (2004). Numerical cognition without words: Evidence from Amazonia. Science. Finding: Pirahã adults, whose language lacks exact number words, struggle with exact matching and memory for quantity beyond small sets. Interpretation: The absence of number words limits exact numerical concepts, supporting a stronger form of language-to-thought dependence.",
        "source_3": "Levinson, S. C. (2003). Space in Language and Cognition: Explorations in Cognitive Diversity. Cambridge University Press. Finding: Speakers of languages that obligatorily use absolute (cardinal) frames of reference (e.g., Guugu Yimithirr, Tzeltal) habitually encode and remember spatial layouts in absolute terms. Interpretation: Grammaticalized spatial systems can reorient habitual spatial cognition, indicating language-driven restructuring of thought.",
        "source_4": "Pinker, S. (1994). The Language Instinct. William Morrow/HarperCollins. Argument and evidence: Reviews data from infants, nonhuman animals, and cross-linguistic studies to argue that core concepts and reasoning exist without language. Interpretation: Rejects linguistic determinism; language labels preexisting concepts rather than controlling thought.",
        "source_5": "Papafragou, A., Hulbert, J., & Trueswell, J. C. (2008). Does language guide event perception? Evidence from eye movements. Cognition. Finding: Despite differences in how English and Greek encode motion events linguistically (manner vs. path), nonlinguistic event perception and eye-movement patterns are similar. Interpretation: Linguistic differences affect description, not underlying visual cognition—counter to strong control claims.",
        "source_6": "Costa, A., Foucart, A., Hayakawa, S., Aparici, M., Apesteguia, J., Heafner, J., & Keysar, B. (2014). Your morals depend on language. Psychological Science. Finding: People make more utilitarian choices when moral dilemmas are presented in a foreign language. Interpretation: The language context can shift moral judgment by altering emotional engagement, suggesting language can systematically modulate higher-order reasoning."
    }
}