{
    "question": "Should fast food advertising be banned?",
    "content": {
        "source_1": "Dhar, T.; Baylis, K. “Fast-Food Consumption and the Ban on Advertising to Children: The Quebec Experience.” Journal of Marketing Research, 48(5), 2011. https://journals.sagepub.com/doi/10.1509/jmkr.48.5.799 - Natural experiment evidence: Quebec’s child-directed fast-food ad ban was associated with a significant decline (about 13%) in fast-food expenditures among French-speaking households with children, suggesting advertising restrictions can reduce children’s fast-food consumption.",
        "source_2": "44 Liquormart, Inc. v. Rhode Island, 517 U.S. 484 (1996). U.S. Supreme Court. https://www.law.cornell.edu/supct/html/94-1140.ZO.html - Legal constraint perspective (U.S.): The Court struck down a ban on truthful price advertising for a legal product (alcohol), applying the Central Hudson commercial speech test; by analogy, a blanket fast-food advertising ban would likely face serious First Amendment challenges.",
        "source_3": "Ofcom. “HFSS advertising restrictions—Final review.” 2010. https://www.ofcom.org.uk/consultations-and-statements/category-1/hfss-review - Effectiveness skepticism: UK restrictions on TV advertising of high fat, salt, sugar (HFSS) foods reduced children’s exposure substantially, but evaluators found no clear, attributable impact on childhood obesity trends, implying advertising limits alone may be insufficient.",
        "source_4": "Rudd Center for Food Policy & Health (UConn). “Fast Food FACTS 2021.” 2021. https://uconnruddcenter.org/research/fast-food-facts-2021/ - Equity/targeting evidence: The report documents that Black and Hispanic youth are disproportionately targeted and exposed to fast-food marketing (e.g., Black youth viewing far more fast-food TV ads than white youth), supporting bans as a tool to reduce marketing-driven health disparities.",
        "source_5": "UK Government (Department of Health and Social Care & DCMS). “Impact assessment: Introducing a 9pm watershed on TV and paid-for online advertising for HFSS products.” 2021. https://www.gov.uk/government/consultations/total-restriction-of-online-advertising-for-hfss-products/impact-assessment - Economic and practical costs viewpoint: The IA projects sizable compliance and revenue losses for advertisers and media (especially broadcasters) and potential burdens for small businesses, raising concerns about the proportionality and unintended economic effects of sweeping ad bans.",
        "source_6": "Colchero, M. A.; Popkin, B. M.; Rivera, J. A.; Ng, S. W. “Beverage purchases from stores in Mexico under the excise tax on sugar sweetened beverages: observational study.” BMJ, 352:h6704, 2016. https://www.bmj.com/content/352/bmj.h6704 - Alternative policy evidence: Mexico’s SSB tax led to a meaningful reduction in purchases (about 6% on average in year one, larger among low-income households), suggesting less restrictive measures (taxation/price policy) have strong evidence and may be preferable to outright advertising bans."
    }
}