{
    "question": "Is Africa really rising?",
    "content": {
        "source_1": "IMF, Regional Economic Outlook: Sub-Saharan Africa (April 2024) — The IMF projects Sub-Saharan Africa’s growth to accelerate from 3.4% (2023) to about 3.8% (2024), with several economies (e.g., Ethiopia, Rwanda, Côte d’Ivoire) among the world’s fastest growers and inflation easing, suggesting renewed momentum after the post‑pandemic slowdown.",
        "source_2": "World Bank, Africa’s Pulse (April 2024) — Despite headline growth, the Bank notes per capita incomes in Sub‑Saharan Africa are not expected to return to pre‑pandemic (2019) levels until 2025, the region hosts roughly 60% of the world’s extreme poor, and debt vulnerabilities have increased in many countries—evidence that broad-based living‑standards gains are lagging.",
        "source_3": "World Bank, The African Continental Free Trade Area: Economic and Distributional Effects (2020) — Modeling suggests AfCFTA implementation could lift 30 million Africans out of extreme poverty and raise incomes by about $450 billion by 2035, indicating substantial medium‑term upside from deeper intra‑African trade and market integration.",
        "source_4": "Dani Rodrik, “Premature deindustrialization,” Journal of Economic Growth (2016) — Cross‑country evidence shows many African economies see manufacturing shares peak at low income levels, limiting classic industrialization-led structural transformation and constraining the creation of high‑productivity jobs—casting doubt on a simple “rising” narrative.",
        "source_5": "GSMA, The Mobile Economy Sub‑Saharan Africa 2023 and State of the Industry Report on Mobile Money 2023 — Mobile technologies and services contributed about 8% of SSA GDP in 2022 (roughly $170 billion), and the region accounted for around two‑thirds of global mobile money transaction value in 2022, highlighting digital leapfrogging and a vibrant fintech ecosystem.",
        "source_6": "BBC News, “Coups in Africa: A quick guide” (Aug–Sep 2023) — At least seven successful military takeovers occurred across West and Central Africa since 2020 (including Mali, Guinea, Sudan, Burkina Faso twice, Niger, and Gabon), underscoring governance and security setbacks that threaten economic progress and investor confidence."
    }
}