{
    "question": "Should goal-line technology be adopted in football?",
    "content": {
        "source_1": "IFAB press release — International Football Association Board approves goal-line technology (July 2012). After independent testing, IFAB authorized GLT for use, noting the system provides a decision to the referee within about one second and is limited strictly to goal/no-goal situations—evidence that the technology is precise and minimally disruptive, supporting adoption.",
        "source_2": "BBC Sport — World Cup 2010: Frank Lampard’s disallowed goal vs Germany (June 27, 2010). A high‑profile error where a clear goal was not given became a catalyst for calls to adopt GLT, illustrating the competitive and reputational stakes of relying solely on human judgment.",
        "source_3": "BBC Sport — Aston Villa 0-0 Sheffield United: Hawk-Eye apologises for goal-line technology failure (June 17, 2020). The system failed to detect a clear goal due to occluded camera views, and no goal was awarded, showing that GLT is not infallible and can create new controversies—an argument against “has to be adopted” mandates.",
        "source_4": "BBC Sport/Reuters — French LFP suspends goal-line technology after errors (January 2018). Ligue 1’s governing body suspended its GLT provider mid-season following multiple malfunctions, highlighting operational risks, vendor reliability issues, and oversight costs that complicate universal adoption.",
        "source_5": "EFL official announcement — Goal-line technology to be used in the Championship (2017), not in League One/Two. The English Football League expanded GLT to the Championship while citing financial and practical constraints for lower tiers, indicating that mandatory adoption may be inequitable or economically infeasible outside top divisions.",
        "source_6": "BBC Sport — World Cup 2014: Goal-line technology used to award France a goal vs Honduras (June 15, 2014). GLT delivered an immediate, decisive ruling in a major tournament match, reducing dispute and supporting the case that adoption enhances fairness and accuracy at the elite level."
    }
}