{
    "question": "Should NATO be expanded?",
    "content": {
        "source_1": "OSCE, Charter for European Security (Istanbul, 1999) — Participating states reaffirm that every country has the sovereign right to choose its own security arrangements and alliances. This underpins NATO’s “open door” policy as consistent with European security norms, countering arguments that expansion violates legitimate “spheres of influence.”",
        "source_2": "RAND Corporation, Shlapak & Johnson, Reinforcing Deterrence on NATO’s Eastern Flank (2016) — Wargame analysis showed that credible forward defense by NATO forces is key to deterring Russian aggression against Allies on the eastern flank. The findings imply that being inside NATO with adequate deterrent posture lowers the risk of attack compared to non-allied neighbors.",
        "source_3": "CSIS, Rachel Ellehuus et al., What Finland and Sweden Bring to NATO (2022) — Assesses concrete capability gains from adding Finland and Sweden: strong air and naval assets, significant artillery and mobilization potential, resilient total-defense models, and improved control of the Baltic–Nordic theater. Expansion here strengthens NATO’s military balance and operational depth.",
        "source_4": "John J. Mearsheimer, Why the Ukraine Crisis Is the West’s Fault, Foreign Affairs (Sept/Oct 2014) — Argues that NATO expansion triggered severe Russian security fears, contributing to the Ukraine crisis. From this perspective, further expansion risks intensifying great-power confrontation and instability.",
        "source_5": "Barry R. Posen, Europe Can Defend Itself, Foreign Affairs (July/Aug 2014) — Contends that expanding U.S. security guarantees in Europe burdens U.S. resources and heightens entrapment risks. He suggests the U.S. should limit commitments and press Europeans to assume primary responsibility, implying caution about further NATO enlargement.",
        "source_6": "Carnegie Europe (Judy Dempsey’s Strategic Europe), NATO’s Missing Democratic Leg (2019) — Warns that as NATO expands, weak or backsliding democracies inside the alliance can undermine cohesion and decision-making (e.g., intra-alliance vetoes, civil–military tensions). Without stronger democratic conditionality, enlargement may complicate alliance unity."
    }
}