{
    "question": "Is the prevalence of 'African mercenaries' decreasing?",
    "content": {
        "source_1": "South African Government — Prohibition of Mercenary Activities and Regulation of Certain Activities in Country of Armed Conflict Act, 2006 (Act No. 27 of 2006) — gov.za/documents/prohibition-mercenary-activities-and-regulation-certain-activities-country-armed-conflict-act - Evidence: Criminalizes mercenary activity and tightly regulates South Africans’ participation in foreign armed conflicts. This legal clampdown reduced the supply of African mercenaries historically drawn from South Africa’s veteran pool, supporting a decline narrative.",
        "source_2": "Reuters — Rwanda to deploy 1,000 soldiers to Mozambique — July 9, 2021 — reuters.com/world/africa/rwanda-deploy-1000-soldiers-mozambique-2021-07-09 - Evidence: After limited use of private security contractors against the Cabo Delgado insurgency, Mozambique pivoted to interstate military assistance (Rwanda, then SADC missions). This shift from private hirelings to state-to-state deployments suggests decreasing reliance on mercenaries.",
        "source_3": "Human Rights Watch — Central African Republic: Abuses by Russia-Linked Forces — May 3, 2022 — hrw.org/news/2022/05/03/central-african-republic-abuses-russia-linked-forces - Evidence: Documents continued operations and abuses by Russia-linked Wagner personnel in CAR. Indicates ongoing or even growing mercenary-type presence in parts of Africa, challenging the claim of a decrease.",
        "source_4": "Reuters — Foreign fighters remain in Libya in breach of ceasefire, UN says — March 15, 2021 — reuters.com/world/middle-east-africa/foreign-fighters-remain-libya-un-2021-03-15 - Evidence: UN findings of thousands of foreign fighters/mercenaries (including Sudanese and Chadian groups) still entrenched in Libya years after the civil war’s peak. Demonstrates persistence of mercenary actors on the continent, contradicting a decline.",
        "source_5": "International Committee of the Red Cross/Swiss Federal Department of Foreign Affairs — The Montreux Document on Private Military and Security Companies — icrc.org/en/document/montreux-document - Evidence: Clarifies legal distinctions between “mercenaries” and PMSCs and sets governance best practices; many actors are reclassified as PMSCs rather than mercenaries. This definitional and regulatory shift can make “mercenaries” appear less prevalent even as private force providers continue operating, complicating assessment of a true decrease."
    }
}