{
    "question": "Should tablets replace textbooks in K-12 schools?",
    "content": {
        "source_1": "Delgado, P., Vargas, C., Ackerman, R., & Salmerón, L. (2018). Don’t throw away your printed books: A meta-analysis on the effects of reading media on reading comprehension. Educational Research Review, 25, 23–38. Across studies, students comprehended texts better in print than on screens, especially under time pressure and for expository material—warning that tablet-only reading could impair deep comprehension in K–12.",
        "source_2": "Cheung, A., & Slavin, R. E. (2013). The effectiveness of educational technology applications for enhancing reading achievement in K–12 classrooms: A meta-analysis. Educational Research Review, 9, 88–113. Technology-based reading programs produced statistically significant, though modest, gains (avg. effect size ≈ +0.16), suggesting that well-designed, interactive tablet curricula can outperform traditional textbooks on reading achievement.",
        "source_3": "Los Angeles Unified School District, Office of the Inspector General. (2015). Final Report: Common Core Technology Project (iPads). Found inadequate planning, underestimated infrastructure and professional development needs, high total cost of ownership, licensing constraints on digital curricula, and student circumvention of device controls—illustrating fiscal, logistical, and security risks of replacing textbooks with tablets at scale.",
        "source_4": "Schneps, M. H., Thomson, J. M., Chen, C., Sonnert, G., & Pomplun, M. (2013). E-readers are more effective than paper for some with dyslexia. PLOS ONE, 8(9): e75634. Using short line lengths on small screens improved reading speed and comprehension for many dyslexic high school students, highlighting accessibility advantages of tablets (adjustable fonts, text-to-speech, contrast) over standard print textbooks.",
        "source_5": "American Academy of Pediatrics. (2016; reaffirmed 2023). Policy Statement: Media Use in School-Aged Children and Adolescents. Links excessive screen exposure to sleep disruption, eye strain, distractibility, and attention problems; recommends structured media plans and breaks—raising health and attentional concerns about substituting all print textbooks with tablets without strict safeguards.",
        "source_6": "United Nations University/International Telecommunication Union. (2024). Global E-waste Monitor 2024. Reports 62 million metric tons of e-waste generated in 2022, with only about 22% formally recycled; tablets and small IT devices are a growing share. Large-scale school tablet adoption risks adding to e-waste and critical-mineral demand unless robust durability, repair, and recycling systems are ensured, complicating claims of environmental superiority over paper."
    }
}