{
    "question": "Should we have a system of participatory democracy?",
    "content": {
        "source_1": "Gonçalves, S. (2014). The Effects of Participatory Budgeting on Municipal Expenditures and Infant Mortality in Brazil. World Development, 53, 94–110. DOI: 10.1016/j.worlddev.2013.01.009. Using a difference-in-differences design across Brazilian municipalities, adoption of participatory budgeting is associated with roughly a 20% increase in health and sanitation spending and about a 4% reduction in infant mortality—evidence that participatory mechanisms can deliver tangible welfare gains.",
        "source_2": "OECD (2020). Innovative Citizen Participation and New Democratic Institutions: Catching the Deliberative Wave. Paris: OECD. https://www.oecd.org/gov/innovative-citizen-participation-and-new-democratic-institutions-339306da-en.htm. Synthesizing 289 cases of deliberative mini-publics worldwide, the report finds these participatory processes produce more informed recommendations, increase perceived legitimacy of decisions, and can improve policy responsiveness when governments commit to follow-up.",
        "source_3": "Schlozman, K. L., Verba, S., & Brady, H. E. (2012). The Unheavenly Chorus: Unequal Political Voice and the Broken Promise of American Democracy. Princeton University Press. Large-scale empirical evidence shows political participation is skewed toward the affluent, educated, and organized; expanding participatory channels risks amplifying these inequalities rather than equalizing voice.",
        "source_4": "Gamble, B. S. (1997). Putting Civil Rights to a Popular Vote. American Journal of Political Science, 41(1), 245–269. https://www.jstor.org/stable/2111713. Analyzing U.S. ballot initiatives on civil rights, the study finds direct popular votes are more likely than legislative processes to restrict minority rights—highlighting a downside risk of participatory democracy.",
        "source_5": "Lafont, C. (2019). Democracy Without Shortcuts: A Participatory Conception of Deliberative Democracy. Oxford University Press. Argues that small-scale participatory bodies (e.g., citizens’ assemblies) cannot substitute for broad public participation and may create legitimacy problems if used as decision shortcuts, cautioning against overreliance on such participatory designs.",
        "source_6": "He, B., & Warren, M. E. (2011). Authoritarian Deliberation: The Deliberative Turn in Chinese Political Development. Perspectives on Politics, 9(2), 269–289. https://doi.org/10.1017/S1537592711000892. Shows that regimes can deploy participatory and deliberative mechanisms to enhance governance capacity without democratizing, indicating participatory forms do not inherently produce democratic or liberating outcomes."
    }
}