{
    "question": "Should the translation of academic work into the languages of developing countries be subsidised?",
    "content": {
        "source_1": "UNESCO — Recommendation on Open Science (2021). Calls on Member States to promote multilingualism in scholarly communication and remove language barriers to knowledge, including through translation and adaptation. Presents a pro-subsidy equity argument: translating research into local languages improves inclusivity and uptake in developing contexts.",
        "source_2": "Amano, T., et al. — Languages Are Still a Major Barrier to Global Science (PLOS Biology, 2016). Empirical study showing a substantial share of scientific knowledge (e.g., in biodiversity conservation) is published in non-English and remains underused due to language barriers; recommends active translation and multilingual dissemination. Supports the claim that translation can unlock otherwise inaccessible evidence.",
        "source_3": "Meta AI — No Language Left Behind (NLLB-200): Scaling Human-Centered Machine Translation (2022). Reports major quality gains in machine translation for 200, including many low-resource, languages. Offers an alternative perspective: rapidly improving MT could deliver much of the benefit at lower marginal cost, suggesting subsidies might focus on MT infrastructure and post-editing rather than large-scale human-only translation.",
        "source_4": "WIPO — Guide to the Berne Convention for the Protection of Literary and Artistic Works (Article 8: Translation Right). Explains that translation is an exclusive right of authors/rightsholders; translating copyrighted academic works typically requires permission or appropriate licensing. Raises a practical/legal constraint: subsidies would need to cover rights clearance or prioritize openly licensed works, adding complexity and cost.",
        "source_5": "Helsinki Initiative on Multilingualism in Scholarly Communication (2019). Urges research systems to value and reward publishing in local languages and to support local infrastructures, not only English-centric dissemination. Provides a critical systems view: subsidies limited to translating dominant-language research into developing-country languages won’t fix incentive structures or strengthen local knowledge production.",
        "source_6": "Cochrane — Translation Strategy and “Cochrane in Your Language” program (2015–ongoing). Documents that translating health evidence summaries into multiple languages increases reach and use, but professional translation is resource-intensive, leading Cochrane to rely heavily on volunteers and selective funding. Offers operational evidence: translation boosts impact, yet sustainability is challenging without dedicated, ongoing subsidy."
    }
}