{
    "question": "Should there be an international treaty banning cyber-attacks?",
    "content": {
        "source_1": "United Nations Open-ended Working Group (OEWG) on ICTs, Final consensus report (UN A/75/816), 2021 — 193 UN member states agreed that international law applies in cyberspace and reaffirmed voluntary norms like not damaging critical infrastructure in peacetime. This demonstrates broad, cross-regional consensus that could be codified into a binding ban or treaty.",
        "source_2": "Council of Europe’s Convention on Cybercrime (Budapest Convention), in force since 2004 — The only binding international treaty on cybercrime has been joined by dozens of countries across regions, but major powers like Russia and China have refused to accede, criticizing its cross-border provisions and advocating alternative UN-led instruments. This split underscores geopolitical hurdles to a universal cyber-attack ban.",
        "source_3": "Tallinn Manual 2.0 on the International Law Applicable to Cyber Operations (NATO CCDCOE/Cambridge University Press, 2017) — An expert restatement concluding that existing international law (jus ad bellum, IHL) already regulates cyber operations, including when they amount to a use of force or target civilian objects. This suggests a new treaty/ban may be unnecessary or could create legal ambiguities with established law.",
        "source_4": "Brad Smith (Microsoft), “The Need for a Digital Geneva Convention,” 2017 — Microsoft called for a binding international treaty to protect civilians and critical infrastructure from state cyberattacks, plus an independent attribution mechanism and industry commitments. This industry-led proposal argues a treaty is needed to close protection gaps and clarify state responsibilities.",
        "source_5": "Thomas Rid and Ben Buchanan, “Attributing Cyber Attacks,” Journal of Strategic Studies, 2015 — Argues that robust attribution is often achievable when technical forensics are combined with intelligence, diplomacy, and public signaling, as seen in high-profile state attributions. If attribution is tractable, enforcing an international ban becomes more practical.",
        "source_6": "Joseph S. Nye, Jr., “Deterrence and Dissuasion in Cyberspace,” International Security, 2017 — Finds that persistent attribution challenges, proxy use, and the difficulty of credible punishment weaken deterrence in cyberspace. These verification and enforcement problems imply a global ban could be ineffective or even destabilizing if routinely violated."
    }
}