{
    "question": "Is receiving multiple vaccines safe?",
    "content": {
        "source_1": "Offit PA, Hackett CJ. Addressing Parents’ Concerns: Do Multiple Vaccines Overwhelm or Weaken the Infant’s Immune System? Pediatrics. 2002;109(1):124-129. — Argues that infants are immunologically capable of responding to many vaccines at once; the theoretical capacity to handle antigens is far greater than what the vaccine schedule presents, and modern vaccines contain far fewer antigens than past schedules.",
        "source_2": "Institute of Medicine (National Academies). The Childhood Immunization Schedule and Safety: Stakeholder Concerns, Scientific Evidence, and Future Studies. 2013. https://nap.nationalacademies.org/catalog/13563 — Concludes available evidence does not indicate safety problems with the recommended schedule (i.e., receiving many vaccines across early childhood), while calling for continued monitoring and targeted research.",
        "source_3": "Lazarus R, et al. Safety and immunogenicity of concomitant administration of COVID-19 vaccines with seasonal influenza vaccines (ComFluCOV): an open-label, randomized, phase 4 non-inferiority trial. The Lancet. 2021. https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)01891-4/fulltext — In adults, coadministration of COVID-19 and influenza vaccines produced non-inferior immune responses with a modest increase in mostly mild-to-moderate reactogenicity, supporting acceptable safety of receiving multiple vaccines together.",
        "source_4": "CDC. Febrile seizures and vaccines. Updated 2023. https://www.cdc.gov/vaccinesafety/concerns/febrile-seizures.html — Reports a small increased risk of febrile seizures in young children when inactivated influenza vaccine is given at the same visit as PCV13 (and/or DTaP) during certain seasons; the absolute risk is low (on the order of 1 additional event per several thousand vaccinations).",
        "source_5": "Klein NP, et al. Measles-Mumps-Rubella-Varicella Combination Vaccine and the Risk of Febrile Seizures. Pediatrics. 2010;126(1):e1–e8. — Finds that the combined MMRV vaccine in 12–23-month-olds roughly doubles the risk of fever and febrile seizures 5–12 days post-vaccination compared with administering MMR and varicella separately, leading to recommendations to prefer separate first doses in this age group.",
        "source_6": "Mitkus RJ, et al. Updated aluminum pharmacokinetics following infant exposures through diet and vaccination. Vaccine. 2011;29(51):9479–9484. — Pharmacokinetic modeling indicates that cumulative aluminum exposure from multiple aluminum-adjuvanted vaccines remains below established safety guidelines, supporting the safety of receiving several routine vaccines that contain aluminum adjuvants."
    }
}