{
    "question": "Should all museums be free of charge?",
    "content": {
        "source_1": "Knight Foundation — Visitors Count: Assessing Free Access and a Membership Experiment at the Dallas Museum of Art (2016). Case study finds that making general admission free and launching a free membership increased attendance and deepened engagement, suggesting free entry can broaden participation and loyalty. https://knightfoundation.org/reports/visitors-count-assessing-free-access-and-membership-experiment-dallas-museum-art/",
        "source_2": "Smithsonian Institution — Visit and Impact pages (accessed 2025). The Smithsonian’s museums and National Zoo have free admission; the Institution reports very high visitation and substantial national economic impact, cited as part of its public-mission rationale—evidence that free national museums can deliver broad public benefits. https://www.si.edu/visit and https://www.si.edu/about/impact",
        "source_3": "National Endowment for the Arts — When Going Gets Tough: Barriers and Motivations for Arts Attendance (2015). National survey analysis shows cost is not the most frequently cited barrier to attendance; lack of time, difficulty getting to venues, and not having someone to go with rank higher—implying that free admission alone may not significantly change who visits. https://www.arts.gov/impact/research/publications/when-going-gets-tough-barriers-and-motivations-attending-arts",
        "source_4": "Reuters — Italy scraps free Sunday museum openings, offers new free days (Aug 31, 2018). The Italian government curtailed universal monthly free days citing overcrowding and operational strain at popular sites—evidence that across-the-board free access can degrade visitor experience and stress conservation/operations. https://www.reuters.com/article/us-italy-museums-idUSKCN1LG1UB",
        "source_5": "The New York Times — The Met Museum to Charge Admission to Out-of-Towners (Jan 4, 2018). The Metropolitan Museum of Art shifted from pay-what-you-wish to mandatory fees for non–New York State residents to address budget shortfalls—illustrating that admission income can be material for financial sustainability at major institutions. https://www.nytimes.com/2018/01/04/arts/design/met-museum-admissions.html",
        "source_6": "Institute of Museum and Library Services / Association of Children’s Museums — Museums for All reaches 1,000 participating museums (2022) and program impact. A nationwide program offering free or deeply discounted admission to SNAP EBT cardholders has facilitated millions of low-income visits, suggesting targeted pricing can advance equity without making all admission universally free. https://www.imls.gov/news/museums-all-reaches-1000-participating-museums and https://museums4all.org/impact"
    }
}