{
    "question": "Should celebrities who commit drug-related offences be punished more harshly than non-celebrities?",
    "content": {
        "source_1": "Kahan, D. M. (1997). Social Influence, Social Meaning, and Deterrence. Virginia Law Review, 83(2), 349–395. - Core idea: Punishment has an expressive function that shapes social norms; highly visible sanctions can amplify norm reinforcement. - Relevance: Because celebrity cases receive outsized attention, harsher penalties for celebrities could yield greater general deterrence by signaling strong social condemnation of drug offenses.",
        "source_2": "Nagin, D. S. (2013). Deterrence in the Twenty-First Century: A Review of the Evidence. Crime and Justice, 42(1), 199–263. - Core finding: Increases in the certainty of punishment deter crime more reliably than increases in severity; marginal deterrent effects of harsher sentences are weak. - Relevance: Making celebrity sentences harsher is unlikely to meaningfully reduce drug offending compared with improving detection and enforcement, arguing against status-based sentence inflation.",
        "source_3": "United States Sentencing Guidelines Manual §5H1.10 (Socio-Economic Status) (U.S. Sentencing Commission). - Text: “Socio-economic status is not relevant in the determination of a sentence.” - Relevance: Using fame or public status to aggravate punishment conflicts with established sentencing principles that require equal treatment under the law and prohibit considering socioeconomic status.",
        "source_4": "American Academy of Pediatrics, Council on Communications and Media (2010). Policy Statement: Children, Adolescents, Substance Use, and the Media. - Core finding: Media depictions of substance use, often featuring celebrities, are associated with increased initiation and favorable attitudes toward substances among youth. - Relevance: Given their outsized influence on minors, proponents argue celebrities who commit drug offenses warrant harsher penalties to counteract glamorization and protect public health.",
        "source_5": "Tyler, T. R. (2006). Why People Obey the Law (Updated Edition). Princeton University Press. - Core finding: Perceived procedural justice and fairness drive voluntary compliance with the law more than fear of punishment. - Relevance: Unequal, harsher treatment of celebrities could undermine legitimacy and public trust, potentially reducing overall compliance and arguing against status-based sentencing.",
        "source_6": "BBC News (analysis/features reporting on South Korea’s drug policy and celebrity cases; various pieces 2019–2024). - Core observation: South Korea applies strict legal and intense social sanctions to celebrity drug cases, justified by role-model expectations; supporters claim this deters and upholds norms, while critics warn of disproportionate punishment and due-process concerns. - Relevance: A real-world case study showing a policy and cultural rationale for tougher treatment of celebrities, alongside counterarguments about fairness and effectiveness."
    }
}