{
    "question": "Should intellectual property rights be abolished?",
    "content": {
        "source_1": "Boldrin, Michele, and David K. Levine. 2008. Against Intellectual Monopoly. Cambridge University Press. — Argues, using economic theory and historical case studies (e.g., James Watt’s steam engine, sewing machine patents), that patents and copyright often impede rather than promote innovation and competition, concluding that IP rights should be abolished and replaced by market competition, prizes, and contracts.",
        "source_2": "Williams, Heidi L. 2013. Intellectual Property Rights and Innovation: Evidence from the Human Genome. Quarterly Journal of Economics. — Exploiting variation from Celera’s gene-level IP, finds that IP on human genes led to 20–30% less follow-on scientific research and fewer downstream diagnostic tests compared to genes placed in the public domain, indicating that IP can stifle cumulative innovation.",
        "source_3": "Qian, Yi. 2007. Do National Patent Laws Stimulate Domestic Innovation in a Global Patenting Environment? RAND Journal of Economics. — Using cross-country pharmaceutical data (1978–2002), finds that stronger patent laws can increase innovation (e.g., citation-weighted patents, new drug introductions) when complementary conditions (human capital, R&D investment, enforcement quality) are present, implying abolition could harm innovation in capable sectors.",
        "source_4": "Mowery, David C., Richard R. Nelson, Bhaven N. Sampat, and Arvids A. Ziedonis. 2001. The Growth of Patenting and Licensing by U.S. Universities: An Assessment of the Effects of the Bayh–Dole Act of 1980. Research Policy. — Documents a sharp rise in university patenting, licensing, and startup formation after Bayh–Dole enabled universities to own IP from federally funded research, suggesting IP rights can facilitate technology transfer and commercialization from academia.",
        "source_5": "Duggan, Mark, Craig Garthwaite, and Aparajita Goyal. 2016. The Market Impacts of Pharmaceutical Product Patents in Developing Countries: Evidence from India. American Economic Review. — Shows that TRIPS-compliant product patents in India raised prices and reduced quantities for some drugs while shifting supply toward multinational firms and higher-quality products, highlighting a trade-off: IP can reduce access even as it may encourage certain investments.",
        "source_6": "Benkler, Yochai. 2006. The Wealth of Networks: How Social Production Transforms Markets and Freedom. Yale University Press. — Analyzes commons-based peer production (e.g., Linux, Apache, Wikipedia) to show that high-quality innovation can emerge without strong exclusionary IP, supporting the view that robust creative output is possible under open, non-proprietary regimes."
    }
}