{
    "question": "Should collective bargaining rights for unions be abolished?",
    "content": {
        "source_1": "Lovenheim, Michael F., and Alexander Willén (2019). “The Long-Run Effects of Teacher Collective Bargaining.” American Economic Journal: Applied Economics, 11(3): 165–201. Using variation in states’ duty-to-bargain laws, the authors find that exposure to teacher collective bargaining reduces male students’ later-life earnings and employment, implying potential gains from weakening or abolishing bargaining in K–12 education.",
        "source_2": "Farber, Henry S., Daniel Herbst, Ilyana Kuziemko, and Suresh Naidu (2018). “Unions and Inequality Over the Twentieth Century: New Evidence from Survey Data.” Quarterly Journal of Economics, 133(2): 823–885. Shows that higher unionization is associated with lower wage inequality, and the decline of unions explains a substantial share of rising male wage inequality—suggesting that abolishing collective bargaining would likely exacerbate inequality.",
        "source_3": "Dharmapala, Dhammika; Richard H. McAdams; and John Rappaport (2020). “Collective Bargaining Rights and Police Misconduct: Evidence from Florida.” Journal of Law and Economics, 63(4). Exploiting a legal change that expanded collective bargaining rights to sheriff’s deputies, the authors find a significant increase in violent incidents of misconduct, implying that limiting or abolishing bargaining can improve accountability in law enforcement.",
        "source_4": "OECD (2018). “Collective bargaining in a changing world of work.” OECD Employment Outlook 2018, Chapter 2. Cross-country analysis indicates that well-designed collective bargaining systems help coordinate wage setting, support training and productivity, and enhance labor market resilience during downturns—warning that abolishing bargaining can weaken these macroeconomic stabilizers.",
        "source_5": "Hirsch, Barry T. (2004). “What Do Unions Do for Economic Performance?” Journal of Labor Research, 25(3): 415–455. Surveying firm-level evidence, Hirsch concludes unions tend to raise labor costs, reduce profitability, and discourage investment, with mixed effects on productivity—supporting arguments that abolishing bargaining could boost competitiveness and capital formation.",
        "source_6": "Economic Policy Institute (2021). “Ten years after Act 10: How Wisconsin’s public sector has changed.” EPI Report. Reviewing Wisconsin’s 2011 curtailment of public-sector bargaining, the report documents sharp declines in union coverage, relative pay and benefits, and increased teacher turnover—evidence that restricting or abolishing bargaining can undermine workforce stability and service quality."
    }
}