{
    "question": "Should governments choose open source software in order to encourage its use?",
    "content": {
        "source_1": "European Commission Open Source Strategy (2020–2023) - The European Commission adopted an institution-wide strategy to increase the use and contribution to open source, citing goals like innovation, interoperability, and digital sovereignty. This is evidence of a government choosing OSS partly to stimulate broader adoption and ecosystem growth, supporting the claim.",
        "source_2": "Munich’s LiMux Migration and Subsequent Reversal - The City of Munich migrated large parts of its desktop estate to Linux and open source, then later decided to return to proprietary platforms, citing usability, compatibility, and support challenges. This case cautions that selecting OSS primarily to promote its use can backfire if operational needs and user experience are not adequately met, challenging the claim.",
        "source_3": "U.S. Department of Defense guidance on Open Source Software - DoD guidance clarified that OSS can be treated like commercial off‑the‑shelf software and highlighted advantages such as transparency, security reviewability, and reuse. This supports the idea that public-sector adoption of OSS can be strategically valuable and that choosing it can normalize and encourage its use across government and industry.",
        "source_4": "Log4Shell (CVE-2021-44228) and ensuing government responses - The widespread Log4j vulnerability prompted governments to call for stronger open source supply-chain security and sustained investment in maintainers. It illustrates that encouraging broad OSS use without parallel commitments to security and maintenance can introduce systemic risk, a counterpoint to the claim as stated.",
        "source_5": "French Gendarmerie Nationale’s OSS Adoption - France’s national gendarmerie migrated tens of thousands of desktops to open source solutions (including a customized Linux distribution and LibreOffice), reporting significant cost savings and reduced vendor lock‑in. This supports the claim by showing how government adoption can both realize public value and stimulate local OSS ecosystems.",
        "source_6": "UK Government policy on open source and open standards - UK guidance encourages fair consideration of OSS and mandates open standards, but emphasizes technology neutrality and value-for-money rather than preferring OSS solely to promote it. This presents a nuanced stance: governments should adopt OSS when it best meets needs, not primarily to encourage its use, tempering the claim."
    }
}