{
    "question": "Should there be a presumption in favour of publication for information held by public bodies?",
    "content": {
        "source_1": "European Court of Human Rights, Magyar Helsinki Bizottság v. Hungary (Grand Chamber, 2016) — The Court recognized a qualified right of access to information held by public authorities under Article 10 when access is instrumental for performing a “public watchdog” role, reinforcing a strong openness norm for public bodies (while remaining subject to legitimate limits such as privacy and security). Link: https://hudoc.echr.coe.int/eng?i=001-168782",
        "source_2": "Reinikka, R. & Svensson, J. (2005). Fighting Corruption by Publishing Information: Evidence from a Newspaper Campaign in Uganda, Journal of the European Economic Association — Publicly disclosing school grant allocations through newspapers dramatically reduced leakage: schools went from receiving less than 30% of their entitled funds to roughly 80%, showing how publication can improve accountability and service delivery. Link: https://academic.oup.com/jeea/article/3/2-3/259/2281883",
        "source_3": "Deloitte (for Transport for London) (2017). Assessing the value of TfL’s open data — Proactive publication of transport data generated substantial economic and consumer benefits (estimated up to ~£130 million per year), including time savings for passengers, increased use of public transport, and a vibrant third‑party app ecosystem, illustrating efficiency and innovation gains from a pro‑publication stance. Link: http://content.tfl.gov.uk/deloitte-report-tfl-open-data.pdf",
        "source_4": "de Montjoye, Y.-A., et al. (2015). Unique in the shopping mall: On the reidentifiability of credit card metadata, Science — Empirical evidence that ostensibly anonymized datasets can often be re-identified (e.g., 90% of individuals identifiable with four spatiotemporal points) cautions that a blanket presumption to publish could create serious privacy risks unless robust safeguards and minimization are applied. Link: https://www.science.org/doi/10.1126/science.aaa6624",
        "source_5": "U.S. Government Accountability Office (2018). Freedom of Information Act: Processing Trends Show Need for Agencies to Take Additional Actions (GAO-18-365) — GAO found growing FOIA request volumes and backlogs across many agencies, with processing delays tied to resource constraints and review demands. This indicates that broad disclosure obligations can impose significant administrative burdens unless matched with capacity and process reforms. Link: https://www.gao.gov/products/gao-18-365",
        "source_6": "U.S. Supreme Court, CIA v. Sims, 471 U.S. 159 (1985) — The Court endorsed broad deference to withhold national security information, noting the “mosaic theory” whereby seemingly innocuous details, once published, can compromise intelligence sources and methods. This presents a clear limit on any general presumption of publication for public bodies. Link: https://supreme.justia.com/cases/federal/us/471/159/"
    }
}