{
    "question": "Is there a global water crisis?",
    "content": {
        "source_1": "WHO/UNICEF Joint Monitoring Programme (2023), “Progress on household drinking water, sanitation and hygiene 2000–2022.” Evidence: As of 2022, 2.2 billion people lacked safely managed drinking-water services and 3.5 billion lacked safely managed sanitation, indicating large-scale shortfalls in basic water access. Perspective: Supports the claim by framing the crisis as a human development and public health gap. https://washdata.org/reports",
        "source_2": "IPCC AR6 Working Group II (2022), “Impacts, Adaptation and Vulnerability – Summary for Policymakers.” Evidence: Climate change is intensifying the water cycle, increasing the frequency and severity of droughts and floods in many regions and altering water availability for billions, especially in snow- and glacier-fed basins. Perspective: Supports the claim by attributing rising water insecurity to climate-driven hydrological extremes. https://www.ipcc.ch/report/ar6/wg2/",
        "source_3": "Mekonnen, M. M., & Hoekstra, A. Y. (2016), “Four billion people facing severe water scarcity,” Science Advances, 2(2): e1500323. Evidence: An estimated 4.0 billion people experience severe water scarcity for at least one month per year due to demand outstripping local renewable supply. Perspective: Supports the claim by quantifying widespread scarcity rooted in consumption and allocation, distinct from climate impacts. https://www.science.org/doi/10.1126/sciadv.1500323",
        "source_4": "Our World in Data (updated 2024), “Water Use.” Evidence: Global freshwater withdrawals have plateaued since the 1980s and per-capita water use has declined in many regions, suggesting decoupling of water use from population and economic growth. Perspective: Challenges the notion of a singular global crisis, arguing that problems are often regional and governance-related rather than a global physical shortage. https://ourworldindata.org/water-use",
        "source_5": "Oki, T., & Kanae, S. (2006), “Global Hydrologic Cycles and World Water Resources,” Science, 313(5790): 1068–1072. Evidence: Concludes that, at a planetary scale, freshwater is sufficient; scarcity arises primarily from uneven geographic and seasonal distribution plus institutional and infrastructural constraints. Perspective: Counters the claim of a global crisis, reframing it as localized scarcity solvable through management and redistribution. https://www.science.org/doi/10.1126/science.1128845",
        "source_6": "International Desalination Association (IDA) & Global Water Intelligence (2022–2023), “IDA Water Security Handbook.” Evidence: Global installed desalination capacity surpassed 120 million m³/day, with rapid growth in desalination and water reuse supplying hundreds of millions, notably in arid regions (e.g., Israel’s municipal supply largely from desalination). Perspective: Challenges the inevitability of a global crisis by highlighting technological pathways that can offset scarcity where economically and ecologically viable. https://idadesal.org/resources/ (see IDA Water Security Handbook)"
    }
}