{
    "question": "Should Europe be federal?",
    "content": {
        "source_1": "Paul De Grauwe, “Design Failures in the Eurozone and How to Fix Them” (CEPS Policy Brief, 2013) — Analyzing sovereign bond market turmoil in 2010–2012, De Grauwe argues that a monetary union without a federal lender of last resort and central fiscal capacity is inherently fragile; he concludes that a federal-style fiscal union with common stabilization tools would reduce crisis vulnerability and improve resilience.",
        "source_2": "Hans-Werner Sinn, The Euro Trap (Oxford University Press, 2014) — Sinn contends that deeper centralization and debt mutualization would create a permanent transfer union and weaken budget discipline, generating moral hazard; he advocates stricter rules and market-based adjustment over federalization, warning that a federal Europe could entrench costly cross-border bailouts.",
        "source_3": "European Commission, “Reflection Paper on the Future of European Defence” (2017) — Citing European Defence Agency estimates of €25–100 billion in annual inefficiencies from fragmented national procurement and duplicated capabilities, the paper argues that pooling sovereignty and integrating defense planning and acquisitions at EU level would yield significant savings and strategic autonomy—evidence favoring a more federal approach in defense.",
        "source_4": "UK Electoral Commission, “EU Referendum Results” (2016) — The official 51.9% vote to Leave the EU, with sovereignty and “taking back control” as central themes, demonstrates that substantial segments of European electorates resist transferring powers to supranational bodies, suggesting democratic and practical headwinds for any move toward a federal Europe.",
        "source_5": "European Commission and Council updates on Article 7 TEU procedures for Poland and Hungary (2017–2023) — Despite repeated Commission findings of systemic rule-of-law concerns, sanctions have not been adopted due to unanimity requirements, indicating that the EU’s current quasi-confederal design struggles to enforce core values; proponents infer that a federal system with clearer supremacy and enforcement powers could address this gap.",
        "source_6": "EFTA/EEA documentation on Norway, Iceland, and Liechtenstein — These countries access the EU Single Market and many programs via treaty without joining a federal political union, showing that extensive economic integration can be achieved contractually; this undercuts claims that full political federalization is necessary to realize integration benefits."
    }
}