{
    "question": "Should a permanent UNSC seat with veto power be reserved for an African country?",
    "content": {
        "source_1": "African Union, “The Common African Position on the Proposed Reform of the United Nations: The Ezulwini Consensus” (2005). Calls for at least two permanent Security Council seats for Africa “with all the privileges and responsibilities of permanent membership, including the veto” (or else abolition of the veto for all), arguing representation and historical equity require it.",
        "source_2": "United Nations Peacekeeping (Department of Peace Operations), “Facts and Figures” (regularly updated). Shows that a large share—often the majority—of UN peacekeeping personnel and several of the largest missions are deployed in African countries (e.g., South Sudan, Central African Republic, DRC), indicating the Council’s decisions disproportionately affect Africa and bolstering arguments for permanent African representation.",
        "source_3": "The White House, “Remarks by President Biden Before the 77th Session of the United Nations General Assembly” (21 Sept 2022). The U.S. publicly supports adding permanent seats for Africa to the Security Council but does not endorse extending veto power to new members, reflecting partial support for African permanency without a new veto.",
        "source_4": "Italy (on behalf of the Uniting for Consensus group), Statement to the Intergovernmental Negotiations on Security Council Reform (26 Jan 2023). Opposes creating any new permanent seats or expanding the veto; proposes longer-term, renewable elected seats—including for Africa—as a compromise to improve representation without worsening Council paralysis.",
        "source_5": "UN General Assembly, Resolution 76/262, “Standing mandate for a General Assembly debate when a veto is cast” (26 Apr 2022). Establishes automatic GA debates after any veto use, signaling broad membership concern about veto overuse and a trend toward veto restraint—an environment at odds with creating additional veto-wielding permanent seats."
    }
}