{
    "question": "Should mind sports such as chess, quizzing, and debating be Olympic sports?",
    "content": {
        "source_1": "International Olympic Committee (IOC) — “How a sport is added to the Olympic programme” (IOC explainer). Evidence: To be considered, a sport must be governed by an IOC‑recognised international federation and is evaluated on criteria such as global participation, universality, cost/complexity, athlete health and safety, and overall “added value” to the Games. This frames key hurdles mind sports must clear.",
        "source_2": "IOC — List of IOC‑recognised International Federations. Evidence: The IOC recognises the International Chess Federation (FIDE) and the World Bridge Federation, indicating that some mind sports already meet IOC recognition standards and have a formal pathway toward potential programme inclusion.",
        "source_3": "Reuters — “Bridge makes Asian Games debut” (August 2018). Evidence: The inclusion of bridge (and earlier, chess in 2006 and 2010) at the Asian Games shows that mind sports can be successfully integrated into major multi‑sport events, bolstering the case for Olympic consideration.",
        "source_4": "IOC — Announcements on adding sports like skateboarding, sport climbing, and surfing (Tokyo 2020) and breaking (Paris 2024). Evidence: The IOC has prioritised additions that deliver youth appeal, urban culture relevance, and broadcast value. This selection trend can cut against the inclusion of mind sports if they are perceived as offering less live‑spectator and broadcast impact.",
        "source_5": "FIDE Fair Play Commission — Fair Play (Anti‑Cheating) Regulations. Evidence: Chess faces documented risks of technological cheating (e.g., electronic assistance), prompting strict scanning, monitoring, and statistical detection measures. These integrity challenges could be magnified at the Olympics and weigh against inclusion.",
        "source_6": "International Debate Education Association (IDEA) — Overview of debate formats and organisations. Evidence: Competitive debating is fragmented across multiple formats (e.g., British Parliamentary, Policy, Lincoln‑Douglas) and governing bodies, with no single IOC‑recognised international federation. Similar fragmentation exists in quizzing, suggesting governance and standardisation gaps that impede Olympic eligibility."
    }
}