{
    "question": "Should people be allowed to do what they want to their own bodies?",
    "content": {
        "source_1": "The Belmont Report (U.S. Department of Health & Human Services, 1979) — Establishes “respect for persons” as a core bioethical principle, requiring informed consent and recognizing autonomous decision-making over one’s body, supporting strong bodily autonomy in medicine and research. https://www.hhs.gov/ohrp/regulations-and-policy/belmont-report/index.html",
        "source_2": "Schloendorff v. Society of New York Hospital, 211 N.Y. 125 (N.Y. 1914) — Landmark case articulating the common-law right to bodily integrity: “Every human being of adult years and sound mind has a right to determine what shall be done with his own body,” grounding legal protection for personal medical choices. https://law.justia.com/cases/new-york/court-of-appeals/1914/211-n-y-125-0.html",
        "source_3": "Jacobson v. Massachusetts, 197 U.S. 11 (1905) — U.S. Supreme Court upheld compulsory vaccination, affirming state police powers to limit bodily autonomy when individual choices pose public health risks, challenging the idea of absolute bodily freedom. https://supreme.justia.com/cases/federal/us/197/11/",
        "source_4": "42 U.S.C. § 274e (National Organ Transplant Act, 1984) — Federal law prohibiting the sale of human organs, justified by concerns about exploitation and commodification of the body, demonstrating policy-imposed limits on what individuals may do with their bodies. https://www.law.cornell.edu/uscode/text/42/274e",
        "source_5": "Prostitution Law Review Committee (New Zealand), “Report on the Operation of the Prostitution Reform Act 2003” (2008) — Government review found decriminalization improved sex workers’ ability to refuse clients, report violence, and access health services, with no evidence of increased underage prostitution—empirical support for harm-reduction benefits when bodily choices are legalized. https://www.justice.govt.nz/justice-sector-policy/key-initiatives/prostitution-law-review-committee/publications/plrc-report-2008/",
        "source_6": "Catechism of the Catholic Church (paras. 2281, 2297) — Condemns suicide and non-therapeutic mutilation as morally impermissible, framing the body as entrusted to the person rather than absolutely owned, offering a religious-ethical argument against unrestricted bodily autonomy. http://www.vatican.va/archive/ENG0015/__P7Z.HTM and http://www.vatican.va/archive/ENG0015/__P81.HTM"
    }
}