{
    "question": "Should parents have the right to do background checks on those looking after their children?",
    "content": {
        "source_1": "U.S. Administration for Children and Families (HHS) — Child Care and Development Block Grant (CCDBG) Act background check requirements (2016–2020 guidance and implementation reports). Evidence: Federal law requires states to conduct comprehensive criminal and child-abuse registry checks (including FBI fingerprinting) for licensed child-care workers in programs receiving CCDF funds, reflecting a policy judgment that background checks are a core child-safety measure.",
        "source_2": "Centers for Disease Control and Prevention — Preventing Child Sexual Abuse Within Youth-Serving Organizations: Getting Started on Policies and Procedures (2014). Evidence: CDC recommends screening and selection practices that include criminal background checks as part of a multilayer prevention strategy to reduce risk to children in care.",
        "source_3": "National Employment Law Project — Wanted: Accurate FBI Background Checks for Employment (2014). Evidence: NELP documented that roughly half of FBI criminal records were missing final disposition information, leading to potentially inaccurate or unfair exclusion of applicants when background checks are used.",
        "source_4": "U.S. Equal Employment Opportunity Commission — Enforcement Guidance on the Consideration of Arrest and Conviction Records in Employment Decisions under Title VII (2012). Evidence: EEOC warns that blanket exclusions based on criminal history can create unlawful disparate impact, urging individualized assessments—highlighting equity and anti-discrimination concerns when using background checks.",
        "source_5": "UK Government — Disclosure and Barring Service (DBS) eligibility guidance (ongoing). Evidence: UK law restricts who can request standard/enhanced criminal record and barred list checks to roles involving regulated activity; private households typically cannot obtain enhanced checks on babysitters, illustrating privacy protections and limits on a general “right” to check.",
        "source_6": "Child Welfare Information Gateway (HHS) — Background checks for prospective foster/adoptive parents (state statutes summaries and guidance, updated regularly). Evidence: CWIG notes that while background checks are widely required, they are only one component of a comprehensive assessment and cannot guarantee child safety—underscoring the limits of checks and the need for broader vetting and supervision."
    }
}