{
    "question": "Is online privacy important?",
    "content": {
        "source_1": "Pew Research Center (2019) — “Americans and Privacy: Concerned, Confused and Feeling Lack of Control.” Evidence: 81% of U.S. adults say they have very little or no control over the data companies collect; 79% are concerned about how companies use their data. Perspective: Broad public concern supports the importance of online privacy.",
        "source_2": "U.S. Federal Trade Commission vs. Equifax (2019 settlement over 2017 breach). Evidence: Personal data of about 147 million people were exposed; Equifax agreed to a settlement of up to $700 million. Perspective: Concrete harms from privacy failures (identity theft, credit damage) show privacy’s real-world importance.",
        "source_3": "Nature — de Montjoye et al. (2015), “Unique in the shopping mall: On the reidentifiability of credit card metadata.” Evidence: As few as four spatiotemporal data points could re-identify 90% of individuals in an “anonymized” dataset. Perspective: Technical limits of de-identification make online privacy intrinsically fragile and critical.",
        "source_4": "Meta Platforms earnings call and industry analysis (2022) on Apple’s App Tracking Transparency (ATT). Evidence: Meta projected roughly a $10 billion revenue impact in 2022 from ATT’s limits on cross-app tracking; smaller app developers and publishers reported reduced ad effectiveness. Perspective: Strong privacy controls can impose substantial economic costs and threaten ad-funded “free” services, challenging an absolutist pro-privacy stance.",
        "source_5": "Joint open letter from the U.S. Department of Justice, U.K. Home Office, and Australian Government to Facebook (Oct 2019) on end-to-end encryption. Evidence: Authorities argued default end-to-end encryption would hinder detection of child exploitation and serious crime, urging mechanisms for lawful access. Perspective: Privacy can conflict with public safety and law enforcement needs.",
        "source_6": "Nature — Kraemer et al. (2020), “The effect of human mobility and control measures on the COVID-19 epidemic in China.” Evidence: Aggregated mobile phone location data helped model and understand disease spread, informing control measures. Perspective: In public health emergencies, data sharing can yield societal benefits, complicating claims that privacy should always prevail."
    }
}