{
    "question": "Should university education be free?",
    "content": {
        "source_1": "OECD, Education at a Glance 2023: OECD Indicators (2023, OECD Publishing). Evidence: Across OECD countries, tertiary education yields substantial net public returns (higher tax revenues, lower unemployment/benefit costs), supporting the case for robust public financing of university, including tuition-free models. https://www.oecd.org/education/education-at-a-glance/",
        "source_2": "Hemelt, S. W., & Marcotte, D. E., “The Impact of Tuition Increases on Enrollment at Public Colleges and Universities” (2011). Evidence: Empirical estimates show enrollment is price-sensitive; even modest tuition increases reduce attendance at public institutions, especially among price-sensitive students—implying that removing tuition can boost access. (Working-paper and journal versions circulated; summary result widely cited.)",
        "source_3": "Dynarski, S., & Delisle, J., “An undemocratic idea: Free college for all” (2016, Brookings). Argument: Universal free tuition is fiscally costly and regressive because higher-income families capture disproportionate benefits; targeted aid (e.g., need-based grants) is more equitable than making university free for everyone. https://www.brookings.edu/articles/an-undemocratic-idea-free-college-for-all/",
        "source_4": "OECD, Education in Chile: Reviews of National Policies for Education (2018, OECD Publishing). Case evidence: Chile’s “Gratuidad” tuition-free reform increased enrollment but generated high fiscal costs, uneven benefits skewed toward middle-income students, and ongoing quality/capacity concerns—highlighting trade-offs of universal free tuition. https://www.oecd.org/education/education-in-chile-9789264301523-en.htm",
        "source_5": "Di Maggio, M., Kalda, A., & Yao, V., “Second Chance: Life Without Student Debt? Evidence from Loan Discharges” (2019, NBER Working Paper 25810). Evidence: Exogenous student-debt relief improved credit scores, reduced delinquencies, and increased geographic mobility and earnings—suggesting that avoiding student debt (e.g., via free tuition) can yield meaningful economic and life-course benefits. https://www.nber.org/papers/w25810",
        "source_6": "Chapman, B., “Income-contingent loans for higher education: International reforms” (2014, IZA World of Labor). Argument: Income-contingent loan systems (e.g., Australia’s HECS-HELP) broaden access and share risk without zero pricing; they may achieve equity and sustainability more efficiently than universal free tuition. https://wol.iza.org/articles/income-contingent-loans-for-higher-education-international-reforms/long"
    }
}