{
    "question": "Should we encourage fewer people to go to university?",
    "content": {
        "source_1": "OECD — Education at a Glance 2023 (2023). Finds large average private returns to tertiary education: adults with a bachelor’s or higher have substantially higher employment rates and earn markedly more than those with only upper-secondary education, suggesting widespread benefits to university participation. https://www.oecd.org/education/education-at-a-glance/",
        "source_2": "Georgetown University Center on Education and the Workforce — A First Try at ROI: Ranking 4,500 Colleges (2019; updated). Calculates institution-level net present value and shows wide dispersion in returns, with many programs offering low or even negative short-term ROI—evidence that “college for all” can misallocate time and money. https://cew.georgetown.edu/cew-reports/collegeroi/",
        "source_3": "Federal Reserve Bank of New York — The Labor Market for Recent College Graduates (ongoing data portal). Documents persistent underemployment among recent graduates (often near or above 40%) and large differences by major, indicating that many degree-holders work in jobs that do not require a bachelor’s degree. https://www.newyorkfed.org/research/college-labor-market",
        "source_4": "Harvard Business Review — Employers Are Rethinking Degree Requirements (Fuller & Raman, 2022). Summarizes evidence of a “degree reset,” with many large employers removing bachelor’s degree requirements from job postings and shifting toward skills-based hiring, reducing the necessity of university for access to good jobs. https://hbr.org/2022/11/employers-are-rethinking-degree-requirements",
        "source_5": "Chetty, Friedman, Saez, Turner, Yagan — Mobility Report Cards / How Can We Increase Intergenerational Mobility? Evidence from Colleges (QJE, 2020; associated data 2017–). Shows that certain colleges—especially many mid-tier public institutions—substantially boost low-income students’ earnings, implying that discouraging university attendance could weaken social mobility. https://opportunityinsights.org/paper/mobilityreportcards/",
        "source_6": "National Science Board — Science and Engineering Indicators (2022). Highlights the nation’s need to expand STEM talent and the positive link between a robust supply of degree-holders and innovation/productivity; warns that constraining university pathways risks undermining competitiveness. https://ncses.nsf.gov/indicators/"
    }
}