{
    "question": "Are liberal democracies better at providing people's needs than non-democracies?",
    "content": {
        "source_1": "Amartya Sen, “Democracy as a Universal Value” (Journal of Democracy, 1999) and Development as Freedom (1999) — Comparative historical analysis showing that large-scale famines have not occurred in functioning electoral democracies with a free press; the accountability and information flows of democracy pressure governments to respond to basic needs like food security. Supports the claim.",
        "source_2": "Daron Acemoglu, Suresh Naidu, Pascual Restrepo, and James A. Robinson, “Democracy Does Cause Growth” (Journal of Political Economy, 2019) — Using global panel data and instrumental-variable strategies, the authors find that democratization raises GDP per capita, tax revenue, and public goods provision (notably education and health), with associated improvements in infant mortality and school enrollment. Supports the claim.",
        "source_3": "World Bank, Poverty and Shared Prosperity 2020/2022; China and Vietnam Poverty & Equity Briefs — Documents that non-democracies such as China and Vietnam achieved the bulk of the world’s poverty reduction since the 1980s (e.g., China lifting hundreds of millions out of extreme poverty), through state-led development, infrastructure, and targeted social programs. Challenges the claim by showing authoritarian systems can deliver basic material needs at scale.",
        "source_4": "Peter Evans and James E. Rauch, “Bureaucratic Structure and Economic Performance in Less Developed Countries” (American Journal of Sociology, 1999) — Cross-national evidence that meritocratic, Weberian bureaucracies correlate with better growth and service provision independent of regime type, implying state capacity rather than democracy per se is the key determinant of meeting citizens’ needs. Reframes the claim.",
        "source_5": "Philip Keefer and Stuti Khemani, “Democracy, Public Expenditures, and the Poor” (World Bank Research Observer, 2005) — Argues and presents evidence that in young or low-information democracies, electoral competition can foster clientelism and underinvestment in broad public goods like primary health and education, weakening service delivery to the poor. Challenges the claim.",
        "source_6": "United Nations Development Programme, Human Development Report 2021/2022 — Highlights that resource-rich non-democracies in the Gulf (e.g., Qatar, UAE, Saudi Arabia) rank high on Human Development Index metrics and provide extensive welfare benefits to citizens financed by hydrocarbon rents, despite low political freedoms. Challenges the claim by showing non-democracies can meet many material needs under certain conditions (while noting distributional caveats for non-citizens)."
    }
}