{
    "question": "Should the Euro 2012 in Ukraine be boycotted unless Yulia Timoshenko is released from prison?",
    "content": {
        "source_1": "BBC News (May 2012) — European leaders announced they would boycott a Ukraine-hosted summit over the treatment of Yulia Tymoshenko; the European Commission signaled President José Manuel Barroso would not attend any Euro 2012 matches in Ukraine. This illustrates high-level EU political pressure favoring a boycott to demand her release.",
        "source_2": "European Court of Human Rights, Tymoshenko v. Ukraine (Judgment of 30 April 2013) — The Court found Tymoshenko’s 2011 pre-trial detention unlawful and arbitrary, indicating violations of her rights and suggesting political motivation. This legal finding bolsters arguments that a boycott was justified on human-rights grounds.",
        "source_3": "Government of Ukraine (Foreign Ministry/official statements, 2012) — Ukrainian authorities rejected boycott calls, asserting Tymoshenko’s conviction stemmed from lawful proceedings and that the executive could not interfere with the judiciary; they emphasized she was receiving medical treatment, including by German doctors. This frames the case as a domestic legal matter and argues against external pressure via a sports boycott.",
        "source_4": "UEFA/Michel Platini (press remarks, spring 2012) — UEFA opposed politicizing Euro 2012, arguing that boycotts punish players and fans and that the tournament would not be moved. This presents a sports-governance perspective against using Euro 2012 as leverage.",
        "source_5": "Reuters (May 2012) — Polish leaders (as co-hosts) opposed a boycott, urging engagement instead and warning it would unfairly harm Poland and athletes while being unlikely to alter Ukraine’s internal legal decisions. This offers a regional, practical argument against the boycott.",
        "source_6": "The Guardian/CNN reporting (May 2012) — Yevgenia (Eugenia) Tymoshenko and opposition allies publicly urged European politicians to boycott Euro 2012 matches in Ukraine until Yulia Tymoshenko was freed and properly treated. This shows domestic opposition leveraging the tournament to increase external pressure for her release."
    }
}