{
    "question": "Were the US and its allies justified in taking military action against Iraq following Iraq’s invasion of Kuwait?",
    "content": {
        "source_1": "United Nations Security Council Resolution 678 (Nov 29, 1990) — Authorizes Member States “to use all necessary means” to implement Resolution 660 and restore international peace and security if Iraq did not withdraw by Jan 15, 1991, providing a clear legal basis for military action. https://undocs.org/S/RES/678(1990)",
        "source_2": "United Nations Security Council Resolution 674 (Oct 29, 1990) — Condemns Iraqi violations of international law in occupied Kuwait, including hostage-taking, mistreatment of civilians and diplomats, and deportations; documents humanitarian abuses used to argue urgency and moral justification for intervention. https://undocs.org/S/RES/674(1990)",
        "source_3": "The New York Times, “Arab League Backs Saudi Request for Troops; Condemns Iraq” (Aug 11, 1990) — Reports the Arab League’s 12–9 vote to condemn Iraq and support the deployment of Arab forces alongside international troops, indicating regional backing (though divided) that bolstered the coalition’s political legitimacy. https://www.nytimes.com/1990/08/11/world/after-the-invasion-arab-league-backs-saudi-request-for-troops-condemns-iraq.html",
        "source_4": "Human Rights Watch (Arms Project), “Needless Deaths in the Gulf War: Civilian Casualties During the Air Campaign and Violations of the Laws of War” (1991) — Documents extensive civilian harm from coalition bombing of dual-use infrastructure (electricity, water, bridges), raising proportionality and necessity concerns that challenge the justness of how the war was conducted. https://www.hrw.org/reports/1991/gulfwar/",
        "source_5": "The Washington Post, “Soviets Announce Iraqi Acceptance of Withdrawal Plan; U.S. Calls It Inadequate” (Feb 22, 1991) — Details a late-stage Soviet diplomatic initiative proposing a timed Iraqi withdrawal from Kuwait that Washington rejected as insufficient, suggesting viable non-military alternatives may have existed. https://www.washingtonpost.com/archive/politics/1991/02/22/soviets-announce-iraqi-acceptance-of-withdrawal-plan-us-calls-it-inadequate/",
        "source_6": "National Security Archive, “Shaking Hands with Saddam Hussein: The U.S. Tilts Toward Iraq, 1980–1984” (EBB No. 82, Feb 25, 2003) — Presents declassified records of U.S. support for Iraq during the Iran–Iraq War, including tolerance of Iraqi abuses, supporting critiques that 1991 intervention motives included oil and geopolitical dominance rather than consistent principle. https://nsarchive2.gwu.edu/NSAEBB/NSAEBB82/"
    }
}