{
    "question": "In what ways could NASA’s push to deploy a 100-kilowatt lunar nuclear reactor by 2030 shape the feasibility of sustained human presence on the Moon, the involvement of commercial partners, and emerging international norms around access and potential “keep-out” zones?",
    "content": {
        "source_1": "This is the first major agency effort by the interim NASA administrator, who is also the Transportation secretary and a former Fox News host.\n\nTransportation Secretary Sean Duffy, who is also the interim NASA administrator, testifies during a House Committee on Transportation and Infrastructure hearing on July 16, 2025.  | Rod Lamkey Jr./AP\n\nTransportation Secretary Sean Duffy will announce expedited plans this week to build a nuclear reactor on the moon, the first major action by the former Fox News host as the interim NASA administrator.\n\nNASA has discussed building a reactor on the lunar surface, but this would set a more definitive timeline — according to documents obtained by POLITICO — and come just as the agency faces a massive budget cut. The move also underscores how Duffy, whofaced pushbackfrom lawmakers about handling two jobs, wants to play a role in NASA policymaking.\n\n“It is about winning the second space race,” said a NASA senior official, granted anonymity to discuss the documents ahead of their wider release.\n\nPresident Donald Trump named Duffy as interim administrator in July after abruptlywithdrawing the nominationof billionaire Jared Isaacman amid a spat with the nominee’s ally, Elon Musk.\n\nDuffy also offered a directive to more quickly replace the International Space Station, another NASA goal. The two moves could help accelerate U.S. efforts to reach the moon and Mars — a goal that China is also pursuing.\n\nThe plans align with the Trump administration’s focus on crewed spaceflight. The White House has proposed a budget that would increasehuman spaceflightfunds for 2026, even as it advocates for major slashes to other programs — including a nearly 50 percent cut for science missions.\n\nThe reactor directive orders the agency to solicit industry proposals for a 100 kilowatt nuclear reactor to launch by 2030, a key consideration for astronauts’ return to the lunar surface. NASApreviously funded researchinto a 40 kilowatt reactor for use on the moon, with plans tohave a reactor ready for launchby the early 2030s.\n\nThe first country to have a reactor could “declare a keep-out zone which would significantly inhibit the United States,” the directive states, a sign of the agency’s concern about a joint project China and Russia have launched.\n\nThe directive also orders NASA to designate a leader for the effort and to get industry input within 60 days. The agency is seeking companies able to launch a reactor by 2030 since that’s around the time China intends to land its first astronaut on the moon.\n\nThe nuclear initiative means that NASA will continue to have a hand in nuclear development even after the Pentagon’s recent cancellation of a joint program on nuclear-powered rocket engines.\n\n“While the budget did not prioritize nuclear propulsion, that wasn’t because nuclear propulsion is seen as a non-worthy technology,” the NASA official said.\n\nThe space station directive aims to replace theaging, leaky International Space Stationwith commercially run ones by changing how the agency awards contracts.\n\nNASA plans to award at least two companies a contract within six months of the agency’s request for proposals. Officials hope to put a new station in space by 2030. Otherwise, only China would have a permanently crewed space station in orbit.\n\nSeveral companies have risen to meet the space station demand, including Axiom Space, Vast, and Blue Origin. But lawmakers haveexpressed concernin recent months that the agency is not moving fast enough to give them the funds they need.",
        "source_2": "US space agency Nasa will fast-track plans to build a nuclear reactor on the Moon by 2030, according to US media.\n\nIt is part of US ambitions to build a permanent base for humans to live on the lunar surface.\n\nAccording to Politico, the acting head of Nasa referred to similar plans by China and Russia and said those two countries \"could potentially declare a keep-out zone\" on the Moon.\n\nBut questions remain about how realistic the goal and timeframe are, given recent and steep Nasa budget cuts, and some scientists are concerned that the plans are driven by geopolitical goals.\n\nNations including the US, China, Russia, India and Japan are rushing to explore the Moon's surface, with some planning permanent human settlements.\n\n\"To properly advance this critical technology to be able to support a future lunar economy, high power energy generation on Mars, and to strengthen our national security in space, it is imperative the agency move quickly,\" US transport secretary Sean Duffy, who was appointed temporary head of Nasa by President Donald Trump, wrote to Nasa, according to the New York Times.\n\nMr Duffy called for proposals from commercial companies to build a reactor that could generate at least 100 kilowatts of power.\n\nThis is relatively small. A typical on-shore wind turbine generates 2-3 megawatts.\n\nThe idea of building a nuclear reactor as a power source on the Moon is not new.\n\nIn 2022 Nasa issued three $5m contracts to companies to design a reactor.\n\nAnd in May this year, China and Russia announced they plan to build an automated nuclear power station on the Moon by 2035.\n\nMany scientists agree that it would be the best or perhaps only way to provide continuous power on the lunar surface.\n\nOne lunar day is equivalent to four weeks on Earth, made up of two weeks of continual sunshine and two weeks of darkness. That makes relying on solar power very challenging.\n\n\"Building even a modest lunar habitat to accommodate a small crew would demand megawatt-scale power generation. Solar arrays and batteries alone cannot reliably meet those demands,\" suggests Dr Sungwoo Lim, senior lecturer in space applications, exploration and instrumentation at the university of Surrey\n\n\"Nuclear energy is not just desirable, it is inevitable,\" he adds.\n\nLionel Wilson, professor of earth and planetary sciences at Lancaster University, believes it is technically possible to place the reactors on the Moon by 2030 \"given the commitment of enough money\", and he highlights that there are already designs for small reactors.\n\n\"It's just a matter of having enough Artemis launches to build the infrastructure on the Moon by then,\" he adds, referring to Nasa's Artemis spaceflight programme that aims to send people and equipment to the Moon.\n\n\"Launching radioactive material through the Earth's atmosphere brings safety concerns. You have to have a special license to do that, but it is not insurmountable,\" says Dr Simeon Barber, planetary science specialist at the Open University.\n\nMr Duffy's directive came as a surprise following recent turmoil in Nasa after Mr Trump's administration announced cuts of 24% to Nasa's budgets in 2026.\n\nThat includes cuts to a significant number of science programmes such as the Mars Sample Return that aims to return samples from the planet's surface to Earth.\n\nScientists are also concerned that this announcement is a politically-motivated move in the new international race to the Moon.\n\n\"It seems that we're going back into the old first space race days of competition, which, from a scientific perspective, is a little bit disappointing and concerning,\" says Dr Barber.\n\n\"Competition can create innovation, but if there's a narrower focus on national interest and on establishing ownership, then you can lose sight of the bigger picture which is exploring the solar system and beyond,\" he adds.\n\nMr Duffy's comments about the potential for China and Russia to potentially \"declare a keep-out zone\" on the Moon appear to be referring to an agreement called the Artemis accords.\n\nIn 2020 seven nations signed the agreement to establish principles on how countries should co-operate on the Moon's surface.\n\nThe accords include so-called safety zones to be established around operations and assets that countries build on the Moon.\n\n\"If you build a nuclear reactor or or any kind of base on the moon, you can then start claiming that you have a safety zone around it, because you have equipment there,\" says Dr Barber.\n\n\"To some people, this is tantamount to, 'we own this bit of the moon, we're going to operate here and and you can't come in',\" he explains.\n\nDr Barber points out that there are hurdles to overcome before placing a nuclear reactor on the Moon for humans to use.\n\nNasa's Artemis 3 aims to send humans to the lunar surface in 2027, but it has faced a series of set-backs and uncertainty around funding.\n\n\"If you've got nuclear power for a base, but you've got no way of getting people and equipment there, then it's not much use,\" he added.\n\n\"The plans don't appear very joined up at the moment,\" he said.\n\nThe commander of Apollo 13 famously rescued his men from near certain death in space.\n\nJim Lovell, who guided Apollo 13 safely back to Earth, has died aged 97.\n\nOf the 24 Nasa astronauts who travelled to the Moon in the Apollo missions of the 1960s and 1970s, just five remain.\n\nThe astronaut ends a 25-year career after his last mission saw him spend much longer than expected on the ISS.\n\nThe four-person crew, who launched a day late due to weather, will relieve members of the previous SpaceX mission onboard the station.",
        "source_3": "Acting NASA administrator Sean Duffy explains how the agency's Artemis program aims to return Americans to the Moon on 'Hannity.'\n\nTransportation SecretarySean Duffywill reportedly announce plans this week to build a nuclear reactor on the moon, according to media reports.\n\nNASA has had discussions about the building of a reactor on the lunar surface, but Duffy's directive gives a more definitive timeline and expedites the process. Duffy also serves as the interim administrator of the space agency.\n\n\"Fission surface power (FSP) is both an essential and sustainable segment of the lunar and Mars power architectures for future human space exploration missions,\" the directive states. \"To properly advance this critical technology to be able to support a future lunar economy, high power energy generation on Mars, and to strengthen our national security in space, it is imperative the agency move quickly.\"\n\nTRUMP TAPS SEAN DUFFY TO SERVE AS INTERIM NASA CHIEF\n\nTransportation Secretary Sean Duffy reportedly plans to announce plans to build a nuclear reactor on the moon.(Getty Images; AP)\n\nChina and Russia have announced on several occasions a joint effort to place a reactor on the moon by the mid-2030s, NASA said. If successful, that would potentially result in the declaration of a \"keep-out zone,\" which could inhibit the United States from establishing a presence there.\n\n\"There are very specific areas of the moon that are critical that who gets there first gets to plant their flag,\" Duffy recently said on \"Hannity.\" \"We know the Chinese want to get there as well, so speed is of the essence.\"\n\nThe move means that NASA will continue to have input in nuclear development, despite the Pentagon’s recent cancellation of a joint program on nuclear-powered rocket engines.\n\nThe agency will be required to solicit proposals for a 100 kilowatt nuclear reactor to launch by 2030, around the time China intends to put aman on the moon, within 60 days of the directive.\n\nDuffy spoke with Fox News about how NASA's Artemis program aims to return Americans to the Moon.\n\n\"We're going to set up a base camp,\" Duffy said. \"And what we learn on the moon is going to take us to Mars.\"\n\nDuffy also issued another directive to quickly replace the International Space Station, a priority for NASA. The agency plans to award at least two companies, preferably three of four, a contract within six months of the agency’s request for proposals.\n\nSNUB OF MUSK'S NASA NOMINEE ALLY PRECEDED SUDDEN 'BIG, BEAUTIFUL BILL' CRITICISM, TRUMP FEUD\n\nA supermoon with a partial lunar eclipse rises over Lake Michigan in Chicago, Sept. 17, 2024.(AP Photo/Kiichiro Sato, File)\n\nIn April, China launched three astronauts into space to begin a six-month-long mission aboard the Tiangong space station, which translates to Heavenly Palace.\n\nChina built its own space stationafter it was excluded from the International Space Station, amid U.S. concerns over the Chinese space programs’ ties with the People's Liberation Army, the military branch of the ruling Communist Party.\n\nNASA has increasinglyfactored into the Trump administration’s national defense, innovation, and economic agenda.\n\nTrump announced Duffy to serve as interim administrator of NASA in July as withdrawing the nomination of Jared Isaacman in May.\n\nIsaacman, a billionaire private astronaut and longtimeassociate of Elon Musk, was nominated by Trump in December 2024 but faced mounting scrutiny over ties to Musk and SpaceX, which some officials viewed as a conflict of interest.\n\nThe International Space Station was launched into orbit in 1998. At the time, the U.S. agreed to the peaceful use of the orbital laboratory with several other countries, including Russia, Japan, Canada and 11 European countries.\n\nLouis Casiano is a reporter for Fox News Digital. Story tips can be sent tolouis.casiano@fox.com.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}