{
    "question": "How might the phased 24-hour ceasefire announced by President Trump, brokered with Qatar’s help after the recent exchanges of strikes, influence immediate de-escalation and the longer-term trajectory of Iran’s nuclear program and regional stability?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nU.S. President Donald Trump said that Israel and Iran had agreed to a “complete and total ceasefire” soon after Iran launched a limited missile attack Monday on a U.S. military base in Qatar, retaliating for the American bombing of its nuclear sites.\n\nIran launched a missile attack Monday on a U.S. military base in Qatar, retaliating for the American bombing of its nuclear sites.\n\nAmericans react after the United States struck three sites in Iran early Sunday, inserting itself into Israel’s war aimed at destroying the country’s nuclear program. (AP video: Mingson Lau, Nick Ingram, Amanda Swinhart)\n\nPresident Donald Trump arrives with Vice President JD Vance, Secretary of State Marco Rubio and Defense Secretary Pete Hegseth to speak from the East Room of the White House in Washington, Saturday, June 21, 2025, after the U.S. military struck three Iranian nuclear and military sites, directly joining Israel’s effort to decapitate the country’s nuclear program. (Carlos Barria/Pool via AP)\n\nVice President JD Vance speaks with Bret Baier, right, on FOX News Channel’s Special Report with Bret Baier at the FOX News bureau in Washington, Monday, June 23, 2025.(AP Photo/J. Scott Applewhite)\n\nWhite House press secretary Karoline Leavitt talks with reporters at the White House, Monday, June 23, 2025, in Washington. (AP Photo/Evan Vucci)\n\nWASHINGTON (AP) — PresidentDonald Trumpon Monday said the “12 day war” between Israel and Iran was set to end in a ceasefire, holding out the expected deal as validation for his strategic gamble of ordering U.S. airstrikes onIranian nuclear sites.\n\n“It has been fully agreed by and between Israel and Iran that there will be a Complete and Total CEASEFIRE,” Trump posted on social media.\n\nIran’s Foreign MinisterAbbas Araghchisaid Iran would stop its attacks if Israel would. It’s unclear what role Ayatollah Ali Khamenei, Iran’s leader, played in the talks. He had said on social media earlier Monday that Iran would not surrender. Israel has not publicly confirmed that it has agreed to end hostilities.\n\n“As of now, there is NO ‘agreement’ on any ceasefire or cessation of military operations,” Araghchi posted on X. “However, provided that the Israeli regime stops its illegal aggression against the Iranian people no later than 4 am Tehran time, we have no intention to continue our response afterwards.”\n\nA ceasefire, if it culminates as Trump laid out, would be welcome news for the region and the world. But the situation in the Middle East remains far from stable and it’s unclear how longer-term dynamics might be affected. The Israeli and U.S. bombing of Iran certainly has slowed Iran’s ability to enrich nuclear material but it might also have steeled Tehran’s resolve to breakout toward a bomb.\n\nTrump’s announcement comes as he prepared to depart on Tuesday for theNATO summitin the Netherlands, where he will likely make the case that his mix of aggression and diplomacy has succeeded.\n\nNever shy to suggest he deserves the Nobel Peace Price, Trump went so far as to give the conflict between Israel and Iran the name of the “12 day war,” a title that seemed to reference the 1967 “Six Day War” in which Israel fought a group of Arab countries including Egypt, Jordan and Syria.\n\nLater, Trump in another social media posting said that “Israel & Iran came to me, almost simultaneously, and said, ‘PEACE!’”\n\n“They have so much to gain, and yet, so much to lose if they stray from the road of RIGHTEOUSNESS & TRUTH,” Trump added. “The future for Israel & Iran is UNLIMITED, & filled with great PROMISE. GOD BLESS YOU BOTH!”\n\nAs Trump described it, the ceasefire would start with Iran and then be joined by Israel 12 hours later, with the president writing that the respective sides would “remain PEACEFUL and RESPECTFUL.” The phased-in ceasefire was set to begin Tuesday morning in Israel and Iran and culminate within 24 hours.\n\nBut Iran launched another attack on Israel after 4 a.m. local time in Tehran, the time Iran’s foreign minister said Iran would cease its attacks if Israel ended their airstrikes.\n\n“This is a War that could have gone on for years, and destroyed the entire Middle East, but it didn’t, and never will!” Trump said.\n\nThe White House reposted Trump’s announcement with a photo of the president holding a red hat that said “Trump was right about everything” in all capital letters.\n\nPresident Donald Trump arrives with Vice President JD Vance, Secretary of State Marco Rubio and Defense Secretary Pete Hegseth to speak from the East Room of the White House in Washington, Saturday, June 21, 2025, after the U.S. military struck three Iranian nuclear and military sites, directly joining Israel’s effort to decapitate the country’s nuclear program. (Carlos Barria/Pool via AP)\n\nA senior White House official said Trump communicated directly with Israeli Prime MinisterBenjamin Netanyahuto secure the ceasefire. The official, who insisted on anonymity to discuss the Monday talks, saidVice President JD Vance,Secretary of State Marco Rubio and special envoySteve Witkoff. communicated with the Iranians through direct and indirect channels.\n\nThe official said the Qatari government played an important role in brokering the coming ceasefire. Trump spoke to Qatar’s emir,Sheikh Tamim bin Hamad Al Thani,to thank him for helping land the agreement. The Gulf emirate has been chief interlocutor in the on-and-off ceasefire and hostage negotiationsbetween Israel and Hamasin their ongoing war in Gaza.\n\nThe exact terms of the ceasefire other than the timeline provided by the Trump administration remained to be seen.\n\nVice President JD Vance speaks with Bret Baier, right, on FOX News Channel’s Special Report with Bret Baier at the FOX News bureau in Washington, Monday, June 23, 2025.(AP Photo/J. Scott Applewhite)\n\nOn Sunday, the Trump administration had insisted that Iran abandon its program to enrich uranium for possible use in nuclear weapons as a condition of any lasting peace. While the bombings of the Fordo, Natanz and Isfahan facilities were a powerful show of force, it remained uncertain just how much nuclear material Iran still possessed and what its ambitions would be going forward.\n\nVancesaid in a TV interview just as the ceasefire was announced that the world would look back at the war between Israel and Iran — and the U.S. bombing of Iran’s nuclear facilities — as “an important reset moment for the entire region.”\n\nAppearing on Fox News Channel’s “Special Report,” the vice president said the Trump administration hoped that the Iranians had learned an important lesson: If they want to build a nuclear weapon in the future, he said, “they’re going to have to deal with a very, very powerful American military again.”\n\nWhite House press secretaryKaroline Leavittposted on the social media site X an Associated Press headline of the news and wrote that Trump “has accomplished what no other president in history could ever imagine — the obliteration of the Iranian Regime’s nuclear program, and an unprecedented ceasefire between Israel and Iran.”\n\nThe ceasefire announcement came after Iran attempted to retaliate for the U.S. assault with aMonday missile strikeaimed at a major U.S. military installation in the Gulf nation of Qatar. Trump separately thanked Iran on social media for giving the U.S. and allies “early notice” of the retaliation.\n\nThe president expressed hope that Tehran — with its reprisal for the U.S. bombardment of three key Iranian nuclear facilities — had “gotten it all out of their ‘system’” and that the moment would lead to a de-escalation in the Israel-Iran war.\n\nThe Iranian attack on U.S. forces at Qatar’s Al Udeid Air Base marked Tehran’s first act of direct retaliation against the U.S. since Trump ordered strikes on Iran’s nuclear facilities.\n\nAmericans react after the United States struck three sites in Iran early Sunday, inserting itself into Israel’s war aimed at destroying the country’s nuclear program. (AP video: Mingson Lau, Nick Ingram, Amanda Swinhart)\n\nTrump said Iran launched 14 missiles at the base, a sprawling facility that hosts the forward headquarters of the U.S. military’s Central Command and was a major staging ground during the U.S. wars in Iraq and Afghanistan.\n\nThe president said 13 of the Iranian missiles “were knocked down” by U.S. air defense systems while one was “‘set free’ because it was headed in a nonthreatening direction.”\n\nAssociated Press writers Stan Choe in New York, Jon Gambrell in Dubai, United Arab Emirates, and Matthew Lee and Eric Tucker in Washington contributed to this report.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Anna Commander is a Newsweek Editor and writer based in Florida. Her focus is reporting on crime, weather and breaking news. She has covered weather, and major breaking news events in South Florida. Anna joined Newsweek in 2022 from The National Desk in Washington, D.C. and had previously worked at CBS12 News in West Palm Beach. She is a graduate of Florida Atlantic University. You can get in touch with Anna by emailinga.commander@newsweek.com.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nBased in his hometown of Staten Island, New York City, Tom O'Connor is an award-winning Senior Writer of Foreign Policy and Deputy Editor of National Security and Foreign Policy at Newsweek, where he specializes in covering the Middle East, North Korea, China, Russia and other areas of international affairs, relations and conflict. He has previously written for International Business Times, the New York Post, the Daily Star (Lebanon) and Staten Island Advance. His works have been cited in more than 1,800 academic papers, government reports, books, news articles and other forms of research and media from across the globe. He has contributed analysis to a number of international outlets and has participated in Track II diplomacy related to the Middle East as well as in fellowships at The Korea Society and Foreign Press Center Japan. Follow@ShaolinTomfor daily news on X andhis official Facebook page. Emailt.oconnor@newsweek.comwith tips or for media commentary and appearances. Languages: English and Arabic\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nPresidentDonald Trumpcoordinated with Qatari leadership to secure the ceasefire agreement he announced Monday between Iran and Israel following aretaliatory Iranian missile strike on America's largest military base in the Middle East,according to a diplomat briefed on the development.\n\n\"The deal was coordinated at the highest level by the President and Vice President and the Qatari Emir and Prime Minister directly,\" the diplomat toldNewsweek.\n\nIsrael's government has yet to publicly comment on the development. A senior Iranian official told Reuters that Tehran had agreed to the U.S.-proposed ceasefire.\n\nThe Iranian Mission to theUnited NationsdeclinedNewsweek's request for comment.Newsweekhas also reached out to an Israeli official.\n\nTrump unveiled the deal on Monday in a post to his Truth Social platform, hours after Iran launched a number ofballistic missiles against the U.S. military's Al-Udeid Air Base in Qatar.The Iranian operation followed an unprecedented series of direct U.S. strikes ordered by Trump on Saturday targeting three key Iranian nuclear facilities.\n\nThe U.S. leader said the deal would put an end within 24 hours to what he called the \"12-day war\" amid back-and-forth strikes launched by Iran and Israel after Tehran commenced operations on June 12 targeting sites and personnel tied to the Islamic Republic's nuclear program and armed forces.\n\nTrump appeared to indicate that Israel and Iran would be given time to finish any ongoing operations before a phased ceasefire would take effect.\n\nThe strikes from the United States over the weekend against Iran mark the first directU.S. militaryinvolvement in the escalating Israel-Iran war that began earlier this month.\n\nFollowing the U.S. air assault, Trump said on Truth Social that \"Monumental Damage was done to all Nuclear sites in Iran.\"The facilities targeted include the nuclear enrichment facilitiesof Isfahan, Natanz and Fordow, the latter being a heavily fortified compound up to 300 feet below a mountain outside the city of Qom.\n\nThe strike was carried out by B-2 stealth bombers using the Massive Ordinance Penetrator (MOP), a 15-ton bomb long been assessed as the only conventional munition capable of inflicting lasting damage to the Fordow Fuel Enrichment Plant.\n\nIranian officials have always denied seeking a nuclear weapon. Officials from Israel, which is widely believed to possess a nuclear arsenal, have alleged that the country had amassed enough nuclear material to produce up to 15 bombs, prompting Israeli Prime MinisterBenjamin Netanyahuto order a \"preemptive\" campaign against Iran.\n\nThe Israel Defense Forces (IDF) have launched hundreds of strikes across Iran, targeting nuclear facilities, military sites and killing senior personnel, including military commanders and nuclear scientists. Military tensions between the two countries have rapidly heightened in the days since, with Iran launching hundreds of missiles and drones against Israel.\n\nIn a post on Truth SocialTrump announced the deal, saying, \"CONGRATULATIONS TO EVERYONE! It has been fully agreed by and between Israel and Iran that there will be a Complete and Total CEASEFIRE (in approximately 6 hours from now, when Israel and Iran have wound down and completed their in progress, final missions!), for 12 hours, at which point the War will be considered, ENDED!\"\n\nThe president outlined that Iran would start the ceasefire and Israel would join at the 12th hour. Trump continued, \"upon the 24th Hour, an Official END to THE 12 DAY WAR will be saluted by the World.\"\n\nConcluding, the president added: \"During each CEASEFIRE, the other side will remain PEACEFUL and RESPECTFUL. On the assumption that everything works as it should, which it will, I would like to congratulate both Countries, Israel and Iran, on having the Stamina, Courage, and Intelligence to end, what should be called, 'THE 12 DAY WAR.' This is a War that could have gone on for years, and destroyed the entire Middle East, but it didn't, and never will! God bless Israel, God bless Iran, God bless the Middle East, God bless the United States of America, and GOD BLESS THE WORLD!\"\n\nQatar, along with much of the Arab world, condemned the Iranian missile strike against Al Udeid. Most regional countries have also condemned Israel for its attacks on Iran.\n\nTwo U.S. defense officials toldNewsweekthat no U.S. casualties were reported from the Iranian missile strike, said to have been carried out using short- and medium-range ballistic missiles. Qatari officials issued statements backing the reports, while acknowledging one out of 19 projectiles struck the U.S. military facility.\n\nTrump offered a different figure of 14 missiles fired by Iran, all but one of which had been intercepted. Yet he also downplayed the attack as \"very weak,\" and thanked Tehran for what he described as \"early notice\" provided to the U.S. ahead of the strikes on Monday, \"which made it possible for no lives to be lost, and nobody to be injured.\"\n\nHe expressed optimism that Tehran—with its counterstrike to the U.S. bombingof the Iranian nuclear facilities on Saturday—had \"gotten it all out of their 'system,'\" and voiced hope the exchange would mark a turning point toward de-escalation in the ongoing conflict between Israel and Iran.\n\n\"Perhaps Iran can now proceed to Peace and Harmony in the Region, and I will enthusiastically encourage Israel to do the same,\" Trump said.\n\nVice President JD Vance posted on X, formerly Twitter:\"Thanks to President Trump's bold leadership, the Iranian nuclear program has been obliterated and the 12 Day War is over. This is a historic moment and a massive step toward lasting peace in the Middle East.\"\n\nSpeaking on Iranian state television, an overnight anchor repeatedly referred to a \"Trump-claimed\" ceasefire, without saying whether Tehran accepted it. The anchor noted, according to the Associated Press (AP):\"Simultaneously with Trump's claim of a ceasefire, the Zionist enemy targeted several points in the cities of Tehran, Urmia and Rasht, including a residential area in the capital.\"\n\nWhite House press secretary Karoline Leavitt posted to X an AP headline of the news and wrote that Trump\"has accomplished what no other president in history could ever imagine — the obliteration of the Iranian Regime's nuclear program, and an unprecedented ceasefire between Israel and Iran.\"\n\nHarry Sisson, a liberal social media influencer, posted to X:\"Trump has announced a ceasefire between Iran and Israel. He is, once again, celebrating fixing a problem he created. The Trump cycle is:\n\n1. Create a problem2. Fix the problem3. MAGA celebrates him\n\nIsrael's preferred outcome is for Iran to agree to a ceasefire and resume negotiations with the United States over its nuclear program, an official told AP. But Israel is also prepared for the alternative—a prolonged, low-intensity conflict or a period of \"quiet for quiet,\" during which it would maintain close surveillance of Iranian activity and respond with force if new threats emerge.\n\nWith no official confirmation of the deal from either Iran or Israel, and a lingering window for hostilities, peace remains far from guaranteed.\n\nUpdate: 6/23/25, 8:43 p.m. ET: This article was updated with new information and comments.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nAnna Commander is a Newsweek Editor and writer based in Florida. Her focus is reporting on crime, weather and breaking news. She has covered weather, and major breaking news events in South Florida. Anna joined Newsweek in 2022 from The National Desk in Washington, D.C. and had previously worked at CBS12 News in West Palm Beach. She is a graduate of Florida Atlantic University. You can get in touch with Anna by emailinga.commander@newsweek.com.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nBased in his hometown of Staten Island, New York City, Tom O'Connor is an award-winning Senior Writer of Foreign Policy and Deputy Editor of National Security and Foreign Policy at Newsweek, where he specializes in covering the Middle East, North Korea, China, Russia and other areas of international affairs, relations and conflict. He has previously written for International Business Times, the New York Post, the Daily Star (Lebanon) and Staten Island Advance. His works have been cited in more than 1,800 academic papers, government reports, books, news articles and other forms of research and media from across the globe. He has contributed analysis to a number of international outlets and has participated in Track II diplomacy related to the Middle East as well as in fellowships at The Korea Society and Foreign Press Center Japan. Follow@ShaolinTomfor daily news on X andhis official Facebook page. Emailt.oconnor@newsweek.comwith tips or for media commentary and appearances. Languages: English and Arabic\n\nAnna Commander is a Newsweek Editor and writer based in Florida. Her focus is reporting on crime, weather and breaking news. She has covered weather, and major breaking news events in South Florida. Anna joined Newsweek in 2022 from The National Desk in Washington, D.C. and had previously worked at CBS12 News in West Palm Beach. She is a graduate of Florida Atlantic University. You can get in touch with Anna by emailinga.commander@newsweek.com.\n\nAnna Commander is a Newsweek Editor and writer based in Florida. Her focus is reporting on crime, weather and breaking                                    ...Read more",
        "source_3": "Fox News chief political anchor Bret Baier breaks down what led to President Donald Trump announcing a ceasefire agreement between Israel and Iran on 'The Ingraham Angle\n\nPresident Donald Trumpdeclared Israel and Iran have agreed to a ceasefire after missile exchanges, claiming the '12-day war' will end following a phased implementation over 24 hours.\n\n\"CONGRATULATIONS TO EVERYONE! It has been fully agreed by and between Israel and Iran that there will be a Complete and Total CEASEFIRE (in approximately 6 hours from now, when Israel andIran have wound downand completed their in progress, final missions!), for 12 hours, at which point the War will be considered, ENDED!\" Trump shared in a post on his social media platform Truth Social.\n\n\"Officially, Iran will start the CEASEFIRE and, upon the 12th Hour, Israel will start the CEASEFIRE and, upon the 24th Hour, an Official END to THE 12 DAY WAR will be saluted by the World,\" Trump added.\n\nTrump praised both countries for their \"Stamina, Courage, and Intelligence\" to end what he called \"THE 12 DAY WAR.\"\n\nWHY DID TRUMP LEAVE G7 EARLY? 'MUCH BIGGER' THAN IRAN CEASE-FIRE, HE SAYS\n\nWASHINGTON, DC - JUNE 21: (EDITOR'S NOTE: This Handout image was provided by a third-party organization and may not adhere to Getty Images' editorial policy.) In this handout provided by the White House, U.S. President Donald Trump and Secretary of State Marco Rubio (R) sit in the Situation Room as they monitor the mission that took out three Iranian nuclear enrichment sites, at the White House on June 21, 2025 in Washington, DC. According to the Pentagon, three of Iran’s nuclear sites sustained \"severe damage\" from the U.S. strikes.(Daniel Torok/The White House via Getty Images)\n\n\"This is a War that could have gone on for years, and destroyed the entire Middle East, but it didn’t, and never will! God bless Israel, God bless Iran,God bless the Middle East,God bless the United States of America, and GOD BLESS THE WORLD!\" he continued.\n\nTRUMP SAYS IRAN WOULD 'LIKE TO TALK' ABOUT DIALING DOWN ISRAEL-IRAN CONFLICT\n\nPresident Donald Trump and an image of an Israeli strike on Iran. Trump said he believes Israel and Iran can strike a deal to halt the fighting between both nations.(Getty Images; AP)\n\nA senior Iranian official also confirmed the ceasefire deal,according to Reuters.\n\nQatar's prime minister secured Iran's agreement to a U.S.-proposed ceasefire with Israel after Iran's strikes on a U.S. air base and Trump sought Qatar's diplomatic help.\n\nA diplomat briefed on the ceasefire talks shared more details on the deal with Fox News.\n\n\"President Trump spoke with Qatar’s Emir and informed him the U.S. got Israel to agree to a ceasefire with Iran,\" the source shared. \"The President asked Qatar to help persuade Iran to do the same, following that Vice President Vance coordinated with Qatar’s Prime Minister on the details.\"\n\nThe source added that \"this effort proved successful and, following discussions with the Qatari PM, the Iranians agreed.\"\n\nTRUMP SAYS ISRAEL AND IRAN 'HAVE TO FIGHT IT OUT' BUT BELIEVES DEAL IS POSSIBLE\n\n\"The deal was coordinated at the highest level by the President and Vice President and the Qatari Emir and Prime Minister directly,\" the source continued.\n\n\"Despite having been attacked just hours earlier, the Qataris set aside their grievances and prioritized regional security to get the deal done.\"\n\nRep. Jared Moskowitz, D-Fla., spoke to reporters following the announcement, saying that it \"looks like the ceasefire news is real.\"\n\n\"If you're saying that Israel could degrade Iran's military, the United States could degrade Iran's nuclear capability in 12 days, and not a single American life or us going to war, that sounds like a win for the country,\" Moskowitz said.\n\nHouse Intel Ranking Member Rep. Jim Himes, R-Ct., also spoke to reporters following the announcement, acknowledging that he learned of the deal on social media.\n\n\"I saw the tweet too, and like everything else, I'm sort of learning about things I should probably know about, via social media, which is uncomfortable,\" Himes said.\n\n\"Look, given the risks involved in the gamble the president took, if there is, in fact, a ceasefire, that would be a good thing, right? I mean, you know, the Iranians could close the Straits of Hormuz. They there could be all sorts of instability in the region. So I'm always going to cheer a ceasefire,\" Himes continued.\n\nTRUMP DEMANDS DO-OR-DIE NUCLEAR TALKS WITH IRAN. WHO HAS THE LEVERAGE?\n\nRep. Marlin Stutzman, R-Ind., also shared his thoughts on the ceasefire between Israel and Iran and called it \"huge.\"\n\n\"It sends a message to the greater part of the world that, this president, he will negotiate with you. He wants to find a way to do this. But if, if you're not going to negotiate, there's going to be consequences,\" Stutzman said.\n\nThe president's announcement comes after Iran launched at least six missiles toward America's Al-Udeid Air Base in Qatar on Monday, retaliating for Trump's attack on Tehran's nuclear program this weekend.\n\nQatar's foreign ministry condemned the strike in a statement, saying the missiles were destroyed and there were no casualties.\n\n\"I’d like to thank the Highly Respected Emir of Qatar for all that he has done in seeking Peace for the Region,\" Trump wrote in an earlier Monday post.\n\n\"Regarding the attack today at the American Base in Qatar, I am pleased to report that, in addition to no Americans being killed or wounded, very importantly, there have also been no Qataris killed or wounded. Thank you for your attention to this matter!'\n\nThis is a developing story. Check back here for updates.\n\nFox News' Louis Casiano contributed to this report.\n\nStepheny Price is a writer for Fox News Digital and Fox Business. She covers topics including missing persons, homicides, national crime cases, illegal immigration, and more. Story tips and ideas can be sent to stepheny.price@fox.com\n\nStepheny Price is a Writer atFox Newswith a focus on West Coast and Midwest news, missing persons, national and international crime stories, homicide cases, and border security.\n\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}