{
    "question": "In what ways could Iran’s reported advance notice and the interception of its missiles targeting the US-run Al Udeid base—along with Qatar’s condemnation and the absence of casualties—shape subsequent decisions by Washington, Tehran, and Doha about escalation or de-escalation?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nWatch a live view of the Jerusalem skyline in Israel.\n\nToday’s live updates on the Trump administration have ended. Find more coverage atAPNews.com\n\nIsrael warned its public to take shelter after detecting missile launches from Iran early Tuesday. The launches came after 4 a.m. local time in Tehran, the time Iranian Foreign Minister Abbas Araghchisaid Iran would stop its attacksif Israel ended their airstrikes.\n\nU.S. PresidentDonald Trumpsaid on social media Monday that Israel and Iran haveagreed to a “complete and total ceasefire”to be phased in over 24 hours. It is unclear yet how the latest developments will impact possible ceasefire agreements.\n\nPeople evacuating a building next to a site stuck by an Iranian missile strike, where several people killed, in Beersheba, Israel, on Tuesday, June 24, 2025. (AP Photo/Bernat Armangue)\n\nResidents evacuated the impacted buildings, carrying belongings in bags and stuffed suitcases.\n\nNeighbors and family members embraced while trying to figure out where to go next.\n\nMore than 9,000 Israelis have been displaced from their homes since the war with Iran began, according to the Prime Minister’s Office.\n\nYehezkiel Cheri said he was in a synagogue for morning prayers Tuesday when the first sirens went off.\n\nAs he made his way into his apartment building in between waves of missiles, he felt a huge explosion.\n\n“I saw fire in front of me, and I ran into the apartment,” he said.\n\n“I don’t think we need to continue this war. It’s a shame. These are souls of God, and we need to protect each one, from every country, everyone needs to care for each person,” he said.\n\nIsrael’s Airports Authority said the country’s airspace has reopened for emergency flights after closing earlier due to an hourslong barrage of missiles from Iran.\n\nIsraeli soldiers from the Home Front Command unit work at the site struck by an Iranian missile strike that killed several people, in Beersheba, Israel, on Tuesday, June 24, 2025. (AP Photo/Leo Correa)\n\nFirefighters inspect the site struck by an Iranian missile strike that killed several people, in Beersheba, Israel, on Tuesday, June 24, 2025. (AP Photo/Leo Correa)\n\nIsraeli security forces inspect the site struck by an Iranian missile strike that killed several people, in Beersheba, Israel, on Tuesday, June 24, 2025. (AP Photo/Leo Correa)\n\nIsrael police said the barrage damaged at least three densely packed residential buildings in Beersheba.\n\nOutside, the shells of burned out cars littered the streets. Broken glass and rubble covered the area.\n\nHundreds of emergency workers gathered to search for anyone else trapped in the buildings.\n\nIsrael police said the impact of the hit was so great that some people were injured even while inside their reinforced safe rooms in each apartment.\n\nThe safe rooms are meant to withstand rockets and shrapnel but not direct hits from ballistic missiles.\n\nResidents evacuated damaged building with their suitcases Tuesday morning in Beersheba.\n\nSome said they were skeptical of the ceasefire, announced by Trump.\n\n“I don’t believe the Iranians,” said Ortal Avilevich, a resident who lives five minutes away from the blast.\n\n“I’m happy with Donald Trump and I think Iran is afraid of him, but I hope there is quiet right now.”\n\nIsraeli soldiers and rescue workers carry a body from a residential building destroyed by an Iranian missile strike that killed several people, in Beersheba, Israel, on Tuesday, June 24, 2025. (AP Photo/Leo Correa)\n\nIsraeli firefighters said they retrieved four bodies from a building hit by an Iranian missile in the city of Beersheba.\n\nThe direct hit in the largest city in southern Israel comes just days after the city’s hospital sustained significant damage in a missile strike.\n\nThe search and rescue team said they retrieved four bodies from one building in Beersheba and were searching for more.\n\nThe Israel Airports Authority said the barrages from Iran forced them to close the skies to all passenger planes, including emergency flights that were expected to land and depart on Tuesday.\n\nSome flights were forced to circle over the Mediterranean Sea, according to Israeli media.\n\nIsrael’s airports have been closed since the war with Iran began, but a handful of emergency flights had started arriving and departing over the past few days.\n\nIsraeli firefighters said they rescued at least three people, including children trapped in the rubble of an apartment building after an Iranian missile barrage struck southern Israel.\n\nIn Beersheba, first responders cordoned off blocks as they tried to assess how many people had been killed and injured.\n\nThe streets around the impact site were littered with glass and debris, windows were blown out of buildings as anxious neighbors stood outside their damaged houses.\n\nIsrael warned of another wave of incoming missiles 20 minutes after the ceasefire was supposed to come into effect.\n\nIranian state television reported Tuesday that a ceasefire had begun in its war with Israel, even as Israel warned the public of a new missile barrage launched from Iran.\n\nIt wasn’t immediately possible to reconcile the messages from Iran and Israel on the 12th day of their war.\n\nIranian state television announced the ceasefire in a graphic on screen, not immediately acknowledging the new missile barrage coming after the deadline set by President Donald Trump in his earlier ceasefire announcement.\n\nAn El Al flight from London circled offshore over the Mediterranean Sea as the barrages took place, waiting to land at Ben-Gurion International Airport.\n\nIsrael’s Magen David Adom rescue services said at least three people were killed and eight injured in the early morning barrage. A residential building in Israel’s south sustained heavy damage, emergency responders said.\n\nWaves of missiles sent Israelis across the country to bomb shelters for almost two hours Tuesday morning.\n\nIn southern Israel, what appeared to be a residential building sustained heavy damage, according to an image released by Israel’s Fire and Rescue Services. The face of the large 7-story building appeared blown off, with twisted metal and broken cement poking out.\n\nIsrael had again signaled people could leave their shelters, suggesting the second Iranian barrage of missiles had finished, before warning of a third barrage early Tuesday morning.\n\nHong Kong leader John Lee called on the international community to jointly safeguard global peace, saying he backed the idea of resolving conflicts through diplomatic means.\n\nIn a weekly press briefing, Lee said the immigration department received enquiries from 21 Hong Kong residents from Israel or Iran, and 20 of them left the countries safely. The department would maintain close contact with the remaining resident, he said.\n\nFacing the escalating tensions in the Middle East, Lee sought to allay concerns over Hong Kong’s commercial ties with the region. Lee said he believed the city’s cooperation with the Middle East would deepen because any government would strive to ensure that their economic development is not affected.\n\n“No matter how the world changes, economic and trade development needs to keep going,” he said.\n\nIn the first Iranian barrage, at least one missile interception could be seen in the sky over Jerusalem.\n\nThe announcement signals the missile barrage has ended.\n\nAlerts began going off on mobile phones in Israel, and sirens sounded in areas ahead of the missile barrage’s arrival.\n\nThe launch came after a promised Iranian halt to fire at 4 a.m. local time Tehran.\n\nIranian Foreign Minister Abbas Araghchi said Iran would halt its fire if Israel stopped its airstrikes. It’s unclear what the detected missile launch would do for that timeline.\n\nTrump communicated directly with Israeli Prime Minister Benjamin Netanyahu to secure the ceasefire, according to a senior White House official who insisted on anonymity to discuss the Monday talks.\n\nVice President JD Vance, Secretary of State Marco Rubio and special envoy Steve Witkoff communicated with Iranians through direct and indirect channels.\n\nThe White House has maintained that the Saturday bombing by the U.S. on Iran helped get Israel to agree to the ceasefire and that the Qatari government helped to broker the deal.\n\nIran’s foreign minister said Iran would stop its attacks if Israel would, though it’s unclear what role Ayatollah Ali Khamenei, Iran’s leader, played in the talks as he had said on social media that he would not surrender.\n\nOn social media, Trump called the war between Israel and Iran the “12 Day War.” That recalls the 1967 Mideast war, known by some as the “Six Day War,” in which Israel fought a group of Arab countries including Egypt, Jordan and Syria.\n\nTrump’s reference carries emotional weight for the Arab world, particularly Palestinians.\n\nIn the 1967 war, Israel captured the West Bank and east Jerusalem from Jordan, the Gaza Strip and the Sinai Peninsula from Egypt, and the Golan Heights from Syria. Though Israel later gave back the Sinai to Egypt, it still holds the other territories, setting the stage for decades of conflict that continue to reverberate today.\n\nQatar had shut down its airspace over the Iranian attack on Al Udeid Air Base.\n\nFlight-tracking data showed commercial aircraft again flying in Qatari airspace early Tuesday, signaling the capital believed the threat on the energy-rich nation had passed.\n\nThat’s in line with Foreign Minister Abbas Araghchi’ remarks on the possible ceasefire.\n\n“Together with all Iranians, I thank our brave Armed Forces who remain ready to defend our dear country until their last drop of blood, and who responded to any attack by the enemy until the very last minute,” Iranian Foreign Minister Abbas Araghchi said.\n\nIntense Israeli airstrikes targeted Tehran and other areas up until 4 a.m. local time. Israel in other conflicts typically steps up its strikes just before ceasefires take effect.\n\nIranian Foreign Minister Abbas Araghchi says Tehran will stop its attacks if Israel stops its airstrikes by 4 a.m. local time.\n\nThe comment marked the first official remarks by Iran to Trump’s claimed ceasefire between Iran and Israel.\n\nAraghchi sent his message on the social platform X at 4:16 a.m. Tehran time.\n\n“As of now, there is NO ‘agreement’ on any ceasefire or cessation of military operations,” Araghchi wrote. “However, provided that the Israeli regime stops its illegal aggression against the Iranian people no later than 4 am Tehran time, we have no intention to continue our response afterwards.”\n\nIran, mirroring the language and maps of the Israeli military, put out a warning telling people in Ramat Gan it would target “military infrastructure” there.\n\nThe U.S. has evacuated some 250 American citizens and their immediate family members from Israel by government, military and charter flights that began over the weekend, a State Department official says.\n\nSince June 21, the official says the U.S. has organized seven flights, most of which have to gone to Athens, Greece, but also to Rome, Italy, and Larnaca, Cyprus.\n\nOther Americans, including nonessential embassy staff and their families, have left via land to Jordan and Egypt, while others have departed Israel by ship. The official did not have statistics for those departures, which do not necessarily involve U.S. government assistance.\n\nThere are roughly 700,000 American citizens, most of them dual U.S.-Israeli citizens, believed to be in Israel.\n\nIran’s mission declined to comment on Trump’s ceasefire post, and the Israeli mission said it had no immediate comment.\n\nMeanwhile, Iranian media reported ongoing Israeli airstrikes, including around Tehran.\n\n“It’s a really remarkable achievement,” said Republican U.S. House Speaker Mike Johnson. “President Trump deserves all the credit. This is what peace through strength looks like. We haven’t seen this in a while, and it’s really a big sigh of relief here on Capitol Hill.”\n\nSpeaker of the House Mike Johnson, R-La., center, flanked by Rep. Gabe Evans, R-Colo., left, and House Majority Leader Steve Scalise, R-La., defends Donald Trump’s handling of protests in Los Angeles and echoed the president’s attacks on Democratic Gov. Gavin Newsom as Trump sends thousands of National Guard troops and 700 active duty Marines to quell the protests over raids by Immigration and Customs Enforcement, during a news conference at the RNC near the Capitol in Washington, Tuesday, June 10, 2025. (AP Photo/J. Scott Applewhite)\n\nThe White House reposted Trump’s social media post announcing a ceasefire between Israel and Iran with a photo of the president holding a red hat that says in all caps, “Trump was right about everything.”\n\nVice President JD Vance says he believes the world will look back at the war between Israel and Iran — and the U.S. bombing of Iran’s nuclear facilities — as “an important reset moment for the entire region.”\n\nPresident Donald Trump turns from the podium after speaking from the East Room of the White House in Washington, Saturday, June 21, 2025, after the U.S. military struck three Iranian nuclear and military sites, directly joining Israel’s effort to decapitate the country’s nuclear program, as Vice President JD Vance, Secretary of State Marco Rubio and Defense Secretary Pete Hegseth listen. (Carlos Barria/Pool via AP)\n\nVance appeared on Fox News Channel just minutes after Trump announced a phased-in ceasefire over the next 24 hours.\n\nThe vice president says the Trump administration hopes that the Iranians have learned an important lesson: If they want to build a nuclear weapon in the future, “they’re going to have to deal with a very, very powerful American military again.”\n\nVance says he thinks that will dissuade them not to do it.\n\nTrump’s social media post says the 24-hour phased-in ceasefire will begin at approximately midnight Tuesday EST, giving the two countries six hours to have “wound down and completed their in progress, final missions.”\n\nAt that point, he said, Iran will cease attacks, and 12 hours later, Tuesday at noon EST, Israel will also stop strikes, and after 12 more hours “the War will be considered, ENDED!”\n\nThere was no immediate reaction from Israel or Iran to Trump’s announcement or the timetable.\n\nPresident Donald Trump boards Air Force One at Morristown Municipal Airport in Morristown, N.J., Saturday, June 21, 2025. (AP Photo/Manuel Balce Ceneta)\n\nTrump said on social media that Israel and Iran have agreed to a “complete and total ceasefire” to be phased in over 24 hours.\n\nThe U.S. president said on Truth Social that the ceasefire would bring an “Official END” to war, a major change in the hostilities that follows a U.S. strike over the weekend on three Iranian nuclear sites.\n\n“On the assumption that everything works as it should, which it will, I would like to congratulate both Countries, Israel and Iran, on having the Stamina, Courage, and Intelligence to end, what should be called, ‘THE 12 DAY WAR,’” Trump posted.\n\nThe State Department has lifted the “shelter in place” warning to Americans in Qatar that it issued earlier Monday ahead of Iranian missile launches at a US military base there in retaliation for weekend U.S. airstrikes on Iranian nuclear facilities.\n\nThe embassy in Doha, which had also instructed official personnel to stay inside, revoked the guidance in a statement issued late Monday afternoon Washington time after nearly all of the missiles were intercepted and Iran signaled there would be no more.\n\nIt noted that Qatari airspace, which had been closed earlier, remained closed and that the security situation in the country could change rapidly.\n\nThe draft Security Council resolution, circulated to its 15 members for comments and obtained by The Associated Press, is almost certain to be vetoed by the United States in its present form. It could be changed in negotiations.\n\nIt “condemns in the strongest terms the attacks against peaceful nuclear sites and facilities” in Iran under safeguard by the U.N. nuclear watchdog, the International Atomic Energy Agency.\n\nThe draft also calls for “an immediate and unconditional ceasefire” in the Israel-Iran conflict, urgent protection of civilians and civilian infrastructure, and a diplomatic solution to Iran’s nuclear issue that guarantees its “exclusively peaceful nature” in exchange for the lifting of unilateral and multilateral sanctions against Iran.\n\nIsraeli soldiers inspect the site struck by a direct missile strike launched from Iran in Tel Aviv, Israel, on Sunday, June 22, 2025. (AP Photo/Bernat Armangue)\n\nIsraeli soldiers inspect the site struck by a direct missile strike launched from Iran in Tel Aviv, Israel, on Sunday, June 22, 2025. (AP Photo/Bernat Armangue)\n\nIn a makeshift base on the outskirts of Tel Aviv, more than a hundred reservists have been working around the clock trying to find survivors and dig people out of the rubble after missile strike.\n\nSoldiers said after Iran’s strike on the US base in Qatar they’re on high alert.\n\n“We’re very focused we think there’s going to be a response from Iran, we don’t know what to responses will be,” said Matan Schneider the company’s second in command for the search and rescue team.\n\nIran fired 19 missiles at the base in Qatar, and one impacted the facility but caused no casualties, a Qatari military officer said late Monday.\n\nMaj. Gen. Shayeq Al Hajri told reporters that seven missiles were fired from Iran and all were intercepted over the water between the two countries by Qatari air defenses. Iran then fired 12 more missiles and 11 were intercepted over Qatari territory, but one hit the U.S. base, Al Hajri said.\n\nIt was not immediately clear how much damage was caused by the missile.\n\nThe number of missiles differed from a figure given by Trump, who said 14 missiles were fired, 13 were knocked down and one was “set free” because it posed no threat.\n\nPresident Trump said Iran warned the U.S. before its missile strike Monday on an American air base in Qatar.\n\n“I want to thank Iran for giving us early notice, which made it possible for no lives to be lost, and nobody to be injured,” Trump wrote on social media.\n\nThe president expressed hope that the missile would be the end of Iranian retaliation for U.S. strikes on Iranian nuclear sites.\n\n“Most importantly, they’ve gotten it all out of their ‘system,’ and there will, hopefully, be no further HATE,” he said.\n\nA senior U.S. military official said that earlier reports of a missile launched at a base housing American forces in Iraq on Monday were a false alarm.\n\nThe official, who spoke on condition of anonymity because he was not authorized to comment publicly, said that “debris from a malfunctioning Iranian missile targeting Israel targeted an alert” of an impending attack on the Ain al-Assad base housing U.S. troops in western Iraq.\n\nAn Iraqi security official said earlier that the Iraqis had been informed by U.S. officials that missiles had been launched toward the base, but that no missiles ever arrived.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "US strikes on Iran's nuclear facilities did not destroy the Iranian nuclear programme and have probably only set it back by months, according to an intelligence evaluation\n\nDetails of the initial damage assessment from the Pentagon's Defense Intelligence Agency were leaked to the BBC's US partner CBS and other media\n\nThe White House says the assessment is \"flat-out wrong\" and is \"a clear attempt to demean\" President Trump\n\nMeanwhile, a ceasefire appears to have taken hold between Israel and Iran, with both nations acknowledging it is in place\n\nIsrael's PMhails a \"historic victory\"for his country in an address to his nation, while Iran's president says his people haddetermined the end of the \"12-day-war\"\n\nWatch: Trump uses expletive in warning to Iran and Israel\n\nEdited by Jude Sheerin, with reporting from BBC Persian and correspondents in Jerusalem\n\nFor technical reasons, we are transferring our live coverage to a new page here:\n\nHope you can join us as we monitor the ceasefire through the night in Iran and Israel.\n\nAboard Air Force One en route to the Nato summit in the Netherlands, Trump shared a personal text message from a somewhat unlikely source.\n\nIt was sent by Nato boss Mark Rutte, who praised the American president for what he had accomplished in using US bombers to attack Iran's nuclear facilities.\n\n\"Congratulations and thank you for your decisive action in Iran, \" wrote Rutte in a message the president posted to his Truth Social account.\n\nThe warm words, and the president's eagerness to share them to the world, illustrated just how much the diplomatic equation in the Middle East and among US allies has changed for Trump.\n\nLast week he left the G7 summit in Canada a day early, as conflict raged between Israel and Iran and it appeared increasingly likely the US would join the fight. America's allies were anxious.\n\nNow, it appears Trump is heading to Europe with the intention of basking in their praise. But the outlook, however, is more complicated than that.\n\nAir defences seen over Qatar as Iran attacks US base on Monday\n\nOver the course of a dizzying 24 hours beginning on Monday, events in the Middle East have moved quickly.\n\nA US airbase came under attack, the White House helped broker a ceasefire between Iran and Israel, and the deal came close to unravelling.\n\nRead our in-depth look at how those 24 hours unfolded here.\n\nJeb Bush was once the heir apparent of a political dynasty until Trump came along\n\nPresident Donald Trump has expressed his gratitude to former arch-rival Jeb Bush, after he commended him on the US strikes against Iran.\n\n\"Thank you to Jeb Bush - Very much appreciated,\" Trump wrote on social media.\n\nFormer Florida Governor Bush, in his own social media post on Sunday, said the raid on Iranian nuclear facilities \"reasserts American strength, restores deterrence, and sends an unmistakable message to rogue regimes: the era of impunity is over\".\n\nTrump and Bush were bitter adversaries in the 2015-16 race for the Republican White House nomination. Trump prevailed after mocking his rival as \"low energy\" and railing against his brother President George W Bush's war in Iraq.\n\nA poll by the BBC's US partner CBS News reveals that most Americans disapproved of the US strikes on Iran, a large proportion of whom said the president needed Congress' approval for the military action.\n\nThe opinion survey splits along bipartisan lines, with most Republicans supporting the raid.\n\nDemocrats and independents shared concerns about the US getting involved in a wider war, although this was a smaller concern among Republicans.\n\nTrump's party showed overwhelming confidence in his administration's handling of the situation, but the rest of the country did not.\n\nThe CBS News/YouGov survey was conducted with 1,720 US adults interviewed between 22-24 June.\n\nAs we mentioned earlier, US media are reporting that an initial assessment produced by the Defense Intelligence Agency says US strikes on Iranonly set back its nuclear programme by a few months.\n\nIn a post on social media, the White House press secretary, Karoline\nLeavitt, says: \"This alleged 'assessment' is flat-out wrong and was\nclassified as 'top secret' but was still leaked to CNN by an anonymous,\nlow-level loser in the intelligence community.\n\n\"The leaking of this alleged assessment is a clear attempt to demean President Trump, and discredit the brave fighter pilots who conducted a perfectly executed mission to obliterate Iranâs nuclear program.\n\n\"Everyone knows what happens when you drop fourteen 30,000 pound bombs perfectly on their targets: total obliteration.\"\n\nThe BBC's US partner, CBS News, reports that a source familiar with the assessment has confirmed to them that a preliminary assessment indicates the strikes set back the programme by months, and did not obliterate the facilities.\n\nThe source says the assessment indicates strikes on the Fordo facility caved in the entrances but that the enrichment infrastructure buried further underground remains largely intact.\n\nThey also appear to contradict Leavitt's claim about the quality of the assessment, saying such preliminary assessments tend to hold up.\n\nThe White House has scheduled a classified briefing with\nCongress on Friday, House Speaker Mike Johnson said, following days of political frustration over Trump's decision to order strikes on Iranian nuclear\nfacilities without congressional approval.\n\n\"Senior administration officials will present the\nlatest information pertaining to the situation involving Israel and Iran,\"\nJohnson wrote on X.\n\nThe confirmation from Johnson comes after a classified\nbriefing scheduled for Tuesday with members of the Senate was abruptly\ncancelled earlier today, sparking outrage among Democrats.\n\nSenate Minority Leader Chuck Schumer called the postponement\n\"outrageous\", \"evasive\" and \"derelict\".\n\nEven a couple of Trump's fellow Republicans have questioned the legality of his attack on Iran without congressional\napproval.\n\nHowever, Johnson and a majority of Republicans have mostly\nbacked Trump's decision, pointing to past presidents from both parties who\nengaged in foreign conflict without the okay from Congress.\n\nIt is now past midnight in Tehran and Tel Aviv, so let's have look back at Tuesday's developments:\n\nSeveral mini drones were intercepted and destroyed over the\nnorthern Iranian city of Rasht, according to local officials.\n\nThe semi-official ISNA news agency quoted Gilan Province's\ndeputy governor as saying that the aerial targets were detected and brought\ndown by the region's air defence systems earlier tonight.\n\nThe official did not report any injuries or damage.\n\nSoroush Negahdari and Ghoncheh HabibiazadBBC Monitoring and BBC Persian\n\nRubble, shattered windows, walls that need fixing, people who need checking up on because theyâve lost a loved one during the strikes, and those who couldnât make money because of internet disruptions - this is how the people weâve spoken to describe the mood in Iran.\n\nMeanwhile, Iranian state television shows scenes of jubilant crowds celebrating what it calls a \"national victory\" following the US-announced ceasefire between Iran and Israel.\n\nBBC journalists cannot operate freely inside the country, so weâve spoken to people inside on secure, encrypted messaging apps.\n\n\"I wonder if the schedule for the power cuts will now be updated after the ceasefire and Iran's 'victory',\" a resident of Tehran said wryly. Another told us. \"Even before the war, I wasnât optimistic about the future â now there's a mountain of problems added to that.\"\n\nThere are people inside the country who fear darker days ahead for a country already dealing with poverty, inflation, energy shortages, environmental decline, and deep-rooted social injustice.\n\nThose we spoke to, and some on social media, are also expressing scepticism about the fate of the fragile ceasefire. There is widespread uncertainty over whether the truce signals lasting peace or just a pause before more hardship.\n\nThe Dutch King and Queen stand in the centre surrounded by the leaders of Nato countries, as well as the alliance's secretary general and Ukrainian President Volodymyr Zelensky\n\nThe leaders of Nato member states are meeting in the Netherlands today and tomorrow for a summit.\n\nIt's a scheduled event, and the biggest item on the agenda is a plan to increase defence spending, but leaders have also been discussing the situation in the Middle East.\n\nDowning Street says that at a meeting between UK Prime Minister Keir Starmer, French President Emmanuel Macron and German Chancellor Friedrich Merz, the leaders \"reflected on the volatile situation in the Middle East\" and agreed now is \"the time for diplomacy and for Iran to come to the negotiating table\".\n\nThe Israel Defense Forces says \"earlier this evening\" two drones approached Israeli territory \"most likely from Iran\" and were intercepted.\n\nIt says the Israeli Air Force made the interceptions, and that they happened outside of Israeli territory.\n\nDoctor Ran Rutenberg says he hopes the fragile ceasefire\nwill hold as he has had \"one of the toughest weeks\" of his life.\n\nIt's been \"very stressful\" working in the\nemergency room at Beilinson Hospital in Petah Tikva, near Tel Aviv, he tells\nme. After every missile hits, he sees an influx of patients coming in from\nnearby cities, \"injured by glass, shrapnel, or from slabs of concrete,\nfurniture and ceilings falling on them\", he says.\n\nRutenberg worked at the hospital 12 days in a row since the\nconflict between Israel and Iran began.\n\nAfter a missile hit a nearby high-rise residential building,\n50 people came in all at once â some moderately injured and some in a critical\ncondition, he says.\n\n\"The patients don't talk, they just look distressed and\nterrified, because they just had a missile land on their house,\" he says.\nSome of the injured are still in hospital days after the attack.\n\nRutenberg says he hopes a ceasefire means he might finally\nget some rest.\n\nThere have been a trickle of reports from US media outlets\nthat the US's strikes on Iranian nuclear facilities did not destroy the core\ncomponents of the country's nuclear programme and likely only set it back by\nmonths.\n\nCNN and the New York Times cite an early assessment from the\nUS's Defense Intelligence Agency - an assessment that could change. The BBC\ncannot independently verify these claims.\n\nBut the Pentagon has provided the BBC with a statement from\nDefence Secretary Pete Hegseth, who says: \"Based on everything we have\nseen - and Iâve seen it all - our bombing campaign obliterated Iranâs ability\nto create nuclear weapons.\n\n\"Our massive bombs hit exactly the right spot at each\ntarget - and worked perfectly. The impact of those bombs is buried under a\nmountain of rubble in Iran; so anyone who says the bombs were not devastating\nis just trying to undermine the president and the successful mission.\"\n\nAfter this war started, the Israeli government imposed restrictions on the country, meaning life for ordinary people changed drastically.\n\nNormally bustling streets were deserted, many non-essential shops and schools shut, and the airspace also closed.\n\nNow, the government has announced that in most of the country, apart from communities near Gaza, restrictions will lift.\n\nThis means the Airports Authority has said flights will resume from Israelâs major airports in Tel Aviv and Haifa, schools will re-open and the health system - which previously said it would reduce operations and provide only essential treatments - is returning to normal.\n\nThis suggests that at least for now the Israeli government is confident this ceasefire will hold.\n\nBut we still donât know what the terms of it are, or how long cessations have been agreed for, and it has already proved fragile.\n\nIâve just been at the State Department for a briefing.\n\nPress Secretary Tammy Bruce was very evasive on a lot questions about Iran.\n\nShe was definitive however on their future, saying Iran âwonât have a nuclear weapon.â But US satellite imagery shows that the nuclear sites are damaged, not destroyed.\n\nWould the US strike again or lean on diplomacy? She insisted that we believe the president when he says the sites are destroyed.\n\nThis comes despite intel briefings being delayed for the House and Senate - so at the moment itâs really only the administrationâs word for it.\n\nMore now from Netanyahu's televised address, which was delivered in Hebrew.\n\nThe Israeli prime minister has reiterated his pledge that Iran will not gain access to nuclear weapons, saying that Israel will \"sever\" any further attempts to restore such a project.\n\nHe adds that Israel has \"destroyed Iran's missile production industry\", destroying dozens of factories and severely damaging missiles stockpiles and launchers.\n\n\"Iran's malicious intention to threaten the existence of Israel with tens of thousands of ballistic missiles - this threat has been removed,\" he says, adding: \"We have dealt crushing blows to the evil regime.\"\n\nThe Israeli prime minister says that the IDF delivered Iran \"the hardest blow\" since the beginning of the conflict at dawn today.\n\nThe strikes eliminated \"hundreds of regime factories and regime activists,\" he adds, calling it the \"most crushing attack Tehran has seen in the last 50 years.\"\n\nIsraeli Prime Minister Benjamin Netanyahu has described the ceasefire between Iran and Israel as a \"historic victory\".\n\nHe says the \"victory will be remembered for generations. We removed two immediate existential threats - a nuclear threat and a ballistic missile threat. If we had not acted, we would soon be facing the danger of annihilation.\"\n\nNetanyahu says that the IDF \"eliminated Iran's senior command\", including three chiefs of staff, nuclear scientists and other top officials.\n\nIsrael's campaign also destroyed nuclear facilities in Isfahan, Natanz and Arak, the prime minister says.\n\nHe has also hailed US President Donald Trump's involvement in the campaign.\n\n\"Our friend President Trump has stood by us in an unprecedented way - under his direction the US military destroyed the deep-earth enrichment site at Fordo,\" Netanyahu says.\n\nIsraeli Prime Minister Benjamin Netanyahu has just delivered a televised statement in Hebrew.\n\nPresident Trump has arrived in Amsterdam for the Nato summit, where he's set to meet the security alliance's 32 leaders and attend a dinner hosted by the Dutch king.\n\nHis flight landed at Amsterdam's Schipol airport a little after 19:30 local time (18:30 BST).\n\nOn board Air Force One, Trump reportedly spoke to members of the press \"pool\" - the journalists that travel with the president - and has credited Israel for backing off from further strikes on Iran.\n\nHe has also told journalists that he expects to speak with Ukrainian President Volodymyr Zelenksy on the sidelines of the summit.\n\nIt is the US president's first Nato summit since 2019.",
        "source_3": "After trading fire for about 12 days, Iran and Israel have agreed to wind down a conflict that set the Middle East on edge.\n\nThe conflict began amid an impasse over Iran’s nuclear program. U.S. President Donald Trump had pressed Iran to agree to abandon its nuclear programs. While Iran has insisted it’s not pursuing nuclear weapons, Iranian negotiators had signaled reluctance to give up Iran’s uranium enrichment capabilities.\n\nIn the early morning hours on June 13, Israeli warplanes launched a surprise attack aimed at crippling Iran’s nuclear program and offensive military capabilities. Following the attack, Iranian representatives pulled out of talks set for June 14 with U.S. counterparts in Oman."
    }
}