{
    "question": "In what ways could the U.S. strikes on Iran’s Fordow, Natanz, and Isfahan—and the mixed early assessments from satellite imagery and officials—shape regional security, IAEA oversight, and Iran’s nuclear posture?",
    "content": {
        "source_1": "The US struck Iran’s Fordow, Natanz, and Isfahan nuclear sites, escalating tensions with Iran.\n\nUS President Donald Trump has announced that the United States has “totally obliterated” three Iranian nuclear sites in what he called “spectacularly successful” strikes.\n\nThe military used so-called “bunker buster” bombs and missiles to target the heavily fortified Fordow facility as well as Natanz and Isfahan sites.\n\nTrump’s decision to join Israel’s military campaign marks a sharp escalation in the region, which has seen more than 21 months of Israeli genocide in Gaza.\n\nThe US intervention comes more than a week after Israel launched an unprovoked strike on Iranian nuclear and military sites after accusing Tehran of making an atomic bomb.\n\nIran, as well as the United Nations nuclear watchdog, has rejected the claims that Tehran was on the cusp of developing nuclear weapons.\n\nTrump announced the bombing of three of Iran’s main nuclear sites:\n\nAccording to US General Dan Caine, chairman of the Joint Chiefs of Staff, a large formation of seven B-2 stealth bombers, each with two crew members, was launched from the US on Friday at midnight as part of Operation Midnight Hammer.\n\nTo maintain tactical surprise, a decoy group flew west over the Pacific, while the main strike group headed east with minimal communications during an 18-hour flight.\n\nAt 5pm EST (1:30am local time and 21:00 GMT), a US submarine in the region launched more than two dozen Tomahawk missiles, striking surface infrastructure targets in Isfahan.\n\nAt 6:40pm EST (2:10am Iran time and 22:40 GMT), the lead B-2 dropped two GBU-57 Massive Ordnance Penetrators (MOPs) on Fordow, followed by a total of 14 MOPs dropped across Fordow and Natanz.\n\nAll three nuclear sites—Fordow, Natanz, and Isfahan—were hit between 6:40pm and 7:05pm EST (1:30am-2:10am local time; 22:40-23:10 GMT). The final wave of Tomahawk missiles struck Isfahan last to preserve surprise.\n\nIn total, more than 125 US aircraft participated, including stealth bombers, fighter jets, dozens of tankers, surveillance aircraft, and support crews.\n\nThe Pentagon described it as the largest B-2 combat operation in US history and the second-longest B-2 mission ever flown. Force protection across the region was elevated in anticipation of potential retaliation.\n\nIran’s nuclear programme is spread across several key sites. While Iran insists its programme is peaceful and aimed at energy and medical research, the US and Israel remain deeply suspicious.\n\nIran’s resumption of uranium enrichment after the US withdrawal from the 2015 nuclear deal in 2018 has only deepened tensions. Israel, which had vehemently opposed the nuclear deal under US President Barack Obama, has vowed to prevent Iran from acquiring nuclear weapons by any means necessary. On June 13, it launched strikes on Iran a day ahead of a sixth round of US-Iran nuclear talks.\n\nIran’s Fordow Fuel Enrichment Plant, located about 95km (60 miles) southwest of Tehran, is built deep inside a mountain, reportedly up to 80-90 metres (260-300 feet) underground, to survive air strikes and bunker buster attacks.\n\nMehdi Mohammadi, an adviser to the chairman of the Iranian parliament, claimed that the US attack was not surprising and that no irreversible damage was sustained during the strikes. He added that authorities had evacuated all three sites in advance.\n\nNatanz nuclear facility, the largest uranium enrichment site in Iran, is located in Isfahan province.\n\nIn a previous attack on June 15, the above-ground section of a pilot fuel enrichment plant, where uranium was enriched up to 60 percent, was destroyed by an Israeli strike, according to theInternational Atomic Energy Agency (IAEA).\n\nNatanz’s key electricity infrastructure, such as the substation, main power building, emergency supply, and backup generators, was also destroyed. There was no direct hit on the underground cascade hall, but the power loss may have damaged centrifuges used for uranium enrichment.\n\nIsfahan Nuclear Technology Center is a key conversion and research facility south of Isfahan city. It plays a critical role in preparing raw materials for enrichment and reactor use.\n\nThis is thethirdtime Isfahan has been struck since Israel launched attacks across Iran on June 13, prompting fears of a regional escalation.\n\nThe strikes on Iran’s nuclear sites were conducted using B-2 stealth bombers armed with so-called “bunker buster” bombs, alongside submarine-launched Tomahawk cruise missiles.\n\nExperts have long noted that the Fordow Fuel Enrichment Plant—buried deep within a mountain—could only be destroyed by the US’s 30,000-pound (13,600kg) Massive Ordnance Penetrator, the world’s most powerful bunker-busting bomb. The US remains the only country known to possess this weapon.\n\nIran’snuclear agencysaid on Sunday that radiation monitoring and field assessments show no signs of contamination or risk to residents near the targeted sites.\n\n“Following the illegal US attack on the Fordow, Natanz, and Isfahan nuclear facilities, no contamination has been recorded,” the agency posted on social media. “There is no danger to residents around these sites. Safety remains stable.”\n\nIn a separate statement, the Atomic Energy Organization of Iran vowed that its nuclear activities would continue despite the strikes, saying it “assures the great Iranian nation that, despite the hostile conspiracies of its enemies, the efforts of thousands of committed and revolutionary scientists will ensure that this national industry—built on the blood of nuclear martyrs—will not be stopped”.\n\nThe IAEA, the UN nuclear watchdog, also did not notice an increase in radiation levels near the targeted sites.\n\nThe attacks came asIsrael and Iran have been engagedin more than a week of aerial combat, with more than 400 killed in Iran and 24 casualties reported in Israel.\n\nSix Iranian scientists, two of whom were prominent nuclear scientists, were also killed in Israeli strikes.",
        "source_2": "Reporting by Jonathan Landay and Milan Pavacic; Editing by Don Durfee and Michael Learmonth\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nA prominent Al Jazeera journalist, who had previously been threatened by Israel, was killed along with four colleagues in an Israeli airstrike in an attack condemned by journalists and rights groups.\n\nReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.\n\nAccess unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.\n\nBrowse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.\n\nScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.\n\nAll quotes delayed a minimum of 15 minutes.See here for a complete list of exchanges and delays.",
        "source_3": "Fox News' Jennifer Griffin reports the latest on the U.S. strikes against Iranian nuclear facilities.\n\nNew satellite images of Iran’s Fordow nuclear facility reveal the aftermath of a massive bomb strike that the U.S. military launched as part of itsOperation Midnight Hammer.\n\nThe U.S. launched a surprise strike using B-2 stealth bombers onIran’s Fordow, Natanz and Isfahan nuclear facilities on Saturday.\n\n\"All three sites sustained extremely severe damage and destruction,\" Joint Chiefs Chairman Air Force Gen. Dan Caine said during a briefing at the Pentagon on Sunday morning. He added that the full extent of the battle damage to the facilities would take time to assess.\n\nFordow, Iran's underground nuclear enrichment site, was pictured in satellite images showing from a bird's-eye view that the strike had obliterated some structures at the site.\n\nEXPERTS CONFIDENT IRAN'S NUCLEAR PROGRAM IS ‘NO LONGER’ AFTER MASSIVE US STRIKE\n\nThis satellite picture by Planet Labs PBC shows Iran's underground nuclear enrichment site at Fordow after a U.S. airstrike targeted the facility on Sunday, June 22, 2025.(Planet Labs PBC via AP)\n\nIn satellite images taken days earlier, trucks and vehicles can be seen at the Fordow site.\n\nCargo trucks are seen postioned near the underground entrance of the Fordow facility on June 19, 2025.(Maxar)\n\nVehicle activity was seen at the Fordow site on June 20, 2025, ahead of the U.S. strikes on June 21.(Maxar)\n\nFordow is built into the side of a mountain near the city of Qom, about 60 miles southwest of Tehran.\n\nTheInternational Atomic Energy Agencysaid off-site radiation levels have not increased following the strikes on three nuclear sites in Iran.\n\n\"Following attacks on three nuclear sites in Iran - including Fordow - the IAEA can confirm that no increase in off-site radiation levels has been reported as of this time,\" the IAEA wrote in a post on X Sunday morning.\n\nA map shows where Iran's most important nuclear facilities are situated.(Fox News/FDD)\n\nFox News Digital reached out to the IAEA via email for comment on whether nuclear material had been moved from any of the three sites ahead of the strike.\n\nIAEA Director General Rafael Mariano Grossi said in a statement that he will call an emergency meeting on Monday following the strikes.\n\nA FULL BREAKDOWN OF OPERATION MIDNIGHT HAMMER, THE ‘LARGEST B-2 OPERATIONAL STRIKE IN US HISTORY’\n\nCaine also detailed how Operation Midnight Hammer was the \"largest B-2 operational strike in US history.\"\n\nThe operation employedadvanced deception tacticsand used more than 125 aircraft to carry out the success of the mission, including seven B-2 stealth bombers, multiple fourth and fifth generation fighters, dozens of air refueling tankers, a guided missile submarine and \"a full array\" of intelligence, surveillance, and reconnaissance aircraft, Caine said.\n\nU.S. forces launched approximately 75 precision-guided munitions, according to Caine, including 14 30,000-pound GBU 57 Massive Ordnance Penetrators, the first operational use of this weapon.\n\nFox News' Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.\"\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}