{
    "question": "What are the broader legal and policy implications of Judge Michael Farbiarz’s decision to release Palestinian activist Mahmoud Khalil from ICE detention after determining he is not a flight risk or a danger to the public?",
    "content": {
        "source_1": "After missing the birth of his child, his first Father’s Day and spending more than three months away from his family,Mahmoud Khalilhas been reunited with his loved ones.\n\nThe Palestinian activist arrived in Newark, New Jersey, Saturday afternoon, a day after he was released from a Louisiana ICE detention center. He was seen embracing his wife and pushing the stroller of his newborn son after reuniting in a private area of the airport.\n\n“Still, the fight is far from over,” Khalil said while thanking his supporters at a news conference. “I continue to advocate for Palestinians, for the immigrants who are left behind in that facility.”\n\nThe crowd embraced Khalil, handed him a Palestinian flag and flowers and broke out into cheers as he hugged them. His friends and family had waited to see him for 104 days.\n\nWhen asked how it feels to be free, Khalil said, “To be honest I’m still trying to just comprehend that. Of course it feels great.”\n\nWearing a keffiyeh – a scarf seen as asymbolof Palestinian identity and resistance – a grinning Khalil pumped his fists as he walked out of the detention center Friday evening with one of his attorneys. Since March, he had been detained at an Immigration and Customs Enforcement facility in the rural town of Jena, Louisiana.\n\n“Although justice prevailed but it’s long, very long overdue, and this shouldn’t have taken three months,” Khalil told reporters Friday outside the detention center.\n\nJudge Michael Farbiarz ordered Khalil’s release on bail Friday after finding he is not a flight risk or a danger to public safety. The judge said it’s “highly unusual” to be seeking his detention at this point.\n\nThe judge also cited several “extraordinary circumstances” in Khalil’s case that led him to order his release, including “that there is a due process violative effort to punish” the Columbia University graduate who played a central role in negotiations on behalf ofpro-Palestinian student protesterslast year.\n\nKhalil “is not a flight risk, and the evidence that has been presented to me at least is that he is not a danger to the community, period, full stop,” Farbiarz said.\n\nKhalil, a lawful permanent resident who is married to a US citizen and has not been charged with a crime, was one of the first arrestees in the Trump administration’s immigration crackdown targeting student activism. As his case dragged on for over 100 days, severalother student activiststargeted for deportation by the Trump administration were released.\n\nKhalil said he is leaving behind immigrants still in detention who are “in a place where they shouldn’t have been.”\n\n“The Trump administration are doing their best to dehumanize everyone here,” he said. “Whether you are a US citizen, an immigrant or just a person on this land, doesn’t mean that you are less of a human.”\n\nTwo days after being released from custody, Khalil spoke to supporters and media gathered Sunday outside the Cathedral of St. John the Divine near Columbia University.\n\nKhalil told those assembled that while his release was sweet, it was not a victory. “Not when Palestinians are still being killed under US bombs, and not when supporting their righteous struggle is so heavily criminalized,” he told the crowd\n\nBut he said a “wave of repression” initiated with his detention had failed to silence the Palestinian liberation movement, instead amplifying its message.\n\n“It was intended to scare people into silence. It was intended to distract us from the fact that the US government is a killing machine in Palestine and across the world, but they completely failed,” Khalil said.\n\n“I believe that we will win. In Jena, Louisiana, I found myself literally scratching this into my bunk bed, and looking at it as I fell asleep. And as I woke up, I find myself, repeating, repeating it, even now, knowing that I have won in a small way, by being free – by being free today,” he added.\n\nFollowing the news conference, Khalil briefly marched with the crowd of protesters, leading a chant of: “From the river to the sea, Palestine will be free.”\n\nWhen asked why he thinks the Trump administration views him as a threat, Khalil toldABC News, “Because I represent a movement that goes against what this administration is trying to do.”\n\nIn an interview with theNew York Times, Khalil described the moment he was approached by the plainclothes officers who detained him.\n\n“All the ‘Know Your Rights’ information and fliers I read and familiarized myself with were useless,” Khalil told the Times. “It felt like kidnapping,” he said.\n\n“They try to portray me as a violent person. They try to portray me as a terrorist, as some lunatic, but not presenting any evidence, not presenting any shred of credibility to their claims,” Khalil told ABC.\n\nKhalil’s wife, Noor Abdalla, said in a statement Friday that she can “breathe a sigh of relief” knowing that Khalil will be reunited with his family after missing the birth of his first child during months of detention at a facility over 1,000 miles away.\n\nJudge Farbiarzpreviously ruledthe government can’t hold Khalil on the premise that his presence in the country is against the national interest, and on Friday found that Khalil doesn’t need to be detained based on a second allegation against him that he failed to give required information in his application to become a legal permanent resident of the US.\n\n“It’s overwhelmingly unlikely, I found, that a lawful permanent resident would be detained on the remaining available charge” of failing to accurately fill out an immigration application, the judge said during Friday’s hearing.\n\nMahmoud Khalil responds to charges against him for the first time in new legal filings, and describes the ‘irreparable harm’ of his detention\n\nAt the hearing, Khalil’s attorneys argued that the court should allow him to be released on bail or transferred to a detention center closer to his wife and newborn son. They said the chilling effect of his detention has made it an “extraordinary case.”\n\n“I’m aware, of my 20 years of representing immigrants, of no other case where the government announced the day that it detained someone that they were detaining them in order to send a message that their arrest would be the first of many, that they were going after student protesters,” Khalil’s attorney Alina Das argued before the court.\n\nThe federal government requested to temporarily halt Khalil’s release, which the judge denied Friday.\n\n“The court concluded there’s no reason he should continue to be detained given the serious harms that are happening, the chill that is happening to his speech and other people’s speech as a result of his detention,” one of his attorneys Baher Azmy told CNN Friday.\n\nIn response to the ruling, the Department of Homeland Security said that “The Trump Administration acted well within its statutory and constitutional authority to detain Khalil.”\n\nAs the case played out in immigration and federal courts, the administration has argued that Khalil should be deported because his presence in the United States threatens the administration’s foreign policy goal of combatting antisemitism. His lawyers contended that he was targeted for his pro-Palestinian views in violation of his constitutional rights.\n\n“There is at least something to the underlying claim that there is an effort to use the immigration charge here to punish the petitioner. And of course, that would be unconstitutional,” Farbiarz said Friday.\n\nVideo: Columbia students chant, ‘Free Mahmoud’ at commencement\n\nAs part of his release conditions, Khalil’s lawyers were required to surrender his passport to immigration authorities in Louisiana and he was prohibited from traveling internationally, limiting travel to a handful of states. The government was ordered to provide Khalil his green card and a copy of his passport, allowing him to board a plane home to New York Friday.\n\nKhalil will however not have to report toUS Immigration and Customs Enforcement in New York, Magistrate Judge Michael Hammer ordered.\n\nThough he’s been released, Khalil’s immigration proceedings will continue.\n\nAzmy, Khalil’s attorney, said the legal team learned immigration Judge Jamee Comans in Louisiana separately reaffirmed her removability ruling an hour into Friday’s hearing. Khalil’s lawyers will appeal her decision through immigration court – a long process his lawyers say will be easier now that he is out of detention.\n\n“I’m confident that on appeal, we will prevail,” Johnny Sinodis, one of Khalil’s attorneys, told CNN’s Laura Coates Friday, noting Khalil’s insistence throughout court proceedings that he “committed no misrepresentation, no fraud” during his green card application.\n\nKhalil’s wife said the ruling doesn’t begin to address the injustices their family has been through but said she’s “celebrating Mahmoud coming back to New York to be reunited with our little family, and the community that has supported us since the day he was unjustly taken for speaking out for Palestinian freedom.”\n\nThe ruling comes exactly one week after FarbiarzruledKhalil can remain in detention.\n\nAfter the judge said the government could no longer hold Khalil on the premise that his presence in the country is against the national interest, attorneys for the Department of Justice said the judge’s decision did not prevent them from continuing to hold Khalil on a second claim – that he failed to give required information in his application to become a legal permanent resident of the US.\n\nThe judge ruled last week that the administration’s interpretation of his order is correct, keeping Khalil in detention.\n\nVideo shows minutes leading up to Mahmoud Khalil’s arrest\n\nKhalil’s attorneys at the time accused the administration of using “cruel, transparent delay tactics” to keep Khalil in custody.\n\nAzmy on Friday said the charges still pending that Khalil made misrepresentations on his green card application are “baseless” and will be litigated.\n\nWhen asked if Khalil will continue to protest when released, Azmy said: “He’s a peace activist, he’s an international human rights activist, and he’s Palestinian, and I don’t expect he will ever stop advocating for justice for Palestinian people and an end to their continued slaughter and starvation.”\n\nThis story has been updated with additional information.",
        "source_2": "Columbia University graduate and activist Mahmoud Khalil said the Trump administration \"chose the wrong person\" to target in its crackdown on student protesters as he was released on bail after more than three months in detention.\n\nA federal judge ruled on Friday that the Palestinian was not a flight risk or threat to his community and could be released as his immigration proceedings continue.\n\nMr Khalil was a prominent voice in Columbia's pro-Palestinian protests last year, and his 8 March arrest sparked demonstrations in New York and Washington DC.\n\nThe government still wants to deport him, arguing his activism is detrimental to US foreign policy interests.\n\nSpeaking to journalists before heading to New York from Louisiana, where he was held, he said he was most eager to see his wife and his son, who was born during his 104 days in detention.\n\n\"The only time I spent [with] my son was a specified one-hour limit that the government had imposed on us,\" he said.\n\n\"So that means that now I can actually hug him and Noor, my wife, without looking at the clock.\"\n\nHe also criticised the Trump administration for targeting him for protesting against Israel's military actions in Gaza: \"There's no right person that should be detained for actually protesting a genocide.\"\n\nHe did not specifically mention Israel, which emphatically denies accusations of genocide in Gaza, or Jewish people.\n\nIn a statement, White House spokeswoman Abigail Jackson accused Mr Khalil of engaging in \"fraud and misrepresentation\" and \"conduct detrimental to American foreign policy interests\".\n\nThe White House maintains that Judge Michael Farbiarz did not have jurisdiction to order Mr Khalil's release.\n\n\"We expect to be vindicated on appeal, and look forward to removing Khalil from the United States,\" Ms Jackson said.\n\nMr Khalil, a permanent resident, graduated from Columbia while he was in detention. His wife took his place during the ceremony and accepted his diploma on his behalf.\n\nThe government has not accused Mr Khalil of a specific crime.\n\nSecretary of State Marco Rubio invoked a rarely used portion of the Immigration and Nationality Act to argue Mr Khalil's presence in the US could pose \"potentially serious adverse foreign policy consequences\".\n\nLast week,Judge Farbiarz ruled Rubio's justification for detaining Mr Khalil was probably unconstitutionaland said the US government could not detain or deport the 30-year-old legal US resident under that reasoning.\n\nAttorneys for the Trump administrationthen said Mr Khalil was being held for a different charge,failing to disclose information when he applied for lawful permanent residency in 2024.\n\nMr Khalil's attorneys had argued that the government violated their client's free speech rights and the administration targeted him because of his role in protests. They also asked a New Jersey federal court to free him on bail or transfer him closer to his wife and baby.\n\nThroughout Friday's nearly two-hour hearing, Judge Farbiarz, who presides in the District of New Jersey, expressed scepticism about the government's requests to hold Mr Khalil while his case moved forward.\n\nHe also said Mr Khalil's arrest and detention on the second charge were \"highly unusual\".\n\n\"It's overwhelmingly unlikely that a lawful permanent resident would be held on the remaining charge here,\" Judge Farbiarz said, according to CBS News.\n\nHe added that there had been an \"effort to use the immigration charge here to punish the petitioner\" for his protests.\n\nUnder the conditions of his release, Mr Khalil will not have to wear electronic monitoring, and will be given certified copies of his passport and green card so he can return home.\n\nThe government will retain his physical passport. The court barred Mr Khalil from international travel, but he will be permitted some domestic travel to New York and Michigan, as well as New Jersey and Louisiana for court appearances and attorney visits. He will also be permitted to travel to Washington for lobbying and legislative purposes.\n\n\"No one should fear being jailed for speaking out in this country,\" said Alina Das, co-director of the Immigrant Rights Clinic at New York University School of Law, who appeared in court to argue for his release on Friday.\n\n\"We are overjoyed that Mr Khalil will finally be reunited with his family while we continue to fight his case in court.\"\n\n\"After more than three months, we can finally breathe a sigh of relief and know that Mahmoud is on his way home to me and Deen, who never should have been separated from his father,\" said Mr Khalil's wife, Dr Noor Abdalla, in a statement released by the American Civil Liberties Union.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "The Columbia University student has been held at a Louisiana immigration detention center since his arrest in March (Kat Ramirez for Fox News Digital)\n\nAnti-Israel activist Mahmoud Khalil was released on bail from an immigration detention center on Friday following anorder by a judge.\n\nKhalil, a Columbia University graduate student, left a federal facility in Louisiana before 7 p.m. on Friday and is expected to head to New York, where his wife and baby live. He must notify the Department of Homeland Security within 48 hours of his address after arriving in New York.\n\nU.S. District Judge Michael Farbiarz in his Friday order said it would be \"highly, highly unusual\" to hold a legal U.S. resident who doesn’t appear to be a flight risk and isn’t accused of violent offenses.\n\n\"Petitioner is not a flight risk and the evidence presented is that he is not a danger to the community,\" Farbiarz said. \"Period, full stop.\"\n\nANTI-ISRAEL RINGLEADER POST $1 BOND AFTER FEDERAL JUDGE RULES TRUMP ADMIN CAN'T DETAIN HIM\n\nAnti-Israel activist and former Columbia University graduate student Mahmoud Khalil, center, speaks after his release from federal immigration detention in Jena, La., Friday, June 20, 2025.(Kat Ramirez for Fox News Digital)\n\nKhalil's attorneys said in a letter to the court before the judge’s ruling that his imprisonment at the detention center in Jena, Louisiana, was an \"exceedingly rare\" decision on the part of the government and amounted to unconstitutional retaliation.\n\nKhalil was arrested in March at Columbia over his pro-Palestinian activism on campus, and animmigration judge ruledhe could be removed from the country based on a memo from Secretary of State Marco Rubio that said his campus protests were at odds with U.S. foreign policy interests.\n\nMahmoud Khalil raises his fist as he walks after from the detention center where he was held for three months.(Kat Ramirez for Fox News Digital)\n\nRubio cited an obscure provision of the Immigration and Nationality Act to justify his finding, and Farbiarz later enjoined the secretary from using that determination to deport Khalil.\n\nFEDERAL JUDGE SIDES WITH ANTI-ISRAEL RINGLEADER MAHMOUD KHALIL, HALTS TRUMP ADMINISTRATION'S DEPORTATION BID\n\nMahmoud Khalil gets help carrying his belongings to the car.(Kat Ramirez for Fox News Digital)\n\nBut theDepartment of Homeland Security(DHS) also added a second reason for keeping Khalil detained and attempting to deport him. The DHS said Khalil allegedly omitted key information from his green card application about groups with which he was affiliated, including the Columbia University Apartheid Divest.\n\nKhalil's next stop is New York City.(Kat Ramirez for Fox News Digital)\n\nKhalil's case has become a lightning rod for anti-Israel protesters and immigration rights advocates. They have argued the Trump administration is retaliating against him for opposing the Israeli government and chilling free speech of those who oppose Israel's offensive in the Gaza Strip and conflict with Iran.\n\nHundreds of anti-ICE protesters marching in April in San Francisco demanding Khalil's release.(Tayfun Coskun/Anadolu via Getty Images)\n\nKhalil must surrender his passport but will be given his green card and will be allowed to travel to New York, Michigan, where he has family, New Jersey and Louisiana for court appearances, and Washington, D.C. for lobbying.\n\nThe Trump administration is appealing the preliminary injunction and Khalil's release to the 3rd Circuit Court of Appeals.\n\nFox News' Ashley Oliver and The Associated Press contributed to this report.\n\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}