{
    "question": "How might the U.S. airstrikes on Iran’s Fordo, Natanz, and Isfahan nuclear sites affect the risk of regional escalation and Iran’s response, and what implications could this have for the war powers debate in Washington?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nPresident Donald Trump says Iran’s key nuclear sites were “completely and fully obliterated” by US strikes. Trump made the comments at the White House hours after announcing the US military had carried out strikes against key nuclear facilities in Iran.\n\nU.S. President Donald Trump warned that he will not hesitate to strike other targets in Iran if peace does not come quickly in the Middle East. Trump said that while the nuclear facilities struck by the U.S. on Saturday were the most “lethal,” “there are many targets left.”\n\nIsraeli Prime Minister Benjamin Netanyahu congratulated US President Donald Trump for the attack on Iran that he said would change the history of the Middle East and beyond.\n\nPresident Donald Trump speaks from the East Room of the White House in Washington, Saturday, June 21, 2025, after the U.S. military struck three Iranian nuclear and military sites, directly joining Israel’s effort to decapitate the country’s nuclear program, as Vice President JD Vance, Secretary of State Marco Rubio and Defense Secretary Pete Hegseth listen. (Carlos Barria/Pool via AP)\n\nThis satellite image provided by Maxar Technologies shows the Fordo enrichment facility in Iran on Jan. 24, 2025. (Maxar Technologies via AP)\n\nA B-2 Spirit stealth bomber, assigned to the 509th/131st Bomb Wings out of Whiteman Air Force Base, performs a flyover of Barnes-Jewish Hospital May 8, 2020, in St. Louis. (AP Photo/Jeff Roberson, File)\n\nParnia Rahmanian, 13, lies unconscious in a hospital bed following Israeli strike that targeted her neighborhood, as a nurse, second right, and a relative look on, in Tehran, Iran, Saturday, June 21, 2025. (AP Photo/Vahid Salemi)\n\nThe Israeli flag is reflected in the windows of a damaged building in Ramat Gan, Israel, two days after it was hit by a missile launched from Iran, Saturday, June 21, 2025. (AP Photo/Ohad Zwigenberg)\n\nTEL AVIV, Israel (AP) — The United States struck three sites in Iran early Sunday, inserting itself intoIsrael’s waraimed at destroying the country’s nuclear programin a risky gambitto weaken a longtime foe despite fears of a wider regional conflict.\n\nAddressing the nation from the White House, President Donald Trump asserted that Iran’s key nuclear were “completely and fully obliterated.” There was no independent damage assessment.\n\nIt was not clear whether the U.S. would continue attacking Iran alongside its ally Israel, which has been engaged in a nine-day war with Iran. Trumpacted without congressional authorization, and he warned that there would be additional strikes if Tehran retaliated against U.S. forces.\n\n“There will either be peace or there will be tragedy for Iran,” he said.\n\nPresident Donald Trump speaks from the East Room of the White House in Washington, Saturday, June 21, 2025, after the U.S. military struck three Iranian nuclear and military sites, directly joining Israel’s effort to decapitate the country’s nuclear program, as Vice President JD Vance, Secretary of State Marco Rubio and Defense Secretary Pete Hegseth listen. (Carlos Barria/Pool via AP)\n\nIran’s top diplomat, Foreign Minister Abbas Araghchi, warned in a post on X that the U.S. attacks “will have everlasting consequences” and that Tehran “reserves all options” to retaliate.\n\nIran’s ambassador to the United Nations called for an emergency Security Council meeting to discuss what he described as the U.S.’s “heinous attacks and illegal use of force” against Iran.\n\nIn a letter obtained by The Associated Press, Ambassador Amir Saeid Iravani said that the U.N.’s most powerful body must “take all necessary measures” to hold the U.S. accountable under international law and the U.N. charter.\n\nThe U.N. nuclear watchdog said later that there has been “no increase in off-site radiation levels” at the locations that the U.S. hit. The International Atomic Energy Agency sent the message via the social platform X.\n\nEarly Sunday morning Israel alerted the public of an Iranian missile launch and urged people to take shelter. Sirens sounded in Jerusalem a short while later and a series of booms were heard.\n\nIranian has beenfiring missile barragesat Israel since the war began but they have decreased in size as Israel targets Tehran’s missile launchers. The Islamic Republic may also be keeping some arms in reserve.\n\nThe Atomic Energy Organization of Iran confirmed that attacks took place on its Fordo, Isfahan and Natanz sites, but it insisted that its work will not be stopped. Iran said there were no signs of radioactive contamination at the three locations and no danger to nearby residents.\n\nIran has maintained that its nuclear program is for peaceful purposes only, and U.S. intelligence agencies have assessed that Tehran is not actively pursuing a bomb. However, Trump and Israeli leaders have claimed that Iran could quickly assemble a nuclear weapon, making it an imminent threat.\n\nThe decision to directly involve the U.S. in the war comes after more than a week of strikes by Israel on Iran that aimed to systematically eradicate the country’s air defenses and offensive missile capabilities, while damaging its nuclear enrichment facilities. But U.S. and Israeli officials have said American stealth bombers and the 30,000-pound (13,500-kilogram) bunker-buster bomb they alone can carry offered the best chance of destroying heavily fortified sites connected to the Iranian nuclear program buried deep underground.\n\n“We have completed our very successful attack on the three Nuclear sites in Iran, including Fordow, Natanz, and Esfahan,” Trump said in a post on social media. “All planes are now outside of Iran air space. A full payload of BOMBS was dropped on the primary site, Fordow. All planes are safely on their way home.”\n\nTrump added in a later post: “This is an HISTORIC MOMENT FOR THE UNITED STATES OF AMERICA, ISRAEL, AND THE WORLD. IRAN MUST NOW AGREE TO END THIS WAR. THANK YOU!”\n\nIsraeli Prime Minister Benjamin Netanyahu praised Trump’s decision to attack in a video message directed at the American president.\n\n“Your bold decision to target Iran’s nuclear facilities, with the awesome and righteous might of the United States, will change history,” he said. Netanyahu said the U.S. “has done what no other country on earth could do.”\n\nIsrael announced Sunday that it would close the country’s airspace to both inbound and outbound flights in the wake of the U.S. attacks. The war hasdisrupted air travelthroughout the Middle East.\n\nThe White House and Pentagon did not immediately elaborate on the operation. U.S. military leaders are scheduled to provide a briefing at 8 a.m. Eastern.\n\nThe attack used bunker-buster bombs on Iran’s Fordo nuclear fuel enrichment plant that is built deep into a mountain, a U.S. official said. The weapons are designed to penetrate the ground before exploding. The official spoke on condition of anonymity to discuss military operations.\n\nThis satellite image provided by Maxar Technologies shows vehicles at the Fordo enrichment facility in Iran on Friday, June 20, 2025. (Maxar Technologies via AP)\n\nIn addition, U.S. submarines launched about 30 Tomahawk missiles, according to another U.S. official who also spoke on condition of anonymity.\n\nThe strikes are a perilous decision, as Iran has pledged to retaliate if the U.S. joined the Israeli assault, and for Trump personally. He won the White House on the promise of keeping America out of costly foreign conflicts and scoffed at the value of American interventionism.\n\nU.N. Secretary-General Antonio Guterres said he was “gravely alarmed” by the “dangerous escalation” of American strikes.\n\n“There is a growing risk that this conflict could rapidly get out of control — with catastrophic consequences for civilians, the region, and the world,” he said in a statement.\n\nTrump told reporters Friday that he was not interested in sending ground forces into Iran, saying it’s “the last thing you want to do.” He had previously indicated that he would make a final choice over the course of two weeks.\n\nIran’s Supreme Leader Ayatollah Ali Khamenei warned the United States on Wednesday that strikes targeting the Islamic Republic will “result in irreparable damage for them.” And Iranian Foreign Ministry spokesman Esmail Baghaei declared “any American intervention would be a recipe for an all-out war in the region.”\n\nTrump has vowed that he would not allow Iran to obtain a nuclear weapon, and he had initially hoped that the threat of force would bring the country’s leaders to give up its nuclear program peacefully.\n\nThe Israeli militarysaid Saturday it was preparing for the possibility of a lengthy war, while Iran’s foreign minister warned before the U.S. attack that American military involvement “would be very, very dangerous for everyone.”\n\nThe prospect of a wider war loomed.Iranian-backed Houthi rebelsin Yemen said they would resume attacks on U.S. vessels in the Red Sea if the Trump administration joined Israel’s military campaign. The Houthis paused such attacks in May under adeal with the U.S.\n\nWhite House press secretary Karoline Leavitt said Thursday that Trump planned to make his decision on the strikes within two weeks. Instead, he struck just two days later.\n\nTrump appears to have made the calculation — at the prodding of Israeli officials and many Republican lawmakers — that Israel’s operation had softened the ground and presented a perhaps unparalleled opportunity to set back Iran’s nuclear program, perhaps permanently.\n\nThe Israelis say their offensive has already crippled Iran’s air defenses, allowing them to significantly degrade multiple Iranian nuclear sites.\n\nBut to destroy theFordo nuclear fuel enrichment plant, Israel appealed to Trump for thebunker-busting American bombknown as the GBU-57 Massive Ordnance Penetrator, which uses its weight and sheer kinetic force to reach deeply buried targets and then explode. The bomb is currently delivered only by the B-2 stealth bomber, which is only found in the American arsenal.\n\nThe bomb carries a conventional warhead, and is believed to be able to penetrate about 200 feet (61 meters) below the surface before exploding, and the bombs can be dropped one after another, effectively drilling deeper and deeper with each successive blast.\n\nA B-2 Spirit stealth bomber, assigned to the 509th/131st Bomb Wings out of Whiteman Air Force Base, performs a flyover of Barnes-Jewish Hospital May 8, 2020, in St. Louis. (AP Photo/Jeff Roberson, File)\n\nThe International Atomic Energy Agency has confirmed that Iran is producing highly enriched uranium at Fordo, raising the possibility that nuclear material could be released into the area if the GBU-57 A/B were used to hit the facility.\n\nPrevious Israeli strikes at another Iranian nuclear site, Natanz, on a centrifuge site have caused contamination only at the site itself, not the surrounding area, the IAEA has said.\n\nIsraeli strikes on Iran have killed at least 865 people and wounded 3,396 others, according to the Washington-based group Human Rights Activists. The group said of those dead, it identified 363 civilians and 215 security force personnel.\n\nTrump’s decision for direct U.S. military intervention comes after his administration made an unsuccessful two-month push — including with high-level, direct negotiations with the Iranians — aimed at persuading Tehran to curb its nuclear program.\n\nFor months, Trump said he was dedicated to a diplomatic push to persuade Iran to give up its nuclear ambitions. And he twice —in Apriland again in late May — persuadedNetanyahuto hold off on military action against Iran and give diplomacy more time.\n\nAll the while, Trump has gone from publicly expressing hope that the moment could be a “second chance” for Iran to make a deal to delivering explicit threats on Khamenei and making calls for Tehran’sunconditional surrender.\n\nThe military showdown with Iran comes seven years after Trump withdrew the U.S. from the Obama-administration brokered agreement in 2018, calling it the “worst deal ever.”\n\nThe 2015 deal, signed by Iran, U.S. and other world powers, created a long-term, comprehensive nuclear agreement that limited Tehran’s enrichment of uranium in exchange for the lifting of economic sanctions.\n\nTrump decried the Obama-era deal forgiving Iran too muchin return for too little, because the agreement did not cover Iran’s non-nuclear malign behavior.\n\nTrump has bristled at criticism from some of his MAGA faithful who have suggested that further U.S. involvement would be a betrayal to supporters who were drawn to his promise to end U.S. involvement in expensive and endless wars.\n\nMadhani reported from Morristown, N.J. Rising reported from Dubai, United Arab Emirates. Associated Press writers Nasser Karimi in Iran; Mehmet Guzel in Istanbul; Josef Federman in Jerusalem; Samy Magdy in Cairo; Matthew Lee and Josh Boak in Washington; and Farnoush Amiri and Jon Gambrell in Dubai contributed to this report.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Donald Trump, the president who returned to the White House in January promising to be a \"peacemaker\", has taken a dramatic step to insert the US into the fraught conflict between Iran and Israel.\n\nFar from bringing peace to the Middle East since taking office, Trump is now presiding over a region on the precipice of even greater warfare - a fight in which America is an active participant.\n\nIn a televised address to the nation from the White House just over two hours after announcing on social media that American forces had struck three nuclear sites in Iran, the American president said the operation had been a \"spectacular success\".\n\nHe expressed hope that his move would open the door to a more lasting peace where Iran no longer had the potential to become a nuclear power.\n\nIran has said that there was only minor damage to its heavily fortified Fordo nuclear site. Time will tell which side is correct.\n\nFlanked by Vice-President JD Vance, Secretary of State Marco Rubio and Defence Secretary Pete Hegseth, Trump warned Iran that if they did not abandon their nuclear programme, they would face future attacks that were \"far worse and a lot easier\".\n\nThere were \"many targets left\", Trump said, and the US would go after them with \"speed, precision and skill\".\n\nDespite the president's bravado, a continued American military engagement in Iran may be a worst-case scenario for the US, the region and the world.\n\nUN Secretary General António Guterres warned of a \"spiral of chaos\" that could result from the American decision to escalate the conflict, noting that the Middle East was already \"on edge\".\n\nIf Iran retaliates - as Ayatollah Ali Khamenei warned would happen in the event of a US attack - then the American side may feel compelled to respond.\n\nTrump's rhetoric earlier this week that Iran had to \"unconditionally surrender\" had put the president in a position where it would be difficult for him to back down. Iran, with its own threats, had backed itself into a similar corner.\n\nThis is how wars start - and how they can expand beyond the control, and imaginations, of those involved.\n\nOn Thursday, Donald Trump gave the Iranians a two-week deadline but that turned out to be much shorter than expected - just two days. On Saturday night, the US president announced he had acted.\n\nWas the two weeks for negotiations a feint? A bid to lure the Iranians into a false sense of security this weekend? Or did behind-the-scenes negotiations led by Trump's designated peacemaker Steve Witkoff collapse?\n\nIn the immediate aftermath of the strikes, little is known. But in his social media post and in his televised address, Trump tried to open the door for peace.\n\nThat may be an optimistic outlook, however. While the Israelis have made considerable efforts toward degrading Iran's military capabilities, the ayatollah still has weapons at his disposal.\n\nNow the waiting game begins. How will Iran respond to attacks on three of its sites, including Fordo, seen as the crown jewel of its nuclear programme?\n\nTrump appears to be hoping the US strikes force Iran to make greater concessions at the negotiating table, but it seems unlikely that a nation unwilling to talk while under Israeli attack will be more inclined when American bombs are also falling.\n\nAnd while Trump seemed to be implying that the US attack was a singular, successful event, if that's not the case, then the pressure to strike again will grow - or the president will have taken a serious political risk for minimal military gain.\n\nThat risk includes domestic political concerns, along with questions of international security.\n\nThe prospect of a US attack on Iran had already prompted sharp criticisms not only from Democrats but also from within Trump's own \"America First\" movement.\n\nThe president's unusual decision to give his national address flanked by three of his closer advisors may have been an attempt to project unity within his party.\n\nVance, in particular, has been an outspoken advocate of a more restrained American foreign policy and, recently, had taken to social media to make the case that Trump is still a non-interventionist who should be given the benefit of the doubt by his supporters.\n\nIf this attack is a one-off event, Trump may be able to smooth over the divisions within his base. But if it pulls the US into a larger conflict, the president could have an uprising with his ranks.\n\nSaturday's attack was an aggressive move for a president who boasted of starting no new wars during his first presidential term and who regularly railed against predecessors who had drawn the country into foreign conflicts on the campaign trail last year.\n\nTrump has made his move. Where it goes from here is not entirely within his control.\n\nFollow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weekly US Politics Unspun newsletter. Readers in theUK can sign up here. Those outside the UK cansign up here.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "Fox News chief national security correspondent Jennifer Griffin provides details on the nuclear sites targeted in the United States strike on Iran.\n\nCo-sponsors of theWar Powers Resolution, Reps. Ro Khanna, D-Calif, and Thomas Massie, R-Ky., were quick to criticize PresidentDonald Trumpfor greenlighting attacks on three nuclear sites in Iran Saturday night.\n\n\"This is not constitutional,\" Massie said, responding to Trump's Truth Social post announcing the strikes on Fordow, Natanz and Isfahan in Iran.\n\nThe bipartisanWar Powers Resolutionwas introduced in the House of Representatives this week as strikes between Israel and Iran raged on, and the world stood by to see if Trump would strike.\n\nSources familiar told Fox News Digital that both House Speaker Mike Johnson, R-La., and Senate Majority Leader John Thune, R-S.D., were briefed on the strikes ahead of time.\n\n'INSTINCTS FOR RESTRAINT': SENATE DIVIDED OVER WHO GETS TO DECLARE WAR\n\nPresident Donald Trump speaks during an address to a joint session of Congress at the Capitol in Washington, D.C., on March 4, 2025; Rep. Thomas Massie (R-KY) (L) attends the inauguration of President-elect Donald Trump in the Rotunda of the Capitol on Jan. 20, 2025 in Washington, D.C.(Left: Win McNamee/Pool/AFP via Getty Images; Right: Kevin Dietsch/Getty Images)\n\n\"Trump struck Iran without any authorization of Congress. We need to immediately return to DC and vote on @RepThomasMassie and my War Powers Resolution to prevent America from being dragged into another endless Middle East war,\" Khanna said.\n\n'SQUAD' MEMBERS, GOP LAWMAKER JOIN FORCES TO REJECT US INVOLVEMENT IN ISRAEL-IRAN WAR\n\nThis week, lawmakers sounded off on the unconstitutionality of Trump striking Iran without congressional approval. Congress has the sole power to declare war underArticle I of the Constitution.\n\nThe War Powers Resolution seeks to \"remove United States Armed Forces from unauthorized hostilities in the Islamic State of Iran\" and directs Trump to \"terminate\" the deployment of American troops against Iran without an \"authorized declaration of war or specific authorization for use of military forces against Iran.\"\n\nAs Trump announced his strikes against Iran – without congressional approval – Khanna said representatives should return to Capitol Hill to prevent further escalation.\n\nIn the upper chamber, Sen.Tim Kaine, D-Va., introduced his own war powers resolution ahead of the bipartisan duo in the House. While the resolution had been gaining steam with his colleagues, momentum could be stalled due to the strikes. His resolution is privileged, meaning that lawmakers will have to consider it. The earliest it could be voted on is Friday.\n\nPresident Donald Trump speaks with reporters while flying aboard Air Force One en route from Calgary, Canada, to Joint Base Andrews, Md., late Monday, June 16, 2025.(AP Photo/Mark Schiefelbein)\n\nKaine argued in a statement that \"the American public is overwhelmingly opposed to the U.S. waging war on Iran.\"\n\n\"And the Israeli Foreign Minister admitted yesterday that Israeli bombing had set the Iranian nuclear program back ‘at least 2 or 3 years,'\" he said. \"So, what made Trump recklessly decide to rush and bomb today? Horrible judgment. I will push for all senators to vote on whether they are for this third idiotic Middle East war.\"This week on Capitol Hill, Massie, the conservative fiscal hawk who refused to sign on to Trump's \"big, beautiful bill,\" built an unlikely bipartisan coalition of lawmakers resisting the U.S.' involvement in the Middle East conflict.\n\n\"This is not our war. But if it were, Congress must decide such matters according to our Constitution,\" Massie said.\n\nMassie, whom Trump threatened to primary during the House GOP megabill negotiations, invited \"all members of Congress to cosponsor this resolution.\" By Tuesday night, the bipartisan bill had picked up 27 cosponsors, including progressive \"Squad\" members Reps. Alexandria Ocasio-Cortez and Ilhan Omar.\n\nAcross the political aisle, Rep. Marjorie Taylor Greene, R-Ga., signaled her support,writing that Americanswant an affordable cost of living, safe communities and quality education \"not going into another foreign war.\"\n\nChair of the Subcommittee on Delivering On Government Efficiency (DOGE) U.S. Rep. Marjorie Taylor Greene (R-SC) presides over a hearing of the House Oversight Subcommittee in the U.S. Capitol on February 26, 2025, in Washington, D.C.(Anna Moneymaker/Getty Images)\n\n\"This is not our fight,\" Greene doubled down on Saturday night, before Trump's Truth Social announcement.\n\nThe bill's original co-sponsors also include progressive Democrat Reps.Pramila Jayapal, Summer Lee, Ayanna Pressley and Rashida Tlaib, whocalled it unconstitutionalfor \"Trump to go to war without a vote in Congress.\"\n\nWhite House Press Secretary Karoline Leavitt said Thursday that Trump would make his decision about whether to bomb Iran within two weeks.\n\n\"We have completed our very successful attack on the three Nuclear sites in Iran, including Fordow, Natanz, and Esfahan. All planes are now outside of Iran air space. A full payload of BOMBS was dropped on the primary site, Fordow. All planes are safely on their way home. Congratulations to our great American Warriors. There is not another military in the World that could have done this. NOW IS THE TIME FOR PEACE! Thank you for your attention to this matter,\" Trump said on Saturday night.\n\nIsrael launched preemptive strikes on Iran's nuclear facilities and military leaders last week, which the Islamic Republic considered a \"declaration of war.\" Strikes between Israel and Iran have raged on since, as Trump said he was considering whether to sign off on U.S. strikes against Iran.\n\nThe Jewish State targeted Iran's nuclear capabilities after months of failed negotiations in the region and heightened concern over Iran developing nuclear weapons.\n\nBut Ali Bahreini, Iran's ambassador to Geneva, said Iran \"will continue to produce the enriched uranium as far as we need for peaceful purposes,\" as Israel, and now the U.S., have issued strikes against Iran's nuclear capabilities.\n\nDeirdre Heavey is a politics writer for Fox News Digital.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}