{
    "question": "What does the exposure of 16 billion newly stolen passwords across major platforms reveal about current defenses against credential theft, and how should responsibility for prevention and response be shared among users, companies, and governments?",
    "content": {
        "source_1": "The leak exposed 16 billion login credentials and passwords, according to a researchers.\n\nI would like to be emailed about offers, events and updates from The Independent. Read ourPrivacy notice\n\nSixteen billion passwords toApple,Facebook,Google, and othersocial media accounts,as well as government services, were leaked in what researchers are calling the largest data breach ever, according to reports.\n\nThe leak exposed 16 billion login credentials and passwords, prompting both Google to tell billions of users to change their passwords and the FBI to warn Americans against opening suspicious links in SMS messages, according to a report published Thursday inForbes.\n\nResearchers atCybernews, who have been investigating the leak, found “30 exposed datasets containing from tens of millions to over 3.5 billion records each.”\n\nAll but one of these datasets have not been previously reported as being exposed, so the data impacted is all considered new.\n\n“This is not just a leak – it’s a blueprint for mass exploitation,” the researchers said. And they are right. These credentials are ground zero for phishing attacks and account takeover. “These aren’t just old breaches being recycled,” they warned, “this is fresh, weaponizable intelligence at scale.”\n\nMost of that intelligence was in the format of a URL, followed by logins and passwords. That information then allowed access to “pretty much any online service imaginable, from Apple, Facebook, and Google, to GitHub, Telegram, and various government services.”\n\nWhile worrisome, the researchers found that the datasets were exposed very briefly – with enough time for them to be discovered, but not long enough for researchers to figure out who was controlling the data.\n\nResearchers have determined the leak is the work of multiple infostealers, but it’s impossible to tell how many people or accounts were exposed, according to Cybernews.\n\nThe experts urge people to invest in password management solutions, not share their passwords and to stay alert in the event their passwords are compromised.\n\nJoin thought-provoking conversations, follow other Independent readers and see their replies",
        "source_2": "Theo Burman is a Newsweek Live News Reporter based in London, U.K. He writes about U.S. politics and international news, with a focus on infrastructure and technology. He has covered technological and cultural issues extensively in the U.S. and the U.K., such as the rise of Elon Musk and other tech figures within the conservative movement, and the development of high-profile international construction projects. Theo joined Newsweek in 2024 and has previously written for Dexerto, PinkNews, and News UK. He is a graduate of Durham University and News Associates. You can get in touch with Theo by emailingt.burman@newsweek.com. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nOne of the largestdata breachesin history has leaked around 16 billion passwords across some of the biggest tech platforms in the world, according to researchers at Cybernews.\n\nThe data watchdog found more than 30 datasets, each containing billions of logins to social media, VPNs, and user accounts for Big Tech companies such asAppleandGoogle, had been left exposed by infostealers.\n\nNewsweekcontacted Google and Apple for more information on affected services via email.\n\nThis breach may be one of the largest exposures of passwords in history, with millions of people potentially affected. Criminals that are able to gain access to passwords put up for sale on the dark web are able to use them for identify theft, fraud, and even blackmail.\n\nThe most common password length is eight to 10 characters, and a significant portion contains only lowercase letters and digits, making passwords vulnerable to brute-force attacks. Compared to just 1 percent in 2022, 19 percent of passwords now mix uppercase, lowercase, numbers, and symbols.\n\nCybernews researchers have been monitoring the exposed datasets since the beginning of 2025.\n\nOne of them, Vilius Petkauskas, toldForbesthat the team has discovered \"30 exposed datasets containing from tens of millions to over 3.5 billion records each.\"\n\n\"This is not just a leak—it's a blueprint for mass exploitation. These aren't just old breaches being recycled. This is fresh, weaponizable intelligence at scale.\"\n\nMost concerningly, in their June 19 report, the researchers warned that the scope of the breach affected passwords to accounts with major text brands, with one member of the team saying the data sets could give criminals access to \"pretty much any online service imaginable, from Apple,Facebook, and Google, to GitHub, Telegram, and various government services.\"\n\nNewsweekhas asked Facebook, GitHub and Telegram for comment via email.\n\nIt has not yet been confirmed which entities originally owned most of the datasets in the breach, making it difficult to identify whose passwords have been affected.\n\nThe largest batch from the breach was confirmed to consist ofPortuguese-speaking populations, though Cybernews said that other sets contained passwords from all over the world.\n\nOne of the best ways toboost password securityis by using password managers, enforcing minimum length and complexity standards, and enabling multi-factor authentication.\n\nOrganizations can take this one step further than individuals by auditing access controls and monitoring for credential leaks.\n\nAbove all else, the easiest way to protect personal information is to change any old passwords to something stronger.\n\nHowever, Google also recommends that users upgrade their Gmail account's security by moving on from older sign-in methods like passwords and two-factor authentication.\n\n\"It's important to use tools that automatically secure your account and protect you from scams,\" the California-based company said.\n\nGoogle also suggests using the Passkeys login system, which replaces passwords with biometric authentication via a trusted device like a smartphone. Biometrics include physical certification, like fingerprint recognition, facial scan, or a pattern lock.\n\nSteve Weisman,a cybersecurity expert and writer of the Scamicide newsletter, toldNewsweek:\"The best way to protect yourself is to follow my rule, 'trust me, you can't trust anyone.' Whenever you receive a phone call, text message or email requesting personal information, you can never be sure who is actually contacting you.\"\n\nNeringa Macijauskaitė, information security researcher at Cybernews said in a previous report:\"We're facing a widespread epidemic of weak password reuse. If you reuse passwords across multiple platforms, a breach in one system can compromise the security of other accounts.\"\n\nCybernews is continuing to investigate the nature of the leak, and advises readers to update their password information.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nTheo Burman is a Newsweek Live News Reporter based in London, U.K. He writes about U.S. politics and international news, with a focus on infrastructure and technology. He has covered technological and cultural issues extensively in the U.S. and the U.K., such as the rise of Elon Musk and other tech figures within the conservative movement, and the development of high-profile international construction projects. Theo joined Newsweek in 2024 and has previously written for Dexerto, PinkNews, and News UK. He is a graduate of Durham University and News Associates. You can get in touch with Theo by emailingt.burman@newsweek.com. Languages: English.\n\nTheo Burman is a Newsweek Live News Reporter based in London, U.K. He writes about U.S. politics and international news, with a focus on infrastructure and technology. He has covered technological and cultural issues extensively in the U.S. and the U.K., such as the rise of Elon Musk and other tech figures within the conservative movement, and the development of high-profile international construction projects. Theo joined Newsweek in 2024 and has previously written for Dexerto, PinkNews, and News UK. He is a graduate of Durham University and News Associates. You can get in touch with Theo by emailingt.burman@newsweek.com. Languages: English.\n\nTheo Burman is a Newsweek Live News Reporter based in London, U.K. He writes about U.S. politics and international news,                                    ...Read more",
        "source_3": "Fresh off last month’smassive password hack,there’s been another major dataset exposure. A staggering 16 billion passwords have been leaked across multiple platforms in what techsperts are calling the largest data breach in history.\n\nCybernews researcher Vilius Petkauskas, whose team has been investigating the online theft since the beginning of the year,told Forbesthat the breach comprised “30 exposed datasets containing from tens of millions to over 3.5 billion records each.”\n\nThe compromised info potentially affected millions of users and included logins to social media, VPNs and user accounts for tech giants including Apple, Facebook and Google.\n\nResearchers claim that the ill-gotten intel — which generally featured a URL, followed by login credentials and a password — could potentially grant cybercriminals access to “pretty much any online service imaginable.”\n\nThat includes everything from the previously mentioned social-media platforms to “GitHub, Telegram and various government services,” they said.\n\nAccording to Lawrence Pingree, a vice president at the security firm Dispersive, bad actors accumulate compendia of stolen credentials on the “dark web,” offering thieves the chance to purchase the pilfered info and use it for identity theft, fraud and blackmail.\n\nTo make matters worse, these aren’t just “old breaches being recycled” but rather “fresh, weaponizable intelligence at scale,” researchers warned.\n\n“This is not just a leak – it’s a blueprint for mass exploitation,” they declared.\n\nGeorge McGregor, vice president of mobile app security platform Approov vice president said this massive dataset exposure could result in “a cascade of potential cyberattacks and significant harm to individuals and organizations.”\n\nThe mega-breach is particularly concerning as not all the passwords were procured via infostealing software used to breach cybersecurity systems, but rather carelessness on the users’ part.\n\nDarren Guccione, the CEO and co-founder of access management site Keeper Security, told Forbes that the leak illustrates “just how easy it is for sensitive data to be unintentionally exposed online.”\n\nIn fact, myriad unprotected credentials could be sitting on the cloud like sitting ducks, just waiting for scammers to swoop them up, the publication reported.\n\nThat’s why is essential for both companies and individuals alike to safeguard their login software.\n\nGuccione recommends that consumers invest in password management solutions and dark web monitoring tools — which alert users when their info has been leaked — while companies should adopt ironclad security systems that “limit risk by ensuring access to sensitive systems is always authenticated, authorized and logged.”\n\n“Organizations need to do their part in protecting users,” said Javvad Malik, head security awareness advocate at KnowBe4, “and people need to remain vigilant and mindful of any attempts to steal login credentials. Choose strong and unique passwords, and implement multi-factor authentication wherever possible.”\n\nFormer NSA cybersecurity expert Evan Dornbush warned users against employing “the same password at multiple sites.”\n\n“If an attacker steals a password from one database and the individual has reused it elsewhere, then the attacker can gain access to those accounts as well,” he said.\n\nThe latest breach comes after anothermajor incident last monththat saw up to 184 million passwords potentially exposed in what experts are calling a “cybercriminal’s dream.”\n\nThe leak reportedly impacted everything from Apple and Google usernames and passwords and social media logins to bank accounts."
    }
}