{
    "question": "How might President Trump’s pending decision on U.S. involvement and Iran’s pledge that “all necessary options” are on the table influence the trajectory of the Israel-Iran conflict and the prospects for renewed nuclear diplomacy?",
    "content": {
        "source_1": "The White House said thatDonald Trumpwill “make a decision on whether to attack Iran within two weeks”.\n\nSpeaking to reporters on Thursday, White House press secretary Karoline Leavitt cited a message from Trump in which he said:\n\n“Based on the fact that there’s a substantial chance of negotiations that may or may not take place with Iran in the near future, I will make my decision whether or not to go within the next two weeks.”\n\nLeavitt added that “correspondence has continued with Iran”.",
        "source_2": "Andrew Stanton is a Newsweek weekend reporter based in Maine. His role is reporting on U.S. politics and social issues. Andrew joined Newsweek in 2021 from The Boston Globe. He is a graduate of Emerson College. You can get in touch with Andrew by emailinga.stanton@newsweek.com. Languages: English.\n\nJason Lemon is a Senior Politics Editor atNewsweekbased in Brooklyn, New York. Prior to taking on the editor role, Jason's reporting focused on U.S. politics and international affairs. He joinedNewsweekin 2018, and had previously worked as an editor at a Middle Eastern media startup called StepFeed. He also worked a year as a contributor toThe Atlanta Journal-Constitutionand has bylines inThe Christian Science Monitor,The Palm Beach Post, Al Fanar Media andA Magazine. He is a graduate of the American University of Beirut in Lebanon and Andrews University in Michigan. You can get in touch with Jason by emailing j.lemon@newsweek.com. Languages: English, Spanish, French and Levantine Arabic\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nIranian Deputy Foreign Minister Kazem Gharibabadi warned Thursday that \"all necessary options are on the table\" to respond to a potential strike by the United States.\n\nPresidentDonald Trumphas been considering strikes against Iran aimed at diminishing the country's nuclear capabilities amid concerns that it may be developing nuclear weapons, which the president has stated it cannot have, amid the ongoing conflict between Israel and Iran.\n\nThe conflict escalated last week after Israel launched strikes at Iran targeting nuclear capabilities. The two countries have since fired strikes back-and-forth in recent days, fueling concerns about the possibility of a wider war involving the United States. The conflict could reshape affairs in the region and across the globe for years to come.\n\nThe warning came as Trump has reportedly been warming up to the idea of striking Iran directly, while the U.S. already has been providing military support to Israel amid the heightened conflict with Tehran.\n\n\"If the U.S. wants to actively intervene in support of Israel, Iran will have no other option but to use its tools to teach aggressors a lesson and defend itself,\" Gharibabadi said, Russia's Tass news agency reported, citing Iranian media. \"Our military decision-makers have all necessary options on the table,\" he said.\n\n\"Our recommendation to the US is to at least stand by if they do not wish to stop Israel's aggression,\" the Iranian diplomat said.\n\nWhite House press secretary Karoline Leavitt told reporters at a briefing that Trump will \"make a decision within the next two weeks\" about whether to join the war.\n\nIran's Supreme National Security Council on Thursday threatened an \"immediate\" response to any third party that intervenes in its ongoing conflict with Israel, though it did not specifically mention the U.S. by name. The U.S. has many bases in the region that some fear could become Iranian targets.\n\nTrump has not confirmed what he plans to do about the conflict. He has reportedly reviewed strike options but is waiting to see whether Iran de-escalates its nuclear activities. He is aware of the diplomatic effort being undertaken, withEUofficials meeting with the Iranian foreign minister in Switzerland on Friday.\n\nSenator Bernie Sanders, a Vermont independent, in a statement emailed toNewsweek:\"In 2002, in testimony to Congress urging the United States to go to war in Iraq, Israeli Prime Minister Netanyahu stated: 'There is no question whatsoever that Saddam is seeking... nuclear weapons....If you take out Saddam's regime, I guarantee you that it will have enormous positive reverberations.'\n\n\"Netanyahu was wrong. Very wrong. The war in Iraq resulted in 4,492U.S. militarydeaths, over 32,000 wounded, and a cost of roughly three trillion dollars. Hundreds of thousands of Iraqis also died as a result of that tragic war. Netanyahu was wrong regarding the war in Iraq. He is wrong now. We must not get involved in Netanyahu's war against Iran.\"\n\nSecretary of Defense Pete Hegseth, in a post to X (formerly Twitter):\"Over the weekend, I directed the deployment of additional capabilities to the United States Central Command Area of Responsibility. Protecting U.S. forces is our top priority and these deployments are intended to enhance our defensive posture in the region.\"\n\nPresident Donald Trump told reporters on Wednesday:\"I don't want to fight either. I'm not looking to fight. But if it's a choice between fighting and them having a nuclear weapon, you have to do what you have to do, and maybe we won't have to fight.\"\n\nAyatollah Ali Khamenei, Supreme Leader of Iran, in a public address:\"The Americans should know that any U.S. military intervention will undoubtedly be accompanied by irreparable damage. The U.S. entering in this matter is 100 percent to its own detriment. The damage it will suffer will be far greater than any harm that Iran may encounter.\"\n\nDebate continues about whether the U.S. should join the conflict. While some have argued it is strategic to ensure Iran does not develop a nuclear weapon, others have said the U.S. should not get involved in a war on Israel's behalf. Members ofCongressare pushing to limit Trump's ability to join the conflict without their authorization.\n\nUpdate 6/19/25, 2:01 p.m. ET: This article was updated with additional information.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nAndrew Stanton is a Newsweek weekend reporter based in Maine. His role is reporting on U.S. politics and social issues. Andrew joined Newsweek in 2021 from The Boston Globe. He is a graduate of Emerson College. You can get in touch with Andrew by emailinga.stanton@newsweek.com. Languages: English.\n\nJason Lemon is a Senior Politics Editor atNewsweekbased in Brooklyn, New York. Prior to taking on the editor role, Jason's reporting focused on U.S. politics and international affairs. He joinedNewsweekin 2018, and had previously worked as an editor at a Middle Eastern media startup called StepFeed. He also worked a year as a contributor toThe Atlanta Journal-Constitutionand has bylines inThe Christian Science Monitor,The Palm Beach Post, Al Fanar Media andA Magazine. He is a graduate of the American University of Beirut in Lebanon and Andrews University in Michigan. You can get in touch with Jason by emailing j.lemon@newsweek.com. Languages: English, Spanish, French and Levantine Arabic\n\nAndrew Stanton is a Newsweek weekend reporter based in Maine. His role is reporting on U.S. politics and social issues. Andrew joined Newsweek in 2021 from The Boston Globe. He is a graduate of Emerson College. You can get in touch with Andrew by emailinga.stanton@newsweek.com. Languages: English.\n\nAndrew Stanton is a Newsweek weekend reporter based in Maine. His role is reporting on U.S. politics and social issues.                                    ...Read more",
        "source_3": "ByJAMES CLARK REYNOLDS, SENIOR FOREIGN NEWS REPORTERandKATELYN CARALLE, US POLITICAL REPORTERandOLIVIA ALLHUSEN, FOREIGN NEWS REPORTERandELIZABETH HAIGH, SENIOR NEWS REPORTER\n\nIsrael has killed an October 7 mastermind and struck a nuclear site in its latest wave of strikes against Iran, a day after Tehran said it would not negotiate over its nuclear programme while under threat and Europe tried to keep peace talks alive.\n\nThe state warned the conflict will be prolonged as US PresidentDonald TrumpsaidIrancould launch anuclear warin just 'weeks' due to its nuclear capabilities.\n\nSaeed Izadi, who led the Palestine Corps of the Quds Force, the Iranian Revolutionary Guards' overseas arm, was killed in a strike in an apartment in the Iranian city of Qom, saidIsraeliDefense Minister Israel Katz.\n\nCalling his killing a 'major achievement for Israeli intelligence and the Air Force', Katz said in a statement that Izadi had financed and armed the Palestinian militant groupHamasahead of its October 7, 2023, attack on Israel, which triggered the war inGaza.\n\nSpeaking to reporters on Friday, he said: 'It is a tremendous amount of material, and I think within a matter of weeks or certainly within a matter of months, they will be able to have a nuclear weapon, and we can't let that happen.'\n\nIsrael said on Saturday it had also hit a nuclear enrichment site in Isfahan, Iran for the second time since strikes began.\n\nIt comes after a 5.1-magnitudeearthquakehit northern Iran today asIsraelpounded the country with repeated waves of air strikes.\n\nThe quake struck at a depth of six miles, some 23 miles southwest of the city of Semnan, the USGS said, the US Geological Survey said.\n\nState television said the earthquake measured 5.5 and 'shook the area around the city of Sorkheh in Semnan province'.\n\nIt said the tremor was also felt in the capital Tehran, about 150 kilometres (90 miles) from Sorkheh. Official news agency IRNA reported no casualties and only 'minimal damage'.\n\nThe IDF today claimed they had eliminated Saeed Izadi, one of the alleged masterminds behind the October 7 attacks in Israel by Hamas.\n\nThe head of the Palestinian Division in the IRGC Quds Force was reportedly killed in an airstrike in the Iranian city of Qom - although this has not yet been confirmed by Iran.\n\n'Izadi was eliminated in a safe house in the heart of Iran, following a prolonged intelligence effort,' the IDF said.\n\nIt accused Izadi of being responsible for 'military coordination between senior commanders in the Islamic Revolutionary Guard Corps and the Iranian regime, and key figures in the Hamas terror organization.'\n\nThe IDF added this was particularly the case before October 7, in which some 1,200 Israelis were killed in a suprise attack by terror group Hamas.\n\nIzadi was said to have helped finance and arm the group as part of a plan to 'destroy Isreal'.\n\nIzadi, who is under US and British sanctions, was described by the Israeli military as 'one of the main orchestrators of the October 7th massacre and one of the few people who knew about it in advance'.\n\nIran has repeatedly rejected accusations that it was involved in Hamas's October 7, 2023 attack that sparked the ongoing war in Gaza.\n\nGermany has temporarily relocated the staff of its embassy in Tehran abroad due to the current threat situation, a foreign ministry official said on Saturday.\n\nThe embassy remains operational and can be contacted via phone by Germans who are still in Iran, the official said, adding it would continue to advise on possible options for leaving the country by land.\n\nIran's supreme leader Ayatollah Ali Khamenei has made the remarkable decision to name his potential successors in the event that he is assassinated.\n\nKhamenei, who is hiding out in a bunker, picked an array of leaders to take over both his military and political duties if he is killed inIsraeliairstrikes,NYTreports.\n\nTensions in the Mideast region have fired up in recent days - with both Iran and Israel launches barrages of strikes on one another as Trump toys with the decision for US military intervention.\n\nIsraeli strikes on Iran have killed more than 400 people since they began last week, Iran's health ministry said in an updated toll on Saturday, as fighting raged between the two nations.\n\n'As of this morning, Israeli attacks have claimed the lives of over 400 defenseless Iranians and left 3,056 others wounded by missiles and drones,' health ministry spokesman Hossein Kermanpour said in a post on X.\n\n'Among the injured, 2,220 have been treated and discharged from Ministry of Health hospitals, while 232 received outpatient care at the scene of the attacks.\n\n'During this period, our dedicated medical teams across the country have performed 457 surgeries on the wounded. Fifty-four of those martyred were women and children.'\n\nIn Israel, at least 24 people have been killed by retaliatory strikes.\n\nHundreds of American citizens have departed Iran using land routes over the past week since an aerial war between the Islamic Republic and Israel broke out, according to an internal State Department cable seen by Reuters on Friday.\n\nWhile many left without problem,'numerous' citizens had faced 'delays and harassment' while trying to exit, the cable said. It said, without giving further details, that one unidentified family had reported that two U.S. citizens attempting to leave Iran had been detained.\n\nThe internal cable dated June 20 underscores the challenge Washington is facing in trying to protect and assist its citizens in a country with which it has no diplomatic relations and in a war in which the United States may soon get involved.\n\nThe air war began on June 13 when Israel attacked Iran and has alarmed a region that has been on edge since the start of Israel's war in Gaza in October 2023.\n\nIsrael is the only country in the Middle East widely believed to have nuclear weapons, and said it struck Iran to prevent Tehran from developing its own nuclear weapons.\n\nSeveral 'powerful explosions' were heard Saturday afternoon in southwestern Iran's Ahvaz, the daily Shargh reported, on the ninth day of hostilities between the Islamic republic and Israel.\n\nAhvaz is the capital of Khuzestan province, which is situated on the Iraqi border and is Iran's main oil-producing region. The Israeli military had previously announced it was striking 'military infrastructure' in the southwest.\n\nA man has been arrested on terror charges for allegedly spying on a BritishRAFbase in Cyprus.\n\nThe individual, fromAzerbaijan, has been locked up for eight days while inquiries are carried out on the Mediterranean island.\n\nHe is accused of having British RAF military base in nearby Akrotiri under surveillance since mid-April, as well as Cyprus's own Andreas Papandreou Air Base in the western region of Paphos, the ANT1 news outlet reported.\n\nCypriot news sources said he had been arrested in the Zakaki suburb of the coastal tourist hotspot Limassol.\n\nPolice refused to give any further information, citing national security reasons as tension in the region continues to mount over the Israel-Iran war.\n\nTaking to social media on Saturday afternoon following a call with the Iranian President, French President Emmanuel Macron said he is 'deeply concerned' about Iran's nuclear programme.\n\nHe said: 'I reiterated my firm demand: Cécile Kohler and Jacques Paris must be released. Their inhumane detention is unjust. I expect them to return to France.\n\n'I also expressed my deep concern about Iran’s nuclear program. Here again, my position is clear: Iran must never acquire nuclear weapons, and it is up to Iran to provide full guarantees that its intentions are peaceful.\n\n'I am convinced that a path exists to end war and avoid even greater dangers.  To achieve this, we will accelerate the negotiations led by France and its European partners with Iran.'\n\nFrench President Emmanuel Macron has spoken with Iran's President Masoud Pezeshkian, it was announced on Saturday.\n\nMacron is said to have told Pezeshkian that Iran must provide guarantees that its nuclear programme is only for peaceful means - that it is based on electricity and not creating nuclear warheads.\n\nIn return, the pair agreed that Iran would accelerate talks with Europe, a readout of the call said.\n\nIranians on Saturday began to see some internet access restored, giving people the opportunity to call friends and family for the first time in days.\n\nThose in the diaspora posted on social media about connecting to FaceTime or Whatsapp to call relatives they had been worried about.\n\nGovernment officials had disconnected phone and web services earlier in the week for the more than 90 million people who live in Iran, citing cybersecurity threats from Israel. That left civilians unaware of when and where Israel would strike next, despite Israeli forces issuing warnings through their Persian-language online channels.\n\nWhen the missiles landed, lack of internet connection meant not knowing for hours or days if their family or friends are among the victims.\n\nTasnim News Agency, which is closely affiliated with Iran's government, quoted the information minister as saying that access to 'international' internet should be restored across the country by 8 pm.\n\nPolice in Cyprus have arrested an individual on suspicion of terror-related offences and espionage, authorities said on Saturday.\n\nThe individual appeared before a district court on Saturday, which ordered an eight-day detention pending inquiries. No further details would be issued, police said, citing national security.\n\nSeveral Cypriot news outlets reported the suspect was a man of Azeri ethnic descent and had been arrested in the Zakaki suburb of the coastal city of Limassol. The suspect was thought to have had a British RAF military base in nearby Akrotiri under surveillance, as well as Cyprus's own Andreas Papandreou Air Base in the western region of Paphos since mid-April, Cyprus's ANT1 news portal reported.\n\nCyprus lies very close to the Middle East and has in recent days been used as a transit point for people either leaving or going to the region amid a conflict between regional foes Israel and Iran. Terror-related offences on the island are very rare.\n\nIsraeli soldiers and first responders have been photograhed inspecting the damage at the site of an Iranian strike in Beit She'an on Saturday.\n\nThe area was targeted by a missile, but no casualties have been reported so far.\n\nTulsi Gabbardreversed course and admitted that Iran actually does have the ability to create nuclear weapons after a public rebuke by her bossDonald Trumpas Israel continues to wage war against the country.\n\nThe director of national intelligence blamed the 'dishonest media' for a week of confusion about whether the administration believes the Persian country can develop a weapon of mass destruction.\n\n'America has intelligence that Iran is at the point that it canproduce a nuclear weapon within weeks to months,if they decide to finalize the assembly,' she wrote on X. 'President Trump has been clear that can't happen, and I agree.'\n\nTrump warned that Tehran has a 'maximum' of two weeks to avoid possible American air strikes if they don't abandon their nuclear ambitions.\n\nInNew Jerseyon Friday, however, the president dismissed Gabbard's testimony in March that the intelligence community 'continues to assess Iran is not building a nuclear weapon.'\n\nFour fighters from Iran's Islamic Revolutionary Guard Corps were killed in an Israeli attack on a training centre in northwest Iran, the ISNA news agency has reported.\n\n'Four people have died as martyrs and three others were wounded in an Israeli attack against a training camp of the Revolutionary Guards in Tabriz,' ISNA - which is run by university students - stated.\n\nThe city has been repeatedly targeted since Israel began striking Iran more than a week ago.\n\nTurkish President Tayyip Erdogan said on Saturday that Israel's attacks on Iran right before a new round of nuclear talks with the United States aimed to sabotage the negotiations, and it showed Israel did not want to resolve issues through diplomacy.\n\nSpeaking at a foreign ministers' meeting of the Organisation of Islamic Cooperation in Istanbul, Erdogan urged countries with influence over Israel not to listen to its 'poison' and to seek a solution to the fighting via dialogue without allowing a wider conflict.\n\nHe also called on Muslim countries to increase their efforts to impose punitive measures against Israel on the basis of international law and United Nations' resolutions.\n\nTurkish Foreign Minister Hakan Fidan on Saturday accused Israel of leading the Middle East to 'total disaster' by attacking Iran on June 13.\n\n'Israel is now leading the region to the brink of total disaster by attacking Iran, our neighbour,' he told a summit of the Organization of Islamic Cooperation in Istanbul.\n\nFidan also called on Muslim countries to stand with Iran against Israel, and said the region had an 'Israel problem' after its assault on Gaza and attacks on Lebanon, Syria, Yemen and Iran.\n\nIsrael targeted 'two centrifuge production sites' at Iran's Isfahan nuclear facility overnight in a second wave of strikes on the location since the start of the war, a military official said on Saturday.\n\n'Isfahan we targeted in the first 24 hours of our operation, but we carried out a second wave of strikes there overnight, deepening our achievements and advancing the damage to the facility,' the military official told reporters during a briefing on condition of anonymity.\n\nHe added that the targeting of two centrifuge production sites in Isfahan was 'in addition to a couple more centrifuge production sites that we have been able to strike successfully in recent days'.\n\nThe repeated raids by the Israeli air force have 'dealt a severe blow to Iran's centrifuge production capabilities,' the official added.\n\nCentrifuges are used to enrich uranium, both for civilian and military use, with the radioactive metal needing to be enriched to high levels for use in atomic weapons.\n\nIsfahan, in central Iran, is known to have a uranium conversion facility which processes raw, mined uranium.\n\nThe Italian foreign ministry said the 24 Italians are the second group to evacuate via Azerbaijan's Baku, on their way back home.\n\n'After about nine hours of travel and a very long wait at the border, the group was welcomed by representatives of the Italian Embassy in Baku, and then moved to the airport of the Azerbaijani capital to wait to return to Italy with the first available flights,' the ministry said.\n\nThe group included an Italian doctor and his partner, an Iranian woman and their 18-month-old child, the ministry said.\n\nAnother convoy from Iran could depart from Tehran as early as Monday.\n\nThe first group that arrived in Italy via Baku in recent days had 34 Italian nationals.\n\nItaly's foreign ministry also said it chartered a flight on Sunday to help evacuate its citizens from Israel via Sharm el-Sheikh, Egypt.\n\nThe Iranian Foreign Minister Abbas Araghchi said it would be 'very, very dangerous for everyone' if the United States becomes actively involved in the war with Israel.\n\nHe spoke to reporters in Istanbul on his way home from talks in Geneva.\n\nAraghchi said American military involvement 'would be very unfortunate.'\n\nDonald Trump has reportedly approved Iran attack plans but is yet to decide whether to go through with them. He has said Iran has two weeks to return to the negotiating table before potential action.\n\nIsrael's Defense Minister Israel Katz (pictured) said on Saturday that the IDF had killed two Iranian Revolutionary Guard Commanders.\n\nHe said a veteran commander in the Iranian Revolutionary Guards' overseas arm, in a strike in an apartment in Iran's Qom province.\n\nThe commander, Saeed Izadi, led the Palestine Corps of the overseas arm, or Quds Force, Katz said in a statement.\n\nThe Israeli military later said that it killed a second commander of the Guards' overseas arm, who it identified as Benham Shariyari, during a strike on his vehicle overnight in western Tehran.\n\nIt said the commander 'was responsible for all weapons transfers from the Iranian regime to its proxies across the Middle East'.\n\nShariyari supplied missiles and rockets launched at Israel to Hezbollah, Hamas and Yemen's Houthis, according to the Israeli military.\n\nThere was no confirmation from the IRGC on the killing of the two commanders.\n\nIsrael's first responders said Saturday that a residential building in north Israel had been hit by a drone, after the army reported an intrusion in the Beit She'an valley.\n\n'A drone strike hit a two-storey residential building in northern Israel', the Magen David Adom said in a statement, adding that its rescue teams found no visible casualties as they arrived.\n\n(Pictured: Iranian missiles and Israeli interceptors in the skies over Israel)\n\nThe second week of the Israel-Iran war started with a renewed round of strikes despitetalksbetween European ministers and Iran's top diplomat.\n\nFriday's talks, which aimed at de-escalating the fighting between the two adversaries, lasted for four hours in Geneva, but failed to produce a breakthrough. Meanwhile, US President Donald Trump continued to weigh his country's military involvement and concerns spiked over potential strikes on nuclear reactors.\n\nStill, European officials expressed hope for future negotiations. Iranian Foreign Minister Abbas Araghchi said he was open to further dialogue but stressed Tehran wasn't interested in negotiating with the US while Israel continued attacking.\n\nTrump previously said Iran had two weeks to negotiate before potential US strikes.\n\nShortly after 2:30 am in Israel (2330 GMT on Friday), the Israeli military warned of an incoming missile barrage from Iran, triggering air raid sirens across parts of central Israel, including Tel Aviv, as well as in the Israeli-occupied West Bank.\n\nIt followed Israeli strikes in Iran, some of which targeted a nuclear enrichment site.\n\nInterceptions were visible in the sky over Tel Aviv, with explosions echoing across the metropolitan area as Israel’s air defence systems responded.\n\nSirens also sounded in southern Israel, said Magen David Adom, Israel’s national emergency service. An Israeli military official said Iran had fired five ballistic missiles and that there were no immediate indications of any missile impacts.\n\nThere were no initial reports of casualties in Israel.\n\nIsrael's military said Saturday its navy hit a Hezbollah 'infrastructure site' near the southern Lebanese city of Naqoura, a day after Israel's foreign minister warned the Lebanese armed group against entering the Iran-Israel war.\n\n'Overnight, an Israeli Navy vessel struck a Hezbollah 'Radwan Force' terrorist infrastructure site in the area of Naqoura in southern Lebanon', the military said in a statement.\n\nThe military said the site was used by Hezbollah 'to advance terror attacks against Israeli civilians'.\n\nIn a separate statement on Saturday, the military said it had 'struck and eliminated' a Hezbollah militant in south Lebanon the previous day, despite an ongoing ceasefire between both sides.\n\nIranian media is claiming the country has successfuly repelled an attack against a nuclear enrichment site in Isfahan (pictured).\n\nIsarel says it has been targeting nuclear and military sites in the country since the conflict erupted on June 13 with a surprise attack by Israel.\n\nIsrael's foreign minister said its strikes on Iran have delayed Tehran's potential to develop a nuclear weapon by at least two or three years.\n\n'According to the assessment we hear, we already delayed for at least two or three years the possibility for them to have a nuclear bomb,' Foreign Minister Gideon Saar said in an interview.\n\nWestern powers have repeatedly expressed concerns about the rapid expansion of Iran's nuclear programme, questioning in particular the country's accelerated uranium enrichment.\n\nThe International Atomic Energy Agency said that Iran is the only country without nuclear weapons to enrich uranium to 60 percent.\n\nHowever, it added that there was no evidence it had all the components to make a functioning nuclear warhead.\n\nInIsrael, where warnings of attacks from enemy nations are rampant, being woken at 6am by a loud air raid alarm is all-too common.\n\nBut when the same sound pierced the air two hours later, Tzipi Hotovely, Israel's first female ambassador to Britain, realised this warning was more serious than usual.\n\nThe third time it rang out in central Israel, where she was staying with her in-laws, she turned to her husband as they hurried to the family bomb shelter and said: 'This is war.'\n\nChillingly, she was right. It was the morning of October 7, 2023, whenHamasterrorists stormed through a security fence sealing Israel fromGazaand militants flew in firing guns from paragliders.\n\nThat day – the worst intelligence failure in the country's history – was marked by carnage and barbarity on an unprecedented scale.\n\nIsrael said on Saturday it had killed a veteran Iranian commander as the countries traded attacks, a day after Tehran said it would not negotiate over its nuclear programme while under threat and Europe tried to keep peace talks alive.\n\nSaeed Izadi, who led the Palestine Corps of the Quds Force, the Iranian Revolutionary Guards' overseas arm, was killed in a strike in an apartment in the Iranian city of Qom, said Israeli Defense Minister Israel Katz.\n\nCalling his killing a 'major achievement for Israeli intelligence and the Air Force', Katz said in a statement that Izadi had financed and armed the Palestinian militant group Hamas ahead of its October 7, 2023, attack on Israel, which triggered the war in Gaza.\n\nThe Revolutionary Guards said five of its members had been killed in attacks on Khorramabad, according to Iranian media reports that did not mention Izadi, who was on U.S. and British sanctions lists.\n\nThe IDF said on its Telegram channel that the IAF has 'started a series of strikes against missile storage and launching infrastructure sites in central Iran'.\n\nThis image shows the Israeli air defense system firing to intercept missiles during an Iranian attack over Tel Aviv, Israel, early on Saturday June 21\n\nThe military has said alerts were activated across the country 'following the detection of missiles launched from Iran'.\n\n'At this time, the Air Force is working to intercept and strike wherever necessary to eliminate the threat,' it said.\n\nReuters news agency has reported explosions can be heard over Tel Aviv.\n\nIran’s supreme leader has been in hiding since Israel launched a surprise attack on Iran last week, but his social media account has remained active.\n\nIn a post on X, he has praised today’s protests in Iran, saying they 'demonstrated the strength of their rationality and spirituality, along with our dear nation’s courage'.\n\nIsraeli officials have repeatedly signalled they are seeking to overthrow Iran’s leadership in their military campaign, with defence minister Israel Katz saying yesterday that Khamenei 'cannot continue to exist'.\n\nIranian Foreign Minister Abbas Araghchi says it is up to the US administration 'to show their determination' to reach a negotiated solution.\n\n'Or they have something else in their mind, and they want to attack Iran anyway,' Araghchi said in an interview with NBC News in Geneva, where he took part in talks earlier today with his European counterparts.\n\n'So they had perhaps this plan and they just needed negotiations perhaps to cover it up,' the minister said.\n\n'We don’t know how we can trust them any more,” Araghchi continued. “What they did was in fact a betrayal to diplomacy.'\n\nHouse lawmakers will get a classified briefing on the situation in Iran on Tuesday at 3 pm ET, an inside source told CNN.\n\nThis briefing is in addition to the classified briefing that Senators will also receive next week.\n\nIranian foreign minister Abbas Araghchi is reportedly planning to meet with Vladimir Putin next week.\n\nMr Araghchi is expected to travel to Istanbul on Saturday for a meeting of the Organisation of Islamic Cooperation, according to Axios.\n\nHe will then travel to Moscow for discussions with the Russian president before engaging in any further talks with European leaders, the news website reported.\n\nPutin on Friday expressed concern about the growing threat of a third world war, pointing to the escalating conflicts in Ukraine and the Middle East as dangerous flashpoints.\n\n'There is a lot of potential for conflict now,' Putin said in a speech at the St. Petersburg forum.\n\n'We are concerned about the possibility of a global war. All conflicts must be resolved by peaceful means.'\n\nIsrael estimates its strikes on Iran have delayed Tehran's potential to develop a nuclear weapon by 'at least two or three years', Israel's foreign minister said in an interview published Saturday.\n\nIsrael's offensive has produced 'very significant' results, Foreign Minister Gideon Saar told German newspaper Bild, saying: 'We already delayed for at least two or three years the possibility for them to have a nuclear bomb.'\n\nThese images show people taking shelter from Iranian missiles in Tel Aviv on June 20.\n\nOne image shows citizens carrying essentials as they enter an underground parking lot.\n\nThe IDF said it intercepted a drone over northern Israel just a short while ago.\n\nThese pictures show police and civil defense conducting operations in Haifa, northwestern Israel, after an Iranian missile struck the city on June 20\n\nArab League foreign ministers gathered in Istanbul late Friday to discuss the escalating war between Iran and Israel, Turkish state news agency Anadolu said, quoting diplomatic sources.\n\nThe ministers were in Turkey's largest city on the eve of weekend gathering of the Organization of Islamic Cooperation (OIC), which was also slated to discuss the air war launched a week ago.\n\nThe number of people injured during the Iranian strike on Haifa has been revised to 33.\n\nOne of the victims is in a serious condition, CNN reported.\n\nLatest Israeli figures show that 24 people have been killed in Israel since the conflict with Iran began last week.\n\nPictured: Emergency personnel work inside a damaged building following Iran's missile strike on Israel, amid the Iran-Israel conflict, in Haifa, Israel, June 20\n\nIsrael and Iran continued to intercept each other’s drones on Friday.\n\nThe Israeli military said it intercepted more than 15 unmanned aerial vehicles (UAVs) launched from Iran toward Israel on Friday.\n\nIran, meanwhile, said it activated its air defenses over Tabriz at about 10 pm local time (19.30 BST) on Friday night and intercepted Israeli drones there, according to semi-official news agency Mehr.\n\nThe military says 15 fighter jets and more than 30 weapons were used in the wave of strikes.\n\nIt said the attacks targeted 'missile launch sites', without providing additional details.\n\nBy Nikki Schwab, Chief Campaign Correspondent in Washington, D.C.\n\nPresident Donald Trump said Friday that he made the two-week deadline of whether the U.S. would join Israel in the fight against Iran to see 'people come to their senses.'\n\nHe also said he wasn't inclined to tell Israel to stop bombing Iran - something Tehran pushed in order to get nuclear talks with the U.S. back on track.\n\n'If somebody is winning, it's a little bit harder to do than if somebody is losing, but we're ready, willing and able, and we've been speaking to Iran, and we'll see what happens,' the president said on the tarmac of Morristown, New Jersey.\n\n'It's very hard to stop when you look at it, Israel's doing well in terms of war, and I think you would say that Iran is doing less well. It's a little bit hard to get somebody to stop.'\n\nOn Thursday, press secretary Karoline Leavitt read a statement from Trump from the podium that articulated that he would make a decision whether or not to get the U.S. military involved in Israel's bombing campaign with Iran in the next few weeks.\n\nHe said he was doing so 'based on the fact that there's a substantial chance of negotiations that may or may not take place with Iran in the near future.'\n\nThe White House wouldn't go further on what those talks would look like.\n\nPresident Donald Trump downplayed European negotiations with Iran that took place Friday in Geneva, Switzerland.\n\nBy Nikki Schwab, Chief Campaign Correspondent in Washington, D.C.\n\nPresident Donald Trump gave an ominous warning when asked if he was concerned there could be terror attacks on the American homeland if he decided to go to war with Iran.\n\n'We're always concerned about that and we have to take them out and be very strong,' he answered.\n\n'You're even in danger talking to me right now. Do you know that? You are in danger talking to me right now. So I should probably get out of here,' the president answered on the tarmac of Joint Base Andrews.\n\nTrump became under Iranian assassination threat following the U.S.'s 2020 assassination of Quds Force leader Qasem Soleimani.\n\nSeveral Trump 1.0 administration officials, including former National Security Advisor John Bolton - now a vocal Trump critic - were also targeted by the Iranians.\n\nBy Nikki Schwab, Chief Campaign Correspondent in Washington, D.C.\n\nPresident Donald Trump said his Director of National Intelligence Tulsi Gabbard was wrong when she said that Iran wasn't building a nuclear weapon.\n\n'Well, then my intelligence community is wrong,' he said Friday in Morristown, New Jersey to a question about what evidence he had that Iran was building a nuclear bomb.\n\nGabbard had testified in March that the U.S. intelligence community 'continues to assess Iran is not building a nuclear weapon.'\n\nShe also said that Iranian Supreme Leader Ayatollah Ali Khamenei had 'not authorized a nuclear weapons program that he suspended in 2003.'\n\nBut Trump said Friday as he was departing for his Bedminster, New Jersey golf club 'it looked like I'm right about the material that they've gathered already.'\n\n'It is a tremendous amount of material and I think within a matter of weeks or certainly within a matter of months they will be able to have a nuclear weapon and we can't let that happen,' Trump said.\n\nIranian officials have said they may consider pausing the country’s attacks on Israel, according to reports.\n\nOfficials from the Islamic Republic said they would ask their leadership if halting their bombing campaign could be considered if Israel also called off its aerial assault, a source familiar with discussions in Geneva told CNN.\n\nThe proposal could serve as the first step towards direct talks between Iran and the US, a prospect Tehran has opposed unless Israel relents its strikes.\n\nBefore Friday’s talks, Abbas Araghchi said in an interview aired by Iranian state television that 'in the current situation, as the Zionist regime’s attacks continue, we are not seeking negotiations with anyone'.\n\nUK Foreign Secretary David Lammy saying during Geneva talks this afternoon he and  his European counterparts discusscused their 'absolute firmness' that Iran 'cannot have nuclear capability that would endanger the immediate Middle East but also the global community'.\n\n'We had constructive discussions today and we will continue', he says.\n\nHe adds that the delegation also 'urged' the Iranians to 'get back into discussions' with the US - referring to talks between Iran and the US on Iran's nuclear programme.\n\nLammy says that in today's discussions, he and the European foreign ministers were 'very clear' that 'zero enrichment' of uranium is the 'starting point.\n\nA 5.1-magnitudeearthquakehit northern Iran on Friday as Israel pounded the country with repeated waves of air strikes.\n\nThe quake struck at a depth of six miles some 23 miles southwest of the city of Semnan, the USGS said, the US Geological Survey said.\n\nState television said the earthquake measured 5.5 and 'shook the area around the city of Sorkheh in Semnan province'.\n\nIt said the tremor was also felt in the capital Tehran, about 150 kilometres (90 miles) from Sorkheh.\n\nOfficial news agency IRNA reported no casualties and only 'minimal damage'.\n\nAbbas Araghchi told reporters after talks in Geneva that Iran is 'ready to consider diplomacy once again once the aggression is stopped' and 'the aggressor is held accountable for the heinous crimes committed'.\n\nHe goes on to say that Iran's nuclear programme is peaceful, and that attacks on it are a violation of international law, adding that Iran will continue to 'exercise its legitimate right of self-defence'.\n\n'I make it crystal clear that Iran's defence capabilities are non-negotiable,' he says.\n\nBut, European powers have urged Iran to hold nuclear talks 'without awaiting' an end to Israeli air strikes on the Islamic republic, French Foreign Minister Jean-Noel Barrot said.\n\nEuropean powers on Friday urged Iran to hold nuclear talks 'without awaiting' an end to Israeli air strikes on the Islamic republic, French Foreign Minister Jean-Noel Barrot said.\n\n'We invited the Iranian minister to consider negotiations with all sides, including the United States, without awaiting the cessation of strikes, which we also hope for,' he said after he and his British, German and EU counterparts held talks with Iranian Foreign Minister Abbas Araghchi in Geneva.\n\n'It is illusory and dangerous to want to impose a regime change from the outside. It is up to the people to decide their own destiny,' Barrot added, after Israeli Prime Minister Benjamin Netanyahu did not rule out killing supreme leader Ayatollah Ali Khamenei.\n\nUS President Donald Trump presided over a national security meeting about Iran with top aides at the White House on Friday, a US official says.\n\nThe official also says that US special envoy Steve Witkoff is in regular contact with the Iranians, both directly and indirectly, with Qatar acting as an intermediator.\n\nAll sides agreed to keep talking, France's Foreign Minister Jean-Noel Barrot said on Friday after European foreign ministers met their Iranian counterpart for talks in Geneva.\n\nSpeaking to reporters, Barrot also said there could be no purely military solution to the challenge posed by Iran's nuclear programme.\n\nHe told reporters: 'The Iranian Foreign Minister has indicated his willingness to continue these discussions on the nuclear program and, more broadly, on all issues.'\n\n'And we expect Iran to be open to discussion, including with the United States, to reach a negotiated settlement through dialogue,' he says.\n\nMeanwhile German Foreign Minister Johann Wadephul says it is 'our common endeavour to avoid further escalation' in the Middle East and to 'make progress with negotiations'.\n\nHe said: 'The good result today is that we leave the room with the impression that the Iranian side is fundamentally ready to continue talking about all important issues', adding the two sides held 'very serious talks.'\n\nPictured: France's Minister for Europe and Foreign Affairs Jean-Noel Barrot speaks to media after nuclear talks with Iran in Geneva, Switzerland\n\nTwo German air force planes on Friday evacuated 64 of the country's nationals from Israel, Berlin announced but stressed that it had not been a military evacuation operation.\n\nThe country's foreign and defence ministries said in a joint statement that two Airbus A400Ms had flown to Israel for the operation to bring home 'families with children and other vulnerable people'.\n\nThe ministries' statement stressed this had been a diplomatic operation carried out in close cooperation with the Israeli authorities, as any military operation would have required the approval of Germany's parliament.\n\nGermany's foreign ministry has already organised the evacuation of 345 people on two chartered flights via Amman. Another such flight is due to leave the Jordanian capital on Saturday.\n\nGermany is among several countries to organise evacuations for their citizens by land, sea and air from both Iran and Israel, as the two continue to bombard each other.\n\nWhile European foreign ministers were meeting with their Iranian counterpart in Geneva, Iran and Israel addressed the United Nations Security Council in New York.\n\nIran said it would continue to defend itself against Israel, while Israel's UN ambassador insisted that his country would not stop its attacks.\n\n'We will not stop,' Israeli UN ambassador Danny Danon said, adding 'not until Iran's nuclear threat is dismantled, not until its war machine is disarmed, not until our people and yours are safe.'\n\nIran's ambassador Amir Saeid Iravani urged the security council to take action, saying 'Israel apparently declared that it will continue this strike for as many days as it takes'\n\nPictured: Rafael Mariano Grossi, Director General of the International Atomic Energy Agency (IAEA) speaks via video during a meeting of the United Nations Security Council, about the conflict between Israel and Iran, at U.N. headquarters in New York City, U.S., June 20, 2025\n\nKatja Kallas, the EU’s top diplomat, said: 'Regional escalation benefits no one and that’s why we need to keep the discussions with Iran open.'\n\nShe added: 'We agreed we will discuss nuclear but also broader issues that we have and keep the discussions open.'\n\nDavid Lammy, the Foreign Secretary, has warned Iran that it faces a 'perilous moment' and urged it to negotiate with the US.\n\nHe said, following talks alongside European counterparts in Geneva with the Iranian foreign minister Abbas Araghchi: 'It was important to come from Washington, DC this morning and to be here with my European colleagues and to have these discussions with Iran.\n\n'We were clear Iran cannot have a nuclear weapon and the E3 and Europe have been clear for many years that that cannot happen.\n\n'We are keen to continue ongoing discussions and negotiations with Iran and we urge Iran to continue their talks with the United States.\n\n'This is a perilous moment and it is hugely important that we don’t see regional escalation of this conflict, and indeed the issues that that would cause for all of us but also for people at home worried about cost of living at this time.'\n\nPictured: (L-R) France's Minister for Europe and Foreign Affairs Jean-Noel Barrot, Britain's Foreign Secretary David Lammy, Germany's Foreign Minister Johann Wadephul and High Representative of the European Union for Foreign Affairs and Security Policy Kaja Kallas pose for photographs in the offices of the honorary Consul of Germany in Geneva, Switzerland, 20 June 2025\n\nPictured: Britain's Foreign Secretary David Lammy (R) and Germany's Foreign Minister Johann Wadephul (2nd R) greeting Iran's Foreign Minister Abbas Araghchi (L) prior to a meeting on Tehran's nuclear programme, at the Intercontinental Hotel in Geneva on June 20\n\nPictured: Germany's Foreign Minister Johann Wadephul, flanked by France's Minister for Europe and Foreign Affairs Jean-Noel Barrot and British Foreign Secretary David Lammy, speaks to media after nuclear talks with Iran in Geneva, Switzerland, June 20, 2025\n\nThe meeting between European foreign ministers and an Iranian delegation in Geneva has ended.\n\nThe group been holding talks today as part of efforts to de-escalate the conflict between Iran and Israel.\n\nThe leaders are currently giving a statement on the meeting which we will bring you shortly.\n\nThe Israeli military in its latest war update says it has attacked Hezbollah military sites and rocket launchers in southern Lebanon.\n\nIn the update, it claimed Hezbollah had been 'trying to restore its activity at these sites', which was a 'violation' of the ceasefire agreement.\n\nIt comes after Hezbollah leader Naim Qassem offered 'all forms of support' to Iran in its fight against Israel and the US, in a speech delivered on Thursday night.\n\nIDF Chief of Staff Lt. Gen. Eyal Zamir says Israelis must prepare for a 'prolonged campaign' against Iran in order to 'eliminate a threat of this magnitude.'\n\nIn a video statement, Zamir said that Iran has been 'building for years a clear plan to destroy the State of Israel' and that in recent months, 'the plan reached the point of no return, where the capabilities reached operational capability.'\n\n'We launched the campaign when Iran possessed around 2,500 ground-to-ground missiles, with a high production rate, such that within approximately two years, they were expected to possess around 8,000 missiles,' he said.\n\nZamir added that Iran’s ballistic missile efforts, proxies in the Middle East, and nuclear advancements, 'compelled us to strike and deliver a preemptive blow.'\n\n'The IDF will not stand by and watch as threats develop. As part of an emerging doctrine, we will act proactively and in advance to prevent an existential threat and to face any challenge,' he said.\n\nIn its latest update, the Israeli air force says it attacked three surface-to-surface missile launchers in western Iran that were 'ready to fire' overnight.\n\nIt added that a remotely piloted aircraft attacked and killed a squad of Iranian soldiers on the move during the operation, including a commander of an Islamic Revolutionary Guard Corps (IRGC) base in western Iran.\n\nIsraeli's military chief Eyal Zamir said Friday that his country should be 'ready for a prolonged campaign' against Iran, as the longtime foes exchanged fire for the eighth day.\n\n'We have embarked on the most complex campaign in our history to remove a threat of such magnitude, against such an enemy. We must be ready for a prolonged campaign,' Zamir said in a video statement to Israelis, adding that 'the campaign is not over. Although we have made significant achievements, difficult days still lie ahead.'\n\nThe United States has issued new Iran-related sanctions today as it takes aim at the procurement of machinery for the country's defence industry.\n\nThe U.S. Treasury Department said it was targeting an individual and eight entities over their roles in the sourcing and transshipment of 'sensitive machinery for Iran's defense industry.'\n\nTreasury Secretary Scott Bessent said in a statement:\n\nHe added that Treasury would continue to target Iran's ability to make and proliferate such weapons, 'which threaten regional stability and global security.'\n\nIranian authorities have arrested a European man suspected of espionage, it has been reported.\n\nAccording to Iran's Tasnim news agency, the tourist was detained in southwestern Iran, though his nationality and the date of arrest has not been disclosed.\n\nIsraeli President Isaac Herzog has declared Haifa's Al-Jarina mosque was struck by an Iranian missile, causing injuries to Muslim clerics and worshippers at prayer.\n\nForeign Minister Gideon Saar later shared a similar message on social media, adding that 'the Iranian regime is targeting Muslim, Christian and Jewish civilians, as well as civilian sites. These are war crimes.'\n\nA military official said that 20 missiles were launched towards Israel in the latest Iranian salvo.\n\nIn Haifa, at least 19 people were injured by missiles, one of whom was said to be seriously wounded.\n\nSatellite image shows the Bushehr plant in southern Iran\n\nCountries across the Middle East have expressed fears in the event Israel strikes the Bushehr nuclear plant in Iran.\n\nRafael Grossi, director of the International Atomic Energy Agency (IAEA), warned the region could face nuclear catastrophe if Bushehr is attacked.\n\nMr Grossi told the UN Security Council that he has not yet detected radiation resulting from Israel's week-long military campaign against Iran, including attacks on nuclear sites.\n\nBut he said that a strike on Bushehr - the Middle East's first civilian nuclear reactor, which so far appears to have been spared - would spell the most serious consequences as it contains thousands of kilograms of nuclear material.\n\nThousands of people rallied in Tehran, Baghdad and Beirut after weekly prayers to protest Israel's strikes on Iran, chanting slogans against Israel and its main backer, the United States.\n\nImages on Iran's state television showed protesters in Tehran holding up photographs of commanders killed since the start of the war, while others waved the flags of Iran and the Lebanese militant group Hezbollah.\n\n'This is the Friday of the Iranian nation's solidarity and resistance across the country,' the news anchor said.\n\n'I will sacrifice my life for my leader,' read a protester's banner, referring to Iran's supreme leader Ayatollah Ali Khamenei.\n\nAccording to state television, protests took place in other cities around the country, including in Tabriz in northwestern Iran and Shiraz in the south.\n\nIsraeli military said it carried out a fresh wave of attacks across Iran today, targeting missile launchers in the southwest of the country.\n\n'A short while ago, the Israeli Air Force struck surface-to-air missile batteries in southwestern Iran,' it said in a statement.\n\nOther attacks on Friday targeted the capital Tehran, the central city of Isfahan and western areas of the country.\n\nThe head of the UN atomic watchdog warned Friday that an Israeli strike on Iran's southern nuclear plant of Bushehr could trigger a regional disaster, adding that radiation had not yet been detected in the conflict.\n\n'Countries of the region have reached out directly to me over the past few hours to express their concerns, and I want to make it absolutely and completely clear - in case of an attack on the Bushehr nuclear power plant, a direct hit would result in a very high release of radioactivity,' Rafael Grossi told the UN Security Council.\n\nThe Israeli military says it has struck 'military infrastructure' in southwestern Iran.\n\nThe UN's nuclear watchdog has guaranteed it would be able to perform 'watertight' nuclear inspections in any Iran deal as foreign representatives meet in the hope of getting talks back on course.\n\nIAEA Director General Grossi warned of possible chemical and radioactive contamination at Natanz nuclear facility and urged maximum restraint on attacking nuclear sites.\n\nA strike on Iran's Bushehr plant would create a nuclear disaster, he said.\n\nThe comments came as Iranian air defences activated in Bushehr, in southern Iran, according to the semi-official news channel YCJ news, run by state broadcaster Islamic Republic of Iran Broadcasting.\n\nThe UK has withdrawn its embassy staff from Iran, following in the footsteps of other European nations as well as Australia and New Zealand amid the conflict with Israel.\n\nOn the eighth day of the war between Iran and Israel, the UK Government said it continues to call for de-escalation between the two sides.\n\nEarlier today, Australia also shuttered its Tehran embassy and ordered officials to leave the country, Sydney said, citing a 'deteriorating security situation'.\n\nReports claim Iran has launched approximately 520 missiles at Israel since the start of the conflict on June 12.\n\nOnly 5 per cent have directly hit the Jewish state.\n\nThe number of rockets represents a massive chunk of Iran's estimated 2,000 ballistic missile stockpile.\n\nPictured: A weapon fragment falls to the ground after Israel's Irone Dome intercepted a missile launched from Iran on Friday, June 20, 2025\n\nBritish nationals in the region can register their presencehere.\n\nAs talks get underway in Geneva, members of the UN Security Council have also convened in New York to discuss the crisis in the Middle East.\n\nAnticipated nuclear talks between European foreign ministers and their Iranian counterpart in Geneva have begun, according to the Afp news agency.\n\nThe talks are hoped to offer a way back to diplomacy in the face of a crisis in the Middle East rapidly spiralling out of control.\n\nPictured below: Iranian Foreign Minister Abbas Araghchi arrived for a meeting with his European counterparts.\n\nHere are some pictures from the Israeli port city of Haifa where an Iranian ballistic missile struck this afternoon.\n\nPhotographs shows substantial damage with windows blown out while some structures have been partially demolished.\n\nIsraeli security forces have been pictured working at the impact site.\n\nIsrael has confirmed 17 people have been taken to hospital, three with serious injuries, following the latest Iranian missile barrage.\n\nIn a statement on X, Israel's Magen David Adom rescue service said:\n\nGen. Stanley McChrystal warned Americans that if the U.S. gets involved in the Israel-Iran conflict it will have long-term consequences.\n\nThe retired Army General told Squawk Box Friday morning that a single strike won't be enough to end the conflict trying to prevent Iran from gaining nuclear weapon capabilities.\n\n‘We get enamoured with the idea of strike and awe, bunker busting bombs with the idea that a single strike is going to decide something and it is not,' McChrystal said on the CNBC morning show.\n\nTwo people have been injured, one seriously, following an Iranian ballistic missile strike in Haifa.\n\nHuge plumes of smoke have been seen rising from the Israeli port city while strikes have also been reported in Tel Aviv and Negev.\n\nIsrael's Magen David Adom rescue service reported two people injured by shrapnel on Friday, including a 16-year-old in serious condition, after the latest barrage of missiles fired from Iran.\n\nA cratered road in Beersheba following an Iranian missile strike this morning\n\nIf you're just joining us, we have been reporting live updates from the eighth day of the Israel-Iran conflict.\n\nStick with us throughout the afternoon as we continue to bring you live updates from the Middle East.\n\nHere are the first pictures from Geneva where European foreign ministers are meeting their Iranian counterpart Abbas Araqchi.\n\nThe ministers of Britain, France and Germany - known as the E3 - are expected to tell Araqchi that the U.S. is open to direct talks even as it considers joining Israeli strikes.\n\nAraqchi has today declared Tehran has refused to speak to Washington because of its close ties to Israel - which it described as a 'partner'.\n\nThe Israeli military has said that citizens can now leave protected areas, signalling the end of the Iranian military threat.\n\nRetired Four Star General Jack Keane isn't optimistic about Ayatollah Ali Khamenei coming to the table to make a deal with the U.S.\n\n'The Ayatollah going into this and the reason why he has never made a deal is because he built an enterprise to survive an attack,' Keane told Fox News on Friday morning. 'And he belives they can absorb the attack, survive it, recover it and then rebuild. That is where this guy is.'\n\nPresident Donald Trump is giving himself two weeks to make a decision on if the U.S. will join Israel and get involved with stiking Iranian nuclear facilities.\n\nWhite House Press Secretary Karoline Leavitt said in her Thursday briefing that Trump's preference is always diplomacy and suggested he believes there is still a chance for negotiation with Iran.\n\nReuters is reporting that explosions have been heard above Jerusalem.\n\nAir raid sirens are sounding 'almost nationwide,' Times of Israel reporter Emanuel Fabian wrote on X.\n\nIsraeli media indicated initial impacts at Tel Aviv, Haifa and the Negev.\n\nIran has launched fresh strikes against Israel, according to Iranian media.\n\nThe Israeli military said that it has identified missiles launched from Iran towards Israel and is working on intercepting the threat.\n\nIsrael earlier today said it was striking targets in western and central Iran.\n\nHuge demonstrations are taking place across Iranian cities today as hundreds of thousands of Iranians show solidarity in response to Israeli attacks.\n\nIn Tehran, people were chanting and waving Iranian flags with many bringing pictures of supreme leader Ayatollah Ali Khamenei.\n\nIt comes as Iranian politicians pleaded for the country to remain united in response to the Israeli conflict.\n\nAs the war between Israel and Iran escalates, Turkish President Recep Tayyip Erdogan has said he plans to strengthen the country's deterrence capabilities so that no country would dare attack it.\n\nErdogan announced plans this week to step up Turkey's production of medium- and long-range missiles.\n\nErdogan discussed the Iran-Israel war with German Chancellor Friedrich Merz in a telephone call today. He told Merz that the Iranian nuclear issue can only be resolved through negotiations, according to Erdogan's office.\n\nDespite Turkey's tense relations with Israel, analysts and officials don't see an immediate threat of the conflict spreading into NATO-member Turkey. Still, some see the move by Erdogan as a sign that the Israel-Iran war could trigger a new arms race in the region, with countries not directly involved in the fray ramping up their military efforts to preempt future conflicts.\n\nA poll by the survey group YouGov for The Economist magazine has found half of Americans viewed Iran as an 'enemy' and another quarter said it was 'unfriendly.'\n\nBut it found that only 16 percent of Americans 'think the US military should get involved in the conflict between Israel and Iran'.\n\nIt found that majorities of Democrats (65 percent), independents (61 percent) and Republicans (53 percent) opposed military intervention.\n\nSpeaking on his War Room podcast Wednesday, former Trump strategist Steve Bannon seethed that Netanyahu had 'lectured' America and started a war he couldn't end on his own.\n\nA former Iranian negotiator on nuclear talks has claimed Israel's military offensive will likely push Iran to develop an atomic bomb.\n\nSeyed Hossein Mousavian, a former Iranian ambassador to West Germany who served on Iran's nuclear diplomacy team, told CNN Iran had been transparent about its programme and was open to scrutiny from the UN.\n\nEuropean foreign ministers will tell their Iranian counterpart in Geneva that the U.S. is open to direct talks even as it considers joining Israeli strikes intended to smash Tehran's nuclear capacity, diplomats said before a meeting in Geneva.\n\nForeign Minister Abbas Araqchi will be told that Iran must send a 'clear signal,' two diplomats told Reuters, with pressure mounting on Tehran to agree tough curbs on its nuclear programme to prevent the potential development of an atomic weapon.\n\nU.S. Secretary of State Marco Rubio spoke to several Western counterparts prior to the Geneva meeting, the diplomats said, indicating readiness to engage directly with Tehran.\n\nWashington did not confirm that though broadcaster CNN quoted a U.S. official saying President Donald Trump supported diplomacy from allies that could bring Iran closer to a deal.\n\nTehran, however, has repeatedly said it will not talk to the Trump government until Israeli attacks end.\n\nThe Israeli military just announced that it is attacking 'military infrastructure' in western and central Iran.\n\nBritain's foreign secretary said on Friday that the government is working with the Israeli authorities to provide charter flights from Tel Aviv as soon as airspace reopens.\n\nBrits in Israel have been urged to register their presence with the authorities and told they would be contacted with further guidance.\n\nThose who have crossed into neighbouring countries from Israel will also receive help to reach airports, Lammy said.\n\nPolice have arrested six men after two pro-Israel protesters were attacked in a major incident outside the Iranian Embassy this morning.\n\nDetectives have launched an urgent probe after the two men were set upon outside the embassy, which is oppositeHyde Parkin westLondon.\n\nOfficers and paramedics swooped on Princes Gate, scrambling to detain suspects and treat the casualties.\n\nWorld Medical Association President Dr. Ashok Philip condemned what he called the 'deliberate' Iranian ballistic missile attack on Soroka Medical Center in Beersheba.\n\nThursday's attack caused structural damage to the building and led to the suspension of most hospital services, the Times of Israelreports.\n\nUnder international humanitarian law, healthcare facilities are protected spaces that must never be targeted; such attacks constitute grave breaches of the Geneva Convention,' Dr Philip said.\n\n'Any strike on a hospital violates international law.'\n\nTehran has also accused Israel of striking medical facilities in Iran.\n\nWhite smoke billows from the Soroka Hospital in Beersheba, southern Israel's biggest hospital, after being directly hit by Iran's ballistic missile on Thursday\n\nA worker inspects the damage at the Soroka hospital complex on Friday\n\nThousands of people joined a protest against Israel in the Iranian capital on Friday after weekly prayers, chanting slogans in support of their leaders, images on state television showed.\n\n'This is the Friday of the Iranian nation's solidarity and resistance across the country,' the news anchor said.\n\nFootage showed protesters holding up photographs of commanders killed since the start of the war with Israel, while others waved the flags of Iran and the Lebanese militant movement Hezbollah.\n\nSupport for the Iranian regime itself remains divisive. A majorpollof 158,000 people in Iran in 2023 found more than 80 per cent of people reject the Islamic Republic and prefer a democratic government.\n\nIranian worshippers wave Iranian flags as one holds up a poster of Iran's Supreme Leader Ayatollah Ali Khamenei during a protest against Israeli attacks, in downtown Tehran, Iran, Friday, June 20, 2025\n\nAustralia has shuttered its Tehran embassy and ordered officials to leave Iran, the government said Friday, citing a 'deteriorating security situation'.\n\nIt joins a string of countries closing diplomatic missions in Iran since Israel launched air strikes a week ago, claiming its arch enemy was on the verge of developing a nuclear weapon.\n\nAustralia has directed all its officials and their dependents to leave Iran, and suspended its Tehran embassy operations, Foreign Minister Penny Wong told a news conference in Adelaide.\n\n'This is not a decision taken lightly. It is a decision based on the deteriorating security environment in Iran,' she said.\n\nThe government advised all Australians to leave Iran if they can do safely.\n\nWong said there were about 2,000 Australians and family members registered in Iran who wanted to depart, and another 1,200 in Israel.\n\nOther nations that have suspended Tehran embassy operations include Bulgaria, Czech Republic, New Zealand, Portugal, and Switzerland.\n\nSaudi Arabia's Nuclear and Radiological Regulatory Commission said on Friday that any military attacks on civilian nuclear facilities violate international law, following Israel's strikes on Iranian nuclear sites amid an air war between the two countries.\n\nIsraeli action in Iran is said to be significantly advancing an agreement for the establishment of relations between long-time rivals Iran and Saudi Arabia, an Arab source toldi24NEWSon Tuesday.\n\nThe rulers of Saudi Arabia and the UAE, the biggest economies in the region, have already spoken with Iran's president to express solidarity, and have repeatedly condemned Israel's attacks.\n\nSaudi Arabia and Iran formally restored ties in March 2023 thanks to Chinese-Iraqi brokered talks, but relations have been strained since the Iranian Revolution in 1979.\n\nIran has allegedly arrested a 'Mossad Agent' alleged to have been sending information on Iranian air defence installations back to handlers in Israel via WhatsApp.\n\nThe claims were aired by Iran's state broadcaster on Friday.\n\nIsrael began pounding Iran last Friday, in a conflict that has the world holding its breath amid fears it could rapidly escalate and drag Britain and the US in.\n\nThe IDF's blistering aerial assault – codenamed 'Operation Rising Lion' – has targeted dozens of key nuclear sites, military bases and surface-to-air missile launchers. Oil and gas infrastructure have also been hit, as well as Iran's state news broadcaster, which was struck while live on air.\n\nAmong the eliminated are nuclear scientists and senior Iranian commanders, including the head of the Islamic Revolutionary Guard Corps (IRGC) – an elite wing of Tehran's military.\n\nAs the conflict enters its eighth day, see our graphics below of every strike in Iran and Israel plus morehere:\n\nThe war between Israel and Iran could see migration to Europe surge, Turkey's President has warned.\n\n'The spiral of violence triggered by Israel's attacks could harm the region and Europe in terms of migration and the possibility of nuclear leakage,' President Recep Erdoğan's office quoted him as saying in a phone conversation with German Chancellor Friedrich Merz.\n\nIranian President Masoud Pezeshkian has said that Iran will give a 'more forceful' response if Israeli strikes continue.\n\n'We have always pursued peace and stability,' Pezeshkian said in a statement.\n\n'Under the current circumstances, lasting peace will only be possible if the Zionist enemy ceases its hostilities and provides firm guarantees to end its terrorist provocations.'\n\nBut 'failure to do so would result in a far more forceful and regrettable response from Iran', he said.\n\nIsrael this morning said that it would intensify strikes on the capital, aiming to destabilise it with attacks on regime symbols.\n\nThe head of Iran's health ministry said that another hospital in Tehran was targeted by Israeli bombs today.\n\n'In seven days of cowardly aggression, there were more than six cases of violation of international conventions by [Israel],' the ministry's head of PR said in a statement.\n\nIran has said that it will not negotiate until Israeli strikes stop. But dissidents opposing the regime within Iran have also said it remains too unsafe to go out into the streets in protest while Israeli jets are striking targets overhead.\n\nIsraeli Defence Minister Israel Katz said on Friday that he had instructed the military to intensify attacks on 'symbols of the regime' in the Iranian capital Tehran, aiming to destabilise it.\n\n'We must strike at all the symbols of the regime and the mechanisms of oppression of the population, such as the Basij (militia), and the regime's power base, such as the Revolutionary Guard,' Katz said in a statement.\n\nTehran has been hit more than 100 times in the last 24 hours, according to data from the ISW and AEI's critical threats project.\n\nIran has said that it will not negotiate with any party while sustaining fire from Israel.\n\nImagery from Iran purports to show a drone strike in the capital on Friday\n\nDanish shipping giant Maersk has announced Friday that it is temporarily suspending vessel calls in Israel's Haifa port due to the country's conflict with Iran.\n\nMaersk said in a statement that it made the decision 'after carefully analysing threat risk reports regarding the ongoing conflict between Israel and Iran - particularly the potential risks of calling Israeli ports and their implications for the safety of our crews'.\n\nFrench President Emmanuel Macron said it is 'essential to prioritise a return to negotiations' on Iran as Donald Trump dwells on potential U.S. involvement in the conflict.\n\nMacron said that European powers will try to offer a 'diplomatic solution' to the conflict on Friday as foreign ministers from Britain, France and Germany met with their Iranian counterpart in Geneva.\n\nMacron, who was arriving at the Paris airshow on Friday, added that there was 'no justification' for strikes against either energy infrastructure or civilian populations.\n\nEuropean leaders have urged de-escalation in Iran's war with Israel, while Trump has said he would decide 'within the next two weeks' whether to involve the United States in the fighting.\n\nIsraeli media is reporting an Iranian nuclear scientist was today assassinated following a strike on Tehran.\n\nReports from Israeli Army Radio, which is operated by the IDF, said the scientist was killed along with two assistants during the night.\n\nIsrael military said it struck dozens of targets in Tehran overnight, including what it called a centre for the 'research and development of Iran's nuclear weapons project'.\n\nBritain's Foreign Secretary David Lammy said 'a window now exists within the next two weeks to achieve a diplomatic solution' over the Iran crisis as European foreign ministers met for nuclear talks with their Iranian counterpart in Geneva.\n\nEuropean officials are set to hold nuclear talks with Iranian Foreign Minister Abbas Araghchi today, as President Donald Trump mulls the prospect of US involvement in the Iran-Israel war.\n\nSpeaking on the sidelines of the summit, Lammy agreed with US Secretary of State Marco Rubio's comments that Iran 'can never develop or acquire a nuclear weapon'.\n\nGerman Foreign Minister Johann Wadephul said the United States was both aware and supportive of the meeting taking place in Geneva.\n\nFrance's foreign ministry spokesperson Christophe Lemoine said the diplomatic route would be the only way to ensure Iran respects its obligations under the nuclear Non-Proliferation Treaty.\n\nIran's Araghchi, however, rejected any prospect of talks with the United States so long as Israel continues its attacks.\n\nTripods are set up outside the Permanent Mission of the Federal Republic of Germany to the United Nations in Geneva ahead of a meeting for the Iran-EU nuclear meeting\n\nDonald Trump has received extensive briefings on Iran's underground uranium enrichment plant at Fordow - including the risks and benefits of launching a U.S. attack.\n\nAccording to insiders, Trump has told his defence officials it would only make sense to join Israel in striking Iran if American 'bunker buster' bombs are guaranteed to be able to destroy Fordow.\n\nIn order to do that, officials have been told the U.S. would have to soften the ground with conventional bombs before dropping a tactical nuclear weapon from a B2 Bomber to destroy the site 90-metres underground.\n\nIt has since been reported Trump has ruled out the use of a nuclear weapon in Iran.\n\nHere is the facility at the centre of the conflict:\n\nSome 8,190 people have been evacuated from their homes in Israel as the conflict with Iran enters its eighth day, Israeli media is reporting.\n\nThe Property Tax Compensation Fund said that since the crisis erupted, thousands have been displaced and some 30,000 claims for compensation filed for damage to buildings, vehicles or contents and equipment, Ynet Newsreports.\n\nIran's foreign minister will address the UN Human Rights Council on Friday on the sidelines of talks with European counterparts aiming for a diplomatic solution to the Iran-Israel war.\n\nAbbas Araghchi 'will intervene in person... at the beginning of the council's afternoon meeting' at 1300 GMT, after which the council will resume its normal programme, Pascal Sim, spokesman for the UN's top rights body, told a press briefing.\n\nUN spokeswoman Alessandra Vellucci added that Daniel Meron, Israel's ambassador to the UN in Geneva, would be outside the council chamber at 1230 GMT to deliver a 'press statement on Iran'.\n\nAraghchi is meeting his French, German, British and EU counterparts in Geneva on Friday to discuss Iran's nuclear programme.\n\nIsrael no longer participates in the Human Rights Council, boycotting its meetings over 'anti-Semitism'.\n\nDiplomats are meeting in Geneva today to begin talks around the Iran crisis and Tehran's nuclear programme.\n\nInitial talks are not expected to yield major progress towards peace. But they could carve out a space for dialogue between Iran and the U.S., mediated by Britain and Europe.\n\nRussia, too, has been eyeing a mediating role in the growing crisis.\n\nFrance's foreign minister, Jean-Noel Barrot, is said to have already spoken to U.S. Secretary of State Marco Rubio on the sidelines.\n\nA French diplomatic source told The Guardian that Rubio emphasised that the U.S. is 'ready for direct contact with the Iranians at any moment'.\n\nJohann Wadephul, the German foreign minister,said ahead of meeting with Abbas Araghchi, Iran's foreign minister, that if today goes well, it could pave the way for more talks.\n\n'This requires Iran’s serious willingness to renounce any enrichment of nuclear material, which could lead to nuclear weaponisation,' he said, according to Reuters news agency.\n\nDonald Trump told defence officials it would only make sense for the U.S. to join Israel in striking Iran if its 'bunker buster' bombs are guaranteed to be able to destroy the key enrichment site at Fordow, according to people familiar with the discussions.\n\nOfficials were said to have been told that the U.S. would have to soften the ground with conventional bombs before dropping a tactical nuclear weapon from a B2 Bomber to completely destroy the site, believed to be some 90 metres underground.\n\nBut Trump is said to have ruled out nuking Iran, insiders toldthe Guardian. The possibility was said not to have been raised by defence secretary Pete Hegseth or chairman of the joint chiefs of staff General Dan Caine during recent meetings in the Situation Room.\n\nFox News reported subsequently that the White House had refuted the entire Guardian report, indicating that the use of a tactical nuclear weapon had not yet been ruled out.\n\nTrump said late on Thursday that he will now decide in the next two weeks whether to join in military action against Iran, before British and European diplomats were to meet with Iran's Foreign Minister Abbas Araghchi in Geneva on Friday.\n\nRussia warned today that any use of tactical nuclear weapons in Iran would be 'catastrophic' amid fears it could spark wider conflict across the Middle East.\n\nThese pictures show Israeli bomb experts at the scene of the latest Iranian ballistic missile attack in southern Israel today.\n\nFor the second day in a row Beersheba has come under attack as the missile struck a road near several apartment blocks.\n\nThe strike has created a large crater and caused several cars to catch alight. The Times of Israel is reporting seven people suffered minor injuries with some substantial damage to homes.\n\nDonald Trump is said to be increasingly relying on a small group of advisors for input on Iran as he debates whether or not to join Israel's military action.\n\nTwo defence officials and a senior administration official told NBC News that the U.S. President has closed his inner circle in a report published on Friday.\n\nAnother senior administrational official said that while Trump routinely crowdsources for ideas, he is listening to only a handful of officials for decision-making.\n\nThese include his Vice President, chief of staff, deputy chief of staff and Secretary of State, the official said.\n\nTrump was also said to have sidelined National Intelligence Director Tulsi Gabbard, who opposes strikes in Iran.\n\nAnd he has not been leaning on Defense Secretary Pete Hegseth, officials said.\n\nThe possibility of kinetic action against Iran remains deeply divisive within the administration and without.\n\nIranian foreign minister Abbas Araghchi has claimed Tehran has refused talks with Washington because it is a 'partner' in Israeli 'crimes'.\n\nSpeaking on state television, Araghchi said Iran is not planning any contact with the US for the time being.\n\nHis remarks come just hours after the White House indicated Donald Trump will decide whether or not the US gets directly involved in the conflict within the next two weeks.\n\nAraghchi said that while negotiations with the US are not on the horizon, Iran had no issue engaging with other countries as officials meet European leaders in Geneva later today.\n\nThe minister said those talks were limited to nuclear and regional issues and that Iran will not negotiate regarding its missile capabilities.\n\nThe Iranian Khondab heavy water research reactor was damaged in Israeli strikes on Thursday, but no 'radiological consequence' is expected, the International Atomic Energy Agency said.\n\nThe UN's nuclear watchdog assessed that because the facility was still under construction and not operational, it contained no nuclear material.\n\nRafael Grossi assured that, as a result, no radiological consequence was expected.\n\nReactors like the facility near the city of Arak can be used for scientific purposes, but will create plutonium as a byproduct. This could be used for nuclear weapons.\n\nIran's fragmented opposition groups think their moment may be close at hand, but activists involved in previous bouts of protest say they are unwilling to unleash mass unrest, even against a system they hate, with their nation under attack.\n\nExiled opponents of the Islamic Republic, themselves deeply divided, are urging street protests. In the borderlands, Kurdish and Baluchi separatist groups look poised to rise up, with Israeli strikes pummelling Iran's security apparatus.\n\nWhile the Islamic Republic looks weaker than at nearly any point since soon after the 1979 revolution, any direct challenge to its 46-year rule would likely require some form of popular uprising.\n\nTriggering regime change is certainly one war goal for Israel, with Prime Minister Benjamin Netanyahu addressing Iranians to say 'we are also clearing the path for you to achieve your freedom'.\n\nBut while Israeli strikes have targeted a security hierarchy that crushed previous bouts of protest, they have also caused great fear and disruption for ordinary people - and anger at both Iranian authorities and Israel, the activists said.\n\nSmoke rises following an Israeli attack on the IRIB building, the country's state broadcaster, in Tehran, Iran, June 16, 2025.\n\nThe Iranian Red Crescent ambulance targeted in the Israeli attack on June 16 in Iran's West Azerbaijan province, in which two healthcare workers lost their lives, is being displayed in Haft-e Tir Square in Tehran, Iran on June 19, 2025\n\n'How are people supposed to pour into the streets? In such horrifying circumstances, people are solely focused on saving themselves, their families, their compatriots, and even their pets,' said Atena Daemi, a prominent activist who spent six years in prison before leaving Iran.\n\nOne activist, who was jailed for five months after the 2022 protests over the death in custody of Mahsa Amini, said she believed in regime change in Iran but that it was not time to take to the streets.\n\nShe and her friends were not planning to stage or join rallies, she said, and dismissed calls from abroad for protests. 'Israel and those so-called opposition leaders abroad only think about their own benefit,' she said.\n\nBritish Foreign Secretary David Lammy is to join with top European diplomats and Iran's Foreign Minister Abbas Araghchi in Geneva on Friday to discuss Iran's nuclear programme.\n\nForeign ministers from France, Germany, Britain and the EU are urging de-escalation, with David Lammy saying the next two weeks are 'a window... to achieve a diplomatic solution'.\n\nLammy yesterday met with American Secretary of State Marco Rubio and U.S. Middle East envoy Steve Witkoff at the White House.\n\nAl Jazeera, reporting from Washington, reports: 'We're told that Lammy came away with a genuine feeling that Trump does want to see a deal [with Iran]'.\n\nAfter days of escalatory comments suggesting the U.S. could join Israel in its hitherto unilateral strikes against Iran, Donald Trump decided overnight to open a two-week negotiating window before deciding on striking Iran.\n\n'Based on the fact that there's a substantial chance of negotiations that may or may not take place with Iran in the near future, I will make my decision whether or not to go within the next two weeks,' a readout from Trump said, shared late Thursday.\n\nLeaders will today convene in Geneva to see if there is a way back to the negotiating table, after talks in Oman were called off.\n\n'I've received several phone calls reassuring me that the Zionist regime [Israel] would not target' Araghchi en route to Geneva, his adviser Mohammad Reza Ranjbaran said on X.\n\nSeparately, the UN Security Council is also due to convene on Friday for a second session on the conflict, at Iran's request with support from Russia, China and Pakistan, a diplomat told AFP on Wednesday.\n\nForeign Secretary David Lammy leaves Downing Street, London on Wednesday, June 18\n\n'I am 200 per cent sure Lebanon will not enter the war,' senior politician and parliament speaker Nabih Berri told local MTV News last night.\n\n'It has no interest in doing so and would pay a heavy price. Iran does not need us. It is Israel that needs support.'\n\nIsrael has been cautioning Iranian proxy group Hezbollah not to involve itself as Israel and Iran continue to exchange blows.\n\nLate last year, Israel and Hezbollah agreed to terms that would see Hezbollah retract and more Lebanese army troops brought in to patrol the border with the U.N.\n\nIsrael has nonetheless continued strikes into Lebanon, hitting southern Beirut on the eve of Eid Al Adha earlier this month.\n\nThe military claimed it had identified a Hezbollah unit producing 'thousands' of drones underground, funded by 'Iranian terrorists'.\n\nAli Shamkhani, a senior advisor to Iran's supreme leader Ayatollah Ali Khamenei, is alive and in a stable condition, according to Iranian media, after being reported dead earlier this week.\n\nShamkhani was said to have been seriously wounded in an Israeli attack a week ago. Iranian state TV network IRINN reported that he succumbed to injuries and died.\n\nBut now the semi-official Tasnim news agency, based in Iran, hasquotedhim as having said 'I am alive and ready to sacrifice myself' in a message to the Ayatollah and the Iranian nation.\n\nShamkhani, a close aide to the Ayatollah Khamenei, was reported to have died earlier this week. Now, Iranian media says he is alive and 'ready to sacrifice myself'.\n\nIranian missiles struck near a military branch in Israel's Beersheba (Be'er Sheva) on Friday, Al Jazeera is reporting.\n\nStrikes were said to have damaged a Microsoft office in the Gav-Tam Negev advanced technologies park.\n\nThe park borders Ben Gurion University and the C4i branch campus of the Israeli army, its telecoms branch, the Qatari outlet says, noting the strikes would have come down before typical business hours.\n\nSeven people are reported to have been injured in the attack.\n\nEmergency personnel work next to burnt cars and damaged residential buildings at an impact site following Iran's missile strike on Israel, in Be'er Sheva, Israel, June 20\n\nIsraeli soldiers work next to a damaged residential building at an impact site following Iran's missile strike on Israel, in Be'er Sheva, Israel, June 20\n\nIsraeli Defence Minister Israel Katz warned Lebanon's Hezbollah to exercise caution on Friday, saying Israel's patience with 'terrorists' who threaten it had worn thin.\n\nThe head of Iran-backed Hezbollah, Naim Qassem, said on Thursday that the Lebanese group would act as it saw fit in the face of what he called 'brutal Israeli-American aggression' against Iran.\n\nHezbollah's military leadership was vanquished late last year after Israel launched a ground invasion of Lebanon to oust the Iranian-proxy group, citing failure to uphold the terms of a long-established ceasefire agreement.\n\nAn even heavier blow to Hezbollah was the fall in December of Syria's Bashar Assad when Sunni rebels marched on the capital and removed him from power. Now, a government hostile to Iran and Hezbollah rules from Damascus.\n\nSupporters of Iraq's Hezbollah Brigades attend a gathering to condemn Israel's attack on Iran in the city of Nasiriyah, in Iraq's southern Dhi Qar province on June 19, 2025\n\nIsrael's military said on Friday that it had struck dozens of targets in Tehran overnight, including what it called a centre for the 'research and development of Iran's nuclear weapons project'.\n\nIn a statement, the army said it had 'completed a series of strikes in the heart of Tehran' as the crisis entered its eighth day.\n\n'Dozens of targets were struck, including military missile production sites and the SPND (Organisation of Defensive Innovation and Research) headquarters for research and development of Iran's nuclear weapons project,' it claimed.\n\nAccording to the Israeli military the SPND headquarters 'is used for research and development of advanced technologies and weapons supporting the Iranian regime's military capabilities.'\n\nThe army said that during the night on Thursday more than 60 fighter jets struck dozens of military targets.\n\n'Among the targets were sites producing missile components and facilities manufacturing raw materials used in casting missile engines,' it added.\n\nThe military also said it intercepted overnight four UAVs launched from Iran.\n\nAmerican use of tactical nuclear weapons in the Middle East would lead to catastrophic consequences, Kremlin spokesperson Dmitry Peskov told the Russian TASS news agency.\n\n'There have been a lot of speculations,' Peskov caveated, responding to media reports that Washington had not yet ruled out the use nuclear weapons to attack the entrenched underground Fordow enrichment site in Iran.\n\n'This would be a catastrophic development,' he said. 'But there are so many speculations that in fact, it's impossible to comment on them.'\n\nFordow remains the most heavily defended known enrichment site in Iran, buried some 80 to 90 metres underground.\n\nIsrael is believed to lack the capability to destroy the site with its current arsenal, though insiders have suggested multiple raids could weaken the site.\n\nThe American B-2 Spirit bombers, capable of carrying GBU-57 Massive Ordnance Penetrators (MOPs), could deal heavy damage - though would require U.S. intervention.\n\nRussia has presented itself as a possible mediating force between U.S.-backed Israel and Iran in recent days, though U.S. President Donald Trump has publicly been reluctant to accept the offer.\n\nGood morning and welcome to MailOnline's live coverage of the Iran-Israel conflict as it enters its eighth day.\n\nRussia has today warned America any use of tactical nuclear weapons in Iran would be 'catastrophic' as it wades into the situation in the Middle East.\n\nRussian news service Tass is reporting the Kremlin has issued a fresh plea for Trump to avoid using bunker busting bombs on Iranian nuclear facilities\n\nIt comes as Donald Trump will decide within the next two weeks on whether the U.S. will conduct a strike on Iran.\n\nStick with us for the latest updates throughout the day plus the most eye-catching pictures and videos\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nBy posting your comment you agree to ourhouse rules.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with ourPrivacy Policy."
    }
}