{
    "question": "How might the Dodgers’ denial of parking-lot access to federal agents, and the conflicting ICE and DHS accounts about their presence, affect public trust and future coordination between major venues and immigration authorities?",
    "content": {
        "source_1": "Federal immigration agents in a line of unmarked white vans and SUVs attempted to enter the parking lots of Dodger Stadium on Thursday morning, sparking a wave of speculation online about potential immigration enforcement at the ballpark.\n\nBut, according toDodgersofficials, the agents were denied entry to the grounds.\n\nIn photos posted on social media Thursday, a procession of vehicles appeared to attempt to enter Dodger Stadium through the ballpark’s main Sunset Gate off Vin Scully Avenue around 8 a.m. However, they were prevented from passing through a security checkpoint leading to the parking lot.\n\nThe caravan then relocated to the stadium’s Downtown Gate near the 110 Freeway. Dozens of vehicles gathered outside a closed parking lot fence, according to witnesses, before many began dispersing.\n\nLater in the morning, several dozen protesters gathered near what remained of the agents, who stood around three unmarked SUVs closer to the stadium’s entry gates but still outside the stadium parking lot.\n\nFive agents — several covering their faces with gaiters and armed with pistols — stood between the vehicles. They did not wear identifying items or badges. When asked by a Times reporter which agency they were with, they said “DHS” and declined to comment further.\n\nEventually, police came to the scene and the agents drove away. The crowd of several dozen dispersed by the afternoon.\n\nAccordingto a statement by the team, the agents were denied entry to the Dodger Stadium grounds when they attempted to enter the parking lots.\n\nHas anybody checked Shohei Ohtani’s papers lately? Or those of Teoscar Hernández, Kim Hye-seong or Yoshinobu Yamamoto? And what about the doughnuts?\n\n“This morning, ICE agents came to Dodger Stadium and requested permission to access the parking lots. They were denied entry to the grounds by the organization. Tonight’s game will be played as scheduled,” the statement said.\n\nBut both the Department of Homeland Security and its Immigration and Customs Enforcement officials took to social media to address Thursday’s events.\n\nResponding to the team’s post on social media,ICE posted on X: “False. We were never there.”\n\nThe Department of Homeland Security, meanwhile, said it was Customs and Border Protection agents who were at the stadium, but not for an operation.\n\n“This had nothing to do with the Dodgers. CBP vehicles were in the stadium parking lot very briefly, unrelated to any operation or enforcement,” the agency said.\n\nA Los Angeles Police Department source, who requested anonymity in order to discuss internal matters, said federal agents had gathered near the stadium to conduct a briefing but had left by the time images of the gathering began circulating on social media.\n\nSinger and social media star Nezza posted on TikTok that she sang national anthem in Spanish at Dodger Stadium Saturday despite the team’s objections.\n\nHowever, at least some of the vehicles outside Dodger Stadium were believed to have been involved in an immigration raid at a Home Depot in Hollywood earlier in the morning, where several people were seen being arrested.\n\nEmily Phillips, an Echo Park Rapid Response community member, shared photos with The Times of two vehicles that were at both the Hollywood Home Depot and Dodger Stadium on Thursday, as identified by their license plates.\n\nPhillips also said a CBP officer at Dodger Stadium told her the agents were there to process the people they had arrested.\n\n“We bring the detainees here to process them and conduct our investigation without public interference,” the agent said, according to Phillips, who wrote down his quote. “We can’t do it in the Home Depot parking lot because the public makes it dangerous.”\n\nA majority of the ICE flights departing Victorville were headed to airports near detention centers in Arizona and Texas.\n\nHomeland Security did not immediately respond to The Times’ request for comment about the agents’ actions at Dodger Stadium.\n\nAmong those protesting outside the stadium were members of theCoalition for Humane Immigrant Rights, or CHIRLA.\n\n“The fact that these raids continue is what we Angelenos should be very concerned about,” said CHIRLA member Jorge-Mario Cabrera, who was in contact with fellow members monitoring activity at the stadium Thursday. “Dodger Stadium is a place where Angeleno families come and have fun.”\n\nThe Dodgers have beenunder pressuresince the raids began this month to make a statement in support of immigrants. The team also came under fire from some fans after singer and social media personalityNezza sang a Spanish version of the national anthemat Dodger Stadium in an act of protest against the immigration raids, despite being asked by a team employee to sing in English.\n\nThe Dodgers have declined to release a statement in support of their fans protesting ICE raids that have ripped apart families in Southern California.\n\nOn Wednesday, theteam said it intended to announce planson Thursday to assist the immigrant communities recently affected in Los Angeles.\n\nBut on Thursday, Dodgers President Stan Kasten said that announcement was being postponed “because of the events earlier today.”\n\n“We continue to work with groups that were involved with our programs,” Kasten said. “But we are going to have to delay today’s announcement while we firm up some more details. We’ll get back to you soon with the timing.”\n\nA small group of protesters positioned themselves outside of the main gate at Dodgers Stadium on Thursday night, where the Los Angeles was playing San Diego.\n\nSecurity easily ushered the group, previously dozens in size, out of the way for traffic coming toward the stadium. Some held signs that said “ICE out of L.A.” in the shape of the Dodgers insignia, and others jabbed at President Trump’s character and immigration enforcement practices.\n\n“If a felon can be president, then an immigrant can be a citizen,” a sign said.\n\nAt almost 10 p.m., one man was left demonstrating after the small crowd of protesters broke off one by one. The man, who asked not to be identified out of concern that he’d be targeted by immigration officials, held an upside-down American flag, which he said signified the “chaos” of the current administration.\n\n“This is an immigrant country,” the man said. “He’s creating so much hate against our communities of immigrants… It’s not fair.”\n\nTimes staff writers Jack Flemming, Libor Jany, Andrew Campa, Bill Shaikin and Christopher Buchanan contributed to this report.",
        "source_2": "A dispute arose between the Los Angeles Dodgers and the Department of Homeland Security after the team claimed ICE agents attempted to access Dodger Stadium’s parking lot.\n\nDHS denied the claim, stating CBP vehicles were briefly present for unrelated reasons.\n\nReports later confirmed CBP agents relocated a transfer operation to the stadium lot from a nearby Home Depot.\n\nA dispute has emerged between the Los Angeles Dodgers and the Department of Homeland Security (DHS), unfolding just hours after the team said it would be announcing new initiatives aimed at supporting immigrant communities in Southern California. The development comes as U.S. Immigration and Customs Enforcement (ICE) intensifies its efforts in the region to identify and arrest individuals who are unlawfully in the United States.\n\nThe Dodgers, on Thursday, June 19,posted to X, saying, “ICE agents came to Dodger Stadium and requested permission to access the parking lots. They were denied entry to the grounds by the organization. Tonight’s game will be played as scheduled.”\n\nICE responded directly,saying, “False. We were never there.”\n\nStraight Arrow News reached out to DHS asking for clarification about why ICE agents would’ve been at the Dodgers’ parking lot.\n\nDHS onlyrepliedwith a response from Assistant Secretary Tricia McLaughlin, who said, “This had nothing to do with the Dodgers. CBP vehicles were in the stadium parking lot very briefly, unrelated to any operation or enforcement.”\n\nU.S. Customs and Border Protection and ICE both fall under the U.S. Department of Homeland Security, but each agency has different missions, responsibilities and areas of operation.\n\nCBP is responsible for border protection, including the entry of people and goods into the country, as well as stopping illegal entry and smuggling at the border. ICE operates within the interior of the country and is responsible for immigration enforcement, detaining and deporting undocumented immigrants.\n\nCBP agentshave the rightto stop and search vehicles without a warrant if they are looking for people who may not have legal immigration documents.\n\nThey can do this within 100 miles of U.S. borders and the entire U.S. coastline. Dodger Stadium is 136 miles from the U.S.-Mexico border and approximately 18 miles from the nearest U.S. coastline.\n\nHowever, the Dodgers stadium and parking lot are private property, and federal agents generally need a judicial warrant to enter private property.\n\nMasked CBP agents could be seen near the downtown parking lot entrance to Dodger Stadium on Thursday. DHS said they were there unrelated to any enforcement.\n\nAli Bradley, a reporter with NewsNation,posted on Xthat she spoke with sources from U.S. Customs and Border Protection who confirmed that CBP teams were present at the Home Depot in Hollywood to conduct apprehensions. However, the agents later decided to relocate the transfer operation and moved to an open parking lot at Dodger Stadium, where they completed the transfers.\n\nAccording to Bradley, the agents stated that no one told them to leave the Home Depot premises.\n\nThe Dodgers said their game against the San Diego Padres on Thursday evening would still be played as scheduled. Straight Arrow News reached out to the Dodgers for comment and have not yet received a reply.\n\nA DISPUTE HAS EMERGED BETWEEN THE LOS ANGELES DODGERS AND THE DEPARTMENT OF HOMELAND SECURITY.\n\nTHE DEVELOPMENT COMES AS U.S. IMMIGRATION AND CUSTOMS ENFORCEMENT INTENSIFIES ITS IMMIGRATION ENFORCEMENT EFFORTS THROUGHOUT SOUTHERN CALIFORNIA.\n\nTHE DODGERS, THURSDAY AFTERNOON, POSTED TO X SAYING “ICE AGENTS CAME TO DODGER STADIUM AND REQUESTED PERMISSION TO ACCESS THE PARKING LOTS. THEY WERE DENIED ENTRY TO THE GROUNDS BY THE ORGANIZATION. TONIGHT’S GAME WILL BE PLAYED AS SCHEDULED.”\n\nAND THEN ICE REPLIED BACK “FALSE. WE WERE NEVER THERE.”\n\nSTRAIGHT ARROW NEWS REACHED OUT TO DHS ASKING FOR CLARIFICATION ABOUT WHY ICE AGENTS WOULD’VE BEEN AT THE DODGERS’ PARKING LOT.\n\n“THIS HAD NOTHING TO DO WITH THE DODGERS. CBP VEHICLES WERE IN THE STADIUM PARKING LOT VERY BRIEFLY, UNRELATED TO ANY OPERATION OR ENFORCEMENT,” THE AGENCY SAID\n\nMASKED CBP AGENTS COULD BE SEEN NEAR THE DOWNTOWN PARKING LOT ENTRANCE TO DODGER STADIUM THURSDAY. THE DODGERS STADIUM AND PARKING LOT ARE PRIVATE PROPERTY AND FEDERAL AGENTS GENERALLY NEED A JUDICIAL WARRANT TO ENTER PRIVATE PROPERTY.\n\nALI BRADLEY, A REPORTER WITH NEWSNATION, POSTED ON X THAT SHE SPOKE WITH SOURCES FROM U.S. CUSTOMS AND BORDER PROTECTION WHO CONFIRMED THAT CBP TEAMS WERE PRESENT AT THE HOME DEEPOE IN HOLLYWOOD TO CONDUCT APPREHENSIONS.\n\nHOWEVER, THE AGENTS LATER DECIDED TO RELOCATE THE TRANSFER OPERATION and MOVED TO AN OPEN PARKING LOT AT DODGER STADIUM, WHERE THEY COMPLETED THE TRANSFERS. ACCORDING TO BRADLEY, THE AGENTS STATED THAT NO ONE TOLD THEM TO LEAVE THE HOME DEEPOE PREMISES.\n\nTHE DODGERS SAID THEIR GAME AGAINST THE SAN DIEGO PADRES THURSDAY EVENING WOULD STILL BE PLAYED AS SCHEDULED.\n\nThe incident at Dodger Stadium highlights the complexity of federal immigration enforcement and its intersection with private property rights, public events and community relations in Southern California.\n\nThe presence and activities of federal agencies such as Customs and Border Protection and ICE raise questions about immigration enforcement actions and their implications in community settings.\n\nThe Dodgers' decision to deny entry to federal agents underscores legal and ethical considerations regarding the authority of law enforcement on private property.\n\nConflicting statements from the Dodgers, federal agencies, and media sources illustrate the challenges in maintaining transparency and trust between authorities, organizations and the public.\n\nSynthesized coverage insights across146media outlets\n\nThis incident occurs amid an expansion of federal immigration enforcement in Democratic-led cities like Los Angeles. Protests and public outcry have arisen in response to perceived aggressive immigration raids and the deployment of federal forces, reflecting a longstanding debate over the city’s status as a sanctuary and its large immigrant community.\n\nThe Pew Research Center estimated 1.8 million undocumented immigrants in California in 2022, down from 2.8 million in 2007. DHS reports over 66,000 ICE arrests in the first 100 days of Trump’s second term. Los Angeles County has a population of around 9.6 million, with 3.5 million immigrants, highlighting the scale of the city's immigrant presence.\n\nHigh-profile standoffs between local institutions and federal immigration authorities have recurred throughout U.S. history, particularly in sanctuary cities. Historically, local resistance has often prompted legal and political battles over states’ rights, federal jurisdiction, and the limits of immigration enforcement on private property and at public events.",
        "source_3": "Veterans Affairs Secretary Doug Collins explains the impact of anti-ICE demonstrations and his efforts to prioritize the goal of helping veterans.\n\nTheLos Angeles Dodgerssaid on Thursday that the team had denied U.S. Immigrations and Customs Enforcement (ICE) agents entry to the grounds of the ballpark.\n\nThe team said the agents had \"requested permission to access the parking lots,\" but an ICE spokesperson said in an email to Fox News Digital that \"ICE was never atDodgers stadium, and thus never tried to gain access.\"\n\nICE said in asocial media postreplying to the Dodgers' statement, \"False. We were never there.\"\n\nThe team reportedly denied the agents access to the ballpark.(KTTV)\n\nLaw enforcement was spotted outside of Dodger Stadium earlier Thursday that was initially believed to be ICE, which prompted protesters at the site. But, in a statement of their own after ICE's denial, the U.S. Customs and Border Protection (CBP) said that \"CBP vehicles were in the stadium parking lot very briefly,\" and it \"had nothing to do with the Dodgers.\"\n\nThe vehicles on stadium grounds were \"unrelated to any operation or enforcement,\" a CBP spokesperson said in a statement.\n\nProtesters made their way toward Dodger Stadium shortly after the officials' presence.\n\n\"Get these fascist f---ing pigs out of our city,\" an accountwrote on X.\n\nAnother accountwrote that \"support\" was \"needed\" and implored \"mass mobilization\" to Gate E of the ballpark.\n\nThe team is expected to make an announcement later Thursday that they will assist immigrant communities. The team has been silent about the protests and riots around the city.\n\nThe team recently found itself in a conundrum withlocal singer Nessa, who recently performed \"The Star-Spangled Banner\" in Spanish on Saturday as a form of protest against ICE raids in the city.\n\nShe said she has since received death threats, but the support from Latin celebrities \"triple-confirmed\" for her that \"what I did was right.\"\n\nHowever, veteran utilityman Enrique Hernández made a social media post on Saturday night before the game about the protests.\n\nPlay between the Colorado Rockies and the Los Angeles Dodgers in the seventh inning at Dodger Stadium on August 13, 2023, in Los Angeles, California.(Ronald Martinez/Getty Images)\n\nCONTROVERSIAL NATIONAL ANTHEM SINGER AT DODGERS GAME SAYS SHE'S RECEIVED DEATH THREATS\n\n\"I may not be Born & Raised, but this city adopted me as one of their own,\" Hernández wrote on Instagram. \"I am saddened and infuriated by what’s happening in our country and our city. Los Angeles and Dodger fans have welcomed me, supported me and shown me nothing but kindness and love. This is my second home. And I cannot stand to see our community being violated, profiled, abused and ripped apart.\n\n\"ALL people deserve to be treated with respect, dignity and human rights. #CityOfImmigrants.\"\n\nOther Los Angeles-based professional sports teams have taken a stance, including the NWSL’s Angely City F.C., which gave fans \"Immigrant City Football Club\" T-shirts at their game on Saturday. Players were also seen warming up with the t-shirts on before their match to show support for those protesting.\n\nThe stage before Shohei Ohtani is introduced by the Los Angeles Dodgers at Dodger Stadium on December 14, 2023, in Los Angeles, California.(Meg Oliphant/Getty Images)\n\nNezza’s Spanish rendition of the anthem came on the day of numerous \"No Kings\" protests, which were in response to the military parade in Washington, D.C., that coincided with PresidentDonald Trump’sbirthday, across the country.\n\nTrump’s birthday was also the 250th birthday celebration of the United States Army.\n\nFox News' Scott Thompson contributed to this report.\n\nFollow Fox News Digital’ssports coverage on X, and subscribe tothe Fox News Sports Huddle newsletter.\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox"
    }
}