{
    "question": "How do varying definitions of “school shooting” used by widely cited trackers influence public understanding, media narratives, and policy discussions about school safety in 2025?",
    "content": {
        "source_1": "There have been 33 school shootings in the United States so far this year, as of July 25. Nineteen were on college campuses, and 14 were on K-12 school grounds. The incidents left 15 people dead and at least 41 other victims injured, according to CNN’s analysis of events reported by the Gun Violence Archive, Education Week and Everytown for Gun Safety.\n\nCNN cross checks these reports of school shootings against school and police accounts and media reports. All incidents of gun violence are included if they occurred on school property, from kindergartens through colleges/universities, and at least one person was shot, not including the shooter. School property includes but is not limited to, buildings, fields, parking lots, stadiums and buses. Accidental discharges of firearms are included, as long as at least one person is shot, but not if the sole shooter is law enforcement or school security.\n\nIn the first year of the pandemic, when schools were closed, there was a major decline in gun violence incidents on school grounds. Since then, recent years saw a stark increase in school shootings, with 2021, 2022, 2023 and 2024 all setting records since at least 2008. There were at least 83 incidents in 2024, but2022 was one of the deadliest years, with 47 fatalities, according to CNN’s analysis. That year saw the shooting at Robb Elementary School in Uvalde, Texas, where 19 students and two educators were killed and more than a dozen others were injured.\n\nStudents and educators have engaged inactivismaround the issue of gun violence, and some educators havequitthe profession.\n\nSome states in the south have seen the highest rate of school shootings relative to their populations since 2008, according to CNN’s analysis. Washington, DC had the highest rate — 6 total shootings, almost 1 per 100,000 people — while Texas had the most overall with 64 school shootings. Meanwhile, just five states — Montana, Wyoming, New Hampshire, Vermont and Rhode Island — had no school shootings in that period, according to CNN’s analysis.\n\nThis story has been updated with additional information.",
        "source_2": "Different definitions of “school shooting” are contributing tomisinformationabout the issue.\n\nThere are several efforts to track the number of school shootings in the U.S. One of them counted 346 school shootings in 2023. The other counted 37. Both have been cited in media reports – the larger one, more often – but the discrepancy is rarely explained. How could they be so different?\n\nThe Violence Project, an independent operation run by data scientistDavid Riedman, has a“K-12 School Shooting Database.”The tracker includes any incident in which \"a gun is brandished, is fired, or a bullet hits school property for any reason, regardless of the number of victims, time, or day of the week.\" It counted 346 incidents in 2023, and counted nine in the first 12 days of 2024.\n\nEducationWeek (Center bias), a news organization, uses more limited criteria. Itcountsincidents “where a firearm was discharged, where any individual, other than the suspect or perpetrator, has a bullet wound resulting from the incident, that happen on K-12 school property or on a school bus, and that occur while school is in session or during a school-sponsored event.” This tracker counted 37 incidents in 2023.\n\nEverytown, an activist group that pushes for gun safety, has its own tracker, which includes “every time a firearm discharges a live round inside or into a school building or on or onto a school campus or grounds, as documented by the press.” As of Jan. 12, it counted one incident in 2024– theshooting at Perry High School in Iowa.\n\nWhen the average person reads about the number of school shootings, they’re likely imagining a scenario closer to the one counted by EducationWeek or Everytown, in which people were injured or killed by gunfire at a school. But the K-12 Violence Project tracker is cited far more often in media reports.“Nearly 350 school shooting incidents occurred across the U.S. in 2023, data shows,” according toU.S. News and World Report (Lean Left bias).\n\n“There were 346 incidents in which a gun was brandished or fired at school or a bullet hit school property in 2023, according to the K-12 School Shooting Database. That was the highest of any year in the website's data, which goes back to 1966,”reportedReuters (Center bias).\n\n“With a little less than two weeks remaining in the year, some 340 school shootings had been recorded as of Dec. 20 by the K-12 School Shooting Database,”reportedK-12 Dive (not rated by AllSides).\n\nThese reports mention the Violence Project tracker’s broad criteria, but don’t mention the other data sources.\n\nMore extreme statistics get more clicks — a phenomenon known as media bias bysensationalism. In this case, using more dire numbers could also be a sign ofnegativity bias, in which reporters emphasize bad news — which is where the common adage “if it bleeds, it leads” comes from.\n\nUnfortunately, many modern media business models are built on this. Don’t let that prevent you from seeing the full picture. Read multiple sources and compare coverage to get a broader view and decide for yourself.\n\nHenry A. Brechteris the Editor-in-chief of AllSides. He has a Center bias.\n\nThis blog was reviewed and edited by Director of Marketing and Bias RatingsJulie Mastrine(Lean Right bias), and Director of ResearchAndrew Weinzierl(Lean Left bias).",
        "source_3": "ByJAMES CLARK REYNOLDS, SENIOR FOREIGN NEWS REPORTERandNATASHA ANDERSON, SENIOR US NEWS REPORTER\n\nPublished:16:53 BST, 7 January 2025|Updated:16:56 BST, 7 January 2025\n\nThe number of children killed by guns in America has risen by 85 per cent in the last decade as school shootings rose year-on-year, data shows.\n\nPreliminary tallies by the Gun Violence Archive found 1,419 children and teenagers were killed by guns last year, nearly double the 765 deaths recorded in 2014.\n\nYouth gun deaths reached a 10-year high in 2022 with 1,694 children and teens dying from guns.\n\nThere were at least 83 school shootings in the United States last year, according to aCNNanalysis of events reported by the GVA.\n\nThis reflected a spike of 130 per cent from 2014's figures, and climbed from 2023's tally of 82 events, and 80 the year before.\n\nShootings were defined as incidents on school property with at least one person shot, not including the shooter. The government does not track school shootings.\n\nThe latest figures on school shootings shows a continuation of a rising trend since the pandemic, and stands in stark contrast to historical data.\n\nBy the same definition of a shooting, there were 18, 22, 13, 15 and 13 attacks in schools in the years 2008 through 2012, inclusive.\n\nWashingtonDChas seen the highest rate of shootings since 2008, with six in total or one per 100,000 people.\n\nTallies only surpassed 30 per year in 2014 and have broadly continued along a rising trend.\n\nThe Gun Violence Archive separately brought together comparative data on the number of children killed by guns in the US.\n\nA total of 1,419 young people were killed by gun violence last year alone, up 85 per cent from the 765 recorded in 2014. The data is still subject to change.\n\nAs many as 248 children aged 0-11 were killed by gun violence, while 547 were injured.\n\nPolice lead students after the shooting at Abundant Life Christian School in Madison\n\nWisconsin Christian school shooter Natalie Samantha Rupnow has been pictured after she killed a fellow student and a teacher at Abundant Life Christian School in Madison\n\nWorshipers at Blackhawk Church gather to pray for victims and survivors of a shooting at Madison's Abundant Life Christian School, in Middleton, Wisconsin, U.S. December 16, 2024\n\nPeople are seen at a reunification center after a shooting at Abundant Life Christian School in Madison, on December 16\n\nJeff Rupnow shared a picture of one of his daughters being encouraged to handle and fire guns by her father. Mr Rupnow in August shared a photograph (above) on Facebook at a local shooting range\n\nSome 1,171 teenagers, defined as being 12-17 by theGVA, were killed by gun violence last year. 3,238 were injured, according to the data.\n\nComparative data from 2014 only counted the number of children killed or injured; 580 children, 0-11, were killed or injured in 2014.\n\nThe total for 2024 was 37 per cent higher than in 2014.\n\nIn 2014, the GVA recorded that 2,292 teens, 12-17, were killed or injured by gun violence. The total for 2024 was 96 per cent higher.\n\nThe population of the US climbed 8.5 per cent between 2014 and 2024, from 318.4mn to 345.4mn.\n\nLast year, there were 40,873 total deaths by gun violence across the country, falling five per cent from 43,334 in 2023 but much higher than the 29,596 recorded in 2014.\n\nMore recent data distinguishes between homicide, murder, unintentional or DGU deaths and suicides.\n\nLast year, suicides accounted for 24,156 of the total recorded deaths. This was a slight rise from 2023, but a fall from the 27,038 recorded in 2022 - a post-Covid high.\n\nGeorgia high school shooting suspect Colt Gray, 14, is accused of shooting dead two students and two teachers at Apalachee High School in WInder, near Atlanta. He pleaded not guilty\n\nFamilies and students stop by to pay their respects to the lives lost in the tragedy\n\nTeacher Richard Aspinwall was named as one of the four victims of the shooting. Christina Irimie was also identified as a victim\n\nHundreds of young people in the US have died in shootings over the past decade, but the carnage perhaps hits hardest when it happens in schools.\n\nNatalie Rupnow, 15, killed another teenager and a teacher inside her nondenominational Christian school in Madison, Wisconsin - just a week before the start of its Christmas break.\n\nShe also wounded six others and died by a self-inflicted gunshot wound.\n\nPolice have not disclosed a motive in the December 16 attack at Abundant Life Christian School.\n\nIn September last year, 14-year-old Colt Gray opened fire inside Apalachee High School in Winder, Georgia with an assault-style rifle, killing two other 14-year-old students and two teachers.\n\nStudents scrambled for shelter in classrooms - and eventually fled to the football stadium - as officers swarmed the campus.\n\nGray surrendered and has been charged with murder. His father Colin Gray, who is accused of knowingly allowing his son to have the weapon, has also been charged with murder.\n\nPerry High School student Dylan Butler, 17, opened fire on students and staff at his school in Perry, Iowa just before the start of classes on the first day after winter break.\n\nMason Schermerhorn, 14, an autistic student at Apalachee High School, was the first victim to be identified. Christian Angulo, 14, also lost his life in the senseless shooting\n\nA huge police presence descended on Apalachee High School in Winder, Georgia on Wednesday after officials said the student opened fire, injuring nine and killing four\n\nHe killed a sixth-grader and wounded the school principal, who risked his life to save students and later died of his injuries. Four others were injured.\n\nButler - who had arrived at school with a shotgun, revolver, knife and homemade explosive device concealed on him - took his own life with a single gunshot minutes after shooting at others.\n\nEvidence gathered by investigators suggested Butler showed signs of an obsession with violence and school shootings at least a year prior and had begun planning the shooting six or more weeks beforehand.\n\nSeparately collected data byEducation Week, which also tracks school shootings, recorded 39 incidents that resulted in injuries and deaths last year.\n\nThe record-high for school shootings that resulted in injuries and deaths was in 2022, at 51 reported in a year.\n\nThere were 38 in 2023, 35 in 2021, 10 in 2020, and 24 each in 2019 and 2018, according to their definition.\n\nThey define a shooting as an incident in which a firearm was discharged, any individual other than the suspect/perpetrator has a bullet wound from the incident, the incident happened on school property or a school bus, and that occurred while school was in session or at a school-sponsored event.\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nBy posting your comment you agree to ourhouse rules.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with ourPrivacy Policy."
    }
}