{
    "question": "How might the Supreme Court’s decision upholding Tennessee’s ban on gender transition treatments for minors influence future state laws, medical guidelines, and court challenges related to transgender healthcare?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nHow Supreme Court upholding ban on gender-affirming care for kids impacts transgender rights\n\nThe Supreme Court upheld Tennessee’s ban on gender-affirming care for transgender minors, a jolting setback to transgender rights. Advocates and parents from across the country reacted. (AP video: Laura Bargfeld, Kristin Hall, Daniel Kozin)\n\nChief Justice of the U.S. Supreme Court John Roberts speaks during a lecture to the Georgetown Law School graduating class of 2025, in Washington, May 12, 2025. (AP Photo/Manuel Balce Ceneta, File)\n\nPresident Donald Trump signs an executive order barring transgender female athletes from competing in women’s or girls’ sporting events, in the East Room of the White House, in Washington, Feb. 5, 2025. (AP Photo/Alex Brandon, FIle)\n\nSupreme Court Associate Justice Sonia Sotomayor participates in a fireside chat in Miami, Feb. 11, 2025. (AP Photo/Lynne Sladky, File)\n\nTransgender rights supporters rally at the Lutheran Church of the Reformation on Capitol Hill, Wednesday, June 18, 2025, in Washington after the Supreme Court upheld Tennessee’s ban on gender-affirming care for transgender minors, in a setback to transgender rights. (AP Photo/Jose Luis Magana)\n\nChase Strangio, co-director of the ACLU’s LGBT & HIV Project, speaks during the transgender rights rally on the National Mall, Saturday, May 17, 2025, in Washington. (AP Photo/Jose Luis Magana)\n\nPeople gather outside the Supreme Court in Washington, Oct. 8, 2019. (AP Photo/Susan Walsh, File)\n\nWASHINGTON (AP) —The Supreme Courton Wednesday upheld Tennessee’s ban on gender-affirming care fortransgender minors, a jolting setback to transgender rights.\n\nThe justices’ 6-3 decision in a case from Tennessee effectively protects from legal challenges many efforts by President Donald Trump’s Republican administration and state governments to roll back protections for transgender people. Another 26 states have laws similar to Tennessee’s.\n\nChief Justice John Robertswrote for a conservative majority that the law banning puberty blockers and hormone treatments for trans minors doesn’t violate the Constitution’s equal protection clause, which requires the government to treat similarly situated people the same.\n\nChief Justice of the U.S. Supreme Court John Roberts speaks during a lecture to the Georgetown Law School graduating class, in Washington, May 12, 2025. (AP Photo/Manuel Balce Ceneta, File)\n\n“This case carries with it the weight of fierce scientific and policy debates about the safety, efficacy, and propriety of medical treatments in an evolving field. The voices in these debates raise sincere concerns; the implications for all are profound,” Roberts wrote. “The Equal Protection Clause does not resolve these disagreements. Nor does it afford us license to decide them as we see best.”\n\nIn a dissent for the court’s three liberal justices that she summarized aloud in the courtroom,Justice Sonia Sotomayorwrote, “By retreating from meaningful judicial review exactly where it matters most, the court abandons transgender children and their families to political whims. In sadness, I dissent.”\n\nThe law also limits parents’ decision-making ability for their children’s health care, she wrote.\n\nSupreme Court Associate Justice Sonia Sotomayor participates in a fireside chat in Miami, Feb. 11, 2025. (AP Photo/Lynne Sladky, File)\n\nThe decision comes amid other federal and state efforts toregulate the lives of transgender people, including whichsports competitionsthey can join and whichbathrooms they can use. In April, Trump’s administrationsued Mainefor not complying with the government’s push to bantransgender athletesin girls sports.\n\nThe Republican president also has sought to block federal spending on gender-affirming medical care for those under age 19 — insteadpromoting talk therapyonly to treat young transgender people. And the Supreme Court has allowed him to kicktransgender service membersout of the military, even as court fights continue. The president signed another order todefine the sexesas only male and female.\n\nThe debate even spilled into Congress when Delaware elected DemocratSarah McBrideas the first transgender member of the House. Her election prompted immediate opposition among Republicans, including House Speaker Mike Johnson of Louisiana and Rep. Nancy Mace of South Carolina, overwhich bathroom McBride could use.\n\nSeveral states where gender-affirming care remains in place have adopted laws or state executive orders seeking to protect it. But since Trump’s executive order, some providers have ceased some treatments. For instance, Penn Medicine in Philadelphia announced last month it wouldn’t provide surgeries for patients under 19.\n\nThe president of the American Academy of Pediatrics, Dr. Susan Kressly, said the organization is “unwavering” in its support of gender-affirming care and “stands with pediatricians and families making health care decisions together and free from political interference.”\n\nPeople gather outside the Supreme Court in Washington, Oct. 8, 2019. (AP Photo/Susan Walsh, File)\n\nFive years ago,the Supreme Court ruledLGBTQ people are protected by a landmark federal civil rights law that prohibits sex discrimination in the workplace. That decision is unaffected by Wednesday’s ruling.\n\nBut the justices declined to apply the same sort of analysis the court used in 2020 when it found “sex plays an unmistakable role” in employers’ decisions to punish transgender people for traits and behavior they otherwise tolerate. Roberts joined that opinion written by Justice Neil Gorsuch, who was part of Wednesday’s majority.\n\nJustice Amy Coney Barrett also fully joined the majority but wrote separately to emphasize that laws classifying people based on transgender status should not receive any special review by courts. Barrett, also writing for justice Clarence Thomas, wrote that “courts must give legislatures flexibility to make policy in this area.”\n\nChase Strangio, the American Civil Liberties Union lawyer who argued the case for transgender minors and their families, called the ruling “a devastating loss for transgender people, our families, and everyone who cares about the Constitution.”\n\nChase Strangio, co-director of the ACLU’s LGBT & HIV Project, speaks during the transgender rights rally on the National Mall, Saturday, May 17, 2025, in Washington. (AP Photo/Jose Luis Magana)\n\nMo Jenkins, a 26-year-old trans woman who began taking hormone therapy at 16, said she was disheartened but not surprised by the ruling. “Trans people are not going to disappear,” said Jenkins, a Texas native and legislative staffer at the state capitol in Austin. Texas outlawed puberty blockers and hormone treatment for minors in 2023.\n\nTennessee’s leading Republican elected officials all praised the outcome. Attorney GeneralJonathan Skrmettion social media called the ruling a “Landmark VICTORY for Tennessee at SCOTUS in defense of America’s children!”\n\nThere are about 300,000 people between the ages of 13 and 17 and 1.3 million adults who identify as transgender in the U.S., according to the Williams Institute, a think tank at the UCLA School of Law that researches sexual orientation and gender identity demographics.\n\nWhen the case was argued in December, then-President Joe Biden’s Democratic administration and families of transgender adolescents called on the high court to strike down the Tennessee ban as unlawful sex discrimination and to protect the constitutional rights of vulnerable Americans.\n\nThey argued the law violates the equal protection clause of the 14th Amendment in part because the same treatments that the law prohibits for transgender minors can be used for other purposes.\n\nSoon after Trump took office, the Justice Department told the court its position had changed.\n\nPresident Donald Trump signs an executive order barring transgender female athletes from competing in women’s or girls’ sporting events, in the East Room of the White House, in Washington, Feb. 5, 2025. (AP Photo/Alex Brandon, FIle)\n\nA major issue in the case was the appropriate level of scrutiny courts should apply to such laws.\n\nThe lowest level is known as rational basis review, and almost every law looked at that way is upheld. Indeed, the federal appeals court in Cincinnati that allowed the Tennessee law to be enforced held that lawmakers acted rationally to regulate medical procedures.\n\nThe appeals court reversed a trial court that employed a higher level of review, heightened scrutiny, which applies in cases of sex discrimination. Under this more searching examination, the state must identify an important objective and show the law helps accomplish it.\n\nRoberts’ 24-page majority opinion was devoted almost entirely to explaining why the Tennessee law, called SB1, should be evaluated under the lower standard of review. The law’s restrictions on treating minors for gender dysphoria turn on age and medical use, not sex, Roberts wrote.\n\nDoctors may prescribe puberty blockers and hormone therapy to minors of any sex to treat some disorders, but not those relating to transgender status, he wrote.\n\nBut in her courtroom statement, Sotomayor asserted that similar arguments were made to defend the Virginia law prohibiting interracial marriage that the Supreme Court struck down in 1967.\n\n“A ban on interracial marriage could be described in the same way as the majority described SB1,” she said.\n\nAssociated Press writers Geoff Mulvihill, in Cherry Hill, N.J., and Nadia Lathan in Austin, Texas, contributed to this report.\n\nFollow the AP’s coverage of the U.S. Supreme Court athttps://apnews.com/hub/us-supreme-court.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "A divided Supreme Court on Wednesday upheld a Tennessee law that restricts access to gender-affirming care for minors, in a ruling that shifts the contentious policy debates about transgender rights to the hands of lawmakers.\n\nThe 6-3decision, written by Chief Justice John G. Roberts Jr., found that states can regulate or even ban gender-affirming treatment as part of their powers over medical care without running afoul of the Equal Protection Clause in the 14th Amendment to the Constitution.\n\nRoberts wrote that there are “fierce scientific and policy debates” about the safety, efficacy and proper use of medical treatments for gender-affirming care, which have been debated by both proponents and detractors.\n\n“The Equal Protection Clause does not resolve those disagreements. Nor does it afford us license to decide them as we see best,” the majority opinion said.\n\nThe role of the courts is not to judge the wisdom, fairness or logic of a policy, only to ensure that it doesn’t violate the 14th Amendment, Roberts wrote. “Having concluded it does not, we leave questions regarding its policy to the people, their elected representatives, and the democratic process,” he wrote.\n\nThe decision upholds a Tennessee law that bans puberty blockers, hormone therapy and surgery for minors for the purpose of medically transitioning their gender. It was one of a “growing number of states” that limited gender-affirming care for minors, the ruling states.\n\nThe majority found that Tennessee did not violate the 14th Amendment because the law restricted access to puberty blockers and other hormones based on different medical diagnoses, rather than by sex.\n\nThe state law also “clearly meets” a legal standard that lawmakers had reasons to do so, including risks such as irreversible sterility and adverse psychological consequences, Roberts wrote.\n\nThe law is similar to those in about two dozen states banning access to gender-affirming care for minors, and comes to the court as Republicans nationwide, including in Congress, have said they intend to impose more restrictions on the care.\n\nSen. Bill Hagerty, R-Tenn., praised the decision in a social media post Thursday as upholding the state law to “protect our children from life-altering transgender treatments.”\n\nThe dissenting justices and outside groups said the decision opens the door to further discrimination against transgender Americans.\n\nFamilies and doctors of transgender children, as well as the Biden administration, challenged the law, arguing that it violates the 14th Amendment because it prohibits access to those medicines based on gender transition but not for other conditions, such as precocious puberty.\n\nThe state law allows minors to receive the same drugs for other purposes, such as precocious puberty or to deal with cancer diagnoses, according to court filings.\n\nThe Supreme Court decision states that because the law’s restrictions hinged on differing medical diagnoses, it did not classify based on sex, which would have triggered higher scrutiny under the 14th Amendment.\n\nUnder the law, “no minor may be administered puberty blockers or hormones to treat gender dysphoria, gender identity disorder, or gender incongruence; minors of any sex may be administered puberty blockers or hormones for any other purposes,” Roberts wrote.\n\nJustice Clarence Thomas wrote a separate concurring opinion that criticized the Biden administration and families’ appeals to medical expertise. “When legislation does not cross constitutional lines, States must have leeway to effect the judgment of their citizens — no matter whether experts disagree,” Thomas wrote.\n\nThomas compared agreement with experts on gender-affirming care to the early 20th century eugenics movement.\n\nJustice Sonia Sotomayor wrote a dissent, joined by Justice Ketanji Brown Jackson and in part by Justice Elena Kagan, that argued the majority was “retreating” from an important constitutional duty to protect vulnerable individuals and opening the door to further widespread discrimination.\n\nThe majority opinion “invites legislatures to engage in discrimination by hiding blatant sex classifications in plain sight” and “authorizes, without second thought, untold harm to transgender children and the parents who love them,” Sotomayor wrote.\n\nSotomayor said the majority had endorsed logic similar to Virginia’s defense of interracial marriage laws through appeals to the “science” on the risks of interracial marriage.\n\nThursday’s ruling will likely fuel the Trump administration’s push to roll back protections for transgender Americans and undercut a 2020 Supreme Court ruling which held that employers could not discriminate against transgender employees under Title VII of the Civil Rights Act.\n\nSotomayor herself pointed to actions by the Trump administration in her opinion, such as banning transgender servicemembers from the military.\n\nRepublicans are poised to push forward nationwide bans on gender-affirming care. The budget reconciliation bill the the House passed last month includes a ban on the use of federal dollars for all transition care previously covered by Medicaid.\n\nChase Strangio, co-director of the ACLU’s LGBTQ & HIV Project, who argued the case on behalf of Tennessee families, in a statement called the decision “a devastating loss” for transgender individuals and families nationwide in a statement Thursday.\n\n“We are as determined as ever to fight for the dignity and equality of every transgender person and we will continue to do so with defiant strength, a restless resolve, and a lasting commitment to our families, our communities, and the freedom we all deserve,” Strangio said.\n\nStrangio also pointed out that the decision didn’t explicitly touch on prior decisions holding that certain actions against transgender individuals could be considered discrimination.\n\nThis report was corrected to reflect that the Supreme Court decision was issued on June 18.",
        "source_3": "“The Court’s role is not ‘to judge the wisdom, fairness, or logic’ of SB1 … but only to ensure that the law does not violate equal protection guarantees. It does not.”\n\nOn Wednesday, the U.S. Supreme Courtdeterminedthat a Tennessee law prohibiting harmful transgender procedures on minors is constitutional.\n\n“The Court’s role is not ‘to judge the wisdom, fairness, or logic’ of SB1 … but only to ensure that the law does not violate equal protection guarantees. It does not. Questions regarding the law’s policy are thus appropriately left to the people, their elected representatives, and the democratic process,” the Court ruled.\n\nThe final vote came along ideological lines, with the six Republican appointees voting to uphold the law and the three Democrat appointees siding against the Volunteer State. Chief Justice John Roberts authored the majority opinion.\n\nKnown asUnited States v. Skrmetti, the case centers around a 2023lawsuitfiled by the left-wing American Civil Liberties Union against Tennessee. Joined by the Biden Justice Department, the left-wing groupclaimedthat a law passed by the Volunteer State (andKentucky) prohibiting health care providers from conductingharmful“trans” procedures on minors violated the 14th Amendment’s equal protection clause. (The Trump DOJ recentlywithdrewthe challenge).\n\nWhile a district court judgepartially blockedthe law’s enforcement in June 2023, the 6th Circuit Court of Appealsupheldthe statute later that year.\n\nWriting for the majority, Roberts noted how the Court found that the Tennessee statute “does not classify on any bases that warrant heightened review” under the 14th Amendment’sequal protection clause.\n\n“The plaintiffs argue that SB1 warrants heightened scrutiny because it relies on sex-based classifications. We disagree,” Roberts wrote. “Neither of the above classifications [age and medical use] turns on sex. Rather, SB1 prohibits healthcare providers from administering puberty blockers and hormones tominorsfor certainmedical uses, regardless of a minor’s sex.”\n\nThe chief justice continued, “This case carries with it the weight of fierce scientific and policy debates about the safety, efficacy, and propriety of medical treatments in an evolving field. The voices in these debates raise sincere concerns; the implications for all are profound. The Equal Protection Clause does not resolve these disagreements. Nor does it afford us license to decide them as we see best.”\n\nIn addition to signing onto the majority opinion, Associate Justice Clarence Thomas authored a concurring opinion “to address some additional arguments made in defense of Tennessee’s law.”\n\nThe high court’s most senior justice notably referenced the case’s discussion ofBostock v. Clayton County. That 2019 SCOTUS decision unilaterally declared that so-called “gender identity” is covered under the Civil Rights Act’sTitle VIIprotections.\n\nReferencing Associate Justice Samuel Alito’s dissent inBostock, Thomas noted that “[w]hile [he] continue[s] to think that theBostockmajority’s logic ‘fails on its own terms,’ [he] see[s] in any event no reason to importBostock’s Title VII analysis into the Equal Protection Clause.”\n\n“TheBostockCourt recognized that ‘other federal . . . laws that prohibit sex discrimination’ were not before it, … and thus rested its analysis on what it took to be the ordinary meaning of the relevant statutory terms — “‘because of,’” “‘otherwise . . . discriminate against,’” and ‘individual’ — within the context of Title VII … The Equal Protection Clause includes none of this language,” Thomas wrote. “Extending theBostockframework here would depart dramatically from this Court’s Equal Protection Clause jurisprudence. … While the majority concludes that SB1 does not discriminate based on sex even underBostock’s incorrect reasoning … I would make clear that, in constitutional challenges, courts need not engageBostockat all.”\n\nAssociate Justice Amy Coney Barrett authored a separate concurring opinion, in which Thomas joined. The Trump appointee noted that while SCOTUS’s ruling “does not resolve whether transgender status constitutes a suspect class,” “in [her] view, it does not.”\n\nMeanwhile, Associate Justice Sonia Sotomayor authored a dissenting opinion, which Associate Justices Elena Kagan and Ketanji Brown Jackson joined in part and in full, respectively.\n\nThe Democrat appointees claimed that “the Constitution and settled precedent require the Court to subject [the Tennessee law] to intermediate scrutiny.” They further accused the majority of “contort[ing] logic and precedent to say otherwise, inexplicably declaring it must uphold Tennessee’s categorical ban” on what they argue is “lifesaving medical treatment so long as “‘any reasonably conceivable state of facts’” might justify it.”\n\n“By retreating from meaningful judicial review exactly where it matters most, the Court abandons transgender children and their families to political whims. In sadness, I dissent,” Sotomayor wrote.\n\n© 2025 The Federalist, A wholly independent division of FDRLST Media. All rights reserved."
    }
}