{
    "question": "How are rapid advances in AI and current economic headwinds shaping entry-level opportunities for recent college graduates, and what are the potential longer-term implications for their careers, debt burdens, and the broader labor market?",
    "content": {
        "source_1": "The Class of 2025 faces a daunting assignment:getting hired in today’s no-hire, no-fire jobs market.\n\nOverall, the US job market remains resilient. The national unemployment rate stands at just 4.2% and the economy hasadded jobs 52 months in a row– the second longest streak of uninterrupted job growth in US history.\n\nYet there are some cautionary signs beneath the hood.\n\nBusiness decision-making has beenparalyzed by the chaotic trade war.Entry-level hiringis down. And some leaders of the artificial intelligence industry say that the fast-moving technology could wipe out white-collar jobs, if it’s not already starting to do that.\n\nBut even as the overall labor marketlooks relatively healthy, economists say this is the worst market for new college graduates since the height of the Covid-19 pandemic. Recent grads are finding that it takes considerable time to get hired, leaving them unemployed and saddled with student debt for a frustratingly long time.\n\n﻿For the first time since record-keeping on the topic began in 1980, the unemployment rate for recent graduates (those 22 to 27 years old with a bachelor’s degree or higher) is consistently higher than the national unemployment rate, according to Oxford Economics.\n\n“It’s a very difficult jobs market for college graduates, and it will take time to work out of this,” said Matthew Martin, senior US economist at Oxford Economics.\n\nSince mid-2023, the unemployment rate for recent college graduates has climbed by 1.6 percentage points – triple the national increase, according to Oxford Economics.\n\nThe unemployment rate for those aged 20 to 24 is nearly twice as high as the national average at 8.2%, according to the Bureau of Labor Statistics. This picture is more concerning for young men, who grapple with an unemployment rate of 9.6% compared to 6.7% a year ago.\n\nRelated articleDegree in hand, jobs out of reach: Why recent grads are struggling in a competitive market\n\nAfter scrambling in 2021 and 2022 to hire workers, businesses are taking a much more cautious approach today as they navigate the murky trade war and grapple with high interest rates.\n\nThe number of people collecting unemployment checks climbed in mid-May to a fresh four-year high, the Labor Department said Thursday. That’s a signal it’s taking longer for people hunting for work to find a job.\n\nEntry-level hiring is down 23% compared to March 2020, exceeding the 18% decline in overall hiring over the same period,according to professional networking platform LinkedIn.\n\n“’No hire/no fire’ is a difficult state of play for workers looking for a new job, but it is supportive of lower inflation, higher productivity and persistent economic growth in the long-run,” Thomas Simons, chief US economist at Jefferies.\n\nJenna Macksoud aggressively hunted for her first job after graduating from American University in late 2023. For more than a year, the 23-year-old from New Jersey applied to many jobs – often five to 10 positions per day. But she struggled to even hear back from prospective employers.\n\n“Looking back on it, it was definitely traumatic. It started to weigh heavily on me,” Macksoud told CNN in a phone interview. “It felt hopeless.”\n\nThe lengthy job search often takes a toll on new graduates.Worker confidence among Gen Zers in the United States recently tumbled to record lows, even lower than at the onset of the Covid-19 pandemic, according to LinkedIn.\n\nFor Macksoud, the pressure was only amplified by the fact that, like many college graduates, she had a pile of student debt totaling about $70,000.\n\nAfter running into a dead end with government and NGO-based jobs, she eventually widened her search and landed a job working in business development for an IT and cybersecurity company.\n\nMacksoud urged today’s graduates not to get disheartened by rejection.\n\n“It’s a numbers game. You have to change the mindset from being discouraged that you’re not getting anywhere, to attacking it and being persistent,” she said.\n\nFinding a job could be even harder with the lightning-fast advancements made by next-generation AI models.\n\nDario Amodei, the CEO of AI giant Anthropic, warnedthat AI could wipe outhalf of all entry-level white collar jobs and lift unemployment to 10% to 20% within the next one to five years.\n\nAmodei told CNN’s Anderson Cooperlast week that it’s “eerie” how much the public and lawmakers are unaware of what’s happening with AI advancements in the workforce.\n\n“We have to act now. We can’t just sleepwalk into it,” the Anthropic CEO said.\n\nRelated article10% of US workers are in jobs most exposed to artificial intelligence, White House says\n\nThis entry-level job destruction may already be happening, at least in some corners of the labor market.\n\nFor instance, Oxford Economics notes that employment in computer science and mathematics – two industries that are particularly vulnerable to AI disruption – has declined by 8% since 2022 for those aged 22 to 27. By contrast, the employment rate for those older than 27 in these industries has not changed much.\n\n“AI is definitely displacing some of these lower-level jobs,” said Martin, the Oxford Economics economist. He added that he expects that AI willboth kill and create some jobs, especially in the tech sector.\n\nOthers argue that the AI employment fears are overdone.\n\n“We don’t see any evidence that this (slow hiring for entry-level jobs) is being driven by AI,” Kory Kantenga, head of economics at LinkedIn, told CNN in a phone interview.\n\nKantenga noted that there have been dire predictions about technology killing jobs.\n\n“When ATMs were introduced, there was a fear that bank tellers would be completely wiped out. But the reality is they evolved and adapted,” he said.\n\nThe challenging jobs market for college graduates comes amid a broader debate over the value of a college degree, which can cost hundreds of thousands of dollars and leave students saddled with overwhelming debt.\n\nThe unemployment rate for young workers (ages 22 to 27) with a bachelor’s degree or more is lower than it is for those without one, though that gap has narrowed in recent years, according to federal data.\n\nKantenga said that while the cost of a four-year degree has gone up, many Americans decide it’s still worth it because the earnings potential is higher and the unemployment rate is lower.\n\n“At the end of the day, the rewards of having a degree still dwarf the costs,” he said.\n\nEconomists say the challenging jobs market, and the risks around AI, put the onus on college students to choose where they focus wisely – for example, faster-growing parts of the workforce such as healthcare and education.\n\n“Know where the momentum is and think about not just your first job, but your next step,” Kantenga said. “If you land a high-paying first job, that’s great, but not if you’ve got nowhere to go afterwards.”\n\nThe challenging jobs market is weighing on parents, too.\n\n“It’s very frustrating,” said Rob Bastress, whose son graduated from University of California Irvine in December 2023 but has since struggled to find a job. “You’re pressuring your kids to get good grades, get into a good school to set them up for the right opportunities when they get out. And now those opportunities have kind of vanished.”\n\nBastress, who lives in the San Francisco Bay Area and works in tech, believes AI is part of the problem.\n\n“I do think some jobs have been eliminated because of the automation that AI can do. And it’s going to get tougher,” Bastress said, noting thatsomenewer AI models won’t even require human prompting to do tasks and make decisions.\n\nGabriel Nash, a 24-year-old from Orlando, Florida, said he’s applied to about 450 jobs in communications and video editing since graduating from the University of Central Florida in May 2024.\n\nNash works part-time as a content creator by making gaming videos on YouTube. That work has given him enough money to pay for car insurance and other expenses, but not enough to move out from his parents’ home.\n\n“It’s stressful,” Nash said. “There is this social pressure of needing to get out and get a job. But if nobody is hiring, what am I supposed to do?”",
        "source_2": "Our name is about honesty. The Monitor is owned by The First Church of Christ, Scientist, and we’ve always been transparent about that.\n\nThe church publishes the Monitor because it sees good journalism as vital to progress in the world. Since 1908, we’ve aimed “to injure no man, but to bless all mankind,” as our founder, Mary Baker Eddy, put it.\n\nHere, you’ll find award-winning journalism not driven by commercial influences – a news organization that takes seriously its mission to uplift the world by seeking solutions and finding reasons for credible hope.\n\nA deeper view that unites instead of divides, connecting why the story matters to you.\n\nWelcome to your Saturday Daily. For his report today, part of our occasional series on the halting evolution of race relations since the murder of George Floyd by a Minneapolis police officer in 2020, Cameron Pugh went to Sanford, Florida. Teenager Trayvon Martin was killed by a neighborhood watch volunteer there in 2012. I asked Cameron if, on this assignment, he’d found credible evidence of respect and trust, two prerequisites for progress. He had. An activist who had criticisms of the city’s efforts also took time to commend officials by name. And Sanford’s project manager on that April day 13 years ago described an outlook that set a constructive, conciliatory tone.“They were visitors and they were welcome,” Andrew Thomas told Cameron, referring to protesters who poured in. “[W]e didn’t need a confrontation with them. We needed to accommodate them … and that was the approach and strategy.”\n˜Some staff recognition: Cameron joined me last May on a podcast to discuss his reporting on Black women and maternal health, a story that made him a finalist at today’s National Association of Black Journalists awards. (Joining Cameron are 2025 Monitor NABJ award finalists Ira Porter and Ken Makin.)As always, find our latest news updates this weekend at CSMonitor.com.\n\nThe Christian Science Monitor's coverage of the war between Hamas and Israel, and related articles.\n\nA deeper view that unites instead of divides, connecting why the story matters to you.\n\nTyler Johnson was proud to be one of almost 6,500 students graduating from the University of Delaware in May. But what should have been a celebration was marred by his worries about being unemployed. It was incongruous with what he thought the end of four years of college would be.\n\nThe communications major had worked on the student newspaper and done an internship at a local publication the summer before. But no employers were interested in him.\n\n“It kinda took a hit on my self-esteem,” Mr. Johnson says. “It’s like, ‘Did I do enough? Am I actually going to make it?’”\n\nIt’s not the Great Recession, but with tariffs, hiring freezes, and the advent of artificial intelligence, the job market has college graduates wondering where they fit.\n\nMr. Johnson is one of a number of recent college graduates facing a tough job market. Even in the best of times, job hunting takes patience and determination. But 2025 has delivered an especially challenging environment for new grads, with tariffs causing uncertainty, federal government jobs gone or frozen, and more concern about the impact of artificial intelligence on entry-level positions vital to getting a foot on the career ladder.\n\nIn November, employers initially planned to hire 7.3% more people from the class of 2025 than they had from the previous year’s class. But by April, that number had adjusted to a 0.6% increase,according tothe National Association of Colleges and Employers. Additionally, 11% of employers said that they plan to reduce hiring overall. Typically, college grads fare better than average – particularly in a downturn. That is not the case for the class of 2025. New grads have about a 6% unemployment rate, compared with 4.2% overall. It’s the first time that’s been the casesince 1980, according toOxford Economics.\n\n“It’s a dip, but not a collapse,” says Allison Danielsen, CEO of Tallo, a digital career guidance organization that connects graduates to companies. “We’ve seen similar slowdowns before, especially during economic uncertainty or major shifts like automation.”\n\nThe rise of generative artificial intelligence, she adds, is just such a major shift.\n\nThe timing is concerning, she says, because many recent college graduates made decisions about their education in a different job market. Now, they are entering a workforce that is changed. It has caused a mismatch that has made it harder for new graduates to land on their feet.\n\nIn a recent Tallosurveyof more than 2,000 people ages 18 to 30, 62% of respondents said that they were not working in a field that they intended to. Cost-of-living expenses and student loan debt ranked as two top reasons. Additionally, the same survey found that 1 in 4 said that they couldn’t find a job in their intended field.\n\n“The labor market is changing faster than higher education can keep up. That’s why we’re seeing such a big gap between what students study and what employers actually need,” Ms. Danielsen says. “Relying on a degree as a stand-in for skills just doesn’t work anymore.”\n\nAccording to the Federal Reserve Bank of New York, theunemploymentrate for recent college graduates increased to 5.8% in the first quarter of 2025, the highest it has been since 2021. Additionally, the underemployment rate, which is the percentage of college graduates working in a field that does not require a college degree, rose to 41.2%.\n\nMs. Danielsen, some economists, and those who help students at universities collectively agree that the job market is evolving and that changes in federal policy are tough for young people transitioning from school to full-time work. Observers also agree that white-collar entry-level jobs, which were previously stepping stones for new grads, are being automated by AI.\n\nThat would seem to fall in line with what Dario Amodei, CEO of AI startup Anthropic, predicted in a recent Axiosinterview. Mr. Amodei said he thinks AI will wipe out half of entry-level jobs, potentially pushing the unemployment rate to 10% to 20% in the next five years.\n\n“We, as the producers of this technology, have a duty and an obligation to be honest about what is coming,” he told the publication.\n\nIn Maryland, graduates at the state’s flagship university in College Park are finding regional and local work uncertainty, says Allynn Powell, director of the University Career Center. She spends the year helping students find internships and preparing for work postcollege.\n\n“I think they are aware and kind of walking into the world of work, being mindful that ... so many of the kinds of stabilities that they thought might exist just aren’t there right now,” she says of students she’s encountered. Ms. Powell says that this is a perfect time for new graduates to lean into the skills and experiences that they gained as students to help them pivot. This could be temporarily switching career goals, she says.\n\nHer office offers students a blueprint for ways to enter the job market, such as creating a robust online presence on sites like LinkedIn, learning how to tell a story that highlights their strengths, making sure that they are geographically flexible, tailoring their résumé to specific jobs, and leaning on their network of friends, mentors, and family.\n\n“If nothing else, what we hope they spend these four years doing ... is learning how to fail forward and then pick themselves up and try it again a different way,” Ms. Powell says.\n\nShe believes that the sooner a student connects with the career center, even during their freshman year, the better off they will be after having internships and other experiences.\n\nInstead of a new job in a new city with a new place to live, Mr. Johnson moved back home to Clayton, a town in central Delaware, home to fewer than 4,000 people. His roommates will be his mother and younger brother. Currently, he has no car and very little money.\n\n“I’m just trying to remain positive,” Mr. Johnson says. Some of his friends are taking the summer off before looking for work. His mother isn’t pressuring him to find a job immediately, although he’s been looking. His targets right now are fast food, retail, and waiting tables.\n\n“I can’t even say that I just want a summer job. I want a job in general,” he says. “I want to work to have money in my pocket and save so I can make my way to what I want to do.”\n\nMonitor journalism changes lives because we open that too-small box that most people think they live in. We believe news can and should expand a sense of identity and possibility beyond narrow conventional expectations.",
        "source_3": "'Making Money' host Charles Payne breaks down the better-than-expected May jobs report.\n\nRecent college graduatesare aggressively hunting for their first job, but they are facing one significant problem: the labor market is deteriorating.\n\nEconomic research from the Federal Reserve Bank of New York indicated the labor market \"deteriorated noticeably\" in the first quarter of 2025, with those just entering the workforce taking the hardest hits.\n\nThe Labor Department reported that employersadded 139,000 jobsin May while unemployment held steady at 4.2%. The unemployment rate for all college grads was 2.7%, but the rate for those between the ages of 22 and 27 years old jumped to 5.8%, according to the New York Federal Reserve. That's the highest reading since 2021.\n\nUS LAYOFFS SPIKE NEARLY 50% AS DOGE-DRIVEN CUTS TAKE CENTER STAGE\n\nThis uptick in the unemployment rate among recent graduates raises concerns about the strength of the broader labor market, according to researchers at Oxford Economics.\n\nCollege students celebrate during their graduation ceremony.(iStock)\n\n\"While we do expect the impact of tariffs,higher inflation, and weaker demand to lead to reduced business hiring and outright layoffs in the months ahead,\" the researchers said.\n\nUS ECONOMIC GROWTH FORECAST CUT SHARPLY DUE TO HIGHER TARIFFS\n\nThey cited the hiring slowdown in technology along with increasing college graduates in computer science fields as the primary reason for rising unemployment among this age group.\n\nSome normalization after the post-pandemic surge also played a factor. However, researchers said there are \"signs that entry-level positions are being displaced by artificial intelligence at higher rates,\" according to the May report.\n\nResearchers project the unemployment rate for recent college graduates will remain elevated in the near term unless there is a surge in demand from tech companies or a mass exodus from the labor force by these individuals. Those scenarios \"seem unlikely,\" according to the researchers.\n\n\"While these workers only account for around 5% of the workforce, they have played an oversize role in pushing the national unemployment,\" the researchers said in the report.\n\nDr. Nathan Mondragon, chief innovation officer at artificial intelligence and human resources management company Hirevue, said the biggest challenge for job seekers isn't just finding jobs but standing out when applying in the highly competitive market.\n\n\"With a surplus of applicants for every open role, employers are using AI-driven applicant tracking systems to filter candidates before a human even sees a resume,\" Mondragon said.\n\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\n\nBy clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time."
    }
}