{
    "question": "How might reports of clearly identified journalists being injured or detained by law enforcement during the Los Angeles anti-ICE protests influence press freedom and public trust, and what measures should be prioritized to safeguard newsgathering while maintaining public safety?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nAustralian television journalist Lauren Tomasi was hit in the leg by a rubber bullet Sunday while reporting live from downtown Los Angeles.\n\nA person displaying multiple flags walks past a burning car during protests over the Trump administration’s immigration raids in Los Angeles, Monday, June 9, 2025. (AP Photo/Ethan Swope)\n\n▶ Follow live updates onimmigration protests across the U.S.\n\nMore than two dozen journalists have been injured or roughed up while covering protests against immigration raids in Los Angeles, leading press freedom groups to question whether law enforcement has been deliberately targeting reporters on the story.\n\nJournalists have been pelted with rubber bullets or pepper spray, including an Australian TV reporter struck while doing a live shot and a New York Post reporter left with a giant welt on his forehead after taking a direct hit. A CNN crew was briefly detained then released on Monday night.\n\nThe advocacy group Reporters Without Borders said Wednesday there have been at least 35 attacks on journalists — 30 from law enforcement — since the demonstrations started.\n\nThe Committee to Protect Journalists, the First Amendment Coalition and Freedom of the Press Foundation were among the groups to express concern to Secretary of Homeland Security Kristi Noem. In a letter, they said “federal officers appear to have deliberately targeted journalists who were doing nothing more than their job covering the news.”\n\nNoem hasn’t replied, David Loy, legal director of the First Amendment Coalition, said Tuesday. Noem’s assistant secretary, Tricia McLaughlin, said the department reminds journalists to exercise caution.\n\n“We have seen rioters throwing rocks, Molotov cocktails, setting fires and other violent acts,” McLaughlin said. “President Trump and Secretary Noem are committed to restoring law and order in Los Angeles.”\n\n▶ Stay up to date with the latest U.S. news by signing up to our WhatsApp channel.\n\nExperts say the apparent hostility toward journalists, or a disregard for their role and safety, became particularly apparent during demonstrations following thedeath of George Floydin 2020. A troubling indication of a decline in press freedom is the rapid escalation of threats journalists face in the United States, said Bruce Shapiro, executive director of the Dart Center for Journalism and Trauma at Columbia University.\n\nWhile most journalists covering wars receive training and safety equipment, it is apparent that many — particularly freelancers — don’t have similar protection when assigned to events like the Los Angeles demonstrations, he said.\n\n“It’s not like covering a war zone,” Shapiro said. “But there are some very specific skills and strategies that people need to employ. The First Amendment is only as strong as the safety of the journalists covering these events.”\n\nOn Sunday,Australian journalist Lauren Tomasiwas shot in the leg by a rubber bullet while reporting live, with a microphone in her hand, from protests in downtown Los Angeles. Widely circulated video shows her crying out in pain and clutching her lower leg as she and her camera operator quickly move away from a police line. She told 9News later that she was safe and unharmed.\n\nNew York Post photographer Toby Canham was overlooking the 101 freeway when he was hit. He spent Monday in the hospital with whiplash and neck pain, and left with a red mark on his forehead. Shortly before he was shot, he said he saw someone throwing a water bottle with liquid at authorities.\n\n“I completely understand being in the position where you could get injured,” Canham said. “But at the same time, there was no justification for even aiming the rifle at me and pulling the trigger, so I’m a bit pissed off about that, to be honest.”\n\nBen Camacho, a reporter at the local news website The Southlander, reported being shot twice. “Unsure of what hit me both times but they hit like a sledgehammer and without immediate warning,” he wrote online. “Elbow is wrapped with gauze and knee is weak.”\n\nPhotojournalist Nick Stern was standing near some people waving a Mexican flags when he was shot in the thigh. He later had emergency surgery. “I thought it was a live round because of the sheer intensity of the pain,” he told the AP. “Then I passed out from the pain.”\n\nLexis Olivier-Ray of L.A. Taco, an alternative independent media platform, thought he was safely positioned with some television crews but instead had pepper balls shot at him. Some reporters may have taken less care: one posted a clip from film he shot about 10 yards (9.1 meters) from a police officer with a rifle pointed at him.\n\nNot all of the incidents involved law enforcement. AP photographer Jae Hong was kicked and hit with sticks by protesters on Monday, his protective gear enabling him to escape injury. A Los Angeles TV reporter and her crew were forced away by demonstrators, one loudly yelling, “get out of here.”\n\nCNN aired video of its correspondent, Jason Carroll, and his crew with their hands behind their backs being led away from a protest by officers. They were later released.\n\nIn many past conflicts, journalists had a measure of protection because opposing sides wanted them to record their side of the stories, Shapiro said. Now many journalists are seen as superfluous by people who have other ways of delivering their messages, or a target by those who want to spread fear, he said.\n\nIt illustrates the importance of proper training and protection, he said. For reporters in the middle of the story now, they should plan carefully — being aware of exit routes and safe zones, working in tandem with others and in constant communication with their newsrooms.\n\n“We need everyone from major news outlets to television to citizen journalists,” he said. “We need them on the street. But we need them to be safe.”\n\nAP correspondent Jake Offenhartz in Los Angeles contributed to this report. David Bauder writes about the intersection of media and entertainment for the AP. Follow him athttp://x.com/dbauderandhttps://bsky.app/profile/dbauder.bsky.social\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Asprotestsover U.S. immigration enforcement raids began throughout the country last week, journalists rushed to cover therapidly evolvingstory. Focus turned to Los Angeles, California, as President Donald Trumpdeployedthe National Guard and Marines, notably without California Governor Gavin Newsom’s consent.\n\nJournalists on the ground in LA quickly became part of the story as they faced an onslaught of tear gas, pepper spray, rubber bullets, and other forms of“less lethal” munitions.\n\nThe U.S. Press Freedom Tracker, of which CPJ is a founding member, isinvestigatingat least seven detainments or arrests of journalists, over 35 assaults, reports of multiple news vehicles damaged, and other incidents, including tear gassing and harassment. The majority of these attacks were from a mix of both state and federal law enforcement, though some of the vehicles were damaged by members of the crowd.\n\nIn anticipation of further demonstrations, which are planned inhundreds of citiesacross the United States on Saturday, June 14, to protest President Donald Trump’s administration, and to better understand the conditions for the press on the ground, CPJ spoke with four journalists reporting on the protests in LA. Their interviews have been edited for length and clarity.\n\nYou were injured while covering protests on June 7 at theParamount Home Depot, the site where one of the initial immigration raids that spurred the protests occurred. What happened in the lead-up to your injury?\n\nPretty much the whole day, pepper balls were being shot by the sheriffs towards the protesters. I was keeping an eye out for those all day. But they were also throwing stingers, which is like a flashbang. They were definitely being thrown directly at people at some point, which is extremely dangerous. And rubber bullets, of course, were kind of flying as well. Some protesters were throwing their plastic water bottles or maybe fist-sized pieces of concrete. It seemed like most of them just kind of fell short of their target.\n\nI had on a gas mask and half-face, ballistic-rated goggles, and a press pass. Mind you, the National Guard, like the military, had not been deployed yet.\n\nBefore I was shot, I was in an area where people were peacefully protesting. I was keeping an eye on my co-reporter, who was getting video. That’s when I saw a projectile go straight into the area where he was, and that’s when I sawNick Stern[a British photojournalist] get shot.\n\nI ended up going over and helping him get away. As I went back toward the protest area, pain hit me in the kneecap. I started screaming. I had never felt that type of pain before. I started to turn around to try to walk away, and the pain got worse.\n\nSomeone came up to me and helped me walk away. Then I was shot again, this time in my right elbow. It was excruciating at this point. I was yelling at the top of my lungs. I was in such a weird, shocked state of mind.\n\nThe next day, I went to Urgent Care to get checked out. Thankfully, my injuries are just serious, nasty bruises and a nasty cut. I’ve been home since, making sure these minor injuries don’t become worse.\n\nCould you have imagined this happening in Los Angeles?\n\nThe police violence this time around feels much, much higher than any protests in the past few years. I also covered the 2020 uprising [the Black Lives Matter protests] and, yes, there was extreme police violence back then too.\n\nThis time, police action feels a lot more indiscriminate and a lot stronger, and that’s just from [what I experienced with] the Los Angeles authorities.\n\nHow has being a person of color shaped your reporting experience?\n\nI am from these communities that people are being taken from. My hometown, just outside of LA, is also rising up against this. And I have a significant audience on my reporting platforms. And because I’m not out there, that’s a voice lost.\n\nWhile covering protests, you were hit by less lethal munitions fired by law enforcement on June 6, and then by what seemed to have been the Los Angeles Sheriff’s Department on June 7. Could you have expected this in your hometown?\n\nYou know, it’s not my first rodeo. I’ve never seen them [law enforcement in Los Angeles] be careful with the press in the years that I’ve been documenting protests here.  I don’t think I’ve ever experienced them telling the press, “Hey, go on this side, you’ll be safe here,” or them holding back from not attacking.\n\nI think at this point, Los Angeles’ law enforcement feels somewhat empowered because their actions will be backed up by the federal government, if they do something wrong.LA is heavily policed right now — we’ve got sheriffs out; we’ve got CHP [California Highway Patrol] out; cops from other cities are here; we’re going to have theMarinesand theNational Guard. It feels like they can do whatever they want and get away with it.\n\nReporters are on the front lines trying to document the reality of what it is to live in this country. We’re trying to document that people are being arrested and deported without due process. Police officers are brutalizing people who are exercising their First Amendment right to protest and to assemble peacefully.\n\nI haven’t had a chance to really sit back, zoom out, and really let this process. My phone’s been blowing up this whole week with alerts of potential ICE raids, or information about where people are, where they’re getting arrested. I’m just trying to prepare and get ready, and make sure that I’m ready for the next day.\n\nWhat has surprised you most about the nature of the recent protests and the response from law enforcement?\n\nLA is the epicenter of immigration. We have themost undocumented peoplein the entire country — I think just under a million in LA County, a population of 10 million. Immigration is a national issue, and I think we fully expected some sort of reaction once it came to our doorstep. We just didn’t know what that was going to be.\n\nWhat has surprised me the most has been the federal response. I thought, maybe, we would see them as part of ICE operations, but not at the protests in the way that we have.\n\nYou and your news crew were fired on with pellet projectiles by federal agents while covering June 7 protests. Did you ever think this would happen in Los Angeles?\n\nI’ve covered many protests in the 20 years I’ve been here, and we have a very good relationship with LAPD [Los Angeles Police Department] around our coverage of the protests, and what we’re supposed to do and not supposed to do.\n\nI felt going into protest situations last weekend [June 6- 8] that we would be fine. And then when we got shot by federal agents, I think we were all taken aback. I can’t say it was targeted toward me. But what I can say is, most of the protesters had already left. We had large cameras; I had “Press” on my vest. We were all clearly identified.\n\nWhat worries you about the situation in Los Angeles going forward?\n\nI’m concerned that the non-lethal munitions might actually hurt somebody to a degree where they could lose an eye or something else along those lines. That worries me a lot.\n\nTelevision crews have had some of our equipment and trucks attacked or destroyed — without anyone in them — by protesters, but I would say most journalists are concerned about all the agents and what they’re firing.\n\nIn this country, for the most part, journalism and journalists have been respected. It’s part of our constitution — freedom of press. It’s embedded in who we are every day from day one. The government is trying to keep us [journalists] from doing our job. I think it should be a red flag for a lot of people.\n\nYou were hit twice with less-lethal munitions on June 6 and then again on June 7, resulting in aconcussion. Could you have imagined this happening in your home community?\n\nAfter Trump was elected, I was really nervous for what would come in Los Angeles, because I know Los Angeles, and people show up for protests. But I didn’t think that I would be doing a job that would involve federal agents shooting at me.\n\nYes. I was born and raised in Los Angeles, and I have a very deep connection to the city and immigrant rights. I think it is so important to document why people are taking to the streets, and also to document the community that has been forming with all this anger.\n\nIt is an honor to be one of the reporters out there recording the first draft of history. This is history that we’re living through.\n\nWhat do you want people outside of Los Angeles to understand about what’s happening now?\n\nSeemingly, journalists are being targeted. There have been many of us who have been injured in the last several days, at least onceon live TVwith an Australian reporter. There are so many of us who have been injured by federal agents, by local law enforcement, and it’s all unacceptable. Every single agency that has been involved in harming journalists should be condemned and should be investigated, I believe.\n\nOther journalists should get ready to get ready because I feel like Los Angeles is just the first place where this kind of violence against journalists, or similar things, might happen. This is only the beginning.",
        "source_3": "Harrowing footage captured the moment California police shot a New York Post photographer in the head with a rubber bullet duringLos Angeles’ violent protestSunday evening.\n\nToby Canham, who was on assignment for The Post and standing just off the 101 Freeway at an elevated level, was filming video of thechaos between cops and rioterswhen a California Highway Patrol (CHP) officer suddenly turned his weapon toward him and fired from about 100 yards away.\n\nCanham, 59, who was wearing his press pass, was struck in the forehead and quickly fell to the ground, according to the disturbing footage he captured.\n\n“F–k, f–k, I just got shot in the head!” the dad of two can be heard screaming from behind the camera.\n\nThe veteran photographer, who served in the British Army and is based out of LA, spent Monday at the hospital for whiplash and neck pain. He was left with a giant bruise on his forehead.\n\n“When I got whacked, to my best recollection it was just me filming with my cameras on and then I got shot,” said Canham.\n\n“Where I was hit, I was the only person overlooking the freeway. I wasn’t surrounded so I was an easy target.”\n\nBefore he was hit with the rubber bullet, a flashbang initially exploded a few feet from him, causing shrapnel to kick up and leave two holes in his pants.\n\nHe then saw someone to his left throw a water bottle filled with a liquid at authorities and then retreat, which led him to start recording with his camera 20 seconds before he was struck.\n\nCanham was injured by authorities the same day anAustralian news reporter was shotwith a rubber bullet while reporting live from the scene.\n\nLaw enforcement has clashed with violent protesters over the last few days of unrest in response to actions taken by Immigration and Customs Enforcement against illegal migrants in the city.\n\nThousands of anti-ICE protesters tookover the major highway in downtown Los Angelesas rioters lit self-driving cars on fire Sunday in a surreal scene.\n\nWhile traffic was blocked on both sides of the freeway, the crowd was eventually forced onto an exit ramp by CHP.\n\nWhile Canham was taking photos, protesters could be seen standing on the sides of the elevated platform next to the freeway while law enforcement was still on the highway and sheltered under an overpass.\n\nRioters have thrown various items, including water bottles and rocks, at law enforcement, since the violence erupted.\n\n“It’s a real shame. I completely understand being in the position where you could get injured, but at the same time, there was no justification for even aiming the rifle at me and pulling the trigger, so I’m a bit pissed off about that, to be honest,” Canham said, noting he could have lost an eye or some teeth.\n\nCHP did not immediately return an email seeking comment. LAPD said, “There is no comment, the incident needs to be investigated.”\n\nGov. Gavin Newsom’s officealso declined comment on the violence against a journalist and referred The Post to law enforcement on the ground. The Los Angeles mayor’s office did not immediately return an email seeking comment.\n\nThe turmoil has become so volatile that US Defense Secretary Pete Hegsethordered 700 Marines to Los Angeles to back upthe 300 National Guard troops on the ground already and local authorities."
    }
}