{
    "question": "In what ways should Minnesota and other states adjust security and verification practices—for public officials and for residents answering the door—after a suspect allegedly impersonated a police officer to carry out shootings of two lawmakers and was captured following the largest manhunt in the state’s history?",
    "content": {
        "source_1": "This booking photo provided by the Hennepin County Sheriff's Office shows Vance Boelter in Green Isle, Minn., early Monday morning — shortly after a two-day manhunt ended in his capture and arrest.Hennepin County Sheriff's Office/APhide caption\n\nMINNEAPOLIS — Authorities in Minnesota said Monday that the man arrested in a Saturday attack that killed one state lawmaker and left another wounded had a \"hit list\" of 45 elected officials — all Democrats.\n\n\"Political assassinations are rare. They strike at the very core of our democracy,\" said acting U.S. Attorney Joe Thompson for the district of Minnesota. Thedetails of what happened, he said, are \"even worse. They are truly chilling. His crimes are the stuff of nightmares.\"\n\nVance Boelter, 57, was apprehended on Sunday night after what Brooklyn Park police Chief Mark Bruley called \"the largest manhunt in state history.\"\n\nThompson says the suspect went to the homes of four Minnesota state lawmakers \"with the intent to kill them.\" He said Boelter was disguised as a police officer, drove a black SUV with emergency lights turned on, and had a license plate that said \"police.\" He carried a 9mm handgun, wore a black tactical vest and was disguised with a realistic silicone mask. Thompson says the suspect banged on the lawmakers' front doors in the middle of the night.\n\n\"This was a targeted attack against individuals who answered the call to public service,\" said FBI special agent in charge Alvin Winston. \"Let me say this clearly: political violence has no place in this country.\"\n\nAuthorities found \"voluminous writings\" in the suspect's vehicle and at his home. They theorize he'd been planning and researching lawmakers for several months. Thompson says, as of now, it's unclear why the alleged gunman carried out the attacks.\n\nBoelter has been charged with state and federal charges of murder, attempted murder and other crimes. He's being held in federal custody.\n\nBruley said at aSunday night press conferencethat officers had been searching the area of Boelter's property near the town of Green Isle when one thought they saw him \"running into the woods.\" After about an hour and a half, with the help of multiple SWAT teams and a State Patrol helicopter, authorities closed in on him and were \"able to call him out to us.\"\n\n\"Where he was ultimately taken into custody was in a field,\" Bruley said, adding that Boelter was armed at the time.\n\nBoelter was the subject of a days-long man-hunt involving hundreds of local, state and federal law enforcement after the shocking deaths of Democratic state Rep. Melissa Hortman and her husband. Officials say the couple were shot and killed in their Brooklyn Park, Minn., home by a man impersonating a police officer.\n\nEarlier that same morning, Democratic state Sen. John Hoffman and his wife, Yvette, were shot at their home in nearby Champlin, Minn. Ina statementshared with Minnesota Sen. Amy Klobuchar on Sunday night, Yvette said John \"is enduring many surgeries right now and is closer every hour to being out of the woods.\"\n\n\"He took 9 bullet hits,\" she wrote. \"I took 8 and we are both incredibly lucky to be alive.\"\n\nMinnesota Bureau of Criminal Apprehension superintendent Drew Evans told reporters on Sunday that Boelter had been charged with the Hortmans' murders as well as the shooting of the Hoffmans. He said the FBI and and U.S. Attorney's Office are reviewing whether to bring additional federal charges.\n\nVance Luther Boelter, age 57, is shown here in photographs compiled by the FBI for a wanted poster.FBI/FBIhide caption\n\nPolice say they initially responded to the shooting at Hoffman's house, and then went to Hortman's home. There, they saw a car with emergency lights out front, and a man at the door dressed in all blue with black body armor. Officials say that man shot at police, but was able to get away.\n\nAuthorities have yet to announce a possible motive for the attacks, but Minn. Gov. Tim Walz called the shootings \"an act of targeted political violence.\"\n\nAt a news conference Saturday, state police said they found a list of individuals inside what they say is Boelter's vehicle. Hortman and Hoffman were on that list along with other lawmakers, including U.S. Senator Tina Smith and Minnesota Attorney General Keith Ellison, who are also both Democrats.\n\nEvans said Sunday that if officers hadn't encountered Boelter at Hortman's house, forcing him to abandon his vehicle, \"I have every confidence that this would have continued throughout the day.\"\n\nOfficials also said they found \"No Kings\" flyers in the car, a reference to the anti-Trump protests that happened around the country Saturday. Minnesota state officials urged residents to avoid the gatherings, though many still attended and the protests remained largely peaceful.\n\nOther protests across the U.S. also remained largely peaceful, though not without incident: Police in Virginiaarrested a manfor recklessly driving his car through a crowd gathered to protest, hitting one person. In Texas,another man was arrestedfor making threats against state lawmakers there.\n\nAnd on Sunday, Salt Lake City policeannounced the deathof an \"innocent bystander\" who had been shot at a downtown protest, allegedly by a member of the event's peacekeeping team who had been aiming at a different target: a person brandishing a rifle at demonstrators.\n\nThe shootings in Minnesota are part of a string of high-profile political violence across the country in recent years. In April, for example, a man allegedly set fire toPenn. Gov. Josh Shapiro'shome and faces charges including attempted murder, terrorism and aggravated arson.\n\nLast year, the Brennan Center for Justice, a policy think tank, released a report sayingnearly half of the state lawmakersit surveyed had experienced threats or attacks in recent years. At the federal level, the U.S. Capitol Police has documented aspike in threatsagainst members of Congress.\n\nAnd last summer, President Trump, who has often been criticized for stoking the intense emotions that can lead to political violence in the first place, survived an assassination attempt that left his ear bloodied and killed a person in the crowd.\n\nIn a post on social media, Trump condemned the shootings in Minnesota, saying that \"such horrific violence will not be tolerated in the United States of America.\"\n\nNPR's Meg Anderson reported from Minneapolis, Rachel Treisman in Washington, D.C., and Russell Lewis in Birmingham, Ala.",
        "source_2": "A man has been arrested on suspicion of killing a Democratic state lawmaker and her husband, after a two-day manhunt in the US state of Minnesota.\n\nThe chase came to an end in a wooded rural area west of Minneapolis, where he surrendered peacefully and ended up crawling towards officers, police said.\n\nVance Luther Boelter, 57, is charged with killing Melissa Hortman, a Minnesota Democrat, and her husband Mark. State Governor Tim Walz called it a \"politically motivated assassination\".\n\nHe is also alleged to have shot and wounded Democratic State Senator John Hoffman, and his wife Yvette, who are both now awake in hospital.\n\nMrs Hoffman said on Sunday that both felt \"incredibly lucky to be alive\", as they had been hit by 17 bullets between them.\n\nShe and her husband had been \"gutted and devastated\" by the Hortmans' deaths, Mrs Hoffman added in her statement. \"We have no words,\" she wrote. \"There is never a place for this kind of political hate.\"\n\nMr Boelter faces two counts of second-degree murder and two counts of second-degree attempted murder. He is due to appear in court in Minneapolis at 13:30 local time (14:30 EDT; 18:30 GMT) on Monday.\n\nThe suspect is a former political appointee and was once a member of the same state workforce development board as John Hoffman. However it is unclear if they actually knew each other.\n\nPolice have not suggested what the alleged killer's motive might have been, but US senator Amy Klobuchar has joined Governor Walz in suggesting the attacks were politically motivated.\n\nOfficials said on Sunday that Vance Luther Boelter was detained after investigators found a car he had used in Sibley County, about 50 miles (80km) from the murder scene in Brooklyn Park.\n\nAir and SWAT teams were deployed to arrest the suspect, following a huge manhunt that was described as the largest in Minnesota's history.\n\nNo police officers were injured during his apprehension, and officials said they were not looking for any other suspects. Mr Boelter's wife was earlier detained in a traffic stop, but was released because she co-operated with investigators.\n\nSpeaking at a press conference with other local officials on Sunday night, Governor Walz said the attack was an \"unspeakable act\" that had \"altered the state of Minnesota\".\n\n\"This cannot be the norm. It cannot be the way that we deal with our political differences,\" Walz said.\n\nMayor of Minneapolis Jacob Frey praised the \"skill and bravery\" of law enforcement agencies following the suspect's arrest. \"Political violence is abhorrent,\" he added.\n\nVance Luther Boelter is accused of impersonating a police officer to carry out the attacks on Saturday, before exchanging fire with police officers and fleeing from the suburban area.\n\nMelissa Hortman had served in the Minnesota House of Representatives for 20 years, and was speaker of the chamber from 2019 to 2025.\n\nAs well as having some political involvement, Mr Boelter is a security contractor and religious missionary who has worked in Africa and the Middle East, his online CV says. According to Facebook photos, he once preached as a church pastor in the Democratic Republic of Congo.\n\nInvestigators reportedly found a list of \"targets\" in the vehicle that he is thought to have driven for the alleged shootings.\n\nDrew Evans, superintendent of the Minnesota Bureau of Criminal Apprehension, told reporters that he would not describe the notebook found in the car as a \"manifesto\" as it was not \"a treatise on all kinds of ideology and writings\".\n\nLocal media have reported that the names included Governor Walz, congresswoman Ilhan Omar, and state Minnesota Attorney General Keith Ellison.\n\nDuring Sunday's press conference, Mr Evans did not specify who was featured on the list, but said that state officials had contacted authorities in Wisconsin, Illinois, Michigan, Nebraska and Iowa so that they could \"notify individuals that were on that list\".\n\nMrs Hoffman's statement on Sunday also offered an update on her husband's condition. \"John is enduring many surgeries right now and is closer every hour to being out of the woods,\" she wrote.\n\nThe attacker is thought to have first targeted the Hoffmans - at their home in Champlin, at around 02:00 local time on Saturday.\n\nA Facebook post from someone identifying as Mrs Hoffman's nephew said that she had thrown herself on her daughter during the assassination attempt, \"using her body as a shield to save her life\".\n\nSoon after the attack on the Hoffmans eight miles away, the Hortmans were shot and killed at their home in Brooklyn Park.\n\nLocals told the BBC of their shock. Taha Abuisnaineh, who lives across the street, said he and his wife had known the Hortman family for more than 20 years.\n\n\"They were very nice neighbours in a very quiet neighbourhood,\" he said. \"You don't see police activity in this neighbourhood. We are very shocked.\"\n\nAnother resident said she and her husband had received an annual Christmas card from the Hortmans.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "Fox News contributor Ted Williams weighs in on the arrest of the gunman accused of shooting two Minnesota lawmakers on 'Fox News Live.'\n\nMINNEAPOLIS –Vance Boelter, the suspect accused of shooting two Minnesota state lawmakers, killing one and her husband, was captured on Sunday, multiple law enforcement sources confirmed to Fox News.\n\nBoelter, 57, was captured in Sibley County after atwo-day manhunt. He allegedly killed former Minnesota House Speaker Melissa Hortman and her husband, Mark, early Saturday morning at their Brooklyn Park home in Minneapolis. He also allegedly shot State Sen. John Hoffman, also a Democrat, and his wife, Yvette, in their nearby Champlin home in a related attack.\n\nThe Sibley County Sheriff's Office told Fox News that Boelter \"verbally\" identified himself to authorities searching for him in the area on Sunday evening.\n\n\"The face of evil. After relentless and determined police work, the killer is now in custody,\" the Ramsey County Sheriff's Office said in a Facebook post. \"Thanks to the dedication of multiple agencies working together along with support from the community, justice is one step closer.\"\n\nDRAMATIC PHOTOS SHOW MINNESOTA LAWMAKER'S HOME DAMAGED IN SHOOTING AS MANHNUT FOR SUSPECT CONTINUES\n\nVance Luther Boelter was arrested on Sunday evening.(Ramsey County Sheriff's Office)\n\nSpeaking at a press conference alongside other law enforcement officers after Boelter's arrest, Brooklyn Park Police Department Chief Mark Bruley said there were more than 20 different SWAT teams involved in the search. He described it as \"thelargest manhuntin the state's history.\"\n\nThe manhunt included officers from multiple agencies on foot as well as the use of a helicopter.\n\nThere's no question that this is the largest manhunt in the state's history.\n\n\"The suspect crawled to law enforcement teams and was placed under arrest at that point in time,\" Lieutenant Colonel Minnesota State Patrol Jeremy Geiger said.\n\nThere was no indication that Boelter was working with anyone else, authorities said.\n\nLaw enforcement officials dress up in protective gear to investigative an attack on the Pearl Street Mall, Sunday in Boulder, Colo.(AP)\n\nThe Hennepin County District Court issued a criminal complaint charging Boelter with four felony counts of second-degree murder with intent (not premeditated).\n\nA mugshot of Minnesota lawmaker shooting suspect Vance Boelter in custody at Hennepin County Jail.(Hennepin County Jail)\n\nThe complaint charges Boelter with two counts of second-degree murder for the deaths of Victims 1 and 2 —identified as Melissa and Mark Hortman— and two counts of attempted second-degree murder for the shootings of Victims 3 and 4 — identified as John Hoffman and Yvette Hoffman. All charges are felonies, and each carries a maximum sentence of 40 years in prison, with a mandatory minimum of three years due to the use of a firearm.\n\nFBI agents strategizing in Green Isle, Minnesota.(Peter D'Abrosca for Fox News Digital)\n\nGov. Tim Walz said \"the heroic actions by the Hoffman family and their daughter Hope saved countless lives\" during a Sunday press conference.\n\n\"The latest news is Senator Hoffman came out of his final surgery, and is moving towards that, towards recovery,\" Walz said at Sunday night's press conference.\n\nThe complaint alleges that Boelter acted with intent to kill, using a firearm, in attacks against four individuals, including two who were elected officials.\n\nPolice documents say that at approximately 2:05 a.m., Champlin Police responded to a 911 call reporting a masked individual had shot two people at a residence. Officers discovered Victims 3 and 4, both of whom had been shot but survived.\n\nLaw enforcement presence in Green Isle, Minnesota.(Peter D'Abrosca for Fox News Digital)\n\nSurveillance footage captured a man dressed in police-style tactical gear, later identified as Boelter, approaching the home in a Ford SUV equipped with police-style lights. The footage, authorities allege, showed Boelter announcing himself as a police officer before entering the residence and shooting the victims.\n\nRoughly 90 minutes later, Brooklyn Park Police, having learned that a legislator was involved in the earlier shooting, were dispatched to another legislator’s home as a precaution, documents say.\n\nThe FBI is offering a reward of up to $50,000 for information leading to the arrest and conviction of Vance L. Boelter, the suspect in Saturday's targeted shootings of Minnesota lawmakers and their families in Champlin and Brooklyn Park.(FBI)\n\nUpon arrival around 3:35 a.m., officers witnessed Boelter shoot Victim 2 through the open front door. Officers discovered both Victims 1 and 2 deceased from gunshot wounds.\n\nNEARBY STATE ON ALERT AS SEARCH FOR MINNESOTA LAWMAKER SHOOTER CONTINUES\n\nAuthorities uncovered a disturbing arsenal in Boelter’s possession, documents said. Inside his vehicle, registered to him, police found three AK-47 assault rifles, a 9mm handgun, and a list of names and addresses of other public officials.\n\nBoelter, 57, is accused of killingMinnesota House Speaker Melissa Hortmanand her husband, Mark, early Saturday morning at their Brooklyn Park home in Minneapolis. He is also accused of shooting State Sen. John Hoffman, also a Democrat, and his wife, Yvette, in their nearby Champlin home.(AP Images)\n\nAdditional evidence, including a ballistic vest, a mask, and a police-style badge, was recovered nearby.\n\n\"There is information that led us to do the searches…in Sibley County,\" Bureau of Apprehension Superintendent Drew Evans said, adding later that Boelter's vehicle and a hat that appeared to belong to the suspect were located in that area near his home.\n\nWindows are seen broken at the home of DFL State Rep. Melissa Hortman on June 15, 2025 in Brooklyn Park, Minnesota. Hortman and her husband, Mark Hortman, were shot and killed yesterday morning. DFL State Sen. John Hoffman and his wife were also shot and hospitalized in a separate incident. Minnesota Gov. Tim Walz said during a press conference that the shooting \"appears to be a politically motivated assassination.\"(Stephen Maturen/Getty Images)\n\nAuthorities have said the suspect targeted lawmakers in a planned attack, showing up at their homes wearing a police-like uniform and a mask.\n\n\"Boulter exploited the trust. Our uniforms are meant to represent,\" Minnesota Department of Public Safety Bob Jacobson said during the Sunday evening press conference. \"That betrayal is deeply disturbing to those of us who wear the badge with honor and responsibility. We want to thank community members across the state for their support, for their tips and their information.\"\n\nPOLICE IDENTIFY SUSPECT IN SHOOTING OF MINNESOTA LAWMAKERS AND THEIR SPOUSES\n\nDemocratic Minnesota Sen. Amy Klobuchar shared a message from Hoffman's wife on Sunday, saying the state senator was shot nine times and she eight.\n\nSen. Amy Klobuchar, D-Minn., on Sunday evening shared a text message from Senator Hoffman's wife, Yvette, saying Hoffman was shot nine times and she eight.(Sen. Amy Klobuchar)\n\n\"John is enduring many surgeries right now and is closer every hour to being out of the woods,\" Yvette wrote. \"He took [nine] bullet hits. I took [eight] and we are both incredibly lucky to be alive. We are gutted and devastated by the loss of Melissa and Mark. There is never a place for this kind of political hate.\"\n\nOfficials said Boelter had signs in his vehicle that read \"No Kings.\" Cities across the United States had \"No Kings\" protests — expressing disapproval of the Trump administration's ICE raids — scheduled for Saturday afternoon.\n\nFox News' Peter D'Abrosca and Bradford Betz contributed to this report.\n\nAudrey Conklin is a digital reporter for Fox News Digital and FOX Business. Email tips to audrey.conklin@fox.com or on Twitter at @audpants.\n\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}