{
    "question": "In what ways could concentrating stepped-up ICE deportation efforts in Democratic-run cities like Los Angeles, Chicago, and New York influence community trust, public safety, and city–federal relations?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nPolice in Los Angeles, where protests over federal immigration enforcement raids erupted a week earlier and sparked demonstrations across the country, used tear gas and crowd-control munitions to clear out protesters on Saturday. (AP video: Mark Vancleave)\n\nPresident Donald Trump, left, escorted by Air Force Col. Angela F. Ochoa, Commander, 89th Airlift Wing, walks from Marine One to board Air Force One, Sunday, June 15, 2025, at Joint Base Andrews, Md., for a trip to Canada to attend the G7 Summit. (AP Photo/Mark Schiefelbein)\n\n▶ Follow live updates onPresident Donald Trump and his administration\n\nWASHINGTON (AP) — PresidentDonald Trumpon Sunday directed federal immigration officials to prioritize deportations from Democratic-run cities, a move that comes after largeprotests erupted in Los Angelesand other major cities against the Trump administration’s immigration policies.\n\nTrump in a social media posting called onU.S. Immigration and Customs Enforcementofficials “to do all in their power to achieve the very important goal of delivering the single largest Mass Deportation Program in History.”\n\nHe added that to reach the goal officials ”must expand efforts to detain and deport Illegal Aliens in America’s largest Cities, such as Los Angeles, Chicago, and New York, where Millions upon Millions of Illegal Aliens reside.”\n\nTrump’s declaration comes after weeks of increased enforcement, and after Stephen Miller, White House deputy chief of staff and main architect of Trump’s immigration policies, said ICE officers would target at least 3,000 arrests a day, up from about 650 a day during the first five months of Trump’s second term.\n\nAt the same time, the Trump administration has directed immigration officers to pause arrests atfarms, restaurants and hotels, after Trump expressed alarm about the impact aggressive enforcement is having on those industries, according to a U.S. official familiar with the matter who spoke only on condition of anonymity.\n\nProtests over federalimmigration enforcement raidshave beenflaring up around the country.\n\nOpponents of Trump’s immigration policies took to the streets as part of the “no kings” demonstrations Saturday that came as Trump held a massive parade in Washington for the 250th anniversary of the U.S. Army.\n\nBut police in Los Angeles used tear gas and crowd-control munitions to clear out protesters after the event ended.\n\nOfficers in Portland, Oregon, also fired tear gas and projectiles to disperse a crowd that protested in front of a U.S. Immigration and Customs Enforcement building well into the evening.\n\nTrump made the call for stepped up enforcement in Democratic-controlled cities on social media as he was making his way to theGroup of Seven economic summitin Alberta, Canada.\n\nHe suggested to reporters as he departed the White House for the G7 on Sunday evening that his decision to deploy National Guard troops to Los Angeles was the reason the protests in that city went peacefully.\n\n“If we didn’t have the National Guard on call and ready, they would rip Los Angeles apart,” Trump said.\n\nThe shift also come as Trump is grappling with the impact his mass deportation effort is having on key industries that rely on workers in the country illegally.\n\nTrump posted on his Truth Social site Thursday that he heard from hotel, agriculture and leisure industries that his “very aggressive policy on immigration is taking very good, long time workers away from them” and promised that changes would be made .\n\nThat same day Tatum King, an official with ICE’s Homeland Security Investigations unit, wrote to regional leaders telling them to halt investigations of the agriculture industry, including meatpackers, as well as of restaurants and hotels, according to the U.S. official.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Reporting by Costas Pitas; Editing by Tom Hogue, Noeleen Walder and Lincoln Feast.\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nPolish Prime Minister Donald Tusk said that the U.S. had pledged to consult with Europe ahead of a summit with Russia's Vladimir Putin, as European ministers prepare for discussions amid fears Washington may dictate unfavourable peace terms to Ukraine.\n\nReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.\n\nAccess unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.\n\nBrowse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.\n\nScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.\n\nAll quotes delayed a minimum of 15 minutes.See here for a complete list of exchanges and delays.",
        "source_3": "PresidentTrumpordered the government’s deportation force to focus on scouring cities for illegal immigrants to deport but pay less attention to America’s “heartland,” where he said there’s just not the same need to boot people.\n\nIn a social media post Sunday night Mr.Trumpsaid he remains committed to the “single largest mass deportation program in history,” but laid out new parameters for how he wants it to go down.\n\n“In order to achieve this, we must expand efforts to detain and deport Illegal Aliens in America’s largest Cities, such as Los Angeles, Chicago, and New York, where Millions upon Millions of Illegal Aliens reside,” he said. “And that is why I want ICE, Border Patrol, and our Great and Patriotic Law Enforcement Officers, to FOCUS on our crime ridden and deadly Inner Cities, and those places where Sanctuary Cities play such a big role. You don’t hear about Sanctuary Cities in our Heartland!”\n\nThe statement comes after days of speculation that Mr.Trumphad a change of heart on deportations.\n\nIn a social media post last week he said he’d been hearing from farmers and “people in the hotel and leisure business” who said aggressive deportations were sapping them of their workforce and they were “almost impossible to replace.”\n\nHe also hinted, during a White House event, that there would be an upcoming order to “do something about that” for the farmers.\n\nIt’s not clear whether Sunday’s Truth Social posting was that order or whether something more formal is in the offing.\n\nThe New York Times reported that U.S. Immigration and Customs Enforcement, the government’s deportation force, issued a directive suspending worksite enforcement operations.\n\nThe tension between mass deportations and focusing on “criminal” illegal immigrants has been present for Mr.Trumpdating back to the 2024 campaign, when he and his aides struggled to define what would happen if he won.\n\nTo achieve the kind of mass deportations Mr.Trumphas talked about he would have to go after some level of rank-and-file illegal immigrants.\n\nAt the same time, the government says its focus remains on those with criminal records.\n\nThe latest ICE data shows that of people ICE arrested and had in custody as of the start of this month, about 75% had either criminal convictions or pending charges. That’s the vast majority, but it’s still a slide from the Biden administration, when that figure topped 90%.\n\nMr.Trump’snew directive comes as ICE officers are facing an intense backlash, with assaults spiking more than 400%.\n\nFederal prosecutors have brought charges in several stunning cases where they said residents took matters into their own hands to try to thwart ICE arrests, including using their own vehicles to try to box in the deportation officers.\n\nMr.Trumpgave a vote of confidence to ICE officers Sunday.\n\n“I want our Brave ICE Officers to know that REAL Americans are cheering you on every day,” he said.\n\n“The American People want our Cities, Schools, and Communities to be SAFE and FREE from Illegal Alien Crime, Conflict, and Chaos. That’s why I have directed my entire Administration to put every resource possible behind this effort, and reverse the tide of Mass Destruction Migration that has turned once Idyllic Towns into scenes of Third World Dystopia,” he said.\n\n• Stephen Dinan can be reached atsdinan@washingtontimes.com.\n\nCopyright © 2025 The Washington Times, LLC.Click\n                            here for reprint permission.\n\nPope Leo should tell Catholics: Marry young, have many children\n\nTrump’s TikTok delays undermine his China hawks while Intel controversy grows"
    }
}