{
    "question": "How might the guilty pleas in the decade-long USAID bribery scheme affect public trust and drive changes in oversight and procurement practices for federal contracts?",
    "content": {
        "source_1": "USAID bribery scheme involved $550M in federal contracts\n\nA former U.S. Agency for International Development official in Maryland and three corporate executives have pleaded guilty for their roles in a decade-long bribery scheme involving more than $550 million in contracts, with two of the companies who contracted with USAID agreeing Thursday to defer their own prosecution.\n\nRoderick Watson, a former USAID contracting officer, pled guilty last month before theU.S. District Court for the District of Marylandto receiving bribes from three corporate executives in exchange for awarding USAID contracts to Apprio, Inc. and Vistant, federal contractors that provide technology solutions and program management services to government agencies.\n\nWalter Barnes, owner and president of PM Consulting Group LLC (d/b/a Vistant), also pled guilty last month to conspiracy to commit bribery of a public official andsecurities fraud; Darryl Britt, owner and president of Apprio, pled guilty in October 2024 to conspiracy to commit bribery of a public official; and Paul Young, president of a subcontractor to Apprio and Vistant, pled guilty in June last year to conspiracy to commit bribery of a public official.\n\nThe four men, all Marylanders excluding Britt, who is a Florida resident, played varying roles in a bribery scheme that began in 2013 and involved at least 14 prime contracts worth more than $550 million.\n\nAccording to court documents, Watson accepted bribes from Britt and Barnes that were often concealed by passing them through Young in exchange for awarding contracts to Apprio and Vistant. The bribes included cash, laptops, thousands of dollars in tickets to a suite at an NBA game, a country club wedding, down payments on two residential mortgages, cellphones, and jobs for relatives.\n\nIn exchange for the bribe payments, Watson awarded contracts to Apprio and Vistant by manipulating the procurement process as USAID through various means, including recommending their companies to other USAID decisionmakers for non-competitive contract awards, disclosing sensitive procurement information during the competitive bidding process, providing positive performance evaluations to a government agency, and approving decisions on the contracts, such as increased funding and a security clearance.\n\nIn 2022, according to court documents, Watson and Barnes defrauded a licensed small business investment company by inducing the company into executing a credit agreement with Vistant, where Barnes caused Vistant to issue stock warrants that, if exercised, would result in the investment company having a 40% equity stake in Vistant. The credit agreement also provided for a $14 million loan to Vistant, from which Barnes could pay himself a $10 million dividend.\n\nIn 2023, Britt engaged in a scheme in which Apprio fraudulently induced a private equity firm to purchase from Apprio’s parent company a 20% equity stake in the company for $4 million and simultaneously extend it a $4 million loan secured by shares of Apprio stock. According to court documents, Britt intentionally omitted during negotiations that he had bribed Watson for years.\n\nCounsel for Watson, Barnes, Britt, and Young, all of whom are represented separately by different attorneys, did not return a request for comment Friday.\n\nMatthew Galeotti, head of the Justice Department’s criminal division, said in a news release Thursday that the four men “sought to enrich themselves at the expense of the American taxpayers.”\n\n“Their scheme violated the public trust by undermining the integrity of the federal government’s procurement process,” Galeotti said.\n\nA spokesperson for the Maryland U.S. Attorney’s Office declined to comment on when the investigation began or what prompted the investigation.\n\nKelly Hayes, U.S. attorney for the District of Maryland, said her office and law-enforcement partners will continue to prosecute “corruption at every level.”\n\n“Watson was entrusted to serve the interests of the American people—not his own—and his criminal actions for his own personal gain undermines the integrity of our public institutions,” Hayes said in a news release. “Public trust is a hallmark of our nation’s values, so corruption within a federal government agency is intolerable.”\n\nApprio and Vistant, in admitting criminal liability and entering into three-year deferred prosecution agreements, are required to report to the Justice Department regarding remediation and implementation of compliance measures. According to the DOJ, Apprio is expected to pay $500,000 in a civil settlement, while Vistant is expected to pay $100,000.\n\nWatson is scheduled to be sentenced on Oct. 6 and faces a maximum penalty of 15 years in prison. Britt, Young, and Barnes’ sentencings are scheduled for July 28, Sept. 3, and Oct. 14, respectively, where they each face a maximum penalty of five years in prison.\n\nEditor’s note, this story has been updated to say the U.S. Attorney’s Office declined to say when the investigation began or what prompted it.\n\nFederal prosecutors subpoena NY Attorney General Letitia James in civil fraud cases against Trump and the NRA [...]\n\nA federal appeals court overturned a contempt finding against the Trump administration in a case involving dep[...]\n\nDemocracy Forward sues DOJ and FBI to release records on Jeffrey Epstein’s sex trafficking case and communic[...]\n\nA federal judge in Maryland late Thursday ruled President Donald Trump's administration cannot withhold citize[...]\n\nBrandon Russell, neo-Nazi group founder, sentenced to 20 years for plotting attacks on Maryland’s power grid[...]\n\n'Kingpin' statute — freedom of information — farm odors\n\nMDOT begins developer search for Bowie State MARC station project\n\nMD grants $17 million to help local schools boost energy efficiency\n\nMD officials to vote on funding for State House memorial honoring Black Revoluti[...]\n\nFormer MD Eastern Shore judge, law clerk charged with misconduct in office\n\nMD Supreme Court grants review of 4 cases, declines to hear case on comparative [...]\n\nListen to this article A trademark is a word or combination of words, a logo, design or even a color[...]\n\nListen to this article Many organizations talk about professional development, offering a program he[...]\n\nListen to this article Exposing corruption is a cornerstone of a free and just society. Actual whist[...]\n\nListen to this article Artificial intelligence is en vogue. Lawyers use AI for legal research, brief[...]\n\nListen to this article Baltimore County Executive Kathy Klausmeier has nominated Khadija Walker to r[...]\n\nListen to this article Last week, in front of a judge and jury during a murder trial in the Baltimor[...]\n\nMaryland merchants and consumers face rising swipe fees. The Credit Card Competition Act could bring[...]\n\nStudents have been called to the office — and even arrested — for AI surveil[...]\n\nCollege endowment tax causing financial uncertainty, hiring freezes\n\nMany beachgoers feel the sting of a blooming jellyfish population\n\nJustice Department subpoenas New York AG James as it investigates whether she vi[...]\n\nAppeals court tosses judge’s contempt finding against Trump administration in prison deportations\n\nThe Daily Record is a digital-first daily news media company focused on law, government, business, recognition events, Power Lists, special products, public notices and more.\n\nGet our free e-alerts & breaking news notifications!\n\nSubscribefor access to the latest digital and special editions.\n\nClick herefor information about plaques, permissions and reprints of previous editions.\n\nUse of this website is subject to itsTerms of Use|Privacy Policy|Your California Privacy Rights/Privacy Policy|Do Not Sell My Info/Cookie Policy\n\nJavascript is disabled in your web browser. You can't access site without javascript so please enable it for your seamless and unintruppted user experience of our website.",
        "source_2": "Three Maryland men have pleaded guilty to a decade-long bribery scheme involving at least 14 federal contracts worth more than $550 million.",
        "source_3": "A federal contracting officer and three businessmen pleaded guilty Thursday to participating in a $550 million bribery scheme involving the embattledUS Agency for International Development (USAID).\n\nRoderick Watson, of Maryland, is alleged to have received bribes valued in excess of $1 million whileworking at USAIDin exchange for using his position as a trusted overseer of taxpayer money to direct 14 prime federal contracts to two consulting companies, Apprio and Vistant.\n\nWatson, 57, pleaded guilty tobriberyof a public official and faces up to 15 years in prison. He’s scheduled to be sentenced in October.\n\nAs part of the elaborate scheme, Walter Barnes, owner of Vistant, and Darryl Britt, owner of Apprio, used Paul Young, the president of a subcontractor used by both Vistant and Apprio, as a middleman to conceal some of the bribes destined for Watson,according to the Justice Department.\n\nThe three businessmen each pleaded guilty to conspiracy to commit bribery of a public official. Barnes pleaded guilty to securities fraud as well.\n\nThe scheme dates back to 2013, when Watson, working as a USAID contracting officer, agreed to use his influence at the government agency to steer contracts to Britt’s Apprio firm in exchange for bribes, according to the DOJ.\n\nBritt’s company had been eligible for lucrative federal contracts as a designated “socially and economically disadvantaged” business by the Small Business Administration (SBA).\n\nWhen Apprio “graduated” from the SBA 8(a) program, the scheme shifted, and Watson began awarding prime contracts to Barnes’ Vistant company – an Apprio subcontractor – between 2018 and 2022, in exchange for bribes.\n\nThe USAID official received “cash, laptops, thousands of dollars in tickets to a suite at an NBA game, a country club wedding, downpayments on two residential mortgages, cellular phones, and jobs for relatives,” from the three businessmen as part of the scheme.\n\nShell companies, fake invoices and fraudulent payroll sheets were all used to hide the corruption, according to the DOJ.\n\nBarnes, 46, Britt, 64, and Young, 62, each face a maximum of five years behind bars.\n\n“The defendants sought to enrich themselves at the expense of American taxpayers through bribery and fraud,” Matthew Galeotti, head of the Justice Department’s Criminal Division, said in a statement. “Their scheme violated the public trust by corrupting the federal government’s procurement process.\n\n“Anybody who cares about good and effective government should be concerned about the waste, fraud, and abuse in government agencies, including USAID,” he added. “Those who engage in bribery schemes to exploit the US Small Business Administration’s vital economic programs for small businesses — whether individuals or corporations acting through them — will be held to account.”\n\nBillionaire entrepreneur Elon Musk made USAID one of his first targets for sweeping cuts when he led the Trump administration’s Department of Government Efficiency (DOGE).\n\nIn February, President Trump declared that USAID’s spending was mostly “corrupt or ridiculous,” adding,“the whole thing is a fraud,”in remarks from the Oval Office.\n\nMusk has allegedthat the agency is run like a “criminal organization” by a “viper’s nest of radical left Marxists who hate America.”\n\nDOGE slashed more than$8 billion in fundingand fired nearly all USAID employees and contractors as part of its efforts to dismantle the agency."
    }
}