{
    "question": "In what ways might Hegseth’s testimony that the Pentagon plans for “any number of contingencies” regarding Greenland and Panama shape perceptions of U.S. intentions abroad and affect cooperation with Denmark/Greenland and Panama?",
    "content": {
        "source_1": "Defense Secretary Pete Hegsethsaid the Pentagon has plans for multiple \"contingencies\" inGreenland– including an invasion of the island.\n\nAsked by Republican Rep. Mike Turner at a June 12 House Armed Services Committee hearing to confirm whether there are plans to invade Greenland, Hegseth said, \"The Pentagon has plans for any number of contingencies.\"\n\n\"It is not your testimony today that there are plans at the Pentagon for taking by force or invading Greenland, correct? Because I sure as hell hope that it is not your testimony,\" Turner dug in.\n\n\"We look forward to working with Greenland to ensure that it is secured from any potential threats,\" Hegseth said.\n\nPresidentDonald Trumphas declined to rule out force inhis pledge to \"get Greenland,\"although he has said it won't be necessary. He has insisted thatacquiring Greenland is necessaryfor national security, citing growing Chinese and Russian influence in the region. The island is also rich in critical minerals that the U.S. wants to challenge Chinese monopolies in some industries,USA TODAY has reported.\n\nDuring a March visit to Pituffik Space Base, the U.S. base on Greenland,Vice President JD Vance accusedDenmark of \"failing\" to protect the Arctic island while downplaying Trump's threats to take it over by force.\n\nDanish leaders have pushed back. \"The U.S. shall not take over Greenland. Greenland belongs to the Greenlanders,\" Danish Prime Minister Mette Frederiksensaid after Vance's visit.\n\nIn the latest snub to Denmark and other European allies, thePentagon reportedly plansto move its oversight of the island from U.S. European Command to U.S. Northern Command.",
        "source_2": "Defense Secretary Pete Hegseth dodged questions from a Republican congressman Thursday about whether the U.S. has any military plans for taking over Greenland, as President Donald Trump has repeatedly said he wants the Danish territory to become part of the U.S.\n\nHegseth refused to answer directly when asked twice by Rep. Mike Turner, R-Ohio, during an Armed Services Committee hearing if the Pentagon has any plans for “invading or taking by force Greenland.”\n\n“The Pentagon has plans for any number of contingencies,” Hegseth said.\n\nTurner responded “I sure as hell hope that is not your testimony,” to which Hegseth replied “we look forward to working with Greenland to ensure that it is secured from any potential threats.”\n\nThe discussion about Greenland came up during the hearing about Hegseth’s controversial use of the Signal chat app to discuss top-secret military plans.\n\nTurner told the defense secretary he wanted to “help” him “because people try to twist your words” after Hegseth repeatedly refused to directly answer Rep. Adam Smith, D-Wash., when asked if the Pentagon had plans for invading Greenland.\n\nDenmark’s Parliamentvoted Wednesdayto allow new U.S. military bases on Danish territory, prompting criticism that the move empowers Trump’s aspirations to take over Greenland.\n\nTrump has floated the idea of buying Greenland for years, but has ramped up the frequency and seriousness of his musings during his second term, including suggesting the U.S. could use military force or economic penalties to force the acquisition. Officials in Greenland and Denmark have firmly rejected the idea. Greenland has become increasingly important on a geopolitical scale in recent years as melting ice in the Arctic Circle has opened new North Atlantic shipping lanes, drawing interest from U.S. rivals Russia and China.\n\nWhy Does Trump Want To Buy Greenland? What To Know As Danish Prime Minister Says It’s ‘Not For Sale’(Forbes)\n\nTrump Says US Should Take Ownership Of Greenland And Threatens Panama Canal Takeover(Forbes)",
        "source_3": "Secretary of DefensePete Hegsethdidn’t rule out using military force to takeGreenlandandPanama, implying to lawmakers on Thursday that the Defense Department has plans prepared if such an order is given.\n\n“Our job at the [Department of Defense] is to have plans, and we have a lot of them,” Hegseth told lawmakers on the House Armed Services Committee when pressed by the committee’s top Democrat, Rep. Adam Smith (D-WA).\n\n“Our job at the defense department is to have plans for any particular contingency. Any contingency you need, we’ve got it,” Hegseth added. “We’ve got a building full of planners and we’re prepared to give recommendations whenever needed.”\n\nSmith said, “Let’s be clear, you do have plans to take Panama and Greenland by force if necessary.”\n\nHegseth responded, “I think the American people would want the Pentagon to have plans for any particular contingency, and thankfully, we are in the planning business.”\n\nSince returning to the White House, PresidentDonald Trumphas highlighted the strategic significance of Panama, via the Panama Canal, and Greenland, which is located near the Arctic. However, he has also left open the possibility of using coercion to get them to pursue U.S. interests.\n\nThe administration has warned about China’s influence on the Panama Canal.\n\nLater in the hearing, Rep. Mike Turner (R-OH) offered Hegseth a chance to clarify his comments because “people try to twist your words,” adding, “You are not confirming in your testimony today, that at the Pentagon there are plans for invading or taking by force Greenland, correct, that is not your testimony today?”\n\nHegseth responded, “All my testimony is that the Pentagon has plans for any number of contingencies,” which prompted Turner to repeat his question.\n\n“It is not your testimony today that there are plans at the Pentagon for taking by force or invading Greenland, correct? I sure as hell hope that is not your testimony,” Turner said, to which Hegseth responded, “We look forward to working with Greenland to ensure it’s secured from any potential threats.”\n\nHegseth visited Panama in mid-April to discuss the threat China’s influence in the canal poses to U.S. national security. During his visit, he announced a new agreement with the Panamanians that gives the United States the right to go “first and free” through the canal.\n\nMILITARY CONSIDERING ‘WIDE RANGE OF OPTIONS’ ON HOW TO STOP IRAN FROM OBTAINING NUCLEAR WEAPONS\n\nThe U.S. has had a military presence in Greenland for decades, though Vice President JD Vance said during a March visit to Pituffik Space Base that the U.S. needs to “take a significant position in Greenland” because other countries have “explicitly gone after Greenland … with a mind toward economic exploitation.”\n\nThe Department of Defense isconsideringmoving the responsibility for Greenland from under U.S. European Command to U.S. Northern Command, which is in charge of defending the U.S. homeland."
    }
}