{
    "question": "What implications could the brief inclusion and subsequent removal of conditions tying FEMA disaster aid to states’ treatment of Israeli companies have for future federal grant policies and state autonomy?",
    "content": {
        "source_1": "USstates and territories that boycottIsraelicompanies or those operating in Israel will be denied federal funds for natural disaster preparation, Reuters reported on Monday.\n\nThe Federal Emergency Management Agency (Fema) announced on Friday it was making nearly $1bn available to states to protect themselves from natural disasters, such as floods, tornadoes, hurricanes, and fires, as well as terrorist attacks and cyber disruptions.\n\nThis $1bn allocation, which will apply to 15 different grant programmes, is part of the \"Notices of Funding Opportunity amounting to more than $2.2 billion available to state, local, tribal and territorial governments to help them protect American citizens\", Fema states on its website.\n\nHowever, Reuters said at least $1.9bn of this funding was conditional on states following Department of Homeland Securityconditionslaid out in April, saying states will not cut “commercial relations specifically with Israeli companies or companies doing business in or with Israel” to qualify, according to 11 agency grant notices it reviewed.\n\nBut the ruling is seen as largely symbolic. More than 30 US states already have laws that require “public entities to certify they do not and will not boycott Israel”, according to anessaytitled \"Anti-BDS laws and the politics of political boycotts\" in the University of Pennsylvania’s Journal of Law and Social Change.\n\nIn recent months, calls for boycotts of Israeli and international companies that are doing business with Israel have increased. Recently, UN special rapporteur on Palestine Francesca Albanese called for action after publishinga scathing reportin which she names over 60 companies, including major technology firms like Google, Amazon and Microsoft, alleging their involvement in what she calls \"the transformation of Israel's economy of occupation to an economy of genocide\".\n\nAlbanese was sanctioned by the US after she published the report.\n\nIt is the latest escalation of the Trump administration creating pushback on institutions, departments or states that do not fall in line with its goals and priorities, such as its hardline approach to immigration or issues such as climate change.\n\nFor example, Fema’sstatementon Friday laid out that recipients will no longer be able to spend the funds “to house illegal immigrants at luxury hotels, fund climate change pet projects or empower radical organizations with unseemly ties that don’t serve the interest of the American people”.\n\nThe statement also said that recipients are required to spend at least 10 percent on “supporting border crisis response and enforcement”.",
        "source_2": "Reporting by Courtney Rozen; Editing by Kevin Liffey, Howard Goller and Bill Berkrot\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nPresident Donald Trump has spent days escalating his rhetoric on crime in Washington, calling the U.S. capital \"totally out of control\" and ordering a federal law enforcement surge ahead of a press conference to outline a sweeping crackdown.\n\nReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.\n\nAccess unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.\n\nBrowse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.\n\nScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.\n\nAll quotes delayed a minimum of 15 minutes.See here for a complete list of exchanges and delays.",
        "source_3": "By signing up to our newsletters you agree to the Just the NewsTerms of ServiceandPrivacy Policy\n\n\"There is just no way to reasonably claim that this qualifies as 'America First,'\" posted the Daily Wire's Matt Walsh.\n\nThe Trump Administration on Monday dropped language from the Department of Homeland Security that would have denied disaster aid funding to cities and states that boycotted Israeli companies, following intense backlash from both sides of the aisle.\n\nThe DHS Standard Terms and Conditions onMonday morning, included the following statement:\n\n\"Discriminatory prohibited boycott means refusing to deal, cutting commercial relations, or otherwise limiting commercial relations specifically with Israeli companies or with companies doing business in or with Israel or authorized by, licensed by, or organized under the laws of Israel to do business.\"\n\nThat language has since beenremoved from the DHS's most up to date version. The original post with the Israel-related language may befound here.\n\nThe removal followed intense online backlash from right-wing and left-wing advocates online, many of whom deemed it evidence of Israeli capture of the American government.\n\n\"Denying American victims of natural disasters aid if they are insufficiently supportive of Israel. Absolute insanity,\" wrote podcastKrystal Ball.\n\n\"I’ve never seen someone tank their legacy so fast. This is not America first and anyone advising him on this should be fired,\" musicianAlexandra Lainswrote.\n\n\"There is just no way to reasonably claim that this qualifies as 'America First,'\" posted the Daily Wire'sMatt Walsh.\n\nBen Whedon is the Chief Political Correspondent at Just the News.Follow him on X."
    }
}