{
    "question": "What are the key humanitarian, legal, and public safety implications of DHS’s immediate revocation of CHNV humanitarian parole and work authorizations, alongside its offer of travel assistance and a $1,000 exit bonus?",
    "content": {
        "source_1": "Updated on:  June 12, 2025 / 10:23 PM EDT/ CBS Miami\n\nThe Department of Homeland Security on Thursday began issuingtermination noticesto migrants from Cuba, Haiti, Nicaragua and Venezuela who entered the U.S. under a Biden-era immigration policy, revoking their parole and associated work authorizations effective immediately.\n\nThe notices, delivered via email, inform recipients that their temporary permission to remain in the U.S. under the CHNV parole program has been rescinded. Migrants who have not secured another lawful immigration status are now being toldthey must leave the country right away.\n\nThe move follows aMay 30 rulingby the U.S. Supreme Court that upheld the program's cancellation by the Trump administration. The CHNV initiative, launched in 2022, allowed more than 500,000 individuals and family members from those four countries to enter the U.S. while awaiting immigration proceedings.\n\n\"This program was abused by the previous administration to admit hundreds of thousands of poorly vetted illegal aliens,\" DHS Assistant Secretary Tricia McLaughlinsaid in a statement, accusing the Biden administration of prioritizing politics over public safety.\n\nShe added that ending the program represents a return to \"common-sense policies\" and an \"America First\" approach.\n\nThe Department is encouraging affected individuals to self-deport using theCBP Home Mobile App. Those who comply voluntarily may be eligible for travel assistance and a $1,000 reintegration bonus upon arrival in their country of origin\n\nThe CHNV parole program had been a central piece of the Biden administration's efforts to manage mass migration from countries facing humanitarian crises. Its termination signals a significant policy shift in the federal government's handling of immigration enforcement.\n\nThe CBS Miami team is a group of experienced journalists who bring you the content on CBSMiami.com.",
        "source_2": "Hundreds of thousands of immigrants who were given special permission to come to the US will be told that they must leave the country immediately.\n\nThe Department of Homeland Security (DHS) said in a statement Thursday that Cubans, Haitians, Nicaraguans, and Venezuelans who were previously temporarily shielded from deportation will be emailed notices telling them to go.\n\nThe DHS said that more than half a million people from the four countries were allowed to remain in the US for two years under orders issued by former President Joe Biden.\n\nThe directive is expected to face legal challenges from opponents of the Trump administration's mass deportation programme.\n\nDuring his time in office Biden expanded the protection, which is called \"humanitarian parole\" and dates back to the Cold War, due to conditions in each of the four countries.\n\nThe DHS previously said that through the end of November 2024,a total of 531,670 peoplewere granted permission to stay in the US under the programme, and that as a result, illegal crossings from citizens of the four countries had decreased by 98%.\n\nIt's unclear exactly how many people will be affected by the new directive, however, as some of the immigrants from those countries may have acquired legal status to remain in the US under other visa programmes.\n\nThe Biden administration had said the immigrants, who each required a US-based sponsor, were screened and vetted. However, the Trump administration disagreed.\n\nDHS spokesperson Tricia McLaughlin called the Biden-era programme \"disastrous\" and in a statement said it opened the door for fraudulent claims and crime and it undercut American workers.\n\nThe programme became an issue during last year's presidential campaign, particularly when Trump and his allies focused attention on cities like Springfield, Ohio, which in recent years has seen a large influx of Haitian immigrants - many of whom were permitted to stay in the country under the programme.\n\nTrump and othersmade inflammatory statements about Haitian immigrants eating pets, which were found to be lacking in evidence. However, Trump's running mate, Vice-President JD Vance, defended what he described as \"creating a story\" to highlight high levels of immigration and what he called \"the suffering of the American people.\"\n\nPresident Trump cancelled Biden's order on parole with an executive order of his own shortly after he took office in January. In May the Supreme Court upheld his suspension of the humanitarian parole programme while a legal battle continues in lower courts.\n\nThe DHS has promised travel assistance and a $1,000 \"exit bonus\" to migrants without legal permission to be in the US who voluntarily leave the country.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "The Department of Homeland Security (DHS) announced on June 12 that it sent notices of termination to hundreds of thousands of Cuban, Nicaraguan, Venezuelan, and Haitian nationals who are now currently illegally in the United States, saying they must leave the country and that their work permits have been revoked.\n\n“DHS is now notifying parole recipients [that] if they have not obtained lawful status to remain in the U.S., they must leave immediately,” the announcement stated."
    }
}