{
    "question": "In what ways might Israel’s strikes on Iranian nuclear and military sites in Tehran, and the reported killing of nuclear scientists and senior officers, affect regional stability and the prospects for diplomacy?",
    "content": {
        "source_1": "US President Donald Trump says not too late for Tehran to halt Israel’s bombing campaign by reaching a deal to halt its nuclear programme.\n\nThis live page is now closed.See herefor our latest news in real time.",
        "source_2": "We've moved our live coverage to a new page - but you cankeep up with the latest developmentsas tensions between Iran and Israel continue to rise\n\nEdited by Ayeshea Perera and Stuart Lau in Singapore, with Hugo Bachega, Sebastian Usher and Ione Wells reporting from Jerusalem and Tom Bennett from Tel Aviv\n\nIsrael Defense Forces say seven unmanned aerial vehicles (UAVs) have been launched toward Israeli territory in the past hour.\n\nThey add that the drones were intercepted by Israel's Air Force and the Israeli Navy.\n\nFootage shared by the IDF shows an explosion in the sky, which they say is the interception of a UAV.\n\nWe're moving our live coverage to a new page for technical reasons.You can continue to follow the latest developments here.\n\nWe have got updates on the Israeli air force's activities in Iran.\n\nOver the past hour, it has completed new strikes on \"storage and missile launch infrastructure sites\" in western Iran, the Israel Defense Forces says in a post on Telegram.\n\nThe post also includes what the IDF says is footage of the strikes. The footage has not been verified by the BBC.\n\nTensions between Iran and Israel have been escalating as the two countries have continued to launch attacks at each other throughout the night.\n\nIf you're just joining us, here's what happened in the last few hours:\n\nPresident Donald Trump says the US is not involved in the latest conflict between Israel and Iran.\n\n\"The U.S. had nothing to do with the attack on Iran, tonight,\" Trump has said in a post on Truth Social.\n\nIran has warned the US and its allies not to help Israel stop Tehran's retaliatory strikes.\n\n\"If we are attacked in any way, shape or form by Iran, the full strength and might of the U.S. Armed Forces will come down on you at levels never seen before,\" Trump adds. \"However, we can easily get a deal done between Iran and Israel, and end this bloody conflict!!!\"\n\nAs Israel and Iran launched new waves of attacks on each other late Saturday, here are the places that have been hit in Iran:\n\nIran's oil ministry said that Israeli strikes had targetedShahran oil depotandafuel tank in Tehran.The situation was under control at both of these sites, the ministry said.\n\nThe oil ministry also said thattwo major gas fieldsin the southern Bushehr province were attacked by Israel.\n\nIsraeli strikes also targeted the country'sdefence ministry in Tehran,slightly damaging one of the office buildings, as well as the ministry'sOrganization of Defensive Innovation and Research,according to Iranian media and the IDF.\n\nThese sites were targeted because of their association with Iran's nuclear weapons project, the IDF said.\n\nOn Saturday night, the IDF said Israel had also targeted anunderground site in western Iran\"used for storing and launching surface-to-surface missiles and cruise missiles\", and that \"the senior figures who visited it in the past were also eliminated\".\n\nHugo BachegaMiddle East correspondent, in Jerusalem\n\nFor a second night, sirens sounded across Israel, as air defences tried to intercept Iranian missiles.\n\nIn Tamra in the north of the country - a mainly Palestinian town - a house partially collapsed after being hit.\n\nHours later, in a second wave of attacks, a building in the central city of Bat Yam was badly damaged.\nAs morning broke, emergency teams were still searching for the missing.\n\nIn Iran, there were fresh Israeli airstrikes. The targets included the defence ministry headquarters in Tehran and sites that Israel says were linked to the countryâs nuclear programme, including an oil depot, in what appeared to be the first attack on Iranâs energy infrastructure.\n\nThe recent military escalation between Iran and Israel did not come as a total surprise.\n\nThe two regional powers have been engaged in a years-long shadow war - attacking each other's assets without admitting responsibility.\n\nSince the war in Gaza broke out, however, those attacks have stepped up. In September last year, Israel killed Hezbollah leader Hassan Nasrallah, followed in October with the killing of Hamas leader Yahya Sinwar, considered to be the architect of the 7 October attacks. These two groups are Iran's closest proxies in the region.\n\nTehran, for its part, launched more than 180 missiles at Israel last October, most of which intercepted.\n\nIsrael reacted with their own airstrikes - but over recent months, the military operations had subsided.\n\nIsrael has repeatedly said Iran poses an existential threat for its survival - while Iran's supreme leader has used phrases such as \"cancerous tumour\" to describe Israel.\n\nIsrael is worried Iran is attempting to develop nuclear weapons - and it says the target of the current operation is its military infrastructure, including nuclear infrastructure sites.\n\nIran denies building nuclear weapons - but many Western countries are not convinced. On Thursday, the UN's nuclear watchdog found Iran in breach of its non-proliferation obligations.\n\nWashington and Tehran were due to resumetalks on Iran's nuclear programmeon Sunday - but now, thetalks have been cancelled, according to mediator Oman.\n\nWe have just got an update from Magen David Adom (MDA), Israel's emergency service: Four people have been confirmed dead at the site of a strike in central Israel.\n\nThe four killed were a woman in her 60s, a woman in her 80s, a boy around 10 years old and a young girl.\n\nMeanwhile, the MDA says it is treating 99 injured people - four of whom in serious condition.\n\nMeanwhile, Israel has also launched strikes on Iran - though we have yet to get the casualty figures there. Iran has reportedly imposed widespread internet restrictions in the wake of the Israeli attacks.\n\nIran has launched strikes on central Israel, killing at least three people, according to Israel's emergency services.\n\nThese are the latest images of the aftermath in the Israeli cities of Bat Yam and Rehovot:\n\nRescuers are in Bat Yam assisting residents who have been injured in the strike\n\nThe Iranian attack also destroyed a building in Rehovot\n\nOver the last few hours we've been getting news about Iranian strikes against Israel. Just before that, the attack was in the opposite direction - with Israeli strikes deep inside Iran.\n\nIran's conversion plant in Isfahan, in central Iran, is one part of the country's enormous nuclear infrastructure, alongside mines and plants spread across other cities.\n\nAlso nearby issignificant Iranian military infrastructure, including a large air base and a major missile production complex.\n\nIn April 2024, Israeldamaged an air-defence system in Isfahan at an airfield.\n\nIran says the Isfahan facilities are used for purely peaceful purposes - but Israel and Western countrieshave long suspectedTehran of secretly using it to develop nuclear weapons.\n\nThis week's G7 summit in Canada will be dominated by war - only not one of those that the world leaders had expected.\n\nHigh on the agenda had been Russia's war against Ukraine and Donald Trump's tariff war against America's trading partners.\n\nInstead, the three-day gathering in the Rocky Mountains of Alberta will inevitably be focused on war in the Middle East.\n\nThe BBC's Diplomatic Correspondent James Landale hasthis reportfrom Alberta.\n\nMore from the Iranian strike in the city of Bat Yam, in the central Tel Aviv Metropolitan Area.\n\nA building appears to have been directly hit in the missile strike. We are seeing footage of first responders scrambling to rescue the wounded from the debris.\n\nIsrael's emergency services, the MDA, have confirmed that at least three people have been killed and around 100 injured in the attack.\n\nReports are trickling in of deaths from the fresh round of Iranian strikes on central and northern Israel. Here's where things stand now:\n\nThe situation on the ground remains very fluid. Please stay with us as we bring you the latest.\n\nThree people have died and more than 100 injured in an Iranian strike on a building in Bat Yam, just south of Tel Aviv, according to Israeli emergency services.\n\nThe BBC has not been able to independently verify this.\n\nAs we've been reporting, explosions have been heard in parts of central and northern Israel, amid fresh strikes from Iran.\n\nThese are the latest images coming out of the city of Tamra, in the North District of Israel.\n\nâThe constant message is de-escalate,â he told us. He is neither ruling in nor out the prospect of British jets helping Israel - as happened in both April and October last year.\n\nIran has warned the UK, France and the US that were they to support Israel, their ships and bases in the region would be regarded as legitimate targets.\n\nStarmer met the Canadian Prime Minister Mark Carney here last night for talks on security and trade. Both will head later to the Canadian province of Alberta for the G7 Summit. The Middle East is uppermost on the agenda.\n\nGerman Chancellor Friedrich Merz, French President Emmanuel Macron and US President Donald Trump are among those gathering there for three days of talks.\n\nIran has fired two waves of missiles into Israel overnight.\n\nOne strike killed at least five people when missiles hit a residential neighbourhood near Haifa in the north of country, according to multiple Israeli news outlets.\n\nAnother set of strikes near Tel Aviv killed a 60-year-old woman, according to the Israeli emergency service Magen David Adom (MDA). A further 20 people have been injured in the same area, as well as 24 people in the Judean Foothills, a spokesperson for the MDA added.\n\nThe BBC has not been able to independently verify these reports at this time.\n\nIt's just gone 04:00 in Israel and 04:30 in Iran and both countries have continued to exchange fire through the night.\n\nFor readers who are just tuning into our live coverage from Asia or elsewhere, here's the latest:\n\nThe Israel Defense Forces is now saying that residents in some parts of central and northern Israel are now \"permitted to leave protected spaces\".\n\nEarlier, the IDF said that residents must enter protected spaces upon receiving alerts and remain there until further notice.\n\nIt also says that search and rescue forces have been deployed to areas across the country where there have been reports of fallen projectiles.\n\nIsraeli police have said that they are at the scene of a strike helping to recover the wounded, and that there appear to have been at least two direct hits.\n\nThe IDF has urged residents in Israel to follow the instructions of the Home Front Command.\n\nIn a statement it said, \"At this time, the IAF is operating to intercept and strike where necessary to eliminate the threat.\nThe defense is not hermetic, therefore, it is essential to continue following the instructions of the Home Front Command\".",
        "source_3": "Click herefor live updates as tensions between Israel and Iran increase.\n\nIran has reportedly confirmed that its Fordow nuclear site was damaged, according to Reuters, which cited the semi-official ISNA news agency.\n\n\"There has been limited damage to some areas at the Fordow enrichment site,\" state atomic energy agency spokesperson Behrouz Kamalvandi said, according to Reuters. \"We had already moved a significant part of the equipment and materials out, and there was no extensive damage and there are no contamination concerns.\"\n\nIt is unclear whether this was a direct result of an Israeli strike, as an IDF official said on Saturday that Israel did not hit Fordow.\n\nLeft: REUTERS/Ronen Zvulun Right: Office of the Iranian Supreme Leader/WANA (West Asia News Agency)/Handout via Reuters\n\nIsraeli Defense Minister Israel Katz sent a stark warning toIran's Supreme LeaderAyatollah Ali Khamenei as tensions between their two nations continue to rise.\n\n\"The Iranian dictator is turning Iran’s citizens into hostages and creating a reality in which they — especially the residents of Tehran — will pay a heavy price for the criminal attacks against Israeli civilians. If Khamenei continues to fire missiles at Israel’s home front – Tehran will burn,\" Katz said following a situation assessment with IDF Chief of the General Staff Lt. Gen. Eyal Zamir and top IDF officials.\n\nElon Muskseemed to indicate that Starlink was made available to the people of Iran after reports of the country limiting internet access following Israeli airstrikes.\n\nDuring a Friday appearance on\"Hannity,\"Mark Levin, the host of\"Life, Liberty and Levin,\"called on Musk to \"turn on Starlink\" for the people of Iran. Levin then tweeted about the possibility of Musk turning on Starlink to which the Tesla founder replied, \"the beams are on.\"\n\nU.S. Ambassador to IsraelMike Huckabeewrote a post on X aimed at Americans who question the U.S.-Israel relationship. He explained that the number of Americans living in Israel is \"equivalent to a full House district.\"\n\n\"More Americans [live] here than in any other country except Mexico! Iran isn’t just attacking Israel but your fellow Americans who live here,\" Huckabee wrote.\n\nIsraeli Air Force chief Maj. Gen. Tomer Bar said Israel \"will continue to damage\"Iranian targets.\n\n\"After an active day in which we struck hundreds of targets, including dozens of surface-to-air targets, we conducted a series of precise strikes of operational and national significance which improved our aerial superiority and our freedom of activity in Iran,\" Bar said during a situational assessment following the strikes. \"For the first time since the beginning of the war, over 1,500 km from Israeli territory, the IAF struck defense arrays in the area of Tehran.\"\n\n\"We chose to take action against an existential threat to our civilians, with professionalism, determination, and precision.\"\n\nThe Israel Defense Forces (IDF) said previously that it expects the operation against Iran to last for a number of days following its historic preemptive attack.\n\nUK Prime MinisterKeir Starmerand Israel Prime Minister Benjamin Netanyahu spoke over the phone on Friday after Jerusalem launched a preemptive attack against Iran, according to 10 Downing Street.\n\n\"The Prime Minister was clear that Israel has a right to self-defense and set out the UK’s grave concerns about Iran’s nuclear program,\"Starmer's office saidin a statement. He also reportedly expressed the need for \"de-escalation and a diplomatic resolution.\"\n\nFormer U.S. Ambassador to the U.N. Nikki Haleysaid Israel's\"decisive action\" against Iran's \"nuclear capabilities\" made the U.S. and countries around the world safer.\n\n\"We have watched for too long the Iranian regime fund terrorist proxies, break all UN agreements, and build up their nuclear program,\" Haley claimed Friday on X.\n\n\"Their mantras have been 'Death to America' and 'Death to Israel,'\" she continued. \"Israel took decisive action to put an end to Iran’s nuclear capabilities and made America and the world safer. We owe them a debt of gratitude.\"\n\nHaley added: \"We should continue to pray for a better life for the Iranian people away from this terrorist regime.\"\n\nU.S. Agency for Global Media (USAGM) senior advisor Kari Lake confirmed that Voice of America’s (VOA) Persian news service is ramping up coverage as tensions between Iran and Israel intensify.\n\n\"History is being made, and VOA Persian news service is rising to the occasion to cover it,\" Lake said Friday in anexclusive statement to Fox News Digital.\n\n\"Farsi language is a statutorily required for USAGM. We are ramping up — as we’ve always planned to do — to meet this historic moment,\" she continued. \"Everyone who is being called back has been on paid administrative leave, so they are simply being called back into the office to cover this historic moment in Iran.\"\n\n\"VOA Persian news service is, very appropriately, covering one of the most consequential moments in Iran’s history,\" she concluded.\n\nLake’s remarks follow the recall of approximately 75 Farsi-speaking staffers, including dozens of journalists, from administrative leave, according to The Washington Post. Most are returning to cover the escalating conflict, which began with Israel’s precision strike on Iranian nuclear sites and was followed by Iran’s missile barrage on Israeli cities.\n\nThe move comes after months of cost-cutting at the government-funded VOA and USAGM.\n\nThis is an excerpt from an article by Fox News' Jasmine Baehr.\n\nAt least two people have been killed following four rounds of Iranian missile strikes into Israel.\n\nAn Israeli woman who was critically wounded by Iranian missiles died from her wounds she sustained in attacks late Friday in Tel Aviv, the Jerusalem Post reported, and another person was killed after a fourth wave of strikes decimated a residential area at dawn Saturday in central Israel.\n\nIn addition, several homes in Tel Aviv were reportedly damaged by Iranianballistic missilesas first responders searched for survivors.\n\nIran launched missile strikes targeting various parts of Israel on Friday night and early Saturday morning.\n\nImages posted online showed homes destroyed and others with partial damage.\n\nMagen David Adom, Israel's national EMS, said it was treating and evacuating 21 people after a rocket strike into a residential area in the country's coastal plain.\n\nChina's permanent representative to the U.N., Fu Cong, said Friday that Beijing condemns Israel's \"violations of Iran's sovereignty, security and territorial integrity\" and \"opposes intensifying conflicts and expanding conflicts.\"\n\nSpeaking at an emergency U.N. Security Council meeting, Fu said China is \"deeply concerned about the serious consequences that the relevant Israeli actions may entail,\" emphasizing that an escalation in the region would not be in anyone's interest.\n\n\"Weurge Israelto immediately cease all military adventures and avoid any further escalation of tensions, and call on all parties concerned to abide by the Charter of the United Nations and international law, resolve their disputes through political and diplomatic means and jointly maintain peace and stability in the region,\" Fu said.\n\nChina is \"seriously concerned\" about the negative impact of current developments on diplomatic negotiations on the Iranian nuclear issue, Fu said, adding that China has \"always been committed to a peaceful settlement of the Iranian nuclear issue through dialogue and negotiation, and opposes the application of force and illegal unilateral sanctions, as well as armed attacks on peaceful nuclear facilities.\"\n\n\"Iran's right to peaceful uses of nuclear energy as a party to the Treaty on the Non-Proliferation of Nuclear Weapons should be fully respected,\" he continued.\n\nIran's Foreign Ministry argued thatIsrael's offensivesabotaged diplomacy talks with U.S. officials, claiming that the negotiations are now \"meaningless.\"\n\nForeign Ministry spokesman Esmail Baghai said \"the other side acted in a way that rendered dialogue meaningless,\" according to state media.\n\n\"One cannot claim to pursue negotiations while simultaneously allowing a genocidal regime to target Iran’s territorial integrity,\" he said.\n\nThe spokesperson also said it is \"unimaginable\" that Israel would carry out these attacks without U.S. approval.\n\n\"Israel’s wish has always been to entangle Western parties in crisis, and this time, it seems, it has again succeeded in derailing diplomacy,\" he said.\n\nSenator Mark Kelly reiterated his stance on the Israel-Iran tensions on June 13, 2025, urging both countries to de-escalate their military actions. (Eric Lee/Bloomberg via Getty Images)\n\nSen. Mark Kelly, D-Ariz., on Friday warned that the region is in a “dangerous moment” of possible escalation following Israel’s attack on Iran and Iran’s retaliatory strikes.\n\n“It’s unacceptable for Iran to have a nuclear weapon,” the senator began in a statement posted to X. “President Trump killing the Iran nuclear agreement accelerated Iran’s development towards a bomb.”\n\nThe former Navy pilot added that while Israel “has a right to defend itself,” he still hopes for a diplomatic solution.\n\n“While no one should grieve the death of Iranian commanders who have directed terrorism and killed innocent people, this is a dangerous moment and I am concerned about escalation in the region that could endanger American citizens, troops, and our interests.”\n\nHe added, “As we support Israel and their people from Iran’s response, everyone needs to be focused on de-escalation.”\n\nAn explosion caused by a projectile strike illuminates the skyline in Tel Aviv, Israel, early Saturday, June 14, 2025. (AP Photo/Leo Correa)\n\nIsrael is being warned of a fourth round of missiles launched from Iran.\n\n“Alerts were activated in several areas of the country following the discovery of missiles launched from Iran into the territory of the State of Israel,” the Israel Defense Forces wrote on X.\n\n“The public is asked to obey the Home Front Command's instructions,\" the IDF said. \"At this time, the Air Force is working to intercept and attack wherever necessary to eliminate the threat. The defense is not hermetic, and therefore the Home Front Command's instructions must continue to be followed.”\n\nIran has launched multiple strikes against Israel over the past 24 hours in retaliation for an Israeli strike targeting a nuclear facility.\n\nThe Islamic Republic claimed the Israeli strike killed at least 78 people injured more than 320 others were injured.\n\nPresidentDonald Trumpjoked on Friday morning about the fate of Iranian officials in the wake of Israel’s recent airstrike, according to CNN's Dana Bash.\n\nBash spoke on Friday about her phone call with Trump, where she asked him about Secretary of State Marco Rubio’s initial statement about Israel’s strikes, which did not explicitly say that the U.S. supported them.\n\n\"We, of course, support Israel, obviously, and supported it like nobody has ever supported it,\" Trump said, according to Bash. \"It was a very successful attack. Iran should have listened to me when I said - you know, I gave them, I don‘t know if you know, but I gave them a 60-day warning. And today is day 61.\"\n\n\"They should now come to the table to make a deal before it's too late. It will be too late for them. You know, the people I was dealing with are dead,\" he added, though he wouldn't give specific names, only that the \"hardliners\" were dead.\n\n\"This is as a result of the attack last night?\" Bash asked him.\n\n\"Yeah. They didn’t die of the flu. They didn’t die of COVID,\" Bash described him saying \"quite sarcastically.\"\n\nThis post features a excerpt of an article by Alexander Hall.\n\nA projectile strike hits a building in Tel Aviv, Israel, early Saturday, June 14, 2025. (AP Photo/Leo Correa)\n\nIran on Friday warned that U.S. bases in the Middle East are within its reach, following Israeli strikes on Iranian nuclear and military sites that killed top officials.\n\nThe U.N. Mission to Iran issued a letter to the U.N. Security Council, saying the U.S., as a “backer” of Israel, “shall be held fully accountable.”\n\nThe letter condemned what it called a “serious threat to international security” after the strikes killed “four military commanders, one Iranian official allegedly involved in the nuclear talks with the U.S., and two nuclear scientists.”\n\nEarlier this week, ahead of a now-cancelled meeting between the U.S. and Iran in Oman, Iranian Defense Minister Aziz Nasirzadeh said: “If a conflict is imposed on us … all U.S. bases are within our reach, and we will boldly target them in host countries.”\n\nThe Trump administration announced a partial evacuation of the U.S. embassy in Iraq and authorized military dependents to leave certain locations in the region.\n\nPresident Trump told reporters: “We have a lot of American people in this area. And I said, we got to tell them to get out because something could happen soon, and I don't want to be the one that didn't give any warning and missiles are flying into their buildings.”\n\nAccording to October 2024 Defense Department figures, about 40,000 U.S. service members are stationed across the Middle East. The U.S. operates at least 19 sites in countries including Bahrain, Iraq, Israel, Jordan, Kuwait, Qatar, Saudi Arabia, Syria, and the UAE, eight of which are permanent.\n\nIran analyst Behnam Ben Taleblu of the Foundation for Defense of Democracies said: “Given the fact that in January 2020, Iran launched short-range, precision strike ballistic missiles at U.S. bases in Iraq for killing Qasem Soleimani… this is not a theoretical exercise.”\n\n“There is a political element to the regime continuously threatening America… to put as much daylight between America and Israel as possible.”\n\nFox News Digital's Caitlin McFall contributed to this report.\n\nCNN political contributor and Trump supporter Scott Jennings was stuck in Israel following Iran’s retaliatory attacks on Friday.\n\n“There have been a few surprises that I didn’t anticipate during my trip to Israel, to say the least,” Jennings, who shared with his X followers on Monday that he would be off TV for a week due to a trip to Israel, wrote on X early Saturday local time.\n\n“President Trump told Iran they had 60 days to make a deal. They didn't listen. Now they're paying the price,” he wrote earlier in a separate post. “What's incredible is that the US and Israel actively planned for this scenario of non-compliance. What they pulled off is miraculous.”\n\nJennings also posted several videos from his hotel on the Sea of Galilee of missile intercepts.\n\nFollowing Israel’s airstrikes on Iran early Friday, he wrote, “Quick update: not much has happened since my last updates. Skies are quiet & we are waiting to see if Iranian drones actually reach Israel. Don't think I am getting out of Israel today! But will continue to report on what I see and hear.”\n\nSen.Lindsey Graham, R-S.C., called for the president to go \"all-in\" for Israel should a diplomatic end to the conflict with Iran not be met.\n\nEarlier in the day, President Donald Trump called on Iranian leaders to return to the negotiating table to strike a nuclear deal to avoid \"even more brutal\" attacks.\n\nGraham lauded Trump’s desire to bring Iran back to the table but countered that \"if Iran refuses this offer, I strongly believe it is in America’s national security interest to go all-in to help Israel finish the job.\"\n\n\"One of the benefits of this approach is that it would substantially undo the damage done to our reputation by Biden’s disastrous withdrawal from Afghanistan,\" Graham said on X.\n\n\"If diplomacy fails, going all-in for Israel shows that America is back as a reliable ally and a strong force against oppression. It would strengthen our hand in all corners of the world, as well as all other conflicts we face.\"\n\nThis post features an excerpt from an article by Alex Miller.\n\nIranian ballistic missiles struck Israel’s military headquarters, known as the Kiryat, the country’s version of the Pentagon, in a direct hit during a major escalation in the conflict between Iran and Israel.\n\n“This is Israel's version of the Pentagon, the Kiryat. And the building on this compound was just hit,” reported Fox News chief foreign correspondent Trey Yingst, live from Tel Aviv.\n\n“There is significant damage.”The strike was part of a massive Iranian response to Israeli attacks on nuclear facilities and top IRGC leadership.\n\n“Around 150 Iranian ballistic missiles targeting this country throughout the evening,” Yingst said. “They are targeting not only residential areas, they are targeting military installations.”\n\nFox News witnessed the aftermath at multiple impact sites. “An entire block nearly completely destroyed, wiped off the map,” Yingst said. “Rescue crews were digging through the rubble… trying to pick up heat signatures of possible bodies.”\n\nYingst and his crew were forced to shelter underground as missile sirens sounded. “We had to run to an apartment building… One of [the explosions] was so loud it shook the building we were in.”\n\nDespite active Israeli and U.S. missile defense systems including Iron Dome, David’s Sling, Arrow, Patriot, and THAAD, missiles still got through.\n\n“It is not enough to stop this incoming fire,” Yingst said. “We saw missiles slamming into the ground, causing significant damage and killing at least one person.”\n\nHe added, “These ballistic missiles make the rockets that were being fired from Gaza look like toys.”\n\nIsraeli officials say more strikes are likely. “This country remains at a state of alert, a state of emergency,” Yingst reported. “And this is just the beginning of what is a quickly developing war between Israel and Iran.”\n\nUnited Nations Secretary General Antonio Guterres urges calm following the exchange of military strikes between Israel and Iran on June 13, 2025. (LUDOVIC MARIN/AFP via Getty Images)\n\nAntónio Guterres, the secretary-general of theUnited Nations, implored both sides of the Israel-Iran conflict to find a peaceful solution.\n\n“Israeli bombardment of Iranian nuclear sites. Iranian missile strikes in Tel Aviv,” he wrote on X as Iranian missiles targeted Tel Aviv. “Enough escalation. Time to stop. Peace and diplomacy must prevail.”\n\nGuterres has been critical of Israel amid its war against Hamas, which started the current conflict on Oct. 7, 2023.\n\nIsrael has criticized the U.N. for not forcefully coming out against Hamas\n\nPeople seek shelter as sirens sound during a missile strike in Ramat Gan, near Tel Aviv, on June 13, 2025. (Ilia Yefimovich/picture alliance via Getty Images)\n\nA new poll shows that more Americans support than oppose Israeli airstrikes on Iran’s nuclear sites if diplomacy fails.\n\nThe survey, released by the Ronald Reagan Institute, was conducted before Israel launched its major strike on Iran early Friday, known as Operation Rising Lion.\n\nAccording to the poll, 45% of Americans said they would back Israeli airstrikes if talks with Iran break down. Thirty-seven percent said they were against the strikes, and 18% said they weren’t sure.\n\nThe results show a clear split between political parties. 60% of Republicans support the strikes, compared to 35% of independents and 32% of Democrats.\n\nJust over half of Democrats oppose the strikes, along with a third of independents and 27% of Republicans.\n\nThe poll also found that most Americans see Israel’s security as important to the U.S., even if they don’t agree on how to support it.\n\nThe survey was conducted between May 22 and June 2, before Israel struck Iran’s nuclear and military targets.\n\nFox News’ Paul Steinhauser contributed to this report.\n\nAn X account created to track the busyness ofpizza shopscould have predicted a major international event.\n\nThe Pentagon Pizza Report tracks the real-time foot traffic at pizza spots near the Pentagon, hinting at officials working late at the government building, which may suggest potential conflict.\n\nHours before Israel launched \"Operation Rising Lion,\" the account posted the activity of four pizza shops, captioning the post, \"Most pizza establishments near the Pentagon are currently experiencing average traffic as of about 3:05pm ET.\"\n\nThe strikes took place late Thursday evening as the Pentagon Pizza Report monitored pizza shops in the Arlington, Virginia, area.\n\nThe account continued posting updates about the closest and second-closest Domino's to the Pentagon leading up to and following the airstrikes.\n\nA post at 8:57 p.m. reported that the location had \"surged in traffic.\"\n\nThis post features an excerpt of an article by Ashley J. DiMella.\n\nTwo Israeli first responders suffered minor injuries on Friday when an MDA Mobile Intensive Care Unit was hit by shrapnel following Iran’s retaliatory missile strike on Israel, an MDA, Israel’s emergency services, spokesperson said.\n\nThe two women were wearing protective gear and suffered minor injuries from glass shards.\n\nThey were treated at the scene and didn’t need to be hospitalized.\n\nAn Israeli naval ship took out 5Iranian droneslaunched from the Islamic Republic, authorities said Saturday.\n\nA video posted by the Israel Defense Forces shows two drones being intercepted and blasted out of the sky.\n\nSeparately, an Israeli air force helicopter took down a drone earlier in the day, Israel said. @rick.eggleston\n\nAn Iranian missile strike Friday night hit cities across Israel, causing serious damage, dozens of injuries and at least one death.\n\nFox News chief foreign correspondent Trey Yingst, reporting live from the scene, described a heavily damaged neighborhood near Israel’s military headquarters, the Kiryat.\n\nHe said emergency crews were rushing into buildings to search for people who might still be trapped. Glass covered the sidewalks, and some building floors were either flooded or destroyed.\n\n“One floor was flooded and another completely exploded,” Yingst reported, after speaking with a woman named Noya who was in the building during the blast. She said the explosion was so powerful it shook the entire building, injuring people and leaving parts of it burned and flooded.\n\nAccording to Magen David Adom (MDA), 34 people were injured in the strikes. A woman in her 60s was critically hurt. A man in his 60s was seriously injured. A man and a woman in their 50s were moderately wounded. Another 30 people had light injuries from the blast and falling debris. Thirteen more were treated for anxiety. All were taken to hospitals.\n\nMDA paramedic Harel Sasson said one woman, around 70 years old, was found under rubble in critical condition and was given CPR during evacuation. He also treated a man with shrapnel wounds to the face and a woman with moderate shrapnel injuries.\n\nOther lightly injured people were also evacuated. Sasson said MDA teams are still on the scene assisting search efforts.\n\nSimcha Simandayev, director of an MDA Station, said a man with head injuries, burns, and smoke inhalation was treated and taken to the hospital in moderate condition. Others with minor injuries were also treated and evacuated.\n\nIn a separate rocket impact site, Israeli police confirmed that one person was killed and 20 more were injured.\n\nCaitlyn Jenner was pictured sipping wine while sheltering amid retaliatory strikesby Iranduring her visit to Israel.\n\nJenner, who went to Israel for the Tel Aviv Pride Parade, according to the Times of Israel, was pictured drinking a glass of wine in a bomb shelter with an Israeli influencer as Iranian missiles rained down.\n\n“Quiet’ night in Tel Aviv. Pray for us all. We will prevail. I am happy to stand with Israel today, now more than ever,\" Jenner wrote on X with an image showing missiles above the sky in Tel Aviv.\n\nThe pride parade was canceled due to the ongoing conflict with Iran.\n\nSen. Chuck Schumer speaking at the U.S. Capitol. (Photo by Kayla Bartkowski/Getty Images)\n\nSenate Democratic Leader Chuck Schumer, D- N.Y., on Friday said that the United States’ support for Israel’s defense must be “ironclad” as Iran retaliates against Israel with missile strikes.\n\n“I have been briefed on events in the Middle East and am closely tracking developments,” Schumer said in a statement. “I am praying for the safety of American citizens and servicemembers in the region and for enduring stability and security in the region.”\n\nHe added, “The United States’ commitment to Israel’s security and defense must be ironclad as they prepare for Iran’s response.”\n\nNoting that the Iranian regime's stated policy has been to destroy Israel, he added, “I have long said that Israel has a right to defend itself and that Iran cannot have a nuclear weapon,” which he said needs to be a top national security priority.\n\nHe said every effort should be made to reach a diplomatic solution with Iran.\n\nSchumer continued, “As the world’s leading state sponsor of terrorism, the Iranian regime has sought to expand its influence in the Middle East, exporting terror and violence across the region. In fact, Iran was just censured at the International Atomic Energy Agency for systematically deceiving the world about its nuclear program. I will continue to stay in close touch with officials as events unfold.”\n\nIsrael's air defense system fire to intercepts projectiles launched from Iran, as seen in Ramat Gan, near Tel Aviv, Israel on Friday, June 13, 2025. (AP Photo/Oded Balilty)\n\nIran has launched anotherwave of missilesaimed toward Israel, the Israel Defense Forces said.\n\nSources tell Fox News that Iran has fired 50 ballistic missiles at Israel during this latest salvo.\n\n\"The IDF identified that missiles were recently launched from Iran towards the territory of the State of Israel,\" the IDF wrote on X. \"The defense systems are working to intercept the threat.\"\n\nIsrael was working to intercept the missiles as Iran continues retaliatory strikes.\n\nFox News' Jennifer Griffin contributed to this report.\n\nMcCoy Pitt, Senior Bureau Official of the Bureau of International Organization Affairs, speaks during a UN Security Council meeting on June 13, 2025, in New York City. Pitt said Israel told the U.S. about the attack ahead of time, explaining it was necessary for their self-defense. (Michael M. Santiago/Getty Images)\n\nThe United States at a Friday emergency meeting of the United Nations Security Council warned Iran not to target Americans, American bases or other infrastructure following its retaliatory strikes on Israel.\n\nMcCoy Pitt, of the Senior Bureau Official of the Bureau of International Organization Affairs, said that Israel told the U.S. about the attack ahead of time – Israel explained it was necessary for their self-defense – but the U.S. was not involved militarily.\n\n“Every sovereign nation has the right to defend itself and Israel is no exception,” he added. “Our absolute, foremost priority is the protection of U.S. citizens, personnel, and forces in the region.”\n\nReiterating Secretary of State Marco Rubio, he said, “Iran should not target U.S. interests or personnel. Let me be crystal clear: no government, proxy, or independent actor should target American citizens, American bases, or other American infrastructure in the region. The consequences for Iran would be dire.”\n\nHe added that U.S. President Donald Trump has said: “The violence should come to an end, and Iran should make a deal so that there is ‘no more death, no more destruction.’”\n\nSen. Bernie Sanders, I-Vt., blasted Israeli Prime Minister Benjamin Netanyahu on Friday over Israel launching airstrikes on Iran nuclear sites.\n\n“The world is more dangerous and unstable as a result of the extremist Netanyahu’s government ongoing defiance of international law,” Sanders said in a statement.\n\nSanders accused Netanyahu of using the “starvation of children in Gaza as a tool of war” before launching an “illegal unilateral attack on Iran” that he said “risks a full-blown regional war.”\n\nHe continued, “These strikes also directly contravened the express wishes of the United States, which was seeking a diplomatic resolution to the long-standing tensions around Iran’s nuclear program.\n\nTalks were planned for Sunday, but Netanyahu chose instead to launch an attack.”\n\nHe said the U.S. must be clear that the country won’t be “dragged into another Netanyahu war.\n\nAlong with the international community we should do everything possible to prevent an escalation of this conflict and bring the warring parties to the negotiating table.”\n\nSailors man the rail as the Arleigh Burke-class guided-missile destroyer USS Arleigh Burke (DDG 51) returns to Naval Station Rota, May 29, 2024. Arleigh Burke, forward-deployed to Rota, is on a scheduled patrol in the U.S. Sixth Fleet area of operations in support of U.S. national security interests in Europe and Africa (U.S. Navy photo by Courtney Pollock)\n\nThe U.S. Navy has several warships positioned across the Middle East as tensions rise in the region.\n\nTwo guided-missile destroyers, the USS Sullivans and USS Arleigh Burke, are in the Eastern Mediterranean. They were already there on scheduled deployments and remain under U.S. European Command.\n\nA third ship, the USS Thomas Hudner, is now on its way to join them.\n\nThese are Burke-class destroyers, among the most advanced in the U.S. fleet. They’re equipped with the Aegis system, which can detect and shoot down incoming missiles.\n\nU.S. Navy ships like these are now being used to help defend Israel as it comes under missile attack from Iran.\n\nOther U.S. ships are stationed nearby. In the Red Sea, the USS Forrest Sherman and USS Truxton are currently deployed. In the Arabian Sea, the USS Carl Vinson aircraft carrier is operating along with four more ships: the USS Milius, USS Sterett, USS Wayne E. Meyer (all destroyers), and the USS Princeton, a guided-missile cruiser.\n\nIsraeli troops and first responders gather in an area hit by a missile fired from Iran, in Ramat Gan near Tel Aviv on Friday.\n\nA Democratic California congressman on Friday accused Iran of “cowardice” following its retaliatory strike on Israel.\n\n“#Israel’s strike on #Iran was targeted precisely at senior Iranian military commanders and military sites that posed an existential threat to Israel,” Rep. Brad Sherman, D-Calif., wrote on X Friday afternoon. “The Islamic Republic’s response? To target civilian centers in #TelAviv. Unsurprising cowardice from a regime that has spent decades brutalizing its own people.”\n\nIran’s strike on Tel Aviv, which injured at least five people, came hours after Israel launched airstrikes on Iranian nuclear sites.\n\nThe Israel Defense Forces (IDF) confirmed that in the past hour, “two barrages of surface-to-surface missiles were launched from Iran toward Israeli territory.”\n\nAccording to IDF Spokesperson Brig. Gen. Effie Defrin, “fewer than 100 missiles were fired. Most were intercepted by air defense systems or failed to reach their targets.” He added, “There are a few impacts on buildings, some caused by interception debris.”\n\nDefrin stressed the importance of following safety measures, stating: “Your responsibility on the home front saves lives. This evening again demonstrated the importance of adhering to safety guidelines. I ask you to continue doing so — it saves lives.”\n\nHe also urged the public not to share videos or photos of impact sites, warning, “The enemy monitors such footage to improve its targeting.”\n\n“This is yet another indication of the necessity of the operation, whose goal is to remove the threat,” Defrin said. “We will not allow Iran to grow stronger and produce quantities of missiles that could pose an existential threat to the State of Israel.”\n\nHe concluded by noting that the IDF continues to assess the situation and is “prepared to continue to operate as necessary.”\n\nIn a separate statement, the IDF said it struck Iranian military targets earlier Friday, including the Hamadan and Tabriz air force bases in western Iran.\n\n“The ‘Tabriz’ base was dismantled as a result of the strike,” the IDF reported.\n\nAdditionally, “dozens of targets belonging to the Iranian Regime's Aerial Defense Array, UAVs, and surface-to-surface missile launchers” were struck and dismantled.\n\nThe IDF stated, “The State of Israel has the obligation to defend its civilians and will continue to do so wherever necessary, as it has done before.”\n\nThe IDF stressed that it is “continuously conducting situational assessments” and “will continue to update on developments.”\n\nIsraeli Defense Minister Israel Katz has issued a sharp warning to Iran following its large-scale ballistic missile assault on Israeli cities, declaring that Tehran has \"crossed red lines.\"\n\n“Iran crossed red lines when it dared to fire missiles at civilian population centers in Israel,” Katz said in a statement translated from Hebrew.\n\nThe remarks follow multiple waves of Iranian missile launches, with confirmed impacts near major Israeli cities including Tel Aviv.\n\nIsrael’s air defenses intercepted many of the projectiles, but several reached civilian areas, prompting emergency responses.\n\n“We will continue to defend the citizens of Israel and ensure that the Ayatollah regime pays a very heavy price for its heinous actions,” Katz added.\n\nIsraeli Prime Minister Benjamin Netanyahu has described Operation Rising Lion as \"one of the greatest military operations in history,\" aimed at dismantling the Islamic Republic of Iran’s nuclear and ballistic missile threat.\n\n“To the proud people of Iran,” Netanyahu said, “we are in the midst of one of the greatest military operations in history, Operation Rising Lion.” He continued, “The Islamic regime, which has oppressed you for almost 50 years, threatens to destroy our country, the State of Israel. The objective of Israel's operation is to thwart the Islamic regime's nuclear and ballistic missile threat to us. As we achieve our objective we are also clearing the path for you to achieve your freedom.”\n\n“In the past 24 hours, we have taken out top military commanders, senior nuclear scientists, the Islamic regime's most significant enrichment facility and a large portion of its ballistic missile arsenal. More is on the way,” he added. “The regime does not know what hit them, or what will hit them. It has never been weaker.”\n\nNetanyahu emphasized that Israel's actions target the regime, not the people of Iran: “Our fight is against the murderous Islamic regime that oppresses and impoverishes you... The nation of Iran and the nation of Israel have been friends since the days of Cyrus the Great.”\n\n“This is your opportunity to stand up and let your voices be heard. Woman, Life, Freedom — Zan, Zendegi, Azadi.” He concluded, “Mar-do-me sh-ja-ee Iran, noor bar tariki piruz ast. Brave people of Iran, light defeats the darkness.”\n\nThe US Navy guided missile destroyer USS The Sullivans docks at Larnaca port amid rising tensions in the Middle East. Cyprus, Friday, December 6, 2024. (Photo by Danil Shamkin/NurPhoto via Getty Images)\n\nSenior U.S. officials tell Fox News that American forces are assisting Israel to shoot down Iranian missiles.\n\n\"There are hundreds of thousands of American citizens and other American assets in Israel and the U.S. is working to protect them,\" the official said in a statement.\n\nFox News chief national security correspondent Jennifer Griffin reported that there are two U.S. Navy destroyers, the USS Sullivans and USS Arleigh Burke, in the Eastern Mediterranean.\n\nA regional security source tells Fox News the third wave of Iranian missile launches is now complete.\n\nOfficials tell Fox News that the U.S. Army assisting in shooting down incoming Iranian missiles with Patriot Pac-3 missiles and with Thaad.\n\nMagen David Adom emergency teams respond to missile attacks from Iran in the Tel Aviv area on Friday, June 13. Courtesy of Magen David Adom\n\nFollowing Red Alert sirens across Israel, missile impacts have caused damage and injuries in the greater Tel Aviv area tonight.\n\nAccording to Magen David Adom (MDA), emergency teams are treating five individuals wounded by shrapnel: one in moderate condition, four lightly injured.\n\nAll have been evacuated to hospitals. Additionally, four people suffering from acute anxiety have been treated on the scene.\n\nImages from the scene show shattered vehicles, scorched streets, and emergency teams operating under floodlights amid the debris of damaged residential buildings.\n\nOne video shows responders rushing into action as more sirens wail in the distance.\n\nThis comes amid Iran’s ongoing “True Promise 3” missile campaign against Israel.\n\nFox News chief foreign correspondent Trey Yingst was forced to take cover live on air as missiles fired from Iran slammed toward Tel Aviv.\n\nReporting amid the chaos, Yingst urgently directed his crew: “Okay, there’s just a massive amount of fire coming to Tel Aviv right now... All right, let’s go. Time to go.”\n\nYingst reported seeing interceptor rounds coming off the sea and lighting up the skyline: “This is likely Israel's Arrow Defense System, or David’s Sling... a very fluid situation.”\n\nReporting from one of Israel’s most densely populated cities, Yingst and his crew ducked for safety as explosions rocked the area around them.\n\nHe noted, “I have reported here for nearly seven years and never seen such an attack against an Israeli city... The amount of air defense going off—it's unprecedented.”\n\nWhile interceptors were active in all directions, he confirmed: “Some of this is not being intercepted. We just saw one of the missiles.” Smoke was seen rising from central Tel Aviv. “There’s an impact site very close to here. Just stay with us.”\n\nRegional sources told Fox’s Jennifer Griffin that Iran launched about 100 ballistic missiles: 5 to 7 reportedly breached Israel’s missile defense.\n\nAs explosions rocked the city, Yingst shouted, “Guys come on—everyone move, everyone move now… stay with us, stay with this, pick up the gear, let’s go.”\n\nYingst added that Israeli officials had warned of this attack in advance and cut short briefings as missiles launched. “Dozens of Iranian ballistic missiles are en route to Israel,” he reported, citing direct military sources.\n\nHe confirmed that some had slipped past defenses: “We could see ballistic missiles slamming into the ground.”“This is a direct attack on Tel Aviv, Israel’s second-largest city,” Yingst said.\n\n“The Iranians are targeting major population centers in response to the operation that took out top IRGC officials.” He added, “What we’re looking at right now is the big conflict that everyone discussed for decades... Israel versus Iran.”\n\nIsraeli Iron Dome air defense system fires to intercept missiles over Tel Aviv, Israel, Friday, June 13, 2025. (AP Photo/Leo Correa)\n\nThe Israel Defense Forces (IDF) have confirmed that a short while ago, missiles were launched from Iran toward Israeli territory.\n\nDefense systems are actively intercepting the threat. Authorities have issued an urgent directive: all civilians must enter a protected space immediately and remain there until further notice.\n\nAccording to Iranian state media, Iran is calling its ongoing retaliatory strikes against Israel operation “True Promise 3.\"\n\nIDF has urged those in Israel to not leave shelter unless explicitly instructed by official sources.\n\nPresidentDonald Trumptold Fox News’ Bret Baier on Friday that “The Iranians were hit ten times worse than they thought they would be.”\n\n“They weren’t ready to negotiate. I think they may be now.  We’ll see,” Trump said regarding the future of Iran’s nuclear program.\n\nSenior U.S. officials told Fox News that a long list of nuclear scientists and military leaders were targeted by Israel’s surprise airstrikes Friday.\n\nThe officials added that 90% of Iran’s top nuclear scientists as well as other senior military officers and other Iranian leaders may have been targeted in the strikes.\n\nOffice of the Iranian Supreme Leader/WANA (West Asia News Agency)/Handout via REUTERS\n\nIran's Supreme Leader Ayatollah Ali Khamenei said in a statement on Friday that Tehran wouldbring Israel \"to ruin\"after Jerusalem launched its preemptive attack.\n\n\"The armed forces will bring the vile regime to ruin. They will not escape unscathed from this crime. The Iranian nation can be assured—there will be no negligence,\" Khamenei said in a statement provided to Fox News by an Iranian official.\n\nThe IDF has released an animated video showing how its attack on Iran played out.\n\nEarly Friday morning local time, Israel began its preemptive strikes targeting nuclear facilities andtop Iranian military officials.According to a senior Israeli security official, the Mossad carried out several covert actions inside Iran to prepare for Israel's Operation Rising Lion.\n\nIsrael’s overnight strike on Iran was not only one of the most ambitious aerial campaigns in recent history, it was the result of years of covert planning, surveillance and infiltration byIsraeli intelligence.\n\nWhile dozens of fighter jets bombed nuclear and military targets across Iran early Friday morning, the groundwork had long been laid by Mossad agents working in lockstep with the Israeli military.\n\nCode-named \"Am Kelavi\" (Rising Lion), the preemptive operation was the product of unprecedented coordination between the Israeli air force, the Military Intelligence Directorate, Mossad and the country’s defense industries. For years, they worked \"shoulder to shoulder\" to gather the intelligence files needed to eliminate Iran’s most sensitive military and nuclear assets.\n\nA general view shows the mostly empty streets near Tel Aviv's beachfront on Friday, June 13, 2025. (AP/Leo Correa)\n\nTheIsrael Defense Forcessaid Friday that “The Home Front Command has now instructed residents across the country to remain close to protected spaces.”\n\nThe warning comes over concerns about retaliation from Iran in the wake of Israel’s airstrikes on top Iranian military leaders and its nuclear facilities.\n\n“Movement in public areas should be minimized, and public gatherings must be avoided,” the IDF said. “Upon receiving an alert, enter a protected space and remain there until an official update is issued.”\n\nIsrael’s military said earlier Friday that it intercepted drones launched fromIran.\n\nA Delta Air Lines Airbus A330-300 aircraft is seen landing at Israel's Ben Gurion International Airport in August 2020. (Jack Guez/AFP via Getty Images)\n\nDelta announced Fridayit’s suspending flights from New York to Israel for most of the summer due to escalating tensions between Israel and Iran.\n\n“Delta has paused flights to Tel Aviv (TLV) from New York-JFK through August 31 in response to the ongoing conflict in the region,” the major U.S. airline said in a statement. “Customers impacted by flight cancellations will receive notifications via the Fly Delta app and contact information listed in their reservation as these cancellations are processed in Delta’s system and may contact Delta or their travel agent for rebooking options.”\n\n“The safety of our customers and crew remains our top priority. Delta is continuously monitoring the evolving security environment and assessing our operations based on security guidance and intelligence reports,” the airline also said.\n\nAs of Friday afternoon, the skies over Israel, Jordan, Iraq and Iran are devoid of air traffic following theclosure of their airspaces.\n\nA missilefrom Yemenfell \"in the area of Hebron,\" but no interceptors were launched, according to the IDF.\n\nThe IDF announced on Friday that sirens were sounding across the country after it identified a missile launched from Yemen at Israeli territory.\n\nIranian Foreign MinisterAbbas Araghchi wrote a letter to International Atomic Energy Agency Director General Rafael Mariano Grossi on Friday asking for “explicit condemnation” of Israel's “aggression against Iran's nuclear facilities.\"\n\n“In his letter, while emphasizing Iran's decision to take special measures to protect nuclear equipment and materials, Araghchi stated that the Islamic Republic of Iran will deliver a decisive response to the act of aggression,” Iran's foreign ministry said. “He further called for immediate action by the director general to convene an emergency meeting of the IAEA Board of Governors to address the situation.”\n\nThe development comes after Grossi called Israeli President Isaac Herzog on Friday, an Israeli presidential spokesperson told Fox News.Grossi told Herzog that Iran’s Natanz nuclear facility was severely damaged in the strikes, according to Israeli media reports.\"\n\nRadiation levels outside the Natanz facility remained unchanged. The type of radioactive contamination present inside the facility, mainly alpha particles, can be managed with appropriate protective measures,\" Grossi later said in a statement.\n\nThis is an excerpt from an article by Greg Norman.Click hereto read more.\n\nThe NYPD said it is ramping up security at Jewish sites across New York City afterIsrael launchedstrikes on Iran overnight.\n\nThe precautionary measures aim to protect Jewish communities amid heightened tensions in the Middle East.\n\n\"Out of an abundance of caution, we're deploying additional resources to Jewish, Israeli and other sites throughout NYC,\" the NYPD wrote on X late Thursday as the attacks were unfolding.\n\nThis is an excerpt from an article by Michael Dorgan.Click hereto read more.\n\nIsraeli President Isaac Herzog released a statement on his country's operation against Iran, saying that it was about preserving freedom and ensuring a more peaceful future in the Middle East.\n\n\"Freedom is not preserved by words alone—it demands courage, vigilance, and the resolve to act when necessary,\" Herzog wrote in a post on X. \"This is a struggle for the safety of the Middle East and the world. This is a battle for a more peaceful future in theMiddle East. This is a battle for the values of the free world. Iran must not have nuclear capabilities.\"\n\nThe Mossad — Israel's equivalent ofthe CIA— released footage of its operatives carrying out covert operations inside Iran ahead of Israel's historic strike. This is a rare look at the agency's activities, which are mostly secret.\n\nAccording to a senior Israeli security official, the Mossad took several steps inside Iran to prepare for Israel's preemptive attack. The agency set up a secret explosive drone base inside Iran prior to the attack. Once the strikes started, the drones were activated to destroy surface-to-surface missiles that Israel said posed a threat to its civilians.\n\nFILE - The USS Thomas Hudner during christening ceremony at Bath Iron Works in Bath, Maine, April 1, 2017. (AP Photo/Mary Schwalm, File)\n\nFollowing Israel's preemptive attack on Iran,the Navydirected the guided-missile destroyer USS Thomas Hudner to begin sailing toward the Eastern Mediterranean and has directed a second destroyer to begin moving closer to Israel as well, a U.S. official tells Fox News.\n\nThis echoes a move the US made in April 2024 after Iran shot ballistic missiles at Israel. At the time, USS Carney and USS Arleigh Burke shot down the missiles.\n\nMuch of the worldvoiced concern on Friday following Israel’s early-morning strikes on over 100 targets in Iran, urging both nations to avoid further escalation.\n\nIran responded with a drone counterattack, and Israel declared the strikes were only the first wave in a broader campaign to thwart Iran’s nuclear ambitions.\n\nSecretary of State Marco Rubio emphasized that Israel acted unilaterally, stating the U.S. was not involved in the strikes, while PresidentDonald Trumpwarned Iran the next round of Israeli attacks would be \"even more brutal.\"\n\nThis is an excerpt from an article by Morgan Phillips.Click hereto read the full story.\n\nIran's mission to theUnited Nationsis calling for an emergency meeting of the U.N. Security Council following Israel's launch of Operation Rising Lion.\n\n\"The Israeli regime and its backer — namely the United States — shall be held fully accountable for these blatant violations of international law and their grave consequences,\" the mission wrote in a post on X.\n\nIranian Foreign Minister Seyed Abbas Araghchi issued a letter to the U.N. Security Council in which he called Israel's operation \"a brazen and unlawful act of aggression.\" Araghchi also urged the international community to take action.\n\n\"Israel, the most terrorist regime in the world, has now crossed every red line, and the international community must not allow these crimes to go unpunished,\" Araghchi wrote.\n\nIsraeli U.N. Ambassador Danny Danon joined \"FOX & Friends\" after Israel's historic strikes on Iran.\n\nThe Iron Dome has been an integral part ofIsrael’s multi-layer defensesince it was originally deployed in 2011. The Iron Dome works to keep the citizens of Israel safe with its ability to detect incoming air threats.\n\nThe Iron Dome is a missile defense system developed by Rafael Advanced Defense Systems. It acts as a shield that can detect threats such as missiles, artillery shells, short-range rockets and drones.\n\nOnce a threat is detected, data is relayed to a missile firing unit, and interceptor Tamir missiles are then fired to eliminate it.\n\nThe Iron Domehas been instrumental throughout Israel's long-standing conflict with Hamas. Since 2011, the Iron Dome has had over a 90% success rate and has intercepted over 5,000 rockets, according to Rafael’s website.\n\nThe Iron Dome air defense system has a long history of successfully intercepting threats from the sky and proved successful once again as it intercepted some drones and missiles aimed at Israel after their attack on Iran’s nuclear sites.\n\nAirlines are diverting flights away from the airspace of multiple Middle Eastern countries on Friday following Israel’s surpriseairstrikes on Iran.\n\nTracking data from the website Flightradar24 shows that carriers are avoiding flying over Israel, Jordan, Iraq and Iran, which each have closed their airspaces, reports say.\n\n\"The purpose of the closure is to prevent and reduce risk to passengers and aircraft,” Israel’s Ministry of Transport and Road Safety said, according to Ynet News. “Passengers who were scheduled to depart today from [Tel Aviv’s] Ben Gurion Airport are requested to stay home and not to come to the airport.”\n\nAirlines are also suspending flights in the wake of the airstrikes, which targeted Iran’s nuclear facilities and top military leaders.\n\nThe Commander-in-Chief of the Islamic Revolutionary Guard Corps (IRGC) Hossein Salami and the country's chief of staff of the armed forces, Gen. Mohammad Bagheri, were killed by the strikes.\n\nIsraeli Prime Minister Benjamin Netanyahu attends a joint press conference with French President Emmanuel Macron in Jerusalem, October 24, 2023. Christophe Ena/Pool via REUTERS/File Photo\n\nFrench PresidentEmmanuel Macronreiterated his country's opposition to Iran's nuclear program, but urged \"all parties to exercise maximum restraint\" in the wake of Israel's historic strikes.\n\nIn his statement, Macron also reassured his people, saying that he would take \"all necessary steps\" to protect French nationals and diplomats in the region.\n\n\"Peace and security for all in the region must remain our guiding principle,\" Macron wrote.\n\nIsraeli Ambassador to the U.S.Yechiel Leiter said in a video update that was posted around 2:00 a.m. ET that Israel had seen \"considerable success\" in its historic preemptive strike on Iran. He also called for \"patience and perseverance,\" saying that it was going to be a \"long haul.\"\n\n\"If Iran would have achieved a nuclear weapon and would have used it, the eulogies for the State of Israel would have been the most beautiful eulogies ever written. But we're not interested in eulogies, we're interested in life. We've come home to live and to live in peace. And we're going to pursue peace through strength at every cost.\"\n\nAn Israeli security official told Fox News that Israel was able to trick top commanders ofIran's air forceinto gathering for a meeting.\n\n“We carried out specific activities to help us learn more about them, and then used that information to influence their behavior,” the official said. “We knew this would lead them to meet — but more importantly, we knew how to keep them there.”\n\nThe official added that the strikes were more successful than Israel had anticipated. According to the source, air defense systems and ballistic missiles that were intended for use against Israel were preemptively targeted.\n\nPresident Donald Trump points to a reporter for a question during an event signing a bill blocking California's rule banning the sale of new gas-powered cars by 2035, in the East Room of the White House, Thursday, June 12, 2025, in Washington. (AP Photo/Alex Brandon)\n\nPresidentDonald Trumpcalled on Iran to make a deal and warned that \"the next already planned attacks\" would be \"even more brutal\" than the opening strikes of Israel's Operation Rising Lion.\n\n\"I gave Iran chance after chance to make a deal,\" Trump wrote in a post on Truth Social. \"There has already been great death and destruction, but there is still time to make this slaughter, with the next already planned attacks being even more brutal, come to an end. Iran must make a deal, before there is nothing left, and save what was once known as the Iranian Empire.\"\n\nThe president also demanded Teheran make a deal to avoid more death and destruction.\n\nA satellite image shows the Natanz nuclear facility in Iran in this handout image dated Jan. 24, 2025. (Maxar Technologies/Handout via REUTERS)\n\nInternational Atomic Energy Agency (IAEA) chief Rafael Grossi called Israeli President Isaac Herzog, Fox News has learned. According to Israeli media, Grossi told Herzog that the Natanz nuclear facility was severely damaged in the strike.\n\nThe Israel Defense Forces (IDF) announced on Friday that it struck Natanz, which is Iran's largest uranium enrichment site.\n\n\"Overnight, Israeli Air Force fighter jets, guided by precise intelligence from the Intelligence Directorate, struck the Iranian regime's uranium enrichment site in the Natanz area,\" an IDF statement read. \"In addition, critical infrastructure enabling the site's continuous operation and the Iranian regime's ongoing efforts to obtain nuclear weapons were targeted.\"\n\nThe IDF credits coordination between the Intelligence Directorate and theIsraeli Air Force for successful strike.\n\nCommander-in-Chief of the Islamic Revolution Guards Corps (IRGC) Hossein Salami and IRGC Aerospace Force Commander Amir Ali Hajizadeh stand together during a joint exercise called the 'Great Prophet 17' in the southwest of Iran, December 24, 2021. Picture taken Dec. 24, 2021. (Saeed Sajjadi/Fars News/WWest Asia News Agency via REUTERS)\n\nIsraeli Defense MinisterIsrael Katz said most of the Islamic Revolutionary Guards Corps' (IRGC) air force leadership was taken out in a strike.\n\nThe dead include Amir Ali Hajizadeh, commander of the IRGC’s Air Force, the Israeli Defense Forces said Friday.\n\nAdditionally, the IRGC's air command was convened underground when the strike occurred.\n\nIsrael’s attacks early Friday also took out two top Iranian generals; Gen. Hossein Salami, the leader of Iran's paramilitary Revolutionary Guard and Gen. Mohammad Bagheri, the chief of staff of Iranian armed forces.\n\nAn Israeli military official told reporters on Friday that the country is prepared for a potential response from Iran, including ballistic missiles. Teheran launched ballistic missiles at Israel in April 2024 and October 2024.\n\nThe official also said that Israel had \"no choice\" but to confront what it describes as a \"concrete threat\" to its citizens. The Israeli military official also noted that Iran's missile range goes beyond Israel, meaning it is a threat to more than Jerusalem.\n\nWhile an order for Israelis to stay near shelters amid Iran's drone attack has been lifted, the military official said that \"the threat isn't over yet.\"\n\nIsraeli Prime MinisterBenjamin Netanyahuexpressed solidarity with the people of Iran, saying that his country was not fighting them, but rather the regime.\n\n\"To the brave people of Iran, I have a message for them: Our fight is not with you. Our fight is with the brutal dictatorship that has oppressed you for 46 years,\" Netanyahu said in a video statement. \"I believe that the day of your liberation is near, and when that happens the great friendship between our two ancient peoples will flourish once again.\"\n\nA seniorIsraeli security officialgave Fox News an inside look at Operation Rising Lion in which the Israel Defense Forces (IDF) and the Mossad worked side-by-side. The operations leading up to Israel's strikes involved intelligence gathering, advanced technologies and the deployment of commando forces operating across Iran, the official said.\n\nThe official said that extensive intelligence was gathered and surveillance was conducted to incriminate senior officials in the Iranian security establishment and nuclear scientists who were eliminated. The Mossad in coordination with the IDF carried out a series of elimination operations deep inside Iran, according to the official.\n\nAs Israel's attack began, Mossad agents in central Iran deployed precision-guided weapons systems into open areas near Teheran's surface-to-air missile (SAM) systems. The missiles were launched at their targets as Israeli airstrikes began. Additionally, the Mossad deployed strike systems and advanced technologies on vehicles with the goal of neutralizingIran's air defensecapabilities that threaten Israeli jets. Further, the Mossad had previously established a base of explosive drones, which were activated and launched toward surface-to-surface missile (SSM) launchers that posed threats to Israeli civilians and strategic targets.\n\nTeheran announced via state TV that it would be pulling out of nuclear negotiations with the U.S., according to reports.\n\nSenior Iranian lawmaker Aladdin Boroujerdi, a member of parliament's National Security and Foreign Policy Commission, allegedly made the announcement that the sixth round of talks with the U.S. would not take place followingIsrael's strikes.\n\nThe IDF confirmed early Friday it has begun intercepting UAVs fired from Iran, outside of its territory.\n\nThe retaliatory drone attack from Tehran comes hours after Israel launched apreemptive strikeon the Islamic Republican, targeting its nuclear facilities.\n\nAir raid sirens sounded over Jordan’s capital Friday as Iranian drones were inbound to target Israel.\n\nIraqi security officials told The Associated Press that more than 100 drones launched from Iran toward Israel were tracked crossing Iraqi airspace.\n\nNeighboring Jordan, meanwhile, has closed its airspace.\n\nSaudi Arabiaearly Friday issued a scathing attack on Israel, condemning the Jewish State for its early morning strike on Iran.\n\n\"Saudi Arabia expresses its strong condemnation and denunciation of the blatant Israeli aggressions against the brotherly Islamic Republic of Iran,” Saudi officials said in a statement.\n\nThe Kingdom said Israel’s attack undermines Iran’s “sovereignty and security and constitute[s] a clear violation of international laws and norms.\"\n\nIsrael’s top military spokesperson BG Effie Defrin has confirmed that Iran has launched 100 drones at Israel.\n\nDefrin said that the drones had not arrived yet but that they were working to intercept them.\n\nAccording to Fox News chief foreign correspondent Trey Yingst, it will take them a couple of hours for the drones to get there and likely they could be coupled with missile fire.\n\nThe attack is a response from the Iranians, following theIsraeli strikesovernight that targeted Iranian nuclear facilities.\n\nThe strike according to IDF Spokesperson, BG Effie Defrin took out key Iranian commanders.“We can now confirm that the Chief of staff of the Iranian Armed Forces, Commander of the IRGC and the Commander of Iran’s Emergency Command were all eliminated in the Israeli strikes across Iran.”\n\nIsraeli civilians have been told to stay close to bomb shelters and Israel's Prime Minister says the instructions may last for longer than previous times, according to Yingst.\n\nIsraeli Prime MinisterBenjamin Netanyahuhas said that he believes this could go on for go on for a couple of weeks.\n\nIDF forces early Friday confirmed thatIsraeli strikeson Iran have killed three of the country's top generals.\n\nThe senior Iranian leaders taken out include the country's chief of staff of the armed forces, Gen. Mohammad Bagheri, and the Commander of Iran’s Emergency Command.\n\nThat is in addition to the Commander-in-Chief of the Islamic Revolutionary Guard Corps (IRGC) Hossein Salami.\n\nIsraeli Ambassador to the U.N. Danny Danon warned “intense days” are ahead for the Jewish state after itlaunched strikeson Iran’s nuclear infrastructure.\n\n“We know that we have intense days ahead. And we are ready for that,” Danon told Fox News’ Trace Gallagher early Friday. “And we are preparing the population of Israel to be ready for that.”\n\nDanon said the attack was not only about the heroism of the pilots or intelligence officials involved, but also the Israeli people.\n\n“They have to follow the instructions. Keep themselves safe. And it will not be easy for us. But we are determined to finish the job.”\n\nExiled Crown Prince of Iran Reza Pahlavi weighed in early Friday after anIsraeli attackon Tehran.\n\nPahlavi, son of the Shah Mohammad Reza Pahlavi, who’s government fell to Islamists in 1979, said the “only solution to the ongoing crisis with Iran” was “helping the Iranian people overthrow the regime that holds both Iran and the world hostage.”\n\n“The Islamic Republic has plundered Iran's wealth not to serve our people but to spend hundreds of billions on enrichment and a hidden nuclear program, pushing Iran to the brink of war. This regime was trying to fool the world. Now it has been exposed. It must be held to account,” the exiled crown prince said. “In the Pahlavi era, Iran was an original signatory of the NPT. But today, the IAEA has ruled that the Islamic Republic is violating it.”\n\nPahlavi said Iranian supreme leader and his “criminal mafia” have “announced the construction of a new enrichment facility.”\n\n“With their violations, enrichment, and threats to withdraw from the NPT, Khamenei and his cronies are proving once again they cannot be trusted. They are not worthy partners for negotiation,” Pahlavi said. “But in contrast to this illegitimate regime, there is a real alternative: the Iranian people, who seek peaceful cooperation, and a future free from fear of war. Hold the Islamic Republic accountable by applying Maximum Pressure including Snapback sanctions and giving Maximum Support to its greatest foe: the people of Iran fighting bravely against it.”\n\nIsraeli Prime MinisterBenjamin Netanyahuplaced a note in the Western Wall Thursday with a verse from the Book of Numbers.\n\nThe verse, Numbers 23:24 reads: “A people that rises up as a lioness, and as a lion lifts himself up.”\n\n“Rising Lion” is the name of the operation the State of Israel launched on Iran’s “nuclear and missile infrastructure, with the aim of eliminating an existential and immediate threat to citizens of Israel and the entire world,” Israel’s ambassador to the United Nations, Danny Danon, told the UN Security-General and members of the Security Council.\n\nIsrael conducted airstrikes against Iran on Thursday night.\n\nPresident Donald Trump told Fox News Channel's chief political anchor Bret Baierhe was aware that Israelwas going to conduct strikes on Iran before they happened.\n\n“Iran cannot have a nuclear bomb and we are hoping to get back to the negotiating table. We will see. There are several people in leadership that will not be coming back,” Trump said.\n\nTrump has spoken to Israeli Prime MinisterBenjamin Netanyahuseveral times in recent days.\n\nThe Trump administration reached out to at least one key Middle Eastern ally to acknowledge that the strike was going to happen, but that the U.S. was not involved in the strikes.\n\nTrump is watching for any retaliation, and U.S. Central Command (CENTCOM) is on high alert. He noted that the U.S. is ready to defend itself and Israel if Iran retaliates.\n\nTrump said he hopes Iran returns to the negotiating table.\n\nIn recent weeks, the U.S. has replenished Iron Dome missiles, and U.S. officials have confirmed that a number of top Iranian leaders are dead after Israel’s airstrikes.\n\nFox News’ Jennifer Griffin contributed to this report.\n\nUnited Nations Secretary-General António Guterres (Reuters/Eduardo Munoz)\n\nThe Secretary-General of the United Nations expressed concerns overIsrael’s attacks on Iran’s nuclear facilities, calling on both countries to show maximum restraint.\n\n“The Secretary-General condemns any military escalation in the Middle East,” Secretary-General Antonio Guterres’ spokesperson said. “He is particularly concerned by Israeli attacks on nuclear installations in Iran while talks between Iran and the United States on the status of Iran's nuclear programme are underway.\n\n“The Secretary-General recalls the obligation of UN Member States to act in accordance with the UN Charter and international law,” he continued. “The Secretary-General asks both sides to show maximum restraint, avoiding at all costs a descent into deeper conflict, a situation that the region can hardly afford.”\n\nIran's supreme leader Ayatollah Ali Khamenei (ATTA KENARE/AFP via Getty Image)\n\nIranian Supreme Leader Ayatollah Ali Khamenei condemnedIsrael’s attackon Iran, saying “the Zionist regime has prepared for…a bitter and painful fate, which it will inevitably meet.”\n\nIn a translated version of Khamenei’s statement, the Ayatollah took aim at Israel.\n\n“In the Name of God, the Most Gracious, the Most Merciful,” he said. “The Great Iranian Nation! This morning, the Zionist regime opened its filthy and bloody hand to commit a crime in our beloved country, revealing its evils more than ever by targeting population centers.\n\n“This regime must expect severe punishment. The powerful hand of the Islamic Republic's Armed Forces will not abandon it, God willing,” Khamenei continued. “A number of commanders and scholars were martyred in the enemy's attacks, and their successors and colleagues will immediately return to their positions, God willing.\n\n“With this crime, the Zionist regime has prepared for itself a bitter and painful fate, which it will inevitably meet.”\n\nA map showing where Iran's nuclear facilities are located including Israel's main target in Natanz.\n\nIsraeli Prime MinisterBenjamin Netanyahusaid his country had targeted Iran's nuclear program.\n\n“We struck at the heart of Iran's nuclear enrichment program. We struck at the heart Iran's nuclear weaponization program,” Netanyahu said. “We targeted Iran's main enrichment facility in Natanz. We targeted Iran's leading nuclear scientists working on the Iranian bomb.”\n\nNetanyahu also mentioned that the time to act was now as they believed that Iran had enough materials to make nine highly enriched uranium bombs.\n\n“Today,Israelhas shown that we have learned the lessons of history. When enemies vow to destroy you, believe them. When enemies build weapons of mass death, stop them,” Netanyahu said.\n\nNetanyahu also said that Israel will not back down and that they have risen like lions to defend themselves.\n\nNatanz is just one of five nuclear research sites that Iran was utilizing to create a weapon with enriched uranium. The other sites throughout Iran are in Fordow, Khondab, Isfahan and Busher.\n\nIsraelhit several targets in the heart of Tehran, eliminating several senior Iranian regime leaders, an Israeli source confirmed to Fox News.\n\nFox News Chief Foreign CorrespondentTrey Yingstreported that the regime leaders were simultaneously eliminated in different spots, according to his source.\n\nThe source said Israel was able to surpriseIranand execute the attack at a level similar to what Israel did in the beeper operation.\n\nIsraeli Permanent Member to the United Nations Danny Danon speaks during a session of the Security Council at the New York City headquarters. (Israel United Nations mission)\n\nIsrael’s ambassador to theUnited Nations, Danny Dannon, called on the UN Security-General and members of the Security Council to either stand by Israel or become partners in a “dangerous silence.”\n\n“The State of Israel launched Operation “Rising Lion” tonight againstIran'snuclear and missile infrastructure, with the aim of eliminating an existential and immediate threat to the citizens of Israel and the entire world,” Dannon said in a statement. “The Iranian regime is blatantly violating international agreements, advancing towardsnuclear weapons, and operating a regional terror network. When the world is silent - Israel is acting.\n\n“I call on the UN Secretary-General and the members of the Security Council: \"This is a moment to make moral decisions. Stand byIsrael- or you will be partners in a dangerous silence,” he continued. “Unlike in the past - today we have a state, we have an army, and we are not waiting for those who want to destroy us to surprise us.\"\n\nIsraeli Prime Minister Benjamin (L) talks to U.S. President Donald Trump during a meeting in the Oval Office of the White House on April 7, 2025 in Washington, DC. President Trump is meeting with Netanyahu to discuss ongoing efforts to release Israeli hostages from Gaza and newly imposed U.S. tariffs. (Photo by Kevin Dietsch/Getty Images)\n\nPresident Donald Trump will host a National Security Council meeting Friday morning in the White House situation room to discuss the Israeli strikes in Iran’s capital.\n\nTrump spoke with Prime Minister Benjamin Netanyahu Thursday night, according the prime minister's office.\n\nThe president told Netanyahu that the United States had presented a reasonable proposal to Iran, and a response is expected in the coming days.\n\nNetanyahu was also told Trump intends to hold another round of talks with Iran over the weekend, Netanyahu's office said.\n\nNYPD announced it is taking precautions as tensions escalate in the Middle East. (iStock)\n\nTheNew  York CityPolice Department (NYPD) is taking precautionary steps to ensure Jewish, Israeli and other sites throughout the city are protected, amid the escalating situation in the Middle East.\n\n“The NYPD is tracking the situation in theMiddle East. Out of an abundance of caution, we're deploying additional resources to Jewish, Israeli & other sites throughout NYC,”NYPD wrote on X. “We’re coordinating with our federal partners & we'll continue to monitor for any potential impact to NYC.”\n\nNYC Mayor Eric Adams said he was briefed on the situation between Israel and Iran, noting that the city's Counterterrorism Unit is closely monitoring the situation.\n\n\"Out of an abundance of caution, we are increasing security at houses of worship and at Israeli diplomatic sites,\" he said. \"I am praying for peace in the region.\"\n\nFILE - This satellite photo from Planet Labs PBC shows the Natanz nuclear facility in Iran on May 20, 2025. (Planet Labs PBC via AP, File)\n\nIsraeli Prime MinisterBenjamin Netanyahu confirmed that one of Iran’s top nuclear facilities had been hit in Thursday night's strike against the regime.\n\n\"Iran has produced enough highly enriched uranium for nine atom bombs, nine,\" Netanyahu said. \"In recent months, Iran is taking steps that it has never taken before, steps to weaponize this enriched uranium. And if not stopped, Iran could produce a nuclear weapon in a very short time.\"\n\nThe Natanz Nuclear Facility – one of Tehran’s key nuclear sites and which has been flagged by security experts that in coordination with the Fordow Fuel Enrichment Plant, could produce enough weapons-grade uranium to produce 11 nuclear weapons within a month – has been hit in the strikes, though the extent of the damage remains unknown.\n\nFile photo of the U.S. Embassy Branch Office in the Israeli coastal city of Tel Aviv. (JACK GUEZ/AFP via Getty Images)\n\nThe U.S. Embassy has directed all U.S. government employees and their family members inIsraelto shelter in place until further notice.\n\nThe directive was shared by the U.S. State Department because of the current situation in the Middle East.\n\nIsrael launched airstrikes against Iran on Thursday night after failed nuclear negotiations.\n\nRGC commander-in-chief Major General Hossein Salami speaks during a memorial service for slain Hezbollah leader Hasssan Nasrallah and his successor Hashem Safieddine at Tehran's Grand Mosque in Iran's capital Tehran on February 23, 2025. Iran's supreme leader Ayatollah Ali Khamenei vowed \"resistance\" against Israel as Tehran-backed Hezbollah held a funeral on February 23 in Beirut for Nasrallah, killed in an Israeli strike last year. (ATTA KENARE/AFP via Getty Images)\n\nState-run media in Iran confirmed that the Commander-in Chief of the Islamic Revolutionary Guard Corps (IRGC), Hossein Salami, was killed duringIsrael’sairstrikes on Iran Thursday night.\n\nSalami rose through the ranks of the IRGC since the inception after the 1970 Islamic Revolution inIran.\n\nHe replaced Qassem Soleimani after the U.S. killed the IRGC leader in January 2020.\n\nIsraeli Prime MinisterBenjamin Netanyahusaid during a speech Thursday night that he launched Operation Rising Lion, which is to roll back the Iranian threat for Israel’s survival.\n\nNetanyahu told the people ofIsraelthe operation will continue for many days, as it continues to remove Iran’s threat of creating weapons of mass destruction.\n\n“For decades, the tyrants of Tehran have brazenly, openly called for Israel's destruction. They've backed up their genocidal rhetoric with a program to developnuclear weapons,” he said. “In recent years, Iran has produced enough highly enriched uranium for nine atom bombs, nine. In recent months, Iran is taking steps that it has never taken before, steps to weaponize this enriched uranium, and if not stopped, Iran could produce a nuclear weapon in a very short time. It could be a year, it could be within a few months, less than a year. This is a clear and present danger to Israel's very survival.”\n\nNetanyahu said the air strikes “struck at the heart ofIran’snuclear enrichment program.”\n\n“We struck at the heart of Iran's nuclear weaponization program. We targeted Iran's main enrichment facility in Natanz. We targeted Iran's leading nuclear scientists working on the Iranian bomb,” he said. “We also struck at the heart of the Iran ballistic missile program. Last year, Iran fired 300 ballistic missiles at Israel…Soon, those missiles could carry a nuclear payload, threatening the lives not of hundreds, but of millions.”\n\nIsrael launched airstrikes against Iran on Thursday night.\n\nThe top Democrat on the Senate Armed Services, Sen. Jack Reed, D-R.I., called Israel’s airstrikes onIrana “reckless escalation that risks igniting regional violence.”\n\n“Israel’s alarming decision to launch airstrikes on Iran is a reckless escalation that risks igniting regional violence,” Reed said. “These strikes threaten not only the lives of innocent civilians but the stability of the entireMiddle Eastand the safety of American citizens and forces. While tensions between Israel and Iran are real and complex, military aggression of this scale is never the answer.\n\n“I urge both nations to show immediate restraint, and I call on President Trump and our international partners to press for diplomatic de-escalation before this crisis spirals further out of control,” he continued. “President Trump must be crystal clear with the American people and the international community in charting a way forward. The world cannot afford more devastating conflict born of short-sighted violence.”\n\nSecretary of StateMarco Rubioissued a warning to Iran Thursday evening after Israel launched strikes targeting the country's nuclear program.\n\n\"President Trump and the Administration have taken all necessary steps to protect our forces and remain in close contact with our regional partners. Let me be clear:Iranshould not target U.S. interests or personnel,\" Rubio said.\n\nRubio also said the U.S. was not involved in the strikes and the top priority is \"protecting American forces in the region.\"\n\n\"Israeladvised us that they believe this action was necessary for its self-defense,\" he continued.\n\nIsrael launches strikes on Iran, explosions heard in Tehran\n\nIsraeli Defense Forces launched a sweepingstrike on Iranfollowing months of attempted, and seemingly failed, nuclear negotiations between the Trump administration and Tehran.\n\nFox News' Trey Yingst reported that Israel carried out strikes in Iran, adding that explosions were heard in the capital of Tehran.\n\nA state of emergency has been declared across Israel as the country braces for an Iranian response."
    }
}