{
    "question": "What kinds of evidence should be prioritized to assess claims that outside agitators or funded organizations influenced the Los Angeles protests, and how might those findings affect public trust in both the demonstrations and authorities’ responses?",
    "content": {
        "source_1": "For decades, LA has been at the center of the civil rights and immigrants’ rights movements – and Trump’s raids appear to be mobilizing a new generation\n\nLos Angeles is home to nearly a million undocumented immigrants, the largest number of any place in the US. For decades, the city has been a catalyst in the US immigrants’ rights movement.\n\nSo when federal agents began conducting raids at workplaces across Los Angeles last week, activists say it’s not surprising that the city rose up in protest.\n\n“We’re seeing it as a struggle to preserve what’s left of American democracy,” Chris Zepeda-Millán, a public policy expert at the University ofCaliforniaLos Angeles, told the Guardian on Monday en route to a protest.\n\nTrump’s decision to send military troops into a majority-Democratic city has been criticized as a deliberate provocation, perhaps one designed to undermine his political rival, the California governor, Gavin Newsom, and distract from Trump’s current legislative and personal struggles.\n\nBut Trump has also decided to stage his immigration battle in a city with one of the most well-developed networks of pro-immigration organizations and pro-immigrant labor unions in the United States.\n\n“They’re fighting what they perceive as fascism and militarism taking over their city and their state,” Zepeda-Millán said. “They’re well aware that other activists in other cities are watching.”\n\nAngelenos have been organizing against government attempts to criminalize undocumented workers since the 1990s, and against US government racism towards Mexican Americans for at least a century.\n\nSome of LA’s immigrants’ rights protests have been huge: at least half a million people are estimated to have attended demonstrations in downtown Los Angeles in 2006, when the Republican party tried to pass a national bill that would have made simply being an undocumented immigrant in the US a felony.\n\nFor the most part, the people protesting in the streets today are not themselves immigrants, or undocumented, Zepeda-Millán said. It’s the children and grandchildren of immigrants, people who are themselves US citizens, who are taking up the fight.\n\n“They know very well how much their parents and grandparents contributed to this state, this country, this economy,” he said.\n\nLocal Black Lives Matter leaders have encouraged all Angelenos to join the protests in solidarity. “This is our business. Any time there’s a Gestapo covering up their faces, masking their faces, snatching people off of street corners, none of us are safe,” Melina Abdullah, a co-founder of Black Lives Matter LA, said in a social media video on Friday.\n\nAbdullah, who said she was teargassed at a demonstration on Friday, told the Guardian that the law enforcement response to the immigration raid protests had been different, with officers “throwing aside any rules of engagement”.\n\n“They’re treating us as if we’re enemy combatants,” she said. “I’ve never seen it like this.”\n\nAs the White House has set new, record-breaking quotas for the daily number ofImmigration and Customs Enforcement (Ice)arrests, activists say, many different federal agencies are now being asked to contribute to Trump’s deportation agenda.\n\n“We’re not just dealing with Ice. We’re dealing with FBI Swat teams, drug enforcement, US marshals,” said Victor Narro, a longtime immigration and labor activist in Los Angeles.\n\nIn southern California, communities are now seeing “paramilitary use of FBI agents, armed vehicles patrolling the streets, doing these very flashy and public types of raids and operations”, said Luis Nolasco, a senior policy advocate and organizer at the ACLU of Southern California. In January, border patrol agents conducted raids targeting undocumented workerssix hours north of the US-Mexico border. “The amount of border patrol presence in our region is very concerning,” Nolasco said, because border patrol, even more than Ice “has a horrendous track record of abusing people’s rights”.\n\nToday, nearly half of Los Angeles county’s 10 million residents are Latino, 16% are Asian, and a third of all residents were born outside the United States. White people have been a minority in Los Angeles county since at least 1990, according to theLos Angeles Times: California became a “minority-majority” state in 2000.\n\nLos Angeles county has so many residents who are undocumented that it contains nearly 9% of the US’s total population of undocumented people, according to estimates from the Migration Policy Institute. In 2023, there were a total of 13.7 million “unauthorized immigrants” living in the US, the non-partisan thinktank estimated.\n\nScholars and activists said that Trump simply does not have the federal resources to deport people from the US at the scale or the pace that his administration has promised. In May, the administrationdemanded that federal agents arrest and deport 3,000 people a day, or a million each year. (Not all people who are arrested can be deported right away.)\n\nDuring Trump’s first 100 days in office, Ice said it arrested anaverage of only 660 people a day. At that rate, Zepeda-Millán said, it would take federal agents 50 years to deport the more than 12 million undocumented people estimated to be living in the United States.\n\nBut Trump can effectively use federal agents to terrorize undocumented people and their families, activists said, something his Los Angeles raids have accomplished. One daughter of a man arrested in the raidsdescribed her father being “kidnapped”by agents, taken away in handcuffs and ankle chains, and detained for days without any contact with his family. Others described shock at raids targeting workplaces, and the detention of hard-working, church-going family members, some of whom have lived in LA for decades.\n\nLos Angeles news outlets have reported that streets in some immigrant neighborhoods of the city have beeneerily empty, and businesses reporting asudden drop in customers, as the threat of arrest and deportation has frightened many people into staying at home.\n\nWhile many news outlets are currently focusing on “protesters or things being thrown at police”, immigrant communities are feeling a “hurt” that “is not usually portrayed in the press”, Camarillo said. Given “the devastation that’s occurring in the places where they are raiding and taking mothers and fathers and aunts and uncles and sisters and brothers,” he said, it’s no surprise that there have been protests.\n\nLA’s demographics, combined with the city’s history of prominent “riots”, from the 1965 Watts uprising to the 1992 protests over the police beating of Rodney King, make Los Angeles a “strategic” place for Trump to draw out protesters that he can label “insurrectionists”, said Albert Camarillo, an emeritus professor of history at Stanford University.\n\n“This is a TV personality that knows how to stage a spectacle,” Camarillo said.\n\nPart of the apparent strategy behind Trump’s showdown in Los Angeles, some activists said, isn’t even about immigrants themselves. It’s about creating chaos and undermining California’s economy in order to hurt Newsom’s likely presidential run in 2028.\n\n“I think the Republican party sees Gavin Newsom as a threat,” Zepeda-Millán said.\n\nBut activists caution that previous Republicans attempts to crack down on California’s undocumented immigrants to further their political goals have backfired – sometimes spectacularly.\n\nOne of the main reasons that California is now a Democratic supermajority state is because the Republican party backed a punitive anti-immigrant ballot measure, Prop 187, in 1994. Thirty years later, the state’s majority-minority voters still do not appear to have forgiven them.\n\nCalifornia is often labeled a “deep-blue state” but it’s also been a deeply reactionary one. The region’s PR machine may focus on the sunny beaches and Hollywood glamor, but LA’s reality includes intense racial segregation and systemic deprivation. Los Angeles’s law enforcement agencies are notorious for their history of racism and violence, and the city has the largest jail system in the United States.\n\nThose conditions have sparked repeated uprisings by the city’s Black residents: in 1965, 1992 and again with the Black Lives Matter movement in 2020. But this Black civil rights history is intertwined with a lesser-known history of similar Latino civil rights battles in Los Angeles, often led by Mexican Americans.\n\nThough California, like much of the south-west, was part of Mexico until 1848, Mexican Americans have faced widespread discrimination, including been targeted with lynchings andwhite mob violence.\n\nWhen Camarillo, the Stanford historian, was growing up in South Central Los Angeles in the 1950s, he said, Mexican Americans were still dealing with “overt racial segregation” in housing, education and even movie theaters. Very few of the city’s more than half-million Latino residents were welcomed into institutes of higher education: when Camarillo entered UCLA in 1966, he said, he was one of fewer than 50 Mexican Americans in a total student body of 27,000.\n\nIn the 1960s and 70s, as African Americans were forming the Black Power movement, Mexican Americans formed the Chicano movement, embracing similar ideals of cultural empowerment, equal rights and self-determination. Both movements had their militant wings: the Brown Berets,founded in Los Angeles, were the Chicano answer to the Black Panthers.\n\nCamarillo remembers being “riveted” in 1968 as he watched East Los Angeles high school students stage massive walkouts to protest against their underfunded public schools and lack of opportunities. It was “the first time high school students had ever walked out”, said Camarillo, who went on to become the first Mexican American to earn a PhD in Chicano history.\n\nIn the 80s and 90s, a huge new wave of immigrants came to Los Angeles, many of them fleeing from civil wars in Guatemala and El Salvador in which theUnited States’ cold war policieshad played a major role.\n\nWith the state’s changing demographics came a backlash from California’s white residents, Camarillo said. California voters approved several ballot measures in the 1990s targeting undocumented immigrants and banning affirmative action policies at public universities.\n\nIn 1994, Los Angeles high-school studentsagain staged walkoutsto protest against Proposition 187, a ballot initiative designed to block undocumented immigrants and their children from receiving public services, and require public employees, including teachers and doctors, to report suspected undocumented people to the authorities.\n\nWhile the measure, which was eventually found to be unconstitutional, passed, it radicalized a new generation of activists, and resulted in more Latino leaders running for office and taking leadership roles in labor unions, activists said.\n\nToday, much of LA’s political establishment, including Karen Bass, the mayor, is made up of politicians who got their start as pro-immigrant activists in the 1990s. In 1994, during the battles over Prop 187 and California’s punitive “three strikes” law, Bass was acommunity organizer working with Latino teensto protest against the legislation.\n\nThe Trump administration’s raids in Los Angeles appear to be mobilizing a new generation of activists. Already, organizers are seeing changes in responses on the ground. In the past, Zepeda-Millán said, immigration enforcement raids and deportations had been “notoriously hard to organize around”, in part because activists often don’t find out about them until after they have happened. At most, he said, one or two activists might arrive to try to assist the person being deported.\n\n“Now what you’re seeing is hundreds of people showing up,” he said. “You’re not just seeing regular activists, you’re seeing community members come out of their houses to confront Ice and the police, saying they don’t want them there.”\n\nThat new community response to deportations is in part a result of Latino activists’ involvement in the George Floyd protests of 2020, Zepeda-Millán said, in which protesters saw police violence and repression firsthand.\n\n“The generation that you see out there, showing up by the tens and hundreds now, to confront raids, this is the generation of youth that were politically baptized during the Black Lives Matter movement,” he said.\n\nThis past week’s protests, with thousands of demonstrators, are not even close to the largest immigration demonstrations in LA’s history. In 2006, as millions of people protested in hundreds of cities nationwide against congressional Republicans’ attempt to turn all undocumented immigrants into felons, the largest protests were in Los Angeles. Narro, who organized a large May Day demonstration in 2006, said participants, even small children, dressed in white to symbolize their commitment to non-violence.\n\n“When you see the aerial pictures, it’s like a white blanket covering Los Angeles,” Narro said.\n\nLos Angeles’ immigrant communities have not participated in a demonstration at that scale in the past 20 years, but Narro said that Trump, who “seems to be doing something every day to harm immigrants”, may finally change that.\n\n“My hope is, if [Trump] continues, it will hit that moment of groundswell, that immigrant families will just get fed up, and overcome their fear, and take to the streets in massive numbers,” Narro said.",
        "source_2": "Our name is about honesty. The Monitor is owned by The First Church of Christ, Scientist, and we’ve always been transparent about that.\n\nThe church publishes the Monitor because it sees good journalism as vital to progress in the world. Since 1908, we’ve aimed “to injure no man, but to bless all mankind,” as our founder, Mary Baker Eddy, put it.\n\nHere, you’ll find award-winning journalism not driven by commercial influences – a news organization that takes seriously its mission to uplift the world by seeking solutions and finding reasons for credible hope.\n\nA deeper view that unites instead of divides, connecting why the story matters to you.\n\nIt’s Monday morning. We start with two stories that track shifts on both sides of the Atlantic. Simon Montlake takes you to Durham Country, England, where the views of ordinary citizens illustrate how traditional political parties have left voters feeling dissatisfied and abandoned - and not just in the U.K. Anna Mulrine Grobe, meanwhile, reports on changing attitudes toward military service among young Americans. Welcome to a new week.\n\nThe Christian Science Monitor's coverage of the war between Hamas and Israel, and related articles.\n\nA deeper view that unites instead of divides, connecting why the story matters to you.\n\nAs the Los Angeles Police Department moved to box in a group of protesters outside the city’s downtown federal building last weekend, several people suddenly rushed the line.\n\nChunks of concrete flew through the air, recalls Martín Hoecker-Martinez. He says a woman then ran up and down the group of bystanders, exhorting others to join the attack.\n\n“Whether she recruited people, I don’t know,” says Mr. Hoecker-Martinez, a college physics professor who had been peacefully walking the Los Angeles streets waving U.S. and Colombian flags. But she was “clearly communicating to get more people” to push back against the police.\n\nPresident Donald Trump and others have stirred discussion of whether paid “troublemakers” are trying to foment chaos. But protests are messy, and it can be almost impossible to determine in real time whether actions have been planned by an organized group.\n\nThe protests against the Trump administration’s immigration raids in Los Angeles have featured flashes of violence, with protesters setting driverless cars on fire and officers responding to crowds with tear gas and rubber bullets. The tension has triggered fraught debates around the administration’s immigration policies and its decision to deploy the military in a major U.S. city against the wishes of the governor.\n\nBut they’re also sparking a more basic question: Who, exactly, is doing the protesting?\n\nFor days, President Donald Trump and many of his allies have been insisting that the participants are not ordinary citizens simply exercising their First Amendment rights, but are “paid insurrectionists.”\n\n“These people are agitators,” said Mr. Trump Tuesday on the tarmac at Joint Base Andrews. “They’re troublemakers. I believe many of them are paid. I watched them breaking up the sidewalks with a big hammer, handing pieces of the concrete to other people.”\n\nLos Angeles police Chief Jim McDonnell made a similar charge at a separate press conference Tuesday. “They’re people that do this all the time,” said Chief McDonnell. “They get away with whatever they can. Go out there from one civil unrest situation to another, using the same or similar tactics frequently. And they are connected.”\n\nClaims of “outside agitators” seem to crop up whenever waves of protests sweep the country. Recent examples include the Jan. 6, 2021, attack on the U.S. Capitol; the Black Lives Matter protests during the summer of 2020; and the Gaza-Israel protests on college campuses last year. Some of those claims were later substantiated by arrest records and news reports.\n\nAt the same time, pointing fingers at shadowy outside forces can be a useful political tactic – whether it’s coming from movement sympathizers hoping to distance themselves from protest-related violence, or from politicians who want to discredit large-scale opposition to their policies.\n\nBy their very nature, protests are messy. In many cases, including in LA this week, experts say it’s almost impossible to determine which actions have been sanctioned by an organized movement, and who, exactly, “belongs” at events that often happen organically, in open spaces.\n\n“There are people in this country, like every country, who want to ... create chaos and therefore undermine the movement,” says Timothy Zick, a law professor at William & Mary and the author of “Managed Dissent: The Law of Public Protest.” Separating them out from “real people” who are concerned about the current administration’s policies and just want to be heard can be extremely difficult, he adds. “It’s hard to pry these things apart.”\n\nWhether part of any organized effort or not, several people were charged Wednesday by LA law enforcement with crimes including burglary and assault of police.\n\n“There is a big distinction between [typical protesters and] basically anarchists,” LA County Sheriff Robert Luna said in announcing the charges, calling instances of violence “isolated.”\n\nThe “outside agitator” claim was famously used during the Civil Rights Movement to delegitimize it as “fake or phony,” notes Professor Zick. Martin Luther King Jr. addressed it directly in his “Letter From a Birmingham Jail” in 1963, arguing that anyone who lives in the United States “can never be considered an outsider.”\n\nWhether the intention is to discredit a protest or to shore up its legitimacy, “outsider” claims are often unsubstantiated. Following the Jan. 6 attack, for example, Mr. Trump and many of his supporters blamed the violence on undercover government agents and far-left antifa activists – a claim that has been denied by bothleaders of the Federal Bureau of Investigationandmany rioters themselves. But some of those arrested were linked with far-right extremist groups like the Oath Keepers, Proud Boys, and Three Percenters.\n\nIn 2020, Minnesota Gov. Tim Walz suggested that most of the violence that ensued after the murder of George Floyd was precipitated by out-of-state actors, but an Associated Press review found that41 of the 52 peoplewith protest-related arrest citations had Minnesota driver’s licenses.\n\n“It’s almost like a convenient bogeyman to blame, but often the evidence of outside agitation turns out to be pretty slim or nonexistent,” says Ed Maguire, a criminologist who studies the policing of crowds at Arizona State University in Tempe.\n\nStill, there are recent examples of “outsider” accusations that were later affirmed by evidence. New York City officials found thatnearly half of the 282 peoplearrested during last year’s campus protests over Israel’s treatment of Gaza were not affiliated with the schools. The University of Texas at Austin reported similar statistics.\n\nSome conservatives say there’s evidence to suggest that well-funded groups advocating for foreign powers have participated in, or even planned, protests in recent years.\n\n“My theory ... is that there are foreign regimes and enemies of the United States – especially China and Russia, Cuba, Iran, and Venezuela – that feed these nonprofit groups that then organize riots and protests to destabilize the United States,” says Daniel De Martino, a fellow at the Manhattan Institute.\n\nLast year, The People’s Forum, a tax-exempt advocacy group, hosted 100 masked anti-Israel protesters before they occupied a hall at Columbia University, according toa report in The Washington Free Beacon. The group’s executive director, Manolo De Los Santos, told the group to “make it untenable for the politics of usual to take place in this country,” the report said.\n\nFollowing the Black Lives Matter protests in 2020, Mr. Trump’sthen-acting Homeland Security chief confirmedthat some white supremacists, as well as other “violent opportunists,” had played a role. Many racial justice protesters were frustrated that some people used the protests as an excuse to commit crimes such as looting and arson.\n\n“If you don’t know a way to be heard, you need to find a way. Because this is not the way,” Andre Ross, a resident of Kenosha, Wisconsin,told the Monitor in 2020 as he surveyed the charred rubble of his downtown.\n\nStill, very few among the hundreds arrested during that summer’s protests, mostly for misdemeanor crimes, were affiliated with extremist groups, according to a report by The Associated Press. Many were actually young adults from suburban neighborhoods.\n\n“The history of every social movement in the U.S. is a combination of orderly and unruly protests,” says Angus Johnston, a historian of student activism at the City University of New York and a protest veteran. “If you’re insisting that any evidence of unruliness is evidence of a conspiracy, you’re flying in the face of hundreds of years of American history.”\n\nMonitor journalism changes lives because we open that too-small box that most people think they live in. We believe news can and should expand a sense of identity and possibility beyond narrow conventional expectations.",
        "source_3": "Protesters shut down the 101 Freeway in Los Angeles on Sunday. (Jason Armond/Los Angeles Times via Getty Images)\n\nTyler O'Neil is senior editor at The Daily Signal and the author of two books: \"Making Hate Pay: The Corruption of the Southern Poverty Law Center,\" and \"The Woketopus: The Dark Money Cabal Manipulating the Federal Government.\"\n\nWhen anti-U.S. Immigration and Customs Enforcement agitators took to the streets inthe Los Angeles areaover the weekend attacking officers, setting cars on fire, and looting, they drew attention to the left-leaning activist groups that may have helped instigate the riots.\n\nThree major organizations have come under increased scrutiny: the Coalition for Humane Immigrant Rights, Los Angeles; the Party for Socialism and Liberation; and the Service Employees International Union. One of these groups, the Coalition for Humane Immigrant Rights, Los Angeles, has received millions in government funding.\n\nThe Coalition for Humane Immigrant Rights, Los Angeles forms part of theLA Rapid Response Network, a group of organizations inSouthern Californiathat aim to monitor and counter ICE activity. The coalition has denied playing any role in the protests and the riots, but it helped organize protests before the weekend, and it has called protesters to action on behalf of David Huerta, president of the SEIU’s California chapter.\n\n“Federal agents were executing a lawful judicial warrant at [an] LA worksite this morning when David Huerta deliberately obstructed their access by blocking their vehicle,” Bill Essayli, the U.S. attorney for the CentralDistrict of California, posted on X. “He was arrested for interfering with federal officers and will face arraignment in federal court on Monday.”\n\n“Let me be clear: I don’t care who you are—if you impede federal agents, you will be arrested and prosecuted,” Essayli added. “No one has the right to assault, obstruct, or interfere with federal authorities carrying out their duties.”\n\nFederal agents were executing a lawful judicial warrant at a LA worksite this morning when David Huerta deliberately obstructed their access by blocking their vehicle. He was arrested for interfering with federal officers and will face arraignment in federal court on Monday. Let…pic.twitter.com/GIFD34LIcF\n\nSEIU Californiasaid Huerta had been “exercising his First Amendment right to observe and document law enforcement activity.”\n\nOn Saturday night,the Coalition for Humane Immigrant Rights, Los Angeles sent outan “Action Alert,” calling on supporters to join a protest Monday and “stand in solidarity with SEIU California leader David Huerta, unjustly beaten and detained for defending immigrant rights.”\n\nProtesters carried signs printed by the Party for Socialism and Liberation, a Marxist political party.\n\nA number of NGOs have been implicated in this. Foremost is Coalition for Humane Immigration Rights or CHIRLA, and the photos of signs show they were printed by PSLWEB / Party for Socialism and Liberation.pic.twitter.com/yS7jXkHGJ8\n\nThe Coalition for Humane Immigrant Rights held a rally last week to denounce ICE arresting illegal aliens across the city, but the group’s spokesmantold the New York Postit had no role in the violent riots.\n\nThe spokesman said the group “organized a press event on Thursday” to protest the ICE raids and had “been sending legal observers to immigration courts and detention centers on Friday, Saturday, and [Sunday] as part of the LA Rapid Response Network.”\n\nThe group had “not participated, coordinated, or been part of the protests being registered in Los Angeles other than the press conference and rally cited above,” the spokesman added.\n\nAccording to IRS records, the Coalition for Humane Immigrant Rights, Los Angelesreceived $34 millionin government grants between July 1, 2022, and June 30, 2023.\n\nU.S. Citizenship and Immigration Services awarded the groupthree grantsduring the Biden administration, adding up to $754,068.07, for “citizenship education and training.” USCIS canceled thelatest grant in March, after $349,064 of the $450,000 had been spent.\n\nThe group did not respond toThe Daily Signal’srequest for comment about its role in the protests and riots.\n\nSEIU California claimed Huerta, the union president who got arrested Friday, had been observing and documenting law enforcement activity. Yet the president’s own statement after the fact suggests a more aggressive role.\n\n“What happened is not about me; this is about something much bigger,” hesaid in a statementFriday evening. “This is about how we as a community stand together and resist the injustice that’s happening. Hardworking people, and members of our family and our community, are being treated like criminals.”\n\nThe SEIU did not respond to The Daily Signal’s request for comment by publication time.\n\nThe Party for Socialism and Liberation printed signs for the protests that escalated into riots. As The Heritage Foundation’sMike Gonzalez has noted, the organization has also actively coordinated protests on college campuses, particularly against Israel as it responded militarily to the Hamas terrorist attacks of Oct. 7, 2023.\n\nThe Network Contagion Research Institutetraced the connectionsbetween the Party for Socialism and Liberation and the Chinese Communist Party. The Party for Socialism and Liberation forms part of the “Singham Network,” linked by “close financial, interpersonal, and ideological ties to Neville Roy Singham and his wife Jodie Evans, a power couple within the global far-left movement with close ties to the CCP,” the institute claimed.\n\nThoughtworks, Singham’s company, sent The Daily Signal a comment after publication.\n\n“Roy’s affiliation with Thoughtworks ended when hesold the company in 2017 to Apax,” Linda Horiuchi, the company’s head of global public relations, said. “Thoughtworks has not been involved with Roy in a business capacity since he sold the company.”\n\nElias Rodriguez, thealleged murdererof two Israeli Embassy staff in Washington, D.C., had a previous association with one of the Party for Socialism and Liberation’s chapters.\n\nThe party’s website had previously quoted Rodriguez.\n\n“We reject any attempt to associate the PSL with the D.C. shooting,” the party said in a post on X. “Elias Rodriguez is not a member of the PSL. He had a brief association with one branch of the PSL that ended in 2017. We know of no contact with him in over seven years. We have nothing to do with this shooting and do not support it.”\n\nThe party did not respond to The Daily Signal’s request for comment.\n\nToday, even with President Trump’s victory, leftist elites have their tentacles in every aspect of our government.\n\nThe Daily Signal’s own Tyler O’Neil exposes this leftist cabal in his new book,The Woketopus: The Dark Money Cabal Manipulating the Federal Government.\n\nIn this book, O’Neil reveals how the Left’s NGO apparatus pursues its woke agenda, maneuvering like an octopus by circumventing Congress and entrenching its interests in the federal government.\n\nYou can read the first chapter of this new book for FREE in this eBook,The Woketopus: Chapter One using the secure link below.\n\n© 2025 The Daily Signal Media Group, Inc.  All rights reserved.\n\nWe use cookies on our website. By using our website, you consent to cookies.Learn More."
    }
}