{
    "question": "How might the forcible removal and handcuffing of Sen. Alex Padilla at a DHS press conference shape public perceptions of congressional oversight and law enforcement conduct at official events?",
    "content": {
        "source_1": "Sen. Alex Padilla, Democrat from California, is removed from the room after interrupting a news conference with Department of Homeland Security Secretary Kristi Noem at the Wilshire Federal Building in Los Angeles on June 12.Patrick T. Fallon/AFP via Getty Imageshide caption\n\nSen. Alex Padilla, D-Calif., was forcibly removed from a Homeland Security press conference led by DHS Secretary Kristi Noem in Los Angeles on Thursday.\n\nNoem was in Los Angeles to discuss immigration enforcement actions in the city and ongoing protests over those efforts. Padilla attempted to ask a question during the event before he was forced to the ground by federal agents and handcuffed before being released, Padilla told reporters later.\n\nA statementon the Homeland Security Department's Xaccount accused Padilla of \"disrespectful political theatre,\" charging that he did not comply with requests to back away. The statement said that the senator and Noem spoke for 15 minutes after the incident.\n\n\"I'll let the law enforcement speak about how this situation was handled, but I would say that people need to identify themselves before they start lunging at people, during press conferences,\" Noem told reporters as she left the press conference.\n\nIna statement, FBI deputy director Dan Bongino said Padilla \"was not wearing a security pin and physically resisted law enforcement when confronted.\" Bongino said agents \"acted completely appropriately.\"\n\nHowever, Padilla told reporters at a press conference after the incident that he did identify himself. He said he was in the federal building waiting for a scheduled briefing with federal officials, including a general, \"as part of my responsibility as a senator to provide oversight and accountability.\"\n\nHe said he heard that Noem was having a press conference in the same building and came to get more information, as he said he had been unable to get a meeting with DHS.\n\n\"I was there peacefully. At one point I had a question, and so I began to ask a question,\" he said. \"I was almost immediately forcibly removed from the room. I was forced to the ground, and I was handcuffed. I was not arrested. I was not detained.\"\n\nVideo of Padilla's removal quickly spread online. Prominent Democrats from lawmakers to California Gov. Gavin Newsom, a Democrat,posted a videoof the incident.\n\nIn one video of the exchange, Padilla can be heard identifying himself as he's pushed away. It later showsPadilla being handcuffedon the floor once he's taken from the room of the event.\n\nAhead of the press conference, the department said the event was for Noem to \"show her support for DHS, law enforcement, and U.S. military personnel who are working to restore law and order.\"\n\nThe Trump administration hascalled on National Guard troops and Marinesin recent days in response to protests of the administration's immigration enforcement tactics.\n\nOn the Senate floor,Senate Minority Leader Chuck Schumer, D-N.Y.,referred to video of the incident saying, \"I just saw something that sickened my stomach; the manhandling of a United States Senator. We need immediate answers to what the hell went on.\"\n\nThe incident in Los Angeles became public as senators were preparing to finish their business in Washington for the week. Democrats chose to stay and deliver speeches condemning the Trump administration's immigration enforcement actions and the treatment of Padilla.\n\nDemocrat Adam Schiff, Padilla's fellow senator from California, vowed to hold the administration accountable.\n\n\"When a U.S. senator goes to demand answers about the lawfulness or lawlessness of these actions to see him tackled to the ground, brought to the ground, what is becoming of our democracy?\" he asked on the Senate floor. \"Are there no limits to what this administration will do? Is there no line they will not cross?\"",
        "source_2": "Reporting by Omar Younis in Los Angeles and Bo Erickson, David Morgan and Richard Cowan in Washington, additonal reporting by Alan Devall, Rami Ayyub, Jasper Ward and Christian Martinez; Editing by Caitlin Webber, Scott Malone, Lisa Shumaker and Nia Williams\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab",
        "source_3": "California Sen. Alex Padillawas chucked out of a Los Angeles news briefing as Homeland Security Secretary Kristi Noem discussed the ongoing anti-Immigration and Customs Enforcement riots that have engulfed the city — before being thrown to the ground and handcuffed.\n\nThe 52-year-old Democrat was hauled out of Noem’s briefing Thursday afternoon as she called California and LA leaders “socialists” who are working against the Trump administration.\n\n“Secretary, I want to know why you insist on exaggerating and embellishing,” Padilla said from the crowd, trying to cut Noem off mid-sentence.\n\n“Hands off!”he called as Noem kept speaking, and security began shoving him toward the doors.\n\n“I’m Sen. Alex Padilla, I have questions for the secretary,” he called as he wrestled with security. “Because the fact of the matter is that a half a dozen criminals that you’re rotating on your … on your …”\n\nPadilla was then cut off and yelled, “Hands off!” several times, before being finally pushed out of the room as the briefing continued.\n\nThe senator appeared to bereferencing a rogue’s gallery of illegal immigrantswith alarming criminal histories — ranging from rape to murder — arrested in the ICE raids that sparked LA’s riots nearly a week ago, which the DHS has been publicizing as protests continue.\n\nSeveral of their photos — including an illegal immigrant convicted of shooting up a high school graduation party in the 1990s — were being shown at the front of the room when Padilla interrupted.\n\nPadilla was forced to his knees outside of the room, and then pushed face-forward into the ground as officers held his hands behind his back and cuffed him, footage from the incident showed.\n\n“If this is how the DHS responds to a senator with a question, you can only imagine what they are doing to farmworkers, cooks, day laborers out in the Los Angeles community and throughout California and throughout the country,” Padilla said afterward.\n\nBut Noem told a much different version of events — insisting Padilla was detained because her Secret Service detachment was trying to protect her.\n\n“This man burst into the room, started lunging toward the podium, interrupting me and elevating his voice, and was stopped — did not identify himself — and was removed from the room,” she told Fox News’ “The Story with Martha MacCallum.”\n\n“The way that he acted was completely inappropriate. It wasn’t becoming a US senator or a public official. Perhaps he wanted the scene, and that’s what he wanted,” she added. “But I think the American people are sick of this kind of action. I think the American people are tired of this, they just want the truth.”\n\nPadilla and Noem met one-on-one for about 15 minutes once the press conference ended, and he was released and agreed to discuss the situation in LA further, the secretary said.\n\n“We probably disagree on 90% of the topics, but we agreed to exchange phone numbers, we’ll continue to talk and share information, and I think that’s the way it should be in this country. I wish he would have acted that way in the beginning instead of creating a scene like this,” Noem said.\n\nDemocratic leaders quickly began sounding off about the incident.\n\n“If they can handcuff a U.S. Senator for asking a question, imagine what they will do to you,” California Gov. Gavin Newsom tweeted.\n\n“I just saw something that sickened my stomach — the manhandling of a United States senator,” Senate Minority Leader Chuck Schumer said from the Senate floor afterward, Reuters reported.\n\nLA Mayor Karen Bass called Padilla’s detainment “absolutely abhorrent and outrageous.”\n\n“He is a sitting United States Senator,” she wrote on X. “This administration’s violent attacks on our city must end.”\n\nNoem had been saying the federal government — which has dispatched hundreds of Marines and thousands of National Guard troops to LA — would remain undeterred in its efforts to “liberate this city” when Padilla cut in.\n\n“We are staying here to liberate this city from the socialist and the burdensome leadership that this governor and this mayor have placed on this country,” she said, referring to Newsom and Bass, both Democrats.\n\nHouse Speaker Mike Johnson (R-La.) suggested that Padilla should be censured — or formally rebuked by Congress for his actions, which he said were “wildly inappropriate.”\n\n“It’s beneath a US senator; they are supposed to lead by example. That is not a good example,” Johnson told reporters during a gaggle celebrating passage of the rescissions package.\n\n“We have to turn the temperature down in this country, not escalate it. The Democratic Party is on the wrong side. They’re defending lawbreakers and now they’re acting like lawbreakers themselves,” he added.\n\n“That’s oversight? Charging a cabinet secretary in a press conference, I beg to differ,” he said when asked about Padilla’s characterizations of the confrontation.\n\nJohnson, who founded the honor and civility caucus in Congress in 2017, noted that the House is unlikely to probe the matter and will likely defer to the Senate to investigate the situation.\n\nDuring his interaction with the press to take a victory lap on rescissions, Democrats strolled by and jeered him, with one yelling, “You’re full of it, Mike,” while another shouted, “That’s a lie.”\n\nAfter he wrapped up, Rep. Madeleine Dean (D-Pa.) walked up and had a stern conversation with him in front of the press, pleading with the speaker to urge the president to turn down the temperature.\n\nPadilla, a Los Angeles native with Mexican immigrant parents, was appointed US senator for California by Gov. Newsom to fill Kamala Harris’ seat when she was sworn in as vice president in 2021. He won the seat in the 2022 election.\n\nHe has been openly critical of the Trump administration’s response to the LA riots since they were sparked by mass ICE arrests of illegal immigrants on Friday.\n\n“This is not a rebellion,” he insisted to NBC Los Angeles on Monday, apparently in response to President Trump and his officials describing the protests as “insurrection.”"
    }
}