{
    "question": "In what ways might perceptions of who is being targeted for deportation shape public support for Trump’s policy and for deploying National Guard troops in Los Angeles, and what implications could this have for federal-state relations?",
    "content": {
        "source_1": "Views of the Trump administration's deportation program headed into this weekend with positive net approval from Americans, including continued strong backing from the Republican base — but also heavily shaped by contrasting views about which people, and how many, are being targeted for deportation.\n\nA slight majority feel the administration'sdeportationefforts are prioritizing people they believe are dangerous criminals. Those who say this are very supportive of the program, and feel the program is making people in the U.S. safer.\n\nBut if people don't think it is dangerous criminals who are the focus of the deportation effort, support drops dramatically.\n\nThe survey was completed just prior toSaturday's protestsand events in Los Angeles.\n\nIn terms of how many people the administration is trying to deport,more is not necessarily better in the public mind.\n\nHalf of Americans say Trump isdeportingmore people than they thought he would during the 2024 campaign. And most in this group disapprove of the deportation program.\n\nSome of this is tied to views on process: those people are also more apt than others to say potential deportees should get a hearing anddue process.\n\nOn balance, more people see the program making the U.S. safer, compared to less safe.\n\nThat's related to the fact that more believe the administration is prioritizing the deportation of people who they believe are dangerous criminals.\n\nFor the Americans who feel the administration is trying to deport more people than they expected, they're less approving of the program.\n\nOn that topic of process, big percentages of Americans continue to say it is not acceptable if legal residents are mistakenly deported as part of the program. MAGA Republicans are more divided on this question, but a majority say it wouldn't be acceptable.\n\nA lot of this is partisan, and over time, it has become even more so. Independents aren't as supportive of the deportation program as they were a couple of months ago, leaving the GOP base as the only partisan group with majority backing of the program now. But it is an overwhelming one among Republicans.\n\nThen, there's also the potential economic impact. Unlike the net-positive views about safety, more Americans think the deportation program will weaken than strengthen the economy.\n\nViews on the economic impact also show some connection to longstanding views about immigrants more generally (though not necessarily those in the country illegally).\n\nThose who feel immigrants take jobs away from Americans are far more approving of the deportation program. (It's a view that is much more tied to ideology and partisanship than income, with majorities of conservatives and Republicans saying this about immigrants.)\n\nA larger share of Americans say immigrants generally fill jobs Americans won't do. That in turn is related to the view that the deportation program will weaken the U.S. economy.\n\nIn sum, there's a gap regarding the deportation program, with more people saying they like the goals than the approach.\n\nViews of the national economy have stabilized a bit — they aren't majority positive (and have not been for years), but are off the 2025 lows they hit late this past winter.\n\nSupport for newtariffsin general remains net negative. Americans continue to think they will lead to higher prices at least in the short run, and often in the long run too. That's generally been the case for a while.\n\nHere again, more people like what they think are Trump's goals with tariffs than his approach.\n\nMost Americans think the president is trying to help U.S. manufacturing and business. (There's plenty of cynicism too, with even more saying he's trying to help the wealthy.)\n\nOn another economic front, few people feel they know a lot of the specifics of theOne Big Beautiful Bill Actright now. This isn't too different from the initial phases of other big bills in Congress of past years, like theBuild Back Better Act in 2021, for example. That may be a function of the fact that the legislation is still being debated. Most do feel they have a general sense of it.\n\nViews about the potential impact are mixed and may reflect that collective unfamiliarity with the bill. (Though the people who think they know a lot of the specifics are more likely to think it will hurt them, as well as raise their taxes.)\n\nGiven the stated goals of the bill include keeping the Trump tax cuts in place, a combined majority of Americans do think it'll either lower or not impact their taxes either way.\n\nBut in terms of groups, only about a third of Americans think this bill would help the middle or working class, and most think it will hurt poor people\n\nAmericans think this bill will decrease health insurance coverage, not increase it, and a majority says the bill would increase the federal deficit. (Comparably fewer Republicans think the deficit will increase, though. For context, historically the party's rank and file have seen tax and spending cuts as a spur to long term growth that could lower it.)\n\nTrump's approval rating on immigration continues to be higher than his marks on the economy and inflation. As has typically been the case in his second term, he gets his highest specific ratings from Republicans on immigration. His overall job approval remains unchanged.\n\nMeanwhile, as focus turns more toward Congress as they debate the bill, we do see doubts among Democrats — whose party is in the minority — about their party's perceived ability to challenge Trump's policies.\n\nOf the three — Trump, the Republicans, and the Democrats — no one is above water with a majority on being seen as \"fighting for people like you.\" But Donald Trump does rank highest on the \"fights for\" by comparison.\n\nBut there is mostly the view among Democrats that their party hasn't been effective at challenging Donald Trump's policies.\n\nThis CBS News/YouGov survey was conducted with a nationally representative sample of 2,428  U.S. adults interviewed between June 4-6, 2025. The sample was weighted to be representative of adults nationwide according to gender, age, race, and education, based on the U.S. Census American Community Survey and Current Population Survey, as well as 2024 presidential vote. The margin of error is ±2.4 points.\n\nAnthony Salvanto, Ph.D., is CBS News' executive director of elections and surveys. He oversees the CBS News Poll and all surveys across topics and heads the CBS News Decision Desk that estimates outcomes on election nights",
        "source_2": "Martha McHardy is a U.S. News reporter based in London, U.K. Her focus is on polling and California politics. She has covered U.S. news extensively, including the 2024 election and pro-Palestine protests at U.S. colleges. Martha joined Newsweek in 2024 fromThe Independentand had previously freelanced atThe Sun,The MirrorandMyLondon. She is a graduate of Durham University and did her NCTJ at News Associates. You can get in touch with Martha by emailing m.mchardy@newsweek.com. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nPresidentDonald Trump's hard-line immigration agenda is drawing fierce backlash in cities like Los Angeles—where protests have turned violent—but polls show Americans are divided over his approach, particularly along party lines.\n\nThe Trump administration has pledged to carry out thelargest mass deportation in U.S. historyand has conducted numerousICEraids, some of which have swept up people with proper documentation.\n\nThe president on Saturday evening announced that he had authorized the deployment of 2,000 National Guard troops to Los Angeles after reported violence against law enforcement, specifically ICE agents carrying out deportation raids in the city.\n\nWhile the raids are following a legal directive from federal authorities, protests have erupted amid reports that detainees were being held in the basement of a federal building. ICE denied these allegations, with a spokesperson previously tellingNewsweekthe agency \"categorically refutes the assertionsmade by immigration activists in Los Angeles.\"\n\nThe clashes highlight deepening conflicts between sanctuary jurisdictions and federal immigration policy, as Trump has implemented sweeping changes through executive orders and utilized the wartimeAlien Enemies Act of 1798to expand deportation authority.\n\nAs Trump intensifies his immigration crackdown, Americans remain sharply divided over his deportation agenda, with public opinion fractured along political, demographic and generational lines.\n\nA CBS News/YouGov poll conducted June 4–6 found that 54 percent of Americans approve of Trump's deportation policy—higher than his approval ratings on the economy (42 percent) or inflation (39 percent). The poll was completed just days before the president deployed National Guard troops to Los Angeles on June 8, following escalating protests.\n\nTrump's strongest support on immigration comes from within his party, with 93 percent ofRepublicansbacking his deportation policy, compared with only 18 percent ofDemocrats. Independents are more split, with 49 percent in favor. But beneath those partisan lines lies a more complex picture.\n\nWhile over 50 percent of Americans say they support Trump's overall goals on deportation, 56 percent disapprove of how those goals are being carried out. Asked who the administration is prioritizing for removal, 53 percent said \"dangerous criminals,\" while 47 percent believe the focus is on people who are not dangerous.\n\nMany Americans also say Trump's tactics have gone further than they expected. Forty-nine percent believe he is attempting to deport more people than he suggested during the campaign; only 10 percent say fewer, and 41 percent think the numbers are about the same.\n\nThere is strong support for due process in deportation proceedings. Sixty-three percent believe noncitizens should be guaranteed a court hearing or other legal protection. An overwhelming 79 percent say it would be unacceptable for a U.S. resident to be mistakenly deported under Trump's program.\n\nDespite the administration's push to roll back birthright citizenship, 70 percent of Americans say the constitutional guarantee should remain in place.\n\nMeanwhile, a June 9-10 poll by YouGov of 4,309 U.S. adults shows that just 34 percent of Americans approve of deploying Marines in Los Angeles, while 47 percent disapprove. On Monday, the Trump administration activated about 700 active-duty Marines who could be sent to Los Angeles, joining National Guard troops.\n\nA separate YouGov poll conducted June 9 among 4,231 U.S. adults showed similar discontent with how deportations are being handled. Just 39 percent said they approve of the Trump administration's approach, while 50 percent disapprove.\n\nDemographic divides remain stark. White Americans were the only racial group where a plurality—44 percent—approve of Trump's handling of deportations, with 46 percent disapproving. Among Black Americans, 63 percent disapprove and only 25 percent approve. For Hispanic and other non-white respondents, approval stood at just 35 percent, with 55 and 53 percent, respectively, disapproving.\n\nAge is also a key factor. Only 34 to 35 percent of adults under 45 approve of Trump's deportation policy, compared to 41 percent of those aged 45–64, and 46 percent of seniors. Younger Americans were also the most likely to disapprove: 52 percent among both 18-to-29-year-olds and 30-to-44-year-olds.\n\nA significant gender gap has also emerged. Forty-eight percent of men said they approve of Trump's handling of deportations, compared to just 31 percent of women. While 45 percent of men disapprove, a majority of women—55 percent—oppose his approach. Women were also more likely to say they were unsure.\n\nPartisan divisions remain deep. Eighty-four percent of Republicans approve of Trump's actions on deportation, compared to 10 percent of Democrats and 30 percent of independents.\n\nAmid federal intervention in Los Angeles, most Americans say state and local governments—not Washington—should lead the response. That view is held by 56 percent overall, including 72 percent of Democrats and 56 percent of independents. Just 25 percent believe the federal government should take charge.\n\nAmericans are also divided over the protests that erupted in Los Angeles in response to ICE activity. Forty-five percent disapprove of the demonstrations, while 36 percent support them. Among Democrats, 58 percent approve, compared to just 15 percent of Republicans.\n\nAsked whether the protests were mostly peaceful or mostly violent, Americans were nearly evenly split—38 percent said peaceful, 36 percent said violent. Two-thirds of Republicans said they believe the protests were mostly violent.\n\nSince Trump ordered the National Guard into Los Angeles, protests have at times descended into riots, with reports of arson, vandalism, looting, and attacks on law enforcement. However, many protesters continue to demonstrate peacefully, and critics say Trump's heavy-handed response is inflaming tensions.\n\nOverall, voters remain split on the president's broader immigration agenda. A Morning Consult poll conducted June 6–8 among 1,867 registered voters found 51 percent approve of Trump's handling of immigration—matching his lowest rating of the term.\n\nIn the CBS/YouGov poll, Americans were evenly divided: 50 percent approve of Trump's immigration policies, while 50 percent disapprove—a balance that has held steady since April.\n\nStill, Trump's favorability rating is substantially higher that of California Governor Gavin Newsom, who has said he is suing the Trump administration over its order to deploy National Guard troops to Los Angeles without his approval.\n\nThe lawsuit says Trump \"invoked emergency powers to exceed the bounds of lawful executive authority.\"\n\nYouGov polling shows that Trump's favorability rating stands at 40 percent, while Newsom's stands at 34 percent.\n\nGovernor Gavin Newsom posted on X, formerly Twitter, on Sunday:\"I have formally requested the Trump administration rescind their unlawful deployment of troops in Los Angeles County and return them to my command.\n\n\"We didn't have a problem until Trump got involved. This is a serious breach of state sovereignty—inflaming tensions while pulling resources from where they're actually needed. Rescind the order. Return control to California.\"\n\nPresident Donald Trump, in a post to Truth Social on Monday:\"We made a great decision in sending the National Guard to deal with the violent, instigated riots in California. If we had not done so, Los Angeles would have been completely obliterated.\"\n\nDemonstrations against ICE actions are expected to continue in Los Angeles and other major cities in the coming days.\n\nCoordinated nationwide protestsagainst Trump and his administration's policies are also planned to take place in cities in all 50 states on the president's birthday on June 14.\n\nUpdate 6/10/25, 10:58 a.m. ET: This article has been updated with additional information.\n\nMartha McHardy is a U.S. News reporter based in London, U.K. Her focus is on polling and California politics. She has covered U.S. news extensively, including the 2024 election and pro-Palestine protests at U.S. colleges. Martha joined Newsweek in 2024 fromThe Independentand had previously freelanced atThe Sun,The MirrorandMyLondon. She is a graduate of Durham University and did her NCTJ at News Associates. You can get in touch with Martha by emailing m.mchardy@newsweek.com. Languages: English.\n\nMartha McHardy is a U.S. News reporter based in London, U.K. Her focus is on polling and California politics. She has covered U.S. news extensively, including the 2024 election and pro-Palestine protests at U.S. colleges. Martha joined Newsweek in 2024 fromThe Independentand had previously freelanced atThe Sun,The MirrorandMyLondon. She is a graduate of Durham University and did her NCTJ at News Associates. You can get in touch with Martha by emailing m.mchardy@newsweek.com. Languages: English.\n\nMartha McHardy is a U.S. News reporter based in London, U.K. Her focus is on polling and California politics. She                                    ...Read more",
        "source_3": "CNN’s chief data reporter said a sharp rise in public approval for PresidentDonald Trump’simmigrationpolicies emboldened his decision to send 2,000National Guardtroops toLos Angelesamid violent protests over immigration enforcement.\n\nDuring a Monday segment onCNN News Central, data analyst Harry Enten explained that Trump’s net approval on immigration has experienced a dramatic shift since his first term — it has moved from negative 21% in 2017 to plus-1% today, according to aggregate polling.\n\n“This is Trump’s net approval rating on immigration,” Enten told host John Berman. “It’s gone up like a rocket now versus eight years ago during Trump’s first term.”\n\nEnten said the public’s support for Trump’s immigration strategy, especially among voters in areas directly affected by border policy and federal enforcement operations, is giving the president confidence to act decisively, even if it triggers clashes with Democratic state leaders.\n\n“Trump is begging for a fight on this because he knows what he’s doing so far is working with the American electorate,” Enten said. “It’s not just on the broad issue of immigration where Trump is doing well — it’s on the specifics.”\n\nA new CBS Newspollbacks up Enten’s analysis. According to the survey, 54% of the public supports Trump’s recent mass deportation orders, and 51% support Immigration and Customs Enforcement’s operations within local communities. These numbers mark a significant uptick from similar polling during Trump’s first presidency.\n\nEnten cited an Ipsos poll that found Republicans enjoy a 19-point advantage over Democrats on the issue of immigration.\n\n“Americans believe that Democrats just don’t have a clue on immigration,” Enten said, noting the GOP’s credibility on the issue has grown substantially since 2024.\n\nTrump deployed National Guard troops to Los Angeles over the weekend after ICE agents arrested numerous illegal immigrants, many of them with serious criminal records, including assault with a deadly weapon, grand theft, and attempted rape.\n\nLA IMMIGRATION RIOTS: WHAT TO KNOW ABOUT THE PROTESTS, TRUMP’S RESPONSE, AND MORE\n\nThe arrests triggered large-scale protests and violent clashes in parts of the city, with rioters setting vehicles on fire, launching fireworks and Molotov cocktails, and vandalizing buildings with anti-ICE slogans, including “KILL ICE.”\n\nIn response, Trump authorized the deployment of 2,000 National Guard members — a move Gov. Gavin Newsom (D-CA) condemned as “manufacturing a crisis.” Los Angeles Mayor Karen Bass also blasted the action as an abuse of federal power."
    }
}