{
    "question": "What are the potential implications of Mark Zuckerberg spearheading a new “superintelligence” team at Meta for the company’s AI trajectory, the broader competitive landscape, and debates over safety and governance?",
    "content": {
        "source_1": "The new lab, set to include the Scale AI founder Alexandr Wang, is part of a reorganization of Meta’s artificial intelligence efforts under Mark Zuckerberg.\n\nMeta is preparing to unveil a new artificial intelligence research lab dedicated to pursuing “superintelligence,” a hypothetical A.I. system that exceeds the powers of the human brain, as the tech giant jockeys to stay competitive in the technology race, according to four people with knowledge of the company’s plans.\n\nMeta has tapped Alexandr Wang, 28, the founder and chief executive of the A.I. start-up Scale AI, to join the new lab, the people said, and has been in talks toinvest billions of dollars in his companyas part of a deal that would also bring other Scale AI employees to the company. Meta has offered seven- to nine-figure compensation packages to dozens of researchers from leading A.I. companies such as OpenAI and Google, with some agreeing to join, according to the people.\n\nThe new lab is part of a larger reorganization of Meta’s A.I. efforts, the people said. The company, which owns Facebook, Instagram and WhatsApp, has recently grappled with internal management struggles over the technology, as well as employee churn and several product releases that fell flat, two of the people said.\n\nMark Zuckerberg, Meta’s chief executive, has invested billions of dollars into turning his company into an A.I. powerhouse. Since OpenAIreleased the ChatGPT chatbot in 2022, the tech industry has raced to build increasingly powerful A.I. Mr. Zuckerberg has pushed his company to incorporate A.I. across its products, including in its smart glasses and a recently released app, Meta AI.\n\nStaying in the race is crucial for Meta, Google, Amazon and Microsoft, with the technology likely to be the future for the industry. The giants have pumped money into start-ups and their own A.I. labs. Microsoft hasinvested more than $13 billionin OpenAI, while Amazon hasplowed $8 billioninto the A.I. start-up Anthropic.\n\nThe behemoths have also spent billions tohire employees from high-profile start-upsand license their technology. Last year, Google agreed to pay $3 billion to license technology and hire technologists and executives from Character.AI, a start-up that builds chatbots for personal conversations.\n\nWe are having trouble retrieving the article content.\n\nThank you for your patience while we verify access. If you are in Reader mode please exit andlog intoyour Times account, orsubscribefor all of The Times.\n\nThank you for your patience while we verify access.",
        "source_2": "Reporting by Gursimran Kaur in Bengaluru; Editing by Nivedita Bhattacharjee\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nNvidia and AMD have agreed to give the U.S. government 15% of revenue from sales to China of advanced computer chips, a U.S. official said on Sunday, in an unusual move likely to faze American companies.\n\nReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.\n\nAccess unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.\n\nBrowse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.\n\nScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.\n\nAll quotes delayed a minimum of 15 minutes.See here for a complete list of exchanges and delays.",
        "source_3": "Mark Zuckerberg is personally assembling a team of experts to achieve artificial general intelligence (AGI) in a move to accelerate Meta’s AI development.\n\nBloombergreportsthat Meta CEO Mark Zuckerberg is taking a hands-on approach to accelerate the company’s AI development by personally recruiting a team of experts to achieve artificial general intelligence (AGI). The secretive new team, referred to internally as the “superintelligence group,” is part of Zuckerberg’s audacious goal to outstrip other tech giants in the race to develop machines capable of performing as well as humans at many tasks.\n\nAccording to people familiar with the matter, Zuckerberg aims to hire around 50 people for the new team, including a new head of AI research. The CEO has been actively involved in the recruitment process, meeting with potential candidates at his homes in Lake Tahoe and Palo Alto. To facilitate collaboration, Zuckerberg has rearranged desks at Meta’s Menlo Park headquarters so that the new staff will sit near him.\n\nThe formation of the superintelligence group comes in tandem with Meta’s planned multi-billion dollar investment in Scale AI, a startup that offers data services to help companies train their AI models. Scale AI founder Alexandr Wang is expected to join the superintelligence group once the deal is finalized. This investment is set to become Meta’s largest external investment to date, underscoring the company’s commitment to advancing its AI capabilities.\n\nZuckerberg’s increased involvement in AI development is  reportedly driven, in part, by his frustration over the quality and response to Llama 4, the latest version of Meta’s large language model designed to power chatbots and other services. Despite the company’s efforts to deliver the best AI offering by the end of the year, the latest release in April fell short of expectations, leading to disappointment both internally and externally.\n\nThese setbacks have prompted Zuckerberg to take a more active role in shaping Meta’s AI strategy. He has been compiling his own list of potential recruits and prefers to be the first point of contact during outreach. By assembling a dedicated team of experts, Zuckerberg hopes to see improvements in Meta’s Llama models and the development of better AI tools for voice and personalization features.\n\nBreitbart Newspreviously reportedthat Zuckerberg has a wide range of interests for the future of AI, including Americans having AI-generated “friends” to chat with on social media:\n\nZuckerberg claims that the average American “has fewer than three friends — three people they consider friends — and the average person has demand for, I think it’s something like 15 friends.”\n\n“The average person wants more connection than they have,” the Meta CEO said, before acknowledging the public’s concern around AI, as they wonder, “Is this going to replace in-person connections or real-life connections?”\n\n“And my default is: Probably no,” Zuckerberg said. “I think there are all these things that are better about physical connections when you can have them, but the reality is that people just don’t have the connections, and they feel more alone a lot of the time than they would like.”\n\nThe billionaire added that he believes “a lot of these things” about AI that “might be” stigmatized will eventually get worked out “over time,” and people will realize that those who use AI for these types of connections “are rational for doing it” and “actually adding value to their lives.”\n\nLucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship."
    }
}