{
    "question": "How might the new OPM requirement that applicants write four essays—including one on advancing the president’s executive orders—shape who applies for federal jobs and how agencies evaluate merit?",
    "content": {
        "source_1": "As the government hiring freeze nears its end, the U.S. Office of Personnel Management has released new guidelines for hopeful federal employees\n\nWhile the first four months of PresidentDonald Trump’s second term have been characterized bymass layoffsand hiring freezes, the government is about to start accepting new employees — with one major new requirement.\n\nThe U.S. Office of Personnel Management laid out the guidelines for hopeful applicants in aMay 29 memo. In keeping with Trump’s rejection ofdiversity, equity and inclusionhiring practices, the memo stresses that the “Merit Hiring Plan” focuses on “skills-based hiring, eliminating unnecessary degree requirements, and requiring the use of rigorous, job-related assessments to ensure candidates are selected based on their merit and competence, not their skin color or academic pedigree.”\n\nOne of those \"assessments,\" the memo explains, is four 200-word essay questions each applicant must answer in order to prove that they would be a good fit for the Trump administration.\n\nThe questions, particularly the third, ask the applicant to prove their mettle not only through personal qualification, but also with an ideological alignment with the administration’s existing policies.\n\nUpon his inauguration on Jan. 20, Trump implemented a federal hiring freeze, whichhe later extendedto July 15. In February, he issued another executive order implementing a “workforce optimization initiative\" with the assistance of theDepartment of Government Efficiency, which was headed byElon Muskuntil recently.\n\nThe order explained that, when the hiring freeze was lifted, government agencies were to hire only one employee for each four that had left or been laid off.\n\nFollowing that order and several others reflecting the administration’s plan to “prioritize recruitment of individuals committed to improving the efficiency of the Federal government,passionate about the ideals of our American republic, and committed to upholding the rule of law and the United States Constitution,” 21 DOGE employeessubmitted their resignations.\n\nThe employees claimed that, beginning one day after Trump's inauguration, they had been taken in for 15-minute interviews with individuals wearing White House visitor badges, who refused to identify themselves and ”asked questions about political loyalty, attempted to pit colleagues against each other, and demonstrated limited technical ability.”\n\n“We will not use our skills as technologists to compromise core government systems, jeopardize Americans’ sensitive data, or dismantle critical public services,” the letter continued. “We will not lend our expertise to carry out or legitimize DOGE's actions.”\n\nFor his part, Musk left theWhite Houseon Friday, May 30, as his 130-day limit as a special government employee had come to an end.On his way out, the tech billionaire also issued some criticisms of Trump’s administration, claiming that the president’s touted “Big Beautiful Bill” was set to undermine all the work he’d done at DOGE.\n\n“I was disappointed to see the massive spending bill, frankly, which increases the budget deficit, not just decreases it, and undermines the work that the DOGE team is doing,” he toldCBS Sunday Morningin an interview that aired on June 1.\n\nThe \"Big, Beautiful Bill\" is funding its tax cuts and military spending in part by cutting some federal health and energy programs. However, it is also poised to add an estimated $3.8 trillion to the national deficit, according to the nonpartisanCongressional Budget Office.\n\n“I think a bill can be big or it can be beautiful, but I don’t know if it can be both,\" Musk said.",
        "source_2": "Kate Plummer is a Newsweek reporter based in London, U.K. Her focus is on U.S. politics and national affairs, and she is particularly interested in the impact of social policy decisions on people as well as the finances of political campaigns, corruption, foreign policy, democratic processes and more. Prior to joining Newsweek, she covered U.K. politics extensively. Kate joined Newsweek in 2023 fromThe Independentand has also been published in multiple publications includingThe Timesand theDaily Mail. She has a B.A. in History from the University of Oxford and an M.A. in Magazine Journalism from City, University of London.\n\nYou can get in touch with Kate by emailingk.plummer@newsweek.com, or by following her on X at @kateeplummer.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nThose seeking a job in the federal government will now have to write an essay in support of PresidentDonald Trump's executive orders, according to a memo from the Office of Personnel Management.\n\nVince Haley, the White House's head of domestic policy, wrote in the May 29 memorandum that all civil service applicants must answer a series of essays as part of the job recruitment process, including one about how they would \"help advance\" Trump's policy priorities.\n\nNewsweekhas contacted the Office of Personnel Management for comment via email outside normal working hours.\n\nSince assuming office in January, Trump has overseen a shake-up of the federal workforce, implementing hiring freezes and mass layoffs to downsize the government in the name of efficiency. The president's actions havesparked criticismandlegal challenges.\n\nWith the federal hiring freeze scheduled to end on July 15, the government has begun to consider how it will recruit workers moving forward.\n\nAccording to the memo, the federal government's strategy to hire people to the civil service, dubbed the \"Merit Hiring Plan,\" will require certain applicants to write four 200-word essays about their work ethic, skills and experience, commitment to the Constitution, and plans to \"advance the President's Executive Orders and policy priorities.\"\n\n1. How has your commitment to the Constitution and the founding principles of the United States inspired you to pursue this role within the Federal government? Provide a concrete example from professional, academic, or personal experience.\n\n2. In this role, how would you use your skills and experience to improve government efficiency and effectiveness? Provide specific examples where you improved processes, reduced costs, or improved outcomes.\n\n3. How would you help advance the President's Executive Orders and policy priorities in this role? Identify one or two relevant Executive Orders or policy initiatives that are significant to you, and explain how you would help implement them if hired.\n\n4. How has a strong work ethic contributed to your professional, academic or personal achievements? Provide one or two specific examples, and explain how those qualities would enable you to serve effectively in this position.\n\nThe plan, as outlined in the memo, would also decrease hiring time for new candidates to under 80 days; implement a skills-based hiring approach that would reduce the need for \"unnecessary degree requirements\"; and end the use of diversity, equity and inclusion programs in hiring and recruitment, which the memo described as \"racial discrimination.\"\n\nScott Lucas, a professor in international politics at University College Dublin, toldNewsweekthat Project 2025 \"set this out\" with government cuts and other Trump initiatives, so the news was not surprising. \"This is an authoritarian regime,\" he said.\n\nAdam Bonica, a political scientist at Stanford University, wrote in a Substack post: \"A merit-based civil service that took generations to build is being dismantled via memo.\"\n\nMax Stier, the president of the nonprofit Partnership for Public Service, told Axios: \"They're emptying the shelves of the existing nonpartisan expert civil servants, and they're restocking with the loyalists.\"\n\nPaul Light, a professor emeritus of public service at New York University, told Politico: \"I think it's foolish. It's hard enough to get talent these days.\"\n\nThe Office of Personnel Management said in the memorandum: \"The American people deserve a federal workforce dedicated to American values and efficient service.\"\n\nMore cuts to the federal government are planned. The White House has said that when the hiring freeze ends, it will allow agencies to hireno more than one employeefor every four employees that have left the federal service.\n\nCorrected on 06/05/2025 at 6:28 p.m. ET to correct reference to federal government\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nKate Plummer is a Newsweek reporter based in London, U.K. Her focus is on U.S. politics and national affairs, and she is particularly interested in the impact of social policy decisions on people as well as the finances of political campaigns, corruption, foreign policy, democratic processes and more. Prior to joining Newsweek, she covered U.K. politics extensively. Kate joined Newsweek in 2023 fromThe Independentand has also been published in multiple publications includingThe Timesand theDaily Mail. She has a B.A. in History from the University of Oxford and an M.A. in Magazine Journalism from City, University of London.\n\nYou can get in touch with Kate by emailingk.plummer@newsweek.com, or by following her on X at @kateeplummer.\n\nKate Plummer is a Newsweek reporter based in London, U.K. Her focus is on U.S. politics and national affairs, and she is particularly interested in the impact of social policy decisions on people as well as the finances of political campaigns, corruption, foreign policy, democratic processes and more. Prior to joining Newsweek, she covered U.K. politics extensively. Kate joined Newsweek in 2023 fromThe Independentand has also been published in multiple publications includingThe Timesand theDaily Mail. She has a B.A. in History from the University of Oxford and an M.A. in Magazine Journalism from City, University of London.\n\nYou can get in touch with Kate by emailingk.plummer@newsweek.com, or by following her on X at @kateeplummer.\n\nKate Plummer is a Newsweek reporter based in London, U.K. Her focus is on U.S. politics and national affairs, and                                    ...Read more",
        "source_3": "This, put simply, is such a good idea and I am so happy to see it.\n\nThe Trump admin is trying to replace decades of libs being hired as bureaucrats in the federal government, having wormed their ways into the deepest halls of power, and is requiring new hires to - you know - support the administration and the Constitution.\n\nHere are the 4 shocking and disturbing questions that new hires will be asked.\n\n1. How has your commitment to the Constitution and the founding principles of the United States inspired you to pursue this role within the Federal government? Provide a concrete example from professional, academic, or personal experience.\n\nOh no! We want to know how the Constitution influences federal employees? This is the end of the country as we know it! America is so over.\n\n2. In this role, how would you use your skills and experience to improve government efficiency and effectiveness? Provide specific examples where you improved processes, reduced costs, or improved outcomes.\n\nHow dare the government hire people who want to help the government run efficiently?\n\n3. How would you help advance the President's Executive Orders and policy priorities in this role? Identify one or two relevant Executive Orders or policy initiatives that are significant to you, and explain how you would help implement them if hired.\n\nThis is the one that made libs set their hair on fire.\n\nThe Trump administration is asking people that they are hiring whether or not they're willing to ... work for the Trump administration and not undermine them.\n\nMy favorite is the idea that the current crop of federal employees is \"nonpartisan\" and \"expert.\"\n\n4. How has a strong work ethic contributed to your professional, academic or personal achievements? Provide one or two specific examples, and explain how those qualities would enable you to serve effectively in this position.\n\nThey want people who work hard, will help to shrink the government, will obey executive orders...\n\nAccess comments and our fully-featured social platform."
    }
}