{
    "question": "How might Michael Pratt’s guilty plea and upcoming sentencing influence accountability within the adult entertainment industry and among online platforms that hosted GirlsDoPorn content, as well as the support and restitution available to victims?",
    "content": {
        "source_1": "The mastermind of a vast conspiracy that tricked and coerced young women into filming pornographic videos that were posted online without their consent pleaded guilty Thursday in San Diego federal court to two sex-trafficking charges that could see him sentenced to life in prison.\n\nMichael James Pratt, the 42-year-old New Zealand citizen whocreated and operatedthe website GirlsDoPorn, pleaded guilty to one count of sex trafficking by force, fraud or coercion and one count of conspiracy to commit the same crime.\n\nPratt admitted in his plea agreement that between 2012 and 2019, he conspired to traffic 15 victims, though authorities have said that’s just a fraction of the actual victims of the conspiracy. More than 120 women have beeninvolved in civil litigationagainst GirlsDoPorn, its related websites and free pornographysites such as PornHub that hosted GirlsDoPorn clipsand generated tens of millions of views. Many of the women have testified that the public videos destroyed their lives.\n\nU.S. District Judge Janis Sammartino set Pratt’s sentencing for September. Dozens of women are expected to give victim impact statements at the hearing, as they did for the sentencing of a co-defendant last year.\n\nThose victims said they suffered relentless torment after online trolls posted their full names and other identifying information online. Some had links or images from the videos emailed to family members, bosses and college administrators. Many spoke of losing careers and lifelong friendships, changing their names and appearances or having to drop out of school or transfer universities. Some talked of abusing substances to numb themselves and contemplating or attempting suicide.\n\nIn court Thursday, Pratt acknowledged that the sex-trafficking charge carries a 15-year mandatory minimum sentence, that both charges carry the potential for a lifetime prison sentence and that if he’s ever released, he’ll be deported to New Zealand.\n\nWhen Sammartino asked if he was satisfied with his legal representation, Pratt answered “somewhat,” then told the judge that “nothing’s really been done since I’ve been (in custody).” Under further questioning, he said he’ll be satisfied if his court-appointed attorney “helps me during sentencing.”\n\nPratt admitted in his plea agreement that he and those who worked for him recruited young women online from across the country as models, but when they arrived in San Diego, they were pressured to have sex on camera. The women were told the videos would go to private DVD collections overseas, but instead they were widely disseminated on the GirlsDoPorn network of sites and free pornography sites.\n\nA woman identified in the plea agreement as Victim 1 was 18 years old when Pratt admitted that he “rushed (her) through a contract and did not provide her with a copy.” He paid her $2,000 and then ignored her pleas to take the video down when it was posted online nine months later, he admitted.\n\nPratt admitted in the plea agreement that GirlsDoPorn and its related websites netted him millions of dollars in revenue.\n\nProsecutors said Pratt liquidated his assets in 2019 and fled the U.S. At the time, he was in the midst of a civil trial in which a San Diego Superior Court judge eventually awardednearly $13 million to 22 womenwho had sued him and several others involved with the GirlsDoPorn site. Later that year, federal prosecutors unsealed a sprawling indictment with Pratt as the lead defendant. As each of his co-conspirators eventually pleaded guilty and were sentenced, Prattremained an international fugitive.\n\nHe wascaptured in 2022 in Spainjust months after the FBI placed him on itsTen Most Wanted Fugitives List, thenextradited to the U.S. last yearon the same day Sammartino sentenced his childhood friend and co-defendant Matthew Isaac Wolfe to 14 years in prison.\n\nWolfe admitted to running the day-to-day operations of GirlsDoPorn, managing the finances, marketing the content and serving as cameraman for about 100 videos.\n\nSammartino sentenced adult-film actor Ruben Andre Garcia to20 years in prison— a term that Garcia is now appealing — and Theodore “Teddy” Gyi, a cameraman who filmed about 120 of the videos, to four years in prison. Valorie Moser, a former bookkeeper, is scheduled to be sentenced a few days after Pratt.\n\nAside from the main criminal prosecution, the GirlsDoPorn case has spawned several related criminal cases and civil lawsuits.\n\nAlexander Brian Foster, who filmed about 100 GirlsDoPorn videos, was sentenced to one year in federal prison forcreating a retaliation video meant to harass the women and lawyerswho filed the civil suit in San Diego Superior Court.\n\nDouglas “James” Wiederhold, who has been linked in civil litigation to a GirlsDoPorn-style “mom” porn site for women over 30 years old, is awaiting a December sentencing after pleading guilty last year to sex trafficking by force, fraud or coercion. He admitted to appearing as the male actor in 71 GirlsDoPorn videos and helping convince some women that their videos would not be posted online.\n\nThe civil lawsuits and criminal prosecutions have also entangled popular free porn sites such as PornHub. In 2023, Pornhub’s parent companyagreed to paymore than $1.8 million toresolve a criminal probealleging it profited from sex trafficking through its hosting of GirlsDoPorn videos.\n\nMore than 120 women featured in GirlsDoPorn videos havesued PornHub’s parent companyin two lawsuits in San Diego federal court that alleged PornHub illegally published sex-trafficking videos. PornHub’s parent company settled the first of those suits, which involved about 60 women. The terms of the settlement were not disclosed. The second lawsuit involving 62 women remains active but has been stayed pending the sentencings of Moser and Pratt.",
        "source_2": "June 6 (UPI) --Michael Pratt, the mastermind behind the GirlsDoPorn website and an international fugitive for three years, pleaded guilty to sex trafficking in federal court in San Diego.\n\nPratt pleaded guilty Thursday to conspiracy to sex trafficking from 2012 to 2019 and sex trafficking a victim in 2012 of the superseding indictment, according to a U.S. Department of Justicenews release.\n\nSentencing for Pratt, 42, is scheduled for Sept. 8 before U.S. District Judge Janis L. Sammartino.\n\nHe liquidated his assets and fled from the United States in 2019. He was named to theFBI's Top Ten Most Wanted listuntil his arrest in Spain on Dec. 22, 2022, and was extradited to San Diego in March 2024.\n\nPratt was charged in October 2019 in the Southern District of California in connection with deceiving and coercing hundreds of young women from the United States and Canada to appear in pornographic videos.\n\nPratt and his co-defendants used force, fraud and coercion on the women -- mostly in their late teens -- to appear in GirlsDoPorn videos, the Department of Justice said.\n\nDuring court hearings, victims detailed how they had lost jobs, were evicted, dropped out of school or was disowned by friends and family. Some attempted suicide.\n\nAccording to prosecutors, Pratt sometimes transported the women to and from the site of the video shoot at hotels or short-term rental units in the San Diego area.\n\nThe prospective models were told the video would never be posted online or released in the United States.\n\nIn 2012, Pratt recruited co-defendant Matthew Wolfe, now 43, to work for him. They also developed GirlsDoToys out of the same office in San Diego.\n\nWith million of views, they posted video content on free porn sites such.\n\nThe websites charged visitors a subscription fee to access content, and generated $17 million in revenue for them, according to prosecutors.\n\nIn 2013, Pratt recruited another co-defendant, Ruben Andre Garcia, a male model who engaged in sex acts on video with the women. Garcia is now 36.\n\nProsecutors said Pratt and other members of the conspiracy ensured that the victims did not find out they owned and operated GirlsDoPorn and GirlsDoToys.\n\nIf the women said they wanted to stop making the video, the co-conspirators threatened to sue the women, cancel flights home and post the videos online, prosecutors said.\n\nIn May 2012, Pratt used the alias \"Matt\" to recruit Victim 1 for modeling and posted an ad on Craigslist as Bubblegum Casting.\n\nThe victim, who was 18, was told the job was actually to shoot an \"adult video\" but was falsely told it would only be seen in Australia by private clients and would not be posted on the internet.\n\nThe victim was persuaded to fly from a state outside of California to San Diego for the video shoot at a hotel. Pratt told the FBI he gave the victim $2,000.\n\nGarcia was sentenced to 20 years in prison on June 14, 2021; Theodore Gyi, 47, who served as a photographer, four years on Nov. 9, 2022; Wolfe 14 years on March 20, 2024. Valorie Moser, 42, the office manager, is set for sentencing on Sept. 12.\n\n\"I can remember being so worried to tell him [Garcia] that I was just 17,\" a woman told the court during a hearing for Garcia. \"But he was not mad or concerned. Instead, he was excited and was eager to start.\"",
        "source_3": "The fiendish founder of GirlsDoPorn — who was once on the FBI’s 10 most wanted list — has pleaded guilty to sex trafficking after three years on the run.\n\nMichael Pratt, 42, either tricked or forced hundreds of women — mostly teenagers — to appear in pornographic videos, usually by pretending it was a private casting call for lucrative modelling gigs, according to the Department of Justice.\n\nHe fled the United States in 2019 and hid out in Spain for more than three years until his arrest in December 2022.\n\nThe New Zealander and his employees — many of whom were also convicted — started operating out of San Diego in 2012.\n\nThey would lure the women under the pretense of a modeling gig and then tell them they would be performing sex acts in an adult video.\n\nHe would tell the women that the videos would never be posted online, that the videos would never be released in the US and that their friends, family and colleagues would never find out — which was a lie, the DOJ said.\n\nIf the women told Pratt they wanted to stop making the video, he and other co-conspirators would threaten to sue the women, cancel their flights home or post the videos online.\n\nGirlsDoPorn and its sister sister site, GirlsDoToys, which featured many of the same girls, garnered millions of views and promoted their videos on popular free porn sites like Pornhub, the DOJ said.\n\nPratt made “millions of dollars” off the adult content, which was mostly filmed in hotels or short-term house rentals in and around San Diego.\n\nThe porn director confessed to assuring an 18-year-old woman who responded to a Craigslist ad for “Bubblegum Casting” that her adult video would only be shared with private clients in Australia. Pratt rushed Victim 1 through a contract and did not provide her with a copy, prosecutors said.\n\nNine months after filming the sex video at a hotel, for which the teen was paid $2,000, Pratt posted the clip to GirlsDoPorn. The woman reached out to Pratt and begged him to take the video down — but he did not reply and did not remove the video.\n\nHe pleaded guilty to leading the sex trafficking ring from 2012 to 2019, which earned him more than $17 million.\n\nHe faces life in prison. He is scheduled to be sentenced on September 8.\n\nCo-founder Matthew Isaac Wolfe, also of New Zealand, wassentenced to 14 years in prisonon March 20, 2024.\n\nRuben Andre Garcia, the male model who engaged in sex acts on video with the women, was sentenced to 20 years in 2021.\n\nCameraman Theodore Gyi was hit with 4 years on November 9, 2022\n\nValorie Moser, the office manager, is set for sentencing on September 12, 2025."
    }
}