{
    "question": "How might the escalating feud between President Trump and Elon Musk, including threats to cut off government contracts, shape Tesla’s regulatory outlook, growth plans in self-driving and robotics, and investor confidence?",
    "content": {
        "source_1": "Tesla stock soared in the months after the November presidential election because investors were convinced Donald Trump was about to do massive favors for his largest financial backer, Tesla CEO Elon Musk. But Trump can also do great damage to Musk’s many business interests.\n\nThe risk of that damage is one reason that Tesla shares (TSLA)tumbled 14% in trading Thursday following the very nasty and public spat between Trump and Musk.\n\nBut it’s not just Tesla that could be at risk. SpaceX depends on government contracts for a significant share of its revenue. And Tesla, SpaceX and Musk’s other companies, including social media platform X, artificial intelligence company xAI and brain-computer interface company Neuralink all face regulation from the federal government.\n\nIn addition, Musk faces possible investigations of his own activities from agencies such as the Securities and Exchange Commission, which is looking into whether he violated rules when purchased his initial stake in X, then called Twitter, ahead of launching his takeover bid for the company.\n\nTrump appeared to threaten that he would take such action against Musk, as hepostedon his Truth social media platform Thursdaythat, “The easiest way to save money in our Budget, Billions and Billions of Dollars, is to terminate Elon’s Governmental Subsidies and Contracts. I was always surprised that Biden didn’t do it!”\n\nTo which Muskrepliedon his social media platform X: “This just gets better and better,” followed by two laughing face emojis, along with “Go ahead, make my day.”\n\nTesla has relatively few government contracts. But there are numerous federal policies that directly affect its finances, including a $7,500 tax credit for electric vehicle buyers that allows Tesla and other automakers to raise prices. That was likely worth billions to Tesla last year alone.\n\nIn addition, Tesla reported more than $8 billion in sales over six years of regulatory credits to other automakers to help them comply with federal and state emission standards. Trump is in favor of rolling back those standards and stripping states of the power to set their own emissions rules, which would destroy the market for those credit sales.\n\nA note from JPMorgan to clients Thursday estimates the loss of the EV tax credit could cost Tesla $1.2 billion a year and the loss of regulatory credit sales another $2 billion.\n\nMusk has also pegged the future of the growth of Tesla on operating a self-driving taxi service without any driver on board. Tesla’s current “full self driving” offering (FSD) requires a driver to be present to take control of the car. The service is due to debut in Austin, Texas, later this month. He admits his ambitious growth plans could be constrained by regulations.\n\nIn addition, the federal National Highway Traffic Safety Administration has also already announced investigations into accidents involving existing Tesla cars operating with FSD. Many Tesla fans assumed those investigations would be dropped under a Tesla-friendly Trump administration.\n\nSpaceX has received $15.2 billion in contracts from NASA, as well as $5.8 billion from the Department of Defense, along with a few million more from other agencies, according to USASpending.gov.\n\nReplacing SpaceX on those contracts, however, is not realistic. That’s because there is no other company available to replace it. For example, Boeing, the only other company able transport astronauts to and from the International Space Station (ISS), had problems on its only crewed flight last year. That required its Starliner spacecraft to return to Earth without two astronauts, who werestranded at the ISS for nine monthsinstead of the planned trip of a handful of days.\n\nBut SpaceX also is subject to the oversight of both NASA and the FAA. Its Starlink satellite internet communication service is alsoseeking approval from the FCC to expand its service.",
        "source_2": "Investors sold off shares in Tesla on Thursday, as tensions erupted between boss Elon Musk and US President Donald Trump.\n\nShares in the electric car company dropped 14%, wiping out roughly $150bn in market value in one of the worst days in months.\n\nThe losses were an indication of what might be at stake for Musk, as he breaks with a White House known for wielding the power of government against what it sees as enemies.\n\nAs the dispute devolved, Trump threatened to cut off government contracts to Musk's companies, including rocket firm SpaceX, which has contracts worth tens of billions of dollars with the government.\n\n\"Go ahead, make my day,\" Musk fired back in response to the threat.\n\nThe stark turn in the relationship between the two men played out live on social media, quickly spiralling from policy disagreements into personal insults.\n\nAnalyst Dan Ives of Wedbush Securities, a longtime Tesla cheerleader, called it \"jaw dropping and a shock to the market\",\n\nHe said the clash had sparked fear among investors about what it might mean for regulation of the company, which is seeking to expand self-driving and robotics and had hoped for a more relaxed regulatory approach under the Trump administration.\n\n\"This must start to be calmed down,\" Mr Ives wrote in a note, adding that it \"put a fly in the ointment of the Trump regulatory framework going forward\".\n\nMusk's foray into government has already proven a wild ride for Tesla investors.\n\nShares had surged last year, on hopes his alliance with Trump would benefit the company.\n\nBut investor sentiment soured this year, as Musk's alliance with Trump and his role leading controversial cuts to government spending proved a lightning rod,sparking backlashandhurting sales, especially inEurope.\n\nInvestors were also concerned that Musk - who had been fighting for a record-breaking pay package - was not focused on the company.\n\nLast month, the head of Tesla's board was forced to publicly deny a report that the company had started to look for someone else to lead the firm.\n\nMusk'spledge on an investor callthat he would be stepping back from his role leading Doge had prompted an upswing in the stock. Heformally left the governmentat the end of last month.\n\nBut Tesla now finds itself back in the political crossfire.\n\nThe breach with Trump was sparked by Musk's criticism of a Trump-backedspending bill.\n\nMusk has sought to rally opposition, arguing that it will add too much the government's debt load. He has also been critical of Trump's tariffs, which he said on Thursday would cause an economic recession in the second half of the year.\n\nTrump said Musk's welcome at the White House was wearing thin and accused him of being unhappy about the elimination of a tax credit for electric vehicles, which has been key to Tesla's sales in the US.\n\nThe two men have also clashed over Trump's decision to withdraw his nomination of Jared Isaacman, a Musk ally, to lead Nasa.\n\nThursday's fall put the company's share price at its lowest level since May, erasing gains that had been made on hopes that Musk would refocus attention on the company.\n\nTesla shares are currently down 25% since the start of the year, but are still up 60% over the past 12 months.\n\nAs the two men went at it, investors watched in disbelief.\n\n\"Can someone please take the phone away from him,\"wroteinvestor Ross Gerber, who has been vocal about his concerns about the impact of Musk's politics on Tesla and cut back his holdings. \"Tesla is getting destroyed.\"\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".\n\nBruce, who is currently spokeswoman for the state department, has done \"brilliantly\" according to Trump.\n\nUkraine's Volodymyr Zelensky rules out giving up land, as European security officials meet in the UK.",
        "source_3": "President Trump and Elon Musk have seemingly fallen out after a cozy relationship when Musk ran DOGE. Trump gives his take on why Musk is upset.\n\nTesla CEOElon Musk'svocal criticism of the tax cut package the Trump administration and congressional Republicans are advancing has left the company's investors in limbo as Musk and the president trade verbal barbs over the bill.\n\nThe billionaire's time in the role was tumultuous for Tesla, which became the subject of boycotts in opposition to Musk's role as the leader of the administration's Department of Government Efficiency (DOGE), which sent Tesla shares to their lowest levels of the year in March and April.\n\nTesla shares rallied last month in the lead up to the expiration of Musk's tenure as a special government employee in late May, with the billionaire signaling he would be less involved in politics as he refocused his attention on Tesla and his other companies. Tesla board members wanted assurances from Musk that he would lead Tesla full-time.\n\nThe stock gains unraveled after Musk stepped up his public criticism of the GOP bill and PresidentDonald Trump'ssupport of it, which escalated into a public war of words on Thursday. The effect sent Tesla shares plunging over 14% during the trading session, while the slide continued in after-hours trading when shares sank as much as 2.7%.\n\nTRUMP SAYS HE'S 'VERY DISAPPOINTED' IN ELON MUSK FOR OPPOSING 'BIGGEST TAX CUTS IN HISTORY'\n\nThe bitter spat between Elon Musk and President Donald Trump intensified, sending Tesla shares sliding.(Getty Images)\n\nThe slide in Tesla shares over the course of Wednesday and Thursday marked the worst two-day stretch for the stock since the two days ending Nov. 9, 2021, when it dropped 16.25%.\n\nTesla's stockis down nearly 20% over the last five days and more than 24.9% year to date.\n\nSince departing his role with the administration, Musk has called the GOP's One Big Beautiful Bill Act a \"disgusting abomination\" and urged Republican lawmakers to kill the bill due to its projected impact on budget deficits.\n\nTrump spoke to the press on Thursday during a White House meeting with German Chancellor Friedrich Merz and said he was \"very disappointed\" with Musk's criticism of the bill and suggested Musk was aware thatTesla's EV subsidieswould be cut.\n\nELON MUSK USES TRUMP'S 2013 WORDS ON DEBT CEILING AGAINST HIM\n\nMusk backed the Trump campaign financially and spoke at rallies on the campaign trail.(Jim Watson/AFP via Getty Images)\n\nMusk retorted on his social media site X, saying that he never saw the bill — which was estimated toraise deficits by $2.4 trillionover a decade by the Congressional Budget Office — and again slammed it as being full of wasteful spending.\n\n\"Without me, Trump would have lost the election, Dems would control the House and the Republicans would be 51-49 in the Senate,\" Musk said. \"Such ingratitude.\"\n\nWHAT'S NEXT FOR TESLA AS MUSK DEPARTS TRUMP WHITE HOUSE\n\nThe feud escalated from there, with Trump writing on his social media platform Truth Social that a good way to cut federal spending would be to eliminate contracts and subsidies involving Musk's companies: \"The easiest way to save money in our Budget, Billions and Billions of Dollars, is to terminate Elon's Governmental Subsidies and Contracts. I was always surprised that Biden didn't do it!\"\n\n\"In light of the President's statement about cancellation of my government contracts, @SpaceX will begin decommissioning its Dragon spacecraft immediately,\" Musk responded.SpaceX's Dragon spacecraftis currently used to carry both astronauts and cargo to the International Space Station, as well as on private missions. The company is not publicly traded and Musk serves as its CEO.\n\nTrump and Musk watched the launch of SpaceX's Starship spacecraft together last year.(Brandon Bell/Getty Images)\n\nThe Tesla CEO later took aim at Trump'stariff policies, writing in a post on X, \"The Trump tariffs will cause a recession in the second half of this year.\"\n\nMUSK UNLEASHES WILD EPSTEIN CLAIM AGAINST TRUMP AFTER BEING BOOTED FROM DOGE\n\nAdditionally, Musk posted that it was \"Time to drop the really big bomb: @realDonaldTrump is in the Epstein files. That is the real reason they have not been made public. Have a nice day, DJT!\"\n\nMusk later replied \"yes\" to a post suggesting that Trump should be impeached and replaced by Vice PresidentJD Vance.\n\nPresident Donald Trump bought a Tesla from Musk at the White House as a show of support earlier this year when the EV-maker faced consumer backlash over Musk's political activism.(Mandel Ngan/AFP via Getty Images)\n\nDan Ives, managing director and senior equity research analyst at Wedbush Securities, wrote in a note to investors that Trump and Musk's dispute \"quickly escalated into essentially a high school friends feud between the once upon a time bromance of Musk and Trump.\"\n\n\"Tesla's stock is under major pressure down 15% as investors fear that this Musk/Trump battle will stop their friendship and change the regulatory environment for Tesla on the autonomous front over the coming years under the Trump administration,\" Ives wrote.\n\nHe added that there is a possibility the feud will settle down to allow the Musk-Trump friendship to continue, but added \"this must start to be calmed down on the Musk and Trump fronts, and it's not good for either side.\"\n\n\"This feud does not change our bullish view of Tesla and the autonomous view but clearly does put a fly in the ointment of the Trump regulatory framework going forward,\" he explained. \"It's another Twilight Zone moment in this Musk/Trump relationship which now is quickly moving downhill.\"\n\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\n\nBy clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time."
    }
}