{
    "question": "What are the potential consequences for aviation security, civil liberties, and government oversight if the TSA’s “Quiet Skies” program is ended?",
    "content": {
        "source_1": "Update:On Thursday, Homeland Security Secretary Kristi Noemannouncedthe end of the Quiet Skies program. CBS News' original report appears below.\n\nThe Trump administration is preparing to end a federal domestic surveillance program for travelers that's meant to ferret out terrorist threats but has sometimes ended up saddling Americans with inconvenient or invasive searches at U.S. airports.\n\nPresident Trump plans to discontinue the Transportation Security Administration's \"Quiet Skies\" program, multiple sources told CBS News.\n\nAn announcement could come as soon as Thursday, one U.S. official said.\n\nAides have debated how to shut down Quiet Skies without any lapses in security, another U.S. official said.\n\nQuiet Skies works to identify travelers who could present an elevated risk to aviation security. The program, which began in 2010, employs analysts and undercover air marshals to monitor people in airports and during flights, using outstanding warrants, facial recognition software, identification of suspicious travel patterns and behaviors and other data to try to prevent terrorist attacks.\n\nIt has caught up some high-profile people in its dragnet, including Tulsi Gabbard, a former Democratic congresswoman who is now Mr. Trump's director of national intelligence, and led to debates about what has appeared at times to be an uneven application of the rules.\n\nTSA's surveillance efforts have long attracted criticism for tracking U.S. citizens not suspected of any crimes. The circumstances that land an individual on the Quiet Skies list — or what gets them removed — have been mostly concealed from the public.\n\nSome Americans undertake exhaustive efforts to get themselves removed from the list — with some even engaging in protracted legal fights.\n\nCBS Newsreported Tuesdaythat the husband of Sen. Jeanne Shaheen, a New Hampshire Democrat, landed on the TSA's watchlist in 2023. He was removed shortly after Shaheen spoke with the TSA's then-director. A spokesperson for the senator said she was not aware William Shaheen had been monitored under Quiet Skies.\n\nIt was unclear Wednesday whether Quiet Skies staff would be shifted elsewhere in the administration or whether the undercover federal air marshals would continue their work.\n\nJennifer Jacobs is a senior White House reporter at CBS News.",
        "source_2": "The Quiet Skies surveillance program under the TSA reportedly targeted Trump administration officials, like Tulsi Gabbard, during the prior administration.\n\nThe Trump administration said the move to end the program is designed to save roughly $200 million in taxpayer dollars annually and argue the program is ineffectual.\n\nQuiet Skies has also reportedly surveilled people in Washington D.C. amid the Jan. 6 capitol riots and a Democratic senator’s husband.\n\nThe Trump administrationconfirmed a reporton Thursday, June 5, that it is shuttering the Quiet Skies program, which was used to secretly surveil Americans who were deemed potential national security threats. The administration’s intent to end the program was first reported byCBS Newson Wednesday, June 4, just a day before Department of Homeland Security Secretary Kristi Noem made the official announcement on X.\n\nNoem said that the Transportation Security Administration (TSA) “is ending the Quiet Skies Program, which since its existence has failed to stop a SINGLE terrorist attack while costing US taxpayers roughly $200 million a year.”\n\nNoem argued that the Biden administration weaponized the program against political opponents “under the guise of national security.” She also vowed to launch an internal investigation into Quiet Skies and requested Congress also look into “corruption” within the program.\n\nFederal aviation security program, Quiet Skies, flagged 40 to 50 passengers for monitoring by the Federal Air Marshals Service every day, with about35 being monitored daily.\n\nNoem said that the TSA will continue to be present at airports and perform its normal security duties, including REAL ID checks, a new rule implemented on May 7.\n\n“The Trump administration will return the TSA to its true mission of being laser-focused on the safety and security of the traveling public,”she said. “This includes restoring the integrity, privacy and equal application of the law for all Americans.”\n\nQuiet Skies hasdrawn criticismfrom some within the Trump administration, including U.S. Director of National Intelligence Tulsi Gabbard, who was on the Quiet Skies list, according to TSA whistleblowers, asreported by Straight Arrow Newsin August 2024. Gabbard, at the time, announced legal action against the Biden administration, saying she believed the administration targeted her because of her outspoken views on Ukraine.\n\nThe agency never officially confirmed or declined Gabbard’s inclusion on the Quiet Skies list. The TSA was alsoreportedlyusing the program to monitor people in Washington at the time of the Jan. 6 U.S. Capitol riots. Some U.S. citizens have had to undergo an extensive process to have their names removed from the list.\n\nCBS News alsoreportedon Tuesday, June 3, that the husband of Sen. Jeanne Shaheen, D-N.H., was on the Quiet Skies watchlist in 2023. However, shortly after Shaheen spoke with the TSA’s director under former President Joe Biden, her husband was removed from the list. A spokesperson for Shaheen said she previously had no knowledge her husband, William Shaheen, was tracked by the Quiet Skies program.\n\nThe Trump administration has not disclosed whether staff involved in the Quiet Skies program will be reassigned or if their positions will be eliminated.\n\nTHE TRUMP ADMINISTRATION CONFIRMED REPORTS IT WILL SHUTTER THE T-S-A’S QUIET SKIES PROGRAM. THE PROGRAM WAS USED TO SECRETLY SURVEIL AMERICANS DEEMED NATIONAL SECURITY RISKS SINCE 2012. DEPARTMENT OF HOMELAND SECURITY SECRETARY KRISTI NOEM ANNOUNCED THE DECISION THURSDAY ON X.\n\nNOEM SAYS THE DECISION WAS MADE BECAUSE THE ADMINISTRATION BELIEVES IT IS INEFFECTIVE AND THE MOVE WILL SAVE TAXPAYERS MILLIONS OF DOLLARS.\n\n“SINCE ITS EXISTENCE IT HAS FAILED TO STOP A SINGLE TERRORIST ATTACK. WHILE IT COSTS U.S. TAXPAYER ROUGHLY ABOUT 200 MILLION DOLLARS A YEAR,” SHE SAID.\n\nSHE ALSO ACCUSED THE BIDEN ADMINISTRATION OF WEAPONIZING THE PROGRAM.\n\n“THIS PROGRAM UNDER THE GUISE OF NATIONAL SECURITY HAS TARGETED POLITICAL OPPONENTS AND BENEFITED POLITICAL ALLIES OF THE BIDEN ADMINISTRATION,” NOEM SAID.\n\nNOEM ALSO VOWED TO LAUNCH AN INTERNAL INVESTIGATION AND CALLED FOR CONGRESS TO BEGIN ONE AS WELL.\n\n“IN ADDITION TO CONDUCTING OUR OWN INTERNAL INVESTIGATION, I’M CALLING FOR A FULL AND THOROUGH CONGRESSIONAL INVESTIGATION TO UNCOVER FURTHER CORRUPTION WITHIN THIS PROGRAM,” SHE SAID.\n\nNOEM SAYS THE T-S-A WILL CONTINUE TO BE PRESENT AT AIRPORTS AND PERFORM ITS NORMAL SECURITY DUTIES, INCLUDING REAL I-D CHECKS, A NEW RULE IMPLEMENTED EARLY LAST MONTH.\n\nSHE WENT ON TO SAY, “SO, TSA IS GOING TO CONTINUE TO PERFORM IMPORTANT VETTING FUNCTIONS TO STOP SECURITY THREATS AND TO ENSURE THE SAFETY OF THE AMERICAN TRAVELER. THE TRUMP ADMINISTRATION WILL RETURN THE TSA TO ITS TRUE MISSION OF BEING LASER-FOCUSED ON THE SAFETY AND SECURITY OF TRAVELING PUBLIC. THIS INCLUDES RESTORING THE INTEGRITY, PRIVACY AND EQUAL APPLICATION OF THE LAW FOR ALL AMERICANS.”\n\nQUIET SKIES HAS DRAWN CRITICISM FROM SOME WITHIN THE TRUMP ADMINISTRATION, INCLUDING DIRECTOR OF NATIONAL INTELLIGENCE TULSI GABBARD. GABBARD WAS REPORTEDLY ON THE T-S-A’S WATCHLIST AND IN AUGUST OF LAST YEAR ANNOUNCED LEGAL ACTION AGAINST THE BIDEN ADMINISTRATION FOR HER INCLUSION. SHE BELIEVES SHE WAS TARGETED DUE TO HER STANCE ON UKRAINE.\n\nTHE PROGRAM HAS ALSO REPORTEDLY BEEN USED TO TRACK PEOPLE WHO WERE IN D-C AT THE TIME OF THE CAPITOL RIOTS AND DEMOCRATIC SENATOR JEANNE SHEEHAN’S HUSBAND. SHAHEEN’S HUSBAND, WILLIAM SHAHEEN, WAS TAKEN OFF THE LIST AFTER THE SENATOR SPOKE WITH THE T-S-A DIRECTOR UNDER FORMER PRESIDENT BIDEN.\n\nThe decision to end the TSA's Quiet Skies program raises questions about government surveillance, civil liberties, and oversight of national security initiatives affecting American citizens.\n\nConcerns over secret monitoring of U.S. citizens highlight debates about privacy versus security and the limits of surveillance programs.\n\nAllegations from Kristi Noem and others that the Quiet Skies program targeted political opponents underscore the potential for surveillance systems to be misused for partisan purposes.\n\nCalls for investigations and clarification regarding who was monitored and why illustrate demands for greater oversight and openness in government security measures.\n\nAccording to a 2018 Boston Globe investigation, the Quiet Skies program flagged 40 to 50 passengers for monitoring by Federal Air Marshals Service every day, with about 35 being monitored daily. This data indicates a relatively small but consistent number of Americans subjected to enhanced surveillance at any given time, contributing to concerns about resources and privacy.\n\nAll sources agree that the Quiet Skies program involves monitoring airline passengers, including U.S. citizens, for potential security threats. There is consensus that the program has been criticized for its opaque criteria and uneven application, leading to scrutiny and controversy over privacy, transparency, and possible political misuse.\n\nBehavioral surveillance programs in aviation security grew after 9/11, with subsequent efforts like Quiet Skies aiming to preempt threats through expanded monitoring. Historical criticism has focused on the balance between security and civil liberties, highlighting the need for oversight and transparency—concerns echoed in the controversy surrounding Quiet Skies.\n\nNo summary available because of a lack of coverage.\n\nTrump administration planning to end TSA's Quiet Skies traveler surveillance program\n\nNo summary available because of a lack of coverage.\n\nTrump plans to discontinue TSA's 'Quiet Skies' program, CBS News reports\n\nTrump plans to discontinue TSA's 'Quiet Skies' program, CBS News reports\n\nNo summary available because of a lack of coverage.\n\nTrump Administration Reportedly Plans To Shut Down TSA Program That Surveilled Tulsi Gabbard\n\nTrump Is Ending Controversial TSA Surveillance Program That Targeted Tulsi Gabbard\n\nTrump administration planning to end TSA's Quiet Skies traveler surveillance program",
        "source_3": "The Trump administration is getting ready to end a Transportation Security Administration (TSA) domestic surveillance program, according to a Wednesday report.\n\nPresident Donald Trump is preparing to discontinue the TSA’s “Quiet Skies” program, multiple sources toldCBS News.\n\nThe report noted the announcement could come as soon as Thursday, as aides debate how to shut down the program without causing security lapses.\n\nToday, DHS exposed unearthed evidence detailing the politicization of TSA’s watchlisting program under the Biden administration. This includes William “Billy” Shaheen, spouse of sitting U.S. New Hampshire Senator, Jeane Shaheen, who traveled with a known or suspected terrorist 3…\n\nQuiet Skies is a tool that Federal Air Marshals (FAMs) use on “travelers who may present an elevated risk to aviation security,”accordingto the TSA’s site.(RELATED: 4 Deep State Spy Tools The Trump Admin Can Leave In 2024)\n\nDemocratic New Hampshire Sen.Jeanne Shaheen, reportedly urged Biden officials to remove her Arab-American husband, William Shaheen, from a TSA watchlist after he was flagged by the “Quiet Skies” surveillance program in October 2023.\n\nHer husband was granted an exemption from the program by former TSA Administrator David Pekoske, according to a Department of Homeland Security (DHS)investigation. The DHS alleged her husband had been flying “with a Known or Suspected Terrorist on three occasions.”\n\nAll the while, other Americans—including Gabbard—have reportedly been placed on the list with little to no transparency, notification or oversight.\n\n“It is clear that this program was used as a political Rolodex by the Biden Administration—weaponized against its political foes and used to benefit their well-connected allies,” said DHS Secretary Kristi Noem in response to the findings.\n\n“This program should have been focused on the equal application of security measures. Instead, it was corrupted and turned into a tool for political targeting. The Trump Administration will restore integrity, protect privacy, and ensure the fair and equal application of the law for all Americans, including in aviation screening,” she continued.\n\nWhistleblowersallegedin August that Director of National Intelligence (DNI) Tulsi Gabbard was placed on a TSA suspected terrorist watch list and surveilled by TSA and Federal Air Marshals (FAMs).\n\nEmpower Oversight, whichrepresentsthe whistleblowers, later sent a letter to Department of Homeland Security inspector general, Joseph Cuffari, after learning that the TSA had launched a “leak” investigation into the FAM agents.\n\nHouse Oversight Committee Chairman, James Comer, sent aletterin August 2024 to TSA Administrator David Pekoske, addressing whistleblower allegations that Gabbard was placed on a watch list and surveilled during her travels.\n\nGabbard, a former Democrat Hawaii Representative, addressed the issue in August during anappearanceon Fox News’ “Hannity.”\n\n“This is only the information that we know. Obviously, I experienced a significant change in my travel when all of this began on July 23,” Gabbard told Sean Hannity.\n\n“My real question is, what don’t I know?” Gabbard continued. “This is the real pain and stress that’s been caused both to me and my family by this whole situation, day and night wondering if and what government institution and agency is monitoring my phone calls, surveilling me in my movement in my travels, knowing that they may be looking for some kind of excuse or derogatory action to come after me.”\n\nPRESIDENT TRUMP SHUTS DOWN TSA QUIET SKIES!! Time to fire 🔥 FAMS Director Brian “no one’s above the law” Belcher!@LaboscoSonya@tristanleavitt@Sec_Noem@RogerJStoneJr@SenRandPaul@SebGorkahttps://t.co/zQ774D8BSA\n\n— Air Marshal National Council (@FAMS_AMNC)June 5, 2025\n\nA 2018investigationby the Boston Globe revealed details about the Quiet Skies program, citing TSA records that showed 40 to 50 flagged passengers were flying domestically each day. FAMs monitored roughly 35 of those individuals daily, the report added.(RELATED: ‘Ghost Guns’ And ‘Hate Crime’: Tulsi Gabbard Declassifies Biden Admin Docs Targeting ‘Domestic Terrorism’)\n\nThe surveillance program expanded after Jan. 6, 2021, to monitor individuals who were present at the Capitol, according to Matt Taibbi ofRacket News.\n\nGabbard told Taibbi that she and her husband were subjected to “random” airport searches lasting up to 45 minutes, and she claimed those searches occurred every time she boarded a flight.\n\nBoth Gabbard and her husband’s boarding passes were marked with “SSSS,” which stands for “Secondary Security Screening Selection,” a designation that usually indicates the traveler is on a threat list, according to Taibbi.\n\n“The Biden TSA tailed Tulsi Gabbard on domestic flights—treating a former Member of Congress like a terror suspect,” Republican Kentucky Sen. Rand Paul stated on X.\n\nDuring a May 20 Senate hearing with Noem, Paul expanded on his concerns: “With regard to TSA ‘Quiet Skies’ and [the] Tulsi Gabbard situation, I suspect there are going to be other people that were caught up in this thing as well. I’m horrified by the idea, that we took a former congresswoman and we’re surveilling her and riding on jets with her.”\n\n“I want to hear that people have been let go, that they’re no longer doing this. If there were abuses of Tulsi Gabbard’s liberties, I want to hear from that. But, I want repercussions to come from this,” he added.\n\nUnder the flimsy guise of “domestic terrorism,” Federal law enforcement and intelligence were repeatedly weaponized against me and other Americans who exercised our First Amendment rights in speaking out against the Biden Administration’s policies and therefore deemed a threat to…https://t.co/vKuMwMGUVo\n\nWhile Gabbard has criticized the National Security Agency’s (NSA) mass surveillance program and earned support from many veterans, she has also facedoppositionfrom former national security officials linked to censorship and left-wing organizations.(RELATED: Tulsi Gabbard Says Comey Spent Career ‘Prosecuting Mobsters’ And Understood ‘Dangerous’ ‘Lingo’ He Posted On Instagram)\n\nThe Daily Caller reached out to ODNI but has not heard back at the time of publication."
    }
}