{
    "question": "How might the “very good” 90-minute call and mutual invitations between Trump and Xi shape the trajectory of the 90-day trade truce and efforts to resolve ongoing tariff and policy disputes, including the “negative measures” China wants lifted?",
    "content": {
        "source_1": "President Donald Trump emerged Thursday from a long-awaited 90-minute telephone call with Chinese leader Xi Jinping encouraged that ongoing trade tensions could soon be resolved.\n\nCalling the conversation “very good,” Trump said in a social media post after the call that follow-up talks would soon be arranged with his economic team, and that he and Xi had invited each other to visit each other’s respective nations.\n\nTrump said the call focused almost entirely on trade, without touching on other geopolitical issues like Iran and Ukraine. The call “resulted in a very positive conclusion for both Countries,” Trump wrote onTruth Social.\n\nIt comes after a long period of silence between the leaders, and the discrepancy in how each side was talking — or not talking — about the call ahead of time only underscored a widening gulf between the world’s two largest economies.\n\nDuring the call, Xi called for the United States and China to “seek win-win results in the spirit of equality and respect each other’s concerns,” while urging Washington to “remove the negative measures taken against China,” according to a readout from China’s Ministry of Foreign Affairs.\n\n“Recalibrating the direction of the giant ship of China-US relations requires us to take the helm and set the right course,“ Xi told his US counterpart.\n\nTensions have been risingbetween the two sides in the weeks after they agreed to a 90-day trade trucelast month, which hit pause on theirtit-for-tat escalation of tariffs. Trump accused China last week of “violating” the agreement — a charge Beijing has denied, while it accused the US of taking steps to “seriously undermine” that consensus.\n\nIn his readout following the call, Trump singled out the issue of rare earth minerals, which China had placed restrictions on, as an area where he made progress with his counterpart.\n\n“There should no longer be any questions respecting the complexity of Rare Earth products,” Trump wrote.\n\nHe said a meeting between the economic teams would occur “shortly” in a location to be determined. And he said the leaders look forward to visiting each other.\n\n“During the conversation, President Xi graciously invited the First Lady and me to visit China, and I reciprocated. As Presidents of two Great Nations, this is something that we both look forward to doing,” Trump wrote.\n\nUS officials had signaled in recent days that a call between the two leaders could help jump-start progress in expected upcoming trade talks, which had appeared to stall following the initial truce reached in Geneva.\n\nIn Thursday’s call, Xi called for both sides to “make good on” the Geneva consensus and said China had “earnestly and seriously” implemented the agreement. “The US side should acknowledge the progress already made, and remove the negative measures taken against China,” he said.\n\n“The two sides need to make good use of the economic and trade consultation mechanism already in place, and seek win-win results in the spirit of equality and respect for each other’s concerns,” Xi said. “The Chinese side is sincere about this, and at the same time has its principles.”\n\nXi called on the US to “handle the Taiwan question with prudence” and so that “‘Taiwan independence’ separatists” will not be able to “drag China and America into the dangerous terrain of confrontation and even conflict.” China’s ruling Communist Party views the self-governing democracy of Taiwan as its own territory, despite having never controlled it.\n\nThe Chinese readout also said Xi “welcomed” Trump to visit China and that the two sides “should continue implementing the Geneva agreement and hold another round of meeting as soon as possible.”\n\nThe two leaders are known to have last spoken on January 17, days before Trump’s inauguration. They are navigating a fractious relationship, with recent points of contention stretching beyond theirgaping trade imbalance.\n\nFollowing the Geneva talks last month, US officials had expected China to ease export restrictions on rare earth minerals, which had been imposed in April in retaliation against Trump’s “reciprocal” tariffs on Chinese goods. The minerals are an essential part of everything from iPhones and electric vehicles to big-ticket weapons like F-35 fighter jets and missile systems.\n\nBut the restrictions haven’t been lifted, causing intense displeasure inside the Trump administration and prompting a recent series of measures imposed on China,three administration officials told CNN last week.\n\nBeijing, meanwhile, has bristled as Washingtonwarned companies against using AI chipsmade by China’s national tech champion Huawei, moved tolimit critical technology salesto China and announced that the US would“aggressively revoke visas”for Chinese students in the US with connections to the Chinese Communist Party or studying in critical fields.\n\nAs CNN reported ahead of Thursday’s call, Chinese officials — who were deeply wary of Trump’s unpredictability and track record of putting foreign leaders in awkward or embarrassing situations — had put off a phone call, according to people familiar, even as Trump stated on multiple occasions this spring that he expected to speak with Xi soon.\n\nThe president’s Oval Office ambushes of Ukraine’s Volodymyr Zelensky and South Africa’s Cyril Ramaphosa caught the attention of officials in China, those people added, and officials wanted to avoid anything similar, even in a private conversation.\n\nBut Trump regards securing a new agreement with Beijing both as a critical component of his broader trade agenda and as a necessary follow-up from his first term, when trade deals with China got derailed during the Covid-19 pandemic.\n\nThis is story has been updated with additional information.",
        "source_2": "Donald Trump has said he will visit China after speaking to its leader Xi Jinping over the phone.\n\nThe US president said he had reciprocated with an invite to the White House during the \"very good talk\" - though such a trip has not been confirmed by either side.\n\nThursday's call is the first time the two leaders have spoken since Trump launched a trade war with Beijing in February. Chinese state media reported that the call happened at the White House's request.\n\nTrump wrote on social media that the hour-and-a-half conversation was primarily focused on trade and had \"resulted in a very positive conclusion for both countries\".\n\n\"He invited me to China and I invited him here,\" Trump said of the call with Xi while meeting German Chancellor Friedrich Merz in the Oval Office.\n\n\"We both accepted, so I will be going there with the first lady at a certain point and he will be coming here hopefully with the first lady of China.\"\n\nThe Chinese readout of the conversation mentioned its invitation but not the reciprocal one to the White House.\n\nAccording to Chinese state news agency Xinhua, Xi reportedly told Trump that the US should \"withdraw the negative measures it has taken against China\".\n\nThe Chinese leader was also said to have told Trump that China always kept its promises and since a consensus had been reached, both sides should abide by it - a reference to a recent deal between the two nations struck in Geneva.\n\nBoth sides have accused the other of breaching the deal aimed at dramatically reducing trade tariffs - a deal Trump touted as a \"total reset\".\n\nIt came after Trump raised tariffs on imports from a number of countries, but reserved the highest rates for China. Beijing responded with its own higher rates on US imports, sparking tit-for-tat increases that peaked at 145%.\n\nThe tentative truce struck in May brought that US tariff on Chinese products down to 30%, while Beijing slashed levies on US imports to 10% and promised to lift barriers on critical mineral exports.\n\nThe agreement gave both sides a 90-day deadline to try to reach a trade deal.\n\nBut since then, talks have seemed to grind to a halt amid claims on both sides that the deal had been breached.\n\nThe US has accused China of failing to restart shipments of critical minerals and rare earth magnets vital to car and computer industries.\n\nThe Chinese Ministry of Commerce has denied the claims and accused the US of undermining the deal by introducing new restrictions on computer chips.\n\nTrump introduced new export restrictions on semiconductor design software and announced it would revoke the visas of Chinese students.\n\nThe US president said following the call that \"there should no longer be any questions respecting the complexity of Rare Earth products\".\n\nHe told reporters in the White House: \"Chinese students can come, no problem, no problem - its an honour to have them frankly. But we want to check them.\"\n\nChinese state media reported that Xi warned Washington that it should handle Taiwan \"with caution\" to avoid conflict,  just days after US Defence Secretary Pete Hegseth said China posed an \"imminent\" threat to the self-governed island.\n\nHegseth told the Shangri-la Dialogue in Singapore that Beijing was \"credibly preparing to potentially use military force to alter the balance of power\".\n\nChina sees Taiwan as a breakaway province that will eventually be reunified, and has not ruled out the use of force to achieve this. The US supports Taiwan militarily butdoes not officially recognise it due to the \"One China\" policy.\n\nAccording to the readout of Thursday's call given to Chinese media, Xi stressed that the US should handle the \"Taiwan issue prudently to prevent a small number of Taiwan Independence separatists from dragging China and the US into a dangerous situation of conflict and confrontation\".\n\nThe call between Trump and Xi is long awaited and comes after months of silence between the two leaders.\n\nThe White House has touted the possibility they might talk from week one of Trump's presidency - and earlier this week he finally vented his frustration on social media.\n\nTrump wrote: \"I like President Xi of China, always have, and always will, but he is VERY TOUGH, AND EXTREMELY HARD TO MAKE A DEAL WITH!\"\n\nTrump has made it clear that he likes to be involved in negotiations. But this is not the way China does business.\n\nBeijing prefers to appoint a negotiating team led by a trusted official. Any calls or meeting between heads of state are usually thoroughly planned and highly choreographed.\n\nThe Chinese will also not want to be seen to bend to Washington's demands.\n\nThe crash in the disputed Scarborough Shoal rendered a Chinese warship \"unseaworthy\", Manila said.\n\nWatch: Chinese ships collide while pursuing Philippine boat\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.",
        "source_3": "Fox News correspondent Alexandria Hoff reports on the latest trade developments between the U.S. and China on ‘Special Report.’\n\nPresidentDonald Trumpspoke with Chinese President Xi Jinping on Thursday in a lengthy call amid economic and national security friction regarding trade between Washington and Beijing.\n\n\"I just concluded a very good phone call with President Xi, of China, discussing some of the intricacies of our recently made, and agreed to, Trade Deal,\" Trump said Thursday in a Truth Social post. \"The call lasted approximately one and a half hours, and resulted in a very positive conclusion for both Countries.\"\n\nTrump said the conversation focused \"almost entirely\" on trade, and that Xi invited the U.S. president and first lady Melania Trump to visit China. Trump also said he extended an invitation to Xi and his wife, Peng Liyuan.\n\nChinese media first reported the call between the two leaders on Thursday, and claimed that the call occurred per Trump's request. White House National Economic Council Director Kevin Hassett told ABC News on Sunday that Trump was expected to talk with the Chinese president this week.\n\nPresident Donald Trump, right, and China's President Xi Jinping arrive at a state dinner at the Great Hall of the People in Beijing on Nov. 9, 2017.(Reuters/Thomas Peter)\n\nThe call comes nearly a week after Trump condemned China for violating an initial trade agreement that the U.S. and China hashed out in May, and a day after Trump said Xi was\"extremely hard to make a deal with\"in a Truth Social post.\n\nThe negotiations led both countries to agree that the U.S. would ramp down its tariffs against Chinese imports from 145% to 30%, and China would cut its tariffs against U.S. imports from 125% to 10%.\n\nBut Trump accused China on Friday ofnot holding up its end of the bargain, although he refrained from disclosing specifics.\n\n\"The bad news is that China, perhaps not surprisingly to some, HAS TOTALLY VIOLATED ITS AGREEMENT WITH US,\" Trump said Friday in a social media post. \"So much for being Mr. NICE GUY!\"\n\n'NO REASON' FOR NEW NUKES: TRUMP FLOATS DISARMAMENT TALKS WITH CHINA, RUSSIA\n\nPresident Donald Trump, left, shakes hands with China's President Xi Jinping at the end of a press conference at the Great Hall of the People in Beijing on Nov. 9, 2017.(Fred Dufour/AFP via Getty Images)\n\nU.S. Trade Representative Jamieson Greer said Friday in an interview with CNBC that China had failed to lift its non-tariff barriers, as outlined in the deal.\n\n\"The United States did exactly what it was supposed to do, and the Chinese are slow-rolling their compliance, which is completely unacceptable and has to be addressed,\" Greer said Friday.\n\nMeanwhile, China pressed the U.S. to reverse course and address its own mistakes.\n\n\"China once again urges the US to immediately correct its erroneous actions, cease discriminatory restrictions against China and jointly uphold the consensus reached at the high-level talks in Geneva,\" Chinese embassy spokesperson Liu Pengyu said in a Friday statement.\n\nBut Trump later indicated that the two leaders ironed out their differences.\n\n\"We had a very good talk, and we've straightened out any complexity, and it's very complex stuff, and we straightened it out,\" Trump said Thursday during an Oval Office press briefing with German Chancellor Friedrich Merz.\n\n\"I think we're in very good shape with China and the trade deal,\" Trump said. \"We have a deal with China, as you know, but we were straightening out some of the points… I would say we have a deal, and we're going to just make sure that everybody understands what the deal is.\"\n\nMeanwhile, Trump's invitation to Xi and Peng to visit the U.S. comes as Trump's administration cracks down on student visa holders in the U.S. and as Trump has threatened to \"aggressively\" rescind visas of students from China.\n\nOn Thursday, Trump appeared to take a softer approach though and said that he did want foreign students to come to the U.S. — he just wants them to undergo proper vetting.\n\n\"We want to have foreign students, but we want them to be checked,\" Trump said from the White House.\n\nTRUMP SIGNALS CHINA ‘VERY MUCH’ INTERESTED IN SECURING TRADE DEAL AHEAD OF SWITZERLAND NEGOTIATIONS\n\nTrump and Xi spoke over the phone on Thursday to discuss trade negotiations.(Getty Images)\n\nDiana Stancy is a politics reporter with Fox News Digital covering theWhite House.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}