{
    "question": "How might the tariff-driven plunge in April imports, alongside a fourth consecutive rise in exports, shape second-quarter GDP, consumer prices, and businesses’ sourcing and inventory decisions?",
    "content": {
        "source_1": "Americans bought fewer foreign pharmaceuticals, cellphones and cars, and cut purchases of machinery and other supplies.\n\nAna Swanson covers international trade and reported from Washington.\n\nU.S. imports of foreign made goods fell sharply in April compared with the previous month, as tariffs clamped down on global trade.\n\nMuch of the 16.3 percent drop from March reflected the fact that importers had rushed to bring many goods into the United States at the beginning of the year, before President Trump could impose tariffs that would raise the price of foreign products. That resulted in a record surge in imports and in the trade deficit in the first three months of the year.\n\nIn April, Americans purchased fewer pharmaceuticals from Ireland and Switzerland; cellphones from China; and cars and auto parts from Mexico, Canada, Japan and South Korea, data from the Commerce Department and tracking by Moody’s Analytics showed.\n\nU.S. factories and businesses also significantly cut their purchases of foreign machinery and other supplies. Imports from China, a major source of machinery and consumer goods, hit a five-year low.\n\nExports rose slightly, up 3 percent from the previous month, buoyed by an outflow of gold. Investors for monthshad been stockpiling gold bullionfrom Switzerland in case Mr. Trump restricted its flow.\n\nWe are having trouble retrieving the article content.\n\nThank you for your patience while we verify access. If you are in Reader mode please exit andlog intoyour Times account, orsubscribefor all of The Times.\n\nThank you for your patience while we verify access.",
        "source_2": "U.S. trade deficit cut in half as Trump tariffs cause import plunge\n\nThe numbers:The U.S. international trade deficit narrowed 55.5% in April to $61.6 billion, the Commerce Department said Thursday.\n\nEconomists surveyed by the Wall Street Journal had predicted the deficit would narrow to a seasonally adjusted $63.3 billion from a record $140.9 billion in March.\n\nGreg Robb is a senior reporter for MarketWatch in Washington. Follow him on Twitter @grobb2000.\n\nCopyright ©2025MarketWatch, Inc. All rights reserved.",
        "source_3": "The U.S. trade deficit in goods and services narrowed sharply in April, falling to $61.6 billion from $138.3 billion in March—the largest monthly improvement on record—driven by a steep drop in imports and continued strength in American exports.\n\nThe 16.3 percent decline in imports, the biggest on record, coincided with the introduction of new U.S. tariff schedules and followed months of accelerated purchasing by companies anticipating higher duties. Analysts noted that much of the shift reflected a hangover after months of elevated imports as businesses rushed to bring in goods ahead of the tariff hikes.\n\nAt the same time, exports rose by 3.0 percent, including gains in capital goods, industrial materials, and nonmonetary gold. Services exports also increased, led by travel and financial services, expanding the nation’s longstanding surplus in services trade to $25.8 billion.\n\nThe rise in exports suggests that fears of foreign retaliation against U.S. tariffs have been overstated. The world has not reacted to the new U.S. trade policies by refusing to buy U.S. goods and services. The April data does not look like a trade war so much as a rebalancing.\n\nThe improvement in net exports comes after trade was a drag on growth in the first quarter and is now expected to make a significant positive contribution to second-quarter GDP. Economists suggest the reversal reflects both changing global trade dynamics and the effects of policies designed to bolster domestic industry and reduce dependence on imports.\n\nImports declined across nearly all major categories, including consumer goods, pharmaceuticals, and automotive products. The U.S. goods trade deficit with Ireland—a major source of pharmaceutical inputs—shrank from $29.3 billion to $9.5 billion, while the deficit with China fell to $19.7 billion. Shortfalls with Mexico and Canada also narrowed.\n\nSome companies may be adjusting their sourcing strategies, while others await the outcome of ongoing negotiations. The administration has indicated that it is pursuing new trade agreements in parallel with its tariff policy, which has emphasized reciprocity and the restoration of industrial capacity in strategic sectors.\n\nEarly indicators suggest the trend may be continuing. A manufacturing survey from the Institute for Supply Management showed the steepest contraction in imports since 2009, pointing to a sustained reshaping of trade flows.\n\nWhile critics have warned that tariffs risk disrupting global commerce, the latest data suggest the U.S. economy is adapting quickly—exporting more, importing less, and building a more resilient foundation for growth."
    }
}