{
    "question": "How might the charges that two Chinese nationals smuggled the Fusarium graminearum fungus into the U.S. influence agricultural biosecurity policy and the handling of pathogen research at American universities?",
    "content": {
        "source_1": "Authorities said it was in connection with work at the University of Michigan.\n\nTwo Chinese nationals have been charged with allegedly smuggling into the U.S. a fungus called \"Fusarium graminearum, which scientific literature classifies as a potential agroterrorism weapon,\" the Justice Department said Tuesday.\n\nYunqing Jian, 33, and Zunyong Liu, 34, citizens of the People’s Republic ofChina, were allegedly receiving Chinese government funding for their research, some of it at the University of Michigan, officials said.\n\n\"The complaint also alleges that Jian’s electronics contain information describing her membership in and loyalty to the Chinese Communist Party,\" a DOJ press release said.\n\n\"It is further alleged that Jian’s boyfriend, Liu, works at a Chinese university where he conducts research on the same pathogen and that he first lied but then admitted to smuggling Fusarium graminearum into America -- through the Detroit Metropolitan Airport -- so that he could conduct research on it at the laboratory at the University of Michigan where his girlfriend, Jian, worked,\" according to the press release.\n\nAttorney General Pam Bondi said in a statement that the Justice Department \"“has no higher mission than keeping the American people safe and protecting our nation from hostile foreign actors who would do us harm.\"\n\n\"Thanks to the hard work of our excellent DOJ attorneys, this defendant — who clandestinely attempted to bring a destructive substance into the United States — will face years behind bars,\" the attorney general said.\n\nThe FBI says it causes “head blight,” a disease of wheat, barley, maize, and rice, and is responsible for billions of dollars in economic losses worldwide each year.\n\n“The alleged actions of these Chinese nationals -- including a loyal member of the Chinese Communist Party -- are of the gravest national security concerns. These two aliens have been charged with smuggling a fungus that has been described as a ‘potential agroterrorism weapon’ into in the heartland of America, where they apparently intended to use a University of Michigan laboratory to further their scheme,” U.S. Attorney Jerome Gorgan said.\n\n“Today’s criminal charges levied upon Yunqing Jian and Zunyong Liu are indicative of CBP’s critical role in protecting the American people from biological threats that could devastate our agricultural economy and cause harm to humans; especially when it involves a researcher from a major university attempting to clandestinely bring potentially harmful biological materials into theUnited States,\" U.S. Custom and Border Protection, Director of Field Operations Marty C. Raybon said.\n\nJian was scheduled to appear Tuesday afternoon in federal court in Detroit for her initial appearance on the complaint, the DOJ said.\n\nThe affidavit alleges that Jian and Liu were dating, and also researching the biological pathogen -- and when questioned about smuggling the pathogen into the United States, lied to authorities at the Detroit airport.\n\n\"On July 27, 2024 Liu entered the United States and told authorities he was visiting his girlfriend and then returning to China to start his own laboratory in China. He allegedly said that he had no work materials, but upon a secondary screening of his luggage, authorities found tissues concealed a note in Chinese, a round piece of filter paper with a series of circles drawn on it, and four clear plastic baggies with small clumps of reddish plant material inside,\" the affidavit said.\n\nHe told authorities he didn't know how the materials ended up in his bag and suggested someone placed them there without his knowledge, officials said, but after further questioning he admitted to placing them in the bag.\n\nHe wasn't arrested at that time, court records suggest.\n\n\"LIU stated that he intentionally hid the samples in his backpack because he knew there were restrictions on the importation of the materials,\" according to the complaint. \"LIU confirmed that he had intentionally put the samples in a wad of tissues so CBP Officers would be less likely to find and confiscate them, and he could continue his research in the United States.\"\n\nThe University of Michigan put out a statement late Tuesday afternoon.\n\n\"We strongly condemn any actions that seek to cause harm, threaten national security or undermine the university’s critical public mission,\" the school's statement said.\n\n\"It is important to note that the university has received no funding from the Chinese government in relation to research conducted by the accused individuals. We have and will continue to cooperate with federal law enforcement in its ongoing investigation and prosecution,\" the statement continued.",
        "source_2": "Two Chinese nationals have been accused of smuggling a fungus into the US that officials describe as a \"dangerous biological pathogen\".\n\nYunqing Jian, 33, and Zunyong Liu, 34, have been charged with conspiracy, smuggling goods, false statements, and visa fraud, the US Attorney's Office for the Eastern District of Michigan announced on Tuesday.\n\nThe complaint alleges Mr Liu tried to smuggle the fungus through Detroit airport so he could study it at a University of Michigan laboratory where his girlfriend, Ms Jian, worked.\n\nThe fungus called Fusarium graminearum can cause a disease in wheat, barley, maize and rice that can wipe out crops and lead to vomiting and liver damage if it gets into food.\n\nThe fungus is described in scientific literature as a \"potential agroterrorism weapon\", according to the US Attorney's Office, adding it is responsible for \"billions of dollars in economic losses worldwide each year.\"\n\nOfficials further allege Ms Jian received funding from the Chinese government for her research on the pathogen in China. They also claim she is a member of the Chinese Communist Party.\n\nUnited States Attorney Jerome F Gorgon Jr described the allegations as of the \"gravest national security concerns\".\n\n\"These two aliens have been charged with smuggling a fungus that has been described as a 'potential agroterrorism weapon' into in the [sic] heartland of America, where they apparently intended to use a University of Michigan laboratory to further their scheme.\"\n\nThe investigation was a joint effort between the FBI and US Customs and Border Protection.\n\nMs Jian is due to appear in court in Detroit, Michigan on Tuesday.\n\nThe University of Michigan said in a statement to the BBC that it \"has received no funding from the Chinese government in relation to research conducted by the accused individuals\".\n\nUniversity officials are cooperating with law enforcement on the investigation and they \"strongly condemn any actions that seek to cause harm, threaten national security or undermine the university's critical public mission\", according to the statement.\n\nSpokesman for the Chinese embassy in Washington DC Liu Pengyu told the BBC that he is not familiar with this specific case, but emphasized that Beijing \"has always required overseas Chinese citizens to abide by local laws and regulations and will also resolutely safeguard their legitimate rights and interests\".\n\nThe charges come amid strained relations between the US and China, and just days after the Trump administration vowed to\"aggressively\" revoke the visas of Chinese nationals studying in the US.\n\nBeijing also said Washington\"severely violated\" a trade truce reached in Geneva last month, when both countries lowered tariffs on goods imported from each other.\n\nEarlier this week, a Chinese student at the University of Michigan was charged for illegally voting in the 2024 election.\n\nThe crash in the disputed Scarborough Shoal rendered a Chinese warship \"unseaworthy\", Manila said.\n\nWatch: Chinese ships collide while pursuing Philippine boat\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.",
        "source_3": "TwoChinesenationals were charged with smuggling a “potential agroterrorism” fungus into theUnited StatescalledFusarium graminearum.\n\nThe fungus causes “head blight,” a disease associated with wheat, barley, maize, and rice that can cause billions of dollars in damage.\n\nYunqing Jian, 33, and Zunyong Liu, 34, who are citizens of the People’s Republic of China, are also being accused of having ties to the Chinese Communist Party.\n\n“This case is a sobering reminder that theChinese Communist Partycontinues to deploy operatives and researchers to infiltrate our institutions and target our food supply, an act that could cripple our economy and endanger American lives,” FBI Director Kash Pateltold Fox Newsin a statement. “Smuggling a known agroterrorism agent into the U.S. is not just a violation of law, it’s a direct threat to national security. I commend the FBI Detroit Division and our partners at CBP for stopping this biological threat before it could do real damage.”\n\nJian is a researcher for the University of Michigan, and Liu, Jian’s boyfriend, allegedly works at a Chinese university and has done research on the fungus. Both were allegedly receiving Chinese government funding for their research.\n\n“It is further alleged that Jian’s boyfriend, Liu, works at a Chinese university where he conducts research on the same pathogen and that he first lied but then admitted to smuggling Fusarium graminearum into America — through the Detroit Metropolitan Airport — so that he could conduct research on it at the laboratory at the University of Michigan where his girlfriend, Jian, worked,” according to a DOJ press release.\n\n“The complaint also alleges that Jian’s electronics contain information describing her membership in and loyalty to the Chinese Communist Party,” the release added.\n\nAttorney General Pam Bondi said in a statement that the Justice Department “has no higher mission than keeping the American people safe and protecting our nation from hostile foreign actors who would do us harm.”\n\n“Thanks to the hard work of our excellent DOJ attorneys, this defendant, who clandestinely attempted to bring a destructive substance into the United States, will face years behind bars,” she said.\n\nLiu entered the U.S. in July 2024 with “a note in Chinese, a round piece of filter paper with a series of circles drawn on it, and four clear plastic baggies with small clumps of reddish plant material inside,” an affidavit said. When asked why they were in his bag, he said he didn’t know and suggested someone else may have placed them there, before later admitting that he knew. He wasn’t arrested at the time.\n\n“LIU stated that he intentionally hid the samples in his backpack because he knew there were restrictions on the importation of the materials,” according to the complaint. “LIU confirmed that he had intentionally put the samples in a wad of tissues so CBP Officers would be less likely to find and confiscate them, and he could continue his research in the United States.”\n\nThe University of Michigan condemned any attempt to harm national security.\n\n“We strongly condemn any actions that seek to cause harm, threaten national security, or undermine the university’s critical public mission,” the school’s statement said.\n\nIt continued, “It is important to note that the university has received no funding from the Chinese government in relation to research conducted by the accused individuals. We have and will continue to cooperate with federal law enforcement in its ongoing investigation and prosecution.”\n\nVISAS OF CHINESE STUDENTS TO BE ‘AGGRESSIVELY’ REVOKED, RUBIO SAYS\n\nThe charges came a week after Secretary of State Marco Rubio said the U.S. would begin “aggressively” revoking Chinese students’ visas.\n\n“Under President Trump’s leadership, the U.S. State Department will work with the Department of Homeland Security to aggressively revoke visas for Chinese students, including those with connections to the Chinese Communist Party or studying in critical fields,” Rubio said in a statement. “We will also revise visa criteria to enhance scrutiny of all future visa applications from the People’s Republic of China and Hong Kong.”"
    }
}