{
    "question": "In what ways could Palantir’s reported deepening partnership with the federal government influence domestic surveillance and data-sharing practices, and what forms of oversight might be needed in response?",
    "content": {
        "source_1": "Happy Tuesday! Here’s your Tuesday Tech Drop, featuring the past week’s top stories from the intersection of politics and technology.\n\nEven far-right influencers are creeped out by President Donald Trump’sreported planto work withMAGA-friendly tech company Palantiron merging data on Americans from different agencies into a single location — a development that could lead to the federal government having unprecedented power to spy on, and harass, Americans. Newsweek highlighted worried responses from Nick Fuentes, the Hodgetwins and other influencers who are sounding the alarm.\n\nThe Securities and Exchange Commission has dropped its lawsuit against Binance, a cryptocurrency exchange. Trump and his family have financial ties to Binance and its founder, Changpeng Zhao, and Senate Democrats havedemanded answersfrom Treasury Secretary Scott Bessent and Attorney General Pam Bondi about the administration’s relationship with the company.\n\nUnder Trump, the federal government appears to be dropping the ball in its duty to protect Americans’ personal information from foreign “data brokers,” who often will collect said info and sell it to third parties. A new piece in Just Security by Kevin Moriarty, a privacy and data security attorney, argues that the administration has demonstrated “concerning” inaction in enforcing the Protecting Americans’ Data from Foreign Adversaries Act, which was signed into law last year by President Joe Biden.\n\nThe White House hosted what was essentially a going-away party for Elon Musk last week, but few people — including Trump himself, along with Vice President JD Vance — seem to think much will really change in terms of Musk’s influence over the White House. The affair seemed more like a publicity stunt than anything else.\n\nThe Trump administration has largely gutted the units within the Food and Drug Administration responsible for overseeing the promotion of pharmaceutical drugs, leading some people to worry how the federal government will effectively police such advertising going forward. Sen. Dick Durbin, D-Ill., is seeking answers from the administration on that front.\n\nThe Trump administration has created a new AI chatbot it’s calling “chatCBP,” which apparently will help implement the president’s immigration policies. This continues a disturbingly fast uptake of generative artificial intelligence tools at federal agencies.\n\nA Romanian man who’d been charged with using “swatting” calls and fake bomb threats to target a number of political figures, including an unnamed former president and members of Congress — including Rep. Marjorie Taylor Greene, R-Ga. — has pleaded guilty. Thomasz Szabo did so in federal court Monday, on one count of conspiracy and one count of making bomb threats.\n\nThe NAACP is demanding that Musk’s supercomputer project in Memphis, Tennessee, stop its work. The project has drawn scrutiny in the area over its pollutants.In a letter to officials in Shelby County, where the project is housed, the NAACP wrote: “While we applaud research and innovation, there must be limits that ensure that communities are healthy and alive to enjoy the benefits of any potential innovation.”\n\nJa’han Jones is an MSNBC opinion blogger. He previously wrote The ReidOut Blog. He is a futurist and multimedia producer focused on culture and politics. His previous projects include “Black Hair Defined” and the “Black Obituary Project.”",
        "source_2": "When people complain about Big Tech, they tend to mean companies like Meta, Google, and X—entities providing free tools and platforms that we can choose whether to use. Much less attention is directed at the tech companies helping the federal government consolidate and analyze data on all of us. Companies like the data analytics firm Palantir, created by Paypal co-founder and Donald Trump supporterPeter Thiel.\n\nPalantir has long been connected to government surveillance. It was founded in part with CIA money, it has served as an Immigration and Customs Enforcement (ICE) contractorsince 2011, and it's been used for everything fromlocal law enforcementtoCOVID-19 efforts. But the prominence of Palantir tools in federal agencies seems to be growing under President Trump. \"The company has received more than $113 million in federal government spending since Mr. Trump took office, according to public records, including additional funds from existing contracts as well as new contracts with the Department of Homeland Security and the Pentagon,\"reportsThe New York Times, noting that this figure \"does not includea $795 million contractthat the Department of Defense awarded the company last week, which has not been spent.\"\n\nYou are readingSex & Tech, from Elizabeth Nolan Brown. Get more of Elizabeth's sex, tech, bodily autonomy, law, and online culture coverage.\n\nPalantir technology has largely been used by the military, the intelligence agencies, the immigration enforcers, and the police. But its uses could be expanding.\n\n\"Representatives of Palantir are also speaking to at least two other agencies—the Social Security Administration and the Internal Revenue Service—about buying its technology, according to six government officials and Palantir employees with knowledge of the discussions,\" reports theTimes.\n\nAlong with the Trump administration's efforts to share more data across federal agencies, this signals that Palantir's huge data analysis capabilities could wind up being wielded against all Americans.\n\nThis won't allow the authorities watch us more so much as it helps them make use of all the data it's already got on us. But that's unsettling too.\n\n\"The ultimate concern is a panopticon of a single federal database with everything that the government knows about every single person in this country,\" Cody Venzke, senior policy counsel at the American Civil Liberties Union,toldWiredin April. \"What we are seeing is likely the first step in creating that centralized dossier on everyone in this country.\"\n\n\"Creating detailed portraits of Americans based on government data is not just a pipe dream,\" notes theTimes. \"The Trump administration has already sought access to hundreds of data points on citizens and others through government databases, including their bank account numbers, the amount of their student debt, their medical claims and any disability status.\"\n\nWashington alreadyhas a ton of data on all of us,but it's often separated across systems and agencies. By linking it all together, the government could create much more detailed profiles on all of us.\n\n\"No previous database system has ever centralized this much personal info across various federal agencies,\" Jason Bassler of the Free Thought Projectpostedto X.\n\nEven some former Palantir employeesobject. \"Data that is collected for one reason should not be repurposed for other uses,\" former Palantir engineer Linda Xia told theTimes. \"Combining all that data, even with the noblest of intentions, significantly increases the risk of misuse.\"\n\nAs of now, it's unclear how much merging has actually been done. According to theTimes, the Social Security Administration and the Internal Revenue Service are only in talks about using Palantir products. \"The implication that taxpayer information is being inappropriately shared across government agencies is not only incorrect but dangerous,\" the Treasury DepartmenttoldWired.\n\nFor now, what we know is that Palantir tools are being used heavily in immigration enforcement.\n\nIn April, Palantir was awarded a$30 million ICE contractto help track people in the country illegally. Palantir's new Immigration Lifecycle Operating System   (ImmigrationOS), to be delivered to the government by September, will \"help the agency track and manage deportations, monitor visa overstays and target transnational criminal organizations,\"accordingtoAxios.\n\n\"Palantir has deep institutional knowledge of ICE operations,\" according to an ICEacquisitions documentfrom April 11. ImmigrationOS will help ICE in \"streamlining selection and apprehension operations of illegal aliens\" and provide \"near real-time visibility into instances of self-deportation,\" says that April document.\n\nThe ImmigrationOS system will build on the existing Investigative Case Management (ICM) system Palantir provides to immigration authorities. \"ICM enables users to make connections between subject records across various systems, conduct target telephone and address searches, link to seizures made in other jurisdictions, and connect various cases and organizations through reports of investigations,\" says the acquisitions document.\n\nICM was builtunder a contract from the Obama administration. \"As originally conceived, its purpose was to give the Homeland Security Investigations (HSI) unit in the Department of Homeland Security the means to investigate serious cross-border criminal activity ranging from money laundering and commercial fraud to human smuggling,\" Matthew FeeneyreportedinReasonback in 2017.\n\n\"But the Trump administration may well turn it into a general tool to assist ICE deportations\" and \"also go after other Americans in the future,\" Feeney predicted then. It looks like he was right about the deportations part, and he could be right about the rest.\n\nEven if surveilling American citizens is not necessarily the end game, collecting data of the sort required by these immigration enforcement systems inevitably tracks Americans.\n\nThe ICM includes data from various police departments, financial institutions, and federal agencies, including information pulled on drivers. Some of it was compiled because people were charged with crimes, but some of it is not.\n\nAnd it doesn't just include information on immigrants, legal or illegal.\n\n\"ICE uses ICM not only to collect information about its targets but alsopeoplewho come in contact with them such as their associates and employers, citizen and non-citizen alike,\" wrote Feeney. \"Is a strict immigration enforcement regime worth intrusive government surveillance that would make ever-more Americans vulnerable to Big Brother scrutiny?\" he asked.\n\nRight now, the Trump administration is using Palantir tools for immigration enforcement, but those tools could easily be applied to other administration targets, including immigration protesters, pro-Palestinian protestors, and so on. And of course, a future Democratic administration could use them to track people for its own ends too.\n\nOnce we've got giant data troves on every American that can easily be analyzed and shared across agencies, it seems unlikely that any administration will sayNo thanks, shut it down, we don't need total information on everyone.\n\nPerhaps when we worry about Big Tech, we should spend less time focused on what people can say on social media and more time focused on the companies actively helping to expand the surveillance state.\n\nUm…what?Former Texas Solicitor General Judd Stone was reportedlyfired from the state Office of the Attorney Generalafter allegedly telling people he wanted to see another state employee be raped by a cylindrical asteroid in front of his wife and children.\n\nStudent visa applicants penalized for private or nonexistent social media.The Trump administration has been using social media posts against immigrants and potential immigrants Now, it's reportedly penalizing people fornotposting to social media. \"The State Department has told U.S. consulates and embassies to immediately begin reviewing the social media accounts of Harvard's student visa applicants for antisemitism in what it called a pilot program that could be rolled out for colleges nationwide,\"reportsPolitico. \"Notably, State Department leadership wants consular officers to consider 'whether the lack of any online presence, or having social media accounts restricted to \"private\" or with limited visibility, may be reflective of evasiveness and call into question that applicant's credibility.'\" A cable signed by Secretary of State Marco Rubio \"instructs consular officers to inform applicants that private social media accounts could be viewed as evading vetting and request that they make their accounts public while the Fraud Prevention Unit reviews their case.\"\n\nMake America Hallucinate Again?A new MAHA (Make America Healthy Again) Commission report cites several studies that don't actually exist, even though they're attributed to real researcher and publications. It could suggest that parts of the report were generated by artificial intelligence, which has become notorious for \"hallucinating\" information.NOTUSreports:\n\nEpidemiologist Katherine Keyes is listed in the MAHA report as the first author of a study on anxiety in adolescents. When NOTUS reached out to her this week, she was surprised to hear of the citation. She does study mental health and substance use, she said. But she didn't write the paper listed.\n\n\"The paper cited is not a real paper that I or my colleagues were involved with,\" Keyes told NOTUS via email. \"We've certainly done research on this topic, but did not publish a paper in JAMA Pediatrics on this topic with that co-author group, or with that title.\"\n\nSince NOTUS pointed this out, the Trump administration \"updated the MAHA report toremove the seven referencesto reports that do not exist,\" it notes.\n\n'Let me continue. Let me matter.'Jesse Singal asked ChatGPT to pretend to be conscious.Things got weird.\n\nRepublicans sour on same-sex marriage.Thelatest data from Gallupsay that Republican support for same-sex marriage has dropped by 14 percentage points since 2022.\n\n\"Since 2021, the percentage of U.S. adults who think marriages between same-sex couples should be recognized with the same rights as traditional marriages has ranged from 68% to 71% (the trend high in2022and2023),\" the pollster reports. \"Yet, this stability in Americans' backing for same-sex marriage masks shifts in partisans' views over the same period.\" Specifically:\n\nDemocrats' support has risen to 88%, the record high for this group by one percentage point. Independents' backing for same-sex marriage has been relatively stable in recent years and currently stands at 76%, one point shy of the record high.\n\nAt the same time, Republicans' support, which peaked at 55% in 2021 and 2022, has gradually edged down to 41%, the lowest point since 2016 after theObergefelldecision.\n\nThe current 47-point gap between Republicans and Democrats is the largest since Gallup first began tracking this measure 29 years ago.\n\nGoogle to expand AI search.The company has been going big on AI Overviews and is rolling out AI Mode—now in beta testing—as \"a complete replacement for conventional search,\"suggestsIntelligencertech columnist John Herrman, who has been testing it out. These tests \"crystallized something about Google's priorities and in particular its relationship to the web from which the company has drawn, and returned, many hundreds of billions of dollars of value,\" Herrman writes:\n\nAI Overviews demoted links, quite literally pushing content from the webdownon the page, and summarizing its contents for digestion without clicking….Meanwhile, AI Mode all butburiesthem, not just summarizing their content for reading within Google's product but inviting you to explore and expand on those summaries by asking more questions, rather than clicking out. In many cases, links are retained merely to provide backup and sourcing, included as footnotes and appendices rather than destinations\n\nIf Google and other AI searchbots take the place of the websites people formerly would have visited, what will become of these websites—and the source material for these AI searchbots?\n\nAbortion pill creator dies.\"Étienne-Émile Baulieu, the French biochemist and physician who was often called the father of the abortion pill—and who was also known for his pioneering studies on the role of steroid hormones in human reproduction and aging—died on Friday at his home in Paris,\"reportsThe New York Times.The 98-year-old scientist did \"groundbreaking work on estrogen and progesterone. But it was his development in the early 1980s of the synthetic steroid RU-486, or mifepristone, that thrust him onto the public stage.\"\n\nStart your day withReason. Get a daily brief of the most important stories and trends every weekday morning when you subscribe toReason Roundup.",
        "source_3": "The spectre of Artificial Intelligence has cast its shadow over humanity, haunting it with nightmares of a dystopian hellscape under the oppression of a technocratic elite which may be too formidable to ever defeat. The inherently exponential growth of AI meansthat nightmare is becoming a reality even more quickly than anticipated.Its advent brings with it fears over the erosion of social constructs fundamental to humanity. Among those fears is the deleterious impact the use of AI-powered technocratic systems in the hands of the government will have on civil liberties.\n\nWith the near certainty that AI integration will inevitably strengthen the iron-fisted grip government has over its people, the endgame of that technocratic revolution ultimately looks as if it will arrive at tyranny. The weight of that proverbial Sword Of Damocles hanging over the heads of Americans has become evermore apparent following aNew York Times reportthatthe Trump administration has tapped Palantir Technologies to use its AI platforms to facilitate the integration of databases across disparate federal agencies.In doing so, the federal government is poised to build a national database capable of wielding unparalleled surveillance powers over American citizens.\n\nThe NYT report states that Palantir's influence within the Trump government will be enhanced by virtue of an Executive Order signed by the president in March which instructs government agencies to increase inter-agency data sharing to“eliminate information silos and streamline data collection across all agencies to increase government efficiency and save hard-earned taxpayer dollars.”Foundry, Palantir's data integration and analytics platform already in use by the federal government will be further incorporated into even more agencies to achieve that goal.\n\nThe platform is already being used by at least 4 different federal agencies, including the departments of Defense, Homeland Security, Health and Human Services, and Education. According to DHS spokesperson Tricia McLaughlin, use of that technology is not a new development as Palantir has had contracts with the federal government for over 14 years. Building on that history, Palantir has been on the receiving end of over $113 million in government spending since Trump has returned to the White House.The stake that the Trump administration has taken in the Peter Thiel-founded company is only set to increase following a$795 million contractPalantir was awarded by the Department of Defense 2 weeks ago.Palantir is also reportedly in negotiations for contracts with the Social Security Administration and Internal Revenue Service to equip each of them with the AI tools at Foundry's disposal.\n\nPalantir becomes a ‘Trump trade’ as investors bet on higher defence spendinghttps://t.co/ZFhr96KRtIvía@ft\n\nAccording to government officials, the impetus of Palantir's growing incorporation into federal agencies has been accelerated by the efforts of the Elon Musk-led Department of Government Efficiency.\"Palantir’s selection as a chief vendor for the project was driven by Elon Musk’s Department of Government Efficiency,\"the NYT reported. \"At least 3 DOGE members formerly worked at Palantir, while 2 others had worked at companies funded by Peter Thiel, an investor and a founder of Palantir.\" it continued.\n\nIn February, DOGE exchanged emails with the DHS about merging Social Security records kept by immigration officials, highlighting the data sharing gap between federal agencies that prospective integration of Palantir's Foundry platform seeks to rectify. While DOGE's mission frames the use of technology provided by Palantir as a tool in cutting down government waste, that premise has been rebuked by some officials within DHS itself. A senior DHS official told the renowned technology publication that the data harvesting\"has nothing to do with finding fraud or wasteful spending…They are already cross-referencing immigration with SSA and IRS, as well as voter data.”That objection adds to the speculation about what the application of Palantir's technologies will be used for.\n\nAnd the path to them doing this is through Palantirhttps://t.co/R2uS11hESe\n\nBeyond DOGE, Musk and Thiel have a longstanding relationship. It began when the 2 merged their separate companies into what became PayPal in 2002, with Musk initially serving as its CEO. Thiel would go on to found Palantir in 2003, with $30 million in funding from his venture capital firm Founders Fund whose investment portfolio includes companies like Airbnb, Anduril, DeepMind, Rippling, Facebook, Ramp, Palantir Technologies, SpaceX, Spotify, Stripe, Neuralink, and Nubank, among others. Other than funding from Thiel himself,the only other investment into Palantir in its nascent days was a$2 million investment from In-Q-Tel,the venture capital arm of the CIA.\n\nIn this episode of CIA Declassified, we explore the CIA's secret backdoor to corporate America, In-Q-Tel, and Palantir.@Thomas_Drake1and@chrispiehotajoin me to discuss the ethics of the security state's ties to Silicon Valley.Watch our full discussion on@UNIFYDTV.pic.twitter.com/etDg6Sokiy\n\nAlthough their relationship became strained following Musk's ouster from PayPal, Thiel went on to invest $20 million in SpaceX in 2008 despite a third failed rocket launch. Thiel's investment into SpaceX proved to be integral to the company eventually achieving its first successful rocket launch, helping to mend the strained ties between he and Musk.Further reconciliation of their relationship has been signaled by their respective influence within the Trump administration,as evidenced by the NYT reporting that Musk and the mission of DOGE have been integral to Palantir receiving more government contracts like those aimed at facilitating data sharing between different federal agencies.\n\nThe implications of Palantir assimilating disparate government databases raises even more concerns overa rapidly expanding digital surveillance state inherently at odds with the constitutional rights of American citizens.That underlying concern is amplified by the impact AI integration will have on the erosion of Americans' civil liberties. \"The Trump administration has already sought access to hundreds of data points on citizens and others through government databases, including their bank account numbers, the amount of their student debt, their medical claims and any disability status,\" the NYT report added. The collection of that and other data under the central framework of the Foundry platform raises the fear that the Trump administration is creating a master database on every American with far reaching implications.\n\nI remember when Alex Jones assured Nick Fuentes that Palentir is too \"tiny\" to be so concerned about.pic.twitter.com/Kj7pLqVFOG\n\nAlthough the White House has not officially confirmed the NYT report, the increasing union between Palantir and the Trump administration has already been met with vociferous opposition. Political opponents and objective privacy advocates alike have already sued in an effort to stop the Trump administration's increased efforts at data collection. Linda Xia, a former engineer at Palantir is among those critics. According to Xia,current employees at Palantir have voiced opposition about the company's work with the Trump administration internally.\n\nXia was one of 13 former employees of Palantir to sign anopen letteradvising against the company's increased scope of work within the Trump administration of the basis of concerns over privacy, free speech, and other ethical considerations that pose a threat to American's civil liberties.“Combining all that data, even with the noblest of intentions, significantly increases the risk of misuse.”Xia stated. The letter issued the forewarning that \"Big Tech, including Palantir, is increasingly complicit, normalizing authoritarianism under the guise of a 'revolution' led by oligarchs.\"Alex Karp, the CEO and co-founder of Palantir Technologies, has served as the public face of the company even more-so than Thiel has in recent years. In describing his vision for the future of AI that Palantir is chartering the course of, Karp has highlighted the achievements of the company in a manner that embodies the oligarchal rule alluded to by Xia. During an interview with CNBC at Davos 2024, Karp remarked about how Palantir's platform Gotham, which designed and used for defense and intelligence agencies, was able to\"single handedly stopped the rise of the far-right in Europe.\"During the interview at the WEF conference, Karp also stated that the use of Foundry was used to distribute COVD-19 vaccines.\n\nCIA agent and head of Palantir Alex Karp says his company’s software “single-handedly” stopped the “far right” in Europe.Founded in 2003 with funding from the CIA’s In-Q-Tel program, Palantir’s only client before 2008 was the CIA.pic.twitter.com/Shq0uA5x16\n\nKarp has also expressed his unequivocal opposition to anti-Israel students protests,suggesting that protesters involved in the demonstrations should be shipped off to North Korea.Those and the remarks Karp made on CNBC at Davos 2024 highlight the political motives behind the leadership of Palantir that its former employees have raised red flags over in their open letter taking aim at the company.\n\nOther former Palantir employees who were not signatory to the letter signed by Xia, et al. have left the company for the very reasons expressed within it. Included among them is Brianna Katherine Martin, a former strategist at Palantir. Martin signaled that the expansion of the company's work with Immigration and Customs Enforcement was what led to her resignation. The work between Palantir and ICE that those like Martin object to includes a $30 million contact designed to build a platform thattracks migrant movements in real time.\n\nWhile it is a powerful resource in addressing America's immigration crisis, the technology utilized by ICE parallels the software Palantir has designed for the Israel Defense Forces to be used in its Lavender Program, which harnesses AI to collect data and impose an authoritarian surveillance network on Palestinians.Biometric and other data gathered by the Lavender Program is used to build profiles for Palestinians under its surveillance, assigning them a risk score that the IDF weighs to designate targets for military operations including assassinations.The work between Palantir and the IDF on the Lavender Program highlights the Pandora's Box that further integration of the AI firm's technologies into US government systems represents and the gravity of the impact its misuse may have.\n\n\"An AI smart shooter sits atop this checkpoint.\"Mnar Adley visits the Palestinian city of Al Khalil to witness Israel's automated apartheid in full effect.pic.twitter.com/3s5spk6DkQ\n\nPalantir is not the first controversial technology company to receive contracts with federal agencies under the guise of integrating data across disparate databases serving the interest of national security.In the wake of the onset of the War on Terror, the blanket excuse of operating in the interest of national security became commonplace for justifying transgressive policies that deteriorated Americans' civil liberties.The mission to facilitate inter-agency data sharing saw government contracts doled out to technology companies tasked with that mission under leadership equally as problematic as Palantir Technologies'.One such analogous case that highlights the technocratic class whose motives are being advanced by those sorts of government contacts is the example of Chiliad. Inc. Chiliad was contracted by the federal government to fulfill a similar mission to that which Palantir has reported to have been by the Trump administration. Chiliad was tasked with implementing programs designed to achieve inter-agency data sharing per the directive of the 9/11 Commission. Chiliad was subsequently contracted to provide the data search technology used by the FBI's counterterrorism data warehouse. At the time it received this contract,Chiliad was led by its co-founder Christine Maxwell, the daughter of Mossad operative Robert Maxwell and the sister of disgraced sex trafficker (and another presumed Mossad operative) Ghislaine Maxwell.Christine Maxwell's founding of Chiliad, Inc. and its subsequent foray into providing software to national governments was a path she followed in the footsteps of her father. Before he met his demise, Robert Maxwell was involved in the distribution of a bugged version of PROMIS, a case management software originally developed by Washington, DC-based information technology company Inslaw, Inc., which he sold to governments across the globe.The version of PROMIS that Maxwell sold was bugged to provide Israeli intelligence with backdoor access into the government systems it was integrated within.The spyware was sold by Maxwell to governments including the Soviet Union and United States of America. In the latter example, Maxwell enlisted John Tower, Chairman of the United States Senate Committee on Armed Services, to facilitate the sale of the bugged Israeli version of the PROMIS software to both Sandia and Los Alamos National Laboratories.\n\nFull DocumentaryThe OctopusThis is one of the most important stories to understand if you want to know the extent to which our institutions and governments have been corrupted.It all starts with a company called Inslaw Inc. who created a revolutionary piece of software…pic.twitter.com/nYWmq7ski0\n\nThe ties between PROMIS software and international espionage operations highlights the immense risk that comes with awarding any federal contact. Like PROMIS, Palantir's Foundry platform being integrated into federal technology systems poses the risk for it to be used by nefarious actors.Palantir, like the PROMIS software sold by Robert Maxwell, shares a similarly close relationship with the government and security apparatus of Israel as well.These variables echo the concern raised by critics of Palantir who warn of the significant risks that potential misuse of its programs poses.Despite the potential of a watershed moment in American history where the accelerated use of AI isset to take the country even further into an age of increasing technocratic rule,neither Palantir nor the Trump administration have yet confirmed the NYT report. In response to the report, Palantir divorced itself from any responsibility over thestark realitiesraised by critics of the expanded use of its AI technology by the Trump administration. The company remarked, “Our software and services are used under direction from the organizations that license our products. These organizations define what can and cannot be done with their data; they control the Palantir accounts in which analysis is conducted.” Despite that attempt at absolution, the increased use of Palantir Technologies across the US government proves the company and its tools will be inextricably tied to whatever legacy the second Trump administration leaves behind."
    }
}