{
    "question": "How should the motive behind Jonathan Joss’s shooting be evaluated amid claims of homophobic harassment and reports of a long-standing neighborhood feud, and what are the potential consequences of those conclusions for the community and media coverage?",
    "content": {
        "source_1": "A neighbor in San Antonio who opened fire on the actor during a dispute was charged with murder, the authorities said. Mr. Joss also appeared in “Parks and Recreation.”\n\nJonathan Joss, the actor best known for his voice work on the animated television show “King of the Hill,” was shot and killed by a neighbor on Sunday night during a dispute in San Antonio, the authorities said.\n\nMr. Joss, who was 59, voiced John Redcorn on “King of the Hill” and also appeared in “Parks and Recreation,” “Ray Donovan” and “Tulsa King.”\n\nThe neighbor, who was identified by investigators as Sigfredo Ceja Alvarez, 56, was taken into custody shortly after the altercation and charged with murder, the San Antonio Police Department said on Monday.\n\nThe police did not say what had led to the dispute, which happened around 7 p.m. on the south side of San Antonio. But in apost on Mr. Joss’s Facebook pageon Monday, his husband, Tristan Kern de Gonzales, described the shooting as a hate crime and said that the two of them had been repeatedly harassed because they were gay. He wrote that they had returned to a property where Mr. Joss’s home had burned down earlier this year when the shooting occurred.\n\n“He started yelling violent homophobic slurs at us,” he wrote in a statement. “He then raised a gun from his lap and fired.”\n\nMr. Kern de Gonzales said that he and Mr. Joss had reported the harassment several times in the past to the authorities, but that it had continued.\n\nA police spokesman disputed Mr. Kern de Gonzales’s account about what had motivated the attack.\n\n“Our investigation has found no evidence whatsoever to indicate that Mr. Joss’s murder was related to his sexual orientation,” the spokesman said in a statement. “We take such allegations very seriously and have thoroughly reviewed all available information. Should any new evidence come to light, we will charge the suspect accordingly.”\n\nWhen officers responded, they found Mr. Joss near the street and attempted lifesaving measures, the Police Department said. Paramedics pronounced him dead when they arrived.\n\nThe police referred questions about how many times Mr. Joss had been shot to the Bexar County Medical Examiner’s Office, which did not immediately respond to a request for comment on Monday.\n\nInformation on whether Mr. Ceja Alvarez had a lawyer was not immediately available on Monday.\n\nMr. Joss, who was of Apache and Comanche descent, often played Native American roles during his roughly three-decade acting career.\n\nHis most famous one was the character of John Redcorn on the animated series “King of the Hill,” a Native American masseur and New Age healer who carries on a lengthy affair with Nancy Hicks-Gribble that leads to a baby. He appeared in 34 episodes of the show from 1997 to 2009, according to IMDb, the entertainment database. Mr. Joss was set to return to the role in the show’s upcoming revival, Variety reported, which will premiere on Hulu in August.\n\nFrom 2011 to 2015, Mr. Joss appeared in five episodes of the NBC sitcom “Parks and Recreation,” as a Native American chief, Ken Hotate.\n\nMr. Joss also played smaller parts in the movie “True Grit” and the television shows “Walker, Texas Ranger” and “Friday Night Lights.”\n\nIn January of this year, Mr. Joss lost his home of decades in San Antonio and a dog in a fire, the television stationKSAT reported. At the time, he told the station that his home did not have electricity or gas because it had been vandalized and that he may have left something on that caused the fire. He said that he did not have a job.\n\nA fan in San Antonio created a GoFundMe page to raise money for Mr. Joss after the fire, which started to receive new donations after Mr. Joss’s death.\n\nA full list of survivors for Mr. Joss was not immediately available on Monday.\n\nMr. Joss grew up in San Antonio and received a bachelor’s degree in fine arts from Our Lady of the Lake University there, according to aprofile on the college’s website.\n\nNeil Vigdor covers breaking news for The Times, with a focus on politics.",
        "source_2": "To stream KENS 5 on your phone, you need the KENS 5 app.\n\nSAN ANTONIO — The popular voice actor Jonathan Joss, a San Antonio native who performed on \"King of the Hill\" and other shows, wasshot to death Sundaynear the site where his home had stood in a south-side neighborhood.\n\nHis neighbors are painting a picture of the man behind the character as police charge his neighbor with his murder.\n\nSan Antonio police say a long-running neighborhood feud turned deadly Sunday night on Dorsey Street off Moursund Road.\n\nJoss, whose legal name is Jonathan Joss Gonzales, had lived at a home on Dorsey Street until a devastating fire earlier this year.\n\nNeighbors told KENS 5 he was at the site Sunday night checking his mail, which he did regularly, when something went terribly wrong.\n\nA video shared by a neighbor who was present shows a man, who they identified as Joss, pacing up and down the street with a pitchfork and screaming.\n\nThe neighbors say it was common behavior over the years for Joss to scream while carrying weapons, and even though they say they didn't like it, several neighbors said they were surprised when a man who lives just 50 yards away responded to the situation with a gun around 6 p.m. Sunday.\n\nTo stream KENS 5 on your phone, you need the KENS 5 app.\n\nThey say Joss was shot and died in his own driveway, and they say this was a situation that could have been avoided.\n\n\"Basically we called. We cried out wolf to the City of San Antonio. To 311. To arson investigators about a neighborhood feud several times and nothing ever got done,\" one neighbor said.\n\nPolice accuse Sigfredo Ceja Alvarez of pulling the trigger, and he is now charged with murder. His bond has been set at $200,000. At last check, he remained behind bars.\n\nMany neighbors said Joss and Alvarez had a long history of trouble. They say both men have been showing weapons and trading threats for years.\n\nA neighbor who called herself Gina said \"I've been here six years and when we moved in, it was already going on, so it's just been years of feud with these two and I mean I'm not taking nobody's side because I do have reports on both of them but nothing got done.\"\n\nGina said lots of neighbors have called for help many times \"This man should be alive today, but nothing got done, you know.\"\n\nSan Antonio Police counter that claim by saying the area's SAFFE unit has been mediating the dispute for more than one year. SAFFE is an acronym for San Antonio Fear Free Environment.\n\nNeighbors like Gina said they've felt anything but safe.\n\n\"I have bullet holes in my house and not once did they even try to look at it to see, anything... no investigations, nothing, so safety is a big concern in this neighborhood,\" Gina added.\n\nGina said the feud took many forms, \"Weapons, everything, gun shootings at all times of the hours of the night,\" Gina said, adding the men didn't shoot at each other \"No, just shooting rounds at their own property and stuff. You could just hear the multiple rounds just blowing off on both ends, both ends and he would be yelling a lot.\"\n\nOne neighbor said it was common to see Joss on his property with a crossbow while yelling about various complaints.\n\nMany said they have extensive cell phone video of previous incidents between the two men.\n\nThe log of police visits is also extensive.  In addition to the fire that destroyed the actor's home in January 2025, there are calls for disturbances, threats, criminal mischief, mental health checks, shots fired, shots heard, a knife disturbance and more.\n\nTo stream KENS 5 on your phone, you need the KENS 5 app.\n\nAfter asocial media postindicating the ongoing troubles were related to the actor's personal life, SAPD issued the following statement.\n\n\"Our investigation has found no evidence whatsoever to indicate that the Mr. Joss's murder was related to his sexual orientation. We take such allegations very seriously and have thoroughly reviewed all available information. Should any new evidence come to light, we will charge the suspect accordingly.\"\n\nWith regard to the murder charge, the next court appearance for Alvarez is listed as August 19.\n\nIf he is able to make bond, special conditions have been set which include full house arrest with a GPS monitor, random drug and alcohol testing and no possession of firearms.\n\nDespite the history between the two men, neighbors said they're surprised by the tragic turn of events because these men had been going their separate ways for years without critical incident... until Sunday night.\n\nSo many people here, who grew up with Joss and called him the class clown back in his days at McCullum High School, say they're sad that his career, which was bright, is over.\n\n\"He was really a loyal person. Funny. Anything you could ask for,\" a neighbor said. \"But as everything would happen, you know, you get older, wiser, and then you become rock bottom where they ask you to stop filming.\"",
        "source_3": "The husband of slain“King of the Hill” star Jonathan Josshas claimed his killer cackled and spewed a gay slur moments after allegedly shooting the voice actor in the head.\n\nJoss, 59, was gunned down near his San Antonio, Texas, home Sunday night in an attack that his spouse alleges was carried out by a homophobic neighbor.\n\n“Everything was really close range. It was in the head,” Tristan Kern de Gonzales toldthe Independentof the moment the actor was fatally shot.\n\n“While I’m holding him, [the suspect] has the gun pointed over me, and he’s laughing, saying, ‘Oh, you love him? Joto,'” de Gonzales alleged.\n\n“‘Joto’ is Spanish for f—t. I never knew the word until I came to Texas, and then I heard it a lot.”\n\nThe suspect,Sigfredo Ceja Alvarez, 56, was arrested a block away and has since been charged with murder.\n\nCops, however, said the initial probe had found “no evidence” that indicatedJoss was killeddue to his “sexual orientation.”\n\n“We take such allegations very seriously and have thoroughly reviewed all available information. Should any new evidence come to light, we will charge the suspect accordingly,” San Antonio police said in a statement.\n\nIt comes after the husband claimed the alleged killer had approached the pair after they stopped by to check the mail at Joss’ home, which had been heavily damaged during a January fire that claimed the lives of their three dogs.\n\nThe husband said the couple had just found the bones of their dead pet dog displayed on the property — causing them both “severe emotional distress.”\n\n“We began yelling and crying in response to the pain of what we saw,”de Gonzales said in a social media post.\n\n“While we were doing this a man approached us. He started yelling violent homophobic slurs at us. He then raised a gun from his lap and fired.”\n\nJoss— best known for voicing John Redcorn on the bawdy cartoon comedy — was struck by the gunfire and killed.\n\n“He was murdered by someone who could not stand the sight of two men loving each other,” Joss’ husband said."
    }
}