{
    "question": "What are the potential implications of renaming the USNS Harvey Milk for the Navy’s institutional identity, service member morale, and public perception, and what criteria should guide the selection of a new name?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nA reported Pentagon recommendation to remove Harvey Milk’s name from a U.S. Navy ship has sparked outrage in San Francisco’s LGBTQ+ community, which sees it as an attempt to erase his history and contributions. Critics say the news is especially painful during Pride Month. (AP Video: Haven Daley)\n\nIn this image provided by the U.S. Navy, the John Lewis-class replenishment oiler USNS Harvey Milk (T-AO-206) conducts a replenishment at sea in the Atlantic Ocean, Dec. 13, 2024. (Mass Communication Specialist 2nd Class Maxwell Orlosky/U.S. Navy via AP))\n\nDefense Secretary Pete Hegseth listens during an event with President Donald Trump to sign executive orders regarding nuclear energy in the Oval Office of the White House, Friday, May 23, 2025, in Washington. (AP Photo/Evan Vucci)\n\nWASHINGTON (AP) —Defense Secretary Pete Hegsethhas ordered the Navy to rename the USNS Harvey Milk, a highly rare move that will strip the ship of the moniker of a slain gay rights activist who served as a sailor during the Korean War.\n\nU.S. officials say Navy Secretary John Phelan put together a small team to rename the replenishment oiler and that a new name is expected this month. The officials, who spoke on condition of anonymity to discuss internal deliberations, said the next name had not yet been chosen.\n\nThe change was laid out in an internal memo that officials said defended the action as a move to align with President Donald Trump and Hegseth’s objectives to “re-establish the warrior culture.”\n\nIt marks the latest move by Hegseth and the wider Trump administration topurge all programs, policies, books and social media mentionsof references to diversity, equity and inclusion. And it comes duringPride Month— the same timing as the Pentagon’s campaign toforce transgender troops outof the U.S. military.\n\nPentagon spokesman Sean Parnell said in a statement that Hegseth is “committed to ensuring that the names attached to all DOD installations and assets are reflective of the Commander-in-Chief’s priorities, our nation’s history, and the warrior ethos.”\n\nPhelan’s office did not respond to a request for comment on the decision, which was first reported by Military.com.\n\nThe USNS Harvey Milk was named in 2016 by then-Navy Secretary Ray Mabus, who said at the time that the John Lewis-class of oilers would be named after leaders who fought for civil and human rights.\n\nMilk, who was portrayed by Sean Penn in an Oscar-winning 2008 movie, served for four years in the Navy before he was forced out for being gay. He later became one of the first openly gay candidates elected to public office.\n\nMilk served on the San Francisco Board of Supervisors and had sponsored a bill banning discrimination based on sexual orientation in public accommodations, housing and employment. It passed, and San Francisco Mayor George Moscone signed it into law.\n\nOn Nov. 27, 1978, Milk and Moscone were assassinated by Dan White, a disgruntled former city supervisor who cast the sole vote against Milk’s bill.\n\nFormer House Speaker Nancy Pelosi, a Democrat representing San Francisco, said in a statement Tuesday that “this spiteful move does not strengthen our national security or the ‘warrior’ ethos. Instead, it is a surrender of a fundamental American value: to honor the legacy of those who worked to build a better country.”\n\nCalifornia Gov. Gavin Newsom also slammed the move, saying Milk was a Korean War combat veteran whose commander called him “outstanding.”\n\n“Stripping his name from a Navy ship won’t erase his legacy as an American icon, but it does reveal Trump’s contempt for the very values our veterans fight to protect,” the Democrat wrote on X.\n\nTheship was christened in 2021, and during the ceremony, then-Navy Secretary Carlos Del Toro said he wanted to be at the event “not just to amend the wrongs of the past, but to give inspiration to all of our LGBTQ community leaders who served in the Navy, in uniform today and in the civilian workforce as well, too, and to tell them that we’re committed to them in the future.”\n\nThe ship is operated by Military Sealift Command, with a crew of about 125 civilian mariners. The Navy says it conducted its first resupply mission at sea in fall 2024, while operating in the Virginia Capes. It continued to resupply Navy ships at sea off the East Coast until it began scheduled maintenance at Alabama Shipyard in Mobile, Alabama, earlier this year.\n\nWhile the renaming is rare, the Biden administration also changed the names of two Navy ships in 2023 as part of the effort toremove Confederate namesfrom U.S. military installations.\n\nThe USS Chancellorsville — named for the Civil War battle — was renamed the USS Robert Smalls after a sailor and former enslaved person. And the USNS Maury, an oceanographic survey ship originally named after a Confederate sailor, was renamed the USNS Marie Tharp after a geologist and oceanographic cartographer who created the first scientific maps of the Atlantic Ocean floor.\n\nMaritime lore hints as to why renaming ships is so unusual, suggesting that changing a name is bad luck and tempts retribution from the sea gods.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "The US Navy plans to remove the name of gay rights leader and Navy veteran Harvey Milk from one of its ships, and may change the titles of other vessels honouring civil rights leaders.\n\nThe plans were outlined in documents obtained by BBC's US partner CBS News that show a timeline for when the renaming of USNS Harvey Milk would be shared with the public.\n\nIt comes during Pride Month in June, an annual commemoration of the LGBT community that coincides with the anniversary of the Stonewall riots in 1969.\n\nThe directive also comes amid a broader movement by the Trump administration to curb programmes that promote diversity and inclusion across federal departments.\n\nSean Parnell, a spokesman for the Pentagon, told CBS on Tuesday that the renaming of the USNS Harvey Milk is to realign the US military with the Trump administration's goal of \"re-establishing the warrior culture\" in the armed forces.\n\nThe memo calls for Navy Secretary John Phelan to select a new name for the fleet oiler. That name change would then be communicated to other senior US Navy officials after a legal review.\n\nIt also outlines other vessels recommended for renaming, including the USNS Ruth Bader Ginsburg, named after the late liberal Supreme Court justice, and the USNS Harriet Tubman, named after the American slavery abolitionist.\n\nHarvey Milk is known for being the first openly gay man to be elected to public office in California, winning a seat on the San Francisco Board of Supervisors. He was assassinated 10 months after he was sworn in.\n\nThe push to rename the USNS Harvey Milk comes after a directive issued by Defence Secretary Pete Hegseth earlier this year instructing US military personnel to stop hosting events tied to heritage or awareness months.\n\nThis directive banned resources and manpower from being used on events like Pride Month, Black History Month and Women's History Month, citing concerns that they would undermine unity in the military.\n\nUS President Donald Trump also issued executive orders earlier this year that banned diversity, equity and inclusion (DEI) in the government, and that made it official US policy to recognise two sexes, male and female.\n\nSupporters of DEI programmes say they address historical underrepresentation and discrimination against certain groups, including racial minorities, but critics say such initiatives are themselves discriminatory.\n\nThe move to rename the Harvey Milk and other ships has been criticised by prominent Democrats, including former Speaker of the House Nancy Pelosi.\n\nIn a statement to CBS, Pelosi called the move a \"vindictive erasure of those who fought to break down barriers for all to chase the American dream\".\n\nDemocratic Senate Minority Leader Chuck Schumer wrote on X on Tuesday that Hegseth \"should be ashamed of himself and reverse this immediately.\"\n\nVeteran Mary has taught the flamboyant GSV – gay sign variant - to her young protegee.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nThe free event will be held for the second time, in Stone Street Square on 6 September.\n\nScientists who analysed fragments that crashed into a roof in Georgia, US, say it likely formed 4.56 billion years ago.",
        "source_3": "Defense Secretary Pete Hegsethhas ordered the Navy to review the names of several ships honoring the likes of slain gay rights leader Harvey Milk, abolitionist Harriet Tubman and late Supreme Court Justice Ruth Bader Ginsburg, according to multiple reports.\n\nNavy Secretary John Phelan indicated in an internal memo obtained by CBS News that the name review is aimed at “reestablishing the warrior culture” in the military, apriority of the Trump administration.\n\n“Secretary Hegseth is committed to ensuring that the names attached to all [Department of Defense] installations and assets are reflective of the Commander-in-Chief’s priorities, our nation’s history, and the warrior ethos,” Chief Pentagon Spokesman Sean Parnell said in a statement.\n\n“Any potential renaming(s) will be announced after internal reviews are complete,” he added.\n\nThe small teamPhelanhas assembled to go over potential name changes is expected to announce a new moniker for the USNS Harvey Milk – a replenishment oiler – by the end of June, gay pride month, according to the Associated Press.\n\nMilk, who served as a sailor during the Korean War, was forced out of the Navy for being gay.\n\nHe later became one of the first openly gay elected officials in American history, when he successfully ran to serve on the San Francisco Board of Supervisors in 1977.\n\nMilk and San Francisco Mayor George Moscone were both assassinated in 1978 by a disgruntled former city supervisor who opposed the gay-rights activist’s push to ban discrimination based on sexual orientation in public accommodations, housing and employment.\n\nThe USNS Harvey Milk, which provides support to carrier strike groups at sea, was christened under the Biden administration in 2021.\n\nIt is currently undergoing maintenance in an Alabama shipyard.\n\nFormer House Speaker Nancy Pelosi (D-Calif.), who represents San Francisco in the lower chamber, slammed the renaming as “spiteful” in a statement on Tuesday, arguing that it “does not strengthen our national security or the ‘warrior’ ethos.”\n\n“Instead, it is a surrender of a fundamental American value: to honor the legacy of those who worked to build a better country,” the congresswoman said.\n\nDemocratic California Gov. Gavin Newsom argued on X that removing Milk’s name from the vessel “won’t erase his legacy as an American icon, but it does reveal Trump’s contempt for the very values our veterans fight to protect.”\n\nPhelan’s memo indicates that several other Navy ships named after judicial trailblazers, civil rights icons and labor leaders are also on the renaming “recommended list.”\n\nThose vessels include the USNS Thurgood Marshall, USNS Ruth Bader Ginsburg, USNS Harriet Tubman, USNS Dolores Huerta, USNS Lucy Stone, USNS Cesar Chavez and USNS Medgar Evers, according to CBS News and the New York Times.\n\nAt least one reference to USNS Thurgood Marshall, named after the first black Supreme Court justice, has reportedly already been removed from a Navy website.\n\nIt’s unclear what new moniker the Pentagon is considering giving the USNS Harvey Milk and the other ships.\n\nIt’s not unheard of for the military to rename ships, but maritime superstition has long held that changing a name of a boat is bad luck.\n\nThe Biden administration changed the names of two Navy ships in 2023 as part of the effort toscrub references to the Confederacyfrom military installations and equipment.\n\nThe USS Chancellorsville — named after the Civil War battle won by the Confederacy  — was renamed in honor of Congressman Robert Smalls, a freed slave and sailor who fought for the Union; and the USNS Maury – named after a sailor fighting for the Confederates – was renamed in honor of Marie Tharp, a pioneering geologist and oceanographic cartographer."
    }
}