{
    "question": "How might the record $698 billion in active home listings—alongside sellers outnumbering buyers and a large share of “stale” properties—affect prices, buyer leverage, and housing affordability over the next year?",
    "content": {
        "source_1": "It's a buyer's market in real estate — if you can afford it: There are nearly 500,000 morehome sellersthan buyers in the U.S. housing market, Redfin estimates.\n\nWhy it matters:That's the widest gapon record— and a big reversal from just a few years ago, when home buyers were desperate to find a place to live, sending prices into the stratosphere.\n\nBy the numbers:There are 33.7% more sellers than buyers now. At no other point since Redfin began tracking in 2013 have sellers outnumbered buyers by this large a percentage.\n\nWhere it stands:The one-two punch of still-high home prices and high mortgage rates is making it hard for buyers, especially first-timers, to find a place they can afford.\n\nThe other side:For home sellers \"the mortgage rate lock-in effect is easing,\" per Redfin.  \"For most people, it's not realistic to stay put forever; job changes, return to office mandates and divorce force people to move.\"\n\nBetween the lines:Buying a home is still far out of reach for most Americans, as the National Association of Realtors pointed out in a recentreport.\n\nWhat to watch:Historically, when sellers outnumber buyers, prices drop. And in some markets, prices have already started falling.\n\nThe bottom line:\"The balance of power in the U.S. housing market has shifted toward buyers, but a lot of sellers have yet to see or accept the writing on the wall,\" said Redfin senior economistAsad Khanin the report.",
        "source_2": "Giulia Carbonaro is a Newsweek reporter based in London, U.K. Her focus is on the U.S. economy, housing market, property insurance market, local and national politics. She has previously extensively covered U.S. and European politics. Giulia joined Newsweek in 2022 from CGTN Europe and had previously worked at the European Central Bank. She is a graduate in Broadcast Journalism from Nottingham Trent University and holds a Bachelor's degree in Politics and International Relations from Università degli Studi di Cagliari, Italy. She speaks English, Italian, and a little French and Spanish. You can get in touch with Giulia by emailing: g.carbonaro@newsweek.com.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nRising inventory and dwindling demand across the United States have led to the accumulation of a record $698 billion worth of homes for sale, the highest dollar amountrecorded by Redfinsince the real estate brokerage started tracking data in 2012.\n\nIt is terrible news for homeowners who might have bought their homes at stellar prices during the pandemic and are now unlikely to fetch the same amount reselling their property. But it is good news for prospective homebuyers who, despite still being burdened by historically elevated mortgage rates and rising costs, are likely to benefit from price drops very soon.\n\nFor years until now, a chronic, widespread lack of inventory played a crucial role in bringing up home prices across the country. During the pandemic homebuying frenzy, spurred by low mortgage rates, buyers fought for the limited number of listings available, engaging in bidding wars that sent prices to the roof.\n\nWhen mortgage rates suddenly shot up after the Federal Reserve started its aggressive rate-hiking campaign to lower inflation in 2022, higher monthly payments had the effect of discouraging buyers and locking existing homeowners into their homes, exacerbating the supply shortage.\n\nThree years on, homeowners have stopped waiting for mortgage rates to come down: they are now flocking the market with their listings, adding much-needed inventory to the market, but buyers still cannot afford the purchase or are being cautious about it in times of growing economic uncertainty. The result is that homes are sitting idle on the market, forcing sellers to offer price cuts to lure in buyers.\n\nNot only are there nearly $700 billion worth of listings currently in the market, up 20.3 percent from a year ago, but also more than $330 billion worth of these can be considered \"stale.\" This is according to Redfin, and it means that these properties have sat idle on the market without going under contract for 60 days or longer.\n\nThis pileup of unsold inventory is reflected inthe current mismatch between sellers and buyers, with the first outnumbering the latter by nearly 500,000, the real estate brokerage found.\n\nInventory has been rising in recent months, to the point that, in April, there were a total of 1,965,532 homes for sale in the U.S. market, up 16.3 percent from a year earlier. Of these, 670,083 were new homes, up 6 percent from April 2024.\n\nWhile there is enough pent-demand in the country to find a buyer for every one of the homes available, this is not what is happening. Mortgage rates are still hovering around the 7 percent mark, with the 30-year fixed-rate mortgage at 6.89 percent as of May 29, according to Freddie Mac.\n\nAnd home prices, despite declining sales, are still rising across the country: the median sale price of a home in the U.S. was $438,108 in April, up 1.3 percent from a year earlier, said Redfin.\n\nThe pace of home price growth has already slowed down significantly in recent months compared to what it was a couple of years ago, and it is unlikely to continue for much longer. In April, the number of homes sold, at 441,689, was down 3.1 percent from a year earlier; and 19.9 percent of these homes were sold with a price drop, up 4.3 percentage points year-over-year.\n\nMatt Purdy, a Redfin Premier agent in Denver, said in a press release: \"A huge pop of listings hit the market at the start of spring, and there weren't enough buyers to go around.\n\n\"House hunters are only buying if they absolutely have to, and even serious buyers arebacking out of contractsmore than they used to. Buyers have a window to get a deal; there's still a surplus of inventory on the market, with sellers facing reality and willing to negotiate prices down.\"\n\nChen Zhao, Redfin's head of economics research, said in a press release: \"The record-high dollar value of all homes listed for sale is one way to quantify this buyer's market. Not only are there more homes for sale than there have been in five years, but the value of those homes is higher than it has ever been.\"\n\nRedfin, which at the very beginning of the year still expected home prices to continue growing this year, though at a slower pace than previously reported, has now changed its predictions for the coming months.\n\n\"We expect rising inventory, weakened demand, and the prevalence of stale supply to push home prices down 1 percent by the end of this year, which should improve affordability for buyers because incomes are still going up,\" Zhao said.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nGiulia Carbonaro is a Newsweek reporter based in London, U.K. Her focus is on the U.S. economy, housing market, property insurance market, local and national politics. She has previously extensively covered U.S. and European politics. Giulia joined Newsweek in 2022 from CGTN Europe and had previously worked at the European Central Bank. She is a graduate in Broadcast Journalism from Nottingham Trent University and holds a Bachelor's degree in Politics and International Relations from Università degli Studi di Cagliari, Italy. She speaks English, Italian, and a little French and Spanish. You can get in touch with Giulia by emailing: g.carbonaro@newsweek.com.\n\nGiulia Carbonaro is a Newsweek reporter based in London, U.K. Her focus is on the U.S. economy, housing market, property insurance market, local and national politics. She has previously extensively covered U.S. and European politics. Giulia joined Newsweek in 2022 from CGTN Europe and had previously worked at the European Central Bank. She is a graduate in Broadcast Journalism from Nottingham Trent University and holds a Bachelor's degree in Politics and International Relations from Università degli Studi di Cagliari, Italy. She speaks English, Italian, and a little French and Spanish. You can get in touch with Giulia by emailing: g.carbonaro@newsweek.com.\n\nGiulia Carbonaro is a Newsweek reporter based in London, U.K. Her focus is on the U.S. economy, housing market, property                                    ...Read more",
        "source_3": "Published:04:28 BST, 3 June 2025|Updated:05:13 BST, 3 June 2025\n\nThere areso many homes listed for salein the US that the combined worth is a jaw-dropping number that has hit an all-time high.\n\nA total of $698 billion worth ofhomes are currently for saleacross the country, Redfinreports.\n\nIt's the highest dollar amount ever sitting on the market at once, withmany sellers offering concessionslikeslashing pricesin order to move their home.\n\nThe report is based on an analysis of listings going back through 2012.\n\nThe total value of home listings has hit a record high because of the combination of growing inventory, slowing demand, and increasing home-sale prices.\n\nHousing supply is at a five-year high. There are many more sellers than buyers in the market.\n\nThe total number of homes on the market nationwide rose 16.7 percent year over year in April to its highest level in 5 years, with the mortgage-rate lock-in effect easing and homeowners trying to cash out due to economic uncertainty.\n\nA total of $698 billion worth of homes are currently for sale across the country (Pictured: Homes in Arkansas)\n\nHousing supply is at a five-year high. There are many more sellers than buyers in the market.\n\nThe total number of homes on the market nationwide rose 16.7 percent year over year in April to its highest level in 5 years, with the mortgage-rate lock-in effect easing and homeowners trying to cash out due to economic uncertainty.\n\nNew listings increased 8.6 percent to a three-year high.\n\nThe typical home that sold in April took 40 days to go under contract, five days longer than a year earlier.\n\nThere's also a growing share of inventory that has been sitting on the market for longer than two months.\n\nHome sales are declining, and Redfin agents in much of the country report that would-be buyers are backing off due to record-high monthly housing costs and widespread economic instability.\n\nAcross America, so many homes are sitting on the market the total worth is nearly $700 billion (Pictured: Provincetown in Massachusetts)\n\nThe massive real estate boom that happened during the pandemic is now reversing (Pictured: A home for sale in Austin, Texas)\n\nThe median U.S. home sale price rose 1.4 percent year over year to April. The total value of inventory is up by much more - 20.3 percent year over year.\n\nThis signals that in recent years, the rising number of listings is a bigger factor in the total value of inventory than rising prices.\n\nThere are nearly 500,000 more home sellers than buyers in today's housing market.\n\nThe fact that so many homes are being listed without buyers out there to purchase them, along with continually rising prices, explains why there is an immense worth of unsold inventory sitting on the market.\n\n'A huge pop of listings hit the market at the start of spring, and there weren't enough buyers to go around,' said Matt Purdy, a Redfin Premier agent in Denver.\n\n'House hunters are only buying if they absolutely have to, and even serious buyers are backing out of contracts more than they used to.\n\n'Buyers have a window to get a deal; there's still a surplus of inventory on the market, with sellers facing reality and willing to negotiate prices down.'\n\nToday's surplus of inventory is in stark contrast to the red-hot pandemic-era housing market when homes were in tight supply.\n\nMatt Purdy, a real estate agent in Denver, says there there aren't enough buyers to go around\n\nThe total value of listings dropped to $309 billion in January 2022, the lowest dollar value in Redfin's records, which date back to 2012.\n\nAt the start of 2022, mortgage rates were sitting at a near-record-low of 3.1 percent, homebuyers were hungry, and home supply was at its lowest level on record.\n\nHomes were flying off the market in 24 days, compared to today's average pace of 40 days.\n\nIn April, that number rose even higher, with 44 percent of listings that month on the market for at least 60 days without going under contract.\n\nThat's up from 42.1 percent a year earlier, and the highest April share since 2020, when the start of the pandemic ground the housing market to a halt.\n\nThe total value of that stale inventory (homes on the market for 60 plus days) is $331 billion, which accounts for nearly half of the dollar value of all inventory.\n\n'The record-high dollar value of all homes listed for sale is one way to quantify this buyer's market,' said Chen Zhao, Redfin's head of economics research.\n\n'Not only are there more homes for sale than there have been in five years, but the value of those homes is higher than it has ever been.\n\n'We expect rising inventory, weakened demand, and the prevalence of stale supply to push home prices down 1 percent by the end of this year, which should improve affordability for buyers because incomes are still going up.'\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nBy posting your comment you agree to ourhouse rules.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with ourPrivacy Policy."
    }
}