{
    "question": "How might the Trump administration’s expanded use of Palantir’s data tools across multiple agencies influence government efficiency, oversight, and Americans’ privacy in the long term?",
    "content": {
        "source_1": "The Trump administration has expanded Palantir’s work with the government, spreading the company’s technology — which could easily merge data on Americans — throughout agencies.\n\nThe Trump administration has expanded Palantir’s work with the government, spreading the company’s technology — which could easily merge data on Americans — throughout agencies.\n\nAlex Karp, a co-founder and the chief executive of Palantir, at a forum in Washington in April. The Trump administration has expanded Palantir’s work across the federal government.Credit...Caroline Gutman for The New York Times\n\nSheera Frenkel reported from Washington and San Francisco, and Aaron Krolik from New York.\n\nIn March, President Trump signed an executive order calling for the federal government toshare data across agencies, raising questions over whether he might compile a master list of personal information on Americans that could give him untold surveillance power.\n\nMr. Trump has not publicly talked about the effort since. But behind the scenes, officials have quietly put technological building blocks into place to enable his plan. In particular, they have turned to one company: Palantir, the data analysis and technology firm.\n\nThe Trump administration has expanded Palantir’s work across the federal government in recent months. The company has received more than $113 million in federal government spending since Mr. Trump took office, according to public records, including additional funds from existing contracts as well as new contracts with the Department of Homeland Security and the Pentagon. (This does not include a $795 million contract that the Department of Defense awarded the company last week, which has not been spent.)\n\nRepresentatives of Palantir are also speaking to at least two other agencies — the Social Security Administration and the Internal Revenue Service — about buying its technology, according to six government officials and Palantir employees with knowledge of the discussions.\n\nThe push has put a key Palantir product called Foundry into at least four federal agencies, including D.H.S. and the Health and Human Services Department. Widely adopting Foundry, which organizes and analyzes data, paves the way for Mr. Trump to easily merge information from different agencies, the government officials said.\n\nCreating detailed portraits of Americans based on government data is not just a pipe dream. The Trump administrationhas already sought accessto hundreds of data points on citizens and others through government databases, including their bank account numbers, the amount of their student debt, their medical claims and any disability status.\n\nMr. Trump could potentially use such information to advance his political agenda by policing immigrants and punishing critics, Democratic lawmakers and critics have said. Privacy advocates, student unions and labor rights organizations have filed lawsuits to block data access, questioning whether the government could weaponize people’s personal information.\n\nPalantir’s selection as a chief vendor for the project was driven by Elon Musk’s Department of Government Efficiency, according to the government officials. At least three DOGE members formerly worked at Palantir, while two others had worked at companies funded byPeter Thiel, an investor and a founder of Palantir.\n\nSome current and former Palantir employees have been unnerved by the work. The company risks becoming the face of Mr. Trump’s political agenda, four employees said, and could be vulnerable if data on Americans is breached or hacked. Several tried to distance the company from the efforts, saying any decisions about a merged database of personal information rest with Mr. Trump and not the firm.\n\nThis month, 13 former employeessigned a letterurging Palantir to stop its endeavors with Mr. Trump. Linda Xia, a signee who was a Palantir engineer until last year, said the problem was not with the company’s technology but with how the Trump administration intended to use it.\n\n“Data that is collected for one reason should not be repurposed for other uses,” Ms. Xia said. “Combining all that data, even with the noblest of intentions, significantly increases the risk of misuse.”\n\nMario Trujillo, a lawyer with the Electronic Frontier Foundation, a digital rights group, said the government typically collected data for good reasons, such as to accurately levy taxes. But “if people can’t trust that the data they are giving the government will be protected, that it will be used for things other than what they gave it for, it will lead to a crisis of trust,” he said.\n\nPalantir declined to comment on its work with the Trump administration and pointed to itsblog, which details how the company handles data.\n\n“We act as a data processor, not a data controller,” it said. “Our software and services are used under direction from the organisations that license our products: these organisations define what can and cannot be done with their data; they control the Palantir accounts in which analysis is conducted.”\n\nThe White House did not comment on the use of Palantir’s technology and referred to Mr. Trump’s executive order, which said he wanted to “eliminate information silos and streamline data collection across all agencies to increase government efficiency and save hard-earned taxpayer dollars.”\n\nSome details of Palantir’s government contracts and DOGE’s work to compile data were previously reported byWiredandCNN.\n\nPalantir, which was founded in 2003 by Alex Karp and Mr. Thiel andwent public in 2020, specializes in finding patterns in data and presenting the information in ways that are easy to process and navigate, such as charts and maps. Its main products include Foundry, a data analytics platform, and Gotham, which helps organize and draw conclusions from data and is tailored for security and defense purposes.\n\nIn an interview last year, Mr. Karp, Palantir’s chief executive,saidthe company’s role was “the finding of hidden things” by sifting through data.\n\nPalantir has long worked with the federal government. Its government contracts span the Defense Department and Centers for Disease Control and Prevention. During the pandemic, the Biden administration signed a contract with Palantir to manage the distribution of vaccines through the C.D.C.\n\nMr. Trump’s election in November boosted Palantir’s stock, which has risen more than 140 percent since then. Mr. Karp, who donated to the Democratic Party last year, has welcomed Mr. Trump’s win and called Mr. Musk the most “qualified person in the world” to remake the U.S. government.\n\nAt the I.R.S., Palantir engineers joined in April to use Foundry to organize data gathered on American taxpayers, two government officials said. Their work began as a way to create a single, searchable database for the I.R.S., but has since expanded, they said. Palantir is in talks for a permanent contract with the I.R.S., they said.\n\nA Treasury Department representative said that the I.R.S. was updating its systems to serve American taxpayers, and that Palantir was contracted to complete the work with I.R.S. engineers.\n\nPalantir also recently began helping Immigration and Customs Enforcement’s enforcement and removal operations team, according to two Palantir employees and two current and former D.H.S. officials. The work is part of a $30 million contract that ICE signed with Palantir in April to build a platform to track migrant movements in real time.\n\nSome D.H.S. officials exchanged emails with DOGE officials in February about merging some Social Security information with records kept by immigration officials, according to screenshots of the messagesviewed by The New York Times.\n\nIn a statement, Tricia McLaughlin, a D.H.S. spokeswoman, did not address Palantir’s new work with the agency and said the company “has had contracts with the federal government for 14 years.”\n\nPalantir representatives have also held talks with the Social Security Administration and the Department of Education to use the company’s technology to organize the agencies’ data, according to two Palantir employees and officials in those agencies.\n\nThe Social Security Administration and Education Department did not respond to requests for comment.\n\nThe goal of uniting data on Americans has been quietly discussed by Palantir engineers, employees said, adding that they were worried about collecting so much sensitive information in one place. The company’s security practices are only as good as the people using them, they said. They characterized some DOGE employees as sloppy on security, such as not following protocols in how personal devices were used.\n\nMs. Xia said Palantir employees were increasingly worried about reputational damage to the company because of its work with the Trump administration. There is growing debate within the company about its federal contracts, she said.\n\n“Current employees are discussing the implications of their work and raising questions internally,” she said, adding that some employees have left after disagreements over the company’s work with the Trump administration.\n\nLast week, a Palantir strategist, Brianna Katherine Martin,posted on LinkedInthat she was departing the company because of its expanded work with ICE.\n\n“For most of my time here, I found the way that Palantir grappled with the weight of our capabilities to be refreshing, transparent and conscionable,” she wrote. “This has changed for me over the past few months. For me, this is a red line I won’t redraw.”\n\nAlexandra Berzon,Hamed AleazizandTara Siegel Bernardcontributed reporting.\n\nSheera Frenkel is a reporter based in the San Francisco Bay Area, covering the ways technology impacts everyday lives with a focus on social media companies, including Facebook, Instagram, Twitter, TikTok, YouTube, Telegram and WhatsApp.",
        "source_2": "Nick Mordowanec is a Newsweek investigative reporter based in Michigan. His focus includes U.S. and international politics and policies, immigration, crime and social issues. Other reporting has covered education, economics, and wars in Ukraine and Gaza. Nick joined Newsweek in 2021 from The Oakland Press, and his reporting has been featured in The Detroit News and other publications. His reporting on the opioid epidemic garnered a statewide Michigan Press Association award. The Michigan State University graduate can be reached atn.mordowanec@newsweek.com.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nSupporters of PresidentDonald Trumpexpressed anger and disbelief online following reports that his administration had advanced plans to create a national citizen database with technology firm Palantir.\n\nThe White House has contracted Palantir, a Colorado-based analytics companyco-founded by Trump supporterPeter Thiel, to assist incompiling a database of personal informationon American citizens, according to unnamed government officials and Palantir employees who spoke withThe New York Times. The purported deal follows project talks Palantir had with the Social Security Administration (SSA) and the Department of Education.\n\nThe reaction from Trump's supporters reflected growing unease within conservative circles, indicating a rare rupture between the president and key segments of his constituency. The controversy underscores nationwide anxieties around privacy, civil liberties, and the growing influence of technology firms over personal information management.\n\nThe Palantir deal marks a significant development in government data collection, drawing sharp concern from privacy advocates and Trump's own core base, otherwise known as \"MAGA.\" Detractors compared the centralized database effort to surveillance initiatives in authoritarian regimes.\n\nNumerous pro-Trump voices expressed dismay and feelings of betrayal across social media platforms like X.\n\n\"People are so quick to suggest that I flipped on Trump...No, no, no...I didn't flip on Trump. TRUMP FLIPPED ON US. I'm just not willing to continue living in a LIE, and I will tell you the unfortunate TRUTH about it,\" The Patriot Voice wrote on X to his 158,000 followers.\n\nThe Hodgetwins, popular conservatives and Trump supporters, have more than 3.3 million followers on X. In response toThe New York Timesreport, they wrote on May 30, \"Hope this ain't true y'all.\"\n\nAnother post that same day reads: \"Don't know if this is true but I did not vote for this.\"\n\nNick Fuentes, a far-right Trump supporter described as an \"America First\" white nationalist, called the association between the Trump administration and Palantir \"the ultimate betrayal of his own people.\"\n\n\"Feeding every 'MAGA extremist' into an AI database controlled by a CIA/Mossad cutout,\" Fuentes said on X, where he has roughly 561,000 followers. \"Seriously, if Palantir isn't the deep state, then what is?\"\n\nIn avideorecorded by Fuentes, who also has a Rumble channel viewed over 31 million times, he said the following: \"They are tracking everybody that criticized Israel, everybody that interacts with somebody that's criticizing Israel, and whether you're on a visa or not, whether you're a citizen or not, whether you're brown or not, Christian or Muslim, they're putting you in the Palantir database. They're putting you on the enemies list. If you don't see a problem with that...\"\n\n\"I'm beginning to think it started when DJT walked down that escalator, before 2016,\" wrote an X user with the moniker \"Redneck Common Sense.\"\n\nX user Jack Maxey wondered: \"Was MAGA a giant psyop?\"\n\nX user @D10Cat wrote: \"Is Trump the same man that he was in 2016? Or did I just not see it back then?\"\n\n\"The cope is unreal,\" wrote Ashton Nichols on X. \"I voted for Trump but this is just unacceptable.\"\n\nPalantir secured more than $113 million in federal contracts since Trump took office, including a recent $795 million agreement with the Department of Defense,according toThe New Republic. Its data analytics platform, Foundry, has already been deployed at theDepartment of Homeland Securityand Department of Health and Human Services, potentially enabling cross-agency information sharing.\n\n\"Shady, centralized dossiers on citizens are foundational for attacking civil rights and civil liberties—but paper files have long been replaced by a mishmash of electronic forms, biometrics, and data bought off data brokers,\" Cody Venzke, senior policy counsel at the American Civil Liberties Union (ACLU), toldNewsweekon Monday. \"AI platforms like those built by Palantir are the key to pulling together the many data points the government has on each of us—your political donations, governmental benefits, movements, and perhaps firearm records, could someday be a single click away for dozens of governmental agencies.\"\n\nOther critics, including activist Jason Bassler,compared the planto China's \"Social Credit System,\" warning of the dangers of centralized personal dossiers.\n\n\"No, this Palantir database isn't like the others,\" Bassler wrote on X on June 1. \"It will combine:\n\n-Tax filings-Student debt-Social Security-Bank accounts-Medical claims-Immigration status\n\n\"No previous database system has ever centralized this much personal info across various federal agencies.\"\n\nTaylor Rogers, White House spokesperson, said in a statement toNewsweekon Monday:\"President Trump signed an executive order to eliminate information silos and streamline data collection across all agencies to increase government efficiency and save hard-earned taxpayer dollars.\"\n\nFormer Republican Representative Justin Amash:\"The surveillance state...the police state...the deep state......are alive & well under Trump. He signed bills to extend & expand mass surveillance. Now he's building profiles' on millions of law-abiding Americans. It's an extraordinary threat to liberty.\"\n\nPaul Graham, computer scientist, said: \"Palantir is 'helping build the infrastructure of the police state.'\"\n\nUpdated 6/2/25, 4:07 p.m. ET: This story was updated with comment from Venzke.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nNick Mordowanec is a Newsweek investigative reporter based in Michigan. His focus includes U.S. and international politics and policies, immigration, crime and social issues. Other reporting has covered education, economics, and wars in Ukraine and Gaza. Nick joined Newsweek in 2021 from The Oakland Press, and his reporting has been featured in The Detroit News and other publications. His reporting on the opioid epidemic garnered a statewide Michigan Press Association award. The Michigan State University graduate can be reached atn.mordowanec@newsweek.com.\n\nNick Mordowanec is a Newsweek investigative reporter based in Michigan. His focus includes U.S. and international politics and policies, immigration, crime and social issues. Other reporting has covered education, economics, and wars in Ukraine and Gaza. Nick joined Newsweek in 2021 from The Oakland Press, and his reporting has been featured in The Detroit News and other publications. His reporting on the opioid epidemic garnered a statewide Michigan Press Association award. The Michigan State University graduate can be reached atn.mordowanec@newsweek.com.\n\nNick Mordowanec is a Newsweek investigative reporter based in Michigan. His focus includes U.S. and international politics and policies, immigration,                                    ...Read more",
        "source_3": "On Friday theNY Timespublished a report highlighting the Trump administration's increasing use of software from data analysis firm Palantir, which has been deployed across at least four federal agencies for the stated purpose of increasing operational efficiency through data modernization.\n\nFor now, each deployment of Palantir software is focused on department-specific services, but the fact that they're now embedded across multiple agencies - combined with Trump's Marchexecutive ordercalling for the federal government to share data across agencies -has raised concerns over whether the US government is laying the groundwork for what could become an interconnected and unified surveillance apparatuscreated by a company which has been in business with the governmentsince 2008.\n\nOn Wednesdaywe noted that Fannie Mae, the quasi-government financial firm overseen by the Federal Housing Finance Agency (FHFA),announced a partnership with Palantir to detect mortgage fraud using the firm's proprietary technology, which includes some elements of artificial intelligence.\n\nAccording to the report, since Donald Trump took office Palantir has received over $113 million in government spending - which doesn't include a$795 million contractfrom the Department of Defense (DoD) awarded last week. According to theTimesreport (citing six alleged government officials and Palantir employees), the company is also in discussions with the Social Security Administration and the Internal Revenue Service (the latter of which contracted with Palantir during the Biden administration).\n\nPalantir was founded in 2003 by Alex Karp and Trump ally Peter Thiel, and specializes in finding patterns in data and streamlining it into easily presentable formats. While Thiel is clearly a conservative, Karp - a self-described \"socialist\" who voted for Hillary Clinton, bragged about stopping the \"far right\" in Europe.\n\nCIA agent and head of Palantir Alex Karp says his company’s software “single-handedly” stopped the “far right” in Europe.Founded in 2003 with funding from the CIA’s In-Q-Tel program, Palantir’s only client before 2008 was the CIA.pic.twitter.com/Shq0uA5x16\n\nAnd soit's of little surprise that employees would flip out and leaveover Palantir's recent$30 million contractwith ICE to build a platform to track migrant movements in real time. (Palantir notably designed software for theIsrael Defense Forces(IDF) to identify and track Hamas targets).\n\nThis month, 13 former employeessigned a letterurging Palantir to stop its endeavors with Mr. Trump. Linda Xia, a signee who was a Palantir engineer until last year, said the problem was not with the company’s technologybut with how the Trump administration intended to use it.\n\n“Data that is collected for one reason should not be repurposed for other uses,” Ms. Xia said. “Combining all that data, even with the noblest of intentions, significantly increases the risk of misuse.”\n\nMs. Xia said Palantir employees were increasingly worried about reputational damage to the company because of its work with the Trump administration.There is growing debate within the company about its federal contracts, she said.\n\n“Current employees are discussing the implications of their work and raising questions internally,” she said, adding that some employees have left after disagreements over the company’s work with the Trump administration.\n\nLast week, a Palantir strategist, Brianna Katherine Martin,posted on LinkedInthat she was departing the company because of its expanded work with ICE. -NY Times\n\nAccording to Xia'sletter, \"We no longer believe Palantir’s executives are upholding these values. By supporting Trump’s administration,Elon Musk’s DOGE initiative, and dangerous expansions of executive power, they have abandoned their responsibility and are in violation of Palantir’s Code of Conduct.\"\n\n\"As Musk’s DOGE operation dismantles U.S. government institutions under the guise of exposing corruption, opposition remains silent. Companies are placating Trump’s administration,suppressing dissent, and aligning with his xenophobic, sexist, and oligarchic agenda.Government databasesare already erasing references to transgender people and gender-affirming care.These injustices could be facilitated by the very software infrastructure we help build.\"\n\nIn response to theTimes, Palantir pointed to ablog poston how the company handles data, which reads: \"We act as a data processor, not a data controller.\"\n\n\"Our software and services are used under direction from the organisations that license our products:these organisations define what can and cannot be done with their data; they control the Palantir accounts in which analysis is conducted.\""
    }
}