{
    "question": "In what ways could Ukraine’s “Spiderweb” drone operation against Russian airfields, including deep in Siberia, reshape escalation dynamics, Russia’s long-range strike capability, and the prospects for the Istanbul peace talks?",
    "content": {
        "source_1": "It wasa stunning, audacious attackwhose widespread effects are only just becoming clear.\n\nUkrainemanaged tosmuggle 117 aerial drones on the backs of trucksthat deposited them at the perimeter of four Russian air bases — one of them deep inside Siberia 2,500 miles from Ukraine's borders, according to Ukrainian officials.\n\nWhile there are differing accounts on the extent of the ensuing damage of Sunday’s “Spiderweb” operation, Ukrainian President Volodymyr Zelenskyy said 40 Russian aircraft — 34% ofRussia's strategic cruise missile carriers— were hit. Ukraine's security service, the SBU, put the estimated cost to the Kremlin at $7 billion.\n\nSome military commentators and pro-Russian bloggers have called it the country's \"Pearl Harbor\" — a reference to Japanese attack in 1941 that led the United States to enter World War II.\n\nIt came Sunday, a day before thelatest round of direct peace talks between Ukraine and Russiaon Monday.\n\nThere was little optimismfor diplomatic progresseven before the strike, with Ukraine sending its defense minister, Rustem Umerov, but Russia dispatching only the far more junior Putin aide Vladimir Medinsky to the Çırağan Palace in Istanbul.\n\nThose talks have concluded for the day, Zelenskyy said at a news conference in the Lithuanian capital, Vilnius, just after midday local time (9 a.m. ET). He said the two sides exchanged documents and were preparing a fresh round of prisoner exchanges, extending the only tangible outcome from the two sides' first meeting last month.\n\n“I am waiting to hear Minister Umerov’s full report,” Zelenskyy said.\n\nA far more likely outcome of Sunday's strike isRussia’s continuing to bomb Ukrainian civilians— this time under the pretext of retaliation, “even though in reality these strikes are planned long in advance,” said Keir Giles, a senior consulting fellow with the London-based think tank Chatham House's Russia and Eurasia program.\n\nLess hard to quantify will be the huge blow to Vladimir Putin's pride, with Western analysts in agreement that this was a humiliation for the Russian president.\n\n“At a time when Putin seems to think that he is winning on the battlefield, this demonstrates that his forces are in fact very vulnerable,” said Sven Biscop, a director at the Egmont Institute, a think tank in Brussels. “This may not change the course of the war, but it does mean that every gain Russia makes will be at high cost.”\n\nHe added it was “quite amazing” that “a significant part of their bomber force” could “be destroyed like that.”\n\nThe strike took a year and a half to plan, according to Zelenskyy, and played out on the eve of the latest round of peace talks between Ukraine and Russia in Istanbul.\n\nIt's still unclear what impact the surgical strike will have on Monday's negotiations, hopes for which were already dim thanks to the deep divisions between the positions of Kyiv and Moscow. Ukraine says it is ready to sign an unconditional 30-day ceasefire; Russia is essentially demanding Ukraine's surrender.\n\nBrokering the talks, President Donald Trump hasshifted from the unambiguously pro-Ukrainian stance of his predecessor, President Joe Biden, and offered concessions to the Kremlin that have outraged many in the West.\n\nAt the same time, he accused Putin last week of going “absolutely crazy” by continuing to launch regular attacks on Ukraine civilians. Ultimately, he has threatened to walk away from the peace talks if they do not yield the results he once promised he would achieve in just 24 hours.\n\nIndeed, overnight into Sunday, Russia launched 500 attack drones into Ukraine, Zelenskyy said. The night next came 84 more, with at least 10 people killed and dozens more injured across the country, Ukraine's air force said.\n\nOther pro-Russia observers are calling for even more drastic measures.\n\n“We hope that the response will be the same as the U.S. response to the attack on Pearl Harbor, or even tougher,” one Russian military blogger, Roman Alekhin, said on the messaging app Telegram.\n\nAnother pro-war Telegram channel, Dva Mayora, added that it was “a reason to launch nuclear strikes on Ukraine\" —a threat often made by Putinsince launching the invasion three years ago.\n\n“We can expect a great deal of sound and fury from Moscow,” Giles said. Russia “will be working hard on convincing the United States to attempt to rein Ukraine in, in order to prevent any further damage to Russia’s means of bombarding Ukrainian cities with long range missiles,” he added.\n\n“In a way, the more important question is how the United States reacts, and how eager it is to take Moscow’s side and constrain Ukraine,” he said.\n\nAlexander Smith reported from London and Daryna Mayer from Kyiv.\n\nAlexander Smith is a senior reporter for NBC News Digital based in London.",
        "source_2": "This is Radio Schuman, your new go-to podcast to spice up your weekday mornings with relevant news, insights, and behind-the-scenes from Brussels and beyond.\n\nFrom the economy to the climate and the EU's role in world affairs, this talk show sheds light on European affairs and the issues that impact on our daily lives as Europeans. Tune in to understand the ins and outs of European politics.\n\nNo agenda, no argument, no bias, No Comment. Get the story without commentary.\n\nDare to imagine the future with business and tech visionaries\n\nEuronews Tech Talks goes beyond discussions to explore the impact of new technologies on our lives. With explanations, engaging Q&As, and lively conversations, the podcast provides valuable insights into the intersection of technology and society.\n\nEurope's water is under increasing pressure. Pollution, droughts, floods are taking their toll on our drinking water, lakes, rivers and coastlines. Join us on a journey around Europe to see why protecting ecosystems matters, how our wastewater can be better managed, and to discover some of the best water solutions.   Video reports, an animated explainer series and live debate - find out why Water Matters, from Euronews.\n\nWe give you the latest climate facts from the world’s leading source, analyse the trends and explain how our planet is changing. We meet the experts on the front line of climate change who explore new strategies to mitigate and adapt.\n\nThis is Radio Schuman, your new go-to podcast to spice up your weekday mornings with relevant news, insights, and behind-the-scenes from Brussels and beyond.\n\nFrom the economy to the climate and the EU's role in world affairs, this talk show sheds light on European affairs and the issues that impact on our daily lives as Europeans. Tune in to understand the ins and outs of European politics.\n\nNo agenda, no argument, no bias, No Comment. Get the story without commentary.\n\nDare to imagine the future with business and tech visionaries\n\nEuronews Tech Talks goes beyond discussions to explore the impact of new technologies on our lives. With explanations, engaging Q&As, and lively conversations, the podcast provides valuable insights into the intersection of technology and society.\n\nEurope's water is under increasing pressure. Pollution, droughts, floods are taking their toll on our drinking water, lakes, rivers and coastlines. Join us on a journey around Europe to see why protecting ecosystems matters, how our wastewater can be better managed, and to discover some of the best water solutions.   Video reports, an animated explainer series and live debate - find out why Water Matters, from Euronews.\n\nWe give you the latest climate facts from the world’s leading source, analyse the trends and explain how our planet is changing. We meet the experts on the front line of climate change who explore new strategies to mitigate and adapt.\n\nAn operation by Ukraine's Security Service (SBU) on Sunday hit 41 miltary aircraft, among them various types of strategic bombers that were lined up at four airfields inside Russia.\n\n“Enemy strategic bombers are burning en masse in Russia,\" an official with the SBU said, adding that Ukraine was conducting “a large scale special operation aimed at destroying enemy bomber aircraft.”\n\nThe operation, dubbed Spiderweb (\"Pavutyna\"), targeted four airfields: Dyagilevo in Riazan region, Ivanovo in Ivanovo region, Belaya air base in Russia's Irkutsk region, which is located in south-eastern Siberia over 4,000km east of the frontline, and Olenya air base in Russia's Murmansk region, some 2,000km away from Ukraine’s border.\n\nIt included the clandestine smuggling of drones deep into Russian territory, hiding them and finally launching them remotely.\n\nRussia's Defence Ministry confirmed the attacks in a statement, as did the governors of Murmansk and Irkutsk. Murmansk Governor Andrei Chibis said \"security measures have been strengthened.\"\n\nIn March, Ukraine announced it had developed a new type of drone that can reach a range of up to 3,000 kilometres, but gave no details about its type or the size of its warhead.\n\nRecent satellite images show various Russian strategic bombers at the four bases that were allegedly hit during the operation, including Tu-95, Tu-22M3, Tu-160 and A-50.\n\nTu-95, Tu-22 and Tu-160 are Russian heavy bombers regularly used by Moscow to launch missiles at Ukraine.\n\nThe Tu-22M3 is capable of carrying Kh-22 and Kh-32 cruise missiles, travelling at a speed of 4,000 km/h, exceeding Mach 4.\n\nTu-95 — the oldest among them — is a Soviet-era plane, originally used to carry nuclear bombs but since modified to launch cruise missiles.\n\nA-50 is a radar detection aircraft, which can detect air defence systems, guided missiles, and coordinate targets for Russian fighter jets.\n\nUkrainian President Volodymyr Zelenskyy said on Sunday that he was meeting with the Ministries of Defence and Foreign Affairs, as well as the General Staff and the SBU.\n\n\"We are doing everything to protect our independence, our state and our people,\" Zelenskyy said.\n\nHe would be outlining \"tasks for the near term\" and will \"define our positions ahead of the meeting in Istanbul on Monday,\" Zelenskyy added.\n\nUkrainian and Russian officials are scheduled to meet in Istanbul on Monday for the second round of talks between the two sides.\n\nZelenskyy said Kyiv’s utmost priority is an unconditional ceasefire, followed by the release of prisoners and the return of Ukrainian children who Russia forcefully deported.",
        "source_3": "Military airfields in five Russian regions, including in Siberia and the Far East, have been targeted in coordinated drone attacks orchestrated by Kiev, the Russian Defense Ministry said on Sunday. Ukrainian media has called it a major operation targeting Russian strategic aviation. According to Moscow, most of the strikes were repelled, with some resulting in material damage but no casualties.\n\nThe airfields are located in Murmansk Region in the north, Ivanovo and Ryazan regions in central Russia, Irkutsk Region in Siberia, and Amur Region in the Far East, the Russian Defense Ministry stated.\n\nAccording to Ukrainian media, the airfields housed Russian Tu-95 and Tu-22M strategic bombers, as well as an A-50 early warning and control plane, among other aircraft. The Russian Defense Ministry has not confirmed this, and has not revealed the aircraft types stationed at the airfields.\n\nIt was the first time in over three years since the escalation of the Ukraine conflict that Kiev has targeted Russian facilities located in Siberia and the Far East.\n\nAll the attacks employed first-person view (PFV) kamikaze drones, the Russian Defense Ministry said, adding that at least some of them were launched from areas located in close proximity to the airfields. It also accused the“Kiev regime”of conducting“terrorist attacks.”\n\nAccording to Ukrainian and Russian media, the drones took off from trucks parked near the airfields and loaded with containers. Shot Telegram channel published a video purporting to show several unmanned aerial vehicles (UAVs) flying out of one of the containers in Irkutsk Region. Plumes of smoke are seen at a distance behind the truck in the video.\n\nGunfire is also heard in the video, with a witness claiming that police attempted to shoot down a drone.\n\nAnother video posted by Shot shows a crowd of people trying to hit the drones with stones. The video was also recorded in Irkutsk Region, according to the channel.\n\nThe strikes were part of a major Ukrainian operation targeting“strategic aviation”and codenamed Spiderweb, several Ukrainian media outlets, including Channel 24 and RBK Ukraine, reported, citing sources in the nation’s domestic security service (SBU).\n\nThe SBU confirmed that it was behind the operation as it published a photo of its head, Vasily Malyuk, looking at maps of what appear to be five Russian airfields. The security service also claimed that around a third of Russian cruise missile carriers were hit in the attacks.\n\nAccording to Ukrainian media, the nation’s security service prepared the operation for more than a year and a half as it gradually transported the drones and moveable containers to Russia. The operation was also said to have been personally overseen by Ukraine’s Vladimir Zelensky, who reportedly claimed that a total of 117 UAVs were used in the strikes, according to reports.\n\nIn Ivanovo, Ryazan, and Amur regions, the attacks were repelled and resulted in no damage or casualties, according to the Russian Defense Ministry. In Murmansk and Irkutsk regions, the strikes led to some aircraft catching fire, it added.\n\nThe fires were promptly extinguished, according to the Russian military. No casualties were reported in any of the incidents, and the Defense Ministry did not report the loss of any aircraft as a result of the attacks.\n\nUkrainian media claimed that around 40 aircraft were damaged in the operation, including several strategic bombers. The Russian authorities have not commented on the claims.\n\nSome suspects behind the attacks have been detained, the Russian Defense Ministry said, without revealing the number of those arrested or their identities.\n\nAccording to Shot, the Russian investigative authorities identified the trucks involved in the attacks and are now working with the drivers. Several Telegram channels, including Shot and Baza, also reported that Russian OSINT investigators traced the drones back to a warehouse located in Chelyabinsk Region, Russia in the southern Urals.\n\nRussian security service officers have reportedly raided the warehouse in question and are now investigating the owner. Some trucks involved in the attacks were also said to have been registered in Chelyabinsk Region, according to the Telegram channels.\n\nOne truck loaded with drones reportedly failed to reach its destination, the Russian Telegram channels reported. The vehicle caught fire while on the road in Amur Region and eventually exploded, the channels reported as they published a video purporting to show the moment of the explosion.\n\nThe incident took place a day before the attack, according to Baza. A container caught fire, triggering the explosion, the channel said. The driver of the truck died in the incident, Baza said. He stopped the vehicle when he realized it was on fire and went to check for the source, when it exploded, the channel reported, identifying him as Vasily P., 62.\n\nThe attacks came just a day before scheduled talks between Russian and Ukrainian delegations in Istanbul. The two nations were scheduled to hold the second round of the recently resumed direct negotiations, which were stalled for three years after Kiev unilaterally walked away from the talks in spring 2022.\n\nThe two sides agreed to hold a major prisoner swap involving 1,000 POWs from each side during the first round of talks last month. On Monday, they are expected to exchange peace proposals as part of an agreement reached in May.\n\nUkraine has significantly escalated drone strikes into Russia in recent weeks, despite ongoing diplomatic efforts to end the conflict. Russian Foreign Minister Sergey Lavrov earlier described the attacks as an attempt to derail the peace process.\n\nThe strikes occurred less than a day after two bridges in Russia were destroyed in what the authorities described as sabotage. In Bryansk Region, an overpass fell onto a rail line, killing seven and injuring at least 69, according to the governor. Hours later, on Sunday, a railway bridge in Kursk Region gave way under a moving freight train, injuring the driver and two assistants.\n\nThe Russian Investigative Committee said both bridges were blown up, but did not name any suspects behind the attacks. Russian Senator Andrey Klishas blamed Kiev for both incidents.\n\n© Autonomous Nonprofit Organization “TV-Novosti”, 2005–2025. All rights reserved.\n\nThis website uses cookies. Read RTPrivacy policyto find out more."
    }
}