{
    "question": "What are the implications for humanitarian aid delivery and public trust when reports of dozens killed near a Gaza aid site are disputed by Israeli officials and the organization running the distribution?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nIsraeli artillery shells struck tents sheltering displaced people in Khan Younis on Sunday, killing three and wounding at least 30, according to Nasser Hospital. People fled the strike site in panic as a plume of smoke rose above scattered rubble near the blast. (AP Video by Mohammad Jahjouh and production by Wafaa Shurafa)\n\nAt least 31 people were killed and scores were wounded on Sunday as they were on their way to receive food in the Gaza Strip, according to health officials and multiple witnesses. (AP Production by Wafaa Shurafa)\n\nSurgeons at the Nasser Medical Hospital in Khan Younis spent Sunday operating around the clock on people injured when shooting erupted near an aid distribution hub in the Gaza Strip earlier in the day. At least 31 people were killed and over 170 were wounded Sunday as large crowds were on their way to receive food in the Gaza Strip, health officials and witnesses said. Witnesses said Israeli forces fired toward the crowds just before dawn around a kilometer (about 1,100 yards) from an aid site run by an Israeli-backed foundation. Israel’s military denied its forces fired at civilians near or within the site in the southern city of Rafah. (AP video by Mohammad Jahjouj/Produced by Wafaa Shurafa)\n\nThe Israeli military on Sunday accused Hamas of spreading ‘rumors, fake news’ and trying to “bluntly and violently” stop Palestinians in Gaza from reaching aid distribution sites. IDF Spokesperson Effie Defrin’s message was released the same day that witnesses say at least 31 people were killed and over 170 wounded while on their way to receive food. Meanwhile, The Gaza Humanitarian Foundation (GHF), which is backed by Israel and the U.S., said its distribution of aid in the Gaza Strip passed “without incident” on Sunday.\n\nResidents of the Gaza Strip are facing severe shortages of food in the besieged coastal region that has been in the middle of a grinding war for more than 600 days.\n\nPalestinians run following an Israeli strike in Gaza City, Sunday, June 1, 2025. (AP Photo/Jehad Alshrafi)\n\nThick smoke and flames erupt from an Israeli airstrike in Gaza City, Sunday, June 1, 2025. (AP Photo/Jehad Alshrafi)\n\nPalestinians pray during the funeral of a person who was killed while heading to a Gaza aid hub, along with three others who were killed during an Israeli strike, as they gather at the Nasser Hospital in Khan Younis, southern Gaza Strip, Sunday, June 1, 2025. (AP Photo/Abdel Kareem Hana)\n\nIsraeli army vehicle pass by a new sign pointing towards Gaza reading “To release Omri Miron go straight” near Kibbutz Nahal Oz in southern Israel, where Miron was kidnapped from on Oct. 7, on Sunday, June 1, 2025. (AP Photo/Ohad Zwigenberg)\n\nPalestinians carry bags containing food and humanitarian aid packages delivered by the Gaza Humanitarian Foundation, a U.S.-backed organization approved by Israel in Khan Younis, southern Gaza Strip, Sunday, June 1, 2025. (AP Photo/Abdel Kareem Hana)\n\nRAFAH, Gaza Strip (AP) — At least 31 people were killed and over 170 were wounded Sunday as large crowds were on their way to receive food in theGaza Strip, health officials and witnesses said. Witnesses said Israeli forces fired toward the crowds just before dawn around a kilometer (about 1,100 yards) from an aid site run by an Israeli-backed foundation.\n\nIsrael’s military denied its forces fired at civilians near or within the site in the southern city of Rafah. An Israeli military official, speaking on condition of anonymity in line with procedure, said troops fired warning shots at several suspects advancing toward them overnight.\n\nThe military also released drone footage it said was shot Sunday, apparently in daylight, in the southern city of Khan Younis, showing what it said were armed, masked men firing at civilians trying to collect aid. The Associated Press could not independently verify the video, and it was not clear who was being targeted. “Hamas is doing everything in its power to prevent the successful distribution of food in Gaza,” the statement said.\n\nThe Gaza Humanitarian Foundation — promoted by Israel and the United States — said in a statement it delivered aid “without incident,” and released a separate video it said was shot Sunday at the site that appeared to show people collecting aid. The AP was not able to verify the video. The foundation has denied previous accounts of chaos and gunfire around its sites, which are in Israeli military zones where independent media has no access.\n\nIt was the deadliest incident yet around thenew aid distribution system, which has operated for less than a week.\n\nThe International Committee of the Red Cross said in a statement its field hospital in Rafah received 179 casualties including women and children, 21 of them declared dead upon arrival, the majority with gunshot or shrapnel wounds. It was unclear if any of the dead were militants.\n\n“All patients said they had been trying to reach an aid distribution site,” the ICRC said, calling it the highest number of “weapon-wounded” people in a single incident since the hospital was set up over a year ago.\n\nThe head of the World Food Program, Cindy McCain, told ABC News that staffers on the ground were reporting people killed and called it a “tragedy.”\n\n“Aid distribution has become a death trap,” the head of the United Nationsagency for Palestinian refugees, Philippe Lazzarini, said in a statement.\n\nIn a separate statement, Israeli military chief of staff Lt. Gen. Eyal Zamir ordered that more aid sites be established — and that troops’ ground operation be expanded in unspecified parts of northern and southern Gaza.\n\nMultiple witnesses have said Israeli troops firedon crowds near the foundation’s sites. Before Sunday, 17 people were killed while trying to reach them, according to Zaher al-Waheidi, head of the Gaza Health Ministry’s records department.\n\nThe foundation says private security contractors guarding its sites have not fired on crowds. Israel’s military has acknowledged firing warning shots on previous occasions.\n\nThe foundation said in a statement it distributed 16 truckloads of aid early Sunday “without incident,” and dismissed what it described as “false reporting about deaths, mass injuries and chaos.”\n\nU.N. agencies and major aid groups have refused to work with the new system, saying it violates humanitarian principles.\n\nThousands of people headed toward the distribution site hours before dawn. As they approached, Israeli forces ordered them to disperse and come back later, witnesses said. When the crowds reached the Flag Roundabout, around 1 kilometer away, at around 3 a.m., Israeli forces opened fire, the witnesses said.\n\n“There was fire from all directions, from naval warships, from tanks and drones,” said Amr Abu Teiba, who was in the crowd.\n\nHe said he saw at least 10 bodies with gunshot wounds and several other wounded people, including women. People used carts to ferry the dead and wounded. “The scene was horrible,” he said.\n\nMost people were shot “in the upper part of their bodies, including the head, neck and chest,” said Dr. Marwan al-Hams, a Health Ministry official at Nasser Hospital, where many were transferred from the Red Cross field hospital. A colleague, surgeon Khaled al-Ser, said 150 wounded people had arrived, along with 28 bodies.\n\nThe hospital corridors were filled with patients, “but unlike what I have witnessed before, where most of the patients were women and children, today it was mainly men,” a spokesperson with medical charity MSF, Nour Alsaqa, said in a statement.\n\nIbrahim Abu Saoud, another witness, said the military fired from about 300 meters (yards) away. He said he saw many people with gunshot wounds, including a young man who died at the scene. “We weren’t able to help him,” he said.\n\nMohammed Abu Teaima, 33, said he saw Israeli forces open fire and kill his cousin and a woman as they headed toward the distribution site. He said his cousin was shot in his chest, and his brother-in-law was among the wounded.\n\n“They opened heavy fire directly toward us,” he said.\n\nAn AP reporter arrived at the field hospital at around 6 a.m. and saw dozens of wounded, including women and children. The reporter also saw crowds of people returning from the distribution point. Some carried boxes of aid but most appeared to be empty-handed.\n\nGaza’s Health Ministry said least 31 people were killed and over 170 were wounded.\n\n“This is sinful, enough with the humiliation. They humiliated us for the sake of food,” said Ilham Jarghon as fellow Palestinians wept and prayed for the dead.\n\nLater Sunday, Israeli artillery shells struck tents sheltering displaced people in Khan Younis, killing three and wounding at least 30, according to Nasser Hospital. Israel’s military said it was looking into it.\n\nIsrael and the U.S. say the new system is aimed at preventing Hamas from siphoning off assistance. Israel has not provided evidence of systematic diversion, and the U.N. denies it has occurred.\n\nU.N. agencies and major aid groups say the new system allows Israel to control who receives aid and forces people to relocate to distribution sites, risking yet more mass displacement in the coastal territory.\n\n“It’s essentially engineered scarcity,” Jonathan Whittall, interim head in Gaza of the U.N. humanitarian office, said last week.\n\nThe U.N. systemhas struggled to bring in aidafter Israel slightly eased its nearly three-month blockade of the territory last month. The groups say Israeli restrictions, the breakdown of law and order and widespread looting make it extremely difficult to deliver aid to Gaza’s roughly 2 million Palestinians.\n\nExperts have warned that the territoryis at risk of famineif more aid is not brought in.\n\nThe war began when Hamas-led militants stormed into southern Israel on Oct. 7, 2023, killing some 1,200 people, mostly civilians, and abducting 251. They are still holding 58 hostages, around a third believed to be alive, after most of the rest were released in ceasefire agreements or other deals.\n\nIsrael’s military campaign has killed over 54,000 people in Hamas-run Gaza, mostly women and children, according to Gaza’s Health Ministry, which does not say how many of the dead were civilians or combatants. The offensive has destroyed vast areas, displaced around 90% of the population and left people almost completely reliant on international aid.\n\nThelatest efforts at ceasefire talksappeared to stumble Saturday when Hamas said it had sought amendments to a U.S. ceasefire proposal that Israel had approved, and the U.S. envoy called that “unacceptable.”\n\nMediators Qatar and Egypt in a joint statement Sunday said they continued “intensive efforts to bridge the gaps in viewpoints” and hoped for “a swift agreement for a temporary ceasefire lasting 60 days, leading to a permanent ceasefire in the Gaza Strip.”\n\nMagdy reported from Cairo. Associated Press writer Tia Goldenberg in Tel Aviv, Israel, contributed to this report.\n\nFollow AP’s war coverage athttps://apnews.com/hub/israel-hamas-war\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "At least 31 Palestinians were killed and dozens were wounded early Sunday by Israeli fire as they were on their way to a humanitarian aid distribution site in the southern Gaza Strip, multiple witnesses and Hamas authorities said. The Israel Defense Forces late Sunday said it didn’t shoot Gazans at or near the distribution site, and denounced what it called false allegations.\n\nThe IDF initially issued a vague statement, saying that “at this time, we are unaware of injuries caused by IDF troops’ fire within the [humanitarian aid] distribution site” in Rafah, adding that “the matter is still under review.”\n\nWhen asked for clarification, the IDF did not explicitly deny that there had been gunfire, but said it was unaware of any injuries “within” the aid site. Witnesses said Israeli forces fired on crowds around a kilometer away from the aid site hours before the distribution took place.\n\nHours later, the military denied opening fire on Palestinians at or near the aid distribution site, slamming the “false reports… including serious allegations against the IDF.”\n\nAn Israeli military official acknowledged that troops did fire warning shots overnight around a kilometer away from the aid site, hours before the facility opened to distribute aid to Palestinians.\n\n“IDF troops worked to prevent a number of suspects from approaching the forces,” the official said. “During the activity, warning shots were fired at a number of suspects who approached the forces.”\n\n“There is no connection between the incident in question and the false allegations against the IDF,” added the official.\n\nמצלמות האבטחה של החברה שאחראית על חלוקה המזון בעזה תיעדו את הרגעים בהם נטען לכאורה שבוצע ירי לעבר פלסטינים במתחם הסיוע. לפי התיעוד, לא נראה שבוצע ירי@ItayBlumentalpic.twitter.com/HGLLrVRY4o\n\nThe Gaza Humanitarian Foundation, the US- and Israel-backed body in charge of the aid distribution, insisted that the “aid was again distributed today without incident.”\n\nGHF published videos ostensibly showing that no Palestinian civilians were shot at the site. “Reports of injuries and fatalities are completely false and fabricated,” the organization said, attaching around 15 minutes of footage from the distribution site after dawn.\n\nThe Hamas-run health ministry in Gaza, whose tolls cannot be verified, said 31 people were killed and 170 others were wounded by Israeli fire in the incident in Rafah on Sunday. Another person was killed and over a dozen were injured at an aid distribution site in the Netzarim corridor area, Palestinian media reported.\n\nThe Associated Press cited eyewitnesses as saying that the incident in Rafah occurred before dawn, as thousands marched toward the aid site. Israeli troops had ordered them to disperse and come back later, and as the crowds arrived at a roundabout around a kilometer away at 3 a.m., the IDF opened fire, the witnesses said.\n\nAn AP reporter arrived at a field hospital at around 6 a.m. and saw dozens of wounded, including women and children. The reporter also saw crowds of people returning from the distribution point. Some were carrying boxes of aid, but most appeared to be coming back empty-handed.\n\nAfter carrying out a preliminary investigation, the military said that it determined that troops “did not fire at civilians while they were near or within the humanitarian aid distribution site and that reports to this effect are false.”\n\n“The IDF is enabling the American civil organization (GHF) and international aid organizations to distribute aid to the residents of Gaza and not to Hamas,” the military said.\n\n“Hamas does everything in its power to undermine food distribution efforts in the Gaza Strip. Hamas is a brutal terrorist organization that starves and endangers the population to preserve its control over the Gaza Strip. As part of its brutal behavior and its attempts to disrupt humanitarian aid, Hamas directly harms the residents of Gaza,” the statement continued.\n\nThe military also “calls on the media to be cautious with information published by the Hamas terror organization, as proven in several previous incidents.”\n\nSeparately, the IDF published a drone video it said showed Palestinian gunmen and other masked Palestinians opening fire and throwing stones at Gazans heading to collect humanitarian aid that had been looted in southern Khan Younis earlier Sunday. The video was unrelated to the deadly incident in Rafah.\n\nThe IDF did not explicitly say that the armed men were Hamas members, but added that “Hamas does everything it can to prevent the success of the food distribution in Gaza.”\n\n“Hamas is a murderous and brutal terror organization that starves the residents of Gaza,” the military said.\n\nתיעוד רחפן חושף: חמושים בעזה יורים לעבר אזרחים עזתים בדרכם לאסוף סיוע הומניטרי\n\nתיעוד מרחפן של צה״ל שצולם מוקדם יותר היום (א׳), חושף חמושים ורעולי פנים, משליכים אבנים ויורים לעבר עזתים שמנסים לאסוף סיוע הומניטרי שנבזז בדרום חאן יונס.\n\nחמאס הוא ארגון טרור רצחני ואכזרי שמרעיב את…pic.twitter.com/q95TUoS0DK\n\nFor its part, Medical charity Doctors Without Borders said Sunday that people it treated at a Gaza aid site run by a new US-backed organization reported being “shot from all sides” by Israeli forces.\n\nThe NGO, known by its French name MSF, blamed the GHF system for chaos at the scene in the southern Gaza town of Rafah.\n\n“Patients told MSF they were shot from all sides by drones, helicopters, boats, tanks and Israeli soldiers on the ground,” MSF said in a statement.\n\nMSF emergency coordinator Claire Manera in the statement called the GHF’s system of aid delivery “dehumanizing, dangerous and severely ineffective.”\n\n“It has resulted in deaths and injuries of civilians that could have been prevented. Humanitarian aid must be provided only by humanitarian organizations who have the competence and determination to do it safely and effectively.”\n\nMSF communications officer Nour Alsaqa in the statement reported hospital corridors filled with patients, mostly men, with “visible gunshot wounds in their limbs.”\n\nMSF quoted one injured man, Mansour Sami Abdi, as describing people fighting over just five pallets of aid.\n\n“They told us to take food — then they fired from every direction,” he said. “This isn’t aid. It’s a lie.”\n\nMeanwhile, former prime minister Naftali Bennett slammed the government for the fact that it did not provide any information on what happened in Rafah, aside from the military’s earlier vague statement, amid coverage in international media of the incident.\n\nHe said international media were reporting a “huge lie.”\n\n“Israel has no public diplomacy. The matter is not being managed,” Bennett said.\n\nThis is the SPECIFIC food distribution site, at the PRECISE time that Israeli tanks supposedly shot them.\n\nThis is simply unbelievable.When it’s about Israel, all…pic.twitter.com/70m5BW09yQ\n\n— Naftali Bennett נפתלי בנט (@naftalibennett)June 1, 2025\n\nGHF has denied previous accounts of chaos and gunfire around its sites, which are in Israeli military zones. The IDF has acknowledged firing warning shots on previous occasions.\n\nGHF said Sunday that it had distributed 4.7 million meals at three distribution sites in southern and central Gaza over the past six days. But its classification of meals is based on boxes of dry food products that still require cooking equipment or community kitchens, which are very limited throughout the Strip after nearly 20 months of devastating conflict.\n\nUnder pressure from allies, Israel last month began allowing some humanitarian aid into Gaza after blocking all food, medicine, fuel and other goods from entering since March 2, a move Jerusalem said was aimed at pressuring Hamas into releasing hostages.\n\nThe UN and other aid groups have refused to participate in the GHF system, saying it violates humanitarian principles. They say it puts aid under Israel’s control, to use to carry out its announced plans to move Gaza’s entire population to the south. They also say it cannot meet the massive needs of the population and endangers those seeking food.\n\nIsrael demanded the new system, saying it is needed to prevent Hamas from siphoning off supplies, as it accuses the terror group of regularly doing. UN agencies say their mechanisms already prevent significant diversion. Still, there is footage of aid being stolen by gunmen in Gaza, and one former hostage has testified that Hamas would eat from the stolen aid.\n\nEvery day, even during war, our journalists keep you abreast of the most important developments that merit your attention. Millions of people rely on ToI for fast, fair and free coverage of Israel and the Jewish world.\n\nWe care about Israel - and we know you do too.So today, we have an ask: show your appreciation for our work byjoining The Times of Israel Community, an exclusive group for readers like you who appreciate and financially support our work.\n\nWe’re really pleased that you’ve readXTimes of Israel articlesin the past month.\n\nYou clearly find our careful reporting valuable, in a time when facts are often distorted and news coverage often lacks context.\n\nYour support is essential to continue our work.We want to continue delivering the professional journalism you value, even as the demands on our newsroom have grown dramatically since October 7.\n\nSo today, please consider joining our reader support group,The Times of Israel Community. For as little as $6 a month you'll become our partners while enjoying The Times of IsraelAD-FREE, as well as accessing exclusive content available only to Times of Israel Community members.\n\nThank you,David Horovitz, Founding Editor of The Times of Israel",
        "source_3": "Officials with the Hamas-run Health Ministry in the Gaza Strip said that 31 Palestinians were shot dead Sunday on their way to get food from an aid distribution site. But the U.S.-backed charity helping to deliver that aid vehemently denied those claims.\n\nThe conflicting accounts about what actually took place in the city of Rafah underscore the difficulty in getting accurate information out of the Gaza Strip, which has been the site of an intense Israeli military operation since the Oct. 7, 2023, Hamas attack on the Jewish state. Hamas has been the governing body of Gaza since 2007.\n\nMedia reports emerged early Sunday citing eyewitnesses on the ground and officials with the Hamas-run Health Ministry in Gaza saying that 31 Palestinians were killed and more than 150 wounded by gunfire in and around the aid distribution site in Rafah.\n\nWitnesses told The Associated Press that Israeli troops fired on the crowds about 1,000 yards from the location, which is operated by the Gaza Humanitarian Foundation, a body backed by Israel and the U.S. The organization began operations last month. Supporters say the group is needed to consolidate aid delivery in the devastated Gaza Strip and to stop Hamas terrorists from intercepting food and other aid meant for Palestinian civilians.\n\n“Our aid was again distributed today without incident,” the GHF said in a statement. The statement also blasted “coordinated efforts every day that instigate false narratives and distort media coverage around the operations of our distribution sites.”\n\nIn a statement to the AP, the Israel Defense Forces said they were “currently unaware of injuries caused by [Israeli military] fire within the humanitarian aid distribution site. The matter is still under review.”\n\nThere are private security contractors on the ground at the aid delivery sites. The GHF has previously said those contractors have not fired on crowds. Israeli troops have acknowledged firing warning shots on previous occasions, the AP reported.\n\nThe GHF said it distributed 16 truckloads of food Sunday, totaling 15,360 boxes providing about 887,040 meals.\n\nFormer Israeli Prime Minister Naftali Bennett shared video footage on X that he said was shot at the precise time forces were allegedly firing on Palestinian crowds.\n\n“Nothing. No shooting. Everything going well,” Mr. Bennett posted.\n\n“100% fake. The headline is simply a LIE,” he said about claims of violence at the site.\n\nBut other videos being circulated on social media, and claiming to be at the aid delivery sites, appear to show crowds scattering and the sounds of apparent gunfire in the background.\n\nIt’s difficult to know exactly when and where such videos were taken, or the exact circumstances around the scenes they claim to show.\n\nOne eyewitness described a scene that sounded like a coordinated military assault.\n\n“There was fire from all directions, from naval warships, from tanks and drones,” the AP quoted a purported witness, Amr Abu Teiba, as saying.\n\nHe said that he saw at least 10 bodies with gunshot wounds and several other wounded people, including women. People used carts to ferry the dead and wounded to a field hospital.\n\n• Ben Wolfgang can be reached atbwolfgang@washingtontimes.com.\n\nCopyright © 2025 The Washington Times, LLC.Click\n                            here for reprint permission.\n\nPope Leo should tell Catholics: Marry young, have many children\n\nTrump’s TikTok delays undermine his China hawks while Intel controversy grows"
    }
}