{
    "question": "How might Gabrielle Cuccia’s reported firing after her public criticism of Defense Secretary Pete Hegseth’s press access limits shape perceptions of Pentagon transparency and the independence of reporters covering it?",
    "content": {
        "source_1": "Gabrielle Cuccia criticized Defense Secretary Pete Hegseth’s crackdown on press access at the Pentagon. And then, she said, she was fired.\n\nCuccia was briefly the chief Pentagon correspondent for the small and staunchly pro-Trump TV channelOne America News, OAN for short.\n\nA self-proclaimed “MAGA girl,” Cuccia positioned herself as a proudly conservative voice among the normally nonpartisan Pentagon press corps. But she grew perturbed by Hegseth’s actions against the press.\n\nIn a post onher personal Substack accounton Tuesday, she wrote that the Defense Department’s recent move to make vast parts of the Pentagon off-limits to journalists was a “troubling shift.” She heaped doubt on the Defense Department’s rationale for the restrictions. And she questioned why Hegseth hasn’t held any formal press briefings since being sworn in.\n\n“This article isn’t to serve as a tearing down” of Hegseth, she wrote. “This is me wanting to keep MAGA alive.”\n\nEvidently, someone disagreed. On Thursday, “I was asked to turn in my Pentagon badge to my bureau chief,” Cuccia said in response to CNN’s inquiry about her status there. On Friday, she said, she was fired.\n\nCuccia declined to answer followup questions. OAN president Charles Herring did not respond to CNN’s request for comment, including about whether any Pentagon officials complained to OAN about Cuccia’s Substack post.\n\nCuccia served in the Trump White House in 2017 and 2018 and later reported from the White House for OAN, then spent several years as a contractor, according to her LinkedIn page. One of her right-wing TV appearanceswent viral last yearwhen she repeated Trump’s claims of 2020 election fraud on Newsmax. The anchor cut her off,  most likely due to allegations being made during the segment.\n\nWhether through fiery TV segments or Instagram posts posing with firearms, Cuccia was public about her MAGA bonafides. So she was a natural fit to return to OAN earlier this year.\n\nIn February, the Defense Department took away NBC’s longtime workspace at the Pentagon and gave the office to OAN — part of a broader push by the Pentagon to seek out pro-Trump coverage and sideline traditional news outlets.\n\nOAN suddenly needed to staff the Pentagon, so Cuccia was brought aboard as chief Pentagon correspondent. She personally renovated the office space into what she called a “Liberty Lounge” and chronicled the process on social media.\n\nAccording to her Substack post, she soon grew skeptical of the Defense Department’s dealings with the press corps.\n\nEchoing the concerns of the Pentagon Press Association — which Cuccia said she is not officially a part of, since “again hello I am MAGA” — she pointed out that the Pentagon’s top spokesman has only held one briefing since January.\n\n“This Administration, to my surprise, also locked the doors to the Pentagon Briefing room, a protocol that was never in place in prior Administrations, and a door that is never locked for press at the White House,” she wrote.\n\n“The Commander-in-Chief welcomes the hard questions… and yes, even the dumb ones. Why won’t the Secretary of Defense do the same?”\n\nHer nuanced assessment of the Pentagon’s press crackdown totaled 3,000 words. It aligned with the slogan that she printed on tank tops and sold on Etsy last year: “Love your country, not your government.”\n\nRelated articlePentagon Press Association calls Defense Secretary Hegseth’s access restrictions ‘a direct attack’\n\nThe primary trigger for her post seemed to bethe Defense Department’s May 23 memorestricting journalists from key parts of the Pentagon without an official escort.\n\n“For decades — across both Republican and Democratic administrations — reporters have operated in these spaces responsibly, including in the wake of 9/11, without raising red flags from leadership over operational security,” she wrote.\n\nThe memo indicated that further restrictions are likely in the coming weeks, including a pledge to protect military secrets and tougher scrutiny of press credentialing.\n\n“Without press, we by default have to assume that our government relaying information to us, is true,” Cuccia wrote, calling that attitude “the antithesis of what we believe in.”\n\nOn Friday she changedher X bioto “former chief Pentagon correspondent.”",
        "source_2": "Gabrielle Cuccia, a former Trump White House staffer, wrote that the Defense Secretary’s rules are the “antithesis” of MAGA values\n\nOAN chief Pentagon correspondent and former Trump White House staffer Gabrielle Cuccia, who describes herself as a “MAGA girl,” says she was fired from the unabashedly conservative cable news network for criticizing Defense Secretary Pete Hegseth’s restrictions on the press.\n\nCuccia was hired by OAN after the network took over NBC’s former Pentagon workspace and soon raised concerns about the Defense Department’s increasing limitations on journalists, including locked briefing room doors and a lack of formal press briefings.\n\n“If you want the best case study for the death of the MAGA movement — look no further than the Department of Defense,” Cuccia wrote on herSubstack. “If there’s any place where we should be asking questions, demanding transparency and applying pressure — it’s here.”\n\nNot long after, she was seen clearing out her workspace and later confirmed her termination, which was first reported by CNN’sReliable Sources. Cuccia called the current restrictions the “antithesis” of MAGA values, which she describes as questioning government authority first and foremost.\n\n“This Administration, to my surprise, also locked the doors to the Pentagon Briefing room, a protocol that was never in place in prior Administrations, and a door that is never locked for press at the White House,” Cuccia wrote. Trump “welcomes the hard questions … and yes, even the dumb ones. Why won’t the Secretary of Defense do the same?”\n\nCuccia says among other things, the new policies mean it’s no longer possible to approach defense officials for off-the-record conversations, as media “escorts” are the only way to freely move about areas of the Pentagon that have traditionally been open to journalists. She also said the DOD requested her questions for Hegseth – in his only press briefing so far – in advance.\n\n“At first I thought nothing of it and figured they wanted to be prepared for their very first briefing and be able to answer questions with as much info in response as possible,” she wrote. “Unfortunately that was not the case and they responded by telling me to field my question about CECOT/Gitmo to the Department of State suggesting it wasn’t within the DoD’s purview — just days later, the SecDef did a trip to Gitmo.”\n\nCuccia said she’s still a “MAGA girl” and has nothing against Hegseth, per se – but apparently that wasn’t enough for OAN to keep her onboard.\n\n“This article isn’t to serve as a tearing down of the SecDef,” she concluded. “This is me wanting to keep MAGA alive. Ask questions, debate and stay vigilant – even when it is someone on the right side of the aisle.”",
        "source_3": "Published:05:26, 1 June 2025|Updated:13:05, 1 June 2025\n\nA pro-MAGA reporter who criticizedDefense Secretary Pete Hegseth'streatment of the press at thePentagonlost her job after speaking out.\n\nGabrielle Cuccia is a proud 'MAGA girl' who has long been outspoken about her adoration of President Trump.\n\nBut while working as the chief Pentagon correspondent at pro-Trump television channel One America News, Cuccia published a tell-all article to her personal Substack channel about the pitfalls of Hegseth's leadership.\n\n'If you want the best case study for the death of the MAGA movement — look no further than the Department of Defense,' she wrote.\n\n'People sleep on the Pentagon. They don’t realize what’s been simmering at the bottom for weeks, months, sometimes even years.'\n\nCuccia had expressed concerns Hegseth wasblocking mediaaccess in the wake ofhis Signal scandal, in which a journalist was unintentionally added to a group chat with Hegseth where he openly shared sensitive details about an impending strike on Houthi targets in Yemen.\n\nFrom that moment onwards, Cuccia said Hegsethshut down crucial communicationpoints between the press and his staff in an effort to 'reduce the opportunity for in-person inadvertent or unauthorized disclosures.'\n\n'Think of every time you hear a journalist reference a source as “Defense Official” or something abstract… a lot of times, it’s coming from these guys,' she revealed about the Pentagon press office.\n\n'And they are always there to provide additional context, field questions, and relay the reality of ops in an unclassified manner.'\n\nGabrielle Cuccia is a proud 'MAGA girl' who has long been outspoken about her adoration of President Trump\n\nBut while working as the chief Pentagon correspondent at pro-Trump television channel One America News, Cuccia published a tell-all article to her personal Substack channel about the pitfalls of Pete Hegseth's (pictured with his wife) leadership\n\nHer article was published on Monday. By Thursday, her boss had asked her to hand in her Pentagon access badge, and on Friday she was fired, she toldCNN.\n\nCuccia criticized Hegseth for his lack of transparency, noting he had failed to deliver press conferences and alleged his team would deliberately hide details of his schedule until it was too late for media representatives to attend.\n\n'Over at the White House, the Administration understands the freedom of the press, and keeps the door open anyway,' she said. 'They would certainly not field questions *before* said press briefing.'\n\nCuccia alleged that during one press briefing, staff for Hegseth reached out to her to find out what question she would ask if she were called upon at a conference.\n\nShe told them, thinking they simply 'wanted to be prepared for their very first press briefing to answer questions with as much info in response as possible. Unfortunately that was not the case.'\n\n'This article isn’t to serve as a tearing down of the SecDef,' she wrote. 'This is me wanting to keep MAGA alive.\n\n'Despite my loyalty to this movement, we are killing ourselves.'\n\nCuccia said the power of the MAGA movement was sparked in 2015, when 'America came alive' on the back of a 'shared realization we weren't going to blindly accept our government as Bible anymore.'\n\nCuccia alleged that during one press briefing, staff for Hegseth reached out to her to find out what question she would ask if she were called upon at a conference\n\nCuccia said the power of the MAGA movement came back in 2015, when 'America came alive' on the back of a 'shared realization we weren't going to blindly accept our government as Bible anymore'\n\nCuccia had expressed concerns Hegseth was blocking the media from reasonable access in the wake of his Signal scandal, in which a journalist was unintentionally added to a group chat where Hegseth openly shared sensitive details about an impending strike on Houthi targets in Yemen\n\nSince then, she said there has been a pointed shift away from the core values of the movement.\n\n'Somewhere along the way, we as a collective decided — if anyone ever questioned a policy or person within the MAGA movement — that they weren’t MAGA enough.\n\n'I will always be MAGA, but consider this a love letter to what we have lost, what we must regain, and my final plea to Love Your Country, Not Your Government.'\n\nCuccia broke her public silence over her axing on Saturday, writing on Instagram: 'I was once told that a former peer feared I was too MAGA for the job.\n\nDailyMail.com has contacted both Cuccia and her former employer for comment.\n\nPrior to joining OAN, Cuccia served in the White House under Trump from 2017 to 2018.\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nBy posting your comment you agree to ourhouse rules.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with ourPrivacy Policy."
    }
}