{
    "question": "How might the discovery and correction of erroneous citations in HHS’s MAHA report, alongside speculation about AI involvement, influence public trust and expectations for transparency in federal public health reporting?",
    "content": {
        "source_1": "The Trump administration on Thursday corrected several citations in its “Make America Healthy Again” report, adding to scrutiny of its scientific rigor. The report, led by Health and Human Services Secretary Robert F. Kennedy Jr., paints a dire picture of children’s health in the United States.\n\nThe corrections came after the nonprofit news outlet NOTUSidentified several citationsreferencing papers that did not exist. NBC News verified that four such papers were nonexistent. One citation listed in the report as a December 2022 study published in the journal JAMA Pediatrics on changes in mental health and substance use among adolescents during the pandemic does not appear in that journal issue.\n\nKatherine Keyes, an epidemiologist at Columbia University listed as the study’s first author, said the research was not hers.\n\n“I can confirm that I, and my co-authors, did not write that paper,” Keyes told NBC News via email. “I was surprised to see what seems to be an error in the citation of my work in the report, and it does make me concerned given that citation practices are an important part of conducting and reporting rigorous science.”\n\nThe citation was replaced Thursday with a reference toa report on mental health and substance use in adolescentsfrom KFF, a health policy research organization. The text of the report was also edited slightly. Whereas the original version said that 20%-25% of adolescents reported anxiety symptoms and 15%-20% reported depressive symptoms, the updated version changed those percentages to 20% and more than 15%.\n\nThe citation errors add to the strange nature of the MAHA report,released last week by the White House, which has no public authors and echoes many of the passion projects of its chair, Kennedy. The commission in charge of the report consists of high-ranking officials across various federal agencies, only two of whom are medical doctors.\n\nThe report, which stretches more than 70 pages, claims to identify four main causes of chronic diseases in children: ultraprocessed food, environmental toxins, the overprescribing of medications and sedentary, technology-driven lifestyles. It does not mentionthe leading cause of children’s deaths in the country: guns.\n\nThe original version contained 522 citations, seven of which mentioned papers that could not be found online or in scientific journals, according to NOTUS.\n\nThe false citations sparked some speculation that generative AI may have been used in the creation of the report. The Washington Post reported that the website URLs of some references included “oaicite,” which OpenAI’s systems areknown to add to citations.\n\nWhite House press secretary Karoline Leavitt on Thursday attributed the false citations toformatting issues.\n\nAndrew Nixon, communications director for the Department of Health and Human Services, said in a statement: “Minor citation and formatting errors have been corrected, but the substance of the MAHA report remains the same — a historic and transformative assessment by the federal government to understand the chronic disease epidemic afflicting our nation’s children.”\n\n“Under President Trump and Secretary Kennedy, our federal government is no longer ignoring this crisis, and it’s time for the media to also focus on what matters,” he added.\n\nTwo other citations in the MAHA report, referencing studies on advertising and medication use in children, did not appear in either of the scientific journals cited. The report listed the lead author of one of those papers as psychiatric researcher Robert Findling, but a spokesperson at Virginia Commonwealth University said Findling was not behind the research.\n\nBoth citations were edited out of the MAHA report Thursday. The citation that referenced Findling now directs toa 2006 paperon trends in the use of psychotropic medications. The other citation links to a2013 New York Times article.\n\nA fourth citation that references the overprescribing of corticosteroids for children with asthma also does not correspond to any published work. It was replaced Thursday witha reference to a studyfrom the same researcher, pediatric pulmonologist Harold Farber. Language stating that “an estimated 25-40% of mild cases are overprescribed” was removed from the report and replaced with the line: “There is evidence of overprescription of oral corticosteroids for mild cases of asthma.”\n\nNixon declined to answer questions about who at HHS had authored the report or what tools may have been used in its creation. Metadata embedded in the PDF of the report lists its author as Heidi Overton, a medical doctor and deputy director in the White House Domestic Policy Council. Overton formerly served as chief policy officer at America First Policy Institute’s Center for a Healthy America, a right-wing think tank. She did not respond to requests for comment.\n\nMany public health experts have noted that the MAHA report addresses real issues like thelink between ultraprocessed foods and obesity or cancer. But some researchers have said it overstates conclusions and offers little in the way of solutions.\n\nIna blog postWednesday, researchers at the Cato Institute, a libertarian think tank, criticized the report’s lack of input from medical or scientific professionals. According to the researchers, “the data in the report bears little relationship to its conclusions.” They highlighted several instances where they said the report lacked context or misrepresented data. For instance, the report refers to childhood obesity as a “worsening health crisis,” but also features a graph showing that the rate of childhood obesity in the U.S. remained relatively stable over the last 20 years.\n\nThe MAHA report also warns that childhood cancer rates are rising, but does not mention that cancer deaths among that population are declining.\n\nNOTUS similarlyreported Wednesdaythat there were “serious issues with how the report interpreted some of the existing studies it cites.” The outlet pointed toa 2011 studycited as evidence that evening screen time from electronic devices disrupted sleep onset in children. The study’s author, Mariana Figueiro, told NBC News that it was inaccurate to link that particular paper with that conclusion.\n\n“The conclusions in the MAHA report are incorrect and misrepresented our findings,” Figueiro, a professor at the Icahn School of Medicine at Mount Sinai, said via email. “We looked at melatonin suppression, not sleep onset. We also used college students, not children as subjects. Finally, the journal name was incorrect.”\n\nThe citation was replaced Thursday witha 2021 review, which found that electronic media use was associated with less sleep in children in Western countries.\n\nAria Bendix is the breaking health reporter for NBC News Digital.\n\nBrandy Zadrozny is a senior enterprise reporter for MSNBC. She covers misinformation, extremism and the internet.",
        "source_2": "Reporting by Renee Hickman; Editing by Michele Gershberg, Cynthia Osterman and Aurora Ellis\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nAir India said on Monday it would stop services between the capital cities of India and the U.S. from September 1, citing aircraft shortage due to the planned upgrades to its ageing Boeing planes and the closure of Pakistan's airspace.\n\nReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.\n\nAccess unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.\n\nBrowse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.\n\nScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.\n\nAll quotes delayed a minimum of 15 minutes.See here for a complete list of exchanges and delays.",
        "source_3": "The White House moved to correct errors in thehighly anticipated MAHA reportThursday after inconsistencies and inaccuracies were found in the citations.\n\nThe errors in the MAHA report werefirst reportedby NOTUS on Thursday. They included broken links and studies that apparently did not exist. The White House later uploaded the corrected version of the report, and the administration maintained that the errors do not refute the substance of the report.\n\n\"I understand there were some formatting issues with the MAHA report that are being addressed, and the report will be updated,\" press secretary Karoline LeavittsaidThursday. \"But it does not negate the substance of the report, which, as you know, is one of the most transformative health reports that has ever been released by the federal government.\"\n\n'It’s time for the media to also focus on what matters.'\n\nThe Department of Health and Human Services similarly stated that they were simply formatting errors and that they don't change the historic findings in the report.\n\n\"Minor citation and formatting errors have been corrected, but the substance of the MAHA report remains the same — a historic and transformative assessment by the federal government to understand the chronic disease epidemic afflicting our nation’s children,\" an HHS spokespersonsaid. \"Under President Trump and Secretary Kennedy, our federal government is no longer ignoring this crisis, and it’s time for the media to also focus on what matters.\"\n\nHowever, these errors seem to go beyond formatting as the administration is suggesting. The citations included broken links and even pointed to numerous studies that reportedly do not appear in the issues of the journals cited and may not even exist at all.\n\n\"The paper cited is not a real paper that I or my colleagues were involved with,\" Katherine Keyes, an epidemiologist listed as an author,toldNOTUS. \"We’ve certainly done research on this topic, but did not publish a paper in JAMA Pediatrics on this topic with that co-author group, or with that title.\"\n\nRELATED:Elon Musk formally departs from DOGE following a tumultuous tenure\n\nThe report itself, which was spearheaded by HHS Secretary Robert F. Kennedy Jr., focused on identifying root causes for various health epidemics affecting American children, including chronic diseases,obesity, autoimmune conditions, and behavioral disorders. Some of these root causes include ultra-processed foods, pesticides, and exposure to chemicals, as well as \"overmedicalization.\"\n\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox.Sign up here!"
    }
}