{
    "question": "How might SFUSD’s decision to withdraw the “grading for equity” proposal after backlash affect stakeholder trust and the district’s future efforts to balance equity with academic rigor in grading?",
    "content": {
        "source_1": "Updated on:  May 28, 2025 / 4:04 PM PDT/ CBS San Francisco\n\nOfficials with the San Francisco Unified School District said they have backed down on a proposal to alter grading procedures in the city's high schools, following widespread backlash.\n\nOn Tuesday,the city's Board of Education heard a proposalthat included a \"grading for equity\" approach.\n\nAccording to theSan Francisco Chronicle, 70 teachers in 14 of the city's high schools were expected to participate in a voluntary program to align grades more closely to student learning rather than attendance, participation or other factors. The grading plan also proposed multiple chances to retake tests or essays and reconfiguring the 100-point grading scale.\n\nA report on the proposal by the publicationThe Voice of San Franciscothat said the plan was going into effect and that the plan would award a C grade to scores as low as 41 out of 100, led to a firestorm of criticism from parents and local officials.\n\n\"We owe our young people an education that prepares them to succeed. The proposed changes to grading at SFUSD would not accomplish that,\"Mayor Daniel Lurie said on X (formerly Twitter).\n\nWe owe our young people an education that prepares them to succeed. The proposed changes to grading at SFUSD would not accomplish that.I have conveyed our view to SFUSD. We are optimistic that there is a better path forward for our kids and their future.\n\n\"I have conveyed our view to SFUSD. We are optimistic that there is a better path forward for our kids and their future,\" the mayor added.\n\nRep. Ro Khanna, whose district covers much of Silicon Valley,said on social media, \"My immigrant dad asked me where the missing 10% went when I scored a 90. He came to America for the chance to work hard & pursue excellence. Giving A's for 80% & no homework is not equity-it betrays the American Dream and every parent who wants more for their kids.\"\n\nMy immigrant dad asked me where the missing 10% went when I scored a 90. He came to America for the chance to work hard & pursue excellence. Giving A’s for 80% & no homework is not equity—it betrays the American Dream and every parent who wants more for their kids.https://t.co/aFcF8SurV9\n\nIn a statement Wednesday, superintendent Maria Su said no changes to grading practices were adopted and that the plan is on hold.\n\nA statement from#SFUSDSuperintendent Dr. Maria Su.pic.twitter.com/M7dEm0Bftl\n\n\"It's clear there are a lot of questions, concerns and misinformation with this proposal. We want to make sure any changes benefit our students. I have decided not to pursue this strategy for next year to ensure we have time to meaningfully engage the community,\" Su said in a statement. \"Right now we need to continue to focus on balancing our budget, stabilizing the district, and rebuilding trust.\"\n\nTim Fang is a digital producer at CBS Bay Area. A Bay Area native, Tim has been a part of the CBS Bay Area newsroom for more than two decades and joined the digital staff in 2006.",
        "source_2": "Jesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current affairs and trending news. He has covered current affairs, healthcare, pop culture, and sports. Jesus joined Newsweek's U.S. bureau in 2024, and has previously worked for The Financial Times and served as an international reporter and newsletter editor for El Espectador in Colombia. He graduated with an M.A. in Journalism and Digital Innovation from New York University. Languages: English, Spanish. You can get in touch with Jesus by emailingj.mosquera@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nEd. Note: After significant backlash, San Francisco's public school system announced it was cancelling the \"Grading for Equity\" initiative.More from Newsweek's Jesus Mesa here.\n\nSan Francisco's public high schools will implement a sweeping change to their grading system this fall, replacing traditional methods with a policy that allows students to pass with scores as low as 41 percent.\n\nThe initiative, part of a broader \"Grading for Equity\" push, is stirring concern among educators, students and parents over academic standards and college readiness.\n\nSimilar policies across other Bay Area districts—such as Dublin, Oakland and Pleasanton—have seen mixed results and strong community reactions. Dublin Unified attempted a pilot of equity grading in 2023, which included removing zeros for missed assignments and awarding a minimum of 50 percent for any \"reasonably attempted\" work.\n\nThat pilot, however, was met with outrage and resistance. Parents created petitions, formed WhatsApp groups and filled school board meetings to protest what they saw as a lowering of standards for their children. The Dublin school board eventually suspended the initiative, though individual teachers were still allowed to use the methods at their discretion.\n\nThe experiment in San Francisco comes amid — or despite — a broader rethinking of DEI initiatives after the election ofDonald Trump, who ran on a platform of excising what he and many others said were \"unfair\" equity practices in the government and private sectors.\n\nSuperintendent Maria Su's plan inSan Franciscowas not subject to a public vote by the Board of Education, drawing criticism for lack of transparency. The new policy, set to affect more than 10,000 students across 14 high schools, significantly changes how academic performance is measured.\n\nHomework and classroom participation will no longer influence a student's final grade. Students will be assessed primarily on a final exam, which they can retake multiple times. Attendance and punctuality will not affect academic standing.\n\nThe plan was first revealed in the fine print of a 25-page agenda and reported byThe Voice of San Francisco, a local nonprofit. The outlet reported that the district is hiring Joe Feldman, an educational consultant known for his bookGrading for Equity,to train teachers this summer.\n\n\"If our grading practices don't change, the achievement and opportunity gaps will remain for our most vulnerable students. If we are truly dedicated to equity, we have to stop avoiding the sensitive issue of grading and embrace it,\" Feldman said in a 2019 blog post for the School Superintendents Association (AASA).\n\nFeldman's book outlines how traditional grading can reinforce socioeconomic disparities and proposes alternative strategies for more equitable assessment. According to The Voice of San Francisco, the new system will be modeled in part on the San Leandro Unified School District, where students can earn an A with a score as low as 80 percent and pass with a D at just 21 percent. Under the forthcoming San Francisco policy, a score of 41 percent will qualify as a C.\n\nEducators who support equity-based grading caution against interpreting these percentages through a traditional 100-point lens. In many systems influenced by Joe Feldman's Grading for Equity, schools use a four-point rubric rather than percentage scores.\n\nFor example, a \"2\" on a four-point scale—indicating developing proficiency—may be numerically 50 percent, but it equates to a C in that framework. Critics of the new policy argue it lowers expectations, while supporters say it more accurately reflects student mastery without penalizing behaviors unrelated to learning.\n\nSupporters of the policy say it better reflects real student learning by de-emphasizing behavior-based penalties like late work or missed assignments. However, critics warn the policy could harm students who are already on track for college placement.\n\n\"Nowhere in college do you get 50 percent for doing nothing,\" said Laurie Sargent, an eighth-grade English teacher in the Dublin Unified School District, in a 2024Mercury Newsreport. \"Nowhere in the working world do you get 50 percent for doing nothing. If I don't show up to work, they don't pay me 50 percent of my salary—even if I made a reasonable attempt to get there.\"\n\nThe change comes amid ongoing financial strain and declining enrollment across the district. While intended to address achievement gaps, critics argue the policy may only obscure the underlying academic challenges rather than solve them.\n\nSuch a drastic and dramatic change in the high school grading system merits greater attention and scrutiny than the school district has given it so far,\" wrote John Trasviña, former dean of the University of San Francisco School of Law, in an op-ed for The Voice of San Francisco.\n\nParents in San Francisco also have expressed frustration over being left out of the decision-making process. The school district's Office of Equity has not updated its public materials in nearly three years, and no broad outreach appears to have been conducted ahead of the rollout.\n\nKatherine Hermens, a biology teacher at Dublin High School, told EdSurge in 2023:\"It is time to emphasize learning over effort. Prioritizing learning is exactly what equitable grading does. It recognizes the individual journey of every student and acknowledges that we all learn differently—at our own pace and in various ways.\"\n\nJohn Trasviña, former dean of the University of San Francisco School of Law, wrote in an op-ed:\"Grading for Equity de-emphasizes the importance of timely performance, assignment completion, and consistent attendance.\"\n\nSchool board members in San Francisco were reportedly not given a formal vote on this policy, triggering internal governance disputes. If there is enough public pressure, the Board of Education may seek to review or override the superintendent's decision, though there is no suggestion as of yet that such a move is imminent.\n\nUpdate 5/29/25 1:00 p.m. ET: This article was updated to reflect that the plan was cancelled after backlash.\n\nUpdate 5/29/25, 10:40 a.m. ET: This article was updated with additional information.\n\nJesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current affairs and trending news. He has covered current affairs, healthcare, pop culture, and sports. Jesus joined Newsweek's U.S. bureau in 2024, and has previously worked for The Financial Times and served as an international reporter and newsletter editor for El Espectador in Colombia. He graduated with an M.A. in Journalism and Digital Innovation from New York University. Languages: English, Spanish. You can get in touch with Jesus by emailingj.mosquera@newsweek.com\n\nJesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current affairs and trending news. He has covered current affairs, healthcare, pop culture, and sports. Jesus joined Newsweek's U.S. bureau in 2024, and has previously worked for The Financial Times and served as an international reporter and newsletter editor for El Espectador in Colombia. He graduated with an M.A. in Journalism and Digital Innovation from New York University. Languages: English, Spanish. You can get in touch with Jesus by emailingj.mosquera@newsweek.com\n\nJesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current                                    ...Read more",
        "source_3": "The San Francisco Unified School District will not be moving forward with a controversial equity grading strategy that was proposed this week after significant backlash.\n\nTheSan Francisco Unified School Districtwill not be moving forward with a controversial equity grading strategy that was proposed this week after significant backlash.\n\nThe strategy, known as \"Grading for Equity,\" was presented during a SFUSD Board of Education meeting on Tuesday, according to Superintendent Maria Su, with the goal of offering \"professional development opportunity in standards-based grading.\"\n\nUnder the proposed standards, how a student scores on the final exam, which could be taken multiple times, would be what counts toward their grade for the semester, according to theVoice of San Francisco.\n\nHomework and weekly tests would not impact the grade, and neither would late assignments, tardiness to class or absence from school.\n\nCOLLEGE DROPOUTS CELEBRATE AT UNCONVENTIONAL 'GRADUATION' CEREMONY IN SAN FRANCISCO\n\nThe Superintendent of the San Francisco Unified School District said the system is putting a pause on pursuing a proposed \"Grading for Equity\" strategy after it received major backlash from community members and politicians.(AP Photo/Jeff Chiu)\n\nThe letter-grade system would also be significantly altered, allowing students who score an 80 to receive an A and students who score as low as a 21 to pass with a D, which models the \"Grading for Equity\" system in the San Leandro Unified School District, Voice of San Francisco reported.\n\nThe new system was supposed to be tested by 70teachers in 14 SFUSD schoolsuntil the community, including the mayor and lawmakers, spoke out against the proposal.\n\nSan Francisco Mayor Daniel Lurie wrote on X that the younger generation is owed \"an education that prepares them to succeed\" and the \"changes to grading at SFUSF would not accomplish that.\"\n\n\"I have conveyed our view to SFUSD. We are optimistic that there is a better path forward for our kids and their future,\" he wrote, in part.\n\nThe SFUSD's now-shuttered grading proposal would allow students to receive an A for a score of 80 and a D for a score as low as 21.(iStock)\n\nTENSIONS FLARE AT SCHOOL BOARD MEETING AFTER TRANS ATHLETE WINS MULTIPLE TRACK EVENTS\n\nU.S. Rep. Kevin Kiley, R-Calif., called out the proposal, sarcastically describing it as a \"brilliant solution.\"\n\n\"San Francisco has come up with a brilliant solution for its failing schools. Students simply won't be failed,\" Kiley wrote on X. \"Under the new ‘Grading for Equity’ plan, Fs are now Cs; Bs are now As; homework and tests are ungraded; truancy is unpunished; and finals can be re-taken again and again.\"\n\nU.S. Rep. Ro Khanna, D-Calif.,also shared his opinion on the proposed grading system on his personal X account.\n\n\"My immigrant dad asked me where the missing 10% went when I scored a 90. He came to America for the chance to work hard & pursue excellence. Giving A’s for 80% & no homework is not equity—it betrays the American Dream and every parent who wants more for their kids,\" he wrote.\n\nU.S. Rep. Ro Khanna, D-Calif., criticized the \"Grading for Equity\" proposal, saying it goes against everything his immigrant father taught him about the American Dream.(Anna Moneymaker/Getty Images)\n\nA statement from Su on SFUSD's X account on Wednesday said that there have been no changes to grading practices within the school district and no action was taken at the meeting.\n\nShe said each student within the school district is held to a high standard and SFUSD's goal is to \"support student success by prioritizing learning and mastery.\"\n\n\"It's clear that there are a lot of questions, concerns and misinformation with this proposal. We want to make sure any changes benefit our students,\" Su wrote, in part.\n\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}