{
    "question": "How might this wave of pardons and commutations—including for political allies, reality TV figures, and the commutation of Gangster Disciples co-founder Larry Hoover—shape public perceptions of the purpose and limits of presidential clemency?",
    "content": {
        "source_1": "WASHINGTON — The government's evidence against Scott Jenkins was compelling, including undercover video and other corroboration showing Jenkins, then the sheriff of Culpeper County, Virginia, acceptingover $75,000in exchange for giving law enforcement authority to local businessmen, as well as two undercover FBI special agents.\n\nJenkins’ co-defendants all pleaded guilty, and jurors didn't take long to convict Jenkins last year, deliberating for around two hours before they found him guilty on all counts. When Jenkins was sentenced to 10 years in prison in March, the acting U.S. attorney for the Western District of Virginia said he \"violated his oath of office and the faith the citizens of Culpeper County placed in him when he engaged in a cash-for-badges scheme.\"\n\nBut on Monday, President Donald Trump announced he was pardoning Jenkins, calling him \"a victim of an overzealous Biden Department of Justice\" who \"doesn’t deserve to spend a single day in jail.\" It's part of a broader pattern for Trump, who in the first few months of his second term has pardoned at least four supportive former public officials who were convicted of financial improprieties.\n\nTrump, who faced two separate federal criminal cases that were dropped after he was re-elected in November, has long argued that he was a victim of the weaponization of the Justice Department and the FBI, and he has been sympathetic to those who make similar claims, particularly those who are politically aligned with him.\n\nIn February, Trump pardoned Rod Blagojevich, the Democratic former governor of Illinois,whose sentence he had commuted in 2020, after he was convicted on corruption charges related to bribery. (Blagojevich attended the 2024 Republican convention in support of Trump.) Trumppardoned Republicanformer Tennessee state Sen. Brian Kelseyin March, just over two weeks into a 21-month sentence over a campaign finance-related fraud conviction. (Fellow Tennessee Republicans implored Trump to pardon Kelsey, who thanked him upon his release from prison and said that “God used Donald Trump to save me.”) Last month, Trumppardoned Republican former Las Vegas City Council member Michele Fiore, who had been set to be sentenced this month after she was convicted on conspiracy and wire fraud charges related to misused fundraising. (Fiore had hitched her political career to Trump and benefited from his endorsement while she backed his false statements about voter fraud in the 2020 election.)\n\nThose four figures and their pardons aren't the only evidence of a Justice Department de-emphasizing public corruption cases. In the early days of the administration, the Justice Department alsodropped a campaign finance caseagainst Republican former Rep. Jeff Fortenberry of Nebraska, who had been set to go on trial next month.\n\nThe Trump administration also moved todrop the corruption case against New York Mayor Eric Adams, which ledseveral Justice Department officials to resign in protest.\n\nThe Adams and Jenkins cases, among others, are linked by the Justice Department's Public Integrity Section. The division, which focuses on bringing cases against public officials accused of breaking the law,has shrunk in both size and influenceduring the Trump administration. The FBI's Washington Field Office isshutting down a public corruption squadthat was focused on federal corruption.\n\n“It’s clear that this administration doesn’t believe that tamping down on public corruption is a priority,” said Stacey Young, a former Justice Department official who founded Justice Connection, a network of Justice Department alumni formed in response to the Trump administration's overhaul of the Justice Department. “Pardoning a sheriff who took cash for deputy badges is just the latest in a string of actions this president has taken to undermine any effort to hold officials accountable to the public they are sworn to serve.”\n\nThe White House didn’t respond to a request for comment.\n\nIt's not clear how the Jenkins case first made its way on the White House's radar, but it found a backer in Ed Martin, the conservative activist whom Trump initially put in charge of the U.S. attorney's office in Washington before he recently named him the U.S. pardon attorney. Martinwrote on Xthat he was “thrilled” the Jenkins’ was the first pardon since he took the position: “Congratulations, Sheriff Jenkins: Do great things and make us proud.”\n\nIn a thread in which he thanked Trump for pardoning Jenkins, Martin — who is alsodirector of the Justice Department’s Weaponization Working Group—wrote, “No MAGA left behind.”\n\nLast week, Martin met with White House “pardon czar” Alice Marie Johnson, whose life sentence for a drug convictionTrump commuted during his first term. Trump latergave Johnson a full pardon.\n\nIn an interview with Trump's daughter-in-law Lara Trump that aired on Fox News this month,Johnson saidshe would review the cases of people who spent too much time behind bars, as well as “the victims of lawfare, the same way our president was.”\n\nA Justice Department official said that Martin was eager to get involved in the Jenkins case after meetings with the White House and that he concurred with and supported Trump's decision to issue a pardon.\n\nJenkins had argued that he was targeted because of his conservative politics, including his positions on immigration, guns and Covid lockdowns. In hisown sentencing memo, Jenkins’ lawyers said he \"adamantly maintains his innocence.\"\n\nWhen Jenkins was under investigation, he and other sheriffs discussed the possibility of \"flying to a secret location to view the Hunter Biden laptop, and then bringing charges against Hunter Biden based on any crimes depicted on it,\" his lawyerswrote in the sentencing memo.\n\nThe government said Jenkins perjured himself at trial, falsely testifying that co-defendant Rick Rahim had given him a \"business investment\" because Jenkins had copyrighted the logo \"Make Virginia Great Again\" and that they were investing in red shirts and hats. Discussions about \"Make America Great Again\" shirts didn't happen until after Rahim had made payments to Jenkins, which were intended to help him get his firearms rights restored, prosecutors argued.\n\nLast week,prosecutors asked a judgeto sentence Rahim, who pleaded guilty, to 27 months in prison, saying Jenkins made Rahim a \"Helicopter Pilot\" in exchange for bribes and pushed his petition for restoration of gun rights even though Rahim didn't live in the county.\n\nProsecutors said recordings captured Jenkins laying out the scheme in clear terms after he became frustrated that Rahim was pushing for more favors.\n\n“I appreciate what support you give me, but you didn’t do it for nothin’. You got a felony record, a clean slate to carry — not only carry a gun,” Jenkins said in a recorded conversation in 2022,according to a court filing. “We followed it up with swearing you in. Name another sheriff in the whole State of Virginia that would do that.”\n\nAn attorney for Jenkins didn’t respond to a request for comment, and a message left at a phone number registered to Jenkins got no response.\n\nMeanwhile, more pardons for Trump supporters may be in the pipeline.\n\nOn Tuesday,Trump called two of the children of reality television couple Todd and Julie Chrisleyand told them their parents would receive pardons for bank fraud, tax evasion and conspiracy charges. One of their daughters, reality star Savannah Chrisley, spoke on their behalf at the Republican National Convention last year and more recently appeared on aFox News segmentwith Trump's daughter-in-law Lara Trump.\n\n\"When I saw, obviously, what the president was going through, what I was going through, it was eerily similar,\" Savannah Chrisley said in the interview.\n\nMartin recently met with attorney Peter Ticktin, who presented pardon applications for members of the Proud Boys and the Oath Keepers, asfirst reported by Politico. While most Jan. 6 defendants got full pardons, Trump initially commuted the sentences of some of the members of the two far-right groups, ending their prison sentences but maintaining the convictions and the collateral consequences — like deprivation of certain rights — that go along with them.\n\n“There’s a good deal of reason to be hopeful,” Ticktin, who went to the New York Military Academy with Trump, told NBC News. “No promises were made as to what would be done; that’s not the way it works. We present it and then we hope for the best.\"",
        "source_2": "As part of a spree of more than two dozen clemency actions this week, US President Donald Trump on Wednesday commuted the federal prison sentence of Larry Hoover, the founder of a notorious Chicago street gang.\n\nHoover was the leader of the Gangster Disciples and in the 1990s was given six life sentences on conspiracy, extortion, drug and other criminal charges.\n\nIn addition to his federal sentence, Hoover still faces a 200-year jail term in the state of Illinois for murder, and is unlikely to be released soon. A president is unable to commute state-level sentences.\n\nOn Wednesday the president also granted a pardon to other convicts including Michael Grimm, a former New York City congressman.\n\nHe served seven months in prison after pleading guilty to felony tax fraud.\n\nAs well as Hoover and Grimm, at least eight others have been pardoned by the president in recent days; the New York Times reported that Trump issued a total of 25 pardons or commutations of prison sentences on Wednesday.\n\nDepartment of Justice (DoJ) records indicate that during his second term Trumphas pardoned more than 40 people, in addition to almost 1,600 pardons doled out to people charged or convicted in connection with the 6 January 2021 US Capitol riot.\n\nDuring his first presidential term, Trump granted a total of 237 pardons and commutations, according to the Pew Research Center. Most of those occurred in the final month of his term.\n\nHoover, 74, built the Gangster Disciples into a nationwide street gang from its origins on Chicago's South Side in the 1970s.\n\nIn 1973 he was convicted of ordering the execution of a rival drug dealer. Authorities allege that he continued to lead his gang from prison.\n\nIn the 1990s he formed a political organisation and claimed that he had transformed the Gangster Disciples into a community-service organisation called Growth and Development.\n\nHowever, he was found guilty of a long list of federal charges in 1997.\n\nIn recent years he has advocated for criminal justice reform including the First Step Act, which Trump signed into law in 2018. Among other things, the law allows for reduced sentences for inmates who participate in programmes aimed at reducing reoffending.\n\nHoover has continued to publicly disavow gang life.\n\n\"I am no longer a member, leader, or even an elder statesman of the Gangster Disciples,\" Hoover wrote in a letter to a court in 2022. \"I want nothing to do with it now and forever.\"\n\nHowever, authorities have taken a different view, and prosecutors alleged in 2021 that he was still involved in promoting Gangster Disciples members while locked up in prison. They have argued that he is still effectively the leader of the group.\n\nOn Thursday the top FBI official in Chicago indicated that Hoover will not be released from jail any time soon.\n\n\"The President of the United States has the authority to pardon whoever he wishes,\" FBI Special Agent in Charge Douglas DePodesta told the Chicago Tribune. \"I think Larry Hoover caused a lot of damage in this city and he deserves to be in prison and he will continue to be imprisoned in the state system.\"\n\nIn a statement, Hoover's lawyers called upon Illinois Governor JB Pritzker to issue a commutation of his state-level sentence, arguing that \"there is no purpose in returning a 74-year-old man in failing health to prison after 52 years of incarceration.\n\n\"Mr Hoover has now received a full and complete commutation for his federal drug convictions. The Governor of Illinois must follow suit,\" said attorneys Joshua Dubin and Justin Moore.\n\nGrimm, the former congressman, pleaded guilty to underreporting income from a restaurant that he owned.\n\nIn addition, Trump issued pardons on Wednesday for:\n\nOn Tuesday, Trump also pardoned Todd and Julie Chrisley, two reality TV stars who were convicted of tax evasion and defrauding banks.\n\nAlso on Wednesday, Trump said he would \"take a look at\" pardoning a group of men charged with planning to kidnap Michigan Governor Gretchen Whitmer in 2020.\n\n\"I did watch the trial,\" he said. \"It looked to me like somewhat of a railroad job… It looked to me like some people said some stupid things.\"\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nThe nightclub was in Guayas, one of four Ecuadorian provinces currently in a state of emergency.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.",
        "source_3": "Audio versions are only available to subscribers of The Dispatch.Join Today! to listen to this post.\n\nThe Trump administration likes to justify illiberal policies with liberal arguments. It does this, I assume, because it’s easier to build public support for an un-American program if it’s presented as a vindication of traditional American values. But part of me wonders if it simply tickles the president and his lackeys to use the enemy’s language when attacking the enemy’s system.\n\nOne example is the culture war being waged by the White House in the name of fighting antisemitism. Donald Trump and his circleare quite tolerant of people with hostility towards Jews, but pretending that they aren’t gives them ausefulpretextto rationalize defunding left-wing universities like Harvard and deporting left-aligned foreign students who’ve criticized Israel. The government isn’t discriminating against the right’s cultural enemies on the basis of viewpoint, you see, it’s protecting Jews. Who could be against that?\n\nAnother example dropped on Tuesday at theState Department’s new Substack. Read it and you’ll find florid rhetoric celebrating the “rich Western tradition of natural law, virtue ethics, and national sovereignty” that the United States and Europe share—all in service of demanding that European governments lift the legal liabilities they’ve imposed on illiberal nationalist parties in the Trumpist mold.\n\nThat would be a fair argument coming from an administration that doesn’t disdain Western values like pluralism, free trade, limits on executive power, and procedural rules designed to prevent government abuses. (And which hadn’t, as of very recently,sworn off lecturing other nations on “how to live.”) As it is, it’s just another disingenuous liberal cudgel wielded in defense of an international authoritarian movement that despises liberalism.\n\nTo gauge how disingenuous, I offer youthe most dystopian thingI’ve read about the state of the federal government this year—so far:\n\nAmid rising tensions between the Trump administration and the judiciary, some federal judges are beginning to discuss the idea of managing their own armed security force.\n\nThe Supreme Court has its own dedicated police force, but other federal judges are protected by the U.S. Marshals Service, which reports to Attorney General Pam Bondi. Security committee members worried that Trump could order the marshals to stand down in retaliation for a decision that didn’t go his way.\n\nA country where judges need their own bodyguards because they no longer trust the president to guarantee their safety if they rule against him (and understandably so) is a country waaaaay too far down the slope of banana republicanism to chastise anyone else about failing to live up to Western “virtue ethics.”\n\nToday, we’re going to consider another liberal practice that’s been diverted to illiberal ends, showing mercy to prisoners through acts of executive clemency. What’s interesting about Trump’s abuse of the pardon power is that, increasingly, it’snotbeing justified with disingenuous liberal defenses. It is what it is, right out in the open.\n\nIf it seems like grotesquely corrupt pardons are flowing more freely lately, there’s a reason. Eagle Ed is on the job.\n\n“Eagle Ed” is Ed Martin, whom Trump namedacting U.S. attorney in Washingtonearlier this year despite the fact that he hadn’t worked a day in his life as a prosecutor. The president later nominated him to fill the position permanently, but that required Senate confirmation. And although Senate Republicans have set the bar for confirming Trump cronieson the floor, somehow Martin still failed to clear it. You need to beawfullysketchy—like, Matt Gaetz levels of sketchy—for John Thune’s conferenceto bork you. Congratulations to Eagle Ed on that achievement.\n\nAny other administration would have thanked him for his service after a vote of no confidence by Republican senators and shown him the exit. But to Trump, failing a test of accountability like Senate confirmation isn’t a reason to deprive someone of public power. It’s a reason to shift them into a position where there is no accountability. At least, not to anyone except him.\n\nSo that’s what the president did. After the White House pulled Martin’s nomination for the U.S. attorney job, Trump turned around and named him totwo positions in the Justice Departmentthat don’t require Senate approval, designating him the agency’s pardon attorney and the director of its task force on the weaponization of federal law enforcement. Both jobs logically call for someone with exemplary ethical standards; instead, a man who somehow couldn’t pass Sen. Thom Tillis’ test for fitness for office is now America’s chief legal officer in charge of clemency recommendations and “retribution” against those who served in the Biden administration.\n\nJust like the Founders, heroes of our rich Western tradition, would have wanted.\n\nIt’s important to note here why the office of pardon attorney was vacant when Martin took over. Elizabeth Oyer, the person who last held the position, was fired in March. She claims that the White House insisted that actor Mel Gibson be added to a list of convicted criminals who, in the DOJ’s eyes, should have their legal rights to purchase a gun restored.According to Oyer, a higher-up in the agency gave her a warning: “He then essentially explained to me that Mel Gibson has a personal relationship with President Trump and that should be sufficient basis for me to make a recommendation and that I would be wise to make the recommendation.”\n\nBut she couldn’t do it in good conscience. Gibson pleaded no contest in 2011 to misdemeanor domestic violence, an offense where the risk of recidivism and/or escalation isn’t negligible. Oyer said no to the president’s request for a sleazy, irresponsible favor—and was promptly canned.\n\nEagle Ed Martin will not say no. He understands the assignment and has been eager in his first few weeks in his new role to complete it.\n\nOn Tuesday, withMartin’s enthusiastic support, the White House announced that it plans to grantfull pardons to Todd and Julie Chrisley, two former reality-show personalities who were convicted in 2022 of fraud and tax evasion. The DOJ accused them of using false documents to take out $36 million in loans, which they spent on luxury cars, real estate, and paying off earlier loans before eventually declaring bankruptcy. Later, when the IRS came looking for $500,000 in back taxes, the Chrisleys supposedly took measures to hide their income from the agency.\n\nJulie Chrisley’s conviction was later vacated on appeal, but Todd’s was upheld. So the couple’s lawyer appealed to the president for a pardon, tossing some argle-bargle into the application about “the weaponization of justice against conservatives and public figures” under the Biden administration. The Chrisleys, you see, are right-wing. Their daughter Savannah spoke at last year’s Republican convention and griped about “rogue prosecutors.”\n\nThere’s no obvious miscarriage of justice in their case that explains why they should have jumped to the front of the line for presidential mercy, unless you consider a Democratic administration holding Republicans accountable for crimes they’ve committedper seunjust. Which, I think, Trump and Martin do: They’re looking for excuses to impugn the Biden DOJ that indicted the president not once but twice and presumably saw the Chrisleys’ notoriety as an asset to be leveraged in that effort.\n\nYou don’t have to be rich and famous to catch a break from Eagle Ed, though.\n\nOn Monday, the president acceptedMartin’s recommendationand pardoned Trump supporter Scott Jenkins, a former sheriff in Virginia who was convicted in December of taking more than $75,000 in bribes in exchange for appointing local businessmen as deputy auxiliary sheriffs in his department. (The badges helped themaccess certain perks, like getting out of traffic tickets.) Like the Chrisleys, Jenkins claimed that he waspersecuted for his conservative politics, but three other defendants havepleaded guilty. No matter: In announcing the pardon onTruth Social, the president seethed about Jenkins being “dragged through HELL by a Corrupt and Weaponized Biden DOJ.”\n\nWhen asked why Jenkins was a higher priority for clemency than thousands of more sympathetic federal prisoners who’ve already served hard time, Martin gave a revealing answer. “He’s a guy that was on the right side of a lot of issues and a lot of public service,” hetold theWall Street Journal, candidly. He was even more candid about his reasoning later on social media: “No MAGA left behind,”saidEagle Ed.\n\nNo MAGA left behind: That’s all there is to it. Outspoken Trump supporters who were successfully prosecuted by the prior administration are now being sprung from prisonentirely irrespective of their guilt or remorse. We saw that already with the January 6 insurrectionists, of course, but that was a case of the president rewarding toadies who committed crimes to benefit him directly. Ed Martin is expanding the circle of MAGAs worthy of presidential protection to garden-variety swindlers whom Trump has likely never heard of, simply because they happen to have the right politics.\n\nThat’s one step closer to a legal system in which the most salient fact about a federal criminal defendant is what they think of Donald Trump and how noisy they’ve been about expressing it. Take the wrong stance and you’ll find yourself thetarget of a federal investigationin the thick of a mayoral primary; take the right stance and you’ll see federal charges against youdisappear before that same primary gets going.\n\nI think it’s telling that Martin went from being the person responsible for punishing federal crimes in D.C. to the person responsible for recommending that crimes committed by favored convicts not be punished. Eagle Ed is living proof that the White House views law enforcement as both a sword and a shield for political advantage. Whether law and order is virtuous or not is entirely situational.\n\nMartin’s dual role as head of the DOJ’s “weaponization” task force is the icing on the cake. He’s so eager to wield that job as a political sword that he recently declared that he won’t let the lack of a crime stop him from dragging his enemies through the mud. “There are some really bad actors, some people that did some really bad things to the American people,” hetold reportersearlier this month. “And if they can be charged, we’ll charge them. But if they can’t be charged, we will name them. And we will name them, and in a culture that respects shame, they should be people that are ashamed.”\n\nIf American culture respected shame, neither Trump nor Martin would be within a thousand miles of power. (The president would probably be in prison and begging for a pardon himself, in fact.) But that point aside, prosecutors aren’t supposed to be in the business of shaming people whom they don’t intend to charge, asJames Comey’s myriad criticsmight remind you. What Ed “No MAGA left behind” Martin is doing isn’t law, it’s politics—and unlike in the case of campus antisemitism or Europe’s betrayal of Western traditions, this time there’s barely any high-minded liberal pretense that he’s doing anything else. Just some vague, check-the-box MAGA boilerplate about corrupt Democratic prosecutors.\n\nFrom time to time I think back to what Sen. Susan Collins said when she was asked during Trump’s first impeachment trial whether she’d vote to convict him for demanding a quid pro quo of Ukraine. No, she answered, there’s no need. “I believe that the president has learned from this case,” shetold CBS News. “The president has been impeached. That’s a pretty big lesson.”\n\nHe did learn a lesson. What he learned was that Senate Republicans would never hold him accountable for blatantly abusing his power.\n\nI think Trump learns lessons like that all the time. Every transgression is a trial balloon: If it doesn’t draw a backlash, he’ll do it again eventually. And next time, he’ll push further.\n\nSometimes thereisa backlash, and he swiftly retreats. “Liberation Day” amounted to him flipping the table of global trade; markets revolted, and within a week, he was hastily resetting the table. (“Trump Always Chickens Out!”) He alsopulled back quicklyduring his first term amid an uproar over him ordering immigration officials to separate children crossing the border from their parents. He does learn lessons from pushback.\n\nBut mostly, he learns lessons from the absence of pushback. His escalating feud with Harvard, which has now reached the point ofcanceling all federal funds to the university, can be understood that way. The public didn’t care when he muscled schools like Columbia into accepting certain federal reforms aimed at preventing antisemitism on campus bythreatening to withhold their federal funding. The Ivy League is the definition of an unsympathetic villain, after all, especially in a case like Columbia’s where antisemitic harassmentisn’t just a cynical Trump talking point. No one’s going to weep over coddled leftist elites being browbeaten for their own political rhetoric for once.\n\nColumbia was a trial balloon. The president inferred from it that Americans also wouldn’t care if he waged war on schools that resisted similar pressure campaigns, which is what he’s done with Harvard. Recently, he moved tobar international studentsfrom enrolling there, demandedall sorts of university data on current enrollees, and even threatened toyank Harvard’s tax exemptionif it didn’t start complying with him. And so far, Trump is correct: No matter how aggressive his mau-mauing has become, no matter how it may have infringed on Harvard’s First Amendment rights, evidence of a broad public backlash is scant.\n\nHis personal graft can also be viewed as a series of trial balloons. It started withfat envelopesfor his inauguration fund, proceeded to hismemecoin scam, continued with the Trump boyscashing in around the world, and lately has led to something as brazen as a foreign government“gifting” a luxury jetto the United States for the president’s use. “This is American corruption on the scale of a post-Soviet republic or a postcolonial African dictatorship,” David Frumdeclared today atThe Atlantic, sifting through the many examples of Trump exploiting his job to enrich himself. The public doesn’t care. The president learned another valuable (literally!) lesson.\n\nPardons, though, are the issue on which he floated his single most daring trial balloon.\n\nGranting blanket clemency to the January 6 insurrectionists on his first day back in office was a gut check for the public, especially after Trump optednot to distinguish between violent and nonviolent offenders. He realized that most Americans wouldn’t like it, I’m sure, but not liking it and actively caring are two different things. Two weeks after he issued his clemency order, his job approval was stillseveral points above water. The lesson: If Americans would let him pardon his foot soldiers in a coup attempt, they’d let him pardon anyone, especially after Joe Biden helpfully lent himsome “both sides do it” coverin his final weeks in office.\n\nThe apathy that greeted that initial trial balloon encouraged him to proceed with further corrupt pardons like the ones for the Chrisleys and Scott Jenkins, I suspect—and may have even led him to functionally sell an act of clemency last month, before Eagle Ed Martin landed in the pardon attorney’s office.\n\nA few weeks ago, Trumppardoned Paul Walczak, a former nursing home executive who pleaded guilty last November to tax offenses. Walczak withheld over three years more than $10 million from his employees’ paychecks that was supposed to go toward federal income and payroll taxes and instead went into his own pocket. He was sentenced in April to 18 months in prison and ordered to pay $4.4 million in restitution. Twelve days later, the president pardoned him.\n\nWhat supposed injustice warranted that? Why, none: Walczak simply had the good fortune to be the son of Elizabeth Fago, who has hosted at least three fundraisers for the president and has donated millions to him and other Republicans. (She was alsoinvolvedin getting Ashley Biden’s diary into the hands of Project Veritas.) Walczak’s pardon application leaned on that fact, accordingto theNew York Times, absurdly alleging, like Jenkins and the Chrisleys did, that he was prosecuted by the Biden DOJ only because he was related to a well-known conservative donor.\n\nEven so, his application was ignored—until, apparently, Fago attended a fundraiser last month at Mar-a-Lago that promised face time with the president for the small entry fee of $1 million per person. Three weeks later, Walczak’s pardon was issued. What a coincidence.\n\nIn hindsight, that, too, was a trial balloon. If there’s no backlash to Walczak’s apparent pay-for-play, and there almost certainly won’t be, what lesson will the president learn from the public’s complacency to inform his thinking on his next act of clemency? If you find it unthinkable that he’d attempt to sell a pardon in plain sight, in a straight-up transaction without the “attend my fundraiser” formalities, I’d like to know why. Logically, as he grows more confident that the public won’t punish him for his illiberal abuses, he’ll also grow less interested in bothering to disguise his abuses as acts of liberal virtue.\n\nUltimately, January 6 itself was a trial balloon. Trump may not have intended it that way, but it amounted to a test of whether half the country would grant him impunity for any sort of misconduct he might conceivably resort to. That test produced a clear result last November. He learned his lesson from the fact that we refused to learn ours, and now we have to live with it, however grotesque it gets.\n\nNick Catoggio is a staff writer at The Dispatch and is based in Texas. Prior to joining the company in 2022, he spent 16 years gradually alienating a populist readership at Hot Air. When Nick isn’t busy writing a daily newsletter on politics, he’s … probably planning the next day’s newsletter."
    }
}