{
    "question": "What are the potential national security, diplomatic, and higher education impacts of the State Department’s plan to aggressively revoke visas for Chinese students, especially given that “critical fields” have not been clearly defined?",
    "content": {
        "source_1": "Secretary of State Marco Rubio said in a statement that the students whose visas will be revoked include those \"with connections to the Chinese Communist Party or studying in critical fields.\"Kevin Dietsch/Getty Imageshide caption\n\nIn the latest and most drastic move yet to curtail the numbers of international students studying in the U.S., the federal government will \"aggressively\" revoke visas from Chinese students and enhance scrutiny for future applicants, according to Secretary of State Marco Rubio.\n\n\"Under President Trump's leadership, the U.S. State Department will work with the Department of Homeland Security to aggressively revoke visas for Chinese students, including those with connections to the Chinese Communist Party or studying in critical fields,\" Rubio said in a statement. \"We will also revise visa criteria to enhance scrutiny of all future visa applications from the People's Republic of China and Hong Kong.\"\n\nDepending on how broadly the State Department and Department of Homeland Security define these criteria, the edict could affect many ofthe 280,000 or so Chinesehigh school, university and graduate level students currently in the U.S.\n\nRubio did not define what he meant by \"critical fields,\" but he likely means students working in areas like semiconductor engineering or aerospace, where the U.S. and China are technological rivals. During the first Trump administration, thousands of mostly graduate-level Chinese students had their visasrevoked, particularly if their research was in cutting-edge engineering fields that may have dual-use applications.\n\nThe newest move to pare back the numbers of Chinese students in the U.S. will likely further strain a bilateral relationship that has been imperiled by another trade war and serious technological competition over artificial intelligence and semiconductor chips.\n\nRevoking visas from Chinese students is also yet another blow to the American higher education system, from which the Trump administration has cut billions of dollars of funding. Some smaller, private colleges and boarding schools have come to rely financially on foreign students, who tend to pay full tuition. For decades, prestigious research universities have also been able to recruit from vast pools of talented and highly educated students from China.\n\nEarlier this spring, the Trump administrationabruptly terminatedthe records of about 1,800 international students, including some Chinese citizens, from a national database, a move thatjeopardizedtheir student visas and which waschallengedby dozens of lawsuits nationwide. The termination of those records in what is called the SEVIS database was ultimately reversed by a federal judge, but immigration officials said they would stillpursuemore restrictive policies for foreign students.\n\nThis week, the State Department said in a cable it waspausinginterview signups for student visa applicants in order to adequately screen their social media profiles, prompting waves of anxiety among Chinese students in the process of finalizing their student visas to the U.S. for the upcoming fall semester.\n\nChina's Foreign Ministry this weekcalledon the U.S. to \"protect the legitimate rights and interests of international students, including those of Chinese students.\"\n\nFor decades, China was the biggest source of international students to the U.S., but those figures have declined steadily after tensions with the U.S. worsened and a global coronavirus pandemic temporarily closed borders. Last year, the volume of students hailing from India eclipsed China.",
        "source_2": "Reporting by Jasper Ward, Costas Pitas, Michael Martina and David Brunnstrom; additional writing by Susan Heavey; Editing by Paul Thomasch, Lincoln Feast, Don Durfee and Tom Hogue\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nJasper Ward is a breaking news reporter in Washington. She primarily covers national affairs and U.S. politics. Jasper was previously based in The Bahamas where she covered the collapse of FTX and the subsequent arrest of its founder Sam Bankman-Fried. She was a part of the Reuters team that won the Gerald Loeb Award for breaking news for its FTX coverage.",
        "source_3": "Secretary of State Marco Rubioannounced Wednesday that the Trump administration will “aggressively revoke” visas for a segment of Chinese students.\n\nChinese foreign nationals studying “critical fields” or with ties to theChinese Communist Partywill be among the students targeted for removal, the top US diplomat said.\n\n“Under President Trump’s leadership, the US State Department will work with the Department of Homeland Security to aggressively revoke visas for Chinese students, including those with connections to the Chinese Communist Party or studying in critical fields,” Rubio said in a statement.\n\n“We will also revise visa criteria to enhance scrutiny of all future visa applications from the People’s Republic of China and Hong Kong,” he added.\n\nThe secretary did not disclose which areas of study would constitute “critical fields.”\n\nThe State Department did not immediately respond to The Post’s request for comment.\n\nThe US grants nearly 300,000 student visas to Chinese nationals every year, according to Rep. Riley Moore (R-W.Va.), who introduced legislation to halt the practice earlier this year.\n\n“The CCP poses an existential threat to the US,”Moore wrote on X following Rubio’s announcement. “We should not be letting 300,000 Chinese nationals into our research institutions every year.\n\n“This is a huge move from the Trump Admin, and now Congress must codify the president’s agenda by passing my Stop CCP Visas Act.”\n\nThe congressman noted thatBeijing’s 2017 National Intelligence Lawrequires any Chinese organization or citizen to support, assist and cooperate with the state intelligence work –  both at home and abroad.\n\n“We’ve literally invited the CCP to spy on our military, steal our intellectual property, and threaten national security,” Moore said when heunveiled his billin March. “Just last year, the FBI charged five Chinese nationals here on student visas after they were caught photographing joint US-Taiwan live fire military exercises.\n\nThe Trump administration’s crackdown on Chinese student visa holders comes one day after Rubio ordered US embassies and consulates to pause any student visa applicant interviews, according toan internal cable obtained by Politico.\n\n“Effective immediately, in preparation for an expansion of required social media screening and vetting, consular sections should not add any additional student or exchange visitor … visa appointment capacity until further guidance is issued [separate telegram], which we anticipate in the coming days,” the cable read.\n\nRubio has already revokedat least 4,000 visasfrom foreign nationals charged with criminal offenses – including arson, wildlife and human trafficking, child endangerment, domestic abuse, DUI and robbery, a senior State Department official told The Post last month.\n\nThe secretary of state has also targeted students involved in anti-Israel campus protests,such as Columbia University grad Mahmoud Khalil.\n\nLast week, an effort by DHS Secretary Kristi Noem to specifically target 7,000 Harvard University students for visa revocations was blocked by a federal court.\n\nOakland, Calif. US District Judge Jeffrey S. White implemented a nationwide injunction barring the Trump administration from terminating the legal status of any international students or allowing immigration authorities to arrest or detain them.\n\nTrump on Wednesday floated capping Harvard University’s foreign enrollment at 15% of its student body. Theadministration last month froze $2.2 billion in federal fundingto the elite university and last week paused its ability to enroll international students — after college leaders rebuffed administration demands to curtail antisemitic incidents and provide lists of foreign students for federal review."
    }
}