{
    "question": "In what ways could the Senate’s proposed 500% tariffs on countries that buy Russian energy influence Russia’s behavior, global energy markets, and U.S. relations with allies that still rely on those imports?",
    "content": {
        "source_1": "Sen. Lindsey Graham (left) makes his opening statement as Sen. Chuck Grassley listens during a 2022 Senate Judiciary Committee markup. Photo: Bill Clark/CQ-Roll Call via Getty Images\n\nSenate Republicansare seizing on President Trump's growing frustration with Russian President Vladimir Putin to argue the time to impose fresh sanctions on Russia is now.\n\nWhy it matters:Trump's tone on Putin has shifted in recent days, calling the Russian president \"crazy\" and warning he is \"playing with fire\" in Ukraine while Trump heads off \"really bad things.\"\n\n🥊Zoom in:The Senate wants to translate Trump's words into action.\n\nZoom out:Majority LeaderJohn Thune(R-S.D.) said last week he is ready to move on a popular, bipartisan sanctions bill if Russia won't come to the table in good faith.\n\nDriving the news:Trump's rhetoric against Putin echoed throughout the Senate today.\n\nThe bottom line:Graham and Sen. Richard Blumenthal (D-Conn.) have a bill to hit Russia with economic sanctions if Putin refuses to negotiate with Ukraine — or if Russia launches another attack after a peace deal is reached.",
        "source_2": "This is Radio Schuman, your new go-to podcast to spice up your weekday mornings with relevant news, insights, and behind-the-scenes from Brussels and beyond.\n\nFrom the economy to the climate and the EU's role in world affairs, this talk show sheds light on European affairs and the issues that impact on our daily lives as Europeans. Tune in to understand the ins and outs of European politics.\n\nNo agenda, no argument, no bias, No Comment. Get the story without commentary.\n\nDare to imagine the future with business and tech visionaries\n\nEuronews Tech Talks goes beyond discussions to explore the impact of new technologies on our lives. With explanations, engaging Q&As, and lively conversations, the podcast provides valuable insights into the intersection of technology and society.\n\nEurope's water is under increasing pressure. Pollution, droughts, floods are taking their toll on our drinking water, lakes, rivers and coastlines. Join us on a journey around Europe to see why protecting ecosystems matters, how our wastewater can be better managed, and to discover some of the best water solutions.   Video reports, an animated explainer series and live debate - find out why Water Matters, from Euronews.\n\nWe give you the latest climate facts from the world’s leading source, analyse the trends and explain how our planet is changing. We meet the experts on the front line of climate change who explore new strategies to mitigate and adapt.\n\nThis is Radio Schuman, your new go-to podcast to spice up your weekday mornings with relevant news, insights, and behind-the-scenes from Brussels and beyond.\n\nFrom the economy to the climate and the EU's role in world affairs, this talk show sheds light on European affairs and the issues that impact on our daily lives as Europeans. Tune in to understand the ins and outs of European politics.\n\nNo agenda, no argument, no bias, No Comment. Get the story without commentary.\n\nDare to imagine the future with business and tech visionaries\n\nEuronews Tech Talks goes beyond discussions to explore the impact of new technologies on our lives. With explanations, engaging Q&As, and lively conversations, the podcast provides valuable insights into the intersection of technology and society.\n\nEurope's water is under increasing pressure. Pollution, droughts, floods are taking their toll on our drinking water, lakes, rivers and coastlines. Join us on a journey around Europe to see why protecting ecosystems matters, how our wastewater can be better managed, and to discover some of the best water solutions.   Video reports, an animated explainer series and live debate - find out why Water Matters, from Euronews.\n\nWe give you the latest climate facts from the world’s leading source, analyse the trends and explain how our planet is changing. We meet the experts on the front line of climate change who explore new strategies to mitigate and adapt.\n\nA bill rapidly making its way through the United States Senate and gathering impressive bipartisan support threatens to wreak untold havoc on Russia's economy in a bid to force Vladimir Putin into \"good faith negotiations for a lasting peace in Ukraine\".\n\nBut the concerted push, jointly promoted by Lindsey Graham, a Republican from South Carolina, and Richard Blumenthal, a Democrat from Connecticut, also risks devastation for roughly half the European Union.\n\n\"Our legislation will isolate Russia – putting it on a trade island by imposing stiff tariffs on other countries that support these atrocities,\" Graham and Blumenthalsaid last weekas they announced the text had secured 81 signatures in the 100-seat Senate.\n\nBesides a wide range of primary sanctions and duties against the Kremlin, including sweeping prohibitions on financial transactions with Russian entities, the bill also foresees secondary tariffs on countries that still do business with Moscow.\n\nIn particular, it zeroes in on Russia's energy exports, an indispensable source of revenue to maintain the costly full-scale invasion of Ukraine.\n\nThe textdrafted by Graham and Blumenthal proposes a tariff of \"not less\" than 500% on any country that \"knowingly sells, supplies, transfers, or purchases oil, uranium, natural gas, petroleum products, or petrochemical products that originated in the Russian Federation.\" In other words, any nation on Earth that consumes Russian energy.\n\nAccording to the senators, the law is mainly intended to \"hold China accountable for propping up Putin's war machine by buying cheap Russian oil from the shadow fleet.\" The critical assessment of Beijing's \"no-limits\" partnership with Moscow is widelyshared in Brussels, where the \"shadow fleet\" has become ahighly pressing concern.\n\n\"Without China's economic support, Putin's war machine would come to a grinding halt,\" the two senators said.\n\nAnd yet, given the vast extraterritorial scope of the bill, the no-holds-barred offensive against Moscow and Beijing has the potential to spill over and inflict intense pain on disparate nations worldwide, also in Europe, at a time of sky-high trade tensions.\n\nDespite unprecedented efforts to wean the bloc off Russian energy, several member states remain hooked. Last year, the EU spent an estimated €23 billion on Russian fossil fuels, exceeding the military support provided to Ukraine.\n\nGas, consistently spared from any sanctions due to a lack of unanimity,led the chart.\n\nToday, five coastal states –  France, Spain, Belgium, the Netherlands and Portugal –  act as entry points for Russian-made liquefied natural gas (LNG), which last year saw a 9% uptick in purchases. Italy, Greece, Hungary, Slovakia and Bulgaria receive flows of Russian gas through the pipelines that crisscross the continent.\n\nHungary and Slovakia, meanwhile, get Russian oil through the Druzhba pipeline,indefinitely sparedfrom an EU-wide ban at Budapest's request.\n\nAdditionally, five countries – Bulgaria, the Czech Republic, Hungary, Slovakia and Finland – operateRussian-made nuclear reactorsthat require specific Russian-made fuels.\n\nThe European Commission has presented a roadmap to phase out all Russian energyby the end of 2027, but the action plan is still in early stages. Hungary and Slovakia have come out strongly against the roadmap, warning it would imperil competitiveness.\n\nThe state of play means that, should the Graham-Blumenthal bill pass and apply as originally conceived, something far from guaranteed at this stage, up to 12 member states could be subject to a punitive 500% tariff when they sell to the American market.\n\nBoth goods and services could be targeted, further spreading the pain across the many corners of the economy. The 500% tariff would come \"in addition\" to anti-subsidy and anti-dumping duties already in place.\n\nPrimary and secondary sanctions should remain in place until \"the Government of the Russian Federation has entered into a peace agreement with Ukraine\", the law says.\n\nThe offices of Graham Blumenthal did not reply to a request for comment.\n\nIn Brussels, the Senate bill is seen as a double-edged sword.\n\nOn the one hand, it is considered a welcome initiative to tighten the screws on the Kremlin, something that President Donald Trump has until now refused to do. On the other hand, it is an explosive gamble that could exacerbate transatlantic turmoil and ravage export-dependent sectors overnight.\n\nIf introduced, the secondary tariffs would throw a grenade right into the ongoing trade talks between the Commission and the White House.\n\nBoth sides have set a 9 July deadline to strike an agreement. Otherwise, Trump has threatened to slap an across-the-board 50% tariff on all EU-made goods.\n\n\"We try to coordinate with the US on sanctions to the extent possible because the more we join on that front, the bigger impact we can have,\" a Commission spokesperson said when asked about the Graham-Blumenthal bill, without commenting on the devastating effects it could have on parts of the EU economy.\n\n\"So coordination in that sense, in the various fora, does take place.\"\n\nBut there is a glimmer of hope for Brussels: the draft law offers the possibility for the president to grant a 180-day exemption from the 500% tariff to a country, good or service – as long as doing so is justified for \"national security interests\".\n\nThe one-time waiver would be left entirely at Trump's discretion: the president would be able to hand-pick whom he saves and whom he punishes. This would give individual member states a chance to visit the Oval Office and lobby for a reprieve, a ritual that Trump appears to enjoy, particularly when cameras are present.\n\nThe question of enforcement might also dent the impact on the bloc.\n\nMaria Shagina, a senior fellow at the International Institute for Strategic Studies (IISS), believes implementing the 500% tariffs would be logistically challenging, if not impossible, due to the numerous countries that regularly purchase Russian energy. The list of clients features some of America's strategic partners, like India and Turkey.\n\n\"Would the US monitor exports of these fossil fuels, and if so, how? Would it impose blanket bans on all goods imported from countries that import Russian fossil fuels? How does this square with an all-out trade war against allies and adversaries alike?\" she asked.\n\nThe law, Shagina noted, should be seen in the context of American politics and Trump's much-publicised mission to achieve a settlement between Russia and Ukraine, which has made limited progress since his first phone call with Vladimir Putin in February.\n\n\"The bill does not seek to put congressional pressure on Russia independently of Trump's actions regarding Russia,\" Shagina told Euronews.\n\n\"Rather, it aims to support Trump's rhetoric on Russia.\"",
        "source_3": "If Lindsey Graham's bill were to pass, it would cause an economic calamity on a scale never before seen in our country\n\nWhile tariffs make wars more likely, embargoes make wars difficult to avoid. Senator Lindsey Graham’s SanctioningRussiaAct calls for 500% tariffs on dozens of countries and essentially amounts to an embargo.\n\nIf this bill were to pass, it would cause an economic calamity on a scale never before seen in our country.\n\nIn its insistence that Moscow be a permanent enemy of the United States, the foreign policy establishment is pushing to impose more punitive measures on Russia should they refuse to negotiate a peace deal with Ukraine.TheSanctioning Russia Actseeks to inflict a series of additional sanctions and prohibitions of various financial transactions with Russia.\n\nYet, the most consequential and outright reckless provision of the bill seeks to enact minimum 500% secondary tariffs on countries who trade with Russia. Though the bill seeks to punish Russia, it will also punish America’s allies and even the United States itself. The global policemen in Washington are so incredulous that they cannot force peace between Russia and Ukraine that they formally abandoned even the pretense that their meddling is in America’s interests.\n\nSpecifically, the bill directs the President to impose 500% tariffs on all goods and services imported into the United States from a country that“knowingly sells, supplies, transfers, or purchases oil, uranium, natural gas, petroleum products, or petrochemical products that originated in the Russian Federation.”This tariff is subject to increase by no less than 500% every 90 days, meaning some countries could face 1,000% tariffs in just a few months.\n\nIn response to its invasion of Ukraine, the United States and its allies imposed some 16,000 sanctions, froze Russia’s sovereign assets, and implemented a series of severe financial restrictions. As the war wages in its fourth bloody year, it is safe to say that these measures unequivocally failed to alter Moscow’s war aims.\n\nThis inevitable failure was, of course, easily predictable to anyone who honestly assessed Russia’s motives for launching the war. The Kremlin views maintaining influence over Ukraine as necessary to prevent Ukraine’s alignment with the West, particularly preventing its efforts to join NATO, as a core national security interest. Countries will go to great lengths to secure what they deem are core interests, and given the tremendous amount of blood and treasure it has expended, Russia is no different.\n\nTherefore, one should not expect additional punitive measures to alter Moscow’s strategic calculus in any meaningful manner.\n\nDozens of countries continue to trade with Russia directly and indirectly including key strategic allies and even the United States itself. In 2024, the United Statesimported$624 million worth of enriched uranium and plutonium directly from Russia. The United States, like many other countries, has also seen Russian crude oil importedfrom third countrieswho buy Russian oil and then sell it abroad. Are the proponents of this legislation honestly seeking to require the President to enact a 500 % tariff on ourselves?\n\nWhat other countries would this bill implicate? According to theUN Comtrade Database,Israelimported $10.6 million in plastics from Russia in 2024. Do supporters of this bill really want to slap a 500% tariff on Israel while it is engaged in a multifront war? Last year, Taiwan, who many consider to be key to the U.S. defense posture in Asia, was Russia’s top consumer of naphtha — a petrochemical used in the production of plastics. Does anyone truly think that imposing a 500% tariff on all Taiwanese goods entering the United States will put them in a better position to defend themselves from potential Chinese aggression?\n\nLikewise, Japan, another key ally in Asia, imported some $3.6 million worth of liquified natural gas (LNG) and hundreds of thousands of dollars worth of plastics and rubber from Russia in 2024.\n\nOur allies inEuropewould also be severely affected. Despite strong rhetoric condemning Moscow, imports of Russian LNG into the European Union (EU)rose by 19.3%in 2024. In the first 15 days of 2025,EU countriesimported over 837,000 metric tons of Russian LNG, with Germany, France, Belgium, and Spain beingkey importers. According toTrade Data Monitor, Ukraine itself is estimated to have imported over $200,000 in petroleum products from Russia in 2024, and up until January 1, 2025, Ukraine wasfacilitatingthe transfer of Russian gas to Europe via its trans-national pipelines.\n\nThe country that will be harmed the most under this legislation will be the United States, both economically and strategically. If implemented, these tariffs would make U.S. trade with most of the world untenable, raise prices for American consumers, and riskfurther weakeningthe dollar.\n\nIt would also degrade our relations with several important allies at a time when geopolitics is increasingly volatile. The United States should be leveraging its allies now more than ever as we face a myriad of pressing priorities, including an unsustainable $36 trillion national debt. Instead, this misguided legislation would drive many of our allies away and into the arms of other trading partners, includingChina. The bill certainly will not do anything to convince Russia to sue for peace in Ukraine. Rest assured that Moscow would welcome the United States sowing further division with its key trading partners.\n\nNever underestimate Washington’s ability to make things worse. The Sanctioning Russia Act of 2025 will cut off our nose to spite our face. Congress should reject this misguided bill and instead focus its efforts to advance realistic peace negotiations in Ukraine and pursue policies that advance America’s national interests\n\nOn August 1, theTrump administrationimposeda 50% tariff on Brazilian imports, sending high-volume sectors like coffee, beef, and textile companies scrambling to adjust to their new reality. The tariffs came on the back of a lobbying campaign from an unlikely source — Brazil itself. Whereas other foreign entities are lobbying the U.S. government to reduce their tariffs, allies of ex-president Jair Bolsonaro asked for more.\n\nEduardo Bolsonaro, financed by ex-president father Jair Bolsonaro, is the main catalyst behind the lobbying efforts. And by not registering his activities, Eduardo Bolsonaro may be running afoul of the U.S. foreign lobbying laws.\n\nU.S. President Donald Trump is hoping the Armenian Prime Minister Nikol Pashinyan and Azerbaijani President Ilham Aliyev are primed for peacewhen they meetFriday at the White House.\n\nThe two are expected to sign aframeworkagreement while Armenia and the U.S. are expected to launch a joint venture offering exclusive U.S. commercial development rights to a 43-kilometer route through Armenia’s southern Syunik region. This land route will run through Armenian territory to connect mainland Azerbaijan with its Nakhichevan exclave and Turkey and has been a main sticking point innegotiations.\n\nNext week will likely seethe first meetingbetween the U.S. and Russian presidents, Donald Trump and Vladimir Putin, since the former’s election to a second term — an encounter the Kremlin has already confirmed.\n\nDetails are scarce, including on the summit’s date and place -- Putinhintedthat it could be in the United Arab Emirates when he washostingthe UAE President Mohammed Bin Zayed in Moscow.\n\nBy subscribing to our recent updates, you will gain access to a wealth of valuable information, including\n            breaking news, expert analysis, and thought-provoking articles. Whether you are interested in science,\n            technology, business, health, or any other field, our updates will keep you informed and engaged.\n\n©2025 Quincy Institute for Responsible Statecraft, Inc. All Rights Reserved.\n\n©2025 Quincy Institute for Responsible Statecraft, Inc. All Rights Reserved.\n\nSubscribe now to our weekly round-up and don't miss a beat with your favorite RS contributors and reporters, as well as staff analysis, opinion, and news promoting a positive, non-partisan vision of U.S. foreign policy."
    }
}