{
    "question": "What are the potential consequences of pausing student visa interviews and expanding social media vetting for national security, university finances, and prospective international students?",
    "content": {
        "source_1": "It’s the latest salvo against universities, many of whom rely heavily on foreign students for funds.\n\nThe Harvard University logo is displayed on a building at the school, April 15, 2025, in Cambridge, Massachusetts. | Charles Krupa/AP\n\nThe Trump administration is weighing requiring all foreign students applying to study in the United States to undergo social media vetting — a significant expansion of previous such efforts, according to a cable obtained by POLITICO.\n\nIn preparation for such required vetting, the administration is ordering U.S. Embassies and consular sections to pause scheduling new interviews for such student visa applicants, according to the cable, dated Tuesday and signed by Secretary of State Marco Rubio.\n\nIf the administration carries out the plan, it could severely slow down student visa processing. It also could hurt many universities who rely heavily on foreign students to boost their financial coffers.\n\n“Effective immediately, in preparation for an expansion of required social media screening and vetting, consular sections should not add any additional student or exchange visitor (F, M, and J) visa appointment capacity until further guidance is issued septel, which we anticipate in the coming days,” the cable states. (“Septel” is State Department shorthand for “separate telegram.”)\n\nThe administration had earlier imposed some social media screening requirements, but those were largely aimed at returning students who may have participated in protests against Israel’s actions in Gaza.\n\nThe cable doesn’t directly spell out what the future social media vetting would screen for, but it alludes to executive orders that are aimed at keeping out terrorists and battling antisemitism.\n\nMany State Department officials have complained privately for months that past guidance — for, say, vetting students who may have participated in campus protests — has been vague. It’s unclear, for example, whether posting photos of a Palestinian flag on an X account could force a student to undergo additional scrutiny.\n\nThe administration has used a variety of rules to target universities, especially elite ones such as Harvard, that it sees as too liberal and accuses of allowing antisemitism to flourish on their campuses. At the same time, it is carrying out immigration crackdowns that have swept up a number of students.\n\nSpokespeople for the State Department did not immediately respond to a request for comment.\n\nThe news was met with frustration in much of the higher education community.\n\nNAFSA: Association of International Educators, a group that advocates for foreign students, decried the decision. The group’s CEO, Fanta Aw, said it unfairly cast aspersions on hardworking students.\n\n“The idea that the embassies have the time, the capacity and taxpayer dollars are being spent this way is very problematic,” Aw said. “International students are not a threat to this country. If anything, they’re an incredible asset to this country.”\n\nMeta, which owns Facebook, WhatsApp and Instagram, declined to comment. Spokespeople for other platforms, including Google, Snap, X, TikTok, Discord, Bluesky and Reddit, also did not respond to questions about the policy.",
        "source_2": "Dan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nThe Trump administration has ordered a freeze on all newstudent visa interviewsat U.S. embassies and consulates, as it weighs a plan to require foreign applicants to undergo social media vetting, officials told the Associated Press.\n\nThe cable, dated Tuesday and signed by Secretary of StateMarco Rubio, outlines the forthcoming shift in vetting procedures. The Trump administration is also considering a policy that would require all foreign students applying to study in the United States toundergo social media screening.\n\n\"We have said before: the students are not a threat and the way this is framed within a national security lens, as if students are a threat when we know that students make up no more than 6 percent of total enrollment in the United States,\" Fanta Aw, executive director and CEO of NAFSA, Association of International Educators, toldNewsweek.\n\nNewsweekhas reached out to the State Department and theDepartment of Homeland Security(DHS) via email for comment.\n\nPausing the visa category, which saw over 400,000 issuances in fiscal year 2024, would mark a shift inthe Trump administration's effortsto limit immigration, dramatically slow down the process for international students, and potentially cut off more funding to institutions that welcome them.\n\n\"Effective immediately, in preparation for an expansion of required social media screening and vetting, consular sections should not add any additional student or exchange visitor (F, M, and J) visa appointment capacity until further guidance is issued septel, which we anticipate in the coming days,\" the State Department cable states. Septel is shorthand for \"separate telegram.\"\n\nThe U.S. Citizenship and Immigration Service (USCIS) began planning increased screening of immigrants' social media accounts in early March, stating that it would increase national security.\n\nPeople applying for permanent residency (green cards) or citizenship from within the U.S. were already required to provide social media account information, but expanding the program to those planning to immigrate to the U.S. was aimed at around 2.5 million yearly immigrants.\n\nThe State Department's involvement in the process occurs at the embassy or consular level, where its staff determines eligibility for visas during interviews.\n\nPauses like the one reported Tuesday are not uncommon when the department is rolling out new policies, but this would come after months of focus by the administration on international students.\n\nThe State and Homeland Security departments have revoked or attempted to revoke student visas from those already studying at American schools.\n\nMuch of the focus has been on those allegedly linked to pro-Palestinian protests on campuses over the past year, with Rubio arguing that some actions and words were pro-Hamas, and therefore against U.S. foreign policy.\n\nLast week, the administration announced it would revoke Harvard's ability to accept international students, a move that was quickly challenged and subsequently paused in the courts. PresidentDonald Trumplatercalled for a list of all foreign studentsat the school, saying many of their home countries paid nothing toward their education in the U.S.\n\nAsked about the suspension at a briefing Tuesday, State Department spokesperson Tammy Bruce said the U.S. uses every available resource to vet people applying for visas:\"We will continue to use every tool we can to assess who it is that's coming here, whether they are students or otherwise.\"\n\nFanta Aw, executive director and CEO of NAFSA, Association of International Educators, toldNewsweek:\"We will be askingCongressto demand transparency from this administration, to step forward in letting the administration know the potential consequences that this will have for the fall semester and for the foreseeable future for students who have been wanting to come to the United States.\"\n\nAaron Reichlin-Melnick, senior fellow at the American Immigration Council, on X (formerly Twitter):\"Trump's decision to suspend student visa interviews threatens nearly $44 billion in economic contributions and over 370,000 jobs across the United States, according to NAFSA. If the United States stops taking foreign students, the economic impact would be catastrophic.\"\n\nSecretary of Homeland Security Kristi Noem, in a statement about Harvard last week:\"It is a privilege, not a right, for universities to enroll foreign students and benefit from their higher tuition payments to help pad their multibillion-dollar endowments.\"\n\nA U.S. official told AP Tuesday the suspension is meant to be temporary and will not affect applicants who already have scheduled visa interviews. The official spoke on condition of anonymity to discuss a confidential administration document.\n\nA prolonged pause in student visa scheduling could cause delays that disrupt the enrollment plans of college, boarding school, and exchange students for the summer and fall terms.\n\nA decline in international student enrollment may also strain university budgets. Many institutions have relied on full-tuition-paying international students to offset reductions in federal research funding.\n\nUpdate 5/27/25, 1:22 p.m. ET: This article was updated with comment from Fanta Aw.\n\nUpdate 5/27/25, 7:30 p.m. ET: This article was updated with additional information and remarks.\n\nThis article contains reporting by The Associated Press.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security.                                    ...Read more",
        "source_3": "WASHINGTON — The Trump administration is pumping the brakes on all foreign student visas and considering whether to vet new applicants based on their social media posts.\n\nSecretary of State Marco Rubio ordered US embassies and consulates on Tuesday to pause any student visa applicant interviews, according toan internal cable obtained by Politico.\n\n“Effective immediately, in preparation for an expansion of required social media screening and vetting, consular sections should not add any additional student or exchange visitor … visa appointment capacity until further guidance is issued [separate telegram], which we anticipate in the coming days,” the cable read.\n\nBoth theState DepartmentandDepartment of Homeland Securityhave moved to strip thousands of visas from foreign students in recent weeks with mixed success.\n\n“We don’t speak about individual visa cases,” State Department spokeswoman Tammy Bruce told reporters.\n\n“We take very seriously the process of vetting who it is that comes into the country. And we’re going to continue to do that …  and again, whether they be student[s] or if you’re a tourist who needs a visa, or whoever you are, we’re going to be looking at you,” she added.\n\n“It seems to be such a controversial thing that’s going on, but it shouldn’t be, and every nation should take seriously, and does, who’s coming in. So if you’re going to be applying for a visa, follow the normal process, the normal steps, expect to be looked at and and we go on from there.”\n\nLast week, Homeland Security Secretary Kristi Noem moved to kick out nearly 7,000 Harvard University students from foreign countries — but was blocked by a federal judge.\n\nOakland, Calif. US District Judge Jeffrey S. White implemented a nationwide injunction barring the Trump administration from terminating the legal status of any international students or allowing immigration authorities to arrest or detain them.\n\nAt least 4,000 visashave already been revoked from international students with rap sheets — with charges including arson, wildlife and human trafficking, child endangerment, domestic abuse, DUI and robbery, a senior State Department official told The Post last month.\n\nThe department previously set up an artificial intelligence-powered pilot program to “catch and revoke” student visas after scrubbing holders’ social media accounts for statements expressing sympathy with Hamas or other terror groups, according to Axios.\n\n“Those who support designated terrorist organizations, including Hamas, threaten our national security,” Rubio said. “The United States has zero tolerance for foreign visitors who support terrorists.”\n\nUS Citizenship and Immigration Services (USCIS) announced in early April it was also taking into account an applicant’s support for “antisemitic terrorism” when deciding whether to reject student visas or green cards.\n\nMahmoud Khalil was one of the first students whose role in anti-Israel demonstrations at Columbia Universitygot his visa and green card canceledin March.\n\nThe Trump administration has since been challenged in both immigration and federal courts over claims it had the right to deport Khalil, who served as a spokesman for anti-Israel groups including Columbia University Apartheid Divest.\n\nDevin Connolly, managing partner at Reeves Immigration Law Group — which is handling some cases of foreign students with revoked visas — said reviews of social media accounts aren’t new and have most often been used by authorities to determine whether a marriage is legitimate.\n\n“The administration, and especially Secretary Rubio, has been very clear that nobody is entitled to a visa and that they will not be issuing visas to foreign nationals whose beliefs and activities are contrary to the United States’ national interests,” Connolly said.\n\n“However, to what extent will social media postings that are critical of the Trump administration and its policies be considered to be in conflict with our national interests?” he asked.\n\n“It is easy to foresee denials for certain postings about Israel and Hamas, but whatabout postings about Afrikaners being granted refugee status? We will have to see if a subject like that is controversial enough to warrant a denial.”\n\nThe White House and State Department did not immediately respond to The Post’s requests for comment Tuesday."
    }
}