{
    "question": "How might the decision to halt CDC recommendations for COVID-19 vaccination in healthy children and pregnant women—announced ahead of the advisory panel’s review—shape public trust, clinical practice, and access to vaccines in the coming months?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nA sign marks the entrance to the federal Centers for Disease Control and Prevention (CDC) in Atlanta, on Oct. 8, 2013. (AP Photo/David Goldman, File)\n\nHealth and Human Services Secretary Robert F. Kennedy Jr., left, and Education Secretary Linda McMahon attend a Make America Healthy Again (MAHA) Commission Event in the East Room of the White House, Thursday, May 22, 2025, in Washington. (AP Photo/Jacquelyn Martin)\n\nNEW YORK (AP) — U.S. Health Secretary Robert F. Kennedy Jr. on Tuesday announced that COVID-19 vaccines are no longer recommended for healthy children and pregnant women — a move immediately questioned by several public health experts.\n\nIn a58-second videoposted on the social media site X, Kennedy said he removed COVID-19 shots from the Centers for Disease Control and Prevention’s recommendations for those groups. No one from the CDC was in the video, and CDC officials referred questions about the announcement to Kennedy and the U.S. Department of Health and Human Services.\n\nNo other details were released, and HHS officials did not immediately respond to questions about how the decision was made.\n\nSome doctors and public health leaders called the move concerning and confusing.\n\nHealth and Human Services Secretary Robert F. Kennedy Jr., left, and Education Secretary Linda McMahon attend a Make America Healthy Again (MAHA) Commission Event in the East Room of the White House, Thursday, May 22, 2025, in Washington. (AP Photo/Jacquelyn Martin)\n\n“There’s no new data or information, just them flying by the seat of their pants,” said Michael Osterholm, director of the University of Minnesota’s Center for Infectious Disease Research and Policy.\n\nU.S. health officials, following recommendations by infectious disease experts, have been urging annual COVID-19 boosters for all Americans ages 6 months and older.\n\nThe idea of changing the recommendations is not completely out of the blue. As the COVID-19 pandemic has waned, experts have increasingly discussed the possibility of focusing vaccination efforts on people 65 and older — who are among those most as risk for death and hospitalization.\n\nACDC advisory panelis set to meet in June to make recommendations about the fall shots. Among its options are suggesting shots for high-risk groups but still giving lower-risk people the choice to get vaccinated.\n\nBut Kennedy, a leading anti-vaccine advocate before becoming health secretary,decided not to waitfor the scientific panel’s review. He said that annual COVID-19 booster shots have been recommended for kids “despite the lack of any clinical data” to support that decision.\n\nSome physicians and public health leaders expressed concern that HHS officials disregarded a scientific review process that has been in place for decades, in which experts — in public meetings — review current medical evidence and hash out the pros and cons of policy changes.\n\n“It’s a dangerous precedent. If you can start doing that with this vaccine, you can start doing that with any vaccine you want — including mumps-measles-rubella,” said Osterholm, referring to another vaccine that Kennedy hasvoiced doubtsabout.\n\nHe and others said the announcement raises an array of questions, including whether health insurance companies will keep covering COVID-19 vaccinations and how hard it will be now for people who want the shots to get them.\n\n“The reason we give vaccines to healthy people is to keep them safe,” said Dr. Georges Benjamin, executive director of the American Public Health Association.\n\nMore than 1.2 million people have died in the U.S. from COVID-19, most of them elderly. But children haven’t been spared: The coronavirus has been the underlying cause in more than 1,300 childhood deaths since the pandemic began, according to CDC data.\n\nFood and Drug Administration Commissioner Dr. Marty Makary and Dr. Jay Bhattacharya, head of the National Institutes of Health, appeared in the video with Kennedy.\n\nEarlier this year, during the nomination process, Kennedy gaveassurancesto wavering Republicans that he would not alter the federal vaccine schedule.\n\nBut since then, Kennedy and other Trump administration appointeeshave made big changesto the system for approval and use of vaccines.\n\nThey added restrictions toa recent vaccine approval. Last week, the FDA announcedroutine COVID-19 vaccine approvalswill be limited to seniors and younger people with underlying medical risks, pending new research for healthy adults and children.\n\nAmong the confusion created by Tuesday’s announcement, experts said, was the implication that the coronavirus isn’t dangerous to pregnant women.\n\nDuring the height of the pandemic, deaths of women during pregnancy or shortly after childbirthsoaredto their highest level in 50 years. Indeed, pregnancy was on the list of health conditions that would qualify someone for a COVID-19 vaccination under FDA’s new guidance “framework” announced last week.\n\nVaccination has been recommended for pregnant women, in part, because it’s a way to pass immunity to newborns who are too young for vaccines and are vulnerable to infections.\n\n“To say that they are not at any risk is simply incorrect,” said Dr. Sean O’Leary of the American Academy of Pediatrics.\n\nDr. Steven Fleischman, president of the American College of Obstetricians and Gynecologists, said: “The science has not changed. It is very clear that COVID infection during pregnancy can be catastrophic and lead to major disability, and it can cause devastating consequences for families.”\n\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group and the Robert Wood Johnson Foundation. The AP is solely responsible for all content.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "The Centers for Disease Control and Prevention no longer recommends routine Covid-19 vaccines for pregnant women and healthy children, Health and Human Services Secretary Robert F. Kennedy Jr.—a noted vaccine skeptic who has pushed conspiracy theories about the shots—announcedTuesday, while a critic said the move puts women and children “in harm's way.”\n\nKennedy, who appeared with National Institutes of Health director Jay Bhattacharya and Food and Drug Administration Martin Makary, said in avideoposted to X the Covid vaccine was removed from the CDC’s immunization schedule for pregnant women and healthy children.\n\nThe CDC, whosewebsitehas not been updated with the change, previously recommended Covid vaccines for anyone six months and older, pregnant women and women trying to get pregnant.\n\nThe CDC’swebsitealso states there are studies with hundreds of thousands of participants indicating Covid vaccination before and during pregnancy is “safe, effective and beneficial” to the woman and the baby, including research suggesting vaccination builds antibodies that could protect the child.\n\nKennedy claimed the Biden administration recommended children receive an additional Covid vaccine “despite the lack of any clinical data to support the repeat booster strategy” among healthy youth.\n\nKennedy has faced criticism for his vaccine skepticism, including some opposition during his Senate confirmation hearing earlier this year, during which some Democratic lawmakersquestionedKennedy’s earlier comments that “no vaccine is safe” and his call to pull authorizations for Covid vaccines in May 2021.\n\nThe CDC’s Advisory Committee on Immunization Practices was set to vote on recommendations for the vaccine in June, and the agency’s decision to revoke the advisory follows the FDAadoptinga new regulatory framework that would likely narrow recommendations for the shots among people over 65 and those at high risk for severe outcomes.\n\nMakary and Vinay Prasad, the FDA’s top vaccine regulator, wroteearlierthis month that pregnancy was among the underlying medical conditions that probably required additional vaccine shots because of the increased risks of Covid.\n\nPaul Offit, a vaccine expert at Children’s Hospital of Pennsylvania, told Forbes Kennedy’s decision to pull the CDC’s vaccine recommendations is “contradictory” and “doesn’t make sense.” Offit cited Makary labeling pregnancy as a high-risk condition for Covid infections, “now they’re saying it’s not, which is it?” Offit said, adding, “All this does is put children in harm’s way and put pregnant women in harm’s way.” Former acting CDC director Richard Besser toldNBCin a statement that, while he worked for the agency, there was an “assurance that the recommendations that came to me were based on the best available science and evidence.” The CDC pulling recommendations for healthy children and pregnant women was “clearly not coming from that direction, and that’s greatly concerning,” Besser said.\n\nTalks about adjusting the CDC’s recommendations for Covid vaccines have increased in recent weeks. Jamie Loehr, a member of the CDC’s vaccine advisory panel, said the agency was “seriously considering” adjusting its recommendation language to allow anyone who wanted a vaccine to receive one, CBSreported. Though the CDC’s vaccine panel had reportedly yet to consider dropping recommendations for groups altogether, Kennedy’s Department of Health and Human Services considered pulling advisories earlier this month, people familiar with the agency’s talkstoldthe Wall Street Journal. Kennedy, who now oversees the FDA, CDC and other public health agencies, petitioned the FDA in 2021 to nix emergency authorizations for Covid vaccines relying on mRNA technology, which were recommended for children as young as six months, with approvals for anyone 12 and older.",
        "source_3": "The Centers for Disease Control and Prevention will no longer recommend that healthy children and pregnant women receive the COVID-19 vaccine, the Trump administration announced Tuesday.\n\n“Last year, the Biden administration urged healthy children to get yet another COVID shot despite the lack of any critical data to support the repeat booster strategy in children,” Health and Human Services Secretary Robert F. Kennedy Jr. said in a video posted online.\n\nFood and Drug Administration (FDA) Commissioner Dr. Marty Makary added that “there’s no evidence that healthy kids need it today and most countries have stopped recommending it for children.”\n\nThe move comes one week after top health officialssignaled that they planned to tighten accessto the annual COVID-19 booster shot, which is still recommended for elderly and at-risk populations.\n\nPreviously, COVID-19 vaccines had been recommended for everyone six months and older.\n\nUnder the framework announced last week, the administration will allow seniors 65 and older and other high-risk populations to receive the COVID booster shot but require more stringent testing for other populations before recommending it for them.\n\nKennedy and many of his fellow top health officials, such as Makary and National Institutes of Health (NIH) Director Jay Bhattacharya, have long raised suspicions about distribution of the COVID-19 vaccine to low-risk populations.\n\n“Bottom line: It’s common sense and it’s good science. We are now one step closer to realizing [President Trump]’s promise to Make America Healthy Again,” Kennedy wrote on X.\n\nTuesday’s announcement brings the US in line with other countries that have tightened requirements to receive the vaccine.\n\nOther countries have similarly tighter requirements on COVID-19 shots.\n\nCurrently, Australia, Belgium, Canada, Denmark, and Switzerland recommend annual COVID shots for those 65 and up, as well as those at high-risk from SARS-CoV-2.\n\nGermany and the Netherlands recommend it for those 60 and older, while the United Kingdom does so for those 75 and older and Sweden recommends it for those 80 years and up.\n\nEarlier this month, the FDA gave approval to Novavax’s COVID-19 vaccine for adults 65 and up as well as individuals between the ages of 12 to 64 with at least one significant health issue that puts them at elevated risk from the respiratory virus."
    }
}