{
    "question": "How might the weaker-than-expected July jobs report—along with downward revisions, a higher unemployment rate, and sector shifts like gains in healthcare and losses in federal jobs—shape the Fed’s September rate decision and employers’ hiring plans amid ongoing trade uncertainty?",
    "content": {
        "source_1": "July jobs growth slowed amid rising signs that Trump’s tariffs are weighing on trade, prices and hiring\n\nTheUS economyadded 73,000 jobs in July, far lower than expected, amid ongoing concerns withDonald Trump’sescalatingtrade war.\n\nForecasters surveyed by Bloomberg had predicted the July jobs report would show a drop in added jobs to about 109,000. The unemployment rate rose to 4.2% from 4.1% in June.\n\nThe Bureau of Labor also slashed the number of jobs added in recent months. May’s jobs figure was revised down by 125,000, from 144,000 to 19,000, and June was revised down by 133,000, from 147,000 to 14,000 – a combined 258,000 fewer jobs than previously reported.\n\nHours after the data was released, Trump announced that he wasfiring the federal government officialin charge of labor statistics, claiming, without evidence, that Erika McEntarfer, commissioner of labor statistics, had “faked” employment figures ahead of last year’s election.\n\nHealthcare and social assistance added 73,300 jobs over the month but growth was dragged down by more cuts to federal workers. Twelve thousand federal jobs were lost in July and federal employment is down by 84,000 since reaching a peak in January.\n\n“There was little to celebrate in the July Employment Report,” Thomas Ryan, North America economist for CapitalEconomics, wrote in a note to investors. He noted that the three-month average employment gain had now fallen to “a troublingly low 35,000 – a figure that is difficult to interpret as anything other than a sign of hiring stalling, even as population growth slows.”\n\nShortly before the latest official jobs data was published, two Federal Reserve policymakers whobroke ranks with its other officials on interest rates earlier this weekreleased statements explaining their respective decisions.\n\nThe labor market “has become less dynamic and shows increasing signs of fragility”, said Michelle W Bowman, Fed vice-chair for supervision and a Trump appointee. Putting off a rate cut “could result in a deterioration in the labor market and a further slowing in economic growth”, she added.\n\nChristopher Waller, another Trump appointee, said waiting before cutting rates was “overly cautious”, adding: “I see no reason that we should hold the policy rate at its current level and risk a sudden decline in the labor market.”\n\nTrump, who has lambasted the Fed for months after it repeatedly opted to hold rates steady, welcomed the pair’s official interventions – and called on the central bank’s board to “assume control” of policy if Jerome Powell, the central bank’s chair, refuses to cut rates.\n\nThe jobs report comes in a week packed with economic news. On Wednesday, the Bureau of Economic Analysis reported that gross domestic product, a broad measure of the US’s economic health,grew at 3%in the last three months, up from a 0.5% decline in the first quarter.\n\nThe first quarter fall and second quarter bounceback were driven byTrump’s tariffpolicies as businesses stocked up on imports ahead of the levies at the start of the year – which cut growth – and cut back on imports in the second – which boosted growth.\n\nTaken together, theUS economygrew at a sluggish 1.2% in the first six months of the year, down from the 2.5% average pace in 2024.\n\nAlso on Wednesday, theFederal Reserveannounced it wouldnot cut interest rates.The Fed is underintense pressurefrom Trump to cut rates but its chair said the central bank was still waiting to see what impact Trump’s tariffs will have on prices.\n\n“Higher tariffs have begun to show through more clearly to prices of some goods, but their overall effects on economic activity and inflation remain to be seen,” Powell said.",
        "source_2": "The U.S. job market appeared to lose steam last month, according to Labor Department data released Friday, as the Federal Reserve warned the effects of President Donald Trump’s tariffs on the economy have yet to be seen.\n\nThe unemployment rate rose slightly to 4.2% in July, in line with analyst forecasts according to FactSet.\n\nAbout 73,000 nonfarm jobs were added last month, below economists' projections of 115,000 and less than half the 147,000 added in June.\n\nFriday’s data follows a report earlier this week from the career services firm Challenger, Gray & Christmas, which noted private and public employers cut 62,000 jobs in July, marking a 140% spike over July 2024 after the Department of Government Efficiency slashed federal agencies and grants, and as more companies implemented AI.\n\nAn average of 130,000 jobs added per month this year is the weakest since the January to June period in 2010, as the U.S. economy recovered from the Great Recession. An average of 168,000 jobs were added per month last year, compared to the roughly 400,000-per-month average from 2021 through 2023 as businesses recovered from COVID-19 lockdowns.\n\nIt’s not immediately clear whether Trump’s tariffs have directly affected the number of jobs available, though retail and automotive sectors have recorded an increase in layoffs. The retail market cut nearly 80,500 jobs in July, a year-over-year increase of 249%, according to the Challenger report, as companies cited tariffs, inflation and economic uncertainty.\n\nFollowing the Federal Reserve’s policymaking meeting in July, during which the agency opted to hold interest rates between 4.25% and 4.5%, Fed Chair Jerome Powell noted there were several economic reports ahead before the Fed considers a rate easement, including Friday’s labor report. Powell said the unemployment rate would be a focus, as the Fed operates on a dual mandate of setting rates to keep inflation and unemployment low, though he warned about the looming impacts of Trump’s tariffs, as there is a “long way to go” before the long-term effects of those are known. Tariff costs are starting to raise consumer prices, Powell said Wednesday, and “we expect to see more of that.” The Fed’s policymaking panel will meet again on Sept. 17, and there’s about 39% odds the agency opts for a quarter-point reduction,accordingto CME’s FedWatch. There’s a higher chance during its Oct. 29 meeting, at 61.3% odds.\n\nFriday’s jobs report follows an optimistic update on private payrolls earlier this week. ADP reported an increase of 104,000 private jobs in July, reversing a loss of 23,000 in June. The figure came in well above economist forecasts for an increase of 65,000, according to a Dow Jones consensus. Nela Richardson, ADP’s chief economist, said the firm’s report was “broadly indicative of a healthy economy,” noting, “Employers have grown more optimistic that consumers, the backbone of the economy, will remain resilient.” June’s report was far worse than expected, after analysts projected a monthly increase of 100,000 private jobs.\n\n2025 Job Cuts Have Already Surpassed All Of 2024—DOGE, AI And Tariffs Are Biggest Causes(Forbes)",
        "source_3": "mikeroweWorks Foundation CEO Mike Rowe on the impact of artificial intelligence on white-collar jobs, the rising popularity of trade schools and the stigma attached to blue-collar jobs.\n\nThe U.S. economy added jobs in July – though it was at a slower pace than in the last several months as uncertainty over economic conditions mounted.\n\nThe Labor Department on Friday reported that employersadded 73,000 jobsin July, a figure that was cooler than the 110,000 gain that was the estimate of economists polled by LSEG.\n\nTheunemployment rateticked slightly higher to 4.2%, in line with LSEG economists' estimate.\n\nJob gains in the prior two months were both revised, with job creation in May revised downward by 125,000 from a gain of 144,000 to 19,000; and June job gains were revised down by 133,000 from a gain of 147,000 to 14,000. Taken together, employment in May and June was 258,000 lower than previously reported, which the Bureau of Labor Statistics noted were \"larger than normal\" revisions.\n\nFED'S FAVORED INFLATION GAUGE SHOWS CONSUMER PRICES ROSE AGAIN IN JUNE\n\nPrivate sector payrolls rose by 83,000 in July, below the 100,000 job gain projected by LSEG.\n\nGovernment payrollsdeclined by 10,000 in July. The decrease was driven by a reduction of 12,000 jobs in the federal government, which has seen payrolls decline by 84,000 since its January peak. Employees on paid leave or receiving ongoing severance pay are counted as employed in the BLS' establishment survey.\n\nState government added 5,000 jobs and local government had employment decline by 3,000 jobs in July.\n\nThemanufacturing sectorshed 11,000 jobs in July, a steeper drop than the decline of 3,000 jobs estimated by LSEG.\n\nHealthcare employmentrose by 55,000 jobs in July, above the average monthly gain of 42,000 over the past 12 months. Most of July's gains occurred in ambulatory healthcare services (+34,000) and hospitals (+16,000).\n\nSocial assistance added 18,000 jobs last month amid continued job growth in individual and family services (+21,000).\n\nFEDERAL RESERVE HOLDS KEY INTEREST RATE STEADY FOR FIFTH STRAIGHT MEETING DESPITE TRUMP'S PRESSURE\n\nJob gains in May and June were revised downward with July's report by a combined 258,000 – which BLS called a \"larger than normal\" revision.(Yuki Iwamura/Bloomberg via Getty Images / Getty Images)\n\nThe labor force participation rate was 62.2%, having changed little from a month ago – though it has declined by 0.5 percentage point in the last year.\n\nThe number of people considered to be long-term unemployed, defined as being jobless for 27 weeks or more, increased by 179,000 to 1.8 million. The long-term unemployed accounted for 24.9% of all unemployed people in July.\n\nWorkers who were employed part-time for economic reasons changed little in July, coming in at 4.7 million. These workers would've preferred full-time jobs but were working part-time because their hours were reduced, or they were unable to find full-time jobs.\n\nMultiple jobholders decreased by 523,000 jobs in July and represented 5.1% of the labor force, the lowest level in the past year.\n\nTRUMP ESCALATES CANADA TARIFFS TO 35% WHILE SETTING NEW TARIFF RATES FOR DOZENS OF OTHER COUNTRIES\n\nThe weaker-than-expected jobs report comes amid elevated levels of economic uncertainty stemming from trade policy, including theimpact of tariffs on inflationand consumer prices. The Federal Reserve has held off on interest rate cuts again this week due to signs that tariff costs are starting to push inflation higher and further away from the central bank's 2% target rate.\n\nFed ChairJerome Powellpreviously noted that the central bank likely would've cut earlier this year but for concerns about tariffs fueling inflation and pushing consumer prices higher. On Wednesday, the June personal consumption expenditures (PCE) index, the Fed's preferred inflation gauge, showed headline PCE rose from 2.3% in May to 2.6% in June, while core PCE ticked higher to 2.8%.\n\nFederal Reserve Chairman Jerome Powell said the Federal Reserve is well-positioned to respond to rising inflation or weakness in the labor market.(Anna Moneymaker/Getty Images / Getty Images)\n\n\"What had looked like a Teflon labor market showed some scratches this morning, as tariffs continue to work their way through the economy,\" said Ellen Zentner, chief economic strategist forMorgan Stanley Wealth Management. \"A Fed that still appeared hesitant to lower rates may see a clearer path to a September cut, especially if data over the next month confirms that trend.\"\n\nAlexandra Wilson-Elizondo, global co-CIO of multi-asset solutions atGoldman Sachs Asset Management, noted that the weaker job growth in July coupled with the large revisions to the past two months' gains \"drops us below the critical 80K-100K replacement level, flashing warning signs as the labor market cools – the U.S. slowdown is starting to take shape.\"\n\n\"Importantly, the underlying deterioration is grabbing our attention: cyclical employment has flatlined while falling participation rates are somewhat masking unemployment weakness,\" she continued. \"While overall levels are not flashing red, the trend is cause for concern. This print is just one number in a week filled with important economic data releases, but the miss directly challenges the Fed's hawkish posture from this week's FOMC meeting.\"\n\nThe market's expectations surrounding a September rate cut by theFederal Reserverallied in response to the weaker-than-expected July jobs report after they were dampened by rising inflation data and the Fed's hawkish stance earlier in the week.\n\nThe probability of the Fed leaving interest rates at its current range of 4.25% to 4.5% in September fell from 62.3% a day ago to 26.4% on Friday in the wake of the jobs report, according to the CME FedWatch tool. The chance of a 25-basis-point rate cut rose from 37.7% to 73.6% as well.\n\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\n\nBy clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time."
    }
}