{
    "question": "How might the threatened $3 billion grant cut and the attempt to limit Harvard’s enrollment of foreign students over data requests shape academic freedom, student privacy, and U.S. higher education policy?",
    "content": {
        "source_1": "President Trump in Arlington, Virginia, on Monday. Photo: Kayla Bartkowski/Getty Images\n\nPresidentTrumpsaid Sunday he's considering strippingHarvard Universityof $3 billion in federal funding and redistributing it to trade schools.\n\nThe big picture:The latest threat against the Ivy League institution comes days after a federaljudge temporarily blockedthe Trump administration's efforts to ban foreign students from attending Harvard as part of a wider crackdown on colleges it considers to have liberal biases.\n\nDetails:\"I am considering taking Three Billion Dollars of Grant Money away from a very antisemitic Harvard, and giving it to TRADE SCHOOLS all across our land,\" Trumpsaidon Truth Social.\n\nGo deeper:How the Trump administration has hammered Harvard",
        "source_2": "Jesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current affairs and trending news. He has covered current affairs, healthcare, pop culture, and sports. Jesus joined Newsweek's U.S. bureau in 2024, and has previously worked for The Financial Times and served as an international reporter and newsletter editor for El Espectador in Colombia. He graduated with an M.A. in Journalism and Digital Innovation from New York University. Languages: English, Spanish. You can get in touch with Jesus by emailingj.mosquera@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nPresidentDonald Trumphas threatened to take away $3 billion in federal grants fromHarvard Universityand redirect the money to trade schools, escalating a months-long battle with the Ivy League institution.\n\n\"I am considering taking Three Billion Dollars of Grant Money away from a very antisemitic Harvard, and giving it to TRADE SCHOOLS all across our land,\" Trump posted Monday on his social media platform, Truth Social. \"What a great investment that would be for the USA, and so badly needed!!!\"\n\nNewsweekreached out to Harvard for comment on Monday.\n\nThe move is the latest in a series ofattacks by Trump and his administration against Harvard. Last week, the government barred the universityfrom enrolling foreign studentsand previouslyfroze more than $2.2 billion in federal grant moneyand $60 million in contracts.\n\nOfficials accused Harvard of ignoring demands to clamp down on student protests, overhaul diversity and governance policies, and disclose more information about international students.\n\nOn Monday morning, while many Americans were offline for Memorial Day, Trump took to social media to launch a renewed attack on Harvard.\n\nIn a follow-up to his earlier $3 billion funding threat, Trump wrote in a second post: \"We are still waiting for the Foreign Student Lists from Harvard so that we can determine... how many radicalized lunatics, troublemakers all, should not be let back into our Country.\"\n\nThe administration's campaign against Harvard began in April, when it issued a list of demands that included banning protest face coverings, auditing diversity programs and enforcing campus policiesaimed at fighting antisemitism. Harvard President Alan Garber rejected the demands, citing free speech and constitutional concerns.\n\nHarvard has since filed lawsuits in federal court, arguing that the administration's actions are unlawful and pose a serious threat to academic freedom. In court documents, the university warned that blocking foreign enrollment would have an \"immediate and devastating effect\" on more than 7,000 international students.\n\nWhile other elite institutions, including Princeton and MIT, have also been targeted, the administration has made Harvard its primary focus.\n\nTrump's push to redirect funds comes as part of his 2024 campaign messaging around \"rebuilding America\" and supporting vocational education. In a separate post, he called the trade school plan \"a great investment\" and accused Harvard of becoming \"a liberal mess.\"\n\nHarvard is well positioned to resist the administration's demands, according to former university President Larry Summers, who told students and alumni last week that the school's financial strength gives it a unique advantage.\n\nWith an endowment of $53.2 billion in 2024—the largest of any university in the country—Harvard drew $2.4 billion from it that year, covering about 37 percent of its $6.4 billion in operating expenses, according to a university financial report.\n\nPresident Donald Trump, in a post on Truth Social on Sunday:\"Nobody told us that! We want to know who those foreign students are—a reasonable request since we give Harvard BILLIONS OF DOLLARS. But Harvard isn't exactly forthcoming. We want those names and countries.\"\n\nHarvard President Alan Garber, in a post on X, formerly Twitter:\"No government—regardless of which party is in power—should dictate what private universities can teach, whom they can admit and hire, or which areas of study and inquiry they can pursue.\"\n\nIndependent Senator Bernie Sanders of Vermont, in a post on X on Monday:\"Congratulations to Harvard for refusing to relinquish its constitutional rights to Trump's authoritarianism. Other universities should follow their lead. And instead of doing pro bono work for Trump, cowardly law firms should be defending those who believe in the rule of law.\"\n\nA federal judge has temporarily blocked the administration's ban on foreign student enrollment at Harvard, while other legal battles are underway. If Trump follows through on his $3 billion threat, it will likely face additional challenges in court.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nJesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current affairs and trending news. He has covered current affairs, healthcare, pop culture, and sports. Jesus joined Newsweek's U.S. bureau in 2024, and has previously worked for The Financial Times and served as an international reporter and newsletter editor for El Espectador in Colombia. He graduated with an M.A. in Journalism and Digital Innovation from New York University. Languages: English, Spanish. You can get in touch with Jesus by emailingj.mosquera@newsweek.com\n\nJesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current affairs and trending news. He has covered current affairs, healthcare, pop culture, and sports. Jesus joined Newsweek's U.S. bureau in 2024, and has previously worked for The Financial Times and served as an international reporter and newsletter editor for El Espectador in Colombia. He graduated with an M.A. in Journalism and Digital Innovation from New York University. Languages: English, Spanish. You can get in touch with Jesus by emailingj.mosquera@newsweek.com\n\nJesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current                                    ...Read more",
        "source_3": "'OutKick' founder Clay Travis and political strategist Lucy Caldwell react to President Donald Trump's move to ban foreign students from attending Harvard.\n\nPresidentDonald Trumphas accused Harvard University of being \"very slow\" to turn over information on foreign students.\n\n\"We are still waiting for the Foreign Student Lists from Harvard so that we can determine, after a ridiculous expenditure of BILLIONS OF DOLLARS, how many radicalized lunatics, troublemakers all, should not be let back into our Country,\" Trump wrote on Truth Social Monday.\n\n\"Harvard is very slow in the presentation of these documents, and probably for good reason!\" Trump wrote. \"The best thing Harvard has going for it is that they have shopped around and found the absolute best Judge (for them!) - But have no fear, the Government will, in the end, WIN!\"\n\nJUDGE TEMPORARILY PAUSES TRUMP MOVE TO CANCEL HARVARD STUDENT VISA POLICY AFTER LAWSUIT\n\nPresident Donald Trump arrives for a House Republican meeting at the U.S. Capitol on May 20, 2025 in Washington, D.C.(Tasos Katopodis/Getty Images)\n\nIn a separate post, Trump added Monday, \"I am considering taking Three Billion Dollars of Grant Money away from a very antisemitic Harvard, and giving it to TRADE SCHOOLS all across our land.\"\n\n\"What a great investment that would be for the USA, and so badly needed!!!\" he wrote.\n\nFox News Digital reached out to Harvard for comment.\n\nJudge Allison D. Burroughs – who was appointed by former PresidentBarack Obama– granted Harvard University a temporary restraining order on Friday, preventing the government from revoking the Ivy League school's certification in the Student and Exchange Visitor Program. The program permits the university to host international students with F-1 or J-1 visas to study in the U.S.\n\nIn a letter Thursday,Department of Homeland SecuritySecretary Kristi Noem informed Harvard's leadership that the university had lost its \"privilege\" of enrolling foreign students as a result of the institution's \"refusal to comply with multiple requests to provide the Department of Homeland Security with pertinent information while perpetuating an unsafe campus environment that is hostile to Jewish students, promotes pro-Hamas sympathies, and employs racist ‘diversity, equity and inclusion' policies.\"\n\n\"This action should not surprise you and is the unfortunate result of Harvard’s failure to comply with simple reporting requirements,\" Noem wrote.\n\nAnti-Israel protesters gather outside Harvard University in Cambridge, Massachusetts, on April 25, 2025.(JOSEPH PREZIOSO/AFP via Getty Images)\n\nNoem said she requested records pertaining to \"nonimmigrant students\" enrolled at Harvard, \"including information regarding misconduct and other offenses that would render foreign students inadmissible or removable,\" on April 16.\n\nHarvard’s counsel responded twice, but both responses were insufficient, according to the letter.\n\nTRUMP SAYS HARVARD'S FOREIGN STUDENTS ARE FROM COUNTRIES PAYING 'NOTHING' FOR THEIR EDUCATION\n\n\"Consequences must follow to send a clear signal to Harvard and all universities that want to enjoy the privilege of enrolling foreign students, that the Trump administration will enforce the law and root out the evils of anti-Americanism and antisemitism in society and campuses,\" Noem wrote.\n\nThe requested records include any and all audio or video footage in Harvard’s possession regarding threats to other students or university personnel, \"deprivation of rights\" of other classmates or university personnel, and \"dangerous or violent activity, whether on or off campus\" by a nonimmigrant student enrolled at Harvard in the last five years. Noem is also asking for any and all disciplinary records and audio or video footage of any protest activity involving nonimmigrant students.\n\nA pedestrian with an umbrella walks by Harvard Yard in Cambridge, Massachusetts, on May 22, 2025.(Danielle Parhizkaran/The Boston Globe via Getty Images)\n\nThe letter gave Harvard another 72 hours to comply and send the requested information in order to regain its certification, but instead, Harvard filed the lawsuit in U.S. District Court in Massachusetts early Friday.\n\nIn its court filing, Harvard said the revocation impacts more than 7,000 visa holders – more than a quarter of its student body – and \"is a blatant violation of the First Amendment, the Due Process Clause, and the Administrative Procedure Act.\"\n\n\"It is the latest act by the government in clear retaliation for Harvard exercising its First Amendment rights to reject the government’s demands to control Harvard’s governance, curriculum, and the ‘ideology’ of its faculty and students,\" the lawsuit says.\n\nBurroughs set another hearing on the matter for Tuesday at 9:30 a.m. in Boston federal court.\n\nDanielle Wallace is a breaking news and politics reporter at Fox News Digital. Story tips can be sent to danielle.wallace@fox.com and on X:@danimwallace.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}