{
    "question": "In what ways should the strike that killed nine of Dr. Alaa al-Najjar’s children—amid Israel’s claim it targeted suspects near its troops after evacuations—shape interpretations of responsibility and the adequacy of precautions to protect civilians in Khan Younis?",
    "content": {
        "source_1": "Dr Alaa al-Najjar was at work when Israeli strike destroyed her home, leaving one son and her husband as survivors\n\nIn the early hours of Friday, as she did every day, Dr Alaa al-Najjar said goodbye to her 10 children before leaving the house. The youngest, Sayden, six months old, was still sleeping. And like every day, with war raging in Gaza and Israeli strikes landing just metres from her neighbourhood in Khan Younis, Najjar worried about leaving them at home without her.\n\nBut Najjar, 35, had little choice. One of Gaza’s dwindling number of medics, a respected paediatrician at the Nasser medical complex, she had to go to work to care for injured babies who had barely survived Israeli attacks. She could never have imagined that that farewell to her family would be her last.\n\nA few hours later, the charred bodies of seven of her children, killed by an Israeli airstrike on Khan Younis, arrived at her hospital. Two other bodies, including Sayden’s, remained under the rubble. Of her 10 children,only one had survived, along with their father, Hamdi al-Najjar, 40, also a doctor. Both are now in hospital.\n\n“It’s one of the most heartbreaking tragedies since the beginning of the conflict,” Mohammed Saqer, the head of nursing at Nasser hospital, said. “And it happened to a paediatrician who dedicated her life to saving children, only to have her own motherhood stolen in a moment of fire and deafening silence.”\n\nFootage shared by the director of Gaza’s health ministry and verified by the Guardian shows the burnt, dismembered bodies of children being pulled from the rubble of Najjar’s building near a petrol station as flames still engulfed what remained of the family’s home.\n\nAli al-Najjar, 50, the older brother of Hamdi, Alaa’s husband, said: “When I heard the house was bombed, I instinctively rushed to my car and headed to the place as I knew my brother and his children were inside. When I arrived, I was shocked. I found my nephew Adam, who survived, lying on the road under the rubble. He was covered in soot, his clothes were almost torn, but his soul was still inside him. My brother was lying on the other side, bleeding heavily from his head and chest, and his arm was cut off. He was still breathing with difficulty.”\n\nAli called the medical team and took the two survivors to the hospital. Then he began searching for his nine missing nieces and nephews.\n\n“The house was very difficult to clear because the ceiling was stacked on top of itself. I started searching around the house hoping to find any of the children because I assumed the bombing might have thrown them outside the house,” he said. “But then, sadly, the first burnt body appeared. After completely putting out the fire, we found the rest of them – some were mutilated and all were burnt.”\n\nAlaa al-Najjar rushed to the site of the explosion as rescuers pulled the body of her daughter Revan from the rubble. In tears, she begged the rescuers to let her hold her one last time.\n\n“Her [Revan’s] body was completely burnt from the upper part, nothing remained of her skin or flesh,” Ali said. “There are still two bodies of my brother’s children we could not find: the oldest, 12-year-old boy, Yahya, and the six-month-old girl, Sayden.”\n\nNajjar returned to the hospital to check on her son Adam, 11, and her husband. Sources at the Nasser hospital who transferred the children’s bodies one by one to the morgue said their mother was not able to identify them, so bad were the burns.\n\nThe children’s names were Yahya, Rakan, Ruslan, Jubran, Eve, Revan, Sayden, Luqman and Sidra.\n\n“Alaa went to the morgue, held her children in her arms, recited the Qur’an over them and prayed for them,” said Dr Ahmed al-Farra, 53, the director of the children’s building at the Nasser medical complex. “Other female doctors around her collapsed from grief and rage, but Dr Alaa remained composed. God sent peace upon her heart. After they were buried, she went directly to check on her husband and son and began caring for them.”\n\nColleagues at the hospital described Najjar as a committed, polite and ethical doctor, capable of enduring immense pressure, treating dozens of children and patients daily, and at the same time caring for a large family.\n\n“She was in constant worry for her children when she was at the hospital. When she heard a house had been bombed in the Qizan al-Najjar neighbourhood, her mother’s heart sensed something was wrong,” Farra said.\n\nHe said there were no words for her loss. “If anyone wants to share an opinion, let them first imagine it happening to them – to suddenly lose every person connected to you.”\n\nAfter saying goodbye for the last time to the lifeless bodies of her seven children, Alaa went to the ward where her surviving child was being treated.\n\n“Her husband was suffering from severe injuries – brain damage and fractures caused by shrapnel, along with shrapnel wounds and fractures in the chest. He was placed on a ventilator and fitted with medical tubes,” Farra said. ‘‘Her son’s condition was relatively better – his injuries ranged from moderate to severe.”\n\nNajjar’s colleagues and friends said her children held Egyptian citizenship and that Alaa and Hamdi had been planning to leave for Egypt and enrol their children in Cairo’s Al-Azhar University.\n\nThe Israel Defense Forces said: “Yesterday, an IDF aircraft struck a number of suspects who were identified operating from a structure adjacent to IDF troops in the area of Khan Younis. The Khan Younis area is a dangerous war zone. Before beginning operations there, the IDF evacuated civilians from this area for their own safety. The claim regarding harm to uninvolved civilians is under review.”\n\nThe Gaza health ministry says nearly 54,000 Palestinians, including 16,503 children, have been killed in Israeli attacks across the territory.\n\nFarra said: “My only hope is that those who were killed are not just names on paper. We were created just like every other human being in this world. And like every other human, we have the right to live.”",
        "source_2": "An Israeli air strike on Gaza hit the home of a doctor and killed nine of her 10 children, the hospital where she works in the city of Khan Younis says.\n\nNasser hospital said one of Dr Alaa al-Najjar's children and her husband were injured, but survived.\n\nGraeme Groom, a British surgeon working in the hospital who operated on her surviving 11-year-old boy, told the BBC it was \"unbearably cruel\" that his mother, who spent years caring for children as a paediatrician, could lose almost all her own in a single missile strike.\n\nIsrael's military said its aircraft had struck \"a number of suspects\" in Khan Younis on Friday, and \"the claim regarding harm to uninvolved civilians is under review\".\n\nA video shared by the director of the Hamas-run health ministry and verified by the BBC showed small burned bodies lifted from the rubble of a strike in Khan Younis.\n\nThe Israel Defense Forces (IDF) said its \"aircraft struck a number of suspects who were identified operating from a structure adjacent to IDF troops in the area of Khan Younis\".\n\n\"The Khan Younis area is a dangerous war zone. Before beginning operations there, the IDF evacuated civilians from this area for their own safety,\" the Israeli military said.\n\nIn a general statement on Saturday, the IDF said it had struck more than 100 targets across Gaza over the past day.\n\nThe health ministry said at least 74 people had been killed by the Israeli military over the 24 hour-period leading up to about midday on Saturday.\n\nDr Muneer Alboursh, director of the health ministry, said on X that the al-Najjars' family house was hit minutes after Dr al-Najjar's husband Hamdi had returned home after driving his wife to work.\n\nDr Alboursh said the eldest of Dr al-Najjar's children was aged 12.\n\nMr Groom said the children's father was \"very badly injured\", in a videoposted on the Instagram accountof another British surgeon working at Nasser hospital, Victoria Rose.\n\nHe told the BBC that the father had a \"penetrating injury to his head\".\n\nHe said he had asked about the father, also a doctor at the hospital, and had been told he had \"no political and no military connections and doesn't seem to be prominent on social media\".\n\nHe described it as an \"unimaginable\" situation for Dr Alaa al-Najjar.\n\nMr Groom said the surviving 11-year-old boy, Adam, was \"quite small\" for his age.\n\n\"His left arm was just about hanging off, he was covered in fragment injuries and he had several substantial lacerations,\" he told the BBC.\n\n\"Since both his parents are doctors, he seemed to be among the privileged group within Gaza, but as we lifted him onto the operating table, he felt much younger than 11.\"\n\n\"Our little boy could survive, but we don't know about his father,\" he added.\n\nMahmoud Basal, spokesman for Gaza's Hamas-run Civil Defence agency, said on Telegram on Friday afternoon that his teams had recovered eight bodies and several injured from the al-Najjar house near a petrol station in Khan Younis.\n\nThe hospital initially posted on Facebook that eight children had been killed, then two hours later updated that number to nine.\n\nAnother doctor, Youssef Abu al-Rish, said in a statement posted by the health ministry that he had arrived to the operating room to find Dr al-Najjar waiting for information about her surviving son and tried to console her.\n\nIn an interview recorded by AFP news agency, relative Youssef al-Najjar said: \"Enough! Have mercy on us! We plead to all countries, the international community, the people, Hamas, and all factions to have mercy on us.\n\n\"We are exhausted from the displacement and the hunger, enough!\"\n\nOn Friday, UN Secretary-General António Guterres warned that people in Gaza were enduring what may be \"the cruellest phase\" of the war, and denounced Israel's blockade on humanitarian aid imposed in March.\n\nIsrael partially lifted the blockade earlier this week. Israeli military body Cogat said 83 more trucks carrying flour, food, medical equipment pharmaceutical drugs entered Gaza on Friday.\n\nThe UN has repeatedly said the amount of aid entering is nowhere near enough for the territory's 2.1 million people - saying between 500 to 600 trucks a day are needed - and has called for Israel to allow in much more.\n\nThe limited amount of food that trickled into Gaza this week sparked chaotic scenes, with armed looters attacking an aid convoy and Palestinians crowding outside bakeries in a desperate attempt to obtain bread.\n\nA UN-backed assessment this month said Gaza's population was at \"critical risk\" of famine.\n\nPeople in Gaza have told the BBC they have no food, and malnourished mothers are unable to breastfeed babies.\n\nChronic shortages of water are also worsening as desalination and hygiene plants are running out of fuel, and Israel's expanding military offensive causes new waves of displacement.\n\nIsrael has said the blockade was intended to put pressure on Hamas to release the hostages still held in Gaza.\n\nIsrael has accused Hamas of stealing supplies, which the group has denied.\n\nIsrael launched a military campaign in Gaza in response to Hamas's cross-border attack on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.\n\nAt least 53,901 people, including at least 16,500 children, have been killed in Gaza since then, according to the territory's health ministry.\n\nAdditional reporting by David Gritten and Jaroslav Lukiv\n\nIsrael said it targeted well known reporter Anas al-Sharif and alleged he was part of Hamas, which Al Jazeera has denied.\n\nPrime Minister Sir Keir Starmer has announced that the UK will recognise a Palestinian state in September unless Israel meets certain conditions.\n\nIt follows similar moves by the UK, France and Canada.\n\nIn the shadow of the Gaza war, violence is rising in the occupied territories as radical settlers seize land with the backing of the government.\n\nIsrael's Prime Minister also claimed Israeli hostages held in Gaza were \"the only ones being deliberately starved\".",
        "source_3": "Published:21:06, 25 May 2025|Updated:01:47, 26 May 2025\n\nA doctor whose nine children were killed in anIsraeliair strike inGazaremains in a critical condition.\n\nHamdi al-Najjar was injured by the strike on Friday and sustained significant injuries to his brain, lungs, right arm and kidney.\n\nThe attack in the southern city of Khan Yunis has left him critical, Dr Milena Angelova-Cheetold theBBC.\n\nThe Bulgarian doctor working at Nasser hospital added on Sunday that his life 'remains in danger'.\n\nHis wife, Alaa Najjar a Palestinian paediatrician at Nasser Hospital, was working when she learned her family home was on fire after the attack.\n\nIt killed nine of the couple's 10 children - Yahya, Rakan, Raslan, Gebran, Eve, Rival, Sayden, Luqman and Sidra - who were aged between seven months and 12 years old, according to the region's civil defence agency.\n\nTheir only surviving child, an 11-year-old boy called Adam, was critically injured but according to Dr Angelova-Chee is doing 'reasonably well'.\n\nTahani Yahya al-Najjar, al-Najjar's sister said: 'She went to her house and saw her children burned, may God help her.'\n\nThe Israeli military said it struck suspects operating from a structure next to its forces, and described the area of Khan Younis as a 'dangerous war zone'.\n\nPictured: Alaa Najjar a Palestian paediatrician visiting her husband in the intensive care unit at Nasser Hospital\n\nPictured: The couple's only surviving child, an 11-year-old boy called Adam who was critically injured\n\nAlaa Najjar a Palestinian paediatrician at Nasser Hospital, was working when she learned her family home was on fire after the attack\n\nHamdi al-Najjar was injured by the strike on Friday and sustained significant injuries to his brain, lungs, right arm and kidney\n\nBut most of Gaza's two million population has beensqueezed into an ever narrowing zone on the coast and in the area around Khan Younis by Israel's military operation.\n\nAbout 81 per cent of the territory is now either subject to Israeli evacuation orders or located in militarised \"no-go\" zones, according to the UN.\n\nIt said it had evacuated civilians from the area, and 'the claim regarding harm to uninvolved civilians is under review.'\n\nOn Friday, the Israeli military said it had conducted more strikes in Gaza overnight,hitting 75 targets including weapons storage facilities and rocket launchers.\n\nThe strikes follow an 11-week blockade on food, fuel, water and medicine, which has pushed the decimated civilian population of Gaza to the brink of famine, expertscontinue to warn.\n\nThe Israeli military said 107 trucks carrying flour and other foodstuffs as well as medical supplies entered the Gaza Strip from the Kerem Shalom crossing point on Thursday.\n\nBut getting the supplies to people sheltering in tents and other makeshift accommodation has been fitful and U.N. officials say at least 500 to 600 trucks of aid are needed every day.\n\nIsrael imposed the blockade in early March, accusing Hamas of stealing aid meant for civilians. Hamas rejects the charge, saying a number of its own fighters have been killed protecting the trucks from armed looters.\n\nMost of Gaza's two million population has been squeezed into an ever narrowing zone on the coast and in the area around Khan Younis by Israel's military operation\n\nOn Friday, the Israeli military said it had conducted more strikes in Gaza overnight, hitting 75 targets including weapons storage facilities and rocket launchers\n\nThe strikes follow an 11-week blockade on food, fuel, water and medicine, which has pushed the decimated civilian population of Gaza to the brink of famine, experts continue to warn\n\nIt has announced that a new system, sponsored by the United States and run by private contractors, will soon begin operations from four distribution centres in the south of Gaza, but many details of how the system will work remain unclear.\n\nThe U.N. has already said it will not work with the new system, which it says will leave aid distribution conditional on Israel's political and military aims.\n\nIsrael has maintained a presence in Gaza since the Hamas-led massacre of October 7, 2023, which saw gunmen storm into southern Israel andkill some 1,200 people, mostly civilians, and seize 251 hostages.\n\nIt's subsequent ground and air war has left Gaza in ruin,displacing nearly all its residents and killing more than 53,000 people,many of them civilians, according to Gaza health authorities.\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nBy posting your comment you agree to ourhouse rules.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with ourPrivacy Policy."
    }
}