{
    "question": "How might Trump’s public characterization of Putin, his criticism of Zelenskyy, and talk of additional sanctions influence U.S. policy and the prospects for de-escalation or negotiations following the weekend’s strikes and the prisoner exchange?",
    "content": {
        "source_1": "At least six people die in what Kyiv claims is largest drone attack since Moscow launched full-scale invasion in February 2022\n\nMoscow has launched its third consecutive night of massive drone strikes against Ukraine, killing at least six people, as Donald Trump broke his silence to suggest the Russian leader,Vladimir Putin, had “gone crazy”.\n\nOvernight on Monday, Russia fired a record 355 Shahed drones as well as nine cruise missiles, in an escalating dronecampaign targeting Ukraine’s cities and communities, with Ukraine’s air force spokesperson, Yuriy Ignat, confirming it was the largest drone attack since Moscow launched its full-scale invasion in February 2022.\n\nWhile the US president railed against Putin, saying he had“gone absolutely CRAZY”, he also criticised the Ukrainian president, Volodymyr Zelenskyy, for calling out US inaction against Russia.\n\n“Something has happened to [Putin]. He has gone absolutely CRAZY!” Trump said of the Russian president on Truth Social. “I’ve always said that he wants ALL of Ukraine, not just a piece of it, and maybe that’s proving to be right, but if he does, it will lead to the downfall of Russia!”\n\nTrump also posted that the Ukrainian leader “is doing his Country no favours by talking the way he does. Everything out of his mouth causes problems, I don’t like it, and it better stop.”\n\nZelenskyy, however, doubled down on his criticism on Monday. “Only a sense of total impunity can allow Russia to carry out such strikes and continue increasing their scale,” Zelensky said on social media, adding: “The increase in Russian strikes should be met with increased sanctions.”\n\nWhile Trump had suggested earlier, speaking to reporters, that he may be considering new sanctions, there was no indication on Monday morning of any meaningful US action against Moscow.\n\nThe sheer scale of Putin’s defiance of Trump following last Monday’s call between the two leaders has imploded the US president’s ill-defined strategy for ending the war in Ukraine, which Trump had promised to do within 24 hours upon taking office.\n\nThe French president, Emmanuel Macron, said Trump realised Putin had lied to him and he hoped his anger “translates into action”, calling for a deadline to be set for Moscow to agree to a Ukraine ceasefire, backed up by the threat of “massive sanctions”.\n\nBut with Trump so far rejecting European calls for toughening sanctions against Russia, and pressure for an immediate 30 ceasefire, Putin has called Washington’s bluff to press ahead with its war on Ukraine.\n\nThe Kremlin on Monday sought to downplay Trump’s remarks, attributing them to “emotional overload”, while adding that Moscow was “very grateful” to the US president for his continued engagement in peace talks.\n\n“This is a very crucial moment, which is naturally accompanied by emotional overload on all sides and emotional reactions,” the Kremlin spokesperson Dmitry Peskov told reporters in Moscow.\n\nTrump’s comments place Putin in an awkward position. The Russian president has been walking a delicate line – appearing to back peace talks to remain in Trump’s good graces, while pushing for terms that would amount to Ukraine’s de facto surrender.\n\nRussian state media largely ignored Trump’s description of Putin as “crazy”, instead selectively highlighting his criticism of Zelenskyy.\n\nRussia began escalating aerial assault on Ukraine’s cities on Friday launching a series of nightly strikes involving hundreds of drones that have sent Ukrainians to air raid shelters, basements and metro stations.\n\nThe attacks overnight into Monday morning came after what had been the biggest aerial assault of the war, when Russia pummelled Ukrainian cities and other targets with at least 367 drones and missiles overnight on Sunday, killing at least 12 people, including three children, in the northern region of Zhytomyr.\n\nRussia has massively scaled up its domestic production of drones such as the Shahed, meaning it is no longer reliant upon Iran for its supply as it was when the weapons were first deployed even as it has developed sophisticated new tactics for their use, making them an increasingly potent weapon.\n\nAnalysts are split, however, whether the heavy bombing of Ukrainian cities is a tactic in its own right, to demoralise the Ukrainian home front, or is part of a wider push on the battlefield going into the summer amid Ukrainian and western intelligence assessments that Russia intends to continue fighting through this year.\n\nOn Sunday, Zelenskyy condemned “the silence of America” after Russia carried out its largest air raid in three years of war, with a second straight night of massive drone and ballistic missile strikes.\n\n“Every such terrorist Russian strike is reason enough for new sanctions against Russia,” Ukraine’s president said.\n\nDuring his campaign for the presidency, Trump claimed repeatedly that, if elected, he would end the war in Ukraine in 24 hours, even before being inaugurated.\n\nHowever, the intensity and frequency of this weekend’s strikes contrasted sharply with Trump’s claim that Vladimir Putin was interested in peace.\n\nThe attacks meant Kyiv Day – celebrated on the last Sunday in May – began as exhausted people sheltered in bunkers, metro stations and basements.\n\nZelenskyy’s chief of staff, Andriy Yermak, wrote on Telegram: “Without pressure, nothing will change and Russia and its allies will only build up forces for such murders in western countries. Moscow will fight as long as it has the ability to produce weapons.”",
        "source_2": "Reporting by Guy Faulconbridge and Dmitry Antonov in Moscow, Tom Balmforth and Yulia Dysa in Kyiv and Jeff Mason and Steve Holland in Morristown, New Jersey; Editing by Toby Chopra, Gareth Jones, Aidan Lewis, Ron Popeski and Rod Nickel\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nJeff Mason is a White House Correspondent for Reuters. He has covered the presidencies of Barack Obama, Donald Trump and Joe Biden and the presidential campaigns of Biden, Trump, Obama, Hillary Clinton and John McCain. He served as president of the White House Correspondents’ Association in 2016-2017, leading the press corps in advocating for press freedom in the early days of the Trump administration. His and the WHCA's work was recognized with Deutsche Welle's \"Freedom of Speech Award.\" Jeff has asked pointed questions of domestic and foreign leaders, including Russian President Vladimir Putin and North Korea's Kim Jong Un. He is a winner of the WHCA's “Excellence in Presidential News Coverage Under Deadline Pressure\" award and co-winner of the Association for Business Journalists' \"Breaking News\" award. Jeff began his career in Frankfurt, Germany as a business reporter before being posted to Brussels, Belgium, where he covered the European Union. Jeff appears regularly on television and radio and teaches political journalism at Georgetown University. He is a graduate of Northwestern University's Medill School of Journalism and a former Fulbright scholar.\n\nAs Moscow bureau chief, Guy runs coverage of Russia and the Commonwealth of Independent States. Before Moscow, Guy ran Brexit coverage as London bureau chief (2012-2022). On the night of Brexit, his team delivered one of Reuters historic wins - reporting news of Brexit first to the world and the financial markets. Guy graduated from the London School of Economics and started his career as an intern at Bloomberg. He has spent over 14 years covering the former Soviet Union. He speaks fluent Russian.",
        "source_3": "US President Donald Trump has reacted to Russia’s overnight missile raids on Ukraine by insisting that his Russian counterpart Vladimir Putin had“gone absolutely crazy for no reason,”despite a week of constant Ukrainian drone raids across Russia involving several hundred UAVs.\n\nUkraine significantly intensified its drone attacks inside Russia last week, with at least 764 drones intercepted over Russian territory from Tuesday to Friday, and hundreds more destroyed over the weekend. A helicopter carrying Russian President Vladimir Putin was reportedlycaught in the“epicenter”of a massive drone raid while he was visiting Kursk Region on Tuesday.\n\nIn response, the Russian military conducted amajor strikeagainst a drone and missile production plant in Kiev on Saturday, followed by additional reported strikes on Ukrainian military facilities on Sunday.\n\nSpeaking to journalists on Sunday, Trump claimed Russia’s response was unwarranted and said he was“surprised”by what he is seeing.\n\n“I’m not happy with what Putin’s doing,”he said.“We’re in the middle of talking and he’s shooting rockets into Kiev and other cities. I don’t like it at all… We’ll see what I’m going to do.”\n\n“I’ve always had a very good relationship with Vladimir Putin of Russia, but something has happened to him. He has gone absolutely CRAZY!”Trump added in a post on Truth Social, claiming that“missiles and drones are being shot into cities in Ukraine for no reason whatsoever.”\n\nTrump also criticized Ukraine’s Vladimir Zelensky, in an apparent reference to his remarks about Washington’s“silence”in response to the latest Russian attacks.\n\n“Likewise, President Zelensky is doing his country no favors by talking the way he does. Everything out of his mouth causes problems. I don’t like it, and it better stop,”the US leader stated, reiterating that the Ukraine conflict is“not his war.”\n\nThe Russian Foreign Ministry suggested that the spike in UAV incursions is an attempt to derail the US-brokered peace talks between Moscow and Kiev, while Foreign Minister Sergey Lavrov said that“some European nations led by the UK, France, Germany, and the EU leadership,”who are supporting Kiev and want the conflict to continue, bear some responsibility for the drone raids.\n\nMeanwhile, Russia and Ukraine have completed a record prisoner exchange, which was agreed to during direct talks in Türkiye earlier this month. Lavrov earlier stated that the sides will exchange draft ceasefire proposals once the swap is complete.\n\n© Autonomous Nonprofit Organization “TV-Novosti”, 2005–2025. All rights reserved.\n\nThis website uses cookies. Read RTPrivacy policyto find out more."
    }
}