{
    "question": "How might the DOJ’s non-prosecution agreement with Boeing—requiring an admission of obstructing the FAA and over $1.1 billion in penalties while avoiding trial—affect perceptions of accountability, justice for victims, and future aviation safety oversight?",
    "content": {
        "source_1": "The U.S. Justice Department said Friday that it has reached a deal withBoeingthat will allow the aircraft maker to avoid prosecution over two crashes of its737 Maxplanes that killed 346 people.\n\nThe non-prosecutionagreementwould allow Boeing, a major military contractor and top U.S.exporter, to avoid being labeled a felon. The decision means Boeing won't face trial as scheduled next month, as crash victims' family members have urged for years.\n\nThe Department of Justice met with crash victims' family members last week to discuss the potential deal.\n\nIn a court filing Friday the DOJ said it \"is the Government's judgment that the Agreement is a fair and just resolution that serves the public interest.\"\n\nThe agreement \"guarantees further accountability and substantial benefits from Boeing immediately, while avoiding the uncertainty and litigation risk presented by proceeding to trial.\"\n\nThe DOJ said it intends to file a motion to dismiss the case once the \"agreement in principle\" is finalized, by no later than the end of next week.\n\nUnder the agreement, Boeing will have to \"pay or invest\" more than $1.1 billion, the DOJ said in its filing in federal court in Texas on Friday. That amount includes a $487.2 million criminal fine, though $243.6 million it already paid in an earlier agreement would be credited. It also includes $444.5 million for a new fund for crash victims, and $445 million more on compliance, safety and quality programs.\n\nThe company has been trying for years to put the two crashes of its best-selling Max planes — aLion Air flightin October 2018 and anEthiopian Airlines flightless than five months later — behind it. The Maxes weregroundedworldwide for nearly two years after the second crash, a pause that gave rival Airbus a head start in recovering from the Covid pandemic.\n\nBut families of the crash victims have criticized previous agreements as sweetheart deals for Boeing, called for more accountability from the company and said its executives should stand trial. In 2022, a former chief technical pilot for Boeing wasacquittedon fraud charges tied to the Max's development.\n\nSeveral of the victims' family members issued a statement through their lawyer shortly after the court filing was released criticizing the deal and saying it set a troubling precedent for other large companies.\n\n\"This kind of non-prosecution deal is unprecedented and obviously wrong for the deadliest corporate crime in U.S. history. My families will object and hope to convince the court to reject it,\" said the families' lawyer, Paul Cassell.\n\nThe Justice Department said relatives of more than 110 crash victims told the government they support the non-prosecution agreement or \"support the Department's efforts to resolve the case pre-trial more generally,\" but added that others said they want the U.S. to take Boeing to trial and that they would litigate to dismiss the deal.\n\nThe aerospace giant reached asettlementin 2021 in thefinal daysof the first Trump administration that shielded it from prosecution for three years.\n\nUnder that deal, Boeing agreed to pay a $2.51 billion fine to avoid prosecution. That included a $243.6 million criminal penalty, a $500 million fund for crash victims' family members and $1.77 billion for its airline customers. The new fund will be on top of the $500 million that was already established.\n\nThat 2021 settlement was set to expire two days after adoor panelblew out of a nearly new 737 Max 9 operated byAlaska Airlineson Jan. 5, 2024, after the aircraft left Boeing's factory without key bolts installed.\n\nBut last year, U.S. prosecutors said Boeing violated the 2021 settlement, accusing the company of failing to set up and enforce a compliance and ethics program to detect violations of U.S. fraud laws.\n\nLast July, toward the end of the Biden administration, Boeingagreed to plead guiltyto the criminal fraud charge in a new settlement. A federal judge later rejected the plea deal, citingconcernswith diversity, equity and inclusion requirements for choosing a corporate monitor.\n\nUnder that 2024 deal, Boeing would have faced a fine of up to $487.2 million, though the Justice Department recommended that the court credit Boeing with half that amount it paid under the previous agreement.\n\nThe U.S. had accused Boeing of conspiracy to defraud the government bymisleading regulatorsabout its inclusion of a flight-control system on the Max that was later implicated in the twocrashes.\n\n\"Boeing's employees chose the path of profit over candor by concealing material information from the FAA concerning the operation of its 737 Max airplane and engaging in an effort to cover up their deception,\" then-acting Assistant Attorney General David Burns of the Justice Department's Criminal Division said at the time of the 2021 deferred prosecution agreement.\n\nMessages revealed in an investigation into the Max's development showed the former top Boeing pilot who was found not guilty of fraud in 2022, Mark Forkner, told the FAA to delete the flight-control system known as MCAS from manuals and, in a separate email, he boasted about \"jedi-mind tricking\" regulators into approving the training material.\n\nLawyers for victims' family members railed against last year's preliminary plea deal, equating it to a slap on the wrist for the corporate giant, which recently won acontractworth billions to build the next-generation fighter jet and works on other military programs including outfitting two newpresidential jets.\n\nGot a confidential news tip? We want to hear from you.\n\nSign up for free newsletters and get more CNBC delivered to your inbox\n\nGet this delivered to your inbox, and more info about our products and services.\n\n©2025CNBC LLC. All Rights Reserved.A Division of NBCUniversal\n\nData is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.",
        "source_2": "Boeing is set to enter into a non-prosecution agreement in the fatal crashes of two 737 Max aircraft that killed hundreds, the US Department of Justice said.\n\nAs part of the deal, Boeing will avoid an upcoming fraud trial that could have resulted in the US aviation giant and defence contractor being labelled a felon. The deal includes the company admitting to obstructing federal aviation officials and paying $1.1 billion in fines.\n\nThe two crashes, in 2018 and 2019, left 346 people dead.\n\nThe government said it had conferred with families of crash victims, and said many either supported or did not oppose the deal. But family members of some of the victims have strongly criticised the agreement.\n\nJavier de Luis, whose sister was killed in the 2019 crash in Ethiopia, expressed his outrage over the decision in a statement released by the lawyers for plaintiffs suing Boeing.\n\n\"The message sent by this action to companies around the country is, don't worry about making your products safe for your customers. Even if you kill them, just pay a small fine and move on,\" he said.\n\nPaul Cassell, a lawyer representing the relatives of the victims, said the families hope to convince the court to reject the deal.\n\n\"This kind of non-prosecution deal is unprecedented and obviously wrong for the deadliest corporate crime in US history,\" he said.\n\nBoeing told the BBC on Friday evening that it had no comment. The US Department of Justice would not comment.\n\nIn a court filing on Friday, the Justice Department said Boeing would admit to \"conspiracy to obstruct and impede\" an investigation by the US Federal Aviation Administration (FAA) and to pay more than $1.1 billion in fines.\n\nBoeing will also have to continue making improvements to its anti-fraud compliance and ethics program.\n\nBoeing's 737 Max models were grounded globally for almost two years after the  2019 crash of a Ethiopian Airlines flight outside of Addis Ababa. All 157 people on-board were killed.\n\nFive months before that, a 737 Max operated by Lion Air crashed into the Java Sea shortly after take-off from Jakarta, Indonesia. 189 people aboard were killed.\n\nBoth crashes were linked to faulty flight control systems.\n\nThe crashes led to fraud charges against a former top Boeing pilot who was acquitted in 2022.\n\nIn 2021, in the closing days of the first Trump presidency, Boeing reached a settlement with prosecutors that protected it from prosecution for three years.\n\nFederal prosecutors said Boeing violated that deal by failing to create and follow a compliance and ethics program aimed at detecting violations of US laws.\n\nA door panel flew off a 737 Max 9 operated by Alaska Airlines two days before the agreement had been set to expire.\n\nLast year, Boeing agreed to plead guilty to criminal fraud in a settlement to avoid trials, but the agreement was rejected by a federal judge who cited concerns that race-based considerations under Biden -era DEI policies would be used in selecting an independent monitor in charge of overseeing Boeing's compliance.\n\nThe Justice Department is expected to file a motion to dismiss the case by late next week once the agreement is finalized.\n\n\"The Agreement guarantees further accountability and substantial benefits from Boeing immediately, while avoiding the uncertainty and litigation risk presented by proceeding to trial,\" the Justice Department stated in court papers.\n\nMany victims' families have long pushed for a public trial and prosecution of former Boeing officials, and they have opposed attempts to drop the criminal case.\n\n\"It's a sweetheart deal,\" says Robert Clifford, a lawyer representing relatives of crash victims.\n\nCatherine Berthet, of France, whose 28-year-old daughter died in the Ethiopian Airlines crash said she was \"absolutely stunned\" by the DOJ's decision to grant Boeing a non-prosecution agreement.\n\n\"[T]he government has blind faith in Boeing, to the point of letting it get away with the murder of 346 people, including my so beloved daughter Camille,\" said Berthet.\n\nA spokesperson for the Air Accidents Investigation Branch says the incident in Cotes Heath was reported on Friday.\n\nBlue Islands says the four additional dates will \"remove the hassle\" of connecting journeys.\n\nThe budget airline grounded the unnamed pilot after hotel guests reportedly complained after the incident in Cape Verde.\n\nMajor Christopher Dockerty is one of 29 who died when the helicopter crashed in 1994.\n\nA plaque is being unveiled in St Ann's Well Gardens in Hove to honour Oswald and Eustace Short.",
        "source_3": "TheDepartment of Justicedropped its felony caseagainst Boeingon Friday for the company’s role intwo fatal crashesthat killed over 300 people in Indonesia and Ethiopia.\n\nThe two sides agreed to a tentative nonprosecution agreement last week that compensates the victims. The agreement put $444.5 million into a crash victims’ fund that would be divided evenly between the victims, on top of an additional $243.6 million fine for the company.\n\nWhile Boeing will have to “admit to conspiracy to obstruct and impede” federal regulators, the DOJ will ask the judge to dismiss the case with the option of refiling charges later.\n\n“On top of the financial investments, Boeing must continue to improve the effectiveness of its anti-fraud compliance and ethics program and retain an independent compliance consultant,” a Justice Department spokesperson toldPolitico.\n\nThe company entered into a plea agreement last year, agreeing to plead guilty to a felony charge of conspiracy to defraud the government, pay a total of around $500 million in fines, and have a third-party monitor the company.\n\n“[Attorney General] Pam Bondi being afraid to try a case where she has a admission of guilt already from the deferred prosecution agreement, and really that means she’s not protecting the public against [Boeing],” 60-year-old Nadia Milleron, whose 24-year-old daughter died in the 2019 Ethiopian Airlines plane crash, told theWashington Examinerin a phone call.\n\nMilleron, who ran for Congress in 2024 in Massachusetts’s First Congressional District and captured almost 40% of the vote in her independent bid against longtime Rep. Richard Neal (D-MA), said she felt “angry and astounded.”\n\n“It’s not just individuals that commit crime. Corporations commit crime, too,” she said.\n\nMilleron went to the DOJ on Thursday but could not get a meeting with Bondi, as she had aimed to. She waited in the rain for a response from the higher-ups in the department because she didn’t have an appointment, until she couldn’t wait anymore. Those with phone contacts and appointments waited in the lobby or called outside, but Milleron only had email contacts, which she said didn’t respond to her inquiries.\n\nOne of the lawyers for the family objected to the agreement between Boeing and the government.\n\n“This kind of non-prosecution deal is unprecedented and obviously wrong for the deadliest corporate crime in U.S. history. My families will object and hope to convince the court to reject it,” the families’ pro bono lawyer, Paul Cassell, said in a statement shared with theWashington Examiner.\n\nWhile the government may have found its resolution with Boeing, the victims say money will never be enough to make up for the loss of their loved ones.\n\n“For me, I will never get rid of my pain and my tears. By deciding not to prosecute Boeing and not to take it to court, the government is sending a message to the public that big companies are above the law and justice, even when they kill,” Catherine Berthet of France, who lost her 28-year-old daughter in the Ethiopian crash, said in a statement shared with theWashington Examiner.\n\nThe DOJ toldPoliticothat the victims hold “a broad set of views” concerning the resolution of the case, “ranging from support to disagreement.”\n\n“Nothing will diminish the victims’ losses, but this resolution holds Boeing financially accountable, provides finality and compensation for the families and makes an impact for the safety of future air travelers,” the DOJ added.\n\nThe victims and their lawyers will have to wait to see if the judge will grant the motion to dismiss the case.\n\nBoeing’s 737 MAX series has generated considerable consumer fear due to its highly publicized accidents and crashes. On Jan. 5, 2024, a door panel blew out of a 737 Max 9 operated by Alaska Airlines, reviving fear around flying on the company’s planes. Boeing says it has made considerable changes to the aircraft to make it safer, including to its problematic Maneuvering Characteristics Augmentation System flight systems, which were partially responsible for the two plane crashes.\n\n“This required software function operates in unusual flight conditions only and now relies on two sensors, activates only once and never overrides pilots’ ability to control the airplane,” the company says on itswebsite.\n\nDOJ REACHES TENTATIVE NONPROSECUTION AGREEMENT WITH BOEING FOR 737 MAX8 CRASHES\n\nMilleron’s daughter, Samya Rose Stumo, who was known as “an emerging leader in global health,” was aboard a Boeing 737 MAX 8 aircraft when she died.\n\nMilleron is deeply concerned about the MAX series aircraft. She was so concerned when she boarded a MAX aircraft unknowingly that when she saw and verified that it was a MAX aircraft, she got off the plane and waited overnight in the airport for the next flight."
    }
}