{
    "question": "How might the judge’s temporary restraining order blocking the revocation of Harvard’s SEVP certification shape the legal landscape for international students and the federal government’s efforts to pressure universities over campus climate and national security concerns?",
    "content": {
        "source_1": "Harvard sued and asked for a restraining order less than 24 hours after the Trump administration had said it would block current and future international students from attending the university.\n\n“I just couldn’t believe it because I thought the administration and Harvard have been back and forth for the last couple of months on various issues — pulling funding and stuff, which is already very painful for Harvard. But I thought that was the maximum pressure that the administration was able to put on Harvard.” “It’s a real fear and a real threat. So even if we win at court, we do not know if the government will accept that or if the whole situation will just take too long for us to react in time.”\n\nA federal judge halted on Friday the Trump administration’s attempts to block international students from attending Harvard University, the nation’s oldest university and one of its most prestigious.\n\nHarvard had sued the Trump administration earlier in the day and less than 24 hours after the Department of Homeland Security moved to bar international students. Later Friday morning, at the university’s request, the Boston judge, Allison D. Burroughs, issued a temporary restraining order against the federal edict, agreeing that Harvard had shown that its implementation would cause “immediate and irreparable injury” to the university.\n\nThe administration action, and Harvard’s response, signified a dramatic escalation of the battle between the administration and Harvard. And the university’s forceful and almost immediate response served as evidence that stopping the flow of international students to Harvard, which draws some of the world’s top scholars, would destabilize the school.\n\nIn a letter to the Harvard community delivered Friday morning, Dr. Alan M. Garber, Harvard’s president, wrote, “We condemn this unlawful and unwarranted action,” adding that it “imperils the futures of thousands of students and scholars across Harvard and serves as a warning to countless others at colleges and universities throughout the country who have come to America to pursue their education and fulfill their dreams.”\n\nHarvard University sued the Trump administration after it moved to block international students from enrolling.\n\nThe lawsuit, which accused the Trump administration of a “campaign of retribution” against the university, followed an announcement on Thursday that Harvard’s Student and Exchange Visitor Program certification had been revoked, halting the university’s ability to enroll international students.\n\nWe are having trouble retrieving the article content.\n\nThank you for your patience while we verify access. If you are in Reader mode please exit andlog intoyour Times account, orsubscribefor all of The Times.\n\nThank you for your patience while we verify access.",
        "source_2": "Reporting by Jonathan Stempel in Chicago and Nate Raymond in Boston; Additional reporting by Maria Tsvetkova in New York and Ted Hesson in Washington; Writing by Luc Cohen; Editing by Noeleen Walder and Daniel Wallis\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nNate Raymond reports on the federal judiciary and litigation. He can be reached at nate.raymond@thomsonreuters.com.",
        "source_3": "By signing up to our newsletters you agree to the Just the NewsTerms of ServiceandPrivacy Policy\n\nA federal judge on Friday blocked the Trump administration from revoking Harvard's ability to admit international students.\n\nA federal judge on Friday blocked the Trump administration from revoking Harvard's ability to admit international students.\n\nObama-appointed U.S. District Judge Allison Burroughs issued the stay,Reuters reported.\n\nThe move follows the school suing after Department of Homeland Security Secretary Kristi Noem on Thursdayrevoked its Student and Exchange Visitor Program (SEVP) certification. Noem took that action amid a standoff with the school over its handling of antisemitism on campus.\n\n“With the stroke of a pen, the government has sought to erase a quarter of Harvard’s student body, international students who contribute significantly to the University and its mission,” Harvard asserted.\n\n\"This administration is holding Harvard accountable for fostering violence, antisemitism, and coordinating with the Chinese Communist Party on its campus,\" Noem said. \"It is a privilege, not a right, for universities to enroll foreign students and benefit from their higher tuition payments to help pad their multibillion-dollar endowments.\""
    }
}