{
    "question": "How might the judge’s preliminary injunction blocking the layoffs and ordering reinstatement at the Education Department influence the agency’s short-term functioning and the longer-term legal and political debate over presidential authority to reorganize federal departments?",
    "content": {
        "source_1": "The order issued by a federal judge in Boston also directs officials to reinstate thousands of fired employees.\n\nA federal judge on Thursday blocked President Trump’s executive order aimed at dismantling the Education Department and ordered officials to reinstate thousands of fired employees in a ruling that was at least a temporary setback for the president and his plans.\n\nThe decision from Judge Myong J. Joun of the U.S. District Court for the District of Massachusetts was a preliminary injunction, meaning it will remain in force until the case is resolved or a higher court overturns it.\n\nThe injunction was requested by a pair of school districts in Massachusetts, the American Federation of Teachers and 21 Democratic state attorneys general who sued Mr. Trump in March to block hisexecutive orderandreversea massive round of layoffs. Judge Joun agreed withtheir argumentthat the actions equated to an illegal shutdown of the agency, which only Congress can abolish.\n\n“The record abundantly reveals that defendants’ true intention is to effectively dismantle the department without an authorizing statute,” Judge Joun wrote in his order.\n\nMadi Biedermann, the Education Department’s deputy assistant secretary for communications, said the administration would immediately challenge the decision while taking aim at the judge.\n\n“Once again, a far-left judge has dramatically overstepped his authority, based on a complaint from biased plaintiffs,” Ms. Biedermann said in a statement. “President Trump and the Senate-confirmed secretary of education clearly have the authority to make decisions about agency reorganization efforts, not an unelected judge with a political ax to grind.”\n\nJudge Joun, an Army and National Guard veteran, was a board member of the American Civil Liberties Union of Massachusetts before President Biden appointed him to the federal bench in 2022.\n\nIn March, he temporarily ordered the Trump administration to release $65 million in teacher-training grants that had been suspended over Mr. Trump’s efforts to root out diversity, equity and inclusion policies. While an appeals court upheld that order,the Supreme Court in April overruled Judge Jounand said that the suspension could remain in place.\n\nThe administration has maintained that firing nearly half of the Education Department’s employees was lawful and aimed at making the agency more efficient and functional.\n\nLinda McMahon, the education secretary,toldthe House Appropriations Committee on Wednesday that as many as three-fourths of theroughly 2,000 staff members who had been fired at her agencyhad lost their jobs because of downsizing efforts overseen by Elon Musk and his so-called Department of Government Efficiency.\n\nIlana Krepchin, chairwoman of the Somerville School Committee, which is one of the plaintiffs, hailed the ruling as a victory for students, teachers and families.\n\n“Our public education system is too important to be undermined by actions that threaten our students’ rights and opportunities,” Ms. Krepchin said. “We will continue to work tirelessly to ensure that our students’ futures remain bright.”\n\nMichael C. Bender is a Times political correspondent covering President Trump, the Make America Great Again movement and other federal and state elections.",
        "source_2": "Peter Aitken is a Newsweek Politics Editor based in New York. His focus is domestic U.S. politics, but he has experience covering Foreign Affairs, Business and Technology. Peter joined Newsweek in 2024 from Fox News Digital and had previously freelanced at Business Insider. He has interviewed such notable figures as Benjamin Netanyahu, Gen. David H. Petraeus, British Foreign Ministers James Cleverly and Grant Shapps and a ranking member of the Taliban. He graduated from the University of St. Andrews in Scotland, but is New York born and raised. You can get in touch with Peter by emailingp.aitken@newsweek.com. Languages: English.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nA federal judge on Thursday halted PresidentDonald Trump's executive order aimed at shutting down the Department of Education, ordering the reinstatement of employees who were dismissed during mass layoffs.\n\nNewsweekreached out to the White House for comment by email on Thursday.\n\nTrump on the campaign trail promised to eliminate the Department of Education—a regularRepublicancandidate promise and a goal outlined in Project 2025, the conservative blueprint touted as the plan for Trump's administration during the 2024 election.\n\nTrump issued the order in March, aiming to strip down the Department of Education and shift the tasks such as student loans to other agencies. Trump has said his intention is to shift responsibility for education decisions back to the states. He has repeatedly criticized the department as inefficient and dominated by liberal ideology.\n\nThe executive order was expected to face several legal challenges as Democratic leaders and education advocacy groups vow to fight the measures in court. Completely dissolving the agency would require congressional approval because it was established byCongressin 1979.\n\nU.S. District Judge Myong Joun, aJoe Biden-appointed judge based in Boston, issued a preliminary injunction blocking two initiatives unveiled in March that were part of Trump's broader plan to dismantle the department.\n\n\"The record abundantly reveals that defendants' true intention is to effectively dismantle the department without an authorizing statute,\" Joun wrote. He added that \"this court cannot be asked to cover its eyes while the Department's employees are continuously fired and units are transferred out until the Department becomes a shell of itself.\"\n\nJoun ordered the administration to stop \"carrying out the reduction-in-force\" announced on March 11 and stop implementing Trump's March 20 executive order.\n\nHe also ordered the DOE to reinstate federal employees terminated on or after January 20 and to return the department to \"status quo such that it is able to carry out its statutory functions.\"\n\nJoun gave the DOE 72 hours to file a \"status report\" that will describe \"all steps taken to comply with this order and every week thereafter until the Department is restored to the status quo prior to January 20, 2025.\"\n\nThe lawsuit was brought against the administration by 21 Democratic state attorneys general, led by New York, and built on a lawsuit brought by the American Federation of Teachers (AFT), filed on March 18 in response to the announcement that the DOE would effectively break the student loan system.\n\nMainly, the lawsuit aimed to stop the exodus of employees as the administration continued trying to downsize the department, but the multi-level lawsuit also aimed to stop the administration from \"denying borrowers' access to affordable loan payments and blocking progress towards Public Service Loan Forgiveness in violation of federal law,\" according to the AFT statement issued after filing the lawsuit.\n\nSpecial Assistant to the President and Principal Deputy Press Secretary at the White House Harrison Fields toldNewsweekin an emailed statement:\"The continued efforts by unelected, radical judges to undermine the Executive Branch and the President's constitutional authority to execute his responsibilities are troubling, lack any basis in law, and will continue to fail, as many of these baseless legal challenges have. The President and his Secretary of Education have the legal authority to make decisions regarding the agency's reorganization, and a leftist judge's ruling cannot change that reality. We look forward to appealing this misguided decision and achieving ultimate victory.\"\n\nAFT President Randi Weingarten toldNewsweekin an emailed statement:\"Today, the court rightly rejected one of the administration's very first illegal, and consequential, acts: abolishing the federal role in education. This decision is a first step to reverse this war on knowledge and the undermining of broad-based opportunity. For America to build a brighter future, we must all take more responsibility, not less, for the success of our children. The vast majority of Americans and states like Massachusetts, with the highest NAEP scores, want to keep the education department because it ensures all kids, not just some, can get a shot at a better life.\"\n\nBased on previous cases that remain open between the Trump administration and various groups, the White House and DOE will likely appeal this decision and request an injunction on several aspects of Joun's order, with the case possibly ending up in the U.S.Supreme Court.\n\nThis article contains reporting by The Associated Press.\n\nUpdate 5/22/25, 1:30 p.m. ET: This file has been updated with additional information, context and comment.\n\nUpdate 5/22/25, 2:36 p.m. ET: This file has been updated with comment from the White House.\n\nPeter Aitken is a Newsweek Politics Editor based in New York. His focus is domestic U.S. politics, but he has experience covering Foreign Affairs, Business and Technology. Peter joined Newsweek in 2024 from Fox News Digital and had previously freelanced at Business Insider. He has interviewed such notable figures as Benjamin Netanyahu, Gen. David H. Petraeus, British Foreign Ministers James Cleverly and Grant Shapps and a ranking member of the Taliban. He graduated from the University of St. Andrews in Scotland, but is New York born and raised. You can get in touch with Peter by emailingp.aitken@newsweek.com. Languages: English.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nPeter Aitken is a Newsweek Politics Editor based in New York. His focus is domestic U.S. politics, but he has experience covering Foreign Affairs, Business and Technology. Peter joined Newsweek in 2024 from Fox News Digital and had previously freelanced at Business Insider. He has interviewed such notable figures as Benjamin Netanyahu, Gen. David H. Petraeus, British Foreign Ministers James Cleverly and Grant Shapps and a ranking member of the Taliban. He graduated from the University of St. Andrews in Scotland, but is New York born and raised. You can get in touch with Peter by emailingp.aitken@newsweek.com. Languages: English.\n\nPeter Aitken is a Newsweek Politics Editor based in New York. His focus is domestic U.S. politics, but he has                                    ...Read more",
        "source_3": "Fox News senior congressional correspondent Chad Pergram breaks down the House vote on President Donald Trump's 'big, beautiful bill.' House Majority Whip Tom Emmer, R-Minn., discusses getting the votes needed.\n\nA federal judge blocked PresidentDonald Trumpfrom dismantling the Department of Education (ED) on Thursday, ruling that it cannot be done without congressional approval.\n\nU.S. District Judge Myong Joun's order blocks the Trump administration from carrying out the mass-firing at ED announced in March and orders that any employees who were already fired be reinstated.\n\nJoun's order noted Trump's repeated calls to shut down the department while on the campaign trail, and argued the reduction in force was his means of doing so.\n\n\"The idea that Defendants’ actions are merely a ‘reorganization’ is plainly not true,\" Joun wrote.\n\n'ACTIVIST' JUDGES KEEP TRYING TO CURB TRUMP’S AGENDA — HERE’S HOW HE COULD PUSH BACK\n\nU.S. District Judge Myong Joun blocked President Donald Trump's effort to conduct a massive reduction in force at the Department of Education.(Reuters)\n\n\"Defendants do acknowledge, as they must, that the Department cannot be shut down without Congress’s approval, yet they simultaneously claim that their legislative goals (obtaining Congressional approval to shut down the Department) are distinct from their administrative goals (improving efficiency). There is nothing in the record to support these contradictory positions,\" his ruling continues.\n\nThe DOE rejected Joun's ruling in a statement to Fox News Digital, labeling him a \"far-left judge\" who \"overstepped his authority.\"\n\n\"President Trump and the Senate-confirmed Secretary of Education clearly have the authority to make decisions about agency reorganization efforts, not an unelected Judge with a political axe to grind,\" spokeswoman Madi Biedermann said in a statement. \"This ruling is not in the best interest of American students or families. We will immediately challenge this on an emergency basis.\"\n\nThe ruling comes just a day after another federal judge blocked Trump's administration fromfiring two Democratic membersof the Privacy and Civil Liberties Oversight Board on Wednesday.\n\nU.S. District Judge Reggie Walton found that allowing unilateral firings would prevent the board from carrying out its purpose.\n\nTRUMP ADMINISTRATION GUTS INSTITUTE OF PEACE OF ‘ROGUE BUREAUCRATS’ AFTER DOGE STANDOFF IN GOVERNMENT OFFICE\n\nWalton wrote that allowing at-will removals would make the board \"beholden to the very authority it is supposed to oversee on behalf of Congress and the American people.\"\n\nThe oversight board was initially created by Congress to ensure that federal counterterrorism policies were in line with privacy and civil liberties law.\n\nPresident Donald Trump's administration has faced heavy opposition from federal courts.(Brendan Smialowski/AFP via Getty Images)\n\nThe two plaintiffs, Travis LeBlanc and Edward Felten, argued in their lawsuit that members of the board cannot be fired without cause. Meanwhile, lawyers for Trump's administration argued that members of othercongressionally createdboards do have explicit job protections, and it would therefore be wrong for Walton to create such protections where they are absent.\n\n\"The Constitution gives President Trump the power to remove personnel who exercise his executive authority,\" White House spokesman Harrison Fields told The Associated Press. \"The Trump Administration looks forward to ultimate victory on the issue.\"\n\nAnders Hagstrom is a reporter with Fox News Digital covering national politics and major breaking news events. Send tips to Anders.Hagstrom@Fox.com, or on Twitter: @Hagstrom_Anders.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}