{
    "question": "What implications does the Supreme Court’s 4-4 deadlock, leaving the block on Oklahoma’s proposed religious charter school in place, have for state charter school policies and future church–state litigation?",
    "content": {
        "source_1": "Washington — An evenly divided Supreme Court on Thursday upheld a lower court decision that invalidated a contract approved by the Oklahoma Statewide Charter School Board that established the nation's first religious charter school, blocking the effort in a closely watched case that posed a test for the separation of church and state.\n\nThe high court split 4-4, which leaves in place the decision of the Oklahoma Supreme Court. Justice Amy Coney Barrett did not participate in the case. The high court issued a one line, unsigned decision stating \"the judgment is affirmed by an equally divided court.\"\n\nArgued at the end of April, the legal fight could have opened the door to public dollars flowing directly to religious schools. But following the arguments, itappeared that the outcome of the casewould hinge on Chief Justice John Roberts, who focused on the level of state involvement in its charter school program. The issue of whether religious institutions must be permitted to participate in state charter school systems is likely to land before the Supreme Court again in a case likely to involve all nine justices.\n\nThe legal battle over the attempt to create St. Isidore of Seville Catholic Virtual School in Oklahoma came on the heels of a trio of recent rulings in which the Supreme Court sided with religious families and institutions challenging state-funded programs for excluding religious beneficiaries as violating the First Amendment's Free Exercise Clause.\n\nIn 2017, the high court ruled that Missouri violated the free exercise right of Trinity Lutheran Church Child Learning Center when it denied it grant funding to resurface its playground. Then, in 2020, the Supreme Court said that Montana could not exclude religious schools from a program providing tax credits to people who donate to scholarships for private-school students. Most recently, in 2022, the Supreme Court saidMaine cannot limita tuition assistance program to nonsectarian schools.\n\nNicole Stelle Garnett, a professor at Notre Dame Law School who authored apaperthat suggested states with charter schools must permit religious charter schools or risk violating the Free Exercise Clause, said she was disappointed with the decision but noted that it does not set precedent.\n\n\"The question whether barring religious charter schools violates the Constitution remains live, and I remain confident that the Court will eventually rule that it does,\" she said in a statement.\n\nGarnett is friends with Barrett, who also taught at Notre Dame Law School before she became a judge. The university's Religious Liberty Clinic represented St. Isidore.\n\nA decision in favor of the school could have led to the country's first religious charter school. Oklahoma Attorney General Gentner Drummond, a Republican who argued against establishment of the school, had warned that a decision allowing its contract to stand would upend laws in at least 45 states and the District of Columbia, as well as the federal charter school program, all of which require charter schools to be nonsectarian.\n\nOklahoma has offered charter schools within its public education system since 1999 and, like at least 44 other states and the federal charter school program, requires the institutions to be \"nonsectarian in its programs, admission policies, employment practices, and all other operations.\" The state has at least 30 charter schools that serve more than 50,000 students, and they received $314 million from the state and $69 million in federal funds in the 2022 to 2023 school year, according to a2023 reportfrom the Oklahoma State Department of Education.\n\nIn January 2023, the Archdiocese of Oklahoma City and the Diocese of Tulsa formed the St. Isidore of Seville Virtual Charter School Inc. for the purpose of establishing and operating St. Isidore as a Catholic school, according to court records. That May, St. Isidore applied to the Oklahoma Statewide Charter School Board to establish it as a virtual charter school that \"fully embraces the teachings of the Catholic Church's Magisterium\" and \"fully incorporates these [teachings] into every aspect of the school.\"\n\nThe school estimated initial enrollment of 500 students and projected it would receive roughly $2.7 million in state funding for its first year of operation,according to court documents.\n\nAhead of a vote by the board, Drummondwarnedagainst approval of St. Isidore's application, and said anearlier analysisfrom his predecessor supporting the school could be \"used as a basis for taxpayer-funded religious schools, which is exactly what [St. Isidore] seeks to become.\"\n\nStill, the charter school board voted 3-2 to approve St. Isidore's application, and in October 2023, it and the school entered in a contract establishing St. Isidore's as a charter school.\n\nThat month, Drummond sued the board directly in the Oklahoma Supreme Court and asked it to rescind the charter contract and declare St. Isidore's establishment as a charter school unlawful.\n\nThe attorney general prevailed before the state's highest court, which ruled that because St. Isidore's is a public charter school, it violated the state's requirement that those entities be nonreligious, as well as the Establishment Clause of the First Amendment, in part because it would \"permit state spending in direct support of the religious curriculum and activities within St. Isidore.\"\n\nOklahoma's charter school board and St. Isidore's appealed the state court ruling to the Supreme Court, and it said in January it would review that decision.\n\nMelissa Quinn is a politics reporter for CBSNews.com. She has written for outlets including the Washington Examiner, Daily Signal and Alexandria Times. Melissa covers U.S. politics, with a focus on the Supreme Court and federal courts.",
        "source_2": "The Supreme Court on Thursday morning left in place a ruling by the Oklahoma Supreme Court rejecting an effort by a Catholic virtual charter school to become the country’s first religious charter school. In an unsigned one-sentence order, the justices indicated that, with Justice Amy Coney Barrett recused from the case, they had divided 4-4. The order did not indicate how any of the justices voted. That tie means the state supreme court’s opinion remains good law, although it is binding only in Oklahoma and does not have nationwide effect.\n\nBarrett did not state why she did not participate in the case. But the charter school was represented at the Supreme Court by the religious liberty clinic at Notre Dame’s law school, where Barrett taught for 15 years before becoming a federal judge and later a justice. And Nicole Stelle Garnett, who is a law professor at Notre Dame and a leading advocate for allowing the use of public funds at religious schools, is a close friend of Barrett’s. Barrett is godmother to one of Garnett’s children.\n\nThe dispute began in 2023, when Oklahoma’s charter school board approved an application by the archdiocese of Oklahoma City and the diocese of Tulsa to create a virtual Catholic charter school, St. Isidore of Seville, named after the patron saint of the internet. The school was intended to be an explicitly religious one that would participate in “the evangelizing mission of the church.” The school’s contract with the charter school board specifically allowed the school to freely exercise its religious beliefs.\n\nGentner Drummond, Oklahoma’s Republican attorney general, went to the state supreme court, asking it to invalidate the charter school board’s contract with St. Isidore.\n\nThe state supreme court granted that request. Because St. Isidore is a public school, it concluded, state laws require it to be non-sectarian. That mandate, it added, is consistent with both the state and federal constitution, which bar the state from “using public money for the establishment of a religious institution.”\n\nThe school and the charter school board came to the Supreme Court last fall, asking the justices to take up their case and reverse the state court’s ruling.\n\nSince 2017, the justices have sided with parents and religious institutions in three challenges to state policies that barred them from receiving education-related funds that were available for secular, but not religious, recipients. First, they ruled thatMissouri violated the Constitutionwhen it barred a church preschool from a state-run program to resurface its playground. In 2020, they ruled thatMontana could not exclude religious schoolsfrom a tax-credit program used to provide funding for children to attend private schools. And in 2022,they invalidated a Maine policythat allowed public funds to be used to pay tuition at non-sectarian schools but not at religious schools.\n\nAt the April 30 oral argument, several of the justices – including, critically, Chief Justice John Roberts – suggested that the charter school case was different from the trio of cases in which the court had ruled against the state. Those cases, Roberts suggested, “involved fairly discrete state involvement,” while the state’s involvement in the operation of a Catholic virtual charter school would be “a much more comprehensive involvement.”\n\nThe justices also seemed concerned about what the impact of a ruling either for or against the state might be. On the one hand, Justice Elena Kagan warned, a ruling for the charter school board might require a state to approve a religious school whose curriculum bears little resemblance to a traditional public school.\n\nOn the other hand, Justice Brett Kavanaugh expressed concern that upholding the Oklahoma Supreme Court’s opinion could mean that other faith-based services, like Catholic Social Services or Catholic Charities, would also be deemed “government entities” that are unable to exercise their religion.\n\nAfter more than two hours of debate last month, the justices appeared divided. Thursday’s order confirmed that with Barrett not participating, they were unable to find five votes for either outcome.\n\nCases:Oklahoma Statewide Charter School Board v. Drummond,St. Isidore of Seville Catholic Virtual School v. Drummond",
        "source_3": "In a stunning Thursday ruling, the U.S. Supreme Courtdeclinedto nullify an Oklahoma Supreme Court decision blocking the establishment of the nation’s first public religious charter school. The final vote was deadlocked at 4-4, with Associate Justice Amy Coney Barrettrecusingherself from the case.\n\nThe high court did not offer a written opinion on the matter or disclose which way each justice ruled.\n\nThe case first came to fruition in fall 2023, when the Oklahoma Statewide Charter School Board entered into a contract with St. Isidore of Seville Catholic Virtual School. The agreement made the latter the “first religious public virtual charter school in the nation,” according toThe Federalist Society.\n\nThe established contract prompted Oklahoma Attorney General Gentner Drummond, a Republican, to sue the Statewide Charter School Board in the state Supreme Court, in which heallegedthat the board’s sponsorship of St. Isidore is “unlawful” because “Oklahoma’s Constitution disallows sectarian control of its public schools and the support of sectarian practices—indirect or otherwise.” The Sooner State’s high courtagreedwith Drummond, nullifying the contract on the grounds that it violated the Oklahoma Constitution and the U.S. Constitution’sestablishment clause.\n\nThe Trump administrationsupportedthe State Board and St. Isidore in the case.\n\nWhile it’s unclear how each participating justice ruled in Thursday’s decision, SCOTUS’s Democrat appointeesappearedwilling to side against plaintiffs during oral arguments last month. Meanwhile, several of the high court’s Republican appointees signaled support for the school.\n\nDuring his line of questioning, Associate Justice Brett Kavanaugh repeatedly stressed the point that while government “can’t favor one religion over another in approving or allowing charter schools,” it also cannot favor secular institutions over sectarian ones.\n\n“Our cases have made very clear … you can’t treat religious people and religious institutions and religious speech as second-class in the United States. And when you have a program that’s open to all comers except for religion … that seems like rank discrimination against religion, and that’s the concern that I think you need to deal with here,” Kavanaugh told Gregory Garre, who argued the case on behalf of Drummond’s office.\n\nChief Justice John Roberts, who was seen as a pivotal swing vote, wasseeminglythe least vocal justice in the case’s oral arguments. It is not currently known how the Bush appointee voted on the matter.\n\nIt’s worth noting that Thursday’s decision from the Supreme Court does not establish a nationwide precedent over the establishment of public religious charter schools. Asnotedby the left-wing SCOTUSblog, “The Oklahoma court’s decision only applies in Okla., so the question of religious public charter school[s] could come back up to the justices from another state.”\n\n© 2025 The Federalist, A wholly independent division of FDRLST Media. All rights reserved."
    }
}