{
    "question": "What are the potential consequences for public oversight and the historical record when the Trump administration reduces traditional documentation (such as website archives, meeting notes, and visitor logs) while simultaneously promoting transparency initiatives at agencies and contesting FOIA requests like those involving DOGE?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nPresident Donald Trump holds a document with notes about Kilmar Abrego Garcia as he speaks with reporters in the Oval Office of the White House, April 18, 2025, in Washington.(AP Photo/Alex Brandon, File)\n\nThis image, contained in the indictment against former President Donald Trump, shows boxes of records stored in a bathroom and shower in the Lake Room at Trump’s Mar-a-Lago estate in Palm Beach, Fla. (Justice Department via AP)\n\nA letter from acting archivist of the United States Debra Steidel Wall to former President Donald Trump’s legal team is photographed, Aug. 23, 2022. The letter details that the National Archives recovered 100 documents bearing classified markings, totaling more than 700 pages, from an initial batch of 15 boxes retrieved from Mar-a-Lago earlier in 2022. (AP Photo/Jon Elswick, File)\n\nWASHINGTON (AP) — For generations, official American documents have been meticulously preserved and protected, from the era of quills and parchment to boxes of paper to the cloud, safeguarding snapshots of the government and the nation for posterity.\n\nNow, the Trump administrationis scrubbingthousands of government websites of history, legal records and data it finds disagreeable.\n\nIt has sought to expand the executive branch’s power to shield from public view the government-slashing efforts ofElon Musk’s teamand other key administration initiatives. Officials have usedapps such as Signalthat can auto-delete messages containing sensitive information rather than retaining them for recordkeeping. And they haveshaken up the National Archives leadershipand even ordered the rewriting ofhistory on display at the Smithsonian Institution.\n\nAll of that follows PresidentDonald Trumpdiscouraging note-taking at meetings, ripping up records when he was done with them, refusing to release White House visitor logs and having staffers sign nondisclosure agreements during his first term — thenbeing indictedfor hauling to Florida boxes of sensitive documents that he was legally required to relinquish.\n\nTo historians and archivists, it points to the possibility that Trump’s presidency will leave less for the nation’s historical record than nearly any before it and that what is authorized for public release will be sanitized and edited to reinforce a carefully sculpted image the president wants projected, even if the facts don’t back that up.\n\nHow will experts and their fellow Americans understand what went on during Trump’s term when those charged with setting aside the artifacts documenting history refuse to do so?\n\nThe administration says it’s the “most transparent in history,” citing the Republican president’s penchant fortaking questions from reporters nearly every day.\n\nBut flooding the airwaves, media outlets and the internet with all things Trump isn’t the same as keeping records that document the inner workings of an administration, historians caution. That’s especially true given the president’spropensity for exaggerating, particularly when it comes to bolstering his own image and accomplishments.\n\n“He thinks he controls history,” says Timothy Naftali, a presidential historian who served as founding director of the Richard Nixon Presidential Library and Museum in Yorba Linda, California. “He wants to control what Americans ultimately find out about the truth of his administration, and that’s dangerous. Because, if he believes that he can control that truth, he may believe that there is nothing that he can do that would have consequences.”\n\nWatchdog groups are most immediately worried about what the administration is doing in real time with little oversight or accountability. They point to Musk’s Department of Government Efficiency, orDOGE, and other top officials seeking to obscure sweeping efforts to remake government, the economy and large swaths of the nation’s civil and cultural fabric.\n\n“With this administration’s history of tearing up records, storing them in unsecured facilities in Florida, its use of Signal,” said Scott Amey, general counsel of the Project on Government Oversight, which has sued DOGE seeking greater access to records. “At that point, there are a lot of questions about how’s DOGE operating, and is it operating within the law?”\n\nTrump has made concealing even basic facts part of his political persona.\n\nHe long refused to release his tax returns despite every other major White House candidate and president having done so since Jimmy Carter. Today, White House stenographers still record every word Trump utters, but many of their transcriptions are languishing in the White House press office without authorization for public release. That means no official record — for weeks, if at all — of what the president has said.\n\n“You want to have a record because that’s how you ensure accountability,” said Lindsay Chervinsky, executive director of the George Washington Presidential Library in Mount Vernon, Virginia. “You can’t hold people accountable if you don’t actually know what happened.”\n\nPresidents are legally obligated to keep up the historical record. After the Watergate scandal forced Nixon to resign in 1974, he tried to take documents home to California. Congress approved a law requiring document preservation that applied only to Nixon.\n\nFour years later, thePresidential Records Actextended similar rules to all commanders in chief. It mandates the preservation, forever, of White House and vice presidential documents and communications. It deems them the property of the U.S. government and directs the National Archives and Records Administration to administer them after a president’s term.\n\nA separate measure, the Federal Records Act of 1950, is meant to safeguard for the historical record the actions of other officials. It says their communications should be preserved, sent to the National Archives, whose headquarters is down the street from the White House, and are generally subject to requests for information under Freedom of Information Act.\n\nThe Presidential Records Act affords presidents the exclusive responsibility for the custody and management of their records while in office, and says the National Archives plays no role except when a president wants to dispose of such materials.\n\nFurther, it protects some presidential records from Freedom of Information requests for five years after a president leaves office, and can even block release of some records for up to a dozen years after a president’s term is up. Presidents also can evoke executive privilege to further limit certain types of communication from release.\n\nOnce an administration is over, however, there are rules about what even the president must retain for the public. The Presidential Records Act also prohibits presidents from taking records home.\n\nThat’s best evidenced by Trump’s 2022federal indictmentfor mishandling classified documents. Rather than turn them over the National Archives, Trump hauled boxes of potentially sensitive documents from his first termto his Florida estate, Mar-a-Lago, where they ended piled up in his bedroom, a ballroom and even a bathroom and shower. The FBIraidedthe property to recover them. The case was later thrown out, though, and thenabandonedaltogether after Trump won back the White House last November.\n\nTrudy Huskamp Peterson, acting Archivist of the United States from 1993 to 1995, said keeping such records for the public is important because “decision-making always involves conflicting views, and it’s really important to get that internal documentation to see what the arguments were.”\n\nThe push toward preservation of the historical record predates Nixon and even the United States itself.\n\nAmerican colonists decried the secrecy around the British Parliament, leading early leaders to install transparency safeguards, including initially rejecting the notion of a presidential Cabinet at the Constitutional Convention. Instead, they endorsed requirements that the president receive advice in writing from department secretaries, so that there would be a written record, said Chervinsky, also author of “The Cabinet: George Washington and the Creation of an American Institution.”\n\nIn 1796, Washington asserted what today might be called executive privilege, arguing that some diplomatic conversations had to be private given their sensitive nature. But the following year, the nation’s first president wrote about the need to build a library to house his papers for historians and researchers, Chervinsky said.\n\nMany early presidents kept meticulous records, including John Adams and Thomas Jefferson, both of whom wanted to “be seen as a positive figure in history,” Chervinsky said. Others, like Abraham Lincoln, had advisers who understood the importance of the era and documented history carefully.\n\nOther presidents often did not prioritize recordkeeping.\n\nUlysses S. Grant, who left office in 1877, famously wrote, “The only place I ever found in my life to put a paper so as to find it again was either a side coat-pocket, or the hands of a clerk more careful than myself.” And it wasn’t until 2014 when the Library of Congress, finally clear of legal battles that raged 50 years earlier with Warren G. Harding’s family, released correspondence between the 29th president and his mistress, Carrie Fulton Phillips.\n\nFederally authorized presidential libraries did not exist until 1941, when Franklin D. Roosevelt opened his while still in office, although a mostly privately funded library established for Rutherford B. Hayes, who left the presidency in 1881, served as a model. Roosevelt also installed a White House tape recorder to capture conversations, a practice that mostly continued until Nixon’s Oval Office tapes upended his presidency.\n\nAfter President John F. Kennedy’s assassination, many of his presidential recordings were taken by his family and National Archives officials had to negotiate with Sen. Ted Kennedy, D-Mass., for public access, Peterson said. President Lyndon B. Johnson recorded phone calls that have informed historians for decades, including his 1964 lament about the Vietnam War: “It just worries the hell out of me.”\n\nNaftali said that in his role at the Nixon library, he saw drafts materials — and the notes used to compile them — that survived among presidential papers, even when the finished documents were shredded in Watergate cover-up efforts.\n\n“You should want accountability whether you’re a Republican or a Democrat or an independent,” Naftali said. “You want to know what people did in your name.”\n\nEven after new laws saw Nixon’s White House tapes turned over to authorities, it fell to archivists to separate official and political material from the personal, which was potentially subject to more privacy protections. They also had to deal with voice-activated devices clicking on while Oval Office cleaning crews worked.\n\nMore recently, President George H.W. Bush’s administration destroyed some informal notes, visitor logs and emails. After President Bill Clinton left office, his former national security adviser, Sandy Berger, pleaded guilty to taking copies of a document about terrorist threats from the National Archives by stuffing them down his pants leg.\n\nPresident George W. Bush’s administration disabled automatic archiving for some official emails, encouraged some staffers to use private email accounts outside their work addresses and lost 22 million emails that were supposed to have been archived, though they were eventuallyuncovered in 2009.\n\nThe younger Bush also signed an executive order seeking to limit the scope of the Presidential Records Act for himself and past presidents. His successor, President Barack Obama, rescinded that. Obama’s administration nonetheless moved to block release of White House visitor logs, something Trumpcontinued in his first term.\n\nCongress updated the Presidential Records Act and the Federal Records Act in 2014 to encompass electronic messaging, including commercial email services known to be used by government employees to conduct official business. But back then, use of auto-delete apps like Signal was far less common.\n\n“A decade ago, we were still in a Gmail, Yahoo, and AOL world,” said Jason R. Baron, a professor at the University of Maryland and former director of litigation at the National Archives. “The point is, it’s far easier to copy — or forward — a commercial email to a dot-gov address to be preserved, than it is to screenshot a series of messages on an app like Signal.”\n\nFurther complicating matters is Trump’s routinely answering cellphone calls, including from reporters. Guidance dating back decades suggests documenting, through ordinary note-taking, the substance of conversations where significant decisions are made, Baron said.\n\nBut he also noted that the rules are less clear than those around written communications, including texts. Such communications have already been at the center of advocates’ work to preserve records around DOGE’s work.\n\nThe administration has argued DOGE’s efforts are subject to the Presidential Records Act which would potentially shield it from Freedom of Information Act rules. Amey’s Project on Government Oversight sued, maintaining that Musk’s initiative should be covered by the Federal Records Act.\n\nOther advocacy groups have alsosued DOGEover compliance with Freedom of Information Act requests, prompting the administration to file a one-page record retention policy in March that was revealed in court filings. It requires DOGE staffers to preserve all work-related communications and records, regardless of format — which, if applied completely across the board, would include apps like Signal.\n\nThere were efforts during the first Trump administration to safeguard transparency, including a memo issued through the Office of White House counselDon McGahnin February 2017 that reminded White House personnel of the necessity to preserve and maintain presidential records.\n\nTrump’s 2017-2021 administration also established a system to capture messages the president posted to Twitter even after he deleted them.\n\nWhen Trump frequently ripped up briefing papers and other documents when he was finished with them during his first term, record analysts working across the street from the White House later would gather them up and tape them back together as best they could.\n\nExperts and advocates say no such guidance memo has been issued from the White House this time, though William Fischer, the National Archives acting chief records officer, released a memo this month reminding agencies about rules for maintaining federal records created on apps such as Signal and recommending using “automated tools to comply” with the Federal Records Act.\n\nTrump has recently talked about his place in history, and officials around the president have discussed building a presidential library —potentially in Florida— when he leaves the White House for good. But Trump also long exaggerated his right to keep documents for personal use rather than turn them over to archivists.\n\n“Under the Presidential Records Act, I’m allowed to do all this,” Trump wrote on his social media site in June 2023 after the FBI seized boxes of documents from Mar-a-Lago — an assertion the indictment against him disputed.\n\nThe White House says Trump was “unjustly prosecuted” on “fake charges” during that case. It points to having recently ordered the declassification of bevies of historical files, including records related to theassassinations of Kennedy, hisbrother RobertandMartin Luther King.\n\nThe administration says it fulfilled records requests from Congress that the administration of his predecessor, DemocratJoe Biden, ignored, and offered instructions that federal agencies should clear out backlogged Freedom of Information Act requests.\n\nIt says it ended the Biden-era practice of staffers using Microsoft Teams, where chats were not captured by White House systems. The Biden administration had more than 800 users on Teams, meaning an unknown number of presidential records might have been lost, Trump officials now say, though that is something Biden representatives did not confirm.\n\nBut the White House did not answer questions about the possibly of drafting a new memo on record retention like McGahn’s from 2017. Nor did it comment about whether nondisclosure agreements remain in use for White House staffers this term, or speak to Trump’s past habit of tearing up documents.\n\nChervinsky, of the George Washington Presidential Library, said Congress, the courts and even the public often don’t have the bandwidth to ensure records retention laws are enforced, meaning, “A lot of it is still, I think, an honor system.”\n\n“There aren’t that many people who are practicing oversight,” she said. “So, a lot of it does require people acting in good faith and using the operating systems that they’re supposed to use, and using the filing systems they’re supposed to use.”\n\nAngeredby the role the National Archives played in his documents case, meanwhile, Trump fired the ostensibly independent agency’shead, Archivist of the United StatesColleen Shogan, and named Secretary of StateMarco Rubioas her acting replacement.\n\nPeterson, the former acting national archivist, said she still believes key information about the Trump administration will eventually emerge, but “I don’t know how soon.”\n\n“Ultimately things come out,” she said. “That’s just the way the world works.”\n\nWill Weissert covers the White House for The Associated Press.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "This story is aMedia Miss by the rightas only 3% is from right-leaning media.\n\nSince early 2025, President Donald Trump’s administrationhas posted far fewer official recordsand briefings on the White House website than were present during the Biden administration. This scarcity stems from practices such asdiscouraging note-taking, scrubbing disagreeable data from government websites, refusing to release visitor logs and disputes over mishandled classified documents.\n\nHistorians and archivists warn that this approach risks leaving a less complete historical record, noting that authorized public releases sanitize information to reinforce a carefully managed presidential image.\n\nTimothy Naftali, a presidential historian, warned that the administration is trying to shape the narrative about its actions in a way that restricts what the public can learn, posing a serious risk to transparency.\n\nExperts anticipate that the limited availability of records from Trump’s presidency will hinder future accountability efforts and scholarly assessments of his administration’s decisions.\n\nUsing our real-time Media Miss™ tool powered by Ground News, we spotlight stories that right-leaning and left-leaning news outlets aren’t covering to bring you a complete picture of the news.\n\nNo summary available because of a lack of coverage.\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nHistory: Trump Could Leave Less Documentation than the Other Presidents.\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\n'We're losing our environmental history': The future of government information under Trump\n\n'We're losing our environmental history': The future of government information under Trump\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nTrump could leave less documentation behind than any previous US president\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nOn the White House website under Trump, there's a sporadic commitment to documentation\n\nNo summary available because of a lack of coverage.\n\nThe future of history: Trump could leave less documentation behind than any previous U.S. president\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\n'We're losing our environmental history': The future of government information under Trump\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nOn White House website under Trump, there’s a sporadic commitment to documentation\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nOn the White House website under Trump, there's a sporadic commitment to documentation\n\nNo summary available because of a lack of coverage.\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nOn the White House website under Trump, there's a sporadic commitment to documentation\n\nThe future of history: Trump could leave less documentation behind than any previous US president\n\nThe future of history: Trump could leave less documentation behind than any previous US president",
        "source_3": "(TNND) —Kash Patel, the Director of the Federal Bureau of Investigations, has outlined a vision for a \"wave of transparency\" aimed at restoring public trust in the agency.\n\nIn an interview on FOX News' \"Sunday Morning Futures,\" Patel discussed past failures within the FBI and the Department of Justice, accusing senior officials of selectively pursuing cases and undermining constitutional responsibilities.\n\n\"You asked in the beginning how the FBI was weaponized, well, the FBI hijacked the constitutional responsibility of the Department of Justice and the Attorney General, and James Comey and others specifically decided what cases to prosecute and not prosecute. Don't believe me? Go to the videotape in the Hillary Clinton investigation,\" Patel said, referencing the Clinton email scandal.\n\nPatel also criticized the handling of the Crossfire Hurricane investigation into former President Trump's alleged ties to Russia, claiming new details have been uncovered and are being shared with Congress.\n\n\"That's how vindictive and vicious the former leadership structure here was. Not only did they bastardize the FISA process and lie to the American public, they withheld and hid documentation and put it in rooms where people weren't supposed to look,\" he said.\n\nPatel, alongside Deputy Director Dan Bongino, emphasized their commitment to transparency, promising that the American public would witness significant changes in the coming weeks."
    }
}