{
    "question": "How might the DOJ’s rollback of Biden-era police oversight—dismissing consent decrees in Louisville and Minneapolis and closing other investigations—affect local reform plans and community trust?",
    "content": {
        "source_1": "Trump officials seek to dismiss Biden-era consent decrees reached after deaths of George Floyd and Breonna Taylor\n\nThe justice department moved on Wednesday to cancel a settlement with Minneapolis that called for an overhaul of its police department following the murder ofGeorge Floyd, as well as a similar agreement with Louisville, Kentucky, after the death ofBreonna Taylor, saying it does not want to pursue the cases.\n\nThe move shows how the civil rights division of the justice department is changing rapidly underDonald Trump, dismantling Biden-era work and investigating diversity programs. It also comes amid pressure on the right to recast Floyd’s murder, undermine diversity efforts and define liberal-run cities like Minneapolis as crime-ridden.\n\nFollowing a scathing report by the justice department in 2023, Minneapolis in January approved a consent decree with the federal government in the final days of theBiden administrationto overhaul its training and use-of-force policies under court supervision.The agreement required approval from a federal court in Minnesota. But theTrump administrationwas granted a delay soon after taking office while it considered its options, and on Wednesday told the court it does not intend to proceed. It planned to file a similar motion in federal court in Kentucky.“After an extensive review by current Department of Justice and Civil Rights Division leadership, the United States no longer believes that the proposed consent decree would be in the public interest,” said the Minnesota motion, signed by Andrew Darlington, acting chief of the special litigation section of the justice department’s civil rights division. “The United States will no longer prosecute this matter.”\n\nTrump hasgenerally opposedthe use of consent decrees, through which the government has threatened lawsuits against police forces and then entered into reform agreements.\n\nHarmeet Dhillon, the Trump ally who oversees thenow-gutted civil rights divisionof the justice department,said in a statementthat “overbroad police consent decrees divest local control of policing from communities where it belongs, turning that power over to unelected and unaccountable bureaucrats, often with an anti-police agenda.”\n\nThe department said it would also be ending investigations or retracting findings of constitutional violations into police departments in Phoenix, Arizona; Trenton, New Jersey; Memphis, Tennessee; Mount Vernon, New York; Oklahoma City, Oklahoma; and the Louisiana state police.\n\nThe justice department announced its decision just before the five-year anniversary of the murder of Floyd, a Black man. Then officer Derek Chauvin, a white man, used his knee on 25 May 2020, to pin Floyd to the pavement for 9.5 minutes in a case that sparked protests around the world and a national reckoning with racism and police brutality.\n\nIn Louisville, the consent degree came afterBreonna Taylor, a Black woman, was killed by police when they forced their way into her apartment in 2020. Similar to Floyd, Taylor’s death sparked protests. The decree had not yet been approved by a judge.\n\nHowever, no immediate changes are expected to affect theMinneapolispolice department, which is operating under a similar consent decree with the Minnesota human rights department.\n\nIt also comes as rightwing figures have pushed for a pardon for Chauvin, who was convicted of state and federal charges. The Democratic governor, Tim Walz, said last week that the state should be prepared for a federal pardon from Trump, but that he had no indication one was forthcoming.\n\n“If Donald Trump exercises his constitutional right to do so, whether I agree – and I strongly disagree with him – if he issues that pardon we will simply transfer Derek Chauvin to serve out his 22-and-a-half years in prison in Minnesota,” Walz said, according tothe Minnesota Star Tribune.\n\n“So, no indication whether they’re going to do it or not, but I think it behooves us to be prepared for it. With this presidency, it seems like that might be something they would do.”\n\nThe Minneapolis police chief, Brian O’Hara, reiterated at a news conference on Tuesday that his department would abide by the terms of the federal agreement as it was signed, regardless of what theTrump administrationdecided.The city in 2023 reached a settlement agreement with the state human rights department to remake policing, under court supervision, after the agency issued a blistering report in 2022 that found that police had long engaged in a pattern of racial discrimination.\n\n“We will implement every reform outlined in the consent decree,” Minneapolis’s mayor, Jacob Frey, said in a statement.\n\nThe mayor ofLouisville, Craig Greenberg, said on X that the city would move forward with its own reform plan, despite the likely dismissal of the proposed decree. The city will take community input and select an independent monitor, putting in place accountability and transparency measures to rebuild trust in public safety, Greenberg said.\n\n“I made a promise to our community, and we are keeping that promise with this agreement,” he continued.",
        "source_2": "The Trump administration has said it will roll back Biden-era police reform efforts in cities where there has been controversy over high-profile police killings and brutality.\n\nThe US justice department said on Wednesday it would dismiss oversight agreements reached with the police departments in Louisville, Kentucky and Minneapolis, Minnesota.\n\nIt will also be scrapping investigations into police constitutional violations in six other cities, including Phoenix and Memphis.\n\nThe announcement comes just days before the fifth anniversary of the death of George Floyd, a black man who died in 2020 after being arrested in Minneapolis, sparking protests and a national reckoning on racial inequities.\n\nThe police officer involved, Derek Chauvin, was convicted of murder charges andis serving a 22-year prison sentence.\n\nAnnouncing the move, the Department of Justice (DoJ) criticised the administration of former President Joe Biden for enacting \"sweeping\" oversight agreements \"that would have imposed years of micromanagement\" of local police by federal courts.\n\nThe agreements were \"handcuffing\" local departments, said Harmeet K Dhillon, the assistant attorney general of the justice department's civil rights division\n\nThe DoJ said it would also move to dismiss two lawsuits filed against police in Louisville and Minneapolis that accuse law enforcement of unconstitutional police practices.\n\nInvestigations into several other police departments will also be closed.\n\nThe DoJ under former Biden - which was led by then-attorney general Merrick Garland - had opened civil investigations into 12 state and local law enforcement agencies since 2021.\n\nFour of those - in Minneapolis, Louisville, Phoenix and Lexington, Mississippi - were completed, and issued reports of systemic police misconduct.\n\nThe investigations were a result of mounting public pressure to address instances of police brutality after several high-profile cases of police killings of black Americans, which led to accusations of systemic racism against law enforcement agencies across the US.\n\nAmong those cases are the deaths of Mr Floyd and Breonna Taylor, a hospital worker who was shot multiple times and killed in Louisville as officers stormed her home in \"no-knock\" raid in 2020.\n\nAn ex-officer with the Louisville Metro Police, Brett Hankison,was found guilty of using excessive forcein Ms Taylor's death.\n\nThe Biden-era DoJ reached accountability agreements with both the Louisville and Minneapolis police departments, but they were not formally enacted.\n\nThey included measures like enhanced training, accountability, and improved data collection of police activity.\n\nThe Trump administration said those findings relied on \"flawed methodologies and incomplete data\".\n\nThe move comes amid a large upheaval of the justice department's civil rights division since Trump's re-election.\n\nAround 70% of the lawyers in that division have quit - according to current and former officials who spoke to NPR - over concerns around its changing priorities under the new Trump administration.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "By signing up to our newsletters you agree to the Just the NewsTerms of ServiceandPrivacy Policy\n\n“Today, we are ending the Biden Civil Rights Division’s failed experiment of handcuffing local leaders and police departments with factually unjustified consent decrees,” Assistant Attorney General Harmeet Dhillon said.\n\nThe Justice Department announced Wednesday that it has ended investigations into two police departments over questionable practies, in addition to reform agreements and lawsuits.\n\nThe department'sCivil Rights Division saidit is dismissing lawsuits against the police departments of Louisville, Ky., and Minneapolis, which the Biden administration filed after President Trump's election victory.\n\nThe lawsuits sought to subject the police departments to consent decrees after accusing them \"of widespread patterns of unconstitutional policing practices by wrongly equating statistical disparities with intentional discrimination and heavily relying on flawed methodologies and incomplete data.\"\n\nThe Biden administration filed the lawsuits years after the deaths of Breonna Taylor and George Floyd during confrontations with police in Louisville and Minneapolis, respectively.\n\nThe division is also closing its investigations into the police departments of Phoenix, Ariz.; Trenton, N.J.; Memphis, Tenn.; Mount Vernon, N.Y.; Oklahoma City, Okla.; and the Louisiana State Police. The DOJ is also retracting the Biden administration's findings of constitutional violations on the part of the police departments.\n\n“Overbroad police consent decrees divest local control of policing from communities where it belongs, turning that power over to unelected and unaccountable bureaucrats, often with an anti-police agenda,” Assistant Attorney General Harmeet Dhillon said in a statement. “Today, we are ending the Biden Civil Rights Division’s failed experiment of handcuffing local leaders and police departments with factually unjustified consent decrees.”\n\nRep. Abe Hamadeh, R-Ariz., said he had advocated for an end to the investigation of the Phoenix Police Department.\n\n“Promise made. Promise kept,” Hamadeh said on Tuesday, after meeting with Dhillon. “I promised our law enforcement officers before taking office that I would end the weaponization of our judicial system and work with President Trump’s Department of Justice to undo the damage wrought by the Biden Administration.”\n\n“The Trump Administration has now shown that it will not tolerate attacks on our law enforcement officers – either through physical violence or bureaucratic machinations,” Hamadeh added."
    }
}