{
    "question": "How might the August 7 rollout of revised U.S. tariff rates—featuring varied country-specific levels, a 10% default for non-listed nations, and expected increases for Brazil and Canada—shape U.S. trade relationships, consumer costs, and the trajectory of ongoing negotiations and court challenges?",
    "content": {
        "source_1": "The US president’s increased ‘reciprocal’ tariffs on dozens of countries came into effect at a minute past midnight Washington time on Thursday\n\nDozens more countries now face higher taxes on their exports to US\n\n“Reciprocal” tariffs ranging from 10% to 41% on imports into the US from dozens of countries have come into effect, as part of Donald Trump’s accelerating trade war.\n\nThe new rates – announced by the White House a week ago, just before a previous 1 August deadline was due to elapse – were in place as of aminute past midnight Washington time on Thursday.\n\nBrazil is hit by a 10% “reciprocal” tariff, butan executive order signed last weekimposed a 40% additional levy linked to the prosecution of the country’s former president Jair Bolsonaro – taking the total to 50%.\n\nThe White House has threatened an additional25% tariff on imports from India, bringing its total tariffs up to 50%, in retaliation for the country’s purchase of oil fromRussia. However, India has 21 days to respond to the potential tariffs before they go into effect.\n\nThe Guardian has a searchable table of the countries and the new tariff levels announced by the Trump administration. The White House has previously stated that goods from countries not listed would face a 10% tariff.",
        "source_2": "Reporting by Jasper Ward and Trevor Hunnicutt; Editing by Sandra Maler\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.\n\nAccess unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.\n\nBrowse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.\n\nScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.\n\nAll quotes delayed a minimum of 15 minutes.See here for a complete list of exchanges and delays.",
        "source_3": "The Trump administrationreleased a revised list of tariff ratesagainst nearly 70 countries set to take effect next week.\n\nThe announcement follows a four-month negotiating sprint with dozens of US trading partners to lock in one-for-one agreements — some of which are reflected in the new list.\n\nAmong the notable rates that will be charged at 12:01 a.m. Aug. 7 — rather than on the Friday deadline initially announced by the White House — are 15% for Iceland and Israel, 30% for South Africa, 39% for Switzerland and 20% for Taiwan and Vietnam.\n\nBrazil, the largest economic power in South America, will see its rate balloon to 50% on Aug. 6, President Trump announced Wednesday.\n\nThe president previously threatened Vietnam with a46% tariffin his April 2 “Liberation Day” announcement, but the country was able to reach a tentative trade deal with the US earlier this month, which lowered its rate.\n\nIsrael’s new rate is 2 percentage points lower than the 17% duty unveiled in April — despite not having made a formal agreement with the White House.\n\nTrump noted in his executive order modifying reciprocal rates Wednesday that some nations “have agreed to, or are on the verge of agreeing to, meaningful trade and security commitments with the United States,” while others either have not tried to strike a deal or “despite having engaged in negotiations, have offered terms that, in my judgment, do not sufficiently address imbalances in our trading relationship or have failed to align sufficiently with the United States on economic and national-security matters.”\n\nThe steepest tariff rates will be carried by Syria (41%), Laos and Myanmar (40%), Switzerland (39%) and Iraq and Serbia (35%).\n\nThe list also denotes a 35% rate on imports from Canada after Trump signed an order upping the current tariff by 10 percentage points.\n\nCountries not listed in the announcement will be subject to a 10% tariff, according to the White House.\n\nTrump hadalready locked up major agreements accountingfor about one-third of American trade in the months leading up to Thursday’s order.\n\nIn Scotland over the weekend, the president secured a massive deal with the European Union, setting a 15% tariff for the EU in exchange for the 27-nation bloc agreeing to purchase $750 billion in US energy and investing $600 billion in the US.\n\nFramework agreements calling for a 10% duty on the United Kingdom, a 19% levy for the Philippines and Indonesia, and a 15% levy on Japan andSouth Koreawere also cut before the new rates were unveiled and ahead of Friday’s deadline.\n\n“President Trump has reset decades of failed trade policy,” read a statement released by the White House.\n\n“Today’s Order underscores President Trump’s commitment to take back America’s economic sovereignty by addressing the many nonreciprocal trade relationships that impact foreign relations, threaten our economic and national security, and disadvantage American workers.”\n\nTrump’s tariff policies, which initially roiled financial markets and sparked fears of recession, have “generated significant investment into the United States, strengthening the U.S. economy while addressing unfair trade practices that have disadvantaged American workers for decades,” the White House argued.\n\nWhite House press secretary Karoline Leavitt told reporters earlier Thursday that more than 100 countries were still in negotiations with the administration and eager to lock in lower rates.\n\n“Upwards of 200 countries around the world have reached out to their trade and tariff team,” Leavitt said, noting that the White House will continue to “prioritize” key trading partners.\n\nShe added that Trump’s team “has been working around the clock to try to be in correspondence with as many countries as possible.”"
    }
}