{
    "question": "How might President Trump’s use of a video alleging widespread attacks on white South African farmers during his meeting with President Cyril Ramaphosa shape U.S.-South Africa relations, refugee policy, and public narratives about crime and race in South Africa?",
    "content": {
        "source_1": "President Trump showed a video and leafed through printouts that he falsely claimed showed widespread persecution of white South Africans. The country’s president tried to correct the record.\n\n“Thank you very much.” “Well, I can answer that for president. It’s for him — [laughter] no, seriously.” “I’d rather have him answer.” “It will take President Trump listening to the voices of South Africans, some of whom are his good friends.” “Turn the lights down and just put this on. It’s right behind you. Those people were all killed.” “Have they told you where that is, Mr. President? I’d like to know where that is because this, I’ve never seen. There is criminality in our country. People who do get killed, unfortunately through criminal activity, are not only white people. Majority of them are Black people.”\n\nErica L. Green and Zolan Kanno-Youngs cover the White House.\n\nIn an astonishing confrontation in the Oval Office on Wednesday, President Trump lectured President Cyril Ramaphosa of South Africa with false claims about a genocide against white Afrikaner farmers, even dimming the lights to show what he said was video evidence of their persecution.\n\nThe meeting had been expected to be tense, given that Mr. Trump has suspended all aid to the country and created an exception to his refugee ban for Afrikaners, fast-tracking their path to citizenship even as he keeps thousands of other people out of the United States.\n\n“We’ve had tremendous complaints about Africa​, about other countries too, from people,” Mr. Trump said. “They say there’s a lot of bad things going on in Africa, and that’s what we’re going to be discussing today.”\n\nThe meeting quickly became a stark demonstration of Mr. Trump’s belief that the world has aligned against white people, and that Black people and minorities have received preferential treatment. In the case of South Africa, that belief has ballooned into claims of genocide.\n\nAt first, the two leaders seemed to glide over the most contentious issues, focusing instead on golf and a bit of foreign policy. Mr. Ramaphosa brought along two South African golfers, Ernie Els and Retief Goosen, as guests, in a nod to the American president’s favorite sport.\n\nBut the discussions took a turn when a journalist asked what it would take for Mr. Trump to change his mind and see there was no “white genocide” in South Africa.\n\nMr. Ramaphosa, answering for the president, said: “It will take President Trump listening to the voices of South Africans.”\n\nMr. Trump was ready with his response. “Turn the lights down and just put this on,” he told his aides.\n\nA booming video mash-up began to play, including footage of people calling for violence against white farmers in South Africa. One clip showed white crosses planted alongside a rural road stretching far into the distance, which Mr. Trump said were part of a burial site for murdered white farmers. The crosses were actually planted by activists staging a protest against farm murders.\n\nBy the end, with the stunned South African president looking on, Mr. Trump began flipping through a stack of papers, apparently showing white victims of violence in South Africa: “Death, death, death,” he said.\n\nAt least one of the scenes on the screen appeared to be the rallying cry of “Kill the Boer,” which U.S. officials and Afrikaner activists have cited as evidence that white South Africans are being persecuted. Boer means farmer in Dutch and Afrikaans.\n\nThe governing party of South Africa, the African National Congress, distanced itself years ago from the chant, which was popularized by the leader of another political party.\n\nMr. Ramaphosa said the video did not show the full picture of his country.\n\n“We have a multiparty democracy in South Africa that allows people to express themselves,” he told Mr. Trump. “Our government policy is completely against what he was saying.”\n\nMr. Ramaphosa acknowledged his nation suffered from a crime problem. But his delegation tried to explain that it was widespread and not specific to white South Africans.\n\n“We were taught by Nelson Mandela that whenever there are problems, people need to sit down around a table and talk about them,” Mr. Ramaphosa said.\n\nThere have been killings of white South Africans, but police statistics do not show that they are more vulnerable to violent crime than other people. White South Africans are far better off than Black people on virtually every marker of the economic scale.\n\nThe encounter in many ways exemplified Mr. Trump’s selective concern over human rights in other countries.\n\nWhile he showcased allegations of mistreatment of white people in democratic South Africa, just a week ago he traveled to three Middle East countries ruled by repressive regimes and told them he would not lecture them about how they treat their own people.\n\nHe cheerfully visited with and praised the Saudi crown prince who, according to the C.I.A., ordered the murder and dismemberment of a Washington Post journalist during Mr. Trump’s first term. Mr. Trump did not offer a word of reproach.\n\nThe encounter in some ways echoed the February visit to the Oval Office by President Volodymyr Zelensky of Ukraine. Mr. Trump and Vice President JD Vance berated Mr. Zelensky in front of TV cameras, cutting short a visit meant to coordinate a plan for peace.\n\nThe meeting with Mr. Ramaphosa on Wednesday was also striking because of the ways in which Mr. Trump dismissed attempts to push back on his fringe claims by those who knew most about them.\n\nMr. Trump scowled and dismissed Mr. Ramaphosa and his delegates during the meeting, including a Black woman who tried to explain that brutal crimes happen to Black people in the country as well.\n\nBy contrast, Mr. Trump joked around and listened attentively as Mr. Els, Mr. Goosen and Johann Rupert, a white South African billionaire, said crime was prevalent across the board in the nation, not just against white farmers.\n\nMr. Ramaphosa entered the meeting seemingly optimistic about maintaining a cordial conversation with Mr. Trump. He offered olive branches to Mr. Trump, including a book about golf. He complimented Mr. Trump’s décor in the Oval Office.\n\nHe even tried to joke with the president, who had become irate when a reporter asked him about a free plane from the Qatari government.\n\n“I am sorry I don’t have a plane to give you,” Mr. Ramaphosa said to Mr. Trump.\n\n“I wish you did,” Mr. Trump replied. “I’d take it. If your country offered the U.S. Air Force a plane, I would take it.”\n\nMr. Trump seemed more intent on relaying the talking points from leaders of Afrikaner lobbying groups, who have traveled to the United States repeatedly over the years to gather support for their claims of persecution. When one of those groups met with Mr. Trump’s top aides this year, the White House identified them as “civil rights leaders.”\n\nAt one point, Mr. Trump referred to another apparently informal adviser on South Africa.\n\n“Elon is from South Africa,” Mr. Trump said, waving at the billionaire Elon Musk, who was standing nearby, close to Stephen Miller, Mr. Trump’s deputy chief of staff.\n\nMr. Musk has been among the most vocal critics of the South African government, and has lashed out at Mr. Ramaphosa on social media.\n\n“Elon happens to be from South Africa,” Mr. Trump said. “This is what Elon wanted.”\n\nMr. Ramaphosa said he also wanted to discuss trade with the United States, and Mr. Trump looked visibly bothered as Mr. Ramaphosa talked about the benefits of U.S.-South Africa partnership. Mr. Trump shrugged and handed the South African president the articles he claimed detailed violence against white farmers.\n\n“I want you to look good,” he said, as he turned back to his claims of land seizures in South Africa. “I don’t want you to look bad.”\n\nErica L. Green is a White House correspondent for The Times, covering President Trump and his administration.\n\nZolan Kanno-Youngs is a White House correspondent for The Times, covering President Trump and his administration.",
        "source_2": "A meeting meant to soothe tensions between the US and South Africa instead spiralled as President Donald Trump put his counterpart on the defensive with claims that white farmers in his nation were being killed and \"persecuted\".\n\nOn Wednesday, a week after the US granted asylum to nearly 60 Afrikaners - a move that rankled South Africa - President Cyril Ramaphosa visited the White House to reset the countries' relations.\n\nInstead, Trump surprised Ramaphosa during a live news conference with widely discredited claims of a \"white genocide\" in South Africa.\n\nHe played a video showing an exhibit during a protest of several crosses lining a road - claiming they were burial sites for murdered white farmers.\n\nTrump said he did not know where in South Africa it was filmed. The crosses, in fact, are not actual graves, but appear to be from a 2020 protest after a farming couple was killed in KwaZulu-Natal province. Organisers said at the time that they are an exhibit representing farmers killed over years.\n\nBefore Wednesday's White House meeting, South Africa's leader stressed that improving trade relations with the US was his priority. South African exports into the US face a 30% tariff once a pause on Trump's new import taxes ends in July.\n\nRamaphosa hoped to charm Trump during the meeting, bringing along two famous South African golfers and gifting him a huge book featuring his country's golf courses.\n\nThe meeting came days after the arrival of 59 white South Africans in the US, where they were granted refugee status. Ramaphosa said at the time they were \"cowards\".\n\nStill, the Oval Office meeting began cordially, until Trump asked for the lighting to be lowered for a video presentation. The mood shifted.\n\nThe film featured the voice of leading South African opposition figure Julius Malema singing: \"Shoot the Boer [Afrikaner], Shoot the farmer\". It then showed a field of crosses, which the US president, talking over the images, said was a burial site of white farmers.\n\nHe handed Ramaphosa what appeared to be print-outs of stories of white people being attacked in South Africa. Trump said that he would seek an \"explanation\" from his guest on claims of white \"genocide\" in South Africa, which have been widely discredited.\n\nRamaphosa responded to the opposition chants in the video, saying, \"What you saw - the speeches that were made... that is not government policy. We have a multiparty democracy in South Africa that allows people to express themselves.\"\n\n\"Our government policy is completely against what he [Malema] was saying even in the parliament and they are a small minority party, which is allowed to exist according to our constitution.\"\n\nOn Wednesday, Ramaphosa said that he hoped Trump would listen to the voices of South Africans on this issue. He pointed out the white members of his delegation, including golfers Ernie Els and Retief Goosen, and South Africa's richest man, Johann Rupert.\n\n\"If there was a genocide, these three gentlemen would not be here,\" Ramaphosa said.\n\nTrump interrupted: \"But you do allow them to take land, and then when they take the land, they kill the white farmer, and when they kill the white farmer nothing happens to them.\"\n\nThe US leader seemed to be referencing that Malema and his Economic Freedom Fighters (EFF) party, which is not part of the government, have the power to confiscate land from white farmers, which they do not.\n\nA controversial law signed by Ramaphosa earlier this year allows the government to seize privately-owned land without compensation in some circumstances. The South African government says no land has been seized yet under the act.\n\nRamaphosa did acknowledge that there was \"criminality in our country... people who do get killed through criminal activity are not only white people, the majority of them are black people\".\n\nReferring to the crosses in the video, Trump said, \"The farmers are not black. I don't say that's good or bad, but the farmers are not black...\"\n\nSouth Africa does not release race-based crime figures, but the latest figures show that nearly 7,000 people were murdered in the country between October and December 2024. Of these, a dozen were killed in farm attacks and of the 12, one was a farmer, while five were farm dwellers and four were employees, who are likely to have been black.\n\nSpeaking to reporters after the Oval Office meeting and private conversations with Trump and his team, Ramaphosa said that despite the issue of genocide claims having come up, he believed \"there is doubt and disbelief about all this in [Trump's] head\".\n\nHe said he hoped that hearing from the other members in his delegation who spoke about their own experiences in South Africa would have been helpful.\n\n\"I'd like to see this as a process\", he said, adding that he expected to meet Trump again in the future, mentioning the upcoming G20 conference in South Africa in November.\n\nClaims of genocide in South Africa have circulated among right-wing groups for years. In February, a South African judge dismissed the claims as \"clearly imagined\" and \"not real\", when ruling in an inheritance case involving a donation to white supremacist group.\n\nAs Trump pressed the issue, Ramaphosa stayed calm - and tried to work his charm by making a joke about offering a plane to the US.\n\nHe invoked the name of anti-apartheid icon Nelson Mandela, saying South Africa remained committed to racial reconciliation.\n\nWhen a journalist asked what would happen if white farmers left South Africa, Ramaphosa deflected the question to his white agriculture minister, John Steenhuisen, who said that most farmers wanted to stay.\n\nBut Trump kept firing salvoes at Ramaphosa, who avoided entering into a shouting match with him - something thathappened to Ukrainian President Volodymyr Zelenskywhen he met Trump in the same room in February.\n\nAfter the confrontation, Malema mocked the meeting, describing it as \"a group of older men meet in Washington to gossip about me\".\n\n\"No significant amount of intelligence evidence has been produced about white genocide. We will not agree to compromise our political principles on land expropriation without compensation for political expediency,\" he posted on X.\n\nPatrick Gaspard, former US ambassador to South Africa under then-President Barack Obama, called the meeting \"truly embarrassing\".\n\n\"It is clear that a trap was set for the South African president. There was every intention to humiliate him, to embarrass South Africa, by extension,\" he said.\n\nThe head of South Africa's most prominent Afrikaners interest group told the BBC on Wednesday night that \"there are real issues that need to be addressed\" when asked about the Trump/Ramaphosa meeting.\n\nAsked whether Afriforum, a South African NGO representing Afrikaners in the country, helped make the video shown in the White House Oval Office, CEO Kallie Kriel said the group had \"used some of that video footage in some of our videos, but in terms of that specific compilation, we did not make that\".\n\n\"That video material is quite easily accessible to many people, but I think that video was very important to just get the shift to a situation that there can't be denialism, and if there is (sic) going to be solutions, then there are real issues that need to be addressed. And I think that video made the point quite strongly,\" she said.\n\nTensions between South Africa and the US are not new.\n\nDays after Trump took office for his second term in January,  Ramaphosa signed into law the controversial bill that allows South Africa's government to expropriate privately owned land in cases when it is deemed \"equitable and in the public interest\".\n\nThe move only served to tarnish the image of Africa's biggest economy in the eyes of the Trump administration - already angered by its genocide case against Israel at the International Court of Justice (ICJ).\n\nIn February, the US president announced the suspension of critical aid to South Africa and offered to allow members of the Afrikaner community - who are mostly white descendants of early Dutch and French settlers - to settle in the US as refugees.\n\nSouth Africa's ambassador to Washington, Ebrahim Rasool, was also expelled in March after accusing Trump of \"mobilising a supremacism\" and trying to \"project white victimhood as a dog whistle\".\n\nAdditional reporting by Khanyisile Ngcobo and Farouk Chothia\n\nCorrection 5 June: We have amended this article to say almost 7,000 people were murdered between October and December 2024, instead of almost 10,000 as we had initially stated.\n\nGo toBBCAfrica.comfor more news from the African continent.\n\nFollow us on Twitter@BBCAfrica, on Facebook atBBC Africaor on Instagram atbbcafrica\n\nThe wave of arrests reflect increased tensions within the military government.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.",
        "source_3": "President Donald Trump and South African President Cyril Ramaphosa hold a meeting at the White House.\n\nPresidentDonald Trumpconfronted South African President Cyril Ramaphosa at the White House on Wednesday with a video allegedly showing grave treatment of White farmers.\n\nTrump has claimed that White Afrikaner South African farmers are being slaughtered and forced off their land. The Afrikaners are descendants of mostly Dutch settlers who first arrived inSouth Africain 1652.\n\nA portion of the footage aired at the White House showed white crosses lined up alongside both sides of a road.\n\n\"Now this is very bad. These are burial sites right here. Burial sites — over a thousand — of White farmers. And those cars are lined up to pay love on a Sunday morning. Each one of those white things you see is a cross. And there is approximately a thousand of them,\" Trump said. \"They're all White farmers. The family of White farmers. And those cars aren't, driving, they are stopped there to pay respects to their family member who was killed. And it's a terrible sight. I've never seen anything like it. On both sides of the road, you have crosses. Those people are all killed.\"\n\nTRUMP TO MEET LEADER OF ‘OUT OF CONTROL' SOUTH AFRICA AT WHITE HOUSE\n\nPresident Donald Trump meets South African President Cyril Ramaphosa in the Oval Office of the White House in Washington, D.C., on Wednesday.(AP/Evan Vucci)\n\n\"Have they told you where that is, Mr. President? I'd like to know where that is. Because this I've never seen,\" Ramaphosa then asked Trump.\n\n\"I mean, it’s in South Africa, that’s where,\" Trump responded.\n\nEarlier, Trump said that \"we had a lot of people, I must tell you, Mr. President, we have had a tremendous number of people, especially since they've seen this, generally they're White farmers and they're fleeing South Africa. And it's, you know, it's a very sad thing to see, but, I hope we can have an explanation of that, because I know you don't want that.\"\n\nSome 50 Afrikaners were flown to the U.S. as refugees last week. Secretary of State Marco Rubio said there’s \"more to come\".\n\nTRUMP RIPS NBC REPORTER FOR ASKING ABOUT QATARI JET GIFT AMID TENSE MEETING ON GENOCIDE: ‘YOU'RE A DISGRACE'\n\nPresident Donald Trump shows documents as he meets South Africa's President Cyril Ramaphosa at the White House in Washington, D.C., on Wednesday.(AP/Evan Vucci)\n\nSouth Africa, and its president, denies claims of genocide and harassment.\n\n\"I'm not going to be repeating what I've been saying. I would say if there was Afrikaner farmer genocide, I can bet you these three gentlemen would not be here, including my Minister of Agriculture. He would not be with me. So it will take him, President Trump listening to their stories, to their perspectives, that is the answer to your question,\" Ramaphosa said.\n\nAt one point in the meeting, Trump was asked by a reporter, \"What would you like President Ramaphosa to do about the situation that we just seen on the screen?\"\n\nElon Musk looks on as President Donald Trump meets South African President Cyril Ramaphosa.(AP/Evan Vucci)\n\n\"Look, these are articles over the last few days,\" Trump continued, holding up a stack of paper.\n\n\"Death of people. Death. Death. Horrible death,\" Trump said as he started flipping through the sheets.\n\n\"White South Africans are fleeing because of the violence and racist laws… So when you say, ‘What would I like to do?’ I don't know what to do,\" Trump said.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}