{
    "question": "How might the Justice Department’s investigation into Andrew Cuomo’s congressional testimony, and the timing of the leak about it, influence public perceptions of accountability and political impartiality as he campaigns for New York City mayor?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nFormer New York Gov. Andrew Cuomo speaks during the New York City Mayoral Candidates Forum at Medgar Evers College Wednesday, April 23, 2025, in New York. (AP Photo/Frank Franklin II)\n\nWASHINGTON (AP) — The Justice Department has opened a criminal investigation intoformer New York Gov. Andrew Cuomoafter congressional Republicans recommended that he be charged with lying over his handling of the COVID-19 pandemic, a person familiar with the matter said Tuesday.\n\nThe investigation by the U.S. attorney’s office in Washington follows a referral from Rep. James Comer, Republican chairman of the House Committee on Oversight and Government Reform, overstatements Cuomo made to lawmakersinvestigating his management of the pandemic when the virus was spreading through nursing homes, the person said. The person was not authorized to discuss the investigation publicly and spoke on the condition of anonymity.\n\nThe investigation plunges the Justice Department yet again into New York politics as Cuomo runs for New York City mayor. It comes just months after federal prosecutorsabandoned a corruption case against New York Mayor Eric Adams, who is running for a second term. They cited a desire to free Adams up to cooperate with the Trump administration’s immigration crackdown.\n\nA spokesperson for Cuomo said Tuesday that the former governor was never informed of any such investigation.\n\n“So why would someone leak it now?” Rich Azzopardi said in an email. “The answer is obvious: This is lawfare and election interference plain and simple — something President Trump and his top Department of Justice officials say they are against.”\n\nAzzopardi added, “Governor Cuomo testified truthfully to the best of his recollection about events from four years earlier, and he offered to address any follow-up questions from the Subcommittee — but from the beginning this was all transparently political.”\n\nThe investigation was first reported Tuesday by The New York Times. The Justice Department declined Tuesday to comment. Spokespeople for the U.S. attorney’s office in Washington didn’t immediately respond to messages seeking comment.\n\nThe inquiry also subjects the department to claims that it is pursuing retribution against political adversaries. The new leader of the U.S. attorney’s office in Washington,Jeanine Pirro,ran unsuccessfully against Cuomo for New York attorney general in 2006 and has been a harsh critic in the years since, publicly accusing him of a coverup of nursing home deaths.\n\nThe Justice Department separately has launched a mortgage fraud investigation into New York Attorney General Letitia James, who sued Trump for civil fraud.\n\nThe investigation into Cuomo revisits a years-old, politically divisive question over the then-governor’s handling of the COVID-19 pandemic in nursing homes. Republicans have zeroed in on a controversial directive his administration issued in March 2020 that initially barred nursing homes from refusing to accept patients just because they had had COVID-19.More than 9,000 recovering coronavirus patientswere released from hospitals into nursing homes under the directive, which was rescinded amid speculation that it had accelerated outbreaks.\n\nComer referred Cuomo to the Justice Department for possible criminal prosecution last month, alleging that he made false statements to lawmakers during a hearing last year focused on his decision-making.\n\nCuomo adamantly defended himself during the hearing, blaming the first Trump administration for failing to provide enough testing and personal protective equipment in the early days of the pandemic. “These are all diversions to blame New York and other states for the culpability of the federal response, which was malpractice,” Cuomo said.\n\nBut Comer asserted that Cuomo had lied during the hearing. He cited what he said was evidence of Cuomo’s direct involvement in a state report that the congressman said “low-balled” nursing home fatalities.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Reporting by Sarah N. Lynch in Washington and Daniel Trotta in Carlsbad, California; Editing by Colleen Jenkins and Stephen Coates\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nSarah N. Lynch is the lead reporter for Reuters covering the U.S. Justice Department out of Washington, D.C. During her time on the beat, she has covered everything from the Mueller report and the use of federal agents to quell protesters in the wake of George Floyd’s murder, to the rampant spread of COVID-19 in prisons and the department's prosecutions following the Jan. 6 attack on the U.S. Capitol.\n\nDaniel Trotta is a U.S. National Affairs correspondent, covering race, guns, LGBTQ+ issues, immigration, homelessness and breaking news in the 50 states. Previously based in New York and now in California, Trotta was awarded the NLGJA award for excellence in transgender coverage. He was previously posted in Cuba, Spain, Mexico and Nicaragua, covering top world stories including the normalization of Cuban-U.S. relations and the Madrid train bombing by Islamist radicals.",
        "source_3": "Fox News host Jesse Watters has the latest on the criminal investigation into the former New York governor on 'Jesse Watters Primetime'\n\nThe U.S. Department of Justice has opened a criminal investigation into former New York Gov.Andrew Cuomofor allegedly lying to Congress about his decisions made during the COVID-19 pandemic while serving as governor, a source familiar with the probe confirmed to Fox News.\n\nThe New York Timesfirst reported that the U.S. attorney's office in Washington opened the inquiry into Cuomo about a month ago after senior officials in the DOJ demanded an indictment of New York City Mayor Eric Adams for corruption charges be dismissed.\n\nThe Trump administration is now in an unusual spot of ending a criminal case against Adams while opening a new case into Adams’ main rival within months of each other.\n\nCuomo is running in the Democratic primary to serve as the next mayor of New York City, while Adams is seeking re-election as an independent candidate.\n\nHOUSE REPUBLICAN ASKS TRUMP DOJ TO CRIMINALLY PROSECUTE EX-NEW YORK GOV ANDREW CUOMO\n\nFormer governor and mayoral candidate, Andrew Cuomo, (C) marches in the Celebrate Israel Parade up Fifth Avenue on May 18, 2025 in New York City.(Alexi Rosenfeld/Getty Images)\n\n\"We have never been informed of any such matter, so why would someone leak it now? The answer is obvious: This is lawfare and election interference plain and simple—something President Trump and his top Department of Justice officials say they are against,\" Rich Azzopardi, Cuomo’s spokesperson told Fox News. \"Governor Cuomo testified truthfully to the best of his recollection about events from four years earlier, and he offered to address any follow-up questions from the Subcommittee — but from the beginning this was all transparently political.\"\n\nThe former governor was grilled byRepublican lawmakerslast year about his handling of the COVID-19 pandemic. House Republicans subsequently recommended the Justice Department pursue criminal charges against him. They accused him of intentionally lying to Congress during the House Oversight Committee’s investigation into the excessive number of nursing home deaths.\n\nHouse Oversight and Government Reform Committee Chair James Comer, R-Ky., referred Cuomo to President Donald Trump's Justice Department for criminal prosecution.\n\nBILL MAHER SUGGESTS ANDREW CUOMO'S NURSING HOME SCANDAL MAY COST HIS NYC MAYORAL CAMPAIGN\n\nFormer New York Gov. Andrew Cuomo speaks outside the West Side Institutional Synagogue on April 1, 2025, in New York City.(Spencer Platt/Getty Images)\n\nCuomo – the Democratic scion now considered thecurrent frontrunnerin the New York City Democratic mayoral primary in June – was first referred to the Biden Justice Department for criminal prosecution in October 2024.\n\nFormer Rep. Brad Wenstrup, then-chairman of the House Select Subcommittee on the Coronavirus Pandemic, said Cuomo made \"multiple criminally false statements\" to Congress about his handling of the 2020 COVID-19 nursing home death scandal.\n\nCuomo, who was governor at the time, issued a March 2020 directive that initially barred nursing homes from refusing to accept patients who had tested positive for COVID-19. The directive was aimed at freeing up beds for overwhelmed hospitals.\n\nMore than 9,000 recoveringcoronavirus patientswere released from hospitals into nursing homes under the directive, which was later rescinded amid speculation that it had accelerated outbreaks.\n\nSECOND COVID NURSING HOME DEATH'S CASE AGAINST CUOMO TOSSED\n\nFormer New York Gov. Andrew Cuomo arrives to testify before the Select Subcommittee on the Coronavirus Pandemic in the Rayburn House Office Building at the U.S. Capitol on Sept. 10, 2024, in Washington, D.C.(Kent Nishimura)\n\nThe eight plaintiffs in the case argued that their loved ones contracted COVID-19 in nursing homes and died as a result of the directive. They accused Cuomo and his administration of being civilly liable for their deaths as well as being liable for failing to accurately report the number of nursing home deaths in New York state that resulted from the virus.\n\nCuomo has previously said that the directive was based on the Centers for Disease Control and Prevention (CDC) and Centers for Medicare and Medicaid Services (CMS) guidance at the time.\n\nA report released in March 2022 by the New York state comptroller foundCuomo's Health Department\"was not transparent in its reporting of COVID-19 deaths in nursing homes\" and it \"understated the number of deaths at nursing homes by as much as 50%\" during some points of the pandemic.\n\nIn a letter to Attorney General Pam Bondi last month, Comer said \"to our knowledge, the Biden Administration ignored this referral despite clear facts and evidence.\" He requested that Bondi review the referral and \"take appropriate action.\"\n\n\"Andrew Cuomo is a man with a history of corruption and deceit, now caught red-handed lying to Congress during the Select Subcommittee’s investigation into the COVID-19 nursing home tragedy in New York,\" Comer said in a statement Monday. \"This wasn’t a slip-up – it was a calculated cover-up by a man seeking to shield himself from responsibility for the devastating loss of life in New York’s nursing homes. Let’s be clear: lying to Congress is a federal crime. Mr. Cuomo must be prosecuted to the fullest extent of the law. The House Oversight Committee is prepared to fully cooperate with the Justice Department’s investigation into Andrew Cuomo’s actions and ensure he’s held to account.\"\n\nFox News Digital’s Michael Dorgan and Danielle Wallace contributed to this report.\n\nGreg Wehner is a breaking news reporter for Fox News Digital.\n\nStory tips and ideas can be sent to Greg.Wehner@Fox.com and on Twitter @GregWehner.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}