{
    "question": "How might the enforcement of REAL ID at TSA checkpoints affect domestic travel logistics and travelers’ privacy and security concerns, particularly for those without compliant IDs?",
    "content": {
        "source_1": "After years of delays, people boarding flights domestically in the United States will need to present REAL ID-compliant forms of identification at airports in a major change for travelers across the country.\n\nAs of Wednesday, certain standard driver’s licenses and other identification cards will no longer meet federal standards for people seeking to fly within the United States and for access to some federal facilities,according to the Department of Homeland Security.\n\nResidents have scrambled to motor vehicle offices nationwide to upgrade their IDs to meet the deadline, andstate officials have warned about overcrowding and long lines.\n\nAs the policy is set to take effect this week, here’s what you need to know about REAL ID.\n\nA REAL ID is a security-enhanced, state-issued driver’s license, learner’s permit or nondriver identification card that is offered by all 50 states.\n\n“Beginning May 7, 2025 every state and territory resident will need to present a REAL ID-compliant license/ID, or another acceptable form of identification, for accessing federal facilities, entering nuclear power plants, and boarding commercial aircraft,” according to the DHS website. “The card, itself, must be REAL ID compliant unless the resident is using an alternative acceptable document such as a passport or passport card, or state-issued Enhanced Driver’s License.”\n\n“Starting on May 7, 2025, a state-issued driver’s license or ID that is not REAL ID compliant will no longer be accepted as a valid form of identification at airports,” the TSA said on its website.\n\nREAL ID-compliant identification cards are marked with a star on the top right corner. The star is usually black or gold and may vary depending on the state.\n\nCongress passed the REAL ID Act in 2005 to enhance security as part of the 9/11 Commission’s recommendations that the federal government “set standards for the issuance of sources of identification, such as driver’s licenses,” according to DHS.\n\nThe act changed minimum security standards, and it prohibits federal agencies such as DHS and the Transportation Security Administration from accepting certain identification cards that aren’t REAL ID-compliant and don’t meet the act’s standards.\n\nPeople can get REAL IDs from their states’ driver’s licensing agencies and should check the agencies’ websites to find out the exact requirements, according to the DHS.\n\nDHS said on its website that at a minimum, people must provide documentation showing: full legal name, date of birth, Social Security number, two proofs of address and lawful immigration status.\n\nCertain states may impose additional requirements, so it’s important to check your state’s driver’s licensing agency’s website before going in person.\n\nAccording to the TSA’s website, it may take up to three weeks to get your REAL ID in the mail and the agency “will not accept the temporary paper card given at the DMV.”\n\nIf people present identification that isn’t REAL ID-compliant at TSA checkpoints and also don’t have acceptable, alternative forms of identification, such as passports or Enhanced IDs, they “may be directed to a separate area and may receive additional screening. This includes TSA PreCheck passengers,”the TSA said on its website.\n\nA TSA officer may ask those passengers to complete an identity verification process, and “if your identity is confirmed, you will be allowed to enter the screening checkpoint, where you may be subject to additional screening.”\n\n“You will not be allowed to enter the security checkpoint if you choose to not provide acceptable identification, you decline to cooperate with the identity verification process, or your identity cannot be confirmed,” the TSA said.\n\nA passport is still necessary for adults and children who are traveling internationally, but to travel domestically, adults will need one valid form of ID, such as a REAL ID or a passport.\n\nNo. For domestic travel, the TSA doesn’t require children under 18 to provide identification when they are traveling with companions. Companions do have to present an acceptable form of identification, according to DHS. Children will still need passports for international travel.\n\nYes. According to DHS, other forms of acceptable identification for domestic travel include passports and Enhanced ID cards.\n\nSteve Lorincz, the TSA’s deputy executive assistant administrator for security operations, told NBC News on Tuesday that “one of the things that we would recommend is just give yourself plenty of time not only for parking but checking in with the airlines, and give yourself the opportunity to make sure that you go through the screening process.”\n\nDaniella Silva is a national reporter for NBC News, focusing on immigration and education.",
        "source_2": "Reporting by David Shepardson\nEditing by Marguerita Choy\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nBritish Prime Minister Keir Starmer is \"gravely concerned\" about the repeated targeting of journalists in Gaza, his spokesperson said on Monday, after five reporters were killed in an Israeli airstrike.\n\nReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.\n\nAccess unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.\n\nBrowse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.\n\nScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.\n\nAll quotes delayed a minimum of 15 minutes.See here for a complete list of exchanges and delays.",
        "source_3": "Travelers are bracing for chaos when the new REAL ID restrictions are finally enforced Wednesday — with major airportsprepping for widespread confusionand Americans scrambling to get their hands on compliant identification before jetting off.\n\nStarting from May 7, the Transportation Security Administration will no longer accept state-issued driver’s licenses or identification cards that aren’t “REAL ID” compliant when boarding domestic flights in the United States.\n\nIn preparation for the rollout, the Transportation Security Administration (TSA) has been warning for months that travelers could be denied access to flights if they don’t have the enhanced IDs, which — in most states — features a star or flag symbol in the top corner of the card.\n\nHomeland Security Secretary Kristi Noem acknowledged Tuesday, though, that air travelers who still lack appropriate IDswill still be able to fly— for now — but they should prep for enhanced security procedures at airports across the country.\n\n“If it’s not compliant, they may be diverted to a different line, have an extra step, but people will be allowed to fly,” Noem told a US House hearing on the eve of the deadline.\n\nNoem noted that security checkpoints would also be accepting passports and tribal identification when the deadline hits Wednesday — and that 81% of travelers already have IDs that comply with the REAL ID requirements.\n\nShe vowed, too, that they would be working to ensure the rollout is as “seamless as possible” just as the summer travel season starts to take off.\n\nTSA insisted there were plans in place to offset any potential confusion with the new rules.\n\n“TSA is planning accordingly to ensure no impact to wait times or TSA screening operations,” Lisa Farbstein, a TSA spokesperson in the New York City region, told The Post.\n\n“Passengers who present a state-issued identification that is not REAL ID compliant at TSA checkpoints and who do not have another acceptable alternative form of ID will be notified of their non-compliance, may be directed to a separate area and may receive additional screening.”\n\n“TSA will enforce REAL ID in a manner that minimizes the impact to overall operations and especially for those passengers who are prepared with their REAL ID, passport or other acceptable form of ID,” she added.\n\nGov. Kathy Hochul said last week that the state had been working with the Port Authority of New York and New Jersey ahead of the transition to REAL ID — including extra staffing and ensuring “clear operational plans” at security checkpoints.\n\nShe called on New Yorkers to allow for extra travel time, particularly at John F. Kennedy International Airport and LaGuardia Airport, and to carry their passports for domestic flights if possible.\n\nDespite the assurances of a seamless transition, passengers and airlines were still readying themselves for potential terminal mayhem given theless-than-smooth rollout so far.\n\nAs the deadline inched closer, those scrambling to get new IDs were reporting lines out the door at some DMVs.\n\nOthers, meanwhile, havestruggled to even get appointmentsat motor bureaus and have experienced lengthy delays in actually receiving the new ID card in the mail.\n\nThe rollout itself has also been plagued by delays.\n\nREAL ID, a federally compliant state-issued license or identification card that Homeland Security says is a more secure form of identification, was supposed to be rolled out in 2008 after being signed into law.\n\nIn December 2022, the TSA pushed back the enforcement deadline until May 2025."
    }
}