{
    "question": "In what ways could Dr. Vinay Prasad’s appointment to lead the FDA’s vaccines and biologics program influence the agency’s evidence standards, public trust in vaccines, and the biotech industry’s outlook?",
    "content": {
        "source_1": "The US Food and Drug Administration has named Dr. Vinay Prasad, a hematologist oncologist, to lead its Center for Biologics Evaluation and Research, the division that oversees vaccines and biologic medicines.\n\nPrasad, a professor at the University of California San Francisco, became a harsh critic of the government’s response and its vaccine policies during the Covid-19 pandemic. He replaces Dr. Peter Marks, who helped lead the division for 13 years and shaped the Operation Warp Speed effort to rapidly develop Covid-19 vaccines and treatments.\n\nRelated articleFDA may ask Novavax to conduct additional trials of its Covid-19 vaccine to receive full approval\n\nMarksresigned from the agencyin March with a letter criticizing US Health and Human Services Secretary Robert F. Kennedy Jr.’s stance on vaccine safety.\n\n“It has become clear that truth and transparency are not desired by the Secretary, but rather he wishes subservient confirmation of his misinformation and lies,” Marks wrote.\n\nPrasad has vocally criticized the Warp Speed effort, and Marks’ leadership, on his blog and the social media platform X, where he wasoften praisedby now-FDA Commissioner Dr. Marty Makary for criticizing school shutdowns, mask policies and booster recommendations for the Covid-19 shot.\n\nIn an email to FDA staff obtained by CNN, Makary wrote that Prasad has a “long and distinguished history in medicine” and cites his extensive oncology research.\n\nPrasad’s appointment to lead the Center for Biologics Evaluation and Research comes as the FDA says it will impose new requirements for future vaccines to undergo placebo studies.\n\nPublic health officials are also weighing a reversal on Covid-19 vaccine recommendations for children. Prasad has vocally questioned authorizing those shots for children, because they are at lower risk of severe infection than older people and those with weakened immune systems.\n\nRelated articleHHS touts universal flu, coronavirus vaccine initiative while casting doubt on future of seasonal Covid-19 shots\n\nBiotech stocks tumbled more than 5% in the hours after the announcement as industry analysts called Prasad an “anti-establishment” choice and noted that he has also questioned the FDA’s used of accelerated approval processes for certain medicines.\n\nSarepta Therapeutics, manufacturer of one of those accelerated new medicines, saw its stock fall by nearly a quarter. Prasad has been critical of the FDA’s decision to approve Sarepta’s Elevidys, a multimillion-dollar gene therapy to treat Duchenne muscular dystrophy, despite what he saw as limited evidence of its benefits.\n\nPrasadco-wrotea post last year that said, “Despite its high cost and potential toxicity, the clinical benefits of Elevidys remain uncertain.”\n\nUnder his leadership, the biologics division could bring more scrutiny and requirements to developers creating new gene therapies. Earlier this year, Prasad said he wanted to see more stringent reviews,writing on Xthat “The FDA did nothing to speed gene therapy, other than talk about how they will use uncontrolled endpoints. But we want to speed effective gene therapy, not ineffective gene therapy. The FDA had no solution for that.”\n\nBiotech stocks were “nearly as weak” Tuesday as they were the day after President Trump announced that Kennedy would lead HHS, Mizuho Group analyst Jared Holz wrote in a note to investors.",
        "source_2": "Dan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nDr. Vinay Prasad, a known critic of both the pharmaceutical industry and the Food and Drug Administration, has been appointed to lead theFDA's program overseeing vaccines and biotechnology drugs.\n\nFDA Commissioner Dr. Marty Makary announced the decision in a message to staff on Tuesday, lauding Prasad's \"long and distinguished history in medicine.\" The FDA falls under the guidance of Health SecretaryRobert F. Kennedy Jr.\n\nPrasad's appointment marks the latest addition of a medical skeptic and vocal critic of COVID-19 policies to the federal health leadership under PresidentDonald Trump. His predecessor, Peter Marks, abruptly resigned in March over disagreements with Kennedy.\n\nPrasad's new role has traditionally been held by an FDA career scientist, but he will be moving from his position as a hematologist-oncologist and professor at the Department of Epidemiology and Biostatistics at theUniversity of California, San Francisco.\n\nThe appointment could raise more questions around the scrutiny vaccines and other new medications face. His new boss, Kennedy, has also been vocal in his skepticism of vaccines and their long-debunked links to conditions such as autism.\n\nIn a post about Marks on X, formerlyTwitter, Prasad said his predecessor was like \"a bobblehead doll that just stamps approval.\" He has also said that the United States would potentially be better off without the FDA as it is today.\n\nPrasad came to prominence for a series of papers scrutinizing the evidence behind new cancer therapies. He and his colleagues said that many cancer drugs fast-tracked by the agency he will now work for had never been proven to improve or extend lives, but were instead judged on abilities such as shrinking tumors.\n\nThe FDA has long defended this practice as a way of accelerating approval of medicines for desperately ill patients.\n\nPrasad's criticisms of COVID-19 public health measures, including mask mandates, brought him more attention and raised concerns about how quickly vaccine boosters fromPfizerand Moderna were made available.\n\nAnother concern raised by Prasad and his colleagues was the recommendation to give teens and young adults, particularly males, the booster despite signs of a higher rate of myocarditis, or a rare form of mild heart inflammation.\n\nPrasad then appeared on podcasts related to Kennedy's \"Make America Healthy Again\" campaign, which has also been seen to criticize the FDA.\n\nFDA Commissioner Dr. Martin Makary, on X Tuesday:\"Dr. Prasad brings the kind of scientific rigor, independence, and transparency we need at CBER — a significant step forward.\"\n\nTimothy Caulfield, a health law professor and media personality, on X:\"Zero surprise. Perfect MAGA fit. Another contrarian voice. Do these academics reflect: 'I'm totally cool enabling RFK jr's harmful lies & this anti-science authoritarian regime. My legacy is darkness.'\"\n\nJohn Mandrola, MD, a heart doctor, on X:\"If you care about evidence-based practice, there's no better choice than VP. This is a win for US healthcare and a giant step forward in regaining lost trust.\"\n\nThe Department of Health and Human Services (HHS) recently announced a new vaccine program, which will aid in developing shots for pandemic-prone viruses. A target of 2029 was set for initial FDA approval, potentially under Prasad's leadership.\n\nThis article contains reporting by the Associated Press.\n\nUpdate 5/6/25, 4:01 p.m. ET: This article was updated with additional information.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security.                                    ...Read more",
        "source_3": "Agency commissioner Dr. Marty Makary announced Tuesday that Dr. Vinay Prasad, a prominentCOVID–19 vaccinecritic, has been appointed to lead theFood and Drug AdministrationCenter, which oversees the approval of vaccines and other biologicsproducts.\n\nPrasad, currently a physician-scientist and professor at the University of California, San Francisco, gained a following during the pandemic for criticizing mask mandates, lockdowns, and COVID-19 vaccine boosters.\n\nMakary and Prasadco-authored a paper in 2022in theBritish Medical Journal, finding that COVID-19 booster mandates for teenagers and young adults did more harm than good, particularly causing severe cardiac problems for young males.\n\nMakary posted on X on Tuesday afternoon that Prasad would lead the Center for Biologics Evaluation and Research.\n\n“With 500+ peer-reviewed publications and two books, Dr. Prasad brings the kind of scientific rigor, independence, and transparency we need at CBER—a significant step forward,” wrote Makary.\n\nI’m proud to welcome Dr. Vinay Prasad, MD, MPH, as the new head of FDA’s Center for Biologics Evaluation & Research. With 500+ peer-reviewed publications and two books, Dr. Prasad brings the kind of scientific rigor, independence, and transparency we need at CBER—a significant…\n\nPrasad has long been critical of mRNA COVID-19 vaccines and the FDA’s decision to grant emergency use authorization. He has questioned the yearly booster vaccines encouraged by the FDA and theCenters for Disease Control and Prevention.\n\nPrasad last week published anarticle onhis Substack arguing for randomized clinical trials for COVID-19 booster shots. He cited that booster uptake rates “remain abysmal” because “the American people have shown they are unwilling to get an unproven annual booster.”\n\nPrasad has also been highly critical of Dr. Peter Marks, who headed CBER from 2016 until he resigned in March. Marks played a central role in Operation Warp Speed during Trump’s first term to develop mRNA COVID-19 vaccines.\n\nMarks, in hisresignation letter, alluded to the anti-vaccine rhetoric of Health and Human Services SecretaryRobert F. Kennedy Jr., among others in the Trump administration, as the reason for his departure. He said that using the FDA to undermine confidence in vaccines “is irresponsible, detrimental to public health, and a clear danger to our nation’s health, safety, and security.”\n\nTOP FDA OFFICIAL RESIGNS AFTER AGENCY SHAKE-UP UNDER TRUMP: ‘IT WAS TIME’\n\nShortly before Marks resigned, Prasad called him “a bobblehead doll that just stamps approval and you would have the same outcome at FDA with lower administrative fees.”\n\nYou could replace Peter Marks with a bobblehead doll that just stamps approval and you would have the same outcome at FDA with lower administrative fees.Maybe something DOGE should consider.\n\nThe health biotechnology sector reacted poorly to Prasad’s appointment, as stock prices in the industryfellby more than 6% by Tuesday afternoon. As a specialist in cancer and blood disorders, Prasad has publishedresearchshowingthat several cancer drugs fast-tracked by the FDA were not provento improve patient outcomes orextend their lives directly,instead shrinking tumor size and conferring other indirect benefits."
    }
}