{
    "question": "In what ways could reinstating the Presidential Fitness Test and reestablishing the President’s Council on Sports, Fitness and Nutrition influence school priorities and student health, and how should implementation balance performance-based standards with individualized, inclusive approaches?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nPresident Donald Trump reestablished the Presidential Fitness Test for American schoolchildren, as “an important step in our mission to make America healthy again.”\n\n▶ Follow live updates onPresident Donald Trump and his administration\n\nWASHINGTON (AP) —President Donald Trump on Thursdayreestablished the Presidential Fitness Test for American children, a fixture of public schools for decades that gauged young people’s health and athleticism with 1-mile runs, sit-ups and stretching exercises.\n\n“This is a wonderful tradition, and we’re bringing it back,” Trump said of the fitness test that began in 1966 but was phased out during the Obama administration.\n\nAn executive order he signed Thursday also reinvigorates a national sports council that the president stocked with former and current athletes and other figures from the sports world. Several prominent athletes joined Trump and top administration officials, including allies such as friend and pro golferBryson DeChambeau; and others who’ve attracted controversy such as former New York Giants linebackerLawrence Taylor, a registered sex offender.\n\nFormer NFL football player Lawrence Taylor speaks as President Donald Trump, from left, Vice President JD Vance, Cody Campbell, WWE CCO Triple H and professional golfer Bryson DeChambeau listen during an event signing an executive order restarting the Presidential Fitness Test in public schools, Thursday, July 31, 2025, in the Roosevelt Room of the White House in Washington. (AP Photo/Jacquelyn Martin)\n\nIt’s the latest athletics-related push from Trump, an avid golfer who remains enthralled with the world of sports. He played baseball in high school and plays golf almost every weekend. Much of the domestic travel he has done this year that is not related to weekend golf games at his clubs in Florida, New Jersey and Virginia was built around attending sporting events, including the Super Bowl, Daytona 500 and UFC matches.\n\nTell us about your memoriesof taking the Presidential Fitness Test.\n\n“I was always a person that loved playing sports. I was good at sports,” Trump said. “When you are really focused on sports, you’ve thought about nothing else. To an extent, this is one of the reasons I like golf. You get away for a couple of hours.”\n\nThe announcement also came as Trump readies the United States to host the 2025 Ryder Cup, 2026 FIFA World Cup games and the 2028 Summer Olympics. He also signed a different executive order earlier this monthmandating that federal authorities clarifywhether college athletes can be consideredemployees of the schoolsthey play for.\n\nTrump on Thursday said the council, known formally as the President’s Council on Sports, Fitness, and Nutrition, will also deal with various issues on college athletics, such as the transfer portal that has more easily allowed athletes to switch from school to school. The council, which will have up to 30 members, will also develop criteria for a Presidential Fitness Award. The fitness test will be administered by his health secretary, Robert F. Kennedy Jr.\n\nIn the test, children had to run and perform situps, pullups or pushups and a sit-and-reach test, but the program changed in 2012. It evolved into the Youth Fitness Program, which the government said “moved away from recognizing athletic performance to providing a barometer on student’s health.” Then-first lady Michelle Obama also promoted her “Let’s Move” initiative focused on reducing childhood obesity through diet and exercise.\n\nThe Youth Fitness Test, according to aHealth and Human Services Department websitelast updated in 2023 but still online Thursday, “minimizes comparisons between children and instead supports students as they pursue personal fitness goals for lifelong health.”\n\nAmong those who joined Trump on Thursday, in addition to DeChambeau and Taylor, were Kansas City Chiefs kickerHarrison Butker; Swedish golferAnnika Sorenstam; and WWE chief content officer Paul “Triple H” Levesque, the son-in-law of Trump’s education secretary, Linda McMahon.\n\nPresident Donald Trump signs an executive order restarting the Presidential Fitness Test in public schools as Secretary of Education Linda McMahon, from left, Treasury Secretary Scott Bessent, Commerce Secretary Howard Lutnick, Vice President JD Vance, professional golfer Bryson DeChambeau, WWE CCO Triple H and Health and Human Services Secretary Robert F. Kennedy Jr. watch, Thursday, July 31, 2025, in the Roosevelt Room of the White House in Washington. (AP Photo/Jacquelyn Martin)\n\nTaylor, who has appeared on stage with Trump at campaign rallies,pleaded guilty in New York in 2011to misdemeanor criminal charges of sexual misconduct. He was sentenced to six years of probation and ordered to register as a sex offender. He was arrested in 2021 in Broward County, Florida, and charged with failing to report a change of residence as a sex offender. He later pleaded no contest to an amended charge, was ordered to pay $261 in court fees, and the case was closed, court records show.\n\n“I’m just proud to be on this team,” Taylor said as he briefly took the microphone at the signing. “I don’t know why, I don’t know what we’re supposed to be doing, but I’m here to serve. And I’m here to serve you.”\n\nThe NFL distanced itself from comments Butker made last year during a commencement address at a Kansas college, when he said most of the women receiving degrees were probably more excited about getting married and having children than entering the workforce and that some Catholic leaders were “pushing dangerous gender ideologies onto the youth of America.” Butker also assailedPride Monthand railed against Democratic President Joe Biden’s stance on abortion.\n\nButker later formed a political action committee designed to encourage Christians to vote for what the PAC describes as “traditional values.”\n\nSorenstam faced backlash for accepting the Presidential Medal of Freedom from Trump on Jan. 7, 2021, the day after rioters spurred by Trump’s false claims about his election loss to Biden stormed the Capitol in Washington.\n\nOther well-known figures in athletics are on the council but did not attend the event Thursday. They include retired golfers Jack Nicklaus and Gary Player, former Dallas Cowboys quarterback Tony Romo, Philadelphia Eagles running back Saquon Barkley, hockey legend Wayne Gretzky and Roger Goodell, commissioner of the National Football League.\n\nThe return of the exam brought mixed reactions from some who study exercise.\n\nTrump is putting a welcome focus on physical activity, but a test alone won’t make America’s children healthier, said Laura Richardson, a kinesiology professor at the University of Michigan. The exam is only a starting point that should be paired with lessons to help all students improve, she said.\n\n“It’s not just, you get a score and you’re doomed,” said Richardson, whose teaching focuses on obesity. “But you get a score, and we can figure out a program that really helps the improvement.”\n\nAssociated Press writers Jeff Martin in Atlanta, Collin Binkley in Washington and John Wawrow in Buffalo, New York, contributed to this report.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Jenna Sundel is a Newsweek reporter based in New Jersey. Her focus is reporting on breaking news. She has in-depth knowledge of crime and courts. Jenna joined Newsweek in 2024. She previously worked at The Messenger. She is a graduate of Montclair State University. You can find her on X @jennajournalist. You can get in touch with Jenna by emailing j.sundel@newsweek.com. Languages: English.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nPresidentDonald Trumpon Thursday moved to reinstate the Presidential Fitness Test, a decades-old program designed to encourage healthy, active lifestyles among American schoolchildren.\n\nLaunched in 1966, the test once required students to run and complete exercises such as sit-ups, pull-ups or push-ups, along with a sit-and-reach flexibility assessment. It was overhauled in 2012 under the Obama administration to emphasize personal health goals rather than athletic performance.\n\nTrump \"wants to ensure America's future generations are strong, healthy, and successful,\" White House press secretaryKaroline Leavittsaid in a statement, adding that the goal is to foster \"a culture of strength and excellence for years to come.\"\n\nIn a White House ceremony Thursday afternoon, Trump signed an order reestablishing the President's Council on Sports, Fitness and Nutrition and the fitness test. Health and Human Services SecretaryRobert F. Kennedy Jr.will oversee the program, which will introduce a new Presidential Fitness Award.\n\nThe order also instructs the Council to partner with \"professional athletes, sports organizations, and influential figures,\" the White House said in a fact sheet.\n\nSeveral prominent athletes joined Trump for the order's signing, including professional golfer Bryson DeChambeau, Kansas City Chiefs kicker Harrison Butker and former New York Giants linebacker Lawrence Taylor.\n\nButker made news last year after he delivered a commencement speech at a Kansas college, where he said the majority of women graduating were more excited about marriage and children than having a career and that some Catholic leaders were \"pushing dangerous gender ideologies onto the youth of America.\"\n\nPresident Donald Trump, at the order's signing:\"This council will play an important role in shaping these new policies and ensuring that we preserve the American athletic tradition for many generations to come. And in the years ahead we'll have the chance to showcase our nation's athletic dominance on the world stage.\"\n\nHealth and Human Services Secretary Robert F. Kennedy Jr., at the order's signing:\"We need to re-instill that spirit of competition and that commitment to nutrition and physical fitness.\"\n\nThe President's Council on Sports, Fitness and Nutrition has been tasked with developing criteria for a Presidential Fitness Award.\n\nThis article includes reporting by the Associated Press.\n\nDoyou have a story thatNewsweekshouldbe covering? Do you have any questions about this story? Contact LiveNews@newsweek.com.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nJenna Sundel is a Newsweek reporter based in New Jersey. Her focus is reporting on breaking news. She has in-depth knowledge of crime and courts. Jenna joined Newsweek in 2024. She previously worked at The Messenger. She is a graduate of Montclair State University. You can find her on X @jennajournalist. You can get in touch with Jenna by emailing j.sundel@newsweek.com. Languages: English.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nJenna Sundel is a Newsweek reporter based in New Jersey. Her focus is reporting on breaking news. She has in-depth knowledge of crime and courts. Jenna joined Newsweek in 2024. She previously worked at The Messenger. She is a graduate of Montclair State University. You can find her on X @jennajournalist. You can get in touch with Jenna by emailing j.sundel@newsweek.com. Languages: English.\n\nJenna Sundel is a Newsweek reporter based in New Jersey. Her focus is reporting on breaking news. She has in-depth                                    ...Read more",
        "source_3": "PresidentTrumpon Thursday revived the Presidential Fitness Test in public schools, saying it was to ensure young Americans are healthy and active.\n\nThe program was initially created in 1966 by President Johnson and required children to run and perform sit ups, pullups, pushups and a sit-and-reach test, but the program was phased out in 2012 after the Obama administration opted to focus more on individual health than athletic tests.\n\nMr.Trumpsigned an executive order to restore the fitness test. Its implementation will be administered by Health and Human Services Secretary Robert F. Kennedy Jr. Children who receive the highest scores will receive presidential recognition.\n\nThe order says the fitness test will address “the widespread epidemic of declining health and physical fitness” and instructs the Presidential Council on Physical Fitness to partner with “professional athletes, sports organizations and influential figures.”\n\n“This was a wonderful tradition and we are bringing it back,” Mr.Trumpsaid at a White House ceremony that featured several professional athletes, including golfer Bryson DeChambeau, Kansas City Chiefs kicker Harrison Butker, NFL Hall of Famer Lawrence Taylor, former WWE Wrestler Triple H, whose real name is Paul Levesque and Swedish golfer Annika Sorenstam.\n\nThe Obama administration had eliminated the fitness test saying it was necessary to move away “from recognizing athletic performance to providing a barometer on student’s health.”\n\nPresident Obama replaced it with the Fitnessgram, which he said was more focused on individual health needs.\n\nFirst lady Michelle Obama also promoted her “Let’s Move” initiative to reduce childhood obesity through diet and exercise.\n\nReinvigorating the sports council and the fitness test fits with Mr.Trump’sfocus on athletics.\n\nThe Republican president played baseball in high school and plays golf almost every weekend. Much of the domestic travel he has done this year that is not related to weekend golf games at his clubs in Florida, New Jersey and Virginia was built around attending sporting events, including the Super Bowl, Daytona 500 and UFC matches.\n\nThe announcement Thursday comes as he readies the United States to host the 2025 Ryder Cup, 2026 FIFA World Cup games and the 2028 Summer Olympics.\n\nThe return of the exam brought mixed reactions from some who study exercise.\n\nMr.Trumpis putting a welcome focus on physical activity, but a test alone won’t make America’s children healthier, said Laura Richardson, a kinesiology professor at the University of Michigan. The exam is only a starting point that should be paired with lessons to help all students improve, she said.\n\n“It’s not just, you get a score and you’re doomed,” said Ms. Richardson, whose teaching focuses on obesity. “But you get a score, and we can figure out a program that really helps the improvement.”\n\nThis article is based in part on wire service reports.\n\n• Jeff Mordock can be reached atjmordock@washingtontimes.com.\n\nCopyright © 2025 The Washington Times, LLC.Click\n                            here for reprint permission.\n\nPope Leo should tell Catholics: Marry young, have many children\n\nTrump’s TikTok delays undermine his China hawks while Intel controversy grows"
    }
}