{
    "question": "In what ways could the AfD’s extremist designation and the accompanying surveillance powers reshape Germany’s democratic norms, civil liberties, and the party’s standing after its second-place finish in the national elections?",
    "content": {
        "source_1": "Secretary of State Marco Rubio advised Germany to “reverse course” following the domestic intelligence agency’s decision, which grants German authorities increased oversight and surveillance over the party.\n\nA man stands in front of the logo at the AfD party headquarters in Berlin, Germany, Feb. 23, 2025, after the German national election. | Michael Probst/AP\n\nSecretary of State Marco Rubio condemned a decision Friday by Germany’s domestic intelligence agency to classify the political party Alternative for Germany (AfD) as a right-wing extremist organization, calling the move “tyranny in disguise.”\n\n“What is truly extremist is not the popular AfD—which took second in the recent election—but rather the establishment’s deadly open border immigration policies that the AfD opposes,” Rubiowrote in a post on Xin the hours following the decision.\n\n“Germany just gave its spy agency new powers to surveil the opposition,” he wrote. “That’s not democracy—it’s tyranny in disguise.”\n\nThe decision by Germany’s Federal Office for the Protection of the Constitution, gives authoritiesincreased oversight and surveillanceover AfD. While some branches of the party at the state level have received the label — such as in Saxony and Thuringia — this is the first time in modern German history that a party with nationwide representation on the federal level has been classified as extremist.\n\nThe party won a record 152 parliament seats after receiving nearly 21 percent of the vote in the February federal elections.\n\nAfter conducting a three-year-long investigation into the party, the Federal Office for the Protection of the Constitution released a 1,000 page report, citing violations of core constitutional principles including human dignity and the rule of law.\n\n“This is democracy. This decision is the result of a thorough & independent investigation to protect our Constitution & the rule of law,” the official X account for the German Foreign Officewrote in a replyto Rubio’s post. “It is independent courts that will have the final say. We have learnt from our history that rightwing extremism needs to be stopped.”\n\nPresident Donald Trump and his inner circle have been largely supportive of the AfD. Its co-leader, Alice Weidel, wasone of many foreign leadersinvited to attend Trump’s inauguration. Elon Musk has shownsupport for the partyand spoke at an election campaign event in January.\n\n“Banning the centrist AfD, Germany’s, most popular party, would be an extreme attack on democracy,” Muskwrote in a post on X.",
        "source_2": "Shane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nAlliance for Germany (AfD) has been declared a \"proven right-wing extremist endeavor\" and \"not compatible\" with a free democracy by Germany's domestic intelligence agency, unlocking new surveillance powers to keep tabs on the party.\n\nAfD, which wants to see large-scale deportations, has repeatedly denied that it is an extremist group and says it is representing the views of most Germans on issues like mass immigration, Islam, and traditional Christian values.\n\nThe party,endorsed by American billionaire Elon Musk, came second in Germany's recent elections. It was previously suspected of having extremist tendencies, but the Federal Office for the Protection of the Constitution (BfV) said this is now confirmed.\n\nGermany's history with the Nazi Party makes it acutely sensitive to far-right extremism. But voter discontent with mass migration from Muslim-majority countries, and the experience of recent terror attacks, is helping to fuel a far-right resurgence.\n\nThe BfV, which has warned of growing extremism in Germany, cited court decisions in two German regions in recent years that detailed party efforts to undermine a free and democratic order.\n\n\"The prevailing understanding of ethnicity and descent in the party is not compatible with the free democratic basic order,\" the BfV said.\n\n\"It aims to exclude certain population groups from equal participation in society, to expose them to unequal treatment that is not in conformity with the constitution and thus to assign them a legally devalued status.\n\n\"Specifically, the AfD, for example, does not consider German citizens with a migration history from Muslim countries to be equal members of the German people ethnically defined by the party.\"\n\nThe BfV said this \"exclusionary understanding is the starting point and ideological basis for continuous agitation against certain persons or groups of people\".\n\nThe party had already come under scrutiny from the BfV for its links to extremists and its ties to Russia. Of the 38,800 far-right extremists counted by the agency last year, more than 10,000 are members of the party.\n\nUnder the latest move, any surveillance of AfD activities must abide by a \"principle of proportionality\" under German law.\n\nThe measure does not amount to a ban of the party, which can only take place through a request by either of parliament's two chambers or the federal government through the Federal Constitutional Court.\n\nAfDcalled the BfV's decision \"a severe blow to German democracy,\" noting that the government would change over in a few days after the most recent election, and that the spy agency did not currently have a president.\n\n\"Nevertheless, the AfD, as an opposition party, is now being publicly discredited and criminalized shortly before the change in government,\" said the statement byAfD co-leaders Alice Weidel and Tino Chrupalla.\n\n\"This deliberate interference in the democratic process of forming political will is clearly politically motivated. The AfD will continue to legally challenge these defamatory actions that endanger democracy.\"\n\nNancy Faeser, the German interior minister, said in a statement that the classification was \"clear and unambiguous\" and had resulted from a 1,100-page \"comprehensive and neutral audit\" that had no political influence.\n\nAfD could appeal the decision in Germany's courts. It likely now faces deeper scrutiny from German intelligence.\n\nBut it will not form part of the next German government after the other parties agreed to form a coalition that will shut the AfD out, despite its finishing in second place.\n\nThis article includes reporting by The Associated Press.\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check                                    ...Read more",
        "source_3": "American Majority founder and CEO Ned Ryun joins 'FOX & Friends' to analyze the conservative party winning the chancellor's election in Germany.\n\nGermany’s domesticintelligence agency, the Federal Office for the Protection of the Constitution or BfV, on Friday classified the country’s popular Alternative for Germany (AfD) party as \"extremist.\"\n\n\"Central to our assessment is the ethnically and ancestrally defined concept of the people that shapes the AfD, which devalues entire segments of the population in Germany and violates their human dignity,\" the BfV said, explaining its decision. \"This concept is reflected in the party’s overall anti-migrant and anti-Muslim stance.\"\n\nThe AfD slammed the decision, calling it a \"blow against democracy,\" claiming it was \"clearly politically motivated,\" which the BfV denied.\n\nThe U.S. also criticized the designation, with Secretary ofState Marco Rubioclaiming it is \"tyranny in disguise.\"\n\nGERMANY ACCUSES ELON MUSK OF TRYING TO INTERFERE IN ITS NATIONAL ELECTIONS\n\nAlice Weidel, co-leader of the country's popular Alternative for Germany political party, speaks at an event in January.(Sean Gallup/Getty Images)\n\n\"Germany just gave its spy agency new powers to surveil the opposition,\"Rubio posted on X. \"That’s not democracy—it’s tyranny in disguise. What is truly extremist is not the popular AfD—which took second in the recent election—but rather the establishment’s deadly open border immigration policies that the AfD opposes. Germany should reverse course.\"\n\nElon Musk wroteon X: \"Banning the centrist AfD, Germany's, most popular party, would be an extreme attack on democracy.\"\n\nAfD leaders Alice Weidel and Tino Chrupalla said, \"The AfD will continue to take legal action against these defamatory attacks that endanger democracy.\"\n\nVice President JD Vance met with Weidel before the election and said that free speech was under attack in Europe.\n\nAn emblem of Germany's Bundesamt fuer Verfassungsschutz (BfV), the country's domestic intelligence service.(Reuters/Wolfgang Rattay )\n\nThe BfV also classifies the neo-Nazi National Democratic Party (NDP), the Islamic State and other Islamist groups, and the far-left Marxist-Leninist Party of Germany as \"extremist.\"\n\nThe classification allows the intelligence agency to closely surveil the AfD, which came in second in Germany’s February elections, winning a record number of seats in parliament.\n\nGermany’s intelligence agency is more legally constrained than other European countries in its ability to surveil political parties, which requires the \"extremist\" designation, because of its history under Nazi and Communist rule.\n\nThe designation also allows the intelligence service to intercept party communications.\n\nThe \"extremist\" designation followed a 1,100-page report by the intelligence agency, and a court case loss for AfD in challenging the BfV’s previous classification of the political party as one suspected of extremism.\n\nSecretary of State Marco Rubio called the intelligence service's designation \"tyranny in disguise.\"(Kevin Dietsch/Getty Images)\n\nConservative leaderFriedrich Merz,who heads theChristian Democratic Union (CDU), will be confirmed as chancellor next week following the elections in a coalition government with the center-left Social Democrats.\n\nBoth Merz and the Social Democrats ruled out governing with the AfD.\n\nCDU, along with its Bavarian sister party the Christian Social Union (CSU), won Germany’s elections in February after garnering 28.6% of the vote, according to Germany’s international broadcasterDeutsche Welle(DW).\n\nThe AfD secured 20.8% of the vote. Meanwhile, outgoing Chancellor Olaf Scholz’s Social Democratic Party (SPD) won just 16.4% of the vote, its worst result since World War II.\n\nFox News Digital's Rachel Wolf and Reuters contributed to this report.\n\nFox News' Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.\"\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}