{
    "question": "What are the potential policy, financial, and public-interest consequences of directing the Bureau of Prisons to rebuild and reopen Alcatraz, given its current role as a national park and the costs of operating an isolated island facility?",
    "content": {
        "source_1": "President Donald Trumpsaid on May 4 that he isordering the Federal Bureau of Prisons to reopen Alcatraz, the infamous prison island in San Francisco Bay that closed more than six decades ago.\n\nTrump said in apost on Truth Socialthat he wanted to reopen the prison to \"house America’s most ruthless and violent Offenders.\"\n\n\"The reopening of ALCATRAZ will serve as a symbol of Law, Order, and JUSTICE,\" he wrote.\n\nThe prison was known for housing some of the nation's most notorious criminals, such as Al Capone, according to theBureau of Prisons.\n\nIt eventually closed in 1963 after operating for nearly 30 years, but was reopened to the public as a museum ten years later, according to BOP.\n\nHere's what to know about Alcatraz, including why it closed.\n\nAlcatraz is an island in San Francisco Bay that was used as a prison from 1934 to 1963, according to BOP.\n\nThe island was discovered in 1775 by Spanish explorer Juan Manuel de Ayala, who named it \"Isla de los Alcatraces,\" which translates to island of the pelicans. It was shortened and Americanized over time, which is how it became known as Alcatraz, according to theNational Park Service.\n\nIt was used as a military fort from 1850 to 1933, during which military prisoners were also housed on the island, according to BOP.\n\nIn 1933, the Department of Justice took over Alcatraz to open a maximum security prison for some of the nation's most dangerous criminals.\n\nAfter 29 years of operation, Alcatraz was closed in 1963. It sat abandoned until 1969, when a group of Native American activists occupied the island and remained there for the next two years, according toNPS.\n\nIn 1973, the NPS opened Alcatraz as a public museum. It has more than one million visitors per year, making it one of the most popular national parks, according to BOP.\n\nMore:Reopen The Rock? Trump's idea for Alcatraz has been tried before.\n\nAlcatraz is an island in San Francisco Bay about 1.5 miles off shore and 22 acres in size, according to theGolden Gate National Parks Conservancy.It's about 3 miles away from the Golden Gate Bridge, according toPacific Open Water Swim Co.\n\nThe only way to reach the island is by boat, which helped the prison maintain its physical isolation from society, according to BOP.\n\nOne of the popular rumors about Alcatraz is that it is surrounded by shark-infested waters that made it impossible to swim to the mainland's shore. However, this rumor is untrue as there are only small bottom-feeding sharks in San Francisco Bay, according to BOP.\n\nSeveral prisoners attempted to escape by swimming to the mainland, but the attempts were mostly thwarted by the water's cold temperatures and strong current. Several people, including a few children and fitness coach Jack LaLanne, have successfully made the swim across the bay over the years, according to BOP.\n\nSeveral of Alcatraz's prisoners were well-known criminals, like Al Capone, George \"Machine-Gun\" Kelly and Robert \"Birdman\" Stroud. Many of the island's prisoners were considered escape risks or violent and dangerous, according to BOP.\n\nPrisoners were generally sent to Alcatraz when they would not conform to rules at other federal penitentiaries. However, despite its reputation, many prisoners preferred the conditions — such as having one man per cell — at Alcatraz compared to other federal prisons.\n\nAt Alcatraz, prisoners had a highly structured, monotonous daily routine. They had four rights — food, clothing, shelter and medical care — and other privileges, such as corresponding with family members, had to be earned.\n\nThere were 14 escape attempts over the years, though no one ever successfully escaped the island, in part due to its location.\n\nMost prisoners spent an average of five years at Alcatraz. Once the prison's officials felt that an inmate was no longer a threat and could follow rules, they were sent back to another federal prison to complete their sentence.\n\nThe prison on Alcatraz closed on March 21, 1963, because it was too expensive to continue operating, according to BOP.\n\nIt was nearly three times more expensive to operate Alcatraz than any other federal prison, in part because its physical isolation required food and supplies to be dropped off by boat.\n\nThe island also had no source of fresh water, so nearly one million gallons had to be barged in each week.\n\nAt the time of its closure, Alcatraz needed restoration and maintenance work that would have cost about $3-5 million excluding its daily operation costs.\n\nIn addition to becoming a popular tourist destination, Alcatraz has also been the subject of several Hollywood portrayals over the years.\n\nClint Eastwood starred in the 1979 film \"Escape from Alcatraz,\" a biographical drama following the real escape attempt of prisoners Frank Morris and Clarence and John Anglin.\n\nThe three men disappeared from their cells in June 1962 in an elaborate plot that included mannequin dolls with real human hair left behind in their beds,according to the FBI. They've never been found and are still wanted by theU.S. Marshals Service, though the FBI believes the men to be dead.\n\n\"The Rock,\" another film about the island titled after its nickname, was released in 1996. It stars Nicolas Cage, Sean Connery and Ed Harris and was directed by Michael Bay.\n\nMore recently, the 2018 film \"Alcatraz\" is based on the so-called \"Battle of Alcatraz,\" a 1946 escape attempt that resulted in the deaths of two prison officers and three inmates, according to BOP.\n\nThis story has been updated with a new photo gallery and additional information.\n\nMelina Khan is a trending reporter covering national news for USA TODAY. She can be reached atMKhan@gannett.com.",
        "source_2": "President Donald Trumpsays he is directing his government to reopen and expand Alcatraz, thenotorious former prisonon a hard-to-reach California island off San Francisco that has been closed for more than 60 years.\n\nIna post on his Truth Social siteSunday evening, Trump wrote that, “For too long, America has been plagued by vicious, violent, and repeat Criminal Offenders, the dregs of society, who will never contribute anything other than Misery and Suffering. When we were a more serious Nation, in times past, we did not hesitate to lock up the most dangerous criminals, and keep them far away from anyone they could harm. That’s the way it’s supposed to be.”\n\n“That is why, today,” he said, “I am directing the Bureau of Prisons, together with the Department of Justice, FBI, and Homeland Security, to reopen a substantially enlarged and rebuilt ALCATRAZ, to house America’s most ruthless and violent Offenders.”\n\nTrump’s directive to rebuild and reopen the long-shuttered penitentiary was the latest salvo in his effort to overhaul how and where federal prisoners and immigration detainees are locked up. But such a move would likely be an expensive and challenging proposition. The prison was closed in 1963 due to crumbling infrastructure and the high costs of repairing and supplying the island facility, because everything from fuel to food had to be brought by boat.\n\nBringing the facility up to modern-day standards would require massive investments at a time when the Bureau of Prisons has been shuttering prisons for similar infrastructure issues.\n\nThe prison — infamously inescapable due to the strong ocean currents and cold Pacific waters that surround it — was known as the “The Rock” and housed some of the nation’s most notorious criminals, including gangster Al Capone and George “Machine Gun” Kelly.\n\nIt has long been part of the cultural imagination and has been the subject of numerous movies, including “The Rock” starring Sean Connery and Nicolas Cage.\n\nStill in the 29 years it was open, 36 men attempted 14 separate escapes, according to the FBI. Nearly all were caught or didn’t survive the attempt.\n\nThe fate of three particular inmates — John Anglin, his brother Clarence and Frank Morris — is of some debate and was dramatized in the 1979 film “Escape from Alcatraz” starring Clint Eastwood.\n\nAlcatraz Island is now a major tourist site that is operate by the National Park Service and is a designated National Historic Landmark.\n\nTrump, returning to the White House on Sunday night after a weekend in Florida, said he’d come up with the idea because of frustrations with “radicalized judges” who have insisted those being deported receive due process. Alcatraz, he said, has long been a “symbol of law and order. You know, it’s got quite a history.”\n\nA spokesperson for the Bureau of Prisons said in a statement that the agency “will comply with all Presidential Orders.” The spokesperson did not immediately answer questions from The Associated Press regarding the practicality and feasibility of reopening Alcatraz or the agency’s role in the future of the former prison given the National Park Service’s control of the island.\n\nFormer House Speaker Nancy Pelosi, a California Democrat whose district includes the island, questioned the feasibility of reopening the prison after so many years. “It is now a very popular national park and major tourist attraction. The President’s proposal is not a serious one,” she wrote onX.\n\nThe island serves as a veritable time machine to a bygone era of corrections. The Bureau of Prisons currently has 16 penitentiaries performing the same high-security functions as Alcatraz, including its maximum security facility in Florence, Colorado, and the U.S. penitentiary in Terre Haute, Indiana, which is home to the federal death chamber.\n\nThe order comes as Trump has been clashing with the courts as he tries to send accused gang members to a maximum-security prison in El Salvador, without due process. Trump has also floated the legally dubious idea of sending some federal U.S. prisoners to the Terrorism Confinement Center, known as CECOT.\n\nTrump has alsodirected the opening of a detention centerat Guantanamo Bay, Cuba, to hold up to 30,000 of what he has labeled the “worst criminal aliens.”\n\nThe Bureau of Prisons has faced myriad crises in recent years and has been subjected to increased scrutiny after Jeffrey Epstein’s suicide at a federal jail in New York City in 2019. AnAP investigationuncovered deep, previously unreported flaws within the Bureau of Prisons. AP reporting has disclosedwidespread criminal activity by employees, dozens ofescapes, chronic violence, deaths andsevere staffing shortagesthat have hampered responses to emergencies, including assaults and suicides.\n\nThe AP’s investigation alsoexposed rampant sexual abuseat a federal women’s prison in Dublin, California. Last year, President Joe Biden signed a law strengthening oversight of the agency after AP reporting spotlighted its many flaws.\n\nAt the same time, the Bureau of Prisons is operating in a state of flux — with a recently installed new director and a redefined mission that includes taking in thousands of immigration detainees at some of its prisons and jails under an agreement with the Department of Homeland Security. The agency last year closed several facilities, in part to cut costs, but is also in the process of building a new prison in Kentucky.\n\n© 2025 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of ourTerms of UseandPrivacy Policy|CA Notice at Collection and Privacy Notice|Do Not Sell/Share My Personal InformationFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.",
        "source_3": "President Donald Trump directed the Bureau of Prisons, Department of Justice (DOJ), Federal Bureau of Investigation (FBI), and the Department of Homeland Security (DHS) to reopen and rebuild Alcatraz prison to house the “most ruthless and violent” criminals.\n\nIn a post on Truth Social, Trumpnotedthat when the United States was “a more serious Nation,” the government did not “hesitate to lock up the most dangerous criminals.”\n\n“REBUILD, AND OPEN ALCATRAZ!” Trump wrote. “For too long, America has been plagued by vicious, violent, and repeat Criminal Offenders, the dregs of society, who will never contribute anything other than Misery and Suffering. When we were a more serious Nation, in times past, we did not hesitate to lock up the most dangerous criminals, and keep them far away from anyone they could harm.”\n\nTrump pointed out that that was “the way it’s supposed to be” and added that the U.S. would not tolerate “these Serial Offenders who spread filth, bloodshed, and mayhem” on the streets.\n\n“That is why, today, I am directing the Bureau of Prisons, together with the Department of Justice, FBI, and Homeland Security, to reopen a substantially enlarged and rebuilt ALCATRAZ, to house America’s most ruthless and violent Offenders,” Trump continued. “We will no longer be held hostage to criminals, thugs, and Judges that are afraid to do their job and allow us to remove criminals, who came into our Country illegally. The reopening of ALCATRAZ will serve as a symbol of Law, Order, and JUSTICE. We will, MAKE AMERICA GREAT AGAIN!”\n\nPeople such as notorious American gangster Al Capone and gangster “Machine Gun Kelly” were among the people who were held at Alcatraz prison, which sits on an island off the coast of San Francisco, according to theHill.\n\nOther people who were held at Alcatraz include, Robert Stroud, who was nicknamed, “Birdman of Alcatraz,” according to the Federal Bureau of Prisonswebsite.\n\nFile/Gangster Alphonse ‘Al’ Capone poses for a mugshot on his arrival at the Federal Penitentiary at Alcatraz on August 22, 1934 in San Francisco, California. (Donaldson Collection/Michael Ochs Archives/Getty Images)\n\nStroud was convicted of manslaughter in 1909. Years later, after murdering a “Leavenworth guard,” Stroud was “convicted of first-degree murder” and ended up receiving a death sentence, though former President Woodrow Wilson commuted his sentence down to life in prison, according to the website.\n\nAlcatraz, which served as a federal prison from 1934 to 1963, is described as representing “the federal government’s response to post-Prohibition, post-Depression America,” according to the National Park Service’swebsitefor Alcatraz."
    }
}