{
    "question": "How should public health leaders respond to the record-high 2025 measles cases to prevent loss of elimination status while rebuilding vaccination uptake to the 95% herd-immunity threshold?",
    "content": {
        "source_1": "Experts worry that if vaccination rates do not improve, deadly outbreaks will become the new normal.\n\nMeasles spread through N.Y. Orthodox Jewish communities in 2019\n\nIn 2000, measles was declared eliminated in the United States\n\nIn 2000, measles was declared eliminated in the U.S.\n\nThere have now been more measles cases in 2025 than in any other year since the contagious virus was declared eliminated in the United States in 2000, according to new data released Wednesday by the Centers for Disease Control and Prevention.\n\nThe grim milestone represents an alarming setback for the country’s public health and heightens concerns that if childhood vaccination rates do not improve, deadly outbreaks of measles — once considered a disease of the past — will become thenew normal.\n\nExperts fear that with no clear end to the spread in sight, the country is barreling toward another turning point: losing elimination status, a designation given to countries that have not had continuous spread of measles for more than a year.\n\n“It’s a huge red flag for the direction in which we’re going,” said Dr. William Moss, an epidemiologist at the Johns Hopkins Bloomberg School of Public Health who has studied measles for more than 25 years.\n\nMost of the cases this year have been tied to the Southwest outbreak — thelargest single outbreaksince 2000 — which began in January in a Mennonite community in West Texas and has since jumped to New Mexico and Oklahoma.\n\nBut cases have also popped up in 38 states, which experts say represents a concerning vulnerability to diseases of the past. Because of the contagiousness of the virus, researchers often think of measles as the proverbial canary in a coal mine. It is often the first sign that other vaccine-preventable diseases, like pertussis and Hib meningitis, might soon become more common.\n\nOurmeasles trackermaps cases nationwide | Sources: State and county health departments; Centers for Disease Control and Prevention\n\nAs new cases are reported, our maps show the spread of the virus.\n\nWe are having trouble retrieving the article content.\n\nThank you for your patience while we verify access. If you are in Reader mode please exit andlog intoyour Times account, orsubscribefor all of The Times.\n\nThank you for your patience while we verify access.",
        "source_2": "Adeola Adeosun is the Newsweek Weekend Night Editor based in Atlanta, Georgia. Her focus is reporting on U.S. national news, politics and trends. Adeola joined Newsweek in 2024 and has previously worked for CNN, Bossip, and The Messenger. You can get in touch with Adeola by emailing a.adeosun@newsweek.com. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nThe United States is experiencing its worstmeasles outbreaksince the disease was declared \"eliminated\" in 2000, with 1,277 confirmed cases reported as of July 5, according to Johns Hopkins University Center for Outbreak Response Innovation.\n\nThis figure has already surpassed the 1,274 cases recorded during the peak year of 2019, marking a critical public health milestone reached just halfway through 2025.\n\nThis outbreak directly challenges the nation's measles elimination status, achieved 25 years ago through sustained vaccination efforts.Measles ranks among the most contagious infectious diseases, with 92 percent of unvaccinated people contracting the virus upon exposure.\n\nThe U.S. Centers for Disease Control and Prevention (CDC) reports that one in five infected individuals requires hospitalization, making this outbreak a significant strain on health care systems across multiple states.\n\nThe resurgence occurs amiddeclining childhood vaccination ratesnationwide since the COVID-19 pandemic, with increasing numbers of parents claiming religious or personal conscience exemptions. Communities require vaccination rates above 95 percent to maintain \"herd immunity\" and prevent widespread transmission.\n\nThe outbreak has resulted in at least 155 hospitalizations, affecting 431 adults and 824 children, with three confirmed deaths.Two elementary school-aged children died in West Texas, while one adult died in New Mexico—all were unvaccinated. The CDC confirmed that 1,267 cases were officially reported through their surveillance system as of Wednesday.\n\nThe majority of cases stem from a largeoutbreak originating in West Texas, where 753 confirmed cases have been reported across 36 counties since January. Gaines County remains the epicenter, with 55 percent of Texas cases concentrated in this area after the virus spread through a close-knit, undervaccinated Mennonite community.\n\nSome critics say Health and Human Services SecretaryRobert F. Kennedy Jr.'s efforts to contain the epidemic in the tight-knit, religious West Texas community ran counter to established public health strategies used to end past epidemics.\n\n\"The hyperpartisanship we're experiencing, coupled with the de-prioritization of policy expertise, is leading to profound divides in trust in agencies and health recommendations, and this trust will be difficult to rebuild, especially as we see the continued hollowing out of the public health bureaucracy,\" Miranda Yaver, assistant professor of health policy and management at the University of Pittsburgh, previously toldNewsweek.\n\nConfirmed measles cases have been reported by 39 states and jurisdictions, with Texas, New Mexico, and Kansas showing the highest concentrations. Active outbreaks, defined as three or more related cases, are occurring in Arizona, Colorado, Georgia, Illinois, Iowa, Kansas, Michigan, Montana, New Mexico, North Dakota, Oklahoma, and Utah. Kentucky reported its first outbreak of 2025 last month.\n\nSymptoms appear seven to 14 days after virus contact, typically including high fever, cough, runny nose, and watery eyes. The characteristic rash appears three to five days after initial symptoms, often accompanied by fever spikes exceeding 104 degrees. Koplik's spots—tiny white spots inside the mouth—may appear two to three days after symptoms begin.\n\nHealth Secretary Robert F. Kennedy Jr. confirmed the Texas deaths:\"The April 3 death was an 8-year-old child\" and \"a 6-year-old unvaccinated child with no underlying conditions died of measles in Texas in late February.\"\n\nU.S. Centers for Disease Control and Prevention emphasized prevention:\"The best way to avoid measles is to get the measles, mumps and rubella vaccine. The first shot is recommended for children between 12 and 15 months old and the second between 4 and 6 years old.\"\n\nMathew Kiang, assistant professor in the Department of Epidemiology and Population Health at Stanford University, said in an April statement:\"With measles, we found that we're already on the precipice of disaster. If vaccination rates remain the same, the model predicts that measles may become endemic within about 20 years.\"\n\nLara Anton, a spokesperson for the Texas Department of State Health Services, previously toldNewsweek:\"[Texas Department of State Health Services] DSHS has been encouraging people to get vaccinated if they are not immune to measles because it is the best way to prevent illness and stop the virus from spreading.\"\n\nMiranda Yaver, an assistant professor of health policy and management at the University of Pittsburgh, previously toldNewsweek:\"We now have over 1,000 confirmed measles cases in the United States, and this is avoidable with vaccination, which we know to be safe and effective. We are seeing the proliferation of vaccine hesitancy, with a pronounced partisan split, extending well beyond the COVID vaccine.\"\n\nPublic health authorities are intensifying vaccination campaigns and contact tracing efforts across affected states. Several states have successfully contained earlier outbreaks, including Indiana, Ohio, and Pennsylvania, after six weeks without new cases, demonstrating effective containment strategies.\n\nThe outbreak's trajectory depends on vaccination uptake in affected communities and successful isolation of infectious cases. Health officials continue monitoring international travel patterns, as the CDC reported more than twice as many measles cases originated from international travel compared to the same period last year.\n\nReporting from the Associated Press contributed to this article.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nAdeola Adeosun is the Newsweek Weekend Night Editor based in Atlanta, Georgia. Her focus is reporting on U.S. national news, politics and trends. Adeola joined Newsweek in 2024 and has previously worked for CNN, Bossip, and The Messenger. You can get in touch with Adeola by emailing a.adeosun@newsweek.com. Languages: English.\n\nAdeola Adeosun is the Newsweek Weekend Night Editor based in Atlanta, Georgia. Her focus is reporting on U.S. national news, politics and trends. Adeola joined Newsweek in 2024 and has previously worked for CNN, Bossip, and The Messenger. You can get in touch with Adeola by emailing a.adeosun@newsweek.com. Languages: English.\n\nAdeola Adeosun is the Newsweek Weekend Night Editor based in Atlanta, Georgia. Her focus is reporting on U.S. national news,                                    ...Read more",
        "source_3": "The United States reached its highest number ofmeaslescases in over 33 years on Monday, hitting 1,277 confirmed cases across 38 states and Washington, D.C.\n\nThe country reached the highest number of cases of the vaccine-preventable disease since 1992, when health officials recorded more than 2,100 cases. Measles cases have beenon the risefollowingan outbreakin WestTexasearlier this year.\n\nAt least 155 people have been hospitalized, and three people have died from measles this year. Around 92% of measles cases this year were in people who were either unvaccinated or whose vaccination status was unknown, according to the Centers for Disease Control and Prevention.\n\nTexas remains the hardest-hit state with more than 700 reported cases.\n\nMeasles was declaredeliminatedin 2000 in the U.S., but cases have increased in recent months amid rising anti-vaccine sentiment.\n\nPublic health experts have said the U.S. is slated to lose its disease elimination status if there is a continuous spread of linked measles cases for more than 12 months.\n\nJust under 93% of people in the U.S. are vaccinated against measles. According to the CDC, a 95% vaccinationthresholdmust be reached to achieve herd immunity. Measles is a highly contagious virus, with up to 90% ofunvaccinatedpeople contracting it if exposed.\n\nHURRICANE SEASON STARTS JUNE 1. HERE’S WHAT TO KNOW ABOUT CUTS TO WEATHER AGENCIES\n\nThe disease is most dangerous to children under the age of 5. Symptomsincludefever, cough, runny nose, and white spots on the skin called Koplik spots. In every 1,000 children who contract measles, one to two are projected to die.\n\nThereis nospecific cure or treatment for measles, according to the Mayo Clinic."
    }
}