{
    "question": "How might the DOJ’s record-setting $14.6 billion healthcare fraud takedown influence future policy and enforcement efforts to protect Medicare and Medicaid while maintaining access to legitimate care?",
    "content": {
        "source_1": "CMS administrator Mehmet Oz speaks during a press conference on the health care fraud enforcement. Photo: Mandel Ngan/AFP via Getty Images\n\nFederal officials on Monday said that they busted a series ofhealth fraudschemes spanning medical supply, telehealth and genetic testing companies, as well as opioid trafficking, that involved more than $14.6 billion in improper charges.\n\nWhy it matters:As part of the record-breaking operation, the Centers for Medicare & Medicaid Services announced it also prevented $4 billion in fraudulent claims from being paid.\n\nZoom in:Officials seized over $245 million in cash, luxury vehicles, cryptocurrency and other assets as part of the \"takedown.\"\n\nBetween the lines:The activity includedOperation Gold Rush, a nationwide investigation begun in 2023 that encompassed the largest loss ever recorded in a health fraud case, officials said.\n\nThe operationwas led by the Justice Department's Health Care Fraud Unit, as well as U.S. attorneys, the HHS inspector general, the FBI and the Drug Enforcement Administration.\n\nWhat they're saying:\"Today's unprecedented enforcement action demonstrates that CMS and our federal partners are united in our mission to protect the integrity of Medicare and Medicaid by crushing waste, fraud, and abuse,\" CMS administrator Mehmet Oz said in a statement.",
        "source_2": "Jenna Sundel is a Newsweek reporter based in New Jersey. Her focus is reporting on breaking news. She has in-depth knowledge of crime and courts. Jenna joined Newsweek in 2024. She previously worked at The Messenger. She is a graduate of Montclair State University. You can find her on X @jennajournalist. You can get in touch with Jenna by emailing j.sundel@newsweek.com. Languages: English.\n\nHollie Silverman is the Deputy Weekend Editor at Newsweek based out of South Carolina. Her focus is reporting on breaking news and trending topics. Hollie has reported extensively on both local and national crime trends as well as health, climate and education stories. She won an Emmy for her coverage the George Floyd Riots during her time at CNN. Hollie joins Newsweek after working as an Assistant News Director, Assignment Manager and Digital Editor at local and national television news stations throughout the US over the last 15 years. She is a graduate of SUNY Purchase College. You can get in touch with Hollie by emailing h.silverman@newsweek.com. Languages: English\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nNearly $15 billion was reported in losses in the most expensive health care fraud in United States history, Federal Bureau of Investigation Deputy Director Dan Bongino said Monday.\n\n\"Today, in conjunction with the DOJ and our federal partners, we are announcing the results from the largest healthcare fraud investigation, as measured by financial losses, in DOJ history,\" Bongino posted on X, formerlyTwitter.\n\nIn all, 50 federal districts were part of the investigation, which resulted in 324 defendants, including 96 medical professionals, being charged, and the seizure of $245 million, according to Bongino.\n\nFurther information on the scope and subject of the investigation was not immediately available.\n\n\"We view the theft of public funds the same way. It's a crime against all of us...Results matter. Talk is cheap. And this is not even the beginning of the beginning. If you're stealing from the public, or violating your oath to serve, then we're coming for you too,\" Bongino said.\n\nMatthew Galeotti, head of the Criminal Division at theDepartment of Justice, said approximately $14.6 billion was submitted in false claims to Medicare, Medicaid and other health care programs.\n\n\"Every fraudulent claim, every fake billing, every kickback scheme represents money taken directly from the pockets of American taxpayers, who fund these essential programs through their hard work and sacrifice,\" Galeotti said at a press conference.\n\nGaleotti said these schemes can increase the national deficit and threaten the long-term viability of health care for seniors, individuals with disabilities and other citizens who need these programs.\n\nLuxury vehicles and properties were also seized, Galeotti said. The DOJ identified and charged defendants operating from Russia, Pakistan and other foreign countries.\n\nGaleotti said one example of what the investigation uncovered was a scheme involving an operation by individuals from Russia and Eastern Europe who purchased dozens of medical supply companies in the U.S. and submitted more than $10 billion in fraudulent health care claims to Medicare.\n\nHe said the perpetrators used the stolen identities of more than 1 million Americans in all 50 states. Key members of the organization were arrested by federal agents at U.S. airports and the U.S.-Mexico border.\n\n\"We charged pill mill operators who prescribed unnecessary opioids,\" Galeotti said. \"We dismantled networks of corrupt pharmacies that existed solely to distribute drugs to addicts and dealers, feeding the addiction crisis that has devastated so many American communities.\"\n\nMatthew Galeotti, head of the Criminal Division at the DOJ, at a press conference:\"The days of transnational criminal organizations using the American healthcare programs as their personal piggy bank are over.\"\n\nActing Inspector General Juliet T. Hodgkins, at a press conference:\"The results announced today were only possible through a strong partnership of federal and state agencies. By working shoulder to shoulder, we harness the best information, tools, and expertise to find criminals no matter where they hide and no matter how they try to disguise their crimes.\"\n\nThe DOJ said it is collaborating with several federal agencies, including theFBIand the Department of Health and Human Services, to create a health care data fusion center to \"revolutionize\" the detection, investigation and prosecution of health care fraud.\n\nDo you have a story thatNewsweekshould be covering? Do you have any questions about this story? Contact LiveNews@newsweek.com.\n\nUpdate 6/30/25, 1:11 p.m. ET: This article was updated with additional information.\n\nUpdate 6/30, 25, 5:15 p.m. ET: This article was corrected to change \"million\" to \"billion\" in the fifth paragraph.\n\nJenna Sundel is a Newsweek reporter based in New Jersey. Her focus is reporting on breaking news. She has in-depth knowledge of crime and courts. Jenna joined Newsweek in 2024. She previously worked at The Messenger. She is a graduate of Montclair State University. You can find her on X @jennajournalist. You can get in touch with Jenna by emailing j.sundel@newsweek.com. Languages: English.\n\nHollie Silverman is the Deputy Weekend Editor at Newsweek based out of South Carolina. Her focus is reporting on breaking news and trending topics. Hollie has reported extensively on both local and national crime trends as well as health, climate and education stories. She won an Emmy for her coverage the George Floyd Riots during her time at CNN. Hollie joins Newsweek after working as an Assistant News Director, Assignment Manager and Digital Editor at local and national television news stations throughout the US over the last 15 years. She is a graduate of SUNY Purchase College. You can get in touch with Hollie by emailing h.silverman@newsweek.com. Languages: English\n\nJenna Sundel is a Newsweek reporter based in New Jersey. Her focus is reporting on breaking news. She has in-depth knowledge of crime and courts. Jenna joined Newsweek in 2024. She previously worked at The Messenger. She is a graduate of Montclair State University. You can find her on X @jennajournalist. You can get in touch with Jenna by emailing j.sundel@newsweek.com. Languages: English.\n\nJenna Sundel is a Newsweek reporter based in New Jersey. Her focus is reporting on breaking news. She has in-depth                                    ...Read more",
        "source_3": "TheJustice Departmenton Monday announced charges for 324 people, including nearly 100 medical professionals, in what the DOJ called the largest healthcare fraud takedown in U.S. history.\n\nThe $14.6 billion crackdown spanned all 50 states and included charges ranging from opioid trafficking and telemedicine fraud to transnational identity theft schemes. Of the total charged, 77 defendants were prosecuted by state attorneys general, while the remaining 247 face federal charges. Authorities said they seized over $245 million in cash, luxury vehicles, cryptocurrency, and other assets.\n\nAttorney General Pam Bondi said the takedown “delivers justice to criminal actors who prey upon our most vulnerable citizens and steal from hardworking American taxpayers.”\n\nThe healthcare fraud bust under President Donald Trump and his appointeesmarks a major step aboveefforts by the Justice Department under the Biden administration, which uncovered $2.75 billion in false claims last year, resulting in 193 defendants charged.\n\nThe announcement came as Senate Republicans advanced the One Big Beautiful Bill Act, a sweeping tax and spending package that proposes major changes to Medicaid reimbursements. All GOP senators except Sens.Thom Tillis (R-NC)andRand Paul (R-KY)voted to move the bill forward. Tillis, who announced Sunday he would not seek reelection, warned the legislation would make “devastating” changes to Medicaid.\n\nAs Washington fights over how to reform Medicaid, the DOJ’s bust hinted at the scale of criminal abuse of the healthcare system.\n\n“These criminals didn’t just steal someone else’s money — they stole from you,” said Matthew Galeotti, head of the DOJ’s Criminal Division. “This is not healthcare. It is a staggering breach of trust.”\n\nAmong the major alleged schemes was a transnational criminal ring accused of submitting $10.6 billion in fraudulent Medicare claims using the stolen identities of over 1 million U.S. residents.\n\nIn Arizona, a United Arab Emirates-based billing company allegedly defrauded Medicaid of $650 million, targeting Native American and homeless patients for addiction treatment scams.\n\nState attorneys general also played a significant role. InIndiana,Attorney General Todd Rokita, a Republican,announcedcharges in 13 cases, including hospice workers and nurses accused of stealing drugs from dying patients. “We have zero tolerance for those who abuse this lifeline for Hoosiers,” Rokita said.\n\nCenter for Medicare and Medicaid Services Administrator Mehmet Oz said a new “fraud war room” would deploy artificial intelligence tools and prepayment reviews to detect fraud before money is released.\n\nRON JOHNSON IMPLIES NORTH CAROLINA IS AMONG ‘BIGGEST ABUSERS’ OF MEDICAID\n\n“We’re stopping stolen taxpayer money from leaving the door,” Oz said.\n\nOfficials said that the department’s goal going forward is to be proactive, not reactive, in an effort to stymie perpetrators’ attempts to steal taxpayer-funded healthcare dollars before they’re in the hands of criminals."
    }
}