{
    "question": "How might the coincidence of nationwide “No Kings” protests with the Army’s 250th anniversary parade in Washington, D.C., influence public perceptions of civil-military relations and the boundaries between celebration and politicization?",
    "content": {
        "source_1": "Members of the U.S. Army drive a Stryker infantry carrier vehicle during Saturday's 250th anniversary parade in Washington, D.C.Andrew Leyden/Getty Imageshide caption\n\nWASHINGTON, D.C., and ANNAPOLIS, Md. — There are events that become a Rorschachtest that brings out America's political and cultural divisions in bold relief. Saturday's military parade, which celebrated the U.S. Army's 250th anniversary and also fell on President Trump's birthday, was that kind of moment.\n\nAs the Trump administration geared up for the parade filled with tanks and armored personnel carriers rolling through the nation's capital, people in dozens of cities across the country protested the event as a politicization of the armed forces by a would-be autocrat.\n\nThe 33-mile trip from one protest in Annapolis to the parade grandstand in front of the White House was like a journey between two different countries.\n\nThe crowds in Annapolis gathered in front of the colonial, red-brick Maryland State House around mid-morning. The people who came were largely white, and they held signs reading: \"RESISTING THE CROWN SINCE 1776,\" and \"I'M A VETERAN, NOT A SUCKER OR A LOSER,\" a reference tocomments attributed to Trumpdisparaging American war-dead, which Trump has called \"a total lie.\"\n\nJohn Wells, a retired economist statistician with the federal government, called the miltary parade outrageous. \"We're not in Russia or North Korea ... or China,\" he said. \"That's the thing they do. We don't do that.\"Frank Langfitt/NPRhide caption\n\nJohn Wells, a 76-year-old retired economist statistician with the federal government, said he supported the U.S. Army, but couldn't stand the parade.\n\n\"It's outrageous. We're not in Russia or North Korea … or China. That's the thing they do. It's also costing a lot of money and people's resources,\" Wells said of the price tag for the D.C. parade and surrounding events, estimated at $25 million to $45 million.\n\nSpeakers in Annapolis included labor union representatives, the leader of an immigrant advocacy group and a George Washington reenactor who wore a white wig and a blue waistcoat. Randy Goldberg, a 75-year-old retired nurse, played America's first president and delivered the speech Washington gave when herelinquished his military commandthere in 1783.\n\n\"I retire from the great theater of action and bidding an affectionate farewell to this august body under whose orders I have so long acted, I hereby offer my commission and leave all the employments of public life,\" Goldberg said, channeling Washington as the crowd broke into applause.\n\nThe centerpiece of the No Kings protest in Annapolis, Md., was a George Washington reenactor named Randy Goldberg, who delivered the speech Washington gave when he relinquished his command there in 1783. Protesters contrasted Washington's voluntary decision to give up military power with what they saw as an autocratic-style military parade on the National Mall.Frank Langfitt/NPRhide caption\n\nThe protesters' point was that Washington voluntarily gave up military power, while they say Trump was trying to accrue more by holding the parade on the National Mall with countless tons of military hardware.\n\n\"Every other country celebrates their victories,\" Trump told the crowd in D.C. \"It's about time that America did, too.\"\n\nIn fact, this was not a victory celebration, but a birthday party for the Army. The last time the U.S. held a similar parade was after theFirst Gulf War, in 1991.\n\nTrump has attacked the patriotismof his criticsandof journalistshe doesn't like, saying, \"They hate our country.\" Anticipating such an attack, speakers in Annapolis said protest is an act of patriotism, especially when the target is a president they say is trampling America's system of checks and balances.\n\n\"We have to own the flag. No one can tell us that we're not patriots,\" said Donna Edwards, president of the Maryland State & DC AFL-CIO, who addressed the Annapolis crowd wearing an American flag dress. \"No one should say that because we're here, we hate America. We're fighting for America.\"\n\nAbout 45 minutes to the west, many who attended the Army celebration also wore flag T-shirts, hats and shorts. The crowd was diverse and included military families whose members had immigrated to the U.S. from around the world, including Ecuador, El Salvador and Vietnam.\n\nJulianna Balogh (left) and Kim Nguyen are President Trump superfans who traveled from Arkansas and California, respectively, to attend the military parade. Nguyen says her father served with the U.S. Army in South Vietnam and that she came to the U.S. in 1991.Frank Langfitt/NPRhide caption\n\nThe event in the nation's capital seemed at times like a cross between a military festival and an Army recruiting video. People lounged on the grass in the shadow of the Washington Monument. Amid the strains of Van Halen over the loudspeakers, tank drivers pumped their fists and revved their engines as they drove past cheering crowds down Constitution Avenue. Along the way, the announcer thanked the various corporate sponsors, including Lockheed Martin and Palantir, the data-mining firm that hasa $30 million contractto help Immigration and Customs and Enforcement track migrants in the U.S.\n\nThe staging seemed designed to enhance the muscular image Trump likes to project. A pair of tanks sat in front of the grandstand from which the president watched. After his speech, Trump was presented with a traditionally folded U.S. flag — a gift usually reserved for the family members of fallen soldiers.\n\nSome who attended the event — including a few who said they did not vote for Trump — dismissed criticism that the parade had authoritarian overtones.\n\n\"I think they've got this whole cloud over their head that Trump's this dictator when he's acting completely [within] the law,\" said Dennis Connelly, 19, who wore baggy American flag pants and had flown in from Knoxville, Tenn., for the event.\n\nDennis Connelly, 19, of Knoxville, Tenn., flew for the first time in his life to Washington, D.C., to see the parade. Connelly wants to join the Marines and said the combination of the parade and the president's birthday was too good to miss.Frank Langfitt/NPRhide caption\n\nThe president, too, took issue ahead of the parade with being described as a king. \"I don't feel like a king,\" Trump said in advance of the parade. \"I have to go through hell to get things approved.\"\n\nHis administration's actions have been mired in hundreds of lawsuits — and the courts havefrequently blocked themfrom being implemented.\n\nConnelly says he hopes to enlist in the Marines and serve in counterintelligence. While No Kings protesters criticized Trump for busting norms, Connelly sees that as a good thing.\n\n\"He's powerful, and he's kind of like those high school bullies. … And I just think that's wonderful,\" said Connelly. \"We have to have a powerful president who's willing to push some boundaries.\"\n\nAlthough Connelly is a fan of Trump's, he has doubts about some of the president's policies. He says allowing ICE agents to wear masks provides people the opportunity to impersonate them and commit crimes. He also says he doesn't think Trump has a complete understanding of tariffs.\n\n\"I think he's assuming that these companies are willing to pay them and not going to manipulate the public ... and add that on to [the] consumer price,\" said Connelly, who took his first airplane flight ever to come here.\n\nThe parade attracted many Trump voters, who gave the president a warm round of applause when he was introduced. A smattering sported MAGA gear. But most people NPR spoke to said they were there to celebrate the Army and see the tanks.\n\nWell before the parade's end, thousands began heading out. As they exited onto Constitution Avenue, they were met by No Kings protesters.\n\n\"Trump is a Tyrant,\" read one sign. The paradegoers with whom an NPR reporter was walking made their way past the protesters and headed toward the Metro trains.\n\nAmerica's split-screen day had finally merged into a collective image of a divided people a half block from the White House, many unable or unwilling to talk to one another.",
        "source_2": "The 250th anniversary of the US Army is a legitimate cause for commemoration. So is the birthday of an American president, at least for his friends, family, and supporters. We learned last weekend why those two celebrations should probably not have been combined.\n\nAs we discussed here last week, Donald Trump is a master of distraction. When the conversation is going against him, he is extremely talented at changing the subject. Seven days ago, when we were still fascinated by his breakup with Elon Musk, Trump was redirecting our attention away from difficulties he was facing on budget negotiations, tariffs, and the war in Ukraine. But since then, the bad news has piled up, his need for new diversions has increased, and so the distractions have escalated. By this past weekend, video of a United States senator in handcuffs and a new war in the Middle East had both been decisively overshadowed in the eyes of most of Trump’s constituents.\n\nThe stakes began to grow the day after Musk’s departure, which was not playing favorably for Trump. The president knew that escalating a crackdown on Southern California’s unauthorized immigrant population and provoking a confrontation with state and local political leaders would refocus public and media attention in a much more favorable direction for him. Immigration and border policy are the only remaining policy matters on which the American people still give him positive approval ratings, and he quickly moved these issues back to center stage for most American voters.\n\nAs the week continued, the unrest grew. Some of the protestors engaged in violent behavior, burning cars and throwing rocks, bottles, and other projectiles at police officers, which prompted Trump to quickly call out the National Guard and then several hundred Marines. After a weeklong series of political, legal, and street battles, the nation’s attention was fully focused on the ongoing drama in Los Angeles and the subsequent protests that followed in several other cities around the country.\n\nAll of this was a prelude to this past Saturday, when the Army’s anniversary overlapped with Trump’s birthday, with predictably fractious results. The day could not possibly have started worse, with the politically motivated assassination of a Minnesota elected official and her husband. The weather forecast was foreboding as well, with violent thunderstorms predicted for the Washington area at the time of the military parade that Trump had ordered.\n\nBut when all was said and done, the parade had fairly little political impact. Unlike his more combative remarks earlier in the week, Trump stuck closely to the remarks that had been prepared for him, delivering a brief seven-minute speech in the monotone that he habitually employs when reading a script that does not excite him. The crowds were sizable but subdued, and even the weather—drizzles but no storms—did not meet expectations.\n\nMore than 2,000 protests took place across the country throughout the day, most (but not all) of which avoided violence. They were far more energized than the attendees at Trump’s Washington event but focused less on his parade than on his presidency. After more than six months of confused and conflicted messaging, the opposition appeared to find its voice on Saturday. Their challenge will be maintaining that visibility and focus, but they seemed to draw their motivation much less from the day’s festivities in Washington than from Trump’s conduct over the preceding week, most notably his decision to nationalize the guard over the objection of California leaders and deploy the Marines on the streets of the state’s largest city.\n\nTrump held back from implementing the Insurrection Act, the 1807 law that allows the president to empower the military for domestic policing responsibilities. The Act is only to be used in cases of  “civil disorder, insurrection and armed rebellion.” Despite the outbreaks of violence in Los Angeles throughout the week, nothing rose to those levels. But the sight of those troops, even in a more limited support capacity, was jarring—and lasting.\n\nHonoring the men and women who serve in our nation’s military is a perfectly appropriate and laudable exercise, and Trump seemed to sense—or perhaps was told—that overtly politicizing the parade would have caused him significant political backlash. But the more dramatic scenes of US soldiers patrolling in downtown Los Angeles will leave uncomfortable memories long after the two birthday parties on the other side of the continent have been forgotten.",
        "source_3": "Thousands turned out to enjoy festivities and a sprawling military parade inWashington, D.C., even as dismal weather forecasts and nationwide anti-Trump“No Kings” protests threatened to dampen the Army’s 250th birthday celebration.\n\nOn Saturday, which also happened to be President Donald Trump’s birthday, the Armyheld a sweeping affairfeaturing more than 6,000 soldiers, approximately 150 vehicles, 50 aircraft, paratroopers jumping out of planes, and fireworks to highlight its milestone anniversary.\n\nAlthough reports had earlier indicated the eventmight have to be canceleddue to inclement weather, the parade went forward as planned, with attendees experiencing little more than a light rain.\n\n“The Army keeps us free, you make us strong, and tonight, you have made all Americans very proud,” Trump said during a speech at the parade. “Every other country celebrates their victories. It’s about time America did too.”\n\nEven as the president spoke, roughly 5 million Trump critics demonstrated against the White House during approximately 2,000 nationwide “No Kings” protests, several of which became violent, including in red states,despite warnings from the GOPto avoid riotous behavior.\n\nThe demonstrations accused Trump of exhibiting authoritarian behavior, including authorizing U.S. Immigration and Customs Enforcement to make sweeps targeting illegal immigrants nationwide and sending federal troops into California to quell anti-ICE protests during the recent Los Angeles riot. “No Kings” organizers said the military parade Saturday represented Trump’s wish to have “tanks in the street and a made-for-TV display of dominance” for his birthday.\n\nWhile many Democratswere on board with the protestsand criticized Trump’s military parade, Sen. John Fetterman (D-PA), known for his maverick stances,rebuked some of his colleagues, and Republicans such as Sen. Rand Paul (R-KY) expressed concern about the function’s steep costs. Such an event celebrating the Army is meant to honor “the very best of us,” Fetterman said.\n\n“This parade is comprised of our sons, daughters, mothers and fathers,” the Pennsylvania Democrat added. “Regardless of your politics, it’s appropriate to celebrate the 250 years of sacrifice, dedication and service,” he posted alongside a replay of the nearly three-hour event.\n\nSome of the “No Kings” demonstrations — such as in Los Angeles, Las Vegas, and Seattle — became unruly, while police in Portland, Oregon, declared a riot at an ICE facility and arrested multiple people after protests descended into violence.\n\nA “mob” there injured four law enforcement officers as they launched fireworks, smoke grenades, and threw rocks at authorities, Assistant Homeland Security Secretary Tricia McLaughlintoldFox News Digital.\n\nTRUMP GETS HIS FIRST-TERM WISH OF A MILITARY PARADE\n\nDuring a rally attended by roughly 600 people in Culpeper, Virginia, a man rammed his car into the crowd, hitting one person. In Utah, authorities said one person was critically injured from a gunshot wound after violence erupted during a “No Kings” protest in Salt Lake City.\n\nSalt Lake City Police Chief Brian Redd said during a press conference that “it appears” the three people arrested, one of whom is in the hospital after sustaining “serious injuries” from gunshot wounds, “were involved at some level in the protest or at least part of the group that was walking” in the demonstration."
    }
}