{
    "question": "How might the ICE raids in downtown Los Angeles and the protests and standoffs they sparked shape community trust, public safety, and future approaches to immigration enforcement?",
    "content": {
        "source_1": "Fallout from aggressive U.S. Immigration and Customs Enforcement sweeps in Los Angeles continued Saturday, with fierce pushback from protesters, open sparring between L.A. leadership and federal officials and the Trump administration vowing to send the National Guard to the city to assist with operations.\n\nBorder czar Tom Homan toldFox Newsthe Guard would be deployed Saturday night to help with operations. It’s unclear how many Guard members would arrive and exactly what their role would be.\n\nIt came after a day of clashes between federal agents and protesters at a Home Depot in Paramount that was broadcast nationwide throughout the day.\n\nThe raids sparked outrage among state and local leaders.\n\nGov. Gavin Newsom on Saturday condemned the ICE raids in Los Angeles and the response by the Trump administration, and said he has deployed additional CHP officers to L.A. highways to “keep the peace” but not aid the federal actions.\n\n“The federal government is sowing chaos so they can have an excuse to escalate. That is not the way any civilized country behaves,”Newsom said in a statement posted on social media.\n\nCoverage of the protests in downtown Los Angeles over President Trump’s deployment of National Guard troops.\n\nNewsom said the Trump administration is moving to take over the California National Guard and deploy 2,000 soldiers, which he said was “purposefully inflammatory” and would only escalate tensions.\n\nMayor Karen Bass spoke out a day earlier: “As Mayor of a proud city of immigrants, who contribute to our city in so many ways, I am deeply angered by what has taken place. These tactics sow terror in our communities and disrupt basic principles of safety in our city,”  sheposted on X on Fridayevening. “We will not stand for this.”\n\n“We will,” FBI Director Kash Patelreplied Saturday morning.\n\nPatel’s response came a day after immigration officials descended on businesses around Los Angelesand arrested 44 peopleon suspicion of immigration violations and another for obstruction. ICE has arrested a total of 118 people in L.A. in connection with suspected immigration violations this week, according to the Department of Homeland Security.\n\nImmigration rights advocates said conditions at the Metropolitan Detention Center downtown had become overcrowded, with 200 people packed into a facility built to hold only 100.\n\n“They didn’t have access to food and water on a schedule. They definitely don’t have access to their medicines,” said U.S. Rep. Jimmy Gomez (D-Los Angeles), who arrived at the facility to check conditions Saturday morning along with fellow representatives Luz Rivas (D-North Hollywood), Norma Torres (D-Pomona) and Lou Correa (D-Santa Ana).\n\n“That’s not healthy for anybody,” Gomez said. “They do have a right to make sure that they’re treated fairly and that they’re allowed to see their attorney. So we’re here because federal law says that we as members of Congress can show up and do a facility check on all those different issues.”\n\nA federal agent turned the lawmakers away and told them to come back on Monday, the group said.\n\n“That is not what the law says,” Rivas told reporters afterward. “We should be allowed any time for an oversight visit, and that was our intention — to come in to check in on the facility and to get a briefing.”\n\nAs advocates and families of detainees scrambled for information, federal officials made clear Saturday that more arrests were on the way.\n\n“Federal law enforcement operations are proceeding as planned this weekend in Los Angeles County,” U.S. Atty. Bill Essayli said on X. “Anyone who obstructs federal agents will face arrest and prosecution.”\n\nOn Friday evening, crowds gathered outside the federal detention center in downtown Los Angeles. The Los Angeles Police Department declared an unlawful assembly and ordered the roughly 200 remaining protesters to disperse around 7 p.m.\n\nFollowing reports of a small group of “violent individuals” throwing large pieces of concrete at officers, police authorized the use of so-called less-lethal munitions at 8 p.m., LAPD said. A citywide tactical alert was issued shortly thereafter.\n\nAs reports of new raids emerged Saturday morning, federal officials criticized protesters’ actions and warned of further consequences.\n\n“The Left’s dangerous rhetoric against brave American law enforcement has fueled hatred and inspired violence. Democrats must immediately call on their supporters to stop the attacks on ICE officers who are simply doing their job — and have every right to do so,” White House spokesperson Abigail Johnson said in a statement. “To those who harm law enforcement officers, know this: you will be held accountable to the full extent of the law.”\n\nThe Department of Homeland Security described the protesters as “violent rioters.”\n\nAdvocates have vowed to continue fighting  back against the arrests.\n\n“Our community is under attack and has been terrorized,” Angelica Salas, executive director of the Coalition for Humane Immigrant Rights, or CHIRLA, told the crowd of protesters. “These are workers, these are fathers, these are mothers.”\n\nThe scene outside one targeted business in the Fashion District turned violent after federal immigration authorities used flash-bang grenades and pepper spray on people protesting the employees’ arrests. Hours later, hundreds rallied outside the Los Angeles Federal Building to condemn the crackdown and demand the release of Service Employees International Union California President David Huerta, who was injured and detained while documenting a raid, according to a statement from the labor union.\n\nCarlos González Gutiérrez, consul general of Mexico in Los Angeles, said his team has identified at least 11 Mexican nationals who were detained during raids across the Southland. The office is offering them legal services, and he said he is monitoring detention conditions.\n\n“The detention center seems to be at full capacity,” he said. “Every cell seems to be occupied.”\n\nFederal agents executed four search warrants related to the suspected harboring of people illegally in the country at three locations in central Los Angeles, according to ICE.\n\nCHIRLA received more than 50 calls on its hotline, with reports of ICE sightings and men in military garb in parking lots and in locations near schools, Home Depot stores and a doughnut shop, according to Salas.\n\nConnie Chung Joe, the chief executive of Asian Americans Advancing Justice Southern California, said she received a report of immigration enforcement going to a school in Koreatown.\n\nFederal agents in riot gear detained workers in the Garment District in downtown Los Angeles as crowds gathered to record them and shout protests.\n\nHuerta, 58, was treated at a hospital and transferred to the Metropolitan Detention Center in downtown L.A., where he remained in custody as of 5:30 p.m., according to an SEIU spokesperson.\n\n“What happened to me is not about me; This is about something much bigger,” he said in a statement from the hospital. “This is about how we as a community stand together and resist the injustice that’s happening. Hard-working people, and members of our family and our community, are being treated like criminals. We all collectively have to object to this madness because this is not justice.”\n\nIn astatement on X,  Essayli alleged that Huerta had deliberately obstructed federal agents’ access to a worksite where they were executing a warrant by blocking their vehicle Friday morning. Huerta was arrested on suspicion of interfering with federal officers and will be arraigned Monday, the U.S. attorney said.\n\nElected officials representing Los Angeles at the city, county, state and federal levels released a flurry of statements condemning Huerta’s arrest, criticizing the raids and decrying the Trump administration’s escalation of deportations.\n\n“This is a democracy,” said L.A. County Supervisor Janice Hahn. “People have a right to peacefully protest, to observe law enforcement activity, and to speak out against injustice.”\n\nAssistant Atty. Gen. Harmeet Dhillon, who was appointed by President Trump to lead the Justice Department’s Civil Rights Division, pushed back on Democratic elected leaders’ defense of Huerta.\n\n“There is not a 1st Amendment right to physically obstruct law enforcement officers from executing a duly issued warrant,” Dhillon said.\n\nFor several hours Friday, advocates gathered outside Ambiance Apparel’s warehouse shouting legal advice to those being detained inside. They stood on a long bed truck parked in the middle of the street, jamming traffic on the busy road.\n\n“You are not alone,” one said into a megaphone drowning out the sounds of the crowd. “Do not sign anything. Do not tell them where you are from.”\n\nKatina Garcia, 18, pressed her face to the glass, looking for her father, who lacks proper documentation, who had gone to work there that morning, like any other.\n\n“We never thought it would happen to us,” she said, “I’m in disbelief.”\n\nAfter a couple of hours a legion of federal agents dressed in riot gear descended on Ambiance Apparel to confront more than 100 people who had gathered outside.\n\nBlaring  sirens announced the arrival of armored personnel carriers.\n\nThe agents disembarked and surrounded the gates protesters had tried to block. Some threw objects at the armed agents, as they yelled and filmed them. To disperse the crowd, pepper spray was used.\n\nThe agents who had been inside the store walked out at least a dozen individuals and boarded them in the vans as other agents in riot gear taped off the area.\n\n“How do you sleep at night, tearing apart families,” one woman screamed at an agent. “What if they took your family?”\n\nThe vans filled with migrants left first. Then the line of tactical vehicles and trucks backed out and left in the other direction. The crowd followed, filming with cellphones and surrounding the vehicles for at least a block. The agents used what appeared to be at least a dozen rounds of flash-bang grenades and pepper spray before protesters dispersed.\n\nA group of 11 L.A. city councilmembers released a joint statement lambasting the “indiscriminate targeting of children and families” and vowing to fight to protect immigrants.\n\n“We condemn this in no uncertain terms: Los Angeles was built by immigrants and it thrives because of immigrants,” the group stated. “We will not abide by fear tactics to support extreme political agendas that aim to stoke fear and spread discord in our city.”\n\nThe Police Department and the L.A. County Sheriff’s Department said in statements that they will neither participate in any enforcement of civil immigration laws nor seek to determine an individual’s immigration status.\n\n“We want our residents to know that when they call for help, the Los Angeles County Sheriff’s Department will respond, investigate and protect everyone — regardless of a person’s legal status,” the department said in a statement.\n\nThe American Civil Liberties Union and elected officials including Councilmember Eunisses Hernandez, Councilmember Ysabel Jurado and Assemblymember Isaac Bryan (D-Los Angeles) raised concerns over reports that the LAPD was assisting ICE on Friday.Videosshared on social media showed LAPD officers gathering at 15th Street and Santa Fe Avenue, where a crowd was protesting the immigration action at Ambiance Apparel’s warehouse.\n\n“When masked goons are abducting and locking Angelenos in basements, when police are tear gassing protesters and legal observers exercising their 1st Amendment rights, and when union leaders are brutalized for daring to oppose blatant injustice, we ask our local and state leaders: Where are you? What will you do to end this madness?” said Andres Kwon, attorney and senior policy counsel at the ACLU Foundation of Southern California.\n\nKwon said city leaders “broke their promise” to preserve L.A. as a sanctuary city, a contention that LAPD officials denied.\n\n“We received an officer needs help call from our federal partners and responded to separate the parties to maintain order,” said LAPD spokesperson Jennifer Forkish. “We had nothing to do with the operation, but we do have an obligation to respond to any law enforcement agency requesting urgent assistance.”\n\nThe Los Angeles raids  come on the heels of several recent enforcement actions in the Southland — including an incident in which ICE agents deployed flash-bang grenades during operations attwo San Diego restaurants,and a raid at anunderground nightclubin Los Angeles where Chinese and Taiwanese nationals were detained.\n\nOn Friday afternoon, U.S. Sens. Adam Schiff and Alex Padilla — alongside Reps. Scott Peters (D-San Diego) and Juan Vargas (D-San Diego) — demanded an investigation into the tactics used during the San Diego raids.\n\n“This troubling incident is not an isolated case. Rather, it appears to be part of a broader pattern of escalated and theatrical immigration enforcement operations across the country,” the lawmakers stated. “These events raise serious questions about the appropriateness, proportionality, and execution of ICE tactics.”\n\nTimes staff writer Kaitlyn Huamani contributed to this report.",
        "source_2": "Reporting by Jane Ross in Los Angeles; Writing and additional reporting by Steve Gorman in Los Angeles; Editing by Tom Hogue\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nFrench President Emmanuel Macron on Monday slammed Israel's plans to step up its military operation in Gaza as a disaster waiting to happen and proposed an international coalition under a United Nations mandate to stabilise Gaza.\n\nReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.\n\nAccess unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.\n\nBrowse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.\n\nScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.\n\nAll quotes delayed a minimum of 15 minutes.See here for a complete list of exchanges and delays.",
        "source_3": "Tense standoffs erupted between U.S. Immigration and Customs Enforcement (ICE) agents and protesters in Downtown Los Angeles on Friday, as people attempted to thwart illegal immigration sweeps.\n\nViral video showed ICE agents escorting handcuffed people into vans as protesters shouted them down, with one individual throwing eggs at the moving vehicles. In one video, a man could be heard yelling in Spanish to warn the people nearby about the impending raids. Per theLos Angeles Times:\n\nAnother raid occurred at a business in the Garment District, with agents in riot gear detaining workers at a clothing store as dozens of people began to gather outside. As workers were hauled off in cuffs, throngs of people yelled at the agents and held up cellphones to record them, according to videos of the showdown. One person threw eggs at one of the vehicles as agents pushed members of the public back, the videos showed.\n\nIn the street, immigrant-rights advocates stood on a bed of a truck, using megaphones to speak to the workers inside the store, reminding them of their constitutional rights and instructing them not to sign anything or say anything to federal agents. They also told the agents that lawyers wanted access to the workers, and sometimes called out specific names.\n\nOfficials from the Service Employees International Union said in a statement that its California president, David Huerta, was detained and injured during a downtown raid “while exercising his First Amendment right to observe and document law enforcement activity.” The union said he was receiving medical care while in custody and called for his immediate release.\n\nIn one particularly harrowing scene, a protester backpedaled in front of a van as it attempted to slowly move forward with people swarmed around the outside. When the man fell back, the van high-tailed it from the area:\n\nYasmeen Pitts O’Keefe, a spokesperson for Homeland Security Investigations, a branch of ICE, said federal agents were executing warrants of people being harbored in the United States illegally. Los Angeles officials, including Mayor Karen Bass (D), denounced the operation.\n\n“These actions are escalating: agents arrive without warning and leave quickly, aware that our communities mobilize fast,” Los Angeles Councilmember Eunisses Hernandez said in a statement. “I urge Angelenos to stay alert.”\n\nMayor Karen Bass said the raid sow “terror in our communities and disrupt basic principles of safety in our city… We will not stand for this.”\n\nLos Angeles Police Chief Jim McDonnell said in a written statement his department had no hand in the operation.\n\n“I’m aware that these actions cause anxiety for many Angelenos, so I want to make it clear: the LAPD is not involved in civil immigration enforcement,” he said. “While the [department] will continue to have a visible presence in all our communities to ensure public safety, we will not assist or participate in any sort of mass deportations nor will the LAPD try to determine an individual’s immigration status.”\n\n“I want everyone, including our immigrant community, to feel safe calling the police in their time of need and know that the LAPD will be there for you without regard to one’s immigration status,” he added.\n\nLAPD in Riot Gear have finally arrived and are assisting DHS agents who were trapped inside a federal Govt. parking structure. Order to disperse has been given.\n\nPaul Roland Bois directed theaward-winning Christian tech thriller,EXEMPLUM, which has a100% Rotten Tomatoes critic ratingand can be viewed for FREE onYouTube,Tubi, orFawesome TV. “Better than Killers of the Flower Moon,”wrote Mark Judge. “You haven’t seen a story like this before,”wrote Christian Toto. A high-quality, ad-free rental can also be streamed onGoogle Play,Vimeo on Demand,orYouTube Movies. Follow him on X@prolandfilmsor Instagram@prolandfilms."
    }
}