{
    "question": "What are the potential implications of the court’s decision for how Oregon balances foster children’s welfare, including LGBTQ+ considerations, with prospective parents’ religious rights?",
    "content": {
        "source_1": "A Christian mother of five in eastern Oregon has gotten the okay from a federal court to proceed with her application to foster or adopt children, despite her refusal to affirm their gender identities.\n\nIn 2023, Jessica Bates sued the state for turning down her initial application after she refused to abide by the Oregon Department of Human Services’ requirement to affirm the gender identity of any child under her care.\n\n“I cannot support this behavior in a child,” Bates wrote in her application. “I have no problem loving them and accepting them as they are, but I would not encourage them in this behavior. I believe God gives us our gender/sex and it’s not something we get to choose.”\n\nOn Thursday, a three-judge panel at the Ninth Circuit Court of Appeals sent Bates’ case back to the district court to reexamine her claim against the state based on “strict scrutiny” for free exercise of religion and free speech. Strict scrutiny is considered the highest bar to clear for policies that may impinge on constitutional rights.\n\nBates can pursue her application to foster or adopt while the lower court reconsiders her case.\n\nThe mother of five biological children told the court she received a message from God encouraging her to care for more children shortly after the death of her husband in a car collision.\n\nBates is represented by the Alliance Defending Freedom (ADF), a Southern Poverty Law Center-designated hate group. ADF has shepherded several high-profile lawsuits opposing what they call the “homosexual agenda” through the courts, includingMasterpiece Cakeshop v. Coloradoand303 Creative, Inc. v. Elenis, both of which enshrined discrimination against LGBTQ+ customers on the basis of religious views into law.\n\n“We are willing to accept on this record that Oregon intended to act in the best interests of children, and not out of hostility or animus toward religion,” Judge Daniel Bress, appointed by the current president, wrote for the two-judge majority. “But that does not make Oregon’s policy neutral toward religion. For the reasons we have given, Oregon’s policy is not neutral, which means that for Bates’s Free Exercise Clause claim, we must apply strict scrutiny to Oregon’s denial of Bates’s application.”\n\nIn his dissent, Judge Richard Clifton, a George W. Bush appointee, agreed with the lower court that the state’s requirements concern Bates’ potential treatment of a child in her care, and not her religious beliefs.\n\n“Parents would not be expected to entrust their children to caregivers who volunteer that they will not respect the child’s self-determined gender identity, if that is something the parents have decided is important,” Clifton wrote, referring to Oregon’s role as custodial “parent” of foster children. “Oregon should not be powerless to protect children for whom it has parental responsibility and for whom it has decided respect should be given.”\n\nIn an interview withKGW Newsafter the appeals court decision, Bates said any child in her custody would be subject to the same Biblical obligations that her own children live under.\n\n“I’m still gonna love them deeply. I’m not gonna reject them or anything,” Bates said of a child who might come out to her as LGBTQ+.\n\nBut she said she would not use a chosen name orpronounsthat align with the child’s gender identity or allow them to change the way they dress. She would instead steer the conversation back toward her faith, she said.\n\nShe would remind them, Bates said, that “‘Hey, God makes our identity, and that’s something sacred and holy. And it might not feel like a gift right now, and you might be struggling with it, but that’s something actually really special, and you are beautiful and perfect, like just how you are right now.'”\n\nIt was left to Bate’s lawyers with ADF to villainize the state and portray its concern for the 30% of youth in foster care whoidentify as LGBTQ+as nefarious and a form of indoctrination.\n\n“Because caregivers like Jessica cannot promote Oregon’s dangerous gender ideology to young kids and take them to events like pride parades, the state considers them to be unfit parents,” said Jonathan Scruggs, the ADF senior counsel who argued Bates’ case. “That is false and incredibly dangerous, needlessly depriving kids of opportunities to find a loving home. The 9th Circuit was right to remind Oregon that the foster and adoption system is supposed to serve the best interests of children, not the state’s ideological crusade.”\n\nSubscribe to theLGBTQ Nation newsletterand be the first to know about the latest headlines shaping LGBTQ+ communities worldwide.",
        "source_2": "The Oregon Department of Human Services is in Salem. A federal appeals court granted a Malheur County woman’s request to halt the department's policy requiring adoptive parents embrace their child’s sexual or gender identity. (Michael Romanos/Oregon Capital Chronicle)\n\nA federal appeals court granted a Malheur County woman’s request to halt Oregon’s policy requiring adoptive parents embrace their child’s sexual or gender identity, urging the state to implement a less prescriptive approach to protecting some of the foster care system’s most vulnerable youth.\n\nThe Thursday ruling from the 9th Circuit Court of Appeals strikes down a November 2023decisionby U.S. District Judge Adrienne Nelson, who rejected the woman’s original request to stop the policy on the grounds that denying LGBTQ+ identity creates “collateral harm on the child’s development, safety, and physical well-being.” Studies haveshownthat LGBTQ+ youth are overrepresented in the foster care system, making up to one-third of existing cases.\n\nThe recent case stems from an April 2023 lawsuit against the Oregon Department of Human Services brought forth by Jessica Bates, a widowed mother of five from Vale who says she wants her current children to have more siblings. Bates in her suit contended that her Christian religion and unwillingness to take a young adopted child to get hormone injections or to a Pride parade should not have precluded her from state-backed adoption.\n\n“From using preferred pronouns to facilitating gender-related hormonal treatment, Oregon’s policy directs Bates to go against her religious commitments by its requirements of word and deed,” wrote Appellate Judge Daniel A. Bress, an appointee of President Donald Trump. “The state’s suggestion that Bates is not burdened because she can continue to hold her own religious views reflects an incomplete understanding of the Free Exercise Clause.”\n\nJudge Michael Daly Hawkins, appointed by former Democratic President Bill Clinton, joined Bress in the 2-1opinion. Judge Richard R. Clifton, appointed by former Republican President George W. Bush, dissented.\n\nThe ruling highlights the extent to which Oregon has led the nation on the issue of foster care protections for LGBTQ+ youth. The majority opinion points to other similarly-intended policies they would find constitutional, such as a Biden administration rule establishing LGBTQ-friendly care providers without mandating participation or anti-harassment laws.\n\nJenny Hansson, a spokesperson for the Oregon Department of Justice, said the department is disappointed in the ruling but is still evaluating next steps. Adriana Taylor, a spokesperson for the Oregon Department of Human Services, said the agency was reviewing the ruling and does not have further comment.\n\nThe majority opinion cites the June U.S. Supreme Court case of Mahmoud v. Taylor, in which religious parents were found to have their First Amendment rights violated when their school district refused to allow them to opt their children out of course materials they found offensive. The judges reviewed pages of training from the human services department, seeing mandated viewpoints in directives for parents to respect “Hir/Zir pronouns” and disputing Oregon’s lawyers’ arguments that the state’s broader policy wasn’t tied to one specific religion or community.\n\n“Adoption is not a constitutional law dead zone,” Bress wrote. “And a state’s general conception of the child’s best interest does not create a force field against the valid operation of other constitutional rights.”\n\nIn a statement after the ruling, the Arizona-based Alliance Defending Freedom, a conservative Christian legal advocacy group that represented Bates, sharply criticized Oregon for promoting “dangerous ideology to young kids.”\n\n“Every child deserves a loving home, and children suffer when the government excludes people of faith from the adoption and foster system,” said ADF Senior Counsel and Vice President of Litigation Strategy Jonathan Scruggs. “Jessica is a caring mom of five who is now free to adopt after Oregon officials excluded her because of her common-sense belief that a girl cannot become a boy or vice versa.”\n\nBates’ lawsuit against Oregon’s Department of Human Services traces back to a 2018 policy adopted to better support the inclusion of LGBTQ+ foster youth, who have reported traumatic experiences of rejection from their original and host families. The policy requires that adoptive and fostering parents “respect, accept and support” their child’s sexual orientation, gender identity, gender expression and spiritual beliefs, next to a list of protected other categories.\n\nAuburn Marie, development director for the Portland-based Basic Rights Oregon, among the largest LGBTQ advocacy groups in the state, called the decision troubling. Queer and transgender youth in the foster system are already often not welcomed into their families of origin, she said, adding that placement in a hostile home often leads to negative outcomes for mental health and personal success.\n\n“It’s just really devastating and sad that a person would not be able to accept a person, especially a child, the way they are and the way that they identify,” she said. “These kids deserve more than anything to be in affirming homes that welcome them just the way they are.”\n\nThe case also tested the boundaries between parental rights over youth, free speech, LGBTQ+ protections and religious liberties. One major nonpartisan national free speech group filed an amicus brief in favor of Bates’ argument in January last year, seeing more strength in efforts like Oregon Foster Children’s Bill of Rights, which protects an individual’s right to determine and express gender and sexuality for themselves.\n\n“The things Oregon’s rules require prospective adoptive parents to pledge unconstitutionally compel them to express specific viewpoints with which they may disagree,” Ronnie London, general counsel of the Foundation for Individual Rights and Expression, said in a statement. “There are other viable, less restrictive means to support LGBTQ children in foster care, as FIRE argued.”\n\nIn his dissent, Clifton wrote the court had made a decision based on an incomplete understanding of the case and the record in front of the judges. He said the policy was no different than other “well-established” authorities of the state, such as regulating public health and safety.\n\n“The only limitation imposed by the state in declining to approve her (Bates’) application to foster a child concerns her treatment of the child, not what she personally believes, how she speaks to the world, or how she practices her faith,” Clifton wrote. “Oregon should be permitted to put the best interests of the child for which it is responsible paramount in making the decision to place one of its children in the custody of a foster applicant.”\n\nby Shaanth Nanguneri,Oregon Capital ChronicleJuly 28, 2025\n\nby Shaanth Nanguneri,Oregon Capital ChronicleJuly 28, 2025\n\nA federal appeals court granted a Malheur County woman’s request to halt Oregon’s policy requiring adoptive parents embrace their child’s sexual or gender identity, urging the state to implement a less prescriptive approach to protecting some of the foster care system’s most vulnerable youth.\n\nThe Thursday ruling from the 9th Circuit Court of Appeals strikes down a November 2023decisionby U.S. District Judge Adrienne Nelson, who rejected the woman’s original request to stop the policy on the grounds that denying LGBTQ+ identity creates “collateral harm on the child’s development, safety, and physical well-being.” Studies haveshownthat LGBTQ+ youth are overrepresented in the foster care system, making up to one-third of existing cases.\n\nThe recent case stems from an April 2023 lawsuit against the Oregon Department of Human Services brought forth by Jessica Bates, a widowed mother of five from Vale who says she wants her current children to have more siblings. Bates in her suit contended that her Christian religion and unwillingness to take a young adopted child to get hormone injections or to a Pride parade should not have precluded her from state-backed adoption.\n\n“From using preferred pronouns to facilitating gender-related hormonal treatment, Oregon’s policy directs Bates to go against her religious commitments by its requirements of word and deed,” wrote Appellate Judge Daniel A. Bress, an appointee of President Donald Trump. “The state’s suggestion that Bates is not burdened because she can continue to hold her own religious views reflects an incomplete understanding of the Free Exercise Clause.”\n\nJudge Michael Daly Hawkins, appointed by former Democratic President Bill Clinton, joined Bress in the 2-1opinion. Judge Richard R. Clifton, appointed by former Republican President George W. Bush, dissented.\n\nThe ruling highlights the extent to which Oregon has led the nation on the issue of foster care protections for LGBTQ+ youth. The majority opinion points to other similarly-intended policies they would find constitutional, such as a Biden administration rule establishing LGBTQ-friendly care providers without mandating participation or anti-harassment laws.\n\nJenny Hansson, a spokesperson for the Oregon Department of Justice, said the department is disappointed in the ruling but is still evaluating next steps. Adriana Taylor, a spokesperson for the Oregon Department of Human Services, said the agency was reviewing the ruling and does not have further comment.\n\nThe majority opinion cites the June U.S. Supreme Court case of Mahmoud v. Taylor, in which religious parents were found to have their First Amendment rights violated when their school district refused to allow them to opt their children out of course materials they found offensive. The judges reviewed pages of training from the human services department, seeing mandated viewpoints in directives for parents to respect “Hir/Zir pronouns” and disputing Oregon’s lawyers’ arguments that the state’s broader policy wasn’t tied to one specific religion or community.\n\n“Adoption is not a constitutional law dead zone,” Bress wrote. “And a state’s general conception of the child’s best interest does not create a force field against the valid operation of other constitutional rights.”\n\nIn a statement after the ruling, the Arizona-based Alliance Defending Freedom, a conservative Christian legal advocacy group that represented Bates, sharply criticized Oregon for promoting “dangerous ideology to young kids.”\n\n“Every child deserves a loving home, and children suffer when the government excludes people of faith from the adoption and foster system,” said ADF Senior Counsel and Vice President of Litigation Strategy Jonathan Scruggs. “Jessica is a caring mom of five who is now free to adopt after Oregon officials excluded her because of her common-sense belief that a girl cannot become a boy or vice versa.”\n\nBates’ lawsuit against Oregon’s Department of Human Services traces back to a 2018 policy adopted to better support the inclusion of LGBTQ+ foster youth, who have reported traumatic experiences of rejection from their original and host families. The policy requires that adoptive and fostering parents “respect, accept and support” their child’s sexual orientation, gender identity, gender expression and spiritual beliefs, next to a list of protected other categories.\n\nAuburn Marie, development director for the Portland-based Basic Rights Oregon, among the largest LGBTQ advocacy groups in the state, called the decision troubling. Queer and transgender youth in the foster system are already often not welcomed into their families of origin, she said, adding that placement in a hostile home often leads to negative outcomes for mental health and personal success.\n\n“It’s just really devastating and sad that a person would not be able to accept a person, especially a child, the way they are and the way that they identify,” she said. “These kids deserve more than anything to be in affirming homes that welcome them just the way they are.”\n\nThe case also tested the boundaries between parental rights over youth, free speech, LGBTQ+ protections and religious liberties. One major nonpartisan national free speech group filed an amicus brief in favor of Bates’ argument in January last year, seeing more strength in efforts like Oregon Foster Children’s Bill of Rights, which protects an individual’s right to determine and express gender and sexuality for themselves.\n\n“The things Oregon’s rules require prospective adoptive parents to pledge unconstitutionally compel them to express specific viewpoints with which they may disagree,” Ronnie London, general counsel of the Foundation for Individual Rights and Expression, said in a statement. “There are other viable, less restrictive means to support LGBTQ children in foster care, as FIRE argued.”\n\nIn his dissent, Clifton wrote the court had made a decision based on an incomplete understanding of the case and the record in front of the judges. He said the policy was no different than other “well-established” authorities of the state, such as regulating public health and safety.\n\n“The only limitation imposed by the state in declining to approve her (Bates’) application to foster a child concerns her treatment of the child, not what she personally believes, how she speaks to the world, or how she practices her faith,” Clifton wrote. “Oregon should be permitted to put the best interests of the child for which it is responsible paramount in making the decision to place one of its children in the custody of a foster applicant.”\n\nOregon Capital Chronicleis part of States Newsroom, a nonprofit news network supported by grants and a coalition of donors as a 501c(3) public charity. Oregon Capital Chronicle maintains editorial independence. Contact Editor Julia Shumway for questions:info@oregoncapitalchronicle.com.\n\nOur stories may be republished online or in print under Creative Commons license CC BY-NC-ND 4.0. We ask that you edit only for style or to shorten, provide proper attribution and link to our website. AP and Getty images may not be republished. Please see ourrepublishing guidelinesfor use of any other photos and graphics.\n\nShaanth Kodialam Nanguneri is a reporter based in Salem, Oregon covering Gov. Tina Kotek and the Oregon Legislature. He grew up in the Bay Area, California and went on to study at UCLA, reporting for the Daily Bruin until graduating in March 2025. Previously, he was a reporting intern covering criminal justice and health for CalMatters in Sacramento, California. He is always eager to tell stories that illuminate how complex and intricate policies from state government can help shape the lives of everyday Oregonians.\n\nOregon Capital Chronicle is part ofStates Newsroom, the nation’s largest state-focused nonprofit news organization.\n\nOregon Capital Chronicle focuses on deep and useful reporting on Oregon state government, politics and policy. We help readers understand how those in government are using their power, what’s happening to taxpayer dollars, and how citizens can stake a bigger role in big decisions.\n\nWe’re part ofStates Newsroom, the nation’s largest state-focused nonprofit news organization.\n\nOur stories may be republished online or in print underCreative Commons licenseCC BY-NC-ND 4.0. We ask that you edit only for style or to shorten, provide proper attribution and link to our website. (See fullrepublishing guidelines.)",
        "source_3": "A federal appeals court has upheld Christian parents’ right to adopt children from the foster care system, rejecting Oregon’s unconstitutional “gender ideology” mandate for adoption.\n\nOn Thursday, the Ninth U.S. Circuit Court of Appealsruled in favorof Jessica Bates, allowing her to begin the process of adopting siblings from foster care without violating her Christian beliefs on sexuality while her case proceeds.\n\nJessica is a widowed mother of five who lives in Oregon. When Jessicahearda radio program discussing adoption, she felt moved to get involved and help children in need. So, Jessica began the application process in 2022.\n\nHowever, the Oregon Department of Human Services (ODHS) requires adoptive parents to accept state-approved beliefs on homosexuality and transgenderism. ODHS stipulates that prospective adoptive parents must “accept” and “support” any adopted child’s declared sexual orientation and “gender identity.”\n\nAccording toJessica’s attorneys with Alliance Defending Freedom (ADF), “This means parents must agree to use a child’s preferred pronouns, take children to LGBT events like Pride parades, and facilitate a child’s access to dangerous pharmaceutical interventions like puberty blockers and hormone shots that can potentially sterilize a child.”\n\nBecause Jessica refused to affirm the state’s approved narrative on LGBT issues, thus violating her faith, ODHS denied her application to foster or adopt, discriminating against her religious views.\n\nJessica’s attorneysfileda federal lawsuit on her behalf in April 2023.\n\nThe Ninth Circuitopinionwas authored by Judge Daniel Bress, a nominee of President Donald J. Trump, who was joined by Judge Michael Hawkins, a nominee of former President Bill Clinton.\n\nJudge Richard Clifton, a nominee of former President George W. Bush, dissented from the court’s decision.\n\n“The Oregon Department of Human Services requires that prospective parents applying to adopt children from foster care must agree to ‘respect, accept, and support’ the children’s sexual orientation, gender identity, and gender expression,” Judge Bress assessed.\n\n“The state denied Jessica Bates’s application under this policy after Bates, based on her sincerely held religious beliefs, objected to using adopted children’s preferred pronouns or taking them to medical appointments for gender transitions.”\n\nThe ruling marks the first time a federal appellate court has weighed in on states’ attempts to restrict the right of Christians to adopt or foster children.\n\n“Every child deserves a loving home, and children suffer when the government excludes people of faith from the adoption and foster system,” said ADF Senior Counsel and Vice President of Litigation Strategy Jonathan Scruggs in astatement.\n\n“Jessica is a caring mom of five who is now free to adopt after Oregon officials excluded her because of her common-sense belief that a girl cannot become a boy or vice versa.”\n\nAs arising numberof states attempt to ban sincere Christian believers from adopting or participating in the foster care system, cases like this will become increasingly important.\n\nWe thank Jessica Bates for her bold and brave Christian witness, and for standing up for her First Amendment right to care for children in need.\n\nTo speak with a family help specialist or request resources, please call us at 1-800-A-FAMILY (232-6459).\n\nThroughWait No More’s Suitcase Bundleministry, children in foster care are provided their own suitcase – for their belongings – as well as a teddy bear, handwritten letter and age-appropriate Bible. Thesuitcase bundleis a simple way to offer dignity, comfort and hope to children in scary, lonely situations.\n\nWhen Government is Hostile to Christian Foster Parents\n\nFirst Lady Welcomes Foster and Adoptive Families to the White House\n\nArkansas & Kansas Enact Protections for Faith-Based Adoption, Foster Care\n\nEXCLUSIVE: Kirk Cameron on the Impact of See You at the Library\n\nPuerto Rico Passes Law Banning Transgender Medical Interventions for Minors\n\nZachary Mettler is a writer/analyst for the Daily Citizen at Focus on the Family. In his role, he writes about current political issues, U.S. history, political philosophy, and culture. Mettler earned his Bachelor’s degree from William Jessup University and is an alumnus of the Young Leaders Program at The Heritage Foundation. In addition to the Daily Citizen, his written pieces have appeared in the Daily Wire, the Washington Times, the Washington Examiner, Newsweek, Townhall, the Daily Signal, the Christian Post, Charisma News and other outlets.\n\nJudge Partially Blocks Enforcement of Arkansas Ten Commandments Law\n\nProposed ‘App Store Accountability’ Act Would Force Apps and App Stores to Uphold Basic Child Safety Protections\n\nFTC Begins Investigating ‘Gender-Affirming’ Medical Community for Deception, False Advertising\n\nSixteen States Sue Trump Administration for Protecting Children from ‘Trans’ Procedures\n\n|Privacy Policy and Terms of Use| \n                © 2025 Focus on the Family. All rights reserved."
    }
}