{
    "question": "What would an investigation into the Harris campaign’s payments related to celebrity appearances need to clarify about the line between legitimate event production costs and prohibited paid endorsements, and how might its findings affect how campaigns use celebrity support in the future?",
    "content": {
        "source_1": "President Donald Trump escalated his feud against Bruce Springsteen in a late-night, all-caps rant calling for an investigation into the legendary rocker’s performance at a Kamala Harris campaign rally.\n\nSpringsteenkicked offhis “Land of Hope & Dreams” tour by saying the U.S. was in the hands of a “corrupt, incompetent and treasonous administration,” leading the president tofire backthat Springsteen was a “dried out prune of a rocker [who] ought to KEEP HIS MOUTH SHUT.”\n\nAfter the Boss responded at his show Saturday bycalling Trumpan “unfit president” whose administration was “persecuting people for their right to free speech and voicing their dissent,” Trump once again usedsocial mediato accuse Springsteen—along with Beyoncé, Oprah Winfrey, and Bono—of making “illegal” contributions to Harris’ unsuccessful campaign.\n\n“HOW MUCH DID KAMALA HARRIS PAY BRUCE SPRINGSTEEN FOR HIS POOR PERFORMANCE DURING HER CAMPAIGN FOR PRESIDENT?” Trump wrote. “WHY DID HE ACCEPT THAT MONEY IF HE IS SUCH A FAN OF HERS? ISN’T THAT A MAJOR AND ILLEGAL CAMPAIGN CONTRIBUTION? WHAT ABOUT BEYONCÉ? …AND HOW MUCH WENT TO OPRAH, AND BONO??? I am going to call for a major investigation into this matter.”\n\nThe Democrats, however, already beat him to it, as Harris’ campaign spending came under scrutiny after the campaign raised more than $1 billion but still lost every single battleground state during the election.\n\nThat led some Democratic strategists to question expenditures including a $1 million town hall with Oprah Winfrey, and swing-state rallies featuring star performers such as Lady Gaga, Jon Bon Jovi, and Katy Perry,The New York Timesreported.\n\nSpringsteen performed at a Harris/Walz rally in Philadelphia on Oct. 28, while Beyoncé spoke at a Houston rally on Oct. 25. It’s not clear what Bono has to do with the Harris campaign, though he did blast the president’s foreign aid policy over the weekend at the launch of his Apple+ documentary,The Irish Starreported.\n\nAdrienne Elrod, who served as a senior adviser and senior spokesperson for the Harris campaign, toldDeadlinethat the campaign did not pay for celebrity support.\n\n“We have never paid any artist and performer,” she said.\n\nThe campaign, however, was required by law to pay the ancillary costs of the performances, she said. Expenses such as sound, lighting, and support staff must be reimbursed, since companies are not allowed to give cash or in-kind donations to candidates,USA Todayreported.\n\nHarris’expenditure filingsappear to show the campaign paid Springsteen’s production company Thrill Hill Productions about $75,000 on Nov. 19 for “travel and event production.” The Daily Beast has contacted Springsteen’s and Harris’ reps for comment.\n\nWinfrey has previously said she was not “paid a dime” for the town hall she hosted, Deadline and other outlets reported. Instead, the campaign paid her company, Harpo Productions, to provide sets, lights, cameras, microphones, crew, producers, and even the chairs used during the live event.\n\n“I did not take any personal fee,” Winfrey wrote. “However the people who worked on that production needed to be paid. And were. End of story.”\n\nThe campaign also paid Beyoncé’s production company $165,000 about a month after the singer spoke at a Harris rally in Houston, according toUSA Today. Beyoncé’s mother, Tina Knowles, denied a claim going around in November that her daughter had been paid $10 million to appear alongside Harris.\n\n“Beyoncé did not receive a penny for speaking at a presidential candidate Vice President Kamala Harris’s Rally in Houston. In fact she actually paid for her own flights for her and her team, and total Glam,” Knowles wrote inan Instagram post.\n\nTrump nevertheless repeated the rumor in afollow-up Truth Social poston Monday.\n\n“According to news reports, Beyoncé was paid $11,000,000 to walk onto a stage, quickly ENDORSE KAMALA, and walk off to loud booing for never having performed, NOT EVEN ONE SONG!” he wrote.\n\n“Remember, the Democrats and Kamala illegally paid her millions of Dollars for doing nothing other than giving Kamala a full throated ENDORSEMENT. THIS IS AN ILLEGAL ELECTION SCAM AT THE HIGHEST LEVEL! IT IS AN ILLEGAL CAMPAIGN CONTRIBUTION! BRUCE SPRINGSTEEN, OPRAH, BONO AND, PERHAPS, MANY OTHERS, HAVE A LOT OF EXPLAINING TO DO!!!”",
        "source_2": "Jordan King is a Newsweek reporter based in London, U.K. Her current focus is on religion, health, food safety and population. She has covered the persecution of religions in the global south, fertility and birth rate issues around the world, multiple disease outbreaks in the U.S. and ongoing vaccination discourse. Jordan joined Newsweek in 2024 from The Evening Standard and had previously worked at Metro.co.uk, she has background in international human-interest stories and is a graduate of Kingston University, in London. You can get in touch with Jordan by emailingj.king@newsweek.com. Languages: English.\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nPresidentDonald Trumphas called for a \"major investigation\" into celebrities who aidedKamala Harris' 2024 election campaign, including Bruce Springsteen, Beyoncé,Oprah Winfrey, and Bono, saying their appearances were potentially illegal contributions.\n\nNewsweekhas contacted representatives for the Kamala Harris campaign, Bono, and the production companies for Beyonce, Bruce Springsteen, via email, along with Oprah's production company, via LinkedIn, for comment.\n\nTrump is raising fresh questions about how the Federal Election Commission interprets campaign event performances and what constitutes an in-kind contribution, and the broader implications could influence how future political events harness celebrity influence.\n\nThe president's call for an investigation comes amid a spat between Trump and Springsteen, after the musician, known as \"The Boss,\" opened his tour on Wednesday night by calling the Trump administration\"corrupt, incompetent and treasonous.\"\n\nIn response, Trump took to his social media platform Truth Socialand called Springsteen \"a pushy, obnoxious JERK\" and a \"dried-out 'prune' of a rocker.\"\n\nSpringsteenspoke out againafter Trump's social media post, saying that events in America \"are altering the very nature of our country's democracy.\"\n\nTrump posted to his Truth Social platform on Monday: \"HOW MUCH DID KAMALA HARRIS PAY BRUCE SPRINGSTEEN FOR HIS POOR PERFORMANCE DURING HER CAMPAIGN FOR PRESIDENT?\n\n\"WHY DID HE ACCEPT THAT MONEY IF HE IS SUCH A FAN OF HERS? ISN'T THAT A MAJOR AND ILLEGAL CAMPAIGN CONTRIBUTION? WHAT ABOUT BEYONCÉ? ...AND HOW MUCH WENT TO OPRAH, AND BONO???\n\n\"I am going to call for a major investigation into this matter. Candidates aren't allowed to pay for ENDORSEMENTS, which is what Kamala did, under the guise of paying for entertainment.\n\n\"In addition, this was a very expensive and desperate effort to artificially build up her sparse crowds. IT'S NOT LEGAL! For these unpatriotic 'entertainers,' this was just a CORRUPT & UNLAWFUL way to capitalize on a broken system.\"\n\nTrump's made similar commentsin December. There is no indication that payments that have been confirmed are personal payments to the performers and there should not be an assumption that they profited personally, or received any money, from the performances referenced.\n\nRecords from the Federal Election Commission show that the campaign paid Beyoncé's production company, Parkwood Production Media LLC, $165,000 on November 19, 2024,USA Todayreported at the time.\n\nHarris also paid $1 million to Oprah's production company Harpo Productions in October—in two $500,000 sums.\n\nOprah said in a video at the time: \"I did not take any personal fee. However, the people who worked on that production needed to be paid. And were. End of story.\"\n\nSpringsteen's production company, Thrill Hill Productions, received a payment of $75,000 from the Harris for President campaign on November 19, 2024, according to Federal Election Commission records.\n\nJust after last year's election, there was a claim that Beyoncé was paid $10 million for her appearance in Harris' campaign.\n\nBut the singer's mother, Tina Knowles, hit back in a post onInstagramtargeting a post from conservative commentatorCandace Owens.\n\n\"So, this has been flagged on Instagram as fake news and taken down. It's called false Information,\" Knowles said.\n\n\"The lie is that Beyoncé was paid $10 million to speak at a rally in Houston for Vice President Kamala Harris,\" she added. \"When in fact: Beyoncé did not receive a penny for speaking at a Presidential candidate Vice President Kamala Harris' rally in Houston.\"\n\n\"In fact, she actually paid for her own flights for her and her team, and total Glam,\" she said.\n\nBruce Springsteen, speaking at his concert:\"In my country they're taking sadistic pleasure in the pain they inflict on loyal American workers. They're rolling back historic civil rights legislation that has led to a more just and plural society. They are abandoning our great allies and siding with dictators against those struggling for their freedom. They are defunding American universities that won't bow down to their ideological demands.\"\n\nBeyoncé said at a campaign rally for Kamala Harris last year: \"I'm not here as a celebrity, I'm not here as a politician. I'm here as a mother. A mother who cares deeply about the world my children and all of our children live in, a world where we have the freedom to control our bodies, a world where we're not divided.\"\n\nThe Federal Election Commission has not publicly responded to Trump's call for an investigation, and it remains unclear whether any formal complaint has been file.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nJordan King is a Newsweek reporter based in London, U.K. Her current focus is on religion, health, food safety and population. She has covered the persecution of religions in the global south, fertility and birth rate issues around the world, multiple disease outbreaks in the U.S. and ongoing vaccination discourse. Jordan joined Newsweek in 2024 from The Evening Standard and had previously worked at Metro.co.uk, she has background in international human-interest stories and is a graduate of Kingston University, in London. You can get in touch with Jordan by emailingj.king@newsweek.com. Languages: English.\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nJordan King is a Newsweek reporter based in London, U.K. Her current focus is on religion, health, food safety and population. She has covered the persecution of religions in the global south, fertility and birth rate issues around the world, multiple disease outbreaks in the U.S. and ongoing vaccination discourse. Jordan joined Newsweek in 2024 from The Evening Standard and had previously worked at Metro.co.uk, she has background in international human-interest stories and is a graduate of Kingston University, in London. You can get in touch with Jordan by emailingj.king@newsweek.com. Languages: English.\n\nJordan King is a Newsweek reporter based in London, U.K. Her current focus is on religion, health, food safety and                                    ...Read more",
        "source_3": "President Trump is calling for an investigation into the celebrity endorsements that former Vice President Kamala Harris received while she was running for president.\n\nHe accused Ms. Harris of paying for the endorsements with campaign cash, which is illegal.\n\n“How much did Kamala Harris payBruce Springsteenfor his poor performance during her campaign for president? Why did he accept that money if he is such a fan of hers? Isn’t that a major and illegal campaign contribution? What about Beyonce?… And how much went to Oprah and Bono???” Mr. Trump wrote in all caps Monday on social media.\n\n“I am going to call for a major investigation into this matter. Candidates aren’t allowed to pay for ENDORSEMENTS, which is what Kamala did, under the guise of paying for entertainment,” he said.\n\nHe said it was a “very expensive and desperate effort to artificially build up her sparse crowds.”\n\n“IT’S NOT LEGAL! For these unpatriotic ‘entertainers,’ this was just a CORRUPT & UNLAWFUL way to capitalize on a broken system. Thank you for your attention to this matter!!!”\n\nWhile Ms. Harris’ campaign was particularly star-studded, Mr. Trump did see a few celebrities backing his campaign, including country rapper Kid Rock.\n\nSome celebrities associated with Ms. Harris’ campaign denied they were paid for their endorsements.\n\nOprah Winfrey said she “was not paid a dime” and that the $1 million paid to her production company, Harpo, went only to those workers.\n\n“However, the people who worked on that production needed to be paid. And were. End of story,” she said on social media.\n\nIn another Monday morning post, Mr. Trump claimed Beyonce was paid $11 million to “walk onto a stage, quickly ENDORSE KAMALA, and walk off to loud booing for never having performed, NOT EVEN ONE SONG!”\n\nUSA Today reported last year that Beyonce’s production company was paid $165,000, citing Federal Election Commission data.\n\nTina Knowles, Beyonce’s mother, said on social media that her daughter “did not receive a penny” for speaking at the rally.\n\nMr. Trump called the payments “an illegal election scam at the highest level” and said the celebrities “have a lot of explaining to do.”\n\nThe president has been on a war path with celebrities. On Friday, he said Taylor Swift was no longer “hot” and that he hated her.\n\nHe also railed against Mr.Springsteen, who blasted the Trump White House during a Wednesday concert in Manchester, England.\n\nMr.Springsteen, 75, told the Manchester crowd how much he loves America but that it’s in the “hands of a corrupt, incompetent and treasonous administration.”\n\nThe president said he “never liked him, never liked his music, or his Radical Left Politics.”\n\n“I see that Highly OverratedBruce Springsteengoes to a Foreign Country to speak badly about the President of the United States. … He’s not a talented guy — Just a pushy, obnoxious JERK, who fervently supported Crooked Joe Biden, a mentally incompetent FOOL, and our WORST EVER President, who came close to destroying our Country. If I wasn’t elected, it would have been GONE by now!” Mr. Trump wrote.\n\n• Mallory Wilson can be reached atmwilson@washingtontimes.com.\n\nCopyright © 2025 The Washington Times, LLC.Click\n                            here for reprint permission.\n\nPope Leo should tell Catholics: Marry young, have many children\n\nTrump’s TikTok delays undermine his China hawks while Intel controversy grows"
    }
}