{
    "question": "How might discussing a ceasefire only as part of a broader peace agreement, potentially hosted at the Vatican, shape each side’s incentives and leverage and the effectiveness of US/EU pressure?",
    "content": {
        "source_1": "The president signaled that the U.S. would not play a mediating role in the discussions.\n\nPresident Donald Trump walks across the South Lawn upon arrival at the White House on Marine One in Washington on May 16, 2025.  | Rod Lamkey Jr./AP\n\nAfter months of uneven pressure and public pleas have done little to advance ceasefire talks between Russia and Ukraine, President Donald Trump may be walking away.\n\nFollowing a two-hour phone call Monday with Russian President Vladimir Putin, Trump stated that the two countries would “immediately” start ceasefire talks. But he seemed to signal that he would no longer seek to play a mediating role in ending the three-year war.\n\nRegarding a ceasefire, Trump wrote in aTruthSocial post, “The conditions for that will be negotiated between the two parties, as it can only be, because they know the details of a negotiation that nobody else would be aware of.” He also described the “tone and spirit” of his conversation with Putin as “excellent.”\n\nBut Trump’s apparent inclination to step back from his own peacemaking efforts — and a campaign promise that he could end the war on “day one” — carries profound consequences for Ukraine’s future and European security. Ukraine has long depended on U.S. backing as leverage — including the threat of sanctions — in negotiations with the Kremlin, while Putin has hoped to run out the clock.\n\nTrump, unable to move Putin with an approach that was mostly carrots and few sticks, now appears to be granting the Russian leader his wish, seemingly stepping back without applying new economic sanctions.\n\nAlthough the president, speaking to reporters in the Oval Office later Monday, insisted he wasn’t yet washing his hands of the peace talks, even as he admitted he has a red line “in his head” that he isn’t ready to reveal. “I do have a certain line,” he said. “But I don’t want to say what that line is because it makes the negotiation even more difficult.”\n\nWhile expressing optimism that “something big” would happen soon, he left open the possibility that talks would fail. “Big egos involved, but I think something’s going to happen,” Trump said. “And if it doesn’t — just going to have to back away and keep going.”\n\nProne to quick pivots, Trump could always reassert himself in the process if a truce does materialize. But his disengagement from the war in Ukraine could mark a shifting foreign policy focus toward trade talks with other nations and a potential nuclear deal with Iran. That could leave Europe scrambling to shore up Ukraine’s defenses on the battlefield in the coming months, as Trump’s reluctance to authorize more defense aid and waning interest in ending the war could provide Russia with a clearer opportunity to push ahead in a brutal war of attrition.\n\nSome European leaders who spoke with Trump following his conversation with Putinissued a statement of supportfor Ukraine and said that they would do what the U.S. would not and increase sanctions on Moscow, although they did not say when.\n\nBy agreeing to engage in ceasefire talks with Ukraine, Putin appeared to buy himself additional time with Trump, who has occasionally threatened to impose additional economic sanctions on Moscow if the Russian leader didn’t get more serious about ending the war. But Putin’s comments following the call with Trump, as reported by Russia’s state-owned TASS news outlet, made clear that he was only committing to discussing a ceasefire after other “relevant agreements” were reached.\n\nPutin’s apparent commitment to work on a “memorandum” with Ukraine on future peace talks stopped far short of agreeing to Ukraine’s primary condition, that talks could only begin following a ceasefire.\n\nUkrainian President Volodymyr Zelenskyy, speaking in Kyiv following his own call with Trump, confirmed that he pushed Trump to sanction Russia more fully and reiterated a desire for the U.S. to continue to play a leading role mediating peace talks.\n\n“It is crucial for all of us that the United States does not distance itself from the talks and the pursuit of peace, because the only one who benefits from that is Putin,” Zelenskyy said ina post on X.\n\nSpeaking to reporters earlier, Zelenskyy continued to express skepticism about Russia’s maximalist demands, trodding lightly. “Trump thinks Russia is ready for negotiations and for compromises. But we will see.” Zelenskyy said. “But let’s be clear, if Russia sets conditions for us to withdraw from our own land, that means they don’t want [a] ceasefire and end of the war. Because they know Ukraine will never accept this.”\n\nIryna Gerashchenko, a Ukrainian member of parliament, was less diplomatic, calling the new proposal Trump outlined “a trap.” She continued: “Direct negotiations without a mediator and guarantors of the implementation of agreements — this is the Kremlin’s dream, to endlessly shift responsibility to Ukraine, stall for time and continue killing.”\n\nTrump had warned in recent weeks that he could simply just walk away from peace talks if both sides couldn’t reach an agreement — a scenario that, because it stands to benefit Russia over the long term, likely factored into Putin’s calculations about how seriously to participate in fledgling ceasefire talks.\n\nEarlier on Monday, Vice President JD Vance hinted at this possibility and acknowledged that the two sides appeared to be at “a bit of impasse” as he spoke to reporters aboard Air Force Two as he returned from Pope Leo’s inaugural mass in Rome .\n\n“We’re more than open to walking away,” Vance said. “The United States is not going to spin its wheels here. We want to see outcomes.”\n\nLast week’s talks between Russian and Ukrainian officials in Istanbulmade little progress. Putin refused to travel to Turkey to meet Ukrainian President Volodymyr Zelenskyy, who traveled to Ankara for a separate meeting with Turkey’s president and had expressed a willingness to sit down with Putin for the first time since the war began.\n\nTrump, after meeting privately with Zelenskyy on the sidelines of Pope Francis’ funeral,acknowledged publiclythat Putin could be “tapping” him along. And the U.S. moved quickly to firm up and sign aneconomic agreement with Ukraine on a joint investment fundthat the White House has suggested will give the U.S. a long-term stake in the country’s post-war future and thus something of a bulwark against future Russian aggression.\n\nOther administration officials, including Secretary of State Marco Rubio, have already asserted that, with Ukraine accepting the terms of a 30-day ceasefire proposal from the White House, the onus was shifting to Russia to show that it, too, was serious about peace.\n\nBut after weeks of such comments, Trump has yet to truly ratchet up the pressure on Moscow. He has discussed the possibility of additional economic sanctions but opted against imposing them thus far. Last week while traveling in the Middle East, Trump brushed off Putin’s refusal to meet Zelenskyy in Istanbul and seemed to validate his excuse: saying that the Russian leader only wanted to meet with him.",
        "source_2": "Reporting by Guy Faulconbridge and Vladimir Soldatkin in Moscow, Max Hunder and Tom Balmforth in Kyiv, Maxim Rodionov in London, Steve Holland, Susan Heavey, Rami Ayyub and David Brunnstrom in Washington; Lidia Kelly in Melbourne and Ron Popeski in Winnipeg; Editing by Cynthia Osterman and Stephen Coates\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nAs Moscow bureau chief, Guy runs coverage of Russia and the Commonwealth of Independent States. Before Moscow, Guy ran Brexit coverage as London bureau chief (2012-2022). On the night of Brexit, his team delivered one of Reuters historic wins - reporting news of Brexit first to the world and the financial markets. Guy graduated from the London School of Economics and started his career as an intern at Bloomberg. He has spent over 14 years covering the former Soviet Union. He speaks fluent Russian.",
        "source_3": "Published:18:47 BST, 19 May 2025|Updated:21:27 BST, 19 May 2025\n\nPresidentDonald Trumpgave an upbeat readout of his Monday call with Vladimir Putin about ending the brutal war in Ukraine – even urging Russia and Ukraine to use the Pope as a mediator.\n\nTrump said his call with Putin went 'very well' – but neither leader announced a breakthrough toward a ceasefire that would pause the gruesome conflict.\n\nInstead, Trump said Russia and Ukraine would negotiate directly between themselves since they 'know the details'  – in talks Trump suggested could be hosted at the Vatican by the new Pope Leo.\n\nHe also dangled potential 'large scale' trade between the U.S. and Russia, an inducement he has floated throughout his efforts to bring the war to a conclusion.\n\nThe U.S. slapped a barrage of sanctions onMoscowafter its 2022 invasion of its neighbor, Ukraine.\n\nTrump said that Ukraine could also be a 'beneficiary' as it seeks to rebuild its war-ravaged country, a possible reference to the recent minerals deal inked between Washington and Kiev.\n\nHe said negotiations 'will begin immediately' – days after teams of Russian and Ukrainian officials met in Turkey.\n\nTrump wrote on his Truth Social site Monday that he completed a 'two hour call with President Vladimir Putin of Russia.'\n\n'I believe it went very well. Russia and Ukraine will immediately start negotiations toward a Ceasefire and, more importantly, an END to the War,' he went on.\n\n'The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of. The tone and spirit of the conversation were excellent.'\n\nPresident Donald Trump spoke by phone with Russian President Vladimir Putin after negotiators in Turkey failed to agree to a ceasefire\n\nPope Leo XIV takes the Inauguration Mass in St Peter's Square\n\nTrump then added that Russia wants to do 'largescale trade with the United States' after the fighting, which he called a 'bloodbath,' ends.\n\n'There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth. Its potential is unlimited,' he continued.\n\nUkraine can also be a 'great beneficiary on trade' as the country rebuilds.\n\n'Negotiations between Russia and Ukraine will begin immediately,' said Trump.\n\nThe president said he has informed Ukraine's President Volodymyr Zelensky among other world leaders immediately after his call with Putin wrapped up.\n\nNotably, Prime Minister Keir Starmer of the United Kingdom was not on the list that includedUrsula von der Leyen, president of the European Commission, PresidentEmmanuel Macron, ofFrance, Prime Minister Giorgia Meloni, ofItaly, Chancellor Friedrich Merz, ofGermany, and President Alexander Stubb, ofFinland.\n\nStarmer was hosting a business engagement at Downing Street a source told Daily Mail, adding Trump and the prime minister 'speak frequently and will look at alternative time to download.'\n\n'The Vatican, as represented by the Pope, has stated that it would be very interested in hosting the negotiations. Let the process begin!' he announced.\n\nPope Leo would 'if necessary, make the Vatican, the Holy See, available for a direct meeting between the two parties,' Cardinal Pietro Parolin, secretary of state for the Holy See, said Friday, floating the potential use of the venue for peace talks.\n\nWhite House Press Secretary Karoline Leavitt told reporters Monday that Vice President JD Vance 'passed along' a letter to the Pope from Trump and the first lady 'extending their warm wishes and inviting them to the White House as soon as they possibly can come.'\n\nPope Leo XIV waves as he arrives in the Popemobile ahead of the Inauguration Mass\n\nTrump and Putin aren't believed to have spoken since February\n\nPutin in his own remarks called the phone call 'very meaningful' and 'very, very informative and helpful.'\n\nTrump spoke to Putin after calling for an end to the 'bloodbath' in Ukraine that began withRussia's 2022 invasion.\n\nTrump indicated that he would urgePutinto stop the 'bloodbath' in Ukraine, after spending weeks highlighting reports he says he gets on the grim casualty estimates.\n\n'The subjects of the call will be, stopping the 'bloodbath' that is killing, on average, more than 5,000 Russian and Ukrainian soldiers a week, and trade,' Trump wrote on his Truth Social site.\n\n'I will then be speaking to President Zelensky of Ukraine and then, with President Zelensky, various members ofNATO,' he said. That timeline was contradicted by the government inKiev, which said Trump spoke to Zelensky before the Putin call was underway.\n\nVice PresidentJD Vancemet withZelenskyin Rome at the U.S. ambassador's residence Sunday as leaders attended Pope Leo XIV's inaugural Mass.\n\n'I´d say we're more than open to walking away,' Vance said before departing Rome.\n\nThe call was the first time Trump and Putin are believed to have spoken since February.\n\n'The conversation is important given the talks that took place in Istanbul,' said Kremlin spokesman Dmitry Peskov, the Tass news agency reported.\n\n'It is preferable to achieve our goals through political and diplomatic means, of course,' Peskov said.\n\nTrump said during the campaign that he would easily end the conflict 'quickly' and that it would take him 'no longer than one day.'\n\nWhite House Press Secretary Karoline Leavitt dodged when asked Mondaymorning for specifics in advance of Trump's call and whether Trump would push Putin to accept a ceasefire.\n\nRussia's war has taken a withering toll on civilians and infrastructure in Ukraine since the 2022 invasion\n\n'The president has made it clear his goal is to see a ceasefire and to see this conflict come to an end. And he's grown weary and frustrated with both sides of the conflict,' Leavitt said.\n\n'The President and his team have put an enormous amount of effort in solving this very complicated war,' she added.\n\nLeavitt wouldn't answer when asked if Trump thinks Putin is the 'good guy' or the 'bad guy' in the conflict.\n\n'I'll let the president speak on that conversation later,' she said.\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nBy posting your comment you agree to ourhouse rules.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with ourPrivacy Policy."
    }
}