{
    "question": "How might the findings of the NTSB investigation into the Cuauhtémoc’s collision with the Brooklyn Bridge shape future safety practices for tall sailing vessels operating in busy urban waterways?",
    "content": {
        "source_1": "Mexican naval ship collided with the Brooklyn Bridge on Saturday, killing two people and injuring 19 others\n\nI would like to be emailed about offers, events and updates from The Independent. Read ourPrivacy notice\n\nA Mexican navy trainingshiphit theBrooklyn Bridgein New York City Saturday, killing two people and injuring 19.\n\nThe sailing ship Cuauhtémoc was supposed to leave the city and sail out to sea when itstruck the bridge Saturday evening.Its three masts snapped when it smashed into the world-famous bridge, with witnesses describing the sudden chaotic scene.\n\nThere were 277 people on board the vessel when it collided with the bridge. In videos of the incident, crew members were seen standing atop the rung of the mast could be seen clinging to the mast. Others were left dangling from ropes waiting for help, while some were left hanging from harnesses high in the air.\n\nThe 142-year-old bridge suffered “no significant structural damage,” theNational Transport Safety Board confirmed at a Monday press briefing.\n\nThe incident unfolded shortly before 8:30 p.m. Saturday on New York’s East River.\n\nThe Cuauhtémoc training vessel was on a goodwill tour and supposed to head out to sea after stopping in New York City to refuel. But instead of sailing south, the ship headed in the wrong direction toward the Brooklyn Bridge, city officials said.\n\nBystanders on the Brooklyn waterfront caught the moment of impact on camera, with footage showing crowds fleeing from the water’s edge as the ship’s towering masts collided with the bridge.\n\nThe ship appeared to strike what appeared to be scaffolding or gantry on the underside of the bridge, which was seen swinging.\n\nDebris fell toward the deck of the ship, including portions of the masts, lights and rigging. Crew members, standing on the masts, clung to it as it braced for impact. Some were lurched forward but none fell into the water, contrary to earlier reports.\n\nThe New York Coast Guard said the Cuauhtémoc lostall three masts.\n\nThe historic bridge did not suffer any major damage and was reopened after a preliminary inspection.\n\nThe two people killed in the crash were both crew members. At a press conference, New York City Mayor Eric Adams confirmed their deaths and that 19 others were injured, five critically.\n\nAmérica Yamilet Sánchez, 20, of Veracruz, Mexico, wasidentifiedas one of the deceased cadets by the governor of Veracruz.\n\n“I deeply regret the passing of Veracruz cadet América Yamilet Sánchez,” Rocío Nahle wrote on X. “My love, support, and solidarity go out to her family.”\n\nThe second victim has been named as Adal Jair Marcos of Oaxaca. Marco was known as “Tyson” to his friends and had been living on the boat for the last nine months of his life, reportsEl Universal.\n\nMexican President Claudia Sheinbaum mourned the loss of the two crew members.\n\n\"Our solidarity and support go out to their families,\" Sheinbaum said on X.\n\nInvestigations into the cause of the crash are ongoing. The National Transport Safety Board said at Monday’s briefing that it would release a preliminary report within 30 days, adding that it was too early to speculate or determine the cause.\n\nAdams said the boat had a mechanical mishap that caused it to veer into the bridge, after it set off from nearby Pier 17.\n\nThe Cuauhtémoc was seen on Saturday moving rapidly in reverse toward the Brooklyn side of the East River, heading straight for the bridge. Brian Young, the board’s lead investigator, said that the ship requested assistance for tugboats at 8:24 p.m. Saturday and hit the bridge soon after. The NYPD was on the scene by 8:30 p.m.\n\nThe captain of the ship told authorities he lost power of the ship, forcing it to head for the bridge abutment on the Brooklyn side.\n\nThe safety board said it had not interviewed the ship’s captain or the crew as of Monday.\n\nThe Cuauhtémoc's mast height was 158 feet but the bridge has a 135-foot clearance at its center.\n\nEach year, the Cuauhtémoc, a Mexican naval training ship for the Mexico’s Heroic Naval Military School, sets out at the end of naval military school to finish cadets’ training.\n\nIt planned to spend more than 200 days away visiting 22 ports in 15 countries including Jamaica, Cuba, Scotland, Spain, Barbados, Iceland and the U.K. but the trip was unexpectedly cut short in New York.\n\nThis year, it left the Mexican port of Acapulco, on the Pacific coast, on April 6, the navy said. The Mexican consulate said it arrived at Pier 17 on May 13 and invited people to visit through May 17.\n\nThe ship, which measures approximately 297 feet long and 40 feet wide, was about to leave New York City for a goodwill tour to Iceland when the incident happened.\n\nJoin thought-provoking conversations, follow other Independent readers and see their replies",
        "source_2": "Authorities in New York are investigating the site where a Mexican sailing ship struck the Brooklyn Bridge for clues about how the fatal collision occurred.\n\nTwo people on board were killed and at least 19 others were injured when the Mexican Navy training ship crashed into the bridge on Saturday night.\n\nPolice said early investigations showed the ship had lost power before the collision. Video showed the ship's three tall masts crumbling as horrified onlookers watched from the shore.\n\nIt's not clear how the vessel came to approach the bridge, which authorities confirmed was not damaged by the strike. It had reopened to traffic late on Saturday.\n\nPolice said the Cuauhtémoc ship had a 48.2m (158ft) mast height while the bridge had a 41.1m (135ft) clearance at its centre, according to the New York transport department's website.\n\nResponders were able to remove at least 27 people from the ship for treatment, while all 277 personnel on the ship were accounted for, said New York fire authorities.\n\nThe ship lost all three masts and has been moved to a nearby pier for investigation.\n\nThe National Transportation Safety Board said it was sending a team to assist in the investigation, which is being coordinated between the US and Mexico governments.\n\nMexico's Navy Secretary Raymundo Pedro Morales Ángeles said in a statement the results of any investigation would be followed with \"total transparency and responsibility\".\n\nThe Cuauhtémoc left Acapulco, Mexico, on 6 April on a tour that included stops in New York and Aberdeen, Scotland, for the city's Tall Ships race in July.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nHe has apologised over the Oaxaca Slip-on, inspired by sandals made by Indigenous artisans, after criticism from Mexico.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.",
        "source_3": "A Mexican tall ship slammed into the Brooklyn Bridge because it apparently lost its steering capacity thanks to mechanical failure, sources said — a tragedy eerily reminiscent of last year’s Baltimore span disaster.\n\nShocking footage captured the moment theMexican Navy’s 147-foot tallshowboat the Cuauhatemocstruck the historic New York City bridgeSaturday night,killing two crew members, injuring at least 17other people — and leaving terrified crew members dangling and clinging for dear life from the rigging.\n\n“There must have been a lot of frantic, ‘Look out!’ There had to be some pandemonium,” retired US Navy Capt. Alfred McLaren told The Post of the likely scene aboard ship.\n\nSources said the 43-year-old vessel was on its way to the Brooklyn waterfront to refuel before setting sail for Iceland but had plenty of diesel when it appeared to have lost its steering ability because of a mechanical malfunction and was quickly carried into the bridge by powerful East River currents.\n\nA local harbor pilot, or mariner familiar with the East River’s currents and condition, and area docking pilot, who helps navigate ships out of regional berths and docks, were involved in aiding the guiding of the vessel before the crash, well-placed sources said. At least one of the two was on board the ship at the time.\n\nWith an investigation now under way to confirm what went wrong, former US Coast Guard Lt. Henry Lipian told The Post the crew could have tried to drop anchor to try to help thwart the tragedy.\n\n“It doesn’t mean an anchor’s going to work,” Lipian said. “It might slow the ship a little bit, but it might not be enough to stop it. It’s no guarantee.\n\n“You lose your engine for whatever reason, you’re at the mercy of the elements.”\n\nLipian said it was a “worst-case scenario” for a crew made up largely of “trainees” to lose power in a harbor such as New York’s.\n\n“You only have a short distance and a relatively short period of time to react,” he said.\n\n“If you lose power there you’re in big trouble. Think about those elements. You have the wind. The wind is going to push the vessel to some extent. You’re going to have the current. And the tides in the same direction as the current and whatever direction [the vessel] was traveling at before you lose power — you still have the momentum of the direction the vessel was traveling in.\n\n“If you can’t get the anchor down fast enough, it’s the worst possible scenario.”\n\nThe collision bore haunting similarities to the March 2024collapse of the Francis Scott Key Bridge.\n\nSix construction workers on that bridge were killed when a massive cargo ship lost power and couldn’t steer, barreling into the span, which crumpled into the bay.\n\nIn that case, the ship went dark before the collision, unlike the Saturday night Brooklyn Bridge incident, during which the sailing vessel’s lights continued to shine even after the crash.\n\nSaturday’s tragic accident befalling a well-regarded navy such as Mexico’s left McLaren stunned.\n\n““I’ve never ever heard any criticism of the Mexican Navy. I’m dumbfounded,” he said. “It’s just horrible.”\n\nThe ship carried 277 crew members and was largely used as a training vessel for navy cadets.\n\nPeter Himler from Flatiron Communications, which is helping to put together the planned July 4, 2026, international parade of ships in New York Harbor for America’s 250th anniversary, said the Cuauhtemoc was anticipated to take part in the highly anticipated event but had not yet confirmed.\n\nThePost was aboard the shiplast week for the announcement as it coasted past the Verrazzano-Narrows Bridge and into Pier 17at the South Street Seaport.\n\nAuthorities said the two crew members who were killed were in the rigging on the masts that crumbled when it struck the bridge, while others fell or were injured by debris that rained down on the deck.\n\nMayor Eric Adams said the injured crew were taken to Bellevue Hospital.\n\nThe National Transportation Safety Board, which is investigating the incident, did not immediately respond to a Post request for comment Sunday."
    }
}