{
    "question": "How might the Supreme Court’s decision to block expedited deportations under the Alien Enemies Act, and to send the case back to an appeals court to determine legality and required notice, shape future immigration enforcement and due process standards for migrants?",
    "content": {
        "source_1": "The Supreme Court on Fridayblocked President Donald Trump from moving forward with deportationsunder the 1798 Alien Enemies Act for a group of immigrants in northern Texas, siding with Venezuelans who feared they were poised for imminent removal under the sweeping wartime authority.\n\nThe decision is a significant loss for Trump, who wants to use the law to speed deportations – and avoid the kind of review normally required before removing people from the country. But the decision is also temporary and the underlying legal fight over the president’s invocation will continue in multiple federal courts across the country.\n\nThe justices sent the case at issue back to an appeals court to decide the underlying questions in the case, including whether the president’s move is legal and, if it is, how much notice the migrants targeted under the act should receive.\n\nRelated articleConservative justices object to how lower courts are blocking Trump, but birthright citizenship case presents deeper issues\n\nTwo conservative justices – Clarence Thomas and Samuel Alito – publicly noted their dissent.\n\nThe court’s unsigned opinion was notably pointed about how the government was attempting to handle the removals and also how US District Judge James Hendrix had dealt with the case at an earlier stage.\n\nThe court referenced another case that had reached it previously, that of the Maryland man, Kilmar Abrego Garcia, who was mistakenly removed to El Salvador. The court noted that the Trump administration has represented that it is “unable to provide for the return of an individual deported in error to a prison in El Salvador.”\n\nGiven that, the court said, “the detainees’ interests at stake are accordingly particularly weighty.” In other words, the court was saying it is important to get the legal questions correct before people are removed, potentially, forever.\n\nThe court added that the way the Trump administration was handling the removals did not “pass muster.” Specifically, the justices pointed to notice of only 24 hours that was “devoid of information about how to exercise due process rights to contest that removal.”\n\nThe Supreme Court sent the case back to the New Orleans-based 5th US Circuit Court of Appeals for further review, saying in its order that the appeals court erred in dismissing the detainees’ appeal.\n\n“Today’s ruling effectively extends the temporary freeze that the justices put on Alien Enemies Act removals from the Northern District of Texas back on April 19,” said Steve Vladeck, CNN Supreme Court analyst and professor at Georgetown Law. “Because lower courts have blocked use of the actin every other districtin which the president has sought to invoke it, that means it’s effectively pausing all removals under the act until the 5th Circuit – and, presumably, the Supreme Court itself – conclusively resolves whether they’re legal and how much process is due if so.”\n\nThe court also appeared to criticize how Hendrix, whom Trump nominated to the bench in his first term, had handled the case. Hendrix declined to halt the removals and argued in his opinion that the ACLU was attempting to rush the district court to act.\n\n“Here the District Court’s inaction – not for 42 minutes but for 14 hours and 28 minutes – had the practical effect of refusing an injunc­tion to detainees facing an imminent threat of severe, irrep­arable harm,” the court wrote.\n\nAlito, in a 14-page dissent joined by Thomas, said that the high court had wrongly intervened at this time and sharply criticized it for telling the appeals court how to handle the case before it was fully handled by the district court.\n\nThe court, he wrote, “has blazed a new trail. It has plucked a case from a district court and decided important issues in the first instance. To my eyes, that looks far too much like an expansion of our original jurisdiction.”\n\nAlito had initially dissented when the court first issued interim relief to the migrants last month.\n\nJustice Brett Kavanaugh, in a brief concurrence, said he agreed with the court’s decision but would have taken up the case in full now.\n\n“The circumstances call for a prompt and final resolution, which likely can be provided only by this Court,” he wrote. “Rather, consistent with the executive branch’s request for expedition – and as the detainees themselves urge – I would grant certiorari, order prompt briefing, hold oral argument soon thereafter, and then resolve the legal issues.”\n\nThe comments from Kavanaugh come a day after the high court grappled with whether it should consider the merits of another one of Trump’s controversial immigration policies – his bid to end birthright citizenship – that had only landed before it on an emergency basis.\n\nThe Justice Department did not immediately respond to a request for comment.\n\nTrump claimed in a social media post Friday that the Supreme Court “WON’T ALLOW US TO GET CRIMINALS OUT OF OUR COUNTRY” after the court’s decision.\n\nThe decision came as lower courts across the country are wrestling with Trump’s implementation of the Alien Enemies Act, a result of an earlier Supreme Court order that required the cases to be filed in separate district courts rather than on a nationwide basis. Federal courts in Texas, Nevada, Colorado and other states have issued orders that block the administration from relying on the law – at least in the short term – while judges consider a host of lawsuits that have popped up from targeted migrants.\n\nSeveral courts have also entered more permanent orders against the law’s use, and a Trump-appointed judge in Southern Texasruled on May 2that the president had unlawfully invoked the Alien Enemies Act.\n\nFollowing through on a campaign pledge, Trump invoked the act in mid-March as a way to speed the deportation of alleged members of the Venezuelan gangTren de Aragua. Perhaps sensing the imminent litigation, the administration moved quickly to load hundreds of Venezuelans onto planes bound for El Salvador, where they remain today.\n\nAfter lower courts temporarily blocked the government from carrying out additional deportations, the Trump administration appealed to the Supreme Court in late March, citing “sensitive national-security-related operations” and asking to resume the removals. In a murky, unsigned order on April 7, the Supreme Court technically allowed Trump to continue using the law, and it blocked a legal pathway civil rights groups were attempting to use to challenge Trump’s invocation of the law so they could shut down its use wholesale.\n\nBut the court also ruled that migrants subject to deportation under the Alien Enemies Act were entitled to notice and an opportunity to challenge their removal through federal habeas corpus petitions – suits brought by people who claim they are being detained by the government unlawfully – marking a partial win for migrants.\n\nThe American Civil Liberties Union, which is representing the migrants, filed a series of habeas lawsuits seeking to protect identified migrants as well as “similarly situated” Venezuelans who could potentially be targeted under the Alien Enemies Act.Several lower courts– including one in New York and another in Texas – issued new temporary orders blocking the administration from deporting people under the act while it considers those cases.\n\nImportantly, those orders only covered the geographic regions over which the specific federal courts had jurisdiction.\n\nIn mid-April, immigrant rights groups said a number of Venezuelan detainees in northern Texas not covered by those earlier orders began receiving notices from the government that they were subject to deportation under the act. Some of those immigrants, being held at the Bluebonnet Detention Center in Anson, Texas, were told they might be removed in less than 24 hours.\n\nThose notices “cannot by any stretch be said to comply with this court’s order that notice must be sufficient to permit individuals actually to seek habeas review,” the American Civil Liberties Union said in a brief.\n\nTwo immigrants filed a habeas petition in a federal district court in Abilene, Texas, seeking a temporary order blocking their deportation and the removal of “similarly situated” people held at Bluebonnet. Hendrix denied the request for the two migrants, noting the government had “answered unequivocally” that it did not intend to remove them, so they were not at immediate risk of deportation.\n\nThe issue of Alien Enemies Act enforcement then returned to the Supreme Court. In an early morning order on April 19, a majority of justices temporarilyblocked the Trump administrationfrom deporting any of the Venezuelans in Texas who could potentially be targeted under the act so that it could look more closely at the case.\n\nThis story has been updated with additional details.",
        "source_2": "Dan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nTheSupreme Courton Friday denied the Trump administration's request to swiftly resume deportations of Venezuelan nationals underthe Alien Enemies Act, an 18th-century wartime law.\n\nIn a 7-2 decision, the justices rejected the emergency appeal filed by administration lawyers seeking to removeVenezuelan men accused of gang affiliations, an allegation the administration says qualifies them for expedited deportation under the rarely used 1798 statute.\n\nPresidentDonald Trumpquickly took aim the decision on Truth Social. \"THE SUPREME COURT WON'T ALLOW US TO GET CRIMINALS OUT OF OUR COUNTRY!\" he posted Friday afternoon.\n\nNewsweekreached out to the U.S.Department of Justicevia contact form and the American Civil Liberties Union, which brought the original suit, via email for comment.\n\nPresident Donald Trump invoked the Alien Enemies Act (AEA) in March, on the basis that the United States is under alien invasion due to immigration. The order was aimed atalleged membersof the Venezuelan gangTren de Aragua, allowing for swift removals without court hearings.\n\nThe Court had previously paused AEA deportations to El Salvador's high-security CECOT prison in a late-night order last month, temporarily blocking removals from a detention center in North Texas.\n\nFriday's decision, in which conservative JusticesClarence ThomasandSamuel Alitodissented from the majority, also related to those being held in Texas. Conservative justicesJohn Roberts,Brett Kavanaugh,Amy Coney Barrett, andNeil Gorsuchjoined the liberal justices in the unsigned order.\n\nIn their decision, the justices sent the case back to an appeals court to decide on the underlying issue of the use of the Alien Enemies Act, while calling out the federal government over the time frame given to plaintiffs to launch legal challenges to their imminent deportations.\n\n\"Under these circumstances, notice roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal, surely does not pass muster,\" the unsigned ruling said.\n\nAt leastthree federal judgeshave said Trump was improperly using the AEA to speed deportations of people the administration says are Venezuelan gang members.\n\nOn Tuesday, a judge in Pennsylvania signed off on the use of the law.\n\nThe court-by-court approach to deportations under the AEA flows from another Supreme Court order that removed a case from a judge in Washington, D.C., and ruled that detainees seeking to challenge their deportations must do so where they are held.\n\nThe justices said in April that people must be given \"reasonable time\" to file a challenge. The court has rejected the 12 hours the administration has said would be sufficient, but has not otherwise spelled out how long it meant.\n\nOther courtshave sought to enforce longer time frames for immigrants to file challenges, with at least two judges calling for 21 days, rather than the current 12-24 hours.\n\nU.S. District Judge Stephanie Haines ordered immigration officials to give people 21 days in her opinion, in which she otherwise said deportations could legally take place under the AEA.\n\nThe Supreme Court also clarified on Friday that it was not blocking other ways the government may deport people.\n\nEarlier on Friday, Trump posted on Truth Social, criticizing the court after it heard oral arguments on his attempt to amend birthright citizenship. Justices appeared skeptical of the idea of limiting the scope of the 14th Amendment while also leaning toward limiting lower court powers.\n\nThe Supreme Court Justices, in an unsigned opinion:\"We recognize the significance of the Government's national security interests as well as the necessity that such interests be pursued in a manner consistent with the Constitution.\"\n\nPresident Donald Trump, on Truth Social, earlier on Friday:\"The Supreme Court is being played by the radical left losers, who have no support, the public hates them, and their only hope is the intimidation of the court, itself. We can't let that happen to our country!\"\n\nThe Trump administration continues to face other legal challenges to its use of the Alien Enemies Act and the bypassing of due process for immigrants fighting deportation.\n\nThis article includes reporting by The Associated Press.\n\nUpdate 5/16/25, 4:34 p.m. ET: This article was updated with additional information.\n\nUpdate 5/16/25, 5:26 p.m. ET: This article was updated with additional information.\n\nUpdate 5/16/25, 5:42 p.m. ET: This article was updated with additional remarks.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security.                                    ...Read more",
        "source_3": "Attorney Mehek Cooke explains why the Trump administration is using the Alien Enemies Act, and why federal judges have a range of opinions on the matter.\n\nTheSupreme Courton Friday decided in favor of an appeal by a group of Venezuelan migrants who asked the high court to halt their deportation under the Alien Enemies Act (AEA).\n\nThe decision, similar to others it has made in the past on the matter, revolved around the alleged illegal immigrants not having enough time to reasonably file a challenge to their deportations. Two justices, Clarence Thomas and Samuel Alito, dissented.\n\nPresidentDonald Trumphas been using the 1798 Alien Enemies Act to try and speed up the deportation processes of illegal immigrants, but the Supreme Court's Friday ruling presents another blow to those attempts after the court ruled against the Trump administration in their effort to remove men already in immigration custody in a northern region of Texas.\n\nSUPREME COURT BLOCKS NEW DEPORTATIONS OF VENEZUELANS IN TEXAS UNDER 18TH CENTURY ALIEN ENEMIES ACT\n\nSuspected gang members arrive in El Salvador by plane, including 238 members of Venezuela's Tren de Aragua gang and 23 members of the MS-13 gang.(El Salvador Presidency / Handout/Anadolu via Getty Images)\n\n\"Under these circumstances, notice roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal, surely does not pass muster. But it is not optimal for this Court, far removed from the circumstances on the ground, to determine in the first instance the precise process necessary to satisfy the Constitution in this case. We remand the case to the Fifth Circuit for that purpose,\" the ruling from the court reads.\n\nThe court did not rule on Friday on whether theAEA was lawful, but rather sent the matter back to the New Orleans-based 5th U.S. Circuit Court of Appeals.\n\n\"To be clear, we decide today only that the detainees are entitled to more notice than was given on April 18,\" the Supreme Court's ruling said.\n\nLast month, the Supreme Court lifted a lower court's order barring the government from deporting migrants under the AEA. However, that decision also made clear that anyone the government wants to deport must be given proper notice. A few weeks after that decision, the Court halted deportations of illegal immigrants in Texas that the Trump administration was trying to proceed with under the AEA.\n\nALITO BLASTS 'UNPRECEDENTED' SCOTUS MOVE TO HALT TRUMP'S VENEZUELA DEPORTATIONS: 'LEGALLY QUESTIONABLE'\n\nDecisions on six emergency appeals dealing with challenges to President Donald Trump's executive actions are forthcoming, including several tied to the Trump administration's efforts to deport illegal immigrants.(AP)\n\nThe Supreme Court's Friday decision to once again halt deportations by the Trump administration comes a day after the High Court's justices heard oral arguments in a case on birthright citizenship, which is also tied to whether federal judges can use their power to block the president's executive actions nationwide. Several lower court federal judges have sought to stop the Trump administration from rapidly deporting illegal immigrants under the AEA.\n\nIncluding thebirthright citizenship case,there are five other pending emergency appeals dealing with challenges to Trump executive actions.\n\nThose include cases related to temporary protected status (TPS) for Venezuelan migrants, immigrant parole programs, independent agency member firings, DOGE access to Social Security Administration data and federal workforce-reduction efforts — the last of which was filed on Friday afternoon.\n\nA number of Trump administration initiatives are before the Supreme Court on emergency appeals.(Fox News)\n\n\"THE SUPREME COURT WON’T ALLOW US TO GET CRIMINALS OUT OF OUR COUNTRY!\" Trump wrote on his Truth Social platform after news of the ruling.\n\nThe president followed up with a subsequent post on the platform, as well.\n\n\"The Supreme Court has just ruled that the worst murderers, drug dealers, gang members, and even those who are mentally insane, who came into our Country illegally, are not allowed to be forced out without going through a long, protracted, and expensive Legal Process, one that will take, possibly, many years for each person, and one that will allow these people to commit many crimes before they even see the inside of a Courthouse,\" he wrote.\n\n\"The result of this decision will let more CRIMINALS pour into our Country, doing great harm to our cherished American public. It will also encourage other criminals to illegally enter our Country, wreaking havoc and bedlam wherever they go. The Supreme Court of the United States is not allowing me to do what I was elected to do. Sleepy Joe Biden allowed MILLIONS of Criminal Aliens to come into our Country without any ‘PROCESS’ but, in order to get them out of our Country, we have to go through a long and extended PROCESS. In any event, thank you to Justice Alito and Justice Thomas for attempting to protect our Country. This is a bad and dangerous day for America!\"\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}