{
    "question": "How should authorities and the public weigh intent, context, and potential harm when evaluating James Comey’s “8647” Instagram post as a possible threat, and what implications could this have for political speech and security protocols going forward?",
    "content": {
        "source_1": "WASHINGTON — The Department of Homeland Security and Secret Service are investigating a social media post by former FBI DirectorJames Comeythat several U.S. officials interpreted as calling for the assassination ofPresident Donald Trump, Homeland Security Secretary Kristi Noem said Thursday.\n\nIn a now-deleted post on Instagram, Comey shared a photo of what he described as a \"shell formation\" on a beach that formed the numbers \"8647.\" The post was swiftly condemned by administration officials, Republican lawmakers and Trump allies who said it blatantly targeted Trump, the 47th president of the United States.\n\nAccording to theMerriam-Websterdictionary, \"eighty-six\" can informally mean \"to get rid of.\"\n\n\"Disgraced former FBI Director James Comey just called for the assassination of @POTUS Trump,\" Noemwrote on X. \"DHS and Secret Service is investigating this threat and will respond appropriately.\"\n\nA spokesperson for the Secret Service, which is part of DHS, said the agency \"vigorously investigates anything that can be taken as a potential threat against our protectees.\"\n\n“We are aware of the social media posts by the former FBI director and we take rhetoric like this very seriously. Beyond that, we do not comment on protective intelligence matters,\" Anthony Guglielmi, the agency's chief of communications said in a statement.\n\nTaylor Budowich, a White House deputy chief of staff, accused Comey of putting out “what can clearly be interpreted as a hit on the sitting president of the United States.”\n\n“This is deeply concerning to all of us and is being taken seriously,” Budowich wrote on X.\n\nThe president's eldest son Donald Trump Jr. accused Comey of \"causally calling for my dad to be murdered.\"\n\nComey denied that his post was meant as a threat, saying in a statement that he was unaware people linked the specific numeric arrangement with violence.\n\n“I didn’t realize some folks associate it with violence. That didn’t occur to me when I saw it but I am opposed to violence in all circumstances so I took it down,” he said.\n\nComey later said ina poston Instagram that he assumed the numbers \"were a political message.\"\n\nThe \"eighty-six\" wording has been used in a political context before, including by Trump'sone-time attorney general pick Matt Gaetz, who used the expression last yearin a postnaming Republicans he's sparred with in the past.\n\nRep. Tim Burchett, R-Tenn., called for Comey to bearrested, while Chris LaCivita, Trump’s former campaign manager, said he would have had Comey’s home raided over the post.\n\nFBI Director Kash Patelsaid thebureau is prepared to “provide all necessary support” to the Secret Service, which holds primary jurisdiction over the investigation.\n\nRep. Andy Ogles, R-Tenn., called for an \"immediate\" joint investigation into Comey's post in a letter Thursday night to Patel and Secret Service Director Sean Curran.\n\nComey was only four years into a 10-year term when Trump fired him in May 2017.\n\nUnder Comey, the FBI opened an investigation into allegations that members of Trump’s 2016 campaign had contact with Russian entities. Trump fired Comey months after that investigation was made public andhinted that the probewas among the factors that led to Comey's termination.\n\nThe primary motive for his dismissal,the White Housesaid at the time, was a conclusion by senior Justice Department officials that Comey bungled an investigation into 2016 Democratic presidential nominee Hillary Clinton's use of a private email server when she was secretary of state.\n\nThe 2024 presidential campaign saw two assassination attempts against Trump. The first was at a campaign rally in Butler, Pennsylvania, where a gunman's bullet grazed Trump's ear. Secret Service fatally shot the gunman, who killed Corey Comperatore, a former fire chief, and injured two others at the July rally.\n\nMonths later, the Secret Service foiled a second assassination attempt on Trump at a golf course near his Mar-a-Lago residence after an agent spotted a man with a rifle outside of the property.The alleged perpetrator faces severalfederalandstatecharges, including the attempted assassination of a major presidential candidate, possessing a firearm in furtherance of a crime of violence and assaulting a federal officer. He haspleaded not guiltyto all charges.\n\nComey has drawn the ire of both political parties in recent years. Democrats derided his decision to publicly announce days before the 2016 election that an investigation into Clinton’s use of emails had been reopened, with the former secretary of state herself asserting in 2017 that the announcement aided Trump's victory.\n\nAfter his termination, Comey became a frequent critic of Trump, calling him in atelevision interview“morally unfit to be president” and later characterizing him as a “unethical” man “untethered to truth”in a bookhe released in 2018 that also likened his administration to a mafia organization.\n\nComey’s criticism of Trump, and his decision to release a book as investigations heopened remained ongoing, has made him a frequent target of Republicans.\n\nThe former FBI director is now a fiction writer. He's promoting the release of a new novel, with numerous posts about the book on his Instagram account, including one of him reading on a beach.\n\nNnamdi Egwuonwu is a politics reporter at NBC News.",
        "source_2": "Sonam Sheth is an Evening Politics Editor at Newsweek who is based in New York. She joined Newsweek in 2024 and previously worked at Business Insider and CNBC. Sonam has extensive experience coveringnational security, foreign policy,elections, andstoriesat theintersection of law and politics. Her work has been cited in The Washington Post, The Atlantic, Vanity Fair, and others. She has also frequently appeared on national television and radio, including MSNBC, NBC News, BBC World News, BBC News radio, and more. You can get in touch with Sonam at s.sheth@newsweek.com. Languages: English, Hindi, and French.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nThe White House and other supporters of PresidentDonald Trumpresponded on Thursday after formerFBIDirectorJames Comeyposted—and then deleted—a photo onInstagramshowing an alignment of seashells in formation to spell out \"8647.\"\n\nTrump's staunch allies, including eldest son Donald Trump Jr., Georgia RepresentativeMarjorie Taylor Greene, former White House adviserKellyanne Conway, Tennessee SenatorMarsha Blackburnand several Cabinet officials said the photo appeared to be calling for Trump to be assassinated.\n\nThe Merriam-Webster dictionary, which the Associated Press follows, defines \"86\" as a slang term meaning \"to throw out,\" \"to get rid of\" or \"to refuse service to.\"\n\nThe dictionary also notes: \"Among the most recent senses adopted is a logical extension of the previous ones, with the meaning of 'to kill.' We do not enter this sense, due to its relative recency and sparseness of use.\"\n\nIn the mafia, the term \"86\" refers to taking someone \"eight miles out of town\" and putting them \"six feet under.\"\n\nThe White House responded to Comey's post shortly after it went online, with Deputy Chief of Staff Taylor Budowich writing on X, formerly Twitter: \"While President Trump is currently on an international trip to the Middle East, the former FBI Director puts out what can clearly be interpreted as 'a hit' on the sitting President of the United States—a message etched in the sand.\"\n\nBudowich added: \"It's worth noting this assassination threat follows President Trump [sic] historic Saudi speech where he declared the demise of the neocons and nation builders.\"\n\nHe continued: \"American leadership has been restored and peace is on the horizon. This has left the Deep State desperate and dangerous—Comey is only the latest and most disturbing example of them lashing out through threats of violence.Democratsmust condemn these threats, not stoke them. We will remain vigilant and unafraid. This is deeply concerning to all of us and is being taken seriously.\"\n\nComey posted a statement on Instagram after deleting his original post, saying he thought the seashell formation was a \"political message,\" meaning that they were calling for Trump to be removed from office, rather than assassinated.\n\n\"I didn't realize some folks associate those numbers with violence,\" the former FBI director added. \"It never occurred to me but I oppose violence of any kind so I took the post down.\"\n\nTrump and Comey had a tumultuous relationship, even before Trump first took office in 2017.\n\nComey, as FBI director, landed in Trump's crosshairs over his role in informing Trump of the existence of a so-called \"dossier\"—commissioned by a law firm linked to the Democratic Party—purporting to detail the Trump 2016 campaign's ties to Russian government officials and other Russian entities.\n\nComey also infuriated the president when he publicly confirmed that the FBI was investigating Russia's interference in the 2016 U.S. election and whether any Trump campaign officials aided in the Kremlin's efforts to influence the race in Trump's favor.\n\nTrump's testy relationship with Comey culminated in the president firing the FBI director in May 2017. The ousting later became a central thread in special counselRobert Mueller's Russia probe.\n\nAfter he was fired, Comey testified toCongressthat Trump attempted to influence the FBI's investigation, despite the bureau's design to operate independently. He also publicly criticized Trump, comparing him to a mob boss and accusing him of violating democratic norms and the rule of law.\n\nTrump's eldest son, Donald Trump Jr., wrote on X:\"Just James Comey causally [sic] calling for my dad to be murdered. This is who the Dem-Media worships. Demented!!!!\"\n\nMeghan McCain, daughter of the late Republican Senator John McCain, posted on X:\"Don't know how this can be interpreted as any other way but a threat against President Trump. James Comey should at the very least get a visit from the secret service. Also is everyone mentally ill?\"\n\nSecretary of Homeland Security Kristi Noem wrote on X:\"Disgraced former FBI Director James Comey just called for the assassination of@POTUSTrump. DHS and Secret Service is investigating this threat and will respond appropriately.\"\n\nThe X account \"Republicans Against Trump\" posted:\"The same people outraged over Comey's weird post were totally fine with Trump sharing a video showing an image of Biden tied up in the back of a pickup truck. The hypocrisy couldn't be more obvious.\"\n\nThe Bulwark's media reporter Will Sommer wrote on X:\"James Comey's mistake was not recognizing that, a few months ago, MAGA personalities collectively decided to pretend that '86' means 'assassinate' and not 'get rid of' in a broad sense.\"\n\nDirector of National Intelligence Tulsi Gabbard said, in part, of Comey's post on Fox News:\"James Comey, in my view, should be held accountable and put behind bars for this.\"\n\nA U.S. Secret Service spokesperson toldNewsweekin a statement: \"The Secret Service vigorously investigates anything that can be taken as a potential threat against our protectees. We take this responsibility very seriously and we are aware of the social media posts in question. Beyond that, we do not comment on protective intelligence matters.\"\n\nUpdate 5/15/25, 9:38 p.m. ET: This article has been updated with additional information and context.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nSonam Sheth is an Evening Politics Editor at Newsweek who is based in New York. She joined Newsweek in 2024 and previously worked at Business Insider and CNBC. Sonam has extensive experience coveringnational security, foreign policy,elections, andstoriesat theintersection of law and politics. Her work has been cited in The Washington Post, The Atlantic, Vanity Fair, and others. She has also frequently appeared on national television and radio, including MSNBC, NBC News, BBC World News, BBC News radio, and more. You can get in touch with Sonam at s.sheth@newsweek.com. Languages: English, Hindi, and French.\n\nSonam Sheth is an Evening Politics Editor at Newsweek who is based in New York. She joined Newsweek in 2024 and previously worked at Business Insider and CNBC. Sonam has extensive experience coveringnational security, foreign policy,elections, andstoriesat theintersection of law and politics. Her work has been cited in The Washington Post, The Atlantic, Vanity Fair, and others. She has also frequently appeared on national television and radio, including MSNBC, NBC News, BBC World News, BBC News radio, and more. You can get in touch with Sonam at s.sheth@newsweek.com. Languages: English, Hindi, and French.\n\nSonam Sheth is an Evening Politics Editor at Newsweek who is based in New York. She joined Newsweek in 2024                                    ...Read more",
        "source_3": "Former Trump counselor Kellyanne Conway calls out James Comey's '86 47' post on social media as the Secret Service investigates the alleged threat on 'Jesse Watters Primetime.'\n\nThe Secret Service is investigating afterex-FBI Director James Comeyposted an Instagram photo of seashells arranged to show the numbers \"86 47,\" a message White House officials swiftly condemned as an attempt to put out a \"hit\" against the 47th president.\n\nComey later deleted the post after online backlash from government officials, lawmakers and PresidentDonald Trump’sson. Trump has faced two assassination attempts in the past year, one of which resulted in him being shot and a bystander being killed.\n\nThe post including the alleged \"hit\" showed the numbers in question etched into the sand at a beach using seashells. \"Cool shell formation on my beach walk…,\" Comey captioned the post Thursday.\n\nWhile to some people the numbers may appear innocuous, \"86\" is frequently used as a call sign for murdering or getting rid of someone, while \"47\" has been interpreted as denoting the 47th president of the United States.\n\nHOUSE REPUBLICANS MULL CONSEQUENCES FOR DEMS WHO 'STORMED' ICE FACILITY\n\nFormer FBI Director James Comey and President Donald Trump(AP)\n\nAfter backlash on social media over the post, including from at least one lawmaker who called for Comey to be arrested, the ex-FBI chief deleted the Instagram post and posted a message addressing it.\n\n\"I posted earlier a picture of some shells I saw today on a beach walk, which I assumed were a political message,\" the subsequent post from Comey said. \"I didn't realize some folks associate those numbers with violence. It never occurred to me but I oppose violence of any kind so I took the post down.\"\n\nShortly after Comey removed the post, Fox News Digital learned from a source in the Secret Service that the agency was aware of the matter and will be sending agents to investigate and interview Comey.\n\nWHITE HOUSE RIPS HOUSE DEMS TRYING TO HIJACK TRUMP'S GULF OF AMERICA PLANS\n\nThe FBI, where Comey used to work before he was fired by Trump during his first term, had no comment on the matter, but it was also apparent that people at the top levels of the agency were aware of the post.\n\nTrump's new FBI director,Kash Patel,acknowledged on X that agency personnel were \"aware\" of Comey's post in his own statement shared on X.\n\n\"We are in communication with the Secret Service and Director Curran,\" Patel said. \"Primary jurisdiction is with SS on these matters and we, the FBI, will provide all necessary support.\"\n\nFormer FBI Director James Comey speaks onstage with MSNBC's Nicolle Wallace May 30, 2023, in New York City.(Dia Dipasupil/Getty Images)\n\nThe ex-FBI chief's social media slip-up hearkens back to an incident in February 2020 involving comedian and actor John Mulaney. During an opening monologue on Saturday Night Live, Mulaney made a joke referencing Trump and the assassination of Roman dictator Julius Ceasar, prompting an investigation by the FBI.\n\n\"Another thing that happened under Julius Caesar, he was such a powerful maniac that all the senators grabbed knives, and they stabbed him to death. That would be an interesting thing if we brought that back now,\" Mulaney said, in part, to laughter from the live SNL audience.\n\nIn response to Comey's post, the White House swiftly condemned Comey's actions, and White House deputy chief of staff and Cabinet Secretary Taylor Budowich called the move \"deeply concerning.\"\n\n\"While President Trump is currently on an international trip to the Middle East, the former FBI Director puts out what can clearly be interpreted as ‘a hit’ on the sitting President of the United States — a message etched in the sand,\" Budowich wrote on X. \"This is deeply concerning to all of us and is being taken seriously.\"\n\nRep. Tim Burchett, R-Tenn., who was endorsed by Trump in 2024, went a step further and called for Comey to be arrested for his controversial post.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}