{
    "question": "How might the reported discovery of Trump–Russia probe documents in FBI “burn bags” and the potential declassification of the Durham report’s annex affect public trust, transparency expectations, and accountability around the origins of the investigation?",
    "content": {
        "source_1": "Donald Trump says that Democrats “love” talking about Epstein—but it’s the president who can’t seem to stop bringing up his old party pal, even when his cronies are desperately trying to buy him some cover.\n\nSources toldFox News DigitalWednesday that FBI Director Kash Patel had discovered multiple burn bags filled with sensitive documents stashed away in a secret room at the agency. During a press conference later that day, Trump was asked to give a statement about Patel’s far-fetched attempt to distract from the president’s ties to the alleged sex trafficker—but he couldn’t help but bring up Epstein anyway.\n\n“Well, I want everything to be shown. You know, as long as it’s fair and reasonable I think it will be shown and it should be shown, and I think [Patel] feels that way, and I think Pam feels that way,” Trumpsaid. But his comments echoed hisprevious statementsabout releasing any “credible” information from the Epstein files. Clearly, the president wasn’t all that interested in talking about Patel’s supposed bombshell.\n\n“But it’s gotta be stuff that really doesn’t hurt people unfairly, because you have so many people involved. And if they can do that in a fair way, I think it’s great. I think it’s really great. The whole thing is a scam,” Trump rambled. “It’s a scam set up by the Democrats and they love talking about it.”\n\nBut it seems that Trump is the one who loves talking about Epstein, as he took off on a winding rant that had absolutely nothing to do with what he’d actually been asked about.\n\n“I would like to see people exposed that might be bad, and we’ll see how that all works out, but it’s getting to be very old news. You know, if they had anything they would’ve done it the week before the election, because they were losing by a lot,” Trump continued. “If they had anything they would have done it. They controlled the file. The Democrats controlled it. Comey, and all the sleazebags, every one of them that you read about all the time.”\n\nTrump on RussiaGate Burn Bags: It's a scam set up by the Democrats and they love talking about it. But I would like to see people exposed that might be bad and we'll see how that all works out. But it's getting to be very old news… They controlled the file. The Democrats…pic.twitter.com/05Kl5fkBlc\n\nTrump’s defensiveness aside, one of the documents supposedly contained within the mysterious burn bags was the classified annex to former special counsel John Durham’s2023 reporton the FBI’s investigations into Russian interference with the 2016 presidential campaigns. This all just happens to be the very same subject of the Trump administration’s attempts to draw attention away from its sudden refusal to release more information from the government’s files on Epstein.\n\nDurham’s report already resulted in criminal charges against only three people, and at trial, the special counsellost two of those cases, with the third defendant pleading guilty to altering an email used to support a surveillance application. So the notion that this mysterious annex will unveil a vast conspiracy is severely unlikely, as the FBI’s conduct has already been litigated. Still, the Trump administration is currently working to declassify the annex and then share it with Senate Judiciary Committee Chairman Chuck Grassley, according to Fox News Digital.\n\nEarlier this month, Trump was asked byJust the Newswhether he would be open to declassifying Durham’s annex. “I would declassify it, yeah. Why not?” Trump said. “I would absolutely declassify it.”\n\nSenate Democrats are pulling out a rare stop in hopes of compelling the Justice Department and Federal Bureau of Investigation to release all documents related to notorious late pedophile Jeffrey Epstein.\n\nOn Wednesday, Democratic Senator Chuck Schumer announced that he and the seven Democraticmembersof the Senate Committee on Homeland Security and Government Affairs are demanding the files, citing “a century-old and little-known” statute known as the “rule of five.”\n\nUnder therule, executive agencies are, upon the request of five members of the Homeland Security Committee, required to submit “any information requested of it relating to any matter within the jurisdiction of the committee.”\n\n“When any five senators on the Homeland Security Committee call on the executive branch, the executive branch must comply,” Schumer explained.\n\nThe Senate Democrats’ request includes all DOJ and FBI “documents, files, evidence, and other materials” related to the caseUnited States v. Jeffrey Epstein.\n\n“It’s not a stunt, it’s not symbolic,” Schumer said. “It’s a formal exercise of congressional power under federal law.”\n\n“We are using very unique statutory authority that is granted only to our committee,” said the committee’s ranking member, Gary Peters, who emphasized that the request covers documents that Attorney General Pam Bondi and FBI Director Kash Patel “have publicly already confirmed they have in their possession.”\n\nThe Senate Democrats expect an answer by August 15.\n\nThe announcement comes as the Trump administration scandalously fails to fulfill a campaign promise to release the files, which reportedlymentionTrump repeatedly.\n\nThe House is currently on what Schumer has dubbed an “Epstein recess,” as Speaker Mike Johnson called off the legislative session early after Democrats forced the Epstein issue in vote after vote.\n\nMeanwhile, the president’s allies seem to see convicted Epstein accomplice Ghislaine Maxwell as presenting a path out of the mire.\n\nTrump’s deputy attorney general has met with Maxwell twice behind closed doors, and the House Oversight Committee plans to depose her on August 11. But Maxwell’s attorneysaidshe will refuse to testify unless she is either granted certain concessions or receives clemency from Trump. The president, for his part, has refused to publicly rule out granting such a request and has insisted repeatedly that he is “allowed” to pardon her.\n\nThe Federal Reserve on Wednesday announced it will not lower interest rates, refusing once again to obey President Trump’s persistent demands to do so.\n\nIn explaining the decision, Fed Chair Jerome Powell pointed to Trump’s tariffs and their impact on the economy.\n\n“Increased tariffs are pushing up prices in some categories of goods,” hesaid. “Near-term measures of inflation expectations have moved up on balance over the course of this year on news about tariffs.”\n\nThe decision is sure to upset the president, who has long called on the Fed to lower interest rates.\n\n“We have a man who just refuses to lower the Fed rate,” Trumpsaidlast month, in one of his many attacks on Powell, a constant nemesis of his. “Maybe I should go to the Fed. Am I allowed to appoint myself? I’d do a much better job than these people.”\n\nTrump has spent five straight meetings demanding interest rates be lowered, which suggests some insecurity about the future state of the economy on his part, especially as economists wait for the full scope of his trade war to reveal itself.\n\nTwo Trump-appointed Fed governors, Michelle Bowman and Christopher Waller, dissented from Powell’s decision on Wednesday, likely attempting to remain in the president’s good graces in the chance that he fires Powell, something he has alluded to countless times now.\n\nThe Fed lending rate will stay within the 4.25 percent to 4.5 percent range.\n\nThe Trump administration is working toward privatizing Social Security.\n\nSpeaking withBreitbartat the far-right media company’s policy event Wednesday, Treasury Secretary Scott Bessent referred to the “big, beautiful bill’s” “Trump accounts” as a “backdoor” for privatizing the public program.\n\nAs a stipulation of Trump’s tax bill, the U.S. government would deposit $1,000 in so-called “Trump accounts” for Americans born between 2025 and 2028. The investment, according to Bessent, would dually serve as a way to prevent young people from getting “disillusioned with the system” and voting for the likes of New York City Democratic mayoral candidate Zohran Mamdani, and a way to slyly privatize Social Security.\n\n“So when you do this, you make everyone a shareholder. You make everyone a stakeholder. People who are part of the system do not want to bring down the system,” Bessentsaid.\n\nBessent then shared an anecdote about being asked to help manage a construction worker’s hypothetical lottery winnings, to which he claimed that the “best thing you can do is save that $20.”\n\n“Now, with these accounts, they can be part of the system. What if they had put that money in the S&P? Or in Bitcoin? Or in anything? So, we’re making people part of the system, we’re increasing financial literacy,” Bessent said. “I think that at Treasury, we are going to push, with these accounts, that if you have the account we want you to learn about it and understand it.\n\n“In a way, it is a backdoor for privatizing Social Security,” he continued. “Social Security is a defined benefit plan paid out to the extent that if, all of a sudden, these accounts grow and you have in the hundreds of thousands of dollars for your retirement, then that’s a game changer, too.”\n\nTrump's Treasury Secretary says the Trump Accounts created by the budget bill are a \"backdoor for privatizing Social Security\"pic.twitter.com/1jpKHUtP85\n\nCongressional Republicans pushed through Trump’s tax plan earlier this month without any Democratic support. The law is not expected to save the government any money, as Trump had initially promised. Instead, Trump’s key legislative victory—which will slice taxes on the ultrawealthy and corporations while gutting social programs such as Medicaid—is expected to add upward of $6 trillion to the debt, according to aprojectionfrom the Cato Institute, a libertarian think tank.\n\nConservative lawmakers are fighting tooth and nail to retain their right to trade stocks while in office.\n\nThe caucus turned out in staunch opposition Wednesday to Republican Senator Josh Hawley’s proposed stock trading ban, causing a significant stir in the upper chamber after the White House flagged the bill as a bad idea.\n\nIn order to gain Democratic support and advance the motion through the Senate Committee on Homeland Security and Governmental Affairs, Hawley agreed to include text within the bill that would additionally subject Donald Trump and Vice President JD Vance to the parameters of the ban, just as members of Congress would be. But the White House’s Office of Legislative Affairs, and the executive branch’s Senate allies, were not in favor.\n\nSenator Ron Johnsontorchedthe effort as “legislative demagoguery,” claiming Wednesday that banning lawmakers and their spouses from trading stocks would “make it very unattractive for people to run for office.”\n\n“I have no idea what we’re voting for,”saidSenator Bernie Moreno. “I have not read the mountains of paper that are sitting in front of me.”\n\nAt one point, Senator Rick Scottcondemnedthe effort as “disgusting,” accusing Hawley of denigrating billionaires. But Hawley, seated next to Scott, had a firm response.\n\n“I don’t mind anyone being rich, I mind people getting rich while they’re here and trading stocks,” the Missouri senator said.\n\nCommittee Chair Rand Paul similarly opposed the bill, positing that any such ban would have made it impossible for Trump to be president. The Kentucky lawmaker admitted that he had scheduled a vote on the bill in a quiet quid pro quo: “To get two bills that I want passed through without being beleaguered by amendments,” he said in an interview withAxios.\n\nThe White House, meanwhile, argued that its opposition to Hawley’s bill had little to do with its contents.\n\n“This was a last-minute deal struck to include the Executive Branch equities without touching base with the White House to discuss potential Article II concerns,” a White House official toldAxios. “Any pause comes purely from potential Article II infringement, not the Congressional ban.”\n\nThe president, however, attacked Hawley personally hours later, claiming that the senator’s decision to “block” a review of Representative Nancy Pelosi’s stock trading was “sabotage.”\n\nHawley had introduced the original bill in 2023 after Pelosi’s husband came under increased scrutiny for his extensive trading practices, though the accusations festered without any evidence of insider trading. By the end of the day, the committee had voted 8-7 to advance the bill, with all Republicans except Hawley voting against it.\n\n“The Democrats, because of our tremendous ACHIEVEMENTS and SUCCESS, have been trying to ‘Target’ me for a long period of time, and they’re using Josh Hawley, who I got elected TWICE, as a pawn to help them,” Trumpwroteon Truth Social. “I wonder why Hawley would pass a Bill that Nancy Pelosi is in absolute love with—He is playing right into the dirty hands of the Democrats. It’s a great Bill for her, and her ‘husband,’ but so bad for our Country!”\n\n“I don’t think real Republicans want to see their President, who has had unprecedented success, TARGETED, because of the ‘whims’ of a second-tier Senator named Josh Hawley!” Trump added.\n\nSince Donald Trump entered the White House, the supposedly hardline fiscal conservatives of the House Freedom Caucus appear to have softened that line to a malleable putty—and everyone on Capitol Hill knows it.\n\nThe Bulwarkreported Wednesday that as members of the HFC left for summer break, they were “all over the place” following a series of toothless concessions to the president’s sweeping spending agenda. Now, the House Freedom Caucus has even earned a new nickname among reporters and lawmakers: the House Folding Caucus.\n\nAlthough they hadinitially criticizedthe Senate’s version of Trump’s behemoth budget bill at the beginning of July, HFC members ultimately fell in line to support the president’s bill that wouldexplode the national deficit by trillions of dollars. A few weeks later, they momentarily stalled Trump’s GENIUS Act, arguing that the cryptobill went against anexecutive orderbanning central bank currency. But once again,they concededto the president’s demands after the GOP leadership promised to tie the ban into the Pentagon’s policy bill later this year.\n\nHFC Chairman Andy Harris said that the group should start working on a one-year continuing resolution that would allow them to freeze federal funding, but the group’s position remains unclear. Four members are currently staging their exits from Congress, with Representatives Ralph Norman, Byron Donalds, and Andy Biggs all preparing gubernatorial campaigns in their respective states, and Representative Mike Collins launching a Senate bid in his state.\n\nWith a president who just does whatever he wants regardless of what Congress thinks, a far-right attack dog is no longer required—and has been left neutered and freezing in the doghouse.\n\nTexas Republicans are moving forward with their gerrymandering plan that will essentially create new pro-Trump districts in a state that already has an overwhelming GOP majority.\n\nThe new map, revealed Wednesday, will create five new GOP-skewed districts, which could very well help Republicans grow their majority in the House in 2026. The map puts districts currently held by Democratic Representatives Henry Cuellar and Vicente Gonzalez at risk of becoming more red, while isolating blue districts to create even more Republican-leaning ones.\n\nThe map’s new districts will contain three regions that Trump carried by 10 to 15 percentage points last election, shamelessly rigging the game to seize power in a thinly divided Congress. It will also create six districts without incumbents—making 2026 an even more critical race.\n\nHouse Minority Leader Hakeem Jeffries is reportedly headed to Texas on Wednesday for a sit-down with Democratic leaders, while the map is set for final approval in a committee hearing on Friday.\n\nOn Wednesday, Senator Chuck Grassley of Iowasaidhe was “offended” by Donald Trump’s “personal attacks,” as the president wages war on the Senate’s “blue slip” tradition.\n\nTraditionally, when the president nominates someone for a federal judgeship, the Senate Judiciary Committee chair (currently Grassley) sends so-called blue slips to the nominee’s home-state senators. If both return the slips, the nomination proceeds; if at least one holds off, it’s effectively vetoed.\n\nIn giving the minority party significant influence over the confirmation process, the tradition restricts Trump’s ongoing effort to mold the judiciary in his image. The president has thus been applying pressure on Grassley to abandon it.\n\nOn Tuesday evening, Trump said, in aTruth Social post, that the tradition is a “probably Unconstitutional” “hoax” and “SCAM” that would force him to appoint Democratic or “weak” Republicans rather than “Highly Qualified” (read: MAGA) judges.\n\nHe urged Grassley to find the “Courage” to abandon the tradition “IMMEDIATELY,” so as to “not let the Democrats laugh at him and the Republican Party for being weak and ineffective.” The president also made a point to take full credit for Grassley’s 2022 reelection to the Senate “when he was down, by a lot,” Trump said.\n\nThe president also shared a number of other users’ posts opposing blue slips, some of which took pot shots at Grassley.Onecalled Grassley a “sneaky” “RINO,” short for Republican in name only.Oneaccused the senator of “standing in the way” of Trump’s agenda.Anotherpost shared by Trump suggested that certain elected officials, including Grassley, have been in office too long and ought to be “dethrone[d]” via term limits.\n\nOn Tuesday night, Grassleyindicatedthat he would not do away with the tradition. The senator thenhit backat Trump during his opening remarks at a Wednesday Senate Judiciary hearing.\n\n“Last night, I was surprised to see President Trump on Truth Social go after me and Senate Republicans over what we call the ‘blue slip,’” Grassley said, before giving a brief explanation of the tradition for “people in the Real America” rather than the “island surrounded by reality” that is Washington, D.C.\n\n“I was offended by what the president said, and I’m disappointed that it would result in personal insults,” Grassley continued.\n\nPoliticoreportsthat Grassley’s decision to hold firm has the support of party leaders on both sides of the aisle.\n\nEnvironmental Protection Agency Administrator Lee Zeldin has decided to pretend that the health risks caused by greenhouse gases don’t exist—but the Fox News chyron beneath him told a different story.\n\n“EPA is proposing to rescind the 2009 Obama EPA Endangerment Finding to eliminate all of the greenhouse gas emissions regulations that followed,” Zeldinsaidduring an interview on Fox News Tuesday, “including electric vehicle mandates, which amounts to a trillion dollars’ worth of savings.”\n\nIn December 2009, the EPApublishedan Endangerment Finding that stated that the current and projected concentrations of greenhouse gases in the atmosphere “threaten the public health and welfare of current and future generations.” Greenhouse gases trap outgoing infrared heat within the Earth’s atmosphere, resulting in global warming.\n\nJust a few months ago, Zeldincouldn’t even saywhether carbon was a pollutant (spoiler alert, it is). Now he is primed to remove the finding that set the standard for multiple industries to limit their greenhouse gas emissions.\n\nBut as independent journalist Aaron Ruparpointed outon X, Zeldin’s announcement was rendered immediately ridiculous by the chyron just beneath him.\n\nAs the anti-science flunkie in charge of the EPA happily announced his plan to strip greenhouse gas regulations, an “Extreme Heat” warning appeared in the bottom right corner. The chyron below him displayed the “Hottest Temps Now” from different cities across the country: 102 degrees in Arizona; 100 degrees in Florida; 100 degrees in Georgia; 99 degrees in California.\n\nZeldin: \"EPA is proposing to rescind the 2009 Obama EPA endangerment finding to eliminate all of the greenhouse gas emissions regulations that followed.\"pic.twitter.com/2e3nSltX0o\n\nThis week, arecord-breaking heat wavestruck the eastern United States, with excessive heat advisories being issued everywhere fromFloridatoNew York. Over the last decade, heat-related deaths havedoubledin the U.S.\n\nThe Obama-era Endangerment Finding that Zeldin would like to repeal directly linked greenhouse gas emissions to widespread changes in extreme temperatures around the world—adding that rising temperatures would likely turn deadly.\n\n“The impact on mortality and morbidity associated with increases in average temperatures, which increase the likelihood of heat waves, also provides support for a public health endangerment finding,” the report stated, noting that “heat is already the leading cause of weather related deaths in the United States.”\n\nThe Trump administration just dashed any chance of a new trade deal with India, imposing a 25 percent tariff on the country Wednesday along with a penalty for buying military equipment and energy from Russia.\n\nThe world’s most populous nation has held off on offering new concessions to the U.S., announcing on Tuesday that it was prepared to accept tariffs as high as 25 percent on its exports to American consumers.\n\nBut with just two days on the clock to finalize the deal, it doesn’t seem that Donald Trump has a firm handle on India’s jaded approach to the negotiations.\n\n“WE HAVE A MASSIVE TRADE DEFICIT WITH INDIA!!!” heexclaimedon Truth Social Wednesday.\n\nThe U.S. imports more goods and services from India than it sells. In 2024, the country’s trade deficit with India was $45.7 billion—a 5.4 percent increase over the prior year, according to theOffice of the U.S. Trade Representative.\n\n“Remember, while India is our friend, we have, over the years, done relatively little business with them because their Tariffs are far too high, among the highest in the World, and they have the most strenuous and obnoxious non-monetary Trade Barriers of any Country,” Trump wrote in an earlierpost.\n\n“Also, they have always bought a vast majority of their military equipment from Russia, and are Russia’s largest buyer of ENERGY, along with China, at a time when everyone wants Russia to STOP THE KILLING IN UKRAINE—ALL THINGS NOT GOOD!” he continued. “INDIA WILL THEREFORE BE PAYING A TARIFF OF 25 PERCENT, PLUS A PENALTY FOR THE ABOVE, STARTING ON AUGUST FIRST. THANK YOU FOR YOUR ATTENTION TO THIS MATTER. MAGA!”\n\nHistorically, it takes U.S. officials roughly18 monthsto negotiate a new trade agreement with another country. That boils down to exhaustive reviews of the country’s prior trade, sorting through thousands of line items of products, and analyzing the complex minutiae of local import and export laws.\n\nDespite the fact that India was one of the first countries to open up new trade negotiations with the U.S. in February, even Trump administration officials have acknowledged that the deal with India is still half-baked. U.S. Trade Representative Jamieson Greer toldCNBCMonday that India has “strong interest in opening portions of its market” to U.S. products but that the talks require more time. Last week, India’s Trade Minister Piyush Goyal toldReutersthat India was making “great progress” with the Trump administration.\n\nBut blowing past traditional expectations in favor of baseless projections has not proven to be a strong success strategy for the second Trump administration. Instead, choosing to throw the country into a trading blitz with dozens of its biggest trading partners has effectively forced the U.S. into a regrettable losing position, with American officials constantly having to hedge on what were supposed to be adamant deadlines.\n\nIf Trump is to be believed, however, then Friday could be the exception.\n\n“THE AUGUST FIRST DEADLINE IS THE AUGUST FIRST DEADLINE—IT STANDS STRONG, AND WILL NOT BE EXTENDED,” Trumpwroteearlier on Wednesday. “A BIG DAY FOR AMERICA!!!”\n\nIndia isn’t the only country holding out on U.S. trade negotiations. China, Mexico, Canada, South Korea, Taiwan, Brazil, Switzerland, and Thailand have also not finalized their arrangements with the Trump administration, though not all of them face the August 1 cutoff.",
        "source_2": "Thousands of sensitive documents tied to the Trump–Russia investigation were allegedly found in FBI “burn bags,” according to Fox News.\n\nA classified annex to the Durham report reportedly contains intelligence suggesting the FBI planned to amplify collusion claims before launching its probe.\n\nSen. Chuck Grassley is reviewing the documents, and Trump has called the matter “a scam set up by Democrats.”\n\nFBI Director Kash Patel allegedly found thousands of sensitive documents pertaining to the origins of the Trump–Russia investigation,Fox News reported. The documents were hidden in “burn bags” located in a secret room inside the FBI. According to unnamed sources who spoke to Fox News Digital, the “burn bag” system is a method the government uses to destroy sensitive or classified documents.\n\nFBI officials discovered a classified annex to Special Counsel John Durham’s final report, which contains the raw intelligence and source material that Durham reviewed during his investigation.\n\nDownload the SAN app today to stay up-to-date with Unbiased. Straight Facts™.\n\nTop-level officials from U.S. intelligence, legal and defense communities are jointly deciding how and when to release the annex. The document will be reviewed by Sen. Chuck Grassley, R-Iowa, chairman of the Senate Judiciary Committee, who will then make it publicly available.\n\nSome people with access to the classified annex gave exclusive information to Fox News Digital, saying U.S. intelligence reportedly had credible foreign sources warning that the FBI would help spread theTrump–Russia collusionstory before the agency officially launched its Crossfire Hurricane investigation.\n\n“Ultimately, the release of the classified annex will lend more credibility to the assertion that there was a coordinated plan inside the U.S. government to help the Clinton campaign stir up controversy connecting Trump to Russia,” the anonymous source told Fox News.\n\nReporters asked Trump about the thousands of documents supposedly found in “burn bags” at the FBI during a news conference Wednesday, July 30. In response, Trump said he wants all the files to be “shown” and called it “a scam set up by Democrats.”\n\n“I would like to see people exposed who might be bad and we’ll see how that all works out but it’s getting to be very old news,” Trump said.\n\nGrassley’s team is currently examining the documents as part of their ongoing investigation, Fox News reports.\n\nFBI DIRECTOR KASH PATEL ALLEGEDLY FOUND THOUSANDS OF SENSITIVE DOCUMENTS PERTAINING TO THE ORIGINS OF THE TRUMP–RUSSIA INVESTIGATION, FOX NEWS REPORTS. THE DOCUMENTS WERE HIDDEN IN “BURN BAGS” LOCATED IN A SECRET ROOM INSIDE THE FBI.\n\nACCORDING TO UNNAMED SOURCES WHO SPOKE TO FOX NEWS DIGITAL, THE “BURN BAG” SYSTEM IS A METHOD THE GOVERNMENT USES TO DESTROY SENSITIVE OR CLASSIFIED DOCUMENTS.\n\nFBI OFFICIALS DISCOVERED A CLASSIFIED ANNEX TO SPECIAL COUNSEL JOHN DURHAM’S FINAL TRUMP-RUSSIA REPORT WHICH CONTAINS THE RAW INTELLIGENCE AND SOURCE MATERIAL THAT DURHAM REVIEWED DURING HIS INVESTIGATION.\n\nTOP-LEVEL OFFICIALS FROM U.S. INTELLIGENCE, LEGAL, AND DEFENSE COMMUNITIES ARE JOINTLY DECIDING HOW AND WHEN TO RELEASE THE ANNEX. THE DOCUMENT WILL BE REVIEWED BY SENATOR CHUCK GRASSLEY – CHAIRMAN OF THE SENATE JUDICIARY COMMITTEE, WHO WILL THEN MAKE IT PUBLICLY AVAILABLE.\n\nSOME PEOPLE WITH ACCESS TO THE CLASSIFIED ANNEX GAVE EXCLUSIVE INFORMATION TO FOX NEWS DIGITAL SAYING U.S. INTELLIGENCE REPORTEDLY HAD CREDIBLE FOREIGN SOURCES WARNING THE FBI WOULD HELP SPREAD THE TRUMP–RUSSIA COLLUSION STORY BEFORE THE AGENCY OFFICIALLY LAUNCHED ITS CROSSFIRE-HURRICANE INVESTIGATION.\n\n“ULTIMATELY, THE RELEASE OF THE CLASSIFIED ANNEX WILL LEND MORE CREDIBILITY TO THE ASSERTION THAT THERE WAS A COORDINATED PLAN INSIDE THE U.S. GOVERNMENT TO HELP THE CLINTON CAMPAIGN STIR UP CONTROVERSY CONNECTING TRUMP TO RUSSIA,”THE ANONYMOUS SOURCE TOLD FOX NEWS.\n\nPRESIDENT TRUMP WAS ASKED BY REPORTERS ABOUT THE THOUSANDS OF DOCUMENTS SUPPOSEDLY FOUND IN BURN BAGS AT THE FBI DURING A NEWS CONFERENCE WEDNESDAY. IN RESPONSE, TRUMP SAID HE WANTS ALL THE FILES TO BE “SHOWN” AND CALLED IT “A SCAM SET UP BY DEMOCRATS.”\n\nSENATOR GRASSLEY’S TEAM IS CURRENTLY EXAMINING THE DOCUMENTS AS PART OF THEIR ONGOING INVESTIGATION, FOX NEWS REPORTS.\n\nQuestions about the handling of sensitive government documents and the origins of the Trump–Russia investigation may affect public trust in federal agencies and ongoing political discourse.\n\nThe alleged discovery of thousands of sensitive documents in 'burn bags' raises concerns about transparency and established procedures for managing classified information within government agencies.\n\nAllegations regarding the origins of the Trump–Russia probe and potential coordination inside government agencies highlight ongoing scrutiny of politically charged investigations and their possible influence on public perceptions.\n\nPlans to review and potentially release a classified annex related to the Durham report underscore debates over what government information should be made public to ensure accountability while protecting national security.\n\nSynthesized coverage insights across26media outlets\n\nThe controversy over the Trump–Russia investigation originated with the FBI’s 2016 probe known as Crossfire Hurricane, leading to years of partisan disputes about alleged collusion and subsequent claims that parts of the investigation were politically motivated or potentially fabricated.\n\nThe Trump–Russia probe's international significance stems from its connections to alleged Russian interference in US elections, a recurring theme affecting US-Russia relations and used by both governments in diplomatic critiques.\n\nThe story could influence ongoing debates on transparency, the handling of classified material and the oversight of intelligence agencies, but specific new policy actions have not been detailed in the articles reviewed.\n\n'A man named Burn Bag?' Mockery abounds over Trump's bizarre remark\n\nFox News: Thousands of Documents Were Found in the Fbi Building to Investigate Trump's Links with Russia, and They Were in a Secret Room in a Burning Bag.\n\nTrump Torpedoes Kash Patel’s Attempt to Distract From Epstein\n\nTrump Whiffs on Softball Russiagate ‘Burn Bag’ Question, Confuses it With Epstein Case\n\n'Secret room' in FBI contains 'burn bags' with sensitive Trump-Russia probe docs: report\n\nFBI chief Kash Patel finds ‘burn bags’ of Trump-Russia documents in secret room\n\nFBI chief Kash Patel finds ‘burn bags’ of Trump-Russia documents in secret room\n\nPatel found 'burn bags' filled with classified docs related to Trump–Russia probe: report\n\n'Secret room' in FBI contains 'burn bags' with sensitive Trump-Russia probe docs: report\n\n'Secret room' in FBI contains 'burn bags' with sensitive Trump-Russia probe docs: report\n\n'Secret room' in FBI contains 'burn bags' with sensitive Trump-Russia probe docs: report\n\nPatel found 'burn bags' filled with classified docs related to Trump–Russia probe: report\n\nPatel found 'burn bags' filled with classified docs related to Trump–Russia probe: report\n\nREPORT: Kash Patel Discovered Thousands Of Russiagate Docs In 'Burn Bags'\n\nReport: Patel discovered ‘burn bags’ with thousands of sensitive documents relating to Russian collusion hoax in ‘secret room’\n\nEvidence in 'burn bags': DNI Tulsi Gabbard gives Glenn Beck IC update in exclusive interview\n\nKash Patel Finds Comey's Secret Room at FBI Containing 'Burn Bags' Full of Trump-Russia Probe Documents\n\nKash Patel finds thousands of Russiagate docs in ‘BURN BAGS’ at FBI: report\n\nThousands Of Russia Hoax Documents Found At FBI Secret Room In Burn Bags\n\nHere's What Was Found Inside Those FBI Burn Bags. Yes, It's About the Russian Collusion Hoax\n\nPatel Finds Important Documents About the Russiagate Inside 'Burn Bags' in a Secret Fbi Room\n\nPatel found thousands of sensitive Trump–Russia probe docs inside 'burn bags' in secret room at FBI\n\nBREAKING: Kash Patel Finds Thousands of Russia Hoax Documents in \"Burn Bags\" in Secret Room – Including Classified Annex to Durham Report\n\nFBI’s ‘Burn Bag Bonanza’ Exposes Russiagate’s Juiciest Cover-Up Yet—Enjoy the Show\n\n'Conspiracy getting even DEEPER': Kash Patel finds thousands of Russiagate docs inside 'burn bags' in secret room at FBI * WorldNetDaily * by WND Staff\n\nUs Finds 'Secret Documents' on Trump and Russia: Details\n\nPrepared for Destruction: Fbi Found Documents on Trump's Connection to the Russian Federation.\n\nFbi Director Found Secret Documents About Trump's Ties to Russia in “Burn Bags”\n\nFox News: the Head of the Fbi Found Secret Documents Investigating Trump's Relationship with Russia.\n\nBomb in the Fbi: Thousands of Documents on the Trump-Russia Investigation Would Have Been Hidden in a Secret Room in \"Sacraments\"\n\nAustralian National Review – BREAKING: Kash Patel Finds Thousands of Russia Hoax Documents in \"Burn Bags\" in Secret Room – Including Classified Annex to Durham Report\n\nPatel found thousands of sensitive Trump–Russia probe docs inside ‘burn bags’ in secret room at FBI",
        "source_3": "CIA Director John Ratcliffe speaks on the alleged origins of the Russia collusion narrative and whether the statute of limitations applies in this instance.\n\nEXCLUSIVE: FBI Director Kash Patel found a trove of sensitive documents related to the origins of theTrump–Russia probeburied in multiple \"burn bags\" in a secret room inside the bureau, sources told Fox News Digital.\n\nSources told Fox News Digital that the \"burn bag\" system is used todestroy documents designated as classifiedor higher.\n\nSources told Fox News Digital that multiple burn bags were found and filled with thousands of documents.\n\nFBI'S CONTROVERSIAL TRUMP-RUSSIA ACTIONS PREDICTED WITH 'ALARMING SPECIFICITY' BY FOREIGN ACTORS: SOURCES\n\nSources told Fox News Digital that one of the documents FBI officials found in a burn bag was the classified annex to former special counsel John Durham's final report, which includes the underlying intelligence he reviewed.\n\nThe declassification of the classified annex is being done in close coordination between CIA Director John Ratcliffe, Patel, Director of National Intelligence Tulsi Gabbard, Attorney GeneralPam Bondiand acting National Security Agency Director William Hartman.\n\nFBI Director Kash Patel, in a June interview with podcast host Joe Rogan, revealed that he found a room full of documents and computer hard drives \"that no one had ever seen or heard of.\"(Anna Moneymaker/Getty Images)\n\nThe declassified annex will be transmitted to Senate Judiciary Committee Chairman Chuck Grassley, who ultimately will release the document to the public.\n\nSources exclusively briefed Fox News Digital on some of the contents of the classified annex — including that the U.S. intelligence community had credible foreign sources indicating that the FBI would play a role in spreading the alleged Trump–Russia collusion narrative — before the bureau ever launched its controversialCrossfire Hurricaneprobe.\n\nA source familiar with the contents of the classified annex told Fox News Digital that while it may not have been exactly clear in the moment what the intelligence collection meant, with the benefit of hindsight, it predicted the FBI’s next move \"with alarming specificity.\"\n\n\"Ultimately, the release of the classified annex will lend more credibility to the assertion that there was a coordinated plan inside the U.S. government to help the Clinton campaign stir up controversy connecting Trump to Russia,\" the source, who was granted anonymity to discuss sensitive intelligence matters that have not yet been made public, told Fox News Digital.\n\nDirector of National Intelligence Tulsi Gabbard talks to reporters in the Brady Press Briefing Room at the White House July 23, 2025 in Washington, D.C., after releasing newly declassified documents about the Trump–Russia collusion \"hoax.\"(Chip Somodevilla/Getty Images | Fox News Digital)\n\n\"Mere days after this intelligence was collected, the FBI launched Crossfire Hurricane,\" the source said. \"It’s really hard to see howBrennan, Clapper and Comeyare going to be able to explain this away.\"\n\nSources told Fox News Digital that Patel and his team discovered a previously undisclosed sensitive compartmented information facility (SCIF) in the FBI headquarters.\n\nFox News Digital reached out to previous FBI Directors Christopher Wray and James Comey for comment and has not yet received any responses.\n\nPatel, in a June interview with podcast host Joe Rogan, revealed that he found a room full of documents and computer hard drives \"that no one had ever seen or heard of.\"\n\n\"Just think about this,\" Patel told Rogan. \"Me, as director of theFBI, the former 'Russiagate guy,' when I first got to the bureau, found a room that Comey and others hid from the world in the Hoover Building, full of documents and computer hard drives that no one had ever seen or heard of. Locked the key and hid access and just said, 'No one's ever gonna find this place.'\"\n\nPatel and his staff have been working through the documents, some of which are related to sensitive investigations, including the FBI’s original Trump–Russia probe, known inside the bureau as Crossfire Hurricane.\n\nIt is unclear what the latest documents cover specifically, but sources told Fox News Digital that the most recent discovery was pursuant to an investigative request from Grassley.\n\nKash Patel is sworn in during a Senate Judiciary Committee hearing on his nomination to be FBI Director, on Capitol Hill in Washington, D.C., on Jan. 30, 2025.(Mandel Ngan/AFP via Getty Images)\n\nEXCLUSIVE: BRENNAN DIRECTED PUBLICATION OF 'IMPLAUSIBLE' REPORTS CLAIMING PUTIN PREFERRED TRUMP IN 2016, HOUSE FOUND\n\nGrassley has been requesting information related to Durham’s probe. Durham was appointed after then-special counsel Robert Mueller completed his yearslong investigation into the origins of the Trump–Russia probe — including intelligence community malfeasance during and in the aftermath of the 2016 election.\n\nIt is unclear what the latest documents cover specifically, but sources told Fox News Digital that the most recent discovery was pursuant to an investigative request from Senate Judiciary Committee Chairman Chuck Grassley.(Drew Angerer/Getty Images)\n\nSources told Fox News Digital that Grassley’s team is now reviewing the underlying information as part of its investigative work.\n\nAs for the other records, Patel’s staff is working to turn them over to Congress pursuant to investigative requests by committees of jurisdiction.\n\nEXCLUSIVE: FBI LAUNCHES CRIMINAL INVESTIGATIONS OF JOHN BRENNAN, JAMES COMEY: DOJ SOURCES\n\nPatel has been instrumental in unraveling the allegedRussiacollusion narrative.\n\nHe previously served as the chief investigator in the congressional probe into alleged Trump–Russia collusion — uncovering suspected government surveillance abuse that led to the appointment of two special counsels: one who determined there was no such collusion, Mueller, and another who determined the entire premise of the FBI’s original investigation was bogus, Durham.\n\nPatel served as senior counsel and a national security adviser on the House Permanent Select Committee on Intelligence (HPSCI) for then-Chair Rep. Devin Nunes.\n\nWhile Mueller investigated, the HPSCI opened its own investigation into alleged Trump–Russia collusion.\n\nRobert Mueller served as the FBI's sixth director.(Reuters)\n\nIn July 2016, during the election cycle, the FBI launched an investigation into whether the Trump campaign was colluding with Russia to influence the outcome of the election. That investigation, inside the bureau, was known as Crossfire Hurricane.\n\nBy January 2017, Comey had notified Trump of a dossier, known as the Steele dossier, that contained salacious and unverified allegations about Trump’s purported coordination with the Russian government, a key document prompting the opening of the probe.\n\nEXCLUSIVE: OBAMA OFFICIALS ADMITTED THEY HAD NO 'EMPIRICAL EVIDENCE' OF TRUMP-RUSSIA COLLUSION: HOUSE INTEL TRANSCRIPTS\n\nThe dossier was authored by Christopher Steele, an ex-British intelligence officer, and commissioned by Fusion GPS. Hillary Clinton's presidential campaign hired Fusion GPS during the 2016 election cycle.\n\nOne-time advisor to then-President-elect Donald Trump, Carter Page, addresses the audience during a presentation in Moscow on Dec. 12, 2016.(Sergei Karpukhin/Reuters)\n\nIt was eventually determined that the Clinton campaign and the Democratic National Committee funded the dossier through the law firm Perkins Coie.\n\nTrump fired Comey in May 2017. Days later, Mueller was appointed as special counsel to take over the Crossfire Hurricane probe and investigate whether the Trump campaign colluded with Russia to influence the 2016 election cycle.\n\nWhile Mueller investigated, the HPSCI opened its own investigation into alleged Trump–Russia collusion.\n\nFormer FBI Director James Comey, left, and current FBI Director Kash Patel.(Getty)\n\nPatel, as chief investigator for Nunes, by February 2018 had discovered widespread government surveillance abuse, including alleged improper surveillance of former Trump campaign aide Carter Page.\n\n\"While most members of Congress were ready to ignore the unprecedented civil rights abuses against the Trump campaign and myself, Kash Patel’s training as a top public defender made him the perfect advocate for exposing one of the greatest election interference scandals of all time,\" Page told Fox News Digital.\n\nPatel was an integral part of the creation of a memo released by then-Chair Nunes in February 2018, which detailed the DOJ's and FBI’s surveillance of Page under the Foreign Intelligence Surveillance Act.\n\nNunes and Patel revealed that the infamous anti-Trump dossier funded by Democrats \"formed an essential part\" of the application to spy on Page.\n\nThe memo referred to closed-door testimony from former FBI Deputy Director Andrew McCabe, who said that \"no surveillance warrant would have been sought\" from the FISA court \"without the Steele dossier information.\"\n\nHowever, when applying for the FISA warrant, the FBI omitted the origins of the dossier, specifically its funding from Clinton, who was Trump’s 2016 presidential opponent.\n\nFBI DIRECTOR KASH PATEL 'INSTRUMENTAL IN UNRAVELING' RUSSIA COLLUSION HOAX, FORMER CHAIR SAYS\n\nThe memo also said Steele, who worked as an FBI informant, was eventually cut off from the bureau for what the FBI described as the most serious of violations, \"an unauthorized disclosure to the media of his relationship with the FBI.\"\n\nThe memo noted that the FBI and DOJ obtained \"one initial FISA warrant\" targeting Page and three FISA renewals from the Foreign Intelligence Surveillance Court. The statute required that every 90 days a FISA order on an American citizen \"must be reviewed.\"\n\nThe memo revealed that Comey signed three FISA applications for Page, while McCabe, former Deputy Attorney General Rod Rosenstein, former Deputy Attorney General Sally Yates and former Acting Deputy Attorney General Dana Boente signed at least one.\n\nFormer FBI Deputy Director Andrew McCabe.(Jahi Chikwendiu/The Washington Post via Getty Images)\n\nThe memo was widely criticized byDemocratsbut was ultimately correct.\n\nEXCLUSIVE: OBAMA ADMIN 'MANUFACTURED' INTELLIGENCE TO CREATE 2016 RUSSIAN ELECTION INTERFERENCE NARRATIVE, DOCUMENTS SHOW\n\n\"Kash was instrumental in unraveling the Russia collusion hoax and finding evidence of government malfeasance despite constant attempts by the FBI and DOJ to stonewall our investigation,\" Nunes, who now chiefs Trump's Truth Social site, told Fox News Digital earlier in 2025.\n\nThe Justice Department inspector general, Michael Horowitz, reviewed the memo and confirmed the dossier served as the basis for the controversial FISA warrants obtained against Page.\n\n\"The feds spied on Kash during the probe and ran information warfare against him, but Kash helped expose them anyway,\" Nunes told Fox News Digital.\n\nJohn Durham testifies before the House Judiciary Committee on June 20, 2023.(Screenshot/HouseJudiciaryCommittee)\n\nNunes was referring to the Justice Department in November 2017 using grand jury subpoenas to secretly obtain the personal email and phone data for Patel and another Nunes staffer on the HPSCI as they were investigating FBI abuse and the Russia probe.\n\nMeanwhile, Patel, now serving as FBI director, has opened a criminal investigation into then-CIA Director John Brennan, after receiving a criminal referral from Ratcliffe; and has opened a criminal investigation into Comey.\n\nAs for Grassley’s team, he is expected to release a declassified version of the annex to Durham’s final report, which includes the underlying intelligence he reviewed. The intelligence has previously been classified.\n\nDECLASSIFIED TRUMP-RUSSIA PROBE DOCUMENTS: WHAT TO KNOW\n\nCIA Director John Ratcliffe, joined at center by Director of National Intelligence Tulsi Gabbard, testifies as the Senate Intelligence Committee holds its worldwide threats hearing, on Capitol Hill in Washington, March 25, 2025.(J. Scott Applewhite/The Associated Press)\n\nBrooke Singman is a political correspondent and reporter for Fox News Digital, Fox News Channel and FOX Business.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}