{
    "question": "In what ways could the Supreme Court’s handling of Trump’s birthright citizenship order and the question of nationwide injunctions influence future interpretations of the 14th Amendment and the judiciary’s check on executive power?",
    "content": {
        "source_1": "The Supreme Court on Thursday seemedopen to lifting a series of nationwide ordersblocking President Donald Trump from enforcing his birthright citizenship policy, even as several of the justices wrestled with the practical implications of allowing the government to deny citizenship to people born in the US.\n\nAfter more than two hours of argument, it was uncertain how a majority of the court might deal with those two competing interests.\n\nSome key conservatives suggested that the groups challenging Trump’s order might look to other types of lawsuits to stop the policy from taking effect. Other justices suggested the court might be willing to quickly review the questionable constitutionality of Trump’s birthright citizenship order, which lower courts have consistently ruled against.\n\nAt least part of Trump’s argument appeared to find purchase on the conservative court: That lower court judges were too frequently shutting down the president’s policies with too little review. Several of the court’s conservatives – and even some of its liberals – have raised similar concerns in past cases.\n\nBut that left several of the conservatives questioning what to do, in the meantime, with Trump’s policy, which appears to conflict directly with the text of the 14th Amendment.\n\nJustice Neil Gorsuch, at one point, ruminated about the “patchwork problems” of allowing enforcement in some parts of the country but not others. Justice Brett Kavanaugh pressed the attorney for the Trump administration about “how it’s going to work” if the president’s order is allowed to take effect. Both are conservatives.\n\nHere’s a look at some of the key takeaways from the argument:\n\nKavanaugh, a member of the conservative wing who sometimes sides with the liberals, suggested that class-action lawsuits would suffice for allowing the challengers to Trump’s executive order to get broad relief from the courts. He brushed away the suggestion from challengers that relying on class certification as a tool raises many of the same issues as nationwide injunctions the president is complaining about.\n\nIt’s a technical point, Kavanaugh acknowledged, but a potentially important one. Part of what Kavanaugh seemed to be saying was that there was another way for the groups challenging Trump to quickly shut down the order. It might be more challenging and take more time, but, he said, it would be more consistent with the way courts normally work.\n\n“We care about the technicalities,” Kavanaugh said at one point.\n\nWhen judges certify a class of people who will be affected the outcome of a lawsuit, they must consider who would be affected by the court’s ruling. That’s a higher hurdle to clear than simply reviewing the policy for its likely legality and shutting it down.\n\nThe Trump administration has pointed to class-action lawsuits as being the proper vehicle for courts to issue orders that would broadly block enforcement of an unlawful presidential policy while the issue travels up higher courts. But liberal justices on Thursday, and conservative Justice Amy Coney Barrett, grilled Solicitor General D. John Sauer on the possibility that the administration would even fight in court against a request for class certification in this case.\n\nSo it’s not clear, they suggested, that would solve anything. Barrett in particular, seemed concerned about that avenue to allow plaintiffs to temporarily halt a policy or law that violated the constitution.\n\n“Are you really going to answer Justice Kagan by saying there’s no way to do this expeditiously?” an incredulous Barrett pressed Sauer.\n\nThe court’s three liberals battered Sauer with questions about how rolling back nationwide injunctions would work in practice. They quickly sought to move the debate beyond the Trump administration’s assertion that its request was a “modest” one dealing with the technical issue of limiting the reach of nationwide injunctions.\n\n“The president is violating not just one, but in my count, four established Supreme Court precedents,” Justice Sonia Sotomayor told Sauer. “And you are claiming that both the Supreme Court and no lower court can stop an executive, universally, from violating those holdings.”\n\nIt was clear, almost immediately, that the court’s liberal wing would oppose Trump. And they spent much of the argument focused on the practical implications of allowing the government to enforce the order. Trump signed the birthright order on his first day back in office. It bars agencies from issuing citizenship documents, like passports, to babies born to non-US citizens.\n\n“Let’s just assume you’re dead wrong,” Justice Elena Kagan said at one point. “Does every single person that is affected by this EO have to bring their own suit? Are there alternatives? How long does it take? How do we get to the result that there is a single rule of citizenship that is the rule that we’ve historically applied rather than the rule that the EO would have us do?”\n\nThe court’s conservatives engaged with that discussion less, but several nevertheless raised the issue. Notably, Kavanaugh pushed Sauer on how hospitals and states would deal with the order if it were allowed to be implemented tomorrow.\n\n“On the day after it goes into effect – this is just a very practical question – how it’s going to work? What do hospitals do with a newborn?” Kavanaugh asked.\n\nSauer said that federal officials would have to figure out the implementation.\n\n“So you can imagine a number of ways that the federal officials could—” Sauer said.\n\n“Such as?” Kavanaugh continued, seemingly skeptical of Sauer’s response.\n\nBut several of the court’s conservatives raised concerns about the idea that a single judge could thwart a president’s power. Just last year, the court limited the scope of an injunction that blocked Idaho from enforcing its ban on transgender care for minors.\n\nAll judges, Justice Samuel Alito said, “are vulnerable to an occupational disease, which is the disease of thinking that ‘I am right and I can do whatever I want.’”\n\nJustice Clarence Thomas, another conservative, raised the idea that courts, historically, did not hand down nationwide injunctions affecting people who were not parties to the litigation before them.\n\n“So we survived until the 1960s without universal injunctions?” Thomas asked at one point.\n\nBut Alito also brought up a practical question: If those challenging Trump’s order could simply, as Kavanaugh suggested, file a class-action lawsuit and quickly shut down Trump’s policy that way, then why the huge fight over injunctions?\n\n“What is the point” he asked, “of this argument about universal injunctions?”\n\nBarrett, who has emerged as a key vote in several cases this year involving the Trump administration, pressed Sauer about why the government was entirely avoiding the merits of the birthright citizenship issue.\n\nHer line of questioning drew an important concession from Sauer, who acknowledged the legal arguments defending the merits of Trump’s order were “novel” and “sensitive.”\n\n“So this one isn’t clear cut on the merits?” Barrett asked.\n\nBarrett, who has occasionally joined her liberal colleagues in some hot-button cases, also pressed Sauer on why the administration is opposed to a nationwide injunction but generally willing to accept a class-action judgment that would likely have the same effect.\n\nSauer responded with two points: First, securing a class action can be more difficult. Second, a class-action judgement would require challengers to put more skin in the fight. In other words, if the members of class action lost, they would collectively also be bound by the decision the same way the government is.\n\n“So they’re taking a grave risk, so to speak, by proceeding through a class action and it has this symmetry where the government is bound if we lose, they are bound if we don’t lose,” he said. “And that’s very, very important distinction.”\n\nIn the run up to the arguments, there was significant debate about what the case is actually about: Was it about judicial power, and the ability of lower courts to block a president or the practical impacts of allowingthispresident to enforcethisorder?\n\nThroughout the debate on Thursday, it was clear that many of the justices were also having difficulty separating those two issues.\n\n“The real concern, I think, is that your argument seems to turn our justice system, in my view at least, into a ‘catch me if you can’ kind of regime,” said Justice Ketanji Brown Jackson. “Everybody has to have a lawyer and file a lawsuit in order for the government to stop violating people’s rights.”\n\nEven though the case has reached the Supreme Court in an emergency posture, it’s not clear how long it will take the justices to resolve it. The last time the court held arguments in an emergency case, an appeal last year dealing with environmental regulations, it took the justices several months.\n\nGiven the complications involved in the birthright case, it’s possible the court will need until the scheduled end of its term next month.\n\nThis story has been updated with additional developments",
        "source_2": "Dan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nUnited StatesSupreme Courtjustices appeared highly skeptical of how PresidentDonald Trumpwould implement his desired changes to birthright citizenship, as theyheard arguments over lower court blocks to the policyThursday.\n\nBothconservatives and liberals on the benchgrilled Solicitor General John Sauer overthe move to limit automatic citizenship at birth, but also showed signs that they wanted to limit federal judge-imposed nationwide injunctions — a different, but highly coveted, legal prize for the administration.\n\nWhile justices have yet to take up the core issue of parsing the 14thAmendment's meaning as it relates to birthright citizenship, JusticeBrett Kavanaughpressed Sauer with a series of questions about how the federal government might enforce Trump's order.\n\n\"What do hospitals do with a newborn? What do states do with a newborn?\" he asked, referring to a scenario where Trump's executive order was allowed to take effect.\n\nSauer said they wouldn't necessarily do anything different, but the government might figure out ways to reject documentation with \"the wrong designation of citizenship.\"\n\nKavanaugh continued to press for clearer answers, pointing out that the executive order only gave the government about 30 days to develop a policy. \"You think they can get it together in time?\" he asked.\n\nThursday's hearing was not technically over the legit merits of the birthright order. The question at hand was about whether lower courts can issue nationwide stays on the president's executive actions, at a time when the Trump administrationis facing dozens of legal challenges around its immigration policies alone, including birthright.\n\nThe president and other senior officials have railed against lower court judges, saying they hold too much power, though many legal experts say this is a founding principal of the judiciary as a check on the executive branch.\n\nKavanaugh's questions came amid others from his colleagues on the bench who asked how the Trump administration would be able to enforce its changes to birthright citizenship, which would mean those born to illegal immigrants or visitors would not automatically be Americans at birth.\n\nSauer's claim that federal officials would have to work out how this would be enforced did not appear to satisfy Kavanaugh. Sauer's argument that the courts — even the Supreme Court — were limited in their powers when it came to sweeping challenges to executive orders also seemed to exasperate the justices.\n\nAfter Sauer said the issue could be tackled with individual court cases that may eventually lead to a Supreme Court hearing in three to four years' time, Chief JusticeJohn Robertssaid the high court could move much faster if it wanted, referencing its interdiction in therecent TikTok case.\n\nConservativeAmy Coney Barrettresponded to Sauer by saying: \"General Sauer, are you really going to answer [Justice Elena] Kagan by saying there is no way to do this expeditiously?\"\n\nThe solicitor general also said the administration would likely push back on any class-action lawsuits which followed.\n\nLiberal JusticeKetanji Brown Jacksonappeared deeply skeptical of that position, saying: \"Your argument seems to turn our justice system, in my view at least, into a catch me if you can kind of regime ... where everybody has to have a lawyer and file a lawsuit in order for the government to stop violating people's rights.\"\n\nJackson said the legal issue at hand was simple: if a federal court ruled that the government was doing something illegal or unconstitutional, it should stop.\n\nJustices also raised the issue of limiting district and federal court rulings to their local jurisdictions, warning this could leave a patchwork of orders on the same issue.\n\nNew Jersey Solicitor General Jeremy Feigenbaum, representing 22 states that sued the administration over the executive order, claimed citizenship could \"turn on and off\" for children crossing state lines, if local rulings were limited in this way.\n\nThe oral arguments, which lasted just over two hours, repeatedly came back to the issue of the scope of birthright citizenship, despite it not being the specific issue at hand.\n\nThose fighting Trump's order say 150 years of judicial precedent will be overturned should the birthright order be allowed to go into effect. Liberal JusticeSonia Sotomayorreflected some of those concerns, saying that for some babies it could \"render them stateless.\"\n\nWhile the court is not expected to make any decision until next month at the earliest, the nine justices appeared cautious about allowing Trump's executive order to go into effect — but there also appeared to be concern from the bench that lower-court judges may not be the right people to stop such orders.\n\nAs for whether the Supreme Court would eventually tackle the birthright citizenship question itself,Kagantold Sauer that it was unlikely the administration would be successful when it had already lost multiple cases.\n\n\"This is happening right now: Every court has ruled against you,\" she said. If there are no nationwide injunctions, she added, \"the government has no incentive to take matters to the Supreme Court.\"\n\nTodd Schulte, president of FWD.us, an advocacy group in favor of birthright citizenship, in a statement:\"The Constitution is crystal clear: all persons born in the United States are citizens of the United States. As was reaffirmed in court this morning, birthright citizenship is a foundational American principle that has strengthened our communities, our families, and our whole country for generations.\n\n\"Any effort to narrow or lift the nationwide injunction on this case would lead to chaos, allowing birthright citizenship to be denied in some states but not others. If the Supreme Court sides with the government, the country will be split in half, with some states granting citizenship to newborn babies and the others denying it. The human cost of siding with the government cannot be overstated.\"\n\nJohn Eastman, senior fellow at the right-leaning Claremont Institute, which filed an amicus brief in support of the Trump administration's position, toldNewsweekearlier this week:\"Others have argued it will just create chaos, nobody will know who's a citizen and who's not. Most of the rest of the world doesn't have this notion that you're born here, you're automatically a citizen. You have to be somehow part of the political community, and so you can look at it what other countries do and find out it's rather simple.\"\n\nTexas Democratic Representative Sylvia Garcia, in a post on X:\"We've got a message for the Trump White House: Read the Constitution, stupid. Birthright citizenship is a Constitutional right, clearly articulated in the 14th amendment. Over the years, the Supreme Court has upheld this right. No executive order, no political stunt, and no fear-mongering can erase that. We'll fight back in the courts and inCongress, and we will win!\"\n\nPresident Donald Trump, in a Truth Social post Thursday morning:\"The United States of America is the only Country in the World that does this, for what reason, nobody knows — But the drug cartels love it! We are, for the sake of being politically correct, a STUPID Country but, in actuality, this is the exact opposite of being politically correct, and it is yet another point that leads to the dysfunction of America.\"\n\nThe court is expected to issue its decision on the nationwide injunctions by the end of June or early July, though in some cases the justices act more expeditiously. For now, the universal injunctions on Trump's executive order remain in effect.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security.                                    ...Read more",
        "source_3": "Justice Kagan blasted U.S. Solicitor General John Sauer on the birthright citizenship executive order— which she noted has yet to succeed in any federal court, including cases heard by Trump-appointed judges.\n\nPresidentDonald Trumpweighed in on the birthright citizenship case being argued in front of the Supreme Court Thursday, insisting the law originally was intended to benefit the descendants of slaves, not illegal immigrants.\n\n\"Birthright Citizenship was not meant for people taking vacations to become permanent Citizens of the United States of America, and bringing their families with them, all the time laughing at the ‘SUCKERS’ that we are!\" Trumpwrote in a postThursday morning on his Truth Social platform as the arguments were being heard. \"The United States of America is the only Country in the World that does this, for what reason, nobody knows – But the drug cartels love it!\"\n\nTrump added that birthright citizenship, which was adopted as aconstitutional amendmentin 1868, was primarily intended to benefit the babies of slaves.\n\nSUPREME COURT TAKES ON BIRTHRIGHT CITIZENSHIP: JUSTICES APPEAR OPEN TO CONSERVING STATUS QUO\n\nThe Supreme Court heard oral arguments on May 14, 2025, in a case involving birthright citizenship in the U.S.(Getty Images)\n\n\"It had nothing to do withIllegal Immigrationfor people wanting to SCAM our Country, from all parts of the World, which they have done for many years,\" Trump said in his post. \"It had to do with Civil War results, and the babies of slaves who our politicians felt, correctly, needed protection. Please explain this to theSupreme Courtof the United States.\"\n\nTrump cited the birthright citizenship issue as \"yet another point that leads to the dysfunction of America.\"\n\n\"We are, for the sake of being politically correct, a STUPID Country but, in actuality, this is the exact opposite of being politically correct, and it is yet another point that leads to the dysfunction of America.\"\n\n'EVERY COURT HAS RULED AGAINST YOU': SUPREME COURT JUSTICE ELENA KAGAN SPARS WITH U.S. SOLICITOR GENERAL JOHN SAUER IN BIRTHRIGHT CITIZENSHIP CASE'\n\nPresident Donald Trump contended on May 15, 2025, that the law was meant to protect the descendants of slaves, not illegal immigrants.(The Associated Press/iStock)\n\nWhile the case being heard Thursday resulted from disputes against the president's effort to endbirthright citizenship,which is the right for any child born in the U.S. to automatically acquire citizenship, the issue of whether it is permissible for lower courts to permanently block Trump's executive actions will hinge on the justices' decision.\n\nThrough universal injunctions, lower federal courts can bar authorities from enforcing a Trump executive order.\n\nThe birthright citizenship case was set in motion after Trump signed a Day One executive order, meant to go into effect Feb. 19, reinterpreting the 19th-century amendment. But shortly after the order was signed, legal challenges ensued and Democratic-appointed federal judges began blocking the president's action.\n\nMeanwhile, appeals of those decisions from the Trump administration failed before the Supreme Court decided to take up the case.\n\nIt is unclear when the high court's justices' final ruling on the birthright citizenship case will come out. It could take weeks, or it could take just several hours if they decide to issue an emergency ruling right away.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}