{
    "question": "In what ways could President Trump’s pledge to lift all sanctions on Syria affect the country’s access to international finance, foreign investment, and humanitarian aid, and what unintended consequences might follow?",
    "content": {
        "source_1": "US President Donald Trump on Wednesday had tea with a former jihadist who until recently had a$10 million US bountyon his head.\n\nInterim Syrian President Ahmed al-Sharaa, onceknownby his militant nom de guerre Abu Mohammed al-Jolani, met Trump in Riyadh six months after leading a swift campaign that toppled the half-a-century-old Assad regime, ejecting Iran-backed armed groups and declaring himself leader of the country.\n\nAl Sharaa wasplacedon the US Specially Designated Global Terrorist list in 2013 for heading al Qaeda’s affiliate in Syria, known as Al Nusra Front, and allegedly orchestrating suicide bombings across Syria. The Saudi-born former jihadist had spent years fighting US forces in Iraq before moving to Syria to lead an armed Islamist rebellion that ousted the brutal dictator Bashar al-Assad.\n\nThe meeting, described by Syria as “historic,” was the first between a US and Syrian president in 25 years, taking place during Trump Middle East tour, the first set of state visits of his second term.\n\nBoth leaders were seen smiling in photos released by the White House and the Saudi foreign ministry. The Syrian foreign ministry said Trump committed to “standing by Syria at this critical juncture.”\n\nA day earlier, Trump announced the removal of decades-old sanctions on Syria, a move that prompted a 40-second-long applause from the audience, including a standing ovation from the Saudi Crown Prince Mohammed bin Salman.\n\n“Oh, what I do for the Crown Prince,” Trump told the room on Tuesday, crediting the de facto Saudi leader for leading the effort to lift what the president called “brutal and crippling” sanctions. Syria has been designated by the US as a State Sponsor of Terrorism since December 1979.\n\nSyria’s economy has been crippled for years by Western sanctions. Among the harshest is the US’ 2019 Caesar Act, which imposed wide-ranging sanctions that restricted individuals, companies or governments from economic activities assisting Assad’s war effort. The act rendered the entire economy untouchable. According to the World Bank, the country’s economy shrank by more than half between 2010 and 2020.\n\nAs of 2022, poverty was affecting 69% of Syria’s population, according to the World Bank. Extreme poverty affected more than one in four Syrians in 2022, the bank said, adding that this number likely deteriorated after a devastating earthquake in February 2023.\n\nGulf states have been keen to invest in Syria and prop up its economy but have been wary of violating US sanctions. Trump’s move is likely to remove such barriers, making way for potentially billions of dollars in investments.\n\nDuring the meeting, Trump proposed that Sharaa take a series of measures, including normalization with Israel, expelling foreign and Palestinian “terrorists,” and helping the US to prevent the resurgence of ISIS, according to the White House.\n\nBringing Syria in from the cold gives a lifeline to the country’s fledgling regime and its president, who pledged in an interview with CNN last year that Syria’s armed opposition ultimately plans to form a government defined by institutions and a “council chosen by the people.” But it also presents an opportunity for Gulf Arab states and Turkey, which also pushed for sanctions to be lifted, to expand their influence in Syria and profit from it after decades of being left out of the country.\n\n“The fact that he (Trump) did it so publicly and from Riyadh I think is a sort of tacit approval for those who are looking to invest in Syria potentially as well,” Natasha Hall of the Middle East Program at the Center for Strategic and International Studies (CSIS) said. “(It) means that he is giving wins to Mohammed bin Salman.”\n\nFireworks lit up the skies in some of Syria’s biggest cities after Trump announced the lifting of sanctions. Billboards were erected thanking Trump and Prince Mohammed.\n\n“I don’t know how life would be without sanctions,” said Ranim Sakhal, who said she has lived under sanctions since she was born in the 1970s. “The country has been suffocating.”\n\n“People are optimistic and our dream is for Arab countries to help, which is something we haven’t seen for years because of Bashar’s rivalry with Arab leaders,” Sakhal added.\n\nSyria’s currency, the Lira, rose by as much as 27% against the US dollar following the announcement. The country’s economy and trade minister, Mohammad Nidal al-Shaar, shed tears live on air with Saudi outlet Al Arabiya, as he underscored that Syria is “now entering a new phase.”\n\nBut the optimism is not universal. The lifting of sanctions would go far in giving legitimacy to Sharaa’s new regime, and some in Syria are concerned about how minorities will be treated by the former jihadists.\n\n“We are glad about it…thank God. After all these years the economy could be revitalized. The prices are very high, products are unavailable so, God willing, it will be the beginning of economic improvement in the country,” George, a resident of Damascus who declined to share his last name, told CNN. The lifting of sanctions however shouldn’t be construed as a tacit approval of the regime without bringing to justice those involved in the killing of minorities, he said.\n\n“We face a number of extremist groups that restrict freedoms,” he said. “If a guy and a girl are seen together in public, the guy could be detained and just disappear. Men can be beaten for wearing shorts… it’s an extreme infringement on personal freedoms.”\n\nIn March, armed men loyal to the new Syrian regime carried out field executions and spoke of purifying the country after a crackdown against remnants of the former Assad regime  spiraled into communal killings against the Alawite minority. The United Nations said at the time that entire families, including women and children, were killed during the violence.\n\nFor decades, Gulf Arab states were left out of Syria as their rival Iran expanded its influence in the country through its alliance with the Assad regime.\n\nA decade-long civil war in Syria severely strained relations between Damascus and most Arab states, eventually culminating in Syria’s expulsion from the Arab League. Over the past few years, Gulf states began mending fences with the Assad regime and were leading the effort to rehabilitate him until he was abruptly ousted from power in December. Since then, Saudi Arabia and Qatar doubled down on getting the new regime re-integrated into the international community.\n\nSaudi Foreign Minister Faisal bin Farhan announced on Wednesday that Riyadh will be at the “forefront” of Syria’s economic revival. Its efforts could allow it to become a significant player in the country and expand its influence there for the first time.\n\n“Syria will not be alone. Saudi Arabia… will be at the forefront of the supporters to that economic awakening… (Syria) needs a push, and it will receive that push from its brothers in the region,” bin Farhan said at a news conference on Wednesday.\n\nHasan Alhasan, a senior fellow at the International Institute for Strategic Studies, said Saudi Arabia has “geostrategic interests in the Middle East” that can be achieved through support for the current Syrian regime.\n\n“Saudi Arabia wants Syria to be stable, it recognizes that the only way in which you can get to a stable Syria is by providing the current administration with the economic resources and tools to deliver a so-called victory,” he said.\n\nDuring the Biden administration, the US and Saudi Arabia were close to reaching a comprehensive security and economic agreement that would have led to the normalization of relations between the kingdom and Israel.\n\nDespite Trump’s desire for Saudi Arabia to recognize Israel, no such normalization materialized during his visit to Riyadh. Instead, the president said he would establish ties with Sharaa, a move that defied Israel, which has repeatedly bombed Syria and seized more of its territory since the fall of Assad.\n\nAn Israeli official told CNN that when Prime Minister Benjamin Netanyahu met Trump in Washington in April, he asked the president not to remove sanctions on Syria, saying he feared it would lead to a repeat of the events of October 7, 2023, when Hamas-led militants attacked Israel.\n\nNetanyahu had taken an aggressive stance with Sharaa and his new government. In the days that followed Assad’s ouster, he ordered an unprecedentedground push into Syria, driving Israeli forces deeper into the country than ever before and upending Israel’s 50-year tacit détente with the Assads.\n\nThe escalation quickly abandoned Netanyahu’s initial pledge to practice“good neighborliness”to the new Syria.Hundreds of airstrikestargeted the remnants of Assad’s weaponry, particularly its chemical weapons, to prevent them from falling into the hands of militant groups, and Israeli forcesseizedMount Hermon, Syria’s highest peak, and a strategically vital position overlooking Israel, Lebanon, and Syria.\n\n“We toppled the Assad regime, which essentially was used as the land link between Iran and Hezbollah in Lebanon,” Netanyahu said in a video statement last week.\n\nAfter meeting Sharaa on Wednesday, Trump heaped praise on him, calling him a “great young attractive guy,” with a “very strong past” who is “a fighter.” The new Syrian President, he said, has “got a real shot at pulling it together.”",
        "source_2": "Donald Trump has said his administration is now exploring the possibility of normalising relations with Syria - his comments coming shortly after he met Syria's interim President Ahmed al-Sharaa, whose forces ended the decades-long dictatorship of the Assad family.\n\nThe extraordinary encounter, unthinkable just months ago, was short but significant.\n\n\"I think he has got the potential,\" Trump remarked after his meeting in Riyadh, 37 minutes long, with the former Syrian fighter formerly linked to al-Qaeda.\n\nThe $10m US bounty on his head was only lifted in December.\n\nVideo footage of their conversation in a lavish Saudi royal palace showed some initial awkwardness as they spoke through a translator.\n\nA beaming Saudi Crown Prince, Mohammad bin Salman, sat next to them. The Turkish President Recep Tayyip Erdogan joined them by telephone.\n\nTrump acknowledged it was these two leaders who had convinced him to also lift the US's punishing Syria sanctions.\n\nHis sudden announcement on Tuesday night at a major US-Saudi investment forum in Riyadh won him a standing ovation. It was a volte-face after his many previous posts on social media that the US had \"no interest in Syria\".\n\n\"Tough guy, very strong past,\" is how Trump later described Sharaa to journalists travelling with his high-powered American delegation on his first official four-day tour.\n\nIt was a very Trump gloss about Sharaa's old links to al-Qaeda. His Islamist group, Hayat Tahrir al-Sham (HTS), was al-Qaeda's affiliate in Syria until he severed ties in 2016. HTS is still designated as a terrorist organisation by the UN, US and UK.\n\nSince assuming power in December, Sharaa has been wearing Western business suits and trying to present himself as a president for all Syrians.\n\n\"It's a new light at the end of this tunnel,\" exclaimed Hind Kabawat, minister of social affairs and labour, in the interim government.\n\nShe told the BBC's Newshour programme they had been calling for sanctions relief ever since their \"Liberation Day\".\n\nThe US decision sparked celebrations across a county where 90% of Syrians are said to be living in poverty, after more than a decade of civil war and profound suffering.\n\nRemoving restrictions which cut Syria off from the international financial system will enable greater engagement by aid agencies and encourage foreign investment and trade.\n\n\"We are the North Korea of the Middle East,\" a hotel receptionist in Damascus told me last December when I asked for another electronic hotel key.\n\nHe tearfully lamented that \"we don't have enough cards, we have shortages of everything\".\n\nIt may also help convince some of the millions of Syrians living in exile to think more seriously about returning home. And it could help a fledgling government to pay salaries, begin to rebuild, and address the growing discontent over the privations of daily life.\n\nBut dismantling the vast web of sanctions now strangling Syria will take time.\n\n\"Some sanctions can be removed immediately using presidential waivers,\" commented Dina Esfandiary of Bloomberg Economics.\n\n\"But lifting the multi-layered sanctions won't be easy and will require real commitment by the Trump administration.\"\n\nI remember travelling to Tehran in the wake of the 2015 Iran nuclear deal and the Obama administration's commitment to ease sanctions there.\n\nAt the news conference with the visiting EU's high representative for foreign policy, Iranian journalists kept asking, with palpable anguish, why it was still impossible for them even to open a bank account.\n\nSyria's new friends, including regional powers like Saudi Arabia and Turkey, now positioning themselves to shape the new Syria, will need to ensure Trump and his team stay interested.\n\nBut he's made it clear he expects something in return if there is to be a full normalisation of relations. The first item on his list is \"join the Abraham Accords\".\n\nThe US president regards this process of normalisation with Israel, which several Arab states including the United Arab Emirates has joined, as one of his foreign policy achievements in his  first term.\n\nSharaa, praised by his friends as pragmatic, has already signalled that he understands the importance of building a working relationship with his neighbour, even though Israel continues to bomb what it calls \"terrorist targets\" – air bases, military installations and weapons depots – insisting they could \"fall into the wrong hands\".\n\nLast month, the Syrian leader reportedly told a visiting US congressman, Cory Mills, that Syria was prepared to normalise ties with Israel and join the Abraham Accords under \"the right conditions\".\n\nIsraeli media have reported that Prime Minister Benjamin Netanyahu had urged President Trump not to lift sanctions. He remains suspicious of Sharaa and his HTS forces, as well other groups which include foreign fighters in their ranks.\n\nRemoving foreign fighters is another of Washington's demands; it's one of the very many challenges now facing Syria's leader.\n\nPresident Trump hailed this moment as \"a chance at greatness\". Millions of Syrians just welcome a greater chance that their lives will finally start changing for the better.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "President Donald Trump announced he will lift \"brutal and crippling\" sanctions on Syria, implemented under ousted President Bashar al-Assad.\n\nPresident Donald Trumpmet with Syria’s interim President Ahmad al-Sharaa in Riyadh on Wednesday, a day afterlifting all sanctionson Syria, marking a major shift in policy.\n\nThe last time a meeting between the two countries' leadership was with former President Bill Clinton in 2000.\n\nTrump met with al-Sharaa for an informal chat on the sidelines of the Gulf Cooperation Council, where he was set to address leaders as part of his four-day regional tour.\n\nTRUMP SAYS HE'LL DROP SANCTIONS ON SYRIA IN MOVE TO NORMALIZE RELATIONS\n\nUS President Donald Trump (C) meets with Syrian President Ahmed al-Shara (L) along with the Saudi Crown Prince Mohammed bin Salman Al Saud (R) during the first leg of his three-country Middle East tour in Riyadh, Saudi Arabia on May 14, 2025.(Bandar Al-Jaloud/Saudi Royal Court/Handout/Anadolu via Getty Images)\n\nTrump stated at the summit this was astep toward peaceand rebuilding relations with Syria’s government.\n\n\"We are currently exploring normalizing relations with Syria’s new government, as you know, beginning with my meeting with President Ahmed Al-Shara and Secretary Rubio's meeting with the Syrian Foreign Minister in Turkey after discussing the situation with Crown Prince Mohammed,\" Trump said at the broader summit.\n\nThis combination of photos shows U.S. President Donald Trump, left, in Riyadh, Saudi Arabia, on May 13, 2025 and Syria's President Ahmad al-Sharaa in Ankara, Turkey, on Feb. 4, 2025.(AP Photo/Francisco Seco)\n\n\"I'm also ordering the cessation of sanctions against Syria to give them a fresh start. It gives them a chance for greatness. The sanctions were really crippling, very powerful,\" he said.\n\nSyrians were seen and heard celebrating the announcement by Trump that he would move to lift sanctions on the beleaguered Middle Eastern nation.\n\nSyrian people flocked to the streets in the capital Damascus to celebrate US President Donald Trump's decision to lift sanctions.(Amadeusz Mikolaj Swierk/Anadolu via Getty Images)\n\nTRUMP'S MIDDLE EAST TOUR BEGINS WITH SYRIA LOOMING AS STRATEGIC OPPORTUNITY\n\nA statement from Syria’s Foreign Ministry called the announcement \"a pivotal turning point for the Syrian people as we seek to emerge from a long and painful chapter of war.\"\n\nU.S. Secretary of State Marco Rubio is also scheduled to meet with his Syrian counterpart later in the week.(AP/Jacquelyn Martin/Pool)\n\nTrump says he feels strongly that this new endeavor will give Syria a great chance at a fresh start.\n\n\"I felt very strongly that this would give them a chance,\" said the president. \"It's not going to be easy anyway, so it gives them a good, strong chance. And it was my honor to do so, so we will be dropping all of the sanctions on Syria, which I think really is going to be a good thing.\"\n\nU.S. Secretary of State Marco Rubiois also scheduled to meet with his Syrian counterpart later in the week.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}