{
    "question": "How might California’s new model ordinance and Prop 1 funding to clear encampments and expand shelters and behavioral health services influence homelessness outcomes across cities and counties, and what indicators would best demonstrate whether the approach balances urgency with dignity?",
    "content": {
        "source_1": "Gov. Gavin Newsom.  Photo: Frazer Harrison/WireImage\n\nGov. Gavin Newsom asked cities Monday across California toban homeless encampments, releasing a template policy he hopes they'd adopt but stopping short of conditioning funding on their doing so.\n\nWhy it matters:Newsom, who'swidely expectedtorun for presidentin 2028, iscontinuing to embracea tougher approach on homelessness — reflectingincreased voter acceptanceand a Supreme Courtruling a year agothat cleared the way for cities to crack down on encampments.\n\nState of play:The governorreleased a model ordinancefor cities to adopt, a policy that's generally in line with the one San Diego implemented nearly two years ago.\n\nWhat they're saying:During a press conference, Newsom would not say that cities risked losingdiscretionary state homeless fundsif they pass on the model ordinance, but he said it is a \"preview of expectations moving forward.\"\n\nBy the numbers:Downtown San Diego was home to 2,104 homeless residents in May 2023, two months before San Diego passed a broad prohibition on encampments. Last month, that number had fallen to 902,per the Downtown Partnership's monthly count.\n\nBetween the lines:Many of those encampments relocatedto property under the jurisdiction of Caltrans, the state's highway agency, like a large,well-established campjust outside downtown nearthe city's safe camp site.\n\nZoom in:In his State of the City speech earlier this year, Gloria said the city receives 300 calls a month about encampments on state property, and demanded Caltrans to either take action or let the city do it, but he opted against challenging Newsom Monday.",
        "source_2": "Shane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nCalifornia Gov.Gavin Newsomhas drawn up a template local ordinance for the state's local governments to help them clear and ban the homeless encampments that have popped up in recent years.\n\nNewsom cannot force the adoption of his ordinance, but he can use the carrot of billions of dollars in state funding for housing issues to encourage cities to take it on. He vowed to crack down on encampments last year.\n\nThe humanitarian costs of homelessness are self-evident, and there is a pressing need to help the large number of vulnerable people living on the streets, often struggling with multiple health issues, such as addiction.\n\nBut the issue of homelessness has also become a political liability forDemocratsin California and elsewhere, with theirRepublicanopponents drawing attention to striking images of the shabby encampments that sprang up under the party's governance.\n\nNewsom also has one eye on the 2028 presidential election, in which he is touted as a likely candidate for the Democratic nomination.\n\nHe has been moving more towards the center in recent months, reaching out toRepublicansand taking a tougher stance on issues, such as trans women in women's sports.\n\nThe ordinance includes bans on persistent camping in one location and those that block free passage on sidewalks. But it also requires local officials to give notice and \"make every reasonable effort to identify and offer shelter\" before clearing an encampment.\n\nThe governor's office tied the ordinance to the release of $3.3 billion of previously announced Proposition 1 funding to help house and treat homeless people who are seriously ill, including those with mental health problems.\n\nCalifornian voters impacted by the encampments are tiring of the problem and want a solution, seeing it as an urgent priority of the state to get a grip on a situation that exploded during the pandemic.\n\nAround 37 percent of Californian voters even supported arresting homeless people who refused shelter, and another 24 percent \"somewhat agreed\" with that, according to a poll from POLITICO and UC Berkeley's Citrin Center in April 2025.\n\nThe survey shows voters are increasingly frustrated that the billions of dollars spent on tackling homelessness has not so far worked, Jack Citrin, aUniversity of California, Berkeley political science professor who directed the survey, told POLITICO in April.\n\n\"It's a highly visible issue,\" Citrin said. \"You can't completely avoid homelessness if you live in a big city.\"\n\nCalifornia Gov. Newsomsaid in a statement announcing his model ordinance: \"There's nothing compassionate about letting people die on the streets. Local leaders asked for resources—we delivered the largest state investment in history. They asked for legal clarity—the courts delivered.\n\n\"Now, we're giving them a model they can put to work immediately, with urgency and with humanity, to resolve encampments and connect people to shelter, housing, and care. The time for inaction is over. There are no more excuses.\"\n\nThis ordinance is just a template and there is no formal obligation on cities and towns with less strict rules to implement it.\n\nSome are already trying to tackle the encampments and have begun clearances. But others, such as Los Angeles, have pushed back against previous pressure by Newsom to clear the encampments.\n\nSo the question is: How many will take up Newsom's template?\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check                                    ...Read more",
        "source_3": "Homeless squatters have taken over a luxury RV parking lot in City of Industry, Calif. Massive fires and crime, including burglaries, have since plagued the area. (Fox 11 Los Angeles)\n\nCalifornia Gov. Gavin Newsomreleased details about his multibillion-dollar plan to tackle the homeless crisis in the Golden State and is pushing cities and counties to take \"immediate action.\"\n\nOn Monday, Newsom shared a model ordinance for cities and counties to \"immediately address dangerous and unhealthy encampments and connect people experiencing homelessness with shelter and services.\"\n\n\"There’s nothing compassionate about letting people die on the streets,\" Newsom said in a news release.\n\nDEM CITY USES 'BAIT-AND-SWITCH' TACTIC TO APPROVE HOMELESS SHELTER, LOCALS ERUPT\n\n\"Local leaders asked for resources – we delivered the largest state investment in history. They asked for legal clarity – the courts delivered. Now, we’re giving them a model they can put to work immediately, with urgency and with humanity, to resolve encampments and connect people to shelter, housing, and care. The time for inaction is over. There are no more excuses,\" California Gov. Gavin Newsom said.\n\nThe ordinance is backed in part by $3.3 billion in new Prop 1 funding, Newsom's office announced, adding that the governor is \"calling on all local governments to act without delay.\"\n\nGov. Gavin Newsom; people at a homeless encampment in California(Getty Images)\n\nNewsom is also encouraging local leaders to use their authority, affirmed by the U.S. Supreme Court, to address encampments.\n\n\"The Governor is calling on every local government to adopt and implement local policies without delay,\" Newsom's office said.\n\nNewsom's office said this model ordinance draws from the state’s \"proven and workable approach,\" an approach that between July 2021 and May 2025 cleared more than 16,000 encampments and more than 311,873 cubic yards of debris from sites along the state right-of-way.\n\n\"These results demonstrate that the policy is both effective and scalable, offering a sound, adoptable framework for jurisdictions to resolve encampments with urgency and dignity,\" Newsom said.\n\nPROGRESSIVE JOURNALIST SAYS NEWSOM MUST TAKE 'ACCOUNTABILITY' FOR HOW HE 'DESTROYED' CALIFORNIA\n\nCalifornia Gov. Gavin Newsom(MediaNews Group/East Bay Times via Getty Images)\n\nMonday's announcement is in addition to the release of $3.3 billion in voter-approved Proposition 1 funding, which Newsom's office said will be made available later today to communities statewide.\n\nThose funds are being used to expand behavioral health housing and treatment options for the \"most seriously ill and homeless in California.\"\n\n\"This model ordinance is not intended to be comprehensive or to impose a one-size-fits-all approach for every city. Tailoring is expected and appropriate to account for local differences and priorities,\" Newsom's office said.\n\nThe guidance doesn’t say whether criminal penalties should be enforced but instead would leave it up to cities to enforce how severely those who violate the ban should be punished.\n\nNewsom's office said all local approaches should reflect three basic principles, which include:\n\nNewsom's announcement comes following theSupreme Court's decisionin Grants Pass v. Johnson in 2024, which found laws restricting sleeping in public areas did not violate the constitutional restriction against \"cruel and unusual punishment.\"\n\nDEM MAYOR FED UP WITH HOMELESS CRISIS PROPOSES JAILING VAGRANTS WHO REFUSE HOUSING\n\nA homeless encampment is seen on the sidewalk of Hollywood Boulevard in Los Angeles on May 9, 2024.(Toby Canham for Fox News Digital)\n\nNewsom had encouraged the Supreme Courtto take up the case, claiming court decisions preventing the government from punishing vagrants occupying public spaces had created an \"unsurmountable roadblock\" to addressing the crisis.\n\nNewsom's office told Fox News Digital that the governor has \"actively held communities accountable who do not follow state law to address homelessness\", sharing an example of when the state sued the City of Norwalk in 2024 for \"its unlawful ban on homeless shelters.\"\n\nThe governor's office added that while the nation’s unsheltered homelessness last year went up by nearly 7%, California’s increase was only 0.45% and was lower than 44 other states.\n\n\"Governor Newsom is the first governor to actively address this issue in our state, and he is reversing a crisis that was decades in the making,\" Newsom's office said.\n\nIn addition tocleaning up homeless encampments, Newsom's office also announced $3.3 billion in grant funding to create over 5,000 residential treatment beds and more than 21,800 outpatient treatment slots for behavioral healthcare services.\n\n\"Californians demanded swift action to address our state’s behavioral health crisis when they voted for Prop 1 in March 2024,\" Newsom's office said.\n\n\"Today, we’re delivering our biggest win yet. These launch-ready projects will build and expand residential beds and treatment slots for those who need help. Whether it’s crisis stabilization, inpatient services, or long-term treatment, we’re ensuring that individuals can access the right care at the right time,\" the statement continued.\n\nWhen fully awarded, Newsom's office said funding from Proposition 1 bonds is estimated to create 6,800 residential treatment beds and 26,700 outpatient treatment slots for behavioral health and will build on other major behavioral healthinitiatives in California.\n\n\"Today marks a critical milestone in our commitment to transforming California’s behavioral health system,\" said Kim Johnson, secretary of the California Health and Human Services Agency. \"Through these awards, we are investing in bold, community-driven solutions that expand access to care, promote equity, and meet people where they are. These projects are a reflection of our values and vision for a healthier, more compassionate California.\"\n\nNewsom's office also said the Department of Housing and Community Development will oversee up to $2 billion in Proposition 1 funds to build permanent supportive housing for veterans and others who are homeless or at risk of homelessness and have mental health or substance-use disorder challenges.\n\n\"This is a generational investment in California’s behavioral health future. We are not just building facilities. We are building hope, dignity, and pathways to healing for thousands of Californians,\" said Michelle Baass, director of the state Department of Health Care Services, in a statement.\n\nStepheny Price is a writer for Fox News Digital and Fox Business. She covers topics including missing persons, homicides, national crime cases, illegal immigration, and more. Story tips and ideas can be sent to stepheny.price@fox.com\n\nStepheny Price is a Writer atFox Newswith a focus on West Coast and Midwest news, missing persons, national and international crime stories, homicide cases, and border security.\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox"
    }
}