{
    "question": "In what ways might the viral cocaine allegations about Macron, Merz, and Starmer on the Kyiv train—and the subsequent fact-checks and official statements identifying the item as a tissue—shape public trust and the dynamics of disinformation surrounding the Ukraine conflict?",
    "content": {
        "source_1": "Enlarged photographs and video footage show the white object Macron removed from the table and stuffed in his pocket was a tissue. This was also confirmed by the French government.\n\nIn early May 2025, avideo(archived) of the leaders of France, Germany and the U.K. traveling together in a train to Ukraine spread online with a familiar claim. According to numerous captions accompanying the video, French President Emmanuel Macron quickly hid a bag of cocaine as journalists entered the cabin to take photographs. He was seated alongside German Chancellor Friedrich Merz and British Prime Minister Keir Starmer.\n\nThe video was shared on X by numerous right-wing figures includingAlex JonesandDinesh D'Souza, as well aspro-Russianaccounts. Some of these posts also claimed Merz hid a \"spoon\" used to ingest the cocaine.\n\nNotice how Macron sneakily and deftly swipes it out of the camera's view.\n\nThe German chancellor Merz takes care of the spoon.\n\nCan't have people thinking they are plotting strategy while doing cocaine together\n\nWhile the video footage is real, the claim is not. We looked closely at the footage and Getty Images photographs of the gathering and found the item was simply a crumpled tissue. As such, we rate the video referred to in this claim as miscaptioned.\n\nAccording toauthentic video footagefrom AFP, the three leaders were recorded shaking hands aboard a train to Kyiv, Ukraine, on May 9. In the minute before they sit down, they are fully aware of being filmed and no one attempts to hide the white object on the table. It is only when Macron and the others sit down to pose for photographs that he removes the white object from the table. Merz also picks up a small item from the table and appears to fiddle with it.\n\nThese Getty Images photographs of theitemson thetablewere taken by Ludovic Marin and Kay Nietfeld, and showed Macron, Merz and Starmer laughing around the table before they sat down:\n\nWe zoomed in on oneimageand found the large white item is very clearly a crumpled piece of tissue. We were unable to determine precisely what the item Merz picked up actually was, but some X users described it as acocktail skewer. In any case, it in no way resembled a spoon.\n\nNot long after the video began circulating, some users, Alex Jones among them, began sharing what appeared to be an enlargement of the image andclaiming, again, that it showed \"a bag of Blow.\"\n\nHowever, the image had been digitally edited to add the sort of textures and highlights one would see if the item actually was a plastic bag full of cocaine. The verified X account of Élysée Palace, Macron's official residence,rejectedthe claim on May 11, releasing a statement and an unmanipulated photograph of the white object:\n\nWhen European unity becomes inconvenient, disinformation goes so far as to make a simple tissue look like drugs.\n\nThis fake news is being spread by France's enemies, both abroad and at home. We must remain vigilant against manipulation.\n\nThe X post also stated: \"This is a tissue. For blowing your nose.\"\n\nThis was not the first time public figures and politicians were accused on social media of using cocaine. We have covered incorrect claims aboutDonald Trump Jr. and Ukrainian President Volodymyr Zelenskyyusingcocaine. Zelenskyy in particular is a common target of such rumors. During the course of the Russia-Ukraine war, we fact-checked digitally editedfootagethat falsely showed cocaine on his desk during a video call with Elon Musk.\n\nWhile the video footage above is real, it is not evidence that the three leaders had cocaine in the room, nor that they attempted to \"hide\" any materials tied to cocaine.\n\n\"German Chancellor Friedrich Merz, Keir Starmer, Prime Minister Of...\" Getty Images, 10 May 2025,https://www.gettyimages.co.uk/detail/news-photo/dpatop-09-may-2025-poland-przemysl-german-chancellor-news-photo/2213665988.Accessed 12 May 2025.\n\nIbrahim, Nur. \"Was Cocaine on Volodymyr Zelenskyy's Desk During Video Chat With Elon Musk?\" Snopes, 4 May 2022,https://www.snopes.com//fact-check/volodymyr-zelenskyy-cocaine-video/.Accessed 12 May 2025.\n\nIbrahim, Nur. \"Was Zelenskyy High on Cocaine During February 2024 NBC Interview?\" Snopes, 26 Feb. 2024,https://www.snopes.com//fact-check/zelenskyy-cocaine-nbc-interview/.Accessed 12 May 2025.\n\nLiles, Jordan. \"No, Video of Donald Trump Jr. Doesn't Show Him Using Cocaine at Inauguration.\" Snopes, 24 Jan. 2025,https://www.snopes.com//fact-check/donald-trump-jr-cocaine-inauguration-video/.Accessed 12 May 2025.\n\n\"Macron, Merz and Starmer Meet Aboard a Train to Kyiv.\" AFP, 9 May 2025,https://www.youtube.com/watch?v=-Sz6cIACfB0.Accessed 12 May 2025.\n\n\"Macron's Office Hits Back at Claims He Brought Cocaine on Kyiv Train.\" POLITICO, 12 May 2025,https://www.politico.eu/article/french-presidency-emmanuel-macron-out-cocaine-totting-fake-news/.Accessed 12 May 2025.\n\n\"TOPSHOT - Britain's Prime Minister Keir Starmer Gestures during a...\" Getty Images, 9 May 2025,https://www.gettyimages.co.uk/detail/news-photo/britains-prime-minister-keir-starmer-gestures-during-a-news-photo/2213651245.Accessed 12 May 2025.\n\nNur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.",
        "source_2": "This is Radio Schuman, your new go-to podcast to spice up your weekday mornings with relevant news, insights, and behind-the-scenes from Brussels and beyond.\n\nFrom the economy to the climate and the EU's role in world affairs, this talk show sheds light on European affairs and the issues that impact on our daily lives as Europeans. Tune in to understand the ins and outs of European politics.\n\nNo agenda, no argument, no bias, No Comment. Get the story without commentary.\n\nDare to imagine the future with business and tech visionaries\n\nEuronews Tech Talks goes beyond discussions to explore the impact of new technologies on our lives. With explanations, engaging Q&As, and lively conversations, the podcast provides valuable insights into the intersection of technology and society.\n\nEurope's water is under increasing pressure. Pollution, droughts, floods are taking their toll on our drinking water, lakes, rivers and coastlines. Join us on a journey around Europe to see why protecting ecosystems matters, how our wastewater can be better managed, and to discover some of the best water solutions.   Video reports, an animated explainer series and live debate - find out why Water Matters, from Euronews.\n\nWe give you the latest climate facts from the world’s leading source, analyse the trends and explain how our planet is changing. We meet the experts on the front line of climate change who explore new strategies to mitigate and adapt.\n\nThis is Radio Schuman, your new go-to podcast to spice up your weekday mornings with relevant news, insights, and behind-the-scenes from Brussels and beyond.\n\nFrom the economy to the climate and the EU's role in world affairs, this talk show sheds light on European affairs and the issues that impact on our daily lives as Europeans. Tune in to understand the ins and outs of European politics.\n\nNo agenda, no argument, no bias, No Comment. Get the story without commentary.\n\nDare to imagine the future with business and tech visionaries\n\nEuronews Tech Talks goes beyond discussions to explore the impact of new technologies on our lives. With explanations, engaging Q&As, and lively conversations, the podcast provides valuable insights into the intersection of technology and society.\n\nEurope's water is under increasing pressure. Pollution, droughts, floods are taking their toll on our drinking water, lakes, rivers and coastlines. Join us on a journey around Europe to see why protecting ecosystems matters, how our wastewater can be better managed, and to discover some of the best water solutions.   Video reports, an animated explainer series and live debate - find out why Water Matters, from Euronews.\n\nWe give you the latest climate facts from the world’s leading source, analyse the trends and explain how our planet is changing. We meet the experts on the front line of climate change who explore new strategies to mitigate and adapt.\n\nViral social media posts are alleging that French President Emmanuel Macron, German Chancellor Friedrich Merz and British Prime Minister Keir Starmer were caught taking cocaine on their trip to Kyiv.\n\nAt the centre of the claims is a video showing the three leaders greeting one another on a train from Poland to Ukraine, ahead of a meeting with President Volodymyr Zelenskyy to reaffirm their support for his country.\n\nSocial media users allege that the white object next to Macron's glass is a bag of cocaine, which he hurriedly removes, and that the object next to Merz's hand is a snuff spoon.\n\nThe claims have also come from the highest echelons of Russia's government, with foreign ministry spokeswoman Maria Zakharova posting on her official Telegram channel that the trio \"got high\" together.\n\n\"Apparently, so much so that they forgot to remove their instruments (bag and spoon) before the journalists arrived,\" she alleged.\n\nBut the allegations have all the hallmarks of being part of a widespread Russian disinformation campaign designed to harm Ukraine and its allies' credibility.\n\nThe Élysée Palace stated on X that the alleged bag of cocaine is a mere tissue, and that the \"fake news\" has been spread by France's enemies at home and abroad.\n\n\"When European unity becomes inconvenient, disinformation goes so far as to make a simple tissue look like drugs,\" the president's office said.\n\nA spokesperson for the German government told EuroVerify that the claims were \"absurd\", and Ukraine's Centre for Countering Disinformation slammed them as an embarrassing case of Russian propaganda.\n\n\"Adding to the absurdity, Russia's Ministry of Foreign Affairs joined the disinformation effort, with its official spokesperson Maria Zakharova publicly echoing the lie,\" it said. \"This is yet another example of how Russia resorts to propaganda tricks instead of practising diplomacy.\"\n\n\"If the Russian MFA is trying to blow up an international scandal over a napkin, it clearly means Moscow has run out of real arguments,\" it added.\n\nIndeed, the allegations have been shared all over the internet by pro-Russian accounts, dozens of pro-Kremlin media and have even been pushed by far-right figures who are routinely critical of Ukraine and spread disinformation.\n\nA website called \"Global Euronews\", which bears a similar name to Euronews in an effort to legitimise its misinformation, shared the story, as have others, such as EurAsia Daily and Pravda.Ru.\n\nAmong the far-right personalities amplifying the false narrative are UK anti-Islam activist Tommy Robinson (also known by his real name, Stephen Yaxley-Lennon) and US radio host and conspiracy theorist Alex Jones, who now also claim that the mainstream media is trying to cover up the story.\n\nYet the objects causing the controversy clearly look like a tissue and some sort of stirrer, as opposed to anything related to drugs.\n\n\"It looks like a tissue or napkin and a bit of thread,\" Catriona Matheson, professor of substance use at the University of Stirling, told EuroVerify. \"There's no evidence of cocaine.\"\n\nA clip of the meeting was recorded and shared by both the Associated Press andAgence France-Presse, two reputable news agencies, which made no reference to any drug use, and which surely wouldn't have been allowed in the room had anything untoward been going on.\n\nOther accounts have since been sharing doctored images, trying to make the tissue look more like a bag of cocaine, but these too are ultimately part of the disinformation campaign.\n\nThe table takes on a much redder hue compared to the original video, and the so-called bag of cocaine appears much shinier compared to the original. The glass next to it has also been digitally altered to look dustier.\n\nThe UK government did not respond to our requests for comment.",
        "source_3": "A bizarre conspiracy that European leaders snorted cocaine en route tocritical Ukraine talkshas been roundly ridiculed by the French president’s office, after it was promoted by Russian trolls as well as American conspiracists such as Alex Jones.\n\n“This fake news is being spread by France’s enemies, both abroad and at home. We must remain vigilant against manipulation,” the Elysee Palaceposted on X.\n\nThe conspiracy — thought to have started on the social networking app Telegram, which is popular in Russia — used edited footage of French President Emmanuel Macron, British Prime Minister Sir Keir Starmer and newly elected German Chancellor Friedrich Merz.\n\nIn the clip, the trio enter a train carriage taking them to Kyiv for crucial talks with Ukraine’s President Volodymyr Zelensky.\n\nMacron is seen hurriedly removing a crumpled tissue off the table, which conspiracy theorists claimed was a bag of cocaine, while Merz was alleged to be handling a white spoon for cocaine as cameramen film the three world leaders.\n\nThe “spoon” which Merz removes from the table is in fact a plastic coffee stirrer.\n\nFormer InfoWars host Alex Jones was among the prominent Western social media accounts to promote the conspiracy.\n\nHe also branded Zelensky a “known cocaine enthusiast,” based on a previous Russian-spread conspiracy about the leader. He also wrongly claimed that the video showed the trio following their talks with Zelensky instead of prior to them.\n\nHe then later doubled down on the conspiracy, showing an edited crop on the video with a shine filter applied to it.\n\n“You can clearly see it’s a bag of blow,” he insisted.\n\nRussia’s Foreign Ministry also pushed the same disinformation on Sunday, with Putin’s puppet, Maria Zakharova, calling the French, British and German leaders “utterly [drug] dependent individuals” on her Telegram account.\n\n“It’s as if the Almighty Himself is lifting the veil on this putrid spectacle,” she thundered.\n\nCalling Zelensky an “unstable cocaine addict,” another Russian claim without evidence, she insisted that a Western diplomat had told her drug use was common among European leaders.\n\nOther far-right accounts in Russia and the West amplified the conspiracy in the wake of talks between the three European powers.\n\nLeaders from the UK, France, Germany, Poland and Ukraine held a phone call with President Trump on Sunday during which they set the start of the cease-fire for Monday.\n\nIt followed Trump’s calls forZelensky and Russia’s President Vladimir Putin to join him for peace talksin Turkey this Thursday.\n\n“Ukraine should agree to this, IMMEDIATELY,” Trump posted on Truth Social. “At least they will be able to determine whether or not a deal is possible, and if it is not, European leaders, and the U.S., will know where everything stands, and can proceed accordingly!\n\n“I’m starting to doubt that Ukraine will make a deal with Putin, who’s too busy celebrating the Victory of World War ll, which could not have been won (not even close!) without the United States of America. HAVE THE MEETING, NOW!!!.” the president added.\n\nPutin had earlier proposed direct talks with Ukrainein Istanbul, which he claimed would aim to eliminate the root causes of the war."
    }
}