{
    "question": "How might the 90-day rollback—reducing U.S. tariffs on Chinese goods to 30% and China’s to 10%, alongside the suspension of some Chinese countermeasures—shape leverage, business decisions, and public expectations ahead of further negotiations?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nU.S. and Chinese officials said Monday they had reached a deal to roll back most of their recent tariffs and call a 90-day pause to keep talking to resolve their trade disputes.\n\nUS Trade Representative Jamieson Greer, left, and US Secretary of the Treasury Scott Bessent take part in a press conference after two days of closed-door discussions on trade between the United States and China, in Geneva, Switzerland, Monday, May 12, 2025. (Jean-Christophe Bott/Keystone via AP)\n\nShipping containers are seen ready for transport at the Guangzhou Port in the Nansha district in southern China’s Guangdong province, April 17, 2025. (AP Photo/Ng Han Guan, File)\n\nU.S. Trade Representative Jamieson Greer, left, and U.S. Secretary of the Treasury Scott Bessent take part in a press conference after two days of closed-door discussions on trade between the United States and China, in Geneva, Switzerland, Monday, May 12, 2025. (Jean-Christophe Bott/Keystone via AP)\n\n▶ Follow live updates onPresident Donald Trump and his administration\n\nGENEVA (AP) — The United States andChinaagreed Monday to slash their massiverecent tariffs, restarting stalled trade between the world’s two biggest economies and setting off a rally in globalfinancial markets.\n\nBut the de-escalation inPresident Donald Trump’s trade warsdid nothing to resolve underlying differences between Beijing and Washington. The deal lasts 90 days, creating time for U.S. and Chinese negotiators to reach a more substantive agreement. But the pause also leaves tariffs higher than beforeTrump started ramping them uplast month. And businesses and investors must contend with uncertainty about whether the truce will last.\n\nU.S. Trade Representative Jamieson Greersaid the U.S. agreed to drop the 145% tax Trump imposed last month to 30%. China agreed to lower its tariff rate on U.S. goods to 10% from 125%.\n\nShipping containers are seen ready for transport at the Guangzhou Port in the Nansha district in southern China’s Guangdong province, April 17, 2025. (AP Photo/Ng Han Guan, File)\n\nGreer andTreasury Secretary Scott Bessentannounced the tariff reductions at a news conference in Geneva.\n\nThe officials struck a positive tone as they said the two sides had set up consultations to continue discussing their trade issues. Bessent said that the triple-digit tariffs the two countries imposed on each other last month — in an escalation of tensions Trump started — amounted to “the equivalent of an embargo, and neither side wants that. We do want trade.’'\n\nThe delegations, escorted around town and guarded by scores of Swiss police, met for at least a dozen hours on both days of the weekend at a sunbaked 18th-century villa that serves as the official residence of the Swiss ambassador to the United Nations in Geneva.\n\nAt times, the delegation leaders broke away from their staffs and settled into sofas on the villa’s patios overlooking Lake Geneva, helping deepen personal ties in the effort to reach a much-sought deal.\n\nThe 30% levy that America is now imposing on Chinese goods includes an existing 20% tariff intended to pressure China into doing more to prevent thethe synthetic opioid fentanylfrom entering the United States. It also includes the same 10% “baseline’’ tariff Trump has slapped on imports from most of the world’s countries. The 30% tax comes on top of other levies on China, including some left over from Trump’s first term and kept by former President Joe Biden.\n\nTrump had ratcheted the combined tariff to 145% last month, furious that China was retaliating, before backing down Monday.\n\nChina’s Commerce Ministry called the agreement an important step for the resolution of the two countries’ differences and said it lays the foundation for further cooperation.\n\n“This initiative aligns with the expectations of producers and consumers in both countries and serves the interests of both nations as well as the common interests of the world,” a ministry statement said.\n\nChina hopes the U.S. will stop “the erroneous practice of unilateral tariff hikes” and work with China to safeguard the development of economic and trade relations, injecting more certainty and stability into the global economy, the ministry said.\n\nThe joint statement by the two countries said China also agreed to suspend or remove other measures it has taken since April 2 in response to the U.S. tariffs. China has increased export controls on rare earths, including some critical to the defense industry, and added more American companies to its export control and unreliable entity lists, restricting their business with and in China.\n\nU.S. Trade Representative Jamieson Greer, left, and U.S. Secretary of the Treasury Scott Bessent take part in a press conference after two days of closed-door discussions on trade between the United States and China, in Geneva, Switzerland, Monday, May 12, 2025. (Jean-Christophe Bott/Keystone via AP)\n\nThe full impact on the complicated tariffs and other trade penalties enacted by Washington and Beijing remains unclear. And much depends on whether they will find ways to bridge longstanding differences during the 90-day suspension.\n\nBessent said in an interview with CNBC that U.S. and Chinese officials will meet again in a few weeks.\n\nButinvestors rejoicedas trade envoys from the world’s two biggest economies blinked.\n\nFutures for the S&P 500 jumped 2.6% and the Dow Jones Industrial Average was up 2%. Oil prices surged more than $1.60 a barrel, and the dollar gained against the euro and the Japanese yen.\n\n“This is a substantial de-escalation,” said Mark Williams, chief Asia economist at Capital Economics. But he warned “there is no guarantee that the 90-day truce will give way to a lasting ceasefire.”\n\nDani Rodrik, an economist at Harvard University, said that the two countries had stepped back “from a needless trade war’’ but that U.S. tariffs on China remain high at 30% “and will mainly hurt U.S. consumers.’’\n\n“Trump has obtained absolutely nothing from China for all the chaos he generated. Zilch,’’ Rodrik wrote, posting on Bluesky.\n\nCraig Singleton, senior director of the China program at the Foundation for Defense of Democracies, said the speed at which the agreement came about suggested that “both sides were more economically boxed in than they let on.”\n\n“For China, the economic pain was real: Rising unemployment, capital flight, and export orders falling at their fastest rate in nearly two years,” Singleton said. “For Trump, markets mattered, and this deal gives him a win without abandoning leverage.”\n\nThe announcement by the U.S. and China sent shares surging, with U.S. futures jumping more than 2%. Hong Kong’s Hang Seng index surged nearly 3%, and benchmarks in Germany and France were both up 0.7%\n\n“The drop from sky-high to merely high tariffs, along with the uncertainty about the path of future tariffs, will still serve as a constraint on trade and investment flows between the two economies,” said Eswar Prasad, professor of trade policy at Cornell University.\n\n“Nevertheless, it is a positive omen for the world economy that U.S. tariffs might eventually end up as significant trade barriers but not unsurmountable walls,’’ he said.\n\nJay Foreman — CEO of Basic Fun, the Florida-based company behind such toys as Care Bears and Tonka trucks — said he was relieved to see the tariff rate on Chinese goods now down to 30%. But he wants that to drop to 10%.\n\nForeman said he’d just advised his team in China to release its toy shipments, which had been paused since early April. Before Monday’s deal, he said, he thought he’d have to double prices — but they’ll still go up, by 10% to 15% for the third and fourth quarters.\n\n“It’s like they tried to feed us a rotten egg sandwich and hope we’re happy to drink spoiled milk instead,” Foreman said.\n\nUS Trade Representative Jamieson Greer, left, and US Secretary of the Treasury Scott Bessent take part in a press conference after two days of closed-door discussions on trade between the United States and China, in Geneva, Switzerland, Monday, May 12, 2025. (Jean-Christophe Bott/Keystone via AP)\n\nMcHugh reported from Frankfurt, Germany; Kurtenbach from Mito, Japan; and Moritsugu from Beijing. AP Writers Paul Wiseman and Didi Tang in Washington and AP Retail Writer Anne D’Innocenzio in New York contributed.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Reporting by Emma Farge, Olivia Le Poidevin in Geneva, Andrea Shalal in Washington and David Lawder in Chicago; Additional reporting by Andrew Silver in Shanghai, Lisa Barrington in Seoul, Helen Reid in London, Lisa Baertlein in Los Angeles and David Gaffen in New York; Writing by Dave Graham, Emelia Sithole-Matarise and Joseph Ax; Editing by Sharon Singleton, Ross Colvin, David Gregorio and Stephen Coates\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nEmma Farge reports on the U.N. beat and Swiss news from Geneva since 2019. She has produced a string of exclusives on diplomacy, the environment and global trade and covered Switzerland’s first war crimes trial. Her Reuters career started in 2009 covering oil swaps from London and she has since written about the West African Ebola outbreak, embedded with U.N. troops in north Mali and was the first reporter to enter deposed Gambian dictator Yahya Jammeh’s estate. She co-authored a winning story for the  Elizabeth Neuffer Memorial Prize on Russia’s diplomatic isolation in 2022 and was also part of a team of journalists nominated in 2012 as Pulitzer finalists in the international reporting category for coverage of the Libyan revolution. She holds a BA from Oxford University (First) and an MSc from the LSE in International Relations. She is currently on the board of the press association for UN correspondents in Geneva (ACANU).\n\nLisa Baertlein covers the movement of goods around the world, with emphasis on ocean transport and last-mile delivery. In her free time, you'll find her sailing, painting or exploring state and national parks.",
        "source_3": "The U.S. and China announced on Monday that tariffs against one another will be reduced for an initial 90-day period.\n\nThe U.S. and China announced on Monday thattariffs against one anotherwill be reduced for a 90-day period after officials held trade negotiations in Geneva, Switzerland.\n\nThe tariffs PresidentDonald Trumpannounced against China on April 2 are being cut by 24 percentage points for this temporary period while retaining the remaining ad valorem rate of 10% from that announcement, according to a joint statement.\n\nChina agreed to the same stipulations, adding that it will \"adopt all necessary administrative measures to suspend or remove the non-tariff countermeasures taken against the United States since April 2,\" the announcement stated.\n\nCOMMERCE SECRETARY SAYS MORE DEALS TO COME FOLLOWING US-UK TRADE AGREEMENT: 'GOING TO DRIVE OUR ECONOMY'\n\nThe U.S. and China announced on Monday that tariffs against one another will be reduced for an initial 90-day period.(Brendan Smialowski/AFP/Getty Images / Getty Images)\n\nUnder the deal, reciprocal tariffs for both countries would be reduced by 115%. The U.S. will temporarily lower itstariffs on Chinese goodsfrom 145% to 30%, and China will reduce its levies on American products from 125% to 10%.\n\nBoth the U.S. and China agreed to take the aforementioned actions by Wednesday.\n\nThe countries highlighted the \"importance of a sustainable, long-term, and mutually beneficial economic and trade relationship.\"\n\nThe two sides also agreed to \"establish a mechanism\" to continue discussions about economic and trade relations, which will be led by Chinese Vice Premier He Lifeng, U.S. Treasury Secretary Scott Bessent and U.S. Trade Representative Jamieson Greer, according to the joint statement.\n\nTREASURY'S BESSENT ON TRADE TALKS: US GETTING 'GOOD OFFERS,' MOST DEALS TO BE CONCLUDED BY END OF YEAR\n\nThe two sides will \"establish a mechanism\" to continue talks about economic and trade relations, led by Chinese Vice Premier He Lifeng, U.S. Treasury Secretary Scott Bessent and U.S. Trade Representative Jamieson Greer.(Anna Moneymaker / Getty Images)\n\n\"These discussions may be conducted alternately in China and the United States, or a third country upon agreement of the Parties. As required, the two sides may conduct working-level consultations on relevant economic and trade issues,\" the statement said.\n\nThis agreement comes amid an intensetrade warbetween the two countries over the past few weeks after Trump announced tariffs on many countries around the world.\n\n\"China was assigned a reciprocal tariff rate of 34%,\" Greer recalled while speaking in Geneva. \"China was the only country that chose to implement retaliation against the United States for this reciprocal tariff. All other countries withheld and decided that they wanted to negotiate with the United States or simply not retaliate.\"\n\nJamieson Greer, U.S. trade representative, in the Oval Office of the White House in Washington, D.C., on Wednesday, March 26, 2025.(Getty Images)\n\n\"The president increased our tariff rates to offset Chinese retaliation,\" he added. \"And as you know, this escalated to a point where both sides had added 125% tariffs.\"\n\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\n\nBy clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time."
    }
}