{
    "question": "In what ways could the EPPC analysis—and the criticisms over its transparency and lack of peer review—shape FDA oversight of mifepristone and public confidence in the safety of medication abortion?",
    "content": {
        "source_1": "Republicans and right-wing media have jumped on anew reportpublished by a conservative think tank that claims the abortion drug mifepristone is harmful to women. Experts tell HuffPost that the study is junk science — but that’s not stopping abortion opponents from using it to lobby for more abortion pill restrictions.\n\nThe Ethics and Public Policy Center published the report just days after FDA Commissioner Martin Makarysaidhe has “no plans” to restrict mifepristone, which has been at the center of the abortion wars since the fall of Roe v. Wade in 2022. Makarymadeseveralheadlinesfor his comments, seemingly assuring pro-choice Americans that he would not pull FDA approval of the drug.\n\nBut in that same interview, Makary also said: “As you may know, there is an ongoing set of data that is coming into FDA on mifepristone. So if the data suggests something or tells us that there’s a real signal, we can’t promise we’re not going to act on that data that we have not yet seen.” President Donald Trump announced his intent to appoint Makary to helm the FDA soon after the November election, and the former Fox News contributor — who routinely spread anti-abortion misinformation — was confirmed by the Senate last month.\n\nThe same day the report was released, Sen. Josh Hawley (R-Mo.)sent a letterto Makary quoting the FDA commissioner’s above statement and urging him to “follow this new data and take all appropriate action to restore critical safeguards on the use of mifepristone.” Hawley, a leading anti-abortion advocate, asked Makary to restore certain requirements to access mifepristone, which the Biden administration loosened during the COVID pandemic. Hawley asked Makary to respond by May 15, adding, “The health and safety of American women depend on it.”\n\nThe timing of Makary’s comments, the report and Hawley’s letter has set off alarms among reproductive health groups.\n\n“It’s troubling that President Trump’s new FDA commissioner has refused to acknowledge mifepristone’s longstanding record of overwhelming safety and efficacy,” Liz Wagner, senior federal policy counsel at the Center for Reproductive Rights, told HuffPost. “And it’s even more troubling that a deeply flawed, non-peer-reviewed ‘study’ was released by an anti-abortion group immediately after Dr. Makary told a reporter that the FDA may act on ‘a real signal’ on mifepristone.”\n\nMakary, along with Health Secretary Robert F. Kennedy Jr. have said they will defer to new research on mifepristone to determine whether it is safe to use. Kennedy evensaidthe president has tasked him with studying the safety of the abortion pill. But decades of evidence-based research and peer-reviewed studies have already proven mifepristone to be extremely safe and effective.\n\nWhen asked if the FDA is considering Hawley’s request, an agency spokesperson told HuffPost: “The FDA is committed to safeguarding public health by ensuring the safety, efficacy, and quality of the products it regulates. The agency rigorously evaluates the latest scientific data, leveraging gold standard science to make informed decisions. With a steadfast focus on protecting consumers, the FDA applies a balanced, science-based approach while incorporating practical, common-sense considerations to its regulatory processes.”\n\nThe agency also pointed HuffPost to Makary’s comment that the FDA may act if there’s a “real signal” in data regarding mifepristone. When HuffPost asked if the EPPC report is the “ongoing set of data that is coming into the FDA on mifepristone” that Makary referred to, the spokesperson did not respond.\n\nRepublicans have been chomping at the bit to roll back access to the abortion pill through the FDA, either by restricting how patients can get the medication or pulling it off shelves altogether. The EPPC is an advisory board member of Project 2025, an extreme right-wing policy agenda that details how to ban abortion nationwide, including restricting or banning mifepristone using Trump appointees in the FDA. One of the two authors of the EPPC report, and the group’s president, previously worked at the Heritage Foundation, the far-right think tank that led Project 2025.\n\nRight-wingmedia outletsandanti-abortion advocacy groupsjumpedon the EPPC report, and several high-profile Republicans pointed to it as a reason mifepristone should be restricted.\n\n“The science is clear: the abortion pill is not safe for women & never has been,” Sen. Steve Daines (R-Mont.)tweeted. Sen. James Lankford (R-Okla.)tweetedthe report and wrote: “Read more to learn about the lies the Biden admin told women about this dangerous drug.”\n\nThe EPPC report claims it’s the “largest-known study of the abortion pill” and that nearly 11% of women “experience sepsis, infection, hemorrhaging, or another serious adverse event within 45 days following a mifepristone abortion.”\n\nRachel Jones, a principal research scientist at the Guttmacher Institute, said she would not call this paper a “study” since it was not peer-reviewed. The EPPC report also does not include its dataset and procedure codes — an unusual decision that makes it impossible for other researchers to fully assess the methodology and integrity of its results.\n\nWhen HuffPost reached EPPC for comment, communications director Hunter Estes said the group is unable to share the full dataset with the public. Estes told HuffPost that the report was not peer-reviewed because “the extensive pro-abortion bias in the peer-review process” creates “no opportunities to publish peer-reviewed analysis that offer major substantive critiques of the abortion pill or abortion.”\n\nFor two decades, HuffPost has been fearless, unflinching, and relentless in pursuit of the truth. Support our mission to keep us around for the next 20 — we can't do this without you.\n\nWe remain committed to providing you with the unflinching, fact-based journalism everyone deserves.\n\nThank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever.We hope you will join us once again.\n\nWe remain committed to providing you with the unflinching, fact-based journalism everyone deserves.\n\nThank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever.We hope you will join us once again.\n\n“Even apart from all the red flags with the data and supposed analysis, the fact where they land in the recommendations — that has nothing to do with the research itself — indicates this was driven more by ideology than by scientific rigor,” Jones told HuffPost.\n\nFor example, the recommendations in the report include that mifepristone should only be used up to seven weeks of pregnancy, but the data did not look at outcomes by length of gestation. Additionally, the authors recommend that only physicians should provide mifepristone, but the analysis didn’t distinguish between whether the pill was provided by a physician or an advanced practice clinician. When asked how EPPC arrived at the policy recommendations included in the paper, Estes repeated the recommendations published in the report.\n\n“For 25 years, objective safety data has shown that medication abortion is safe, full stop,” said Wagner, from the Center for Reproductive Rights. “If political appointees at the FDA decide that anti-abortion propaganda should influence their review process, it will diminish the FDA’s standing and credibility.”\n\nBy entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to ourTerms of ServiceandPrivacy Policy.",
        "source_2": "A study by a conservative think tank claims that mifepristone, a common medication for abortion, is associated with more severe side effects than previously reported, suggesting nearly 11% of women experience complications like hemorrhaging or infections after use.\n\nThe Ethics and Public Policy Center analyzed insurance claims that span six years, claiming higher adverse event rates than the FDA's reported figure of under 0.5%, and are now urging the FDA to strengthen drug safety protocols.\n\nThe Guttmacher Institute has published studies that contradict EPPC's claims, citing extensive global support for mifepristone's safety and effectiveness, while the WHO argues the medication has played a crucial role in accessible abortion services worldwide.\n\nMifepristone, the most commonly used drug for medication abortions, could be linked to more serious side effects than federal sources document,according to a study published Monday, April 28. The Ethics and Public Policy Center (EPPC), a conservative nonprofit whose stated mission is to bring Judeo-Christian values back to American life, released research using insurance claims over a six-year period that suggests nearly 11% of women prescribed mifepristone experienced complications, including hemorrhaging, sepsis or other infections within 45 days of consuming the pill.\n\nEPPC said the data comes from all-payer health insurance claims processed through private health insurance, Medicaid, Medicare, TRICARE and the Department of Veterans Affairs.\n\nThe data doesn’t include cash transactions or those in which the insurer is also the provider, which the nonprofit says are disproportionately common for abortion. This missing data could mean that the actual percentage of adverse effects differs from the reported results.\n\nMore than 5 millionU.S. women have used mifepristone since it became FDA-approved in 2000.\n\nThe Ethics and Public Policy Center, a nonprofit think tank, describes its mission as opposing progressive policies and promoting a conservative consensus rooted in Judeo-Christian values.\n\nDanco Laboratories is the manufacturer of brand-name mifepristone, Mifeprex, the pill used in most medication abortions in the United States. The company markets its product as “the safe and effective abortion pill,” and has been used by more than 5 million women since it was first approved in 2000.\n\nThe study’s authors claim that increased access to the medication has led to an increase in its use. Today, chemical abortions using mifepristone make up close to two-thirds of all procedures in the United States.\n\nMeanwhile, the World Health Organization (WHO) considers the abortion pill an essential medication.\n\n“Medical abortion has played a seminal role in expanding access to safe abortion globally, especially for women and girls in the most vulnerable situations who may lack access to health facilities or need to keep their abortion private by avoiding hospital stays,”said Dr. Bela Ganatra, head of the Comprehensive Abortion Care Unit at WHO, adding, “so it’s important that healthcare practitioners can facilitate it as an option for abortion care.”\n\nDuring President Joe Biden’s administration, the U.S. Food and Drug Administration (FDA) allowed for mifepristone to be ordered online and received through the mail, something EPPC says weakened “initial safeguards.”\n\n“The FDA chipped away at these initial safeguards, risking women’s health in order to increase access to abortion,” the study’s authors write.\n\nEPPC analyzed 865,727 mifepristone abortions between 2017 and 2023. The researchers claim that what’s written on the drug’s label does not adequately describe the reactions that some women face when consuming the medication.\n\nAuthors Jamie Bryan Hall and Ryan Anderson claim these adverse events are “at least 22 times as high as the summary figure of ‘less than 0.5 percent’ in clinical trials reported on the drug label.” Based on their results, they’re calling on the FDA to implement stronger protocols that ensure all doctors and medical professionals are keeping patients safe.\n\nHowever, the Guttmacher Institute, a research and policy organization centered around sexual and reproductive health and rights, disagrees.The organization pointsto extensive global data and scientific consensus backing the drug’s role in protecting women’s health. In 2023, it published a post defending the pill and its use, writing, “Mifepristone was first approved in France and China in 1988, and as of May 2023, 96 countries have approved its use.”\n\nEPPC argues that tighter regulations would reduce health risks for women and improve oversight of the drug’s use.\n\n“The FDA should further investigate the harm mifepristone causes to women and, based on objective safety criteria, reconsider its approval altogether,” the study reads.\n\nThe FDA approved Mifeprex, the brand-name version of mifepristone, in 2000 following clinical trials of nearly 31,000 participants. The approval allowed abortions up to seven weeks of pregnancy. In September 2016, that window was extended to 10 weeks.\n\nIn 2019, mifepristone tablets were also given clearance after the FDA found them comparable to Mifeprex. The labeling and instructions for both pills are the same.\n\nAccording to the researchers, physicians should be able to manage any complications that arise, such as heavy bleeding or an incomplete abortion, while ensuring emergency care is available to patients. They also call for mandatory reporting of all serious adverse events to the FDA and drug manufacturers –– a common requirement when new drugs hit the market, and one that mifepristone was previously subject to.\n\nFollowing the release of EPPC’s study,U.S. Sen. Josh Hawley, R-Mo., called on the FDAto commission new research on the potential safety risks associated with chemical abortions.\n\nIn a letter addressed to newly confirmed FDA Commissioner Dr. Marty Makary, Hawley references a comment he made during his confirmation hearing about considering policy changes in light of new evidence.\n\n“If the data suggests something or tells us that there’s a real signal, we can’t promise we’re not going to act on that data,” the letter states.\n\nA STUDY IS CLAIMING WOMEN WHO USED  MIFEPRISTONE…THE MOST WIDELY USED DRUG IN MOST ABORTIONS…SAW MORE SERIOUS SIDE EFFECTS REPORTED FROM WOMEN OVER A SIX YEAR PERIOD THAN OTHER STUDIES HAVE PREVIOUSLY SHOWN.\n\nTHE ANALYSIS WAS RELEASED ON APRIL 28 FROM THE ETHICS AND PUBLIC POLICY CENTER, A CONSERVATIVE NONPROFIT.\n\nITS AUTHORS SAY NEARLY 1 IN 10 WOMEN WHO TOOK THE PILL EXPERIENCED AN ADVERSE REACTION WITHIN 45 DAYS OF THE PROCEDURE.\n\nTHE RESEARCH SAYS INFECTIONS SUCH AS SEPSIS AND HEMORRHAGING WERE REPORTED FROM NEARLY 866 THOUSAND ABORTIONS THROUGH DATA COLLECTED FROM INSURANCE CLAIMS BETWEEN 2017 AND 2023.\n\nTHE STUDY USED INSURANCE CLAIMS FROM MANY PRIVATE PLANS, MEDICARE AND MEDICAID, MILITARY INSURANCE, AND DEPARTMENT OF VETERANS AFFAIRS. IT DIDN’T HAVE DATA ON CASH-ONLY PURCHASES, SOMETHING THE NONPROFIT SAYS IS DISPROPORTIONATELY COMMON IN PURCHASES OF THE DRUG.\n\nMIFEPRISTONE WAS FIRST APPROVED BY THE FDA IN THE U.S. TWENTY FIVE YEARS AGO IN 2000. ITS CLEARANCE ALLOWED ITS USE UP TO SEVEN WEEKS INTO A WOMAN’S PREGANANCY, THE AGENCY LATER EXTENDED THAT WINDOW TO TEN WEEKS IN 2016.\n\nA GENERIC PILL WAS LATER APPROVED IN 2019 BY THE FDA.\n\nEPPC WORKS WITH LAWMAKERS AND SOME AMERICANS TO IMPLEMENT VIEWS BASED ON SOME JEWISH AND CHRISTIAN PRINCIPLES WHICH THEY SAY SHOULD INFLUENCE THE FOOD AND DRUG ADMINISTRATION TO MAKE A CHANGE.\n\nTHE STUDY ACTS AS A CALL TO ACTION TO THE FDA, URGING THE AGENCY TO REINSTATE STRICTER SAFETY RESTRICTIONS AND POSSIBLY RECONSIDER THE DRUG’S WIDE REACHING APPROVAL. .\n\nTHE GROUP CLAIMS, THE DATA SHOWS WHAT’S WRITTEN ON THE DRUG’S LABEL DOESN’T MATCH THE EXPERIENCE OF WHAT WOMEN ARE REPORTING.\n\nTHEY ALSO WARN THAT LOOSENED REGULATIONS INCLUDING AN OPTION IMPLEMENTED DURING THE BIDEN ADMINISTRATION TO ORDER THE PILL ONLINE OR RECEIVE IT BY MAIL IS PUTTING MORE WOMEN AT RISK.\n\nTHE GUTTMACHER INSTITUTE, A POLICY AND RESEARCH GROUP THAT SUPPORTS GLOBAL ABORTION ACCESS HAS A DIFFERENT VIEWPOINT.\n\nIN 2023, THE ORGANIZATION CITES TO DATA AND YEARS WORTH OF RESEARCH IN SHOWING MIFEPRISTONE IS SAFE AND ACTUALLY PROTECTS WOMEN’S HEALTH.\n\nTHE WORLD HEALTH ORGANIZATION HAS A SIMILAR STANCE, THE AGENCY CALLS THE MEDICATION ESSENTIAL TO ITS EFFORTS OF COMBATING UNSAFE ABORTION METHODS FOR VULNERABLE WOMEN.\n\nFIND THE LATEST, UNBIASED NEWS UPDATES ON THE STRAIGHT ARROW NEWS MOBILE APP.\n\nThis story matters because it raises questions about the safety of mifepristone, and the regulatory practices surrounding its approval and use, while also highlighting the established science and studies behind the drug.\n\nUnderstanding the safety and risks associated with mifepristone is crucial for the health and safety of women who rely on this medication for abortions.\n\nThe debate over mifepristone's approval process and the call for tighter regulations highlights the ongoing tensions in health policy regarding access to reproductive healthcare.\n\nThe differing perspectives on mifepristone, particularly between entities like the Ethics and Public Policy Center and organizations advocating for reproductive rights, reflect the broader national divide over abortion-related issues.\n\nSynthesized coverage insights across32media outlets\n\nLocal communities and organizations advocating for women's health are voicing concerns over the findings related to mifepristone. Anti-abortion activists argue for reinstating stricter regulations and a ban on mifepristone due to high complication rates, while pro-choice groups advocate for continued access to the abortion pill, emphasizing its necessity in healthcare.\n\nHistorically, mifepristone was fast-tracked for approval by the FDA in 2000 under a special protocol due to its implications for managing unwanted pregnancies, reflecting the societal attitudes toward abortion at that time. The drug's approval has undergone significant regulatory changes influenced by political administrations, impacting women's access to safe medical care.\n\nMifepristone has been a focal point of controversy since its approval, revealing how drug regulations can be influenced by political climates. Historical attempts to regulate its use have highlighted consistent pressure from both anti-abortion and pro-choice factions, leading to ongoing debates concerning women's health and safety rights.\n\nNo summary available because of a lack of coverage.\n\nNo summary available because of a lack of coverage.\n\nNo summary available because of a lack of coverage.\n\nAbortion pills 22 times more dangerous than billed on warning label, study finds\n\nOne in 10 chemical abortions end in serious health complications: report\n\nAre the FDA and drugmakers covering up the abortion pill’s risks?\n\nManipulation of figures on abortion revictimizes pregnant women and unborn children: UNNA\n\nStudy Claims Abortion Pill Linked To High Rate Of Serious Adverse Events\n\nThe abortion pill’s body count — and the progressive cover-up behind it\n\nAbortion Pill Complication Rate 22 Times Higher Than FDA Claims\n\nAbortion Pill Complications Higher Than Reported on Drug Label\n\nAbortion Pill 22 Times More Dangerous Than FDA Reports\n\nAfter Legislature shields abortion pill prescribers, study cites high complication rate – Vermont Daily Chronicle\n\nStudy of 865,000 abortion pill patients: 11% suffer ‘serious adverse events’\n\n10 Percent of Women Experience ‘Serious Adverse Event’ After Taking Abortion Pill, Study Says | The Star News Network\n\nStudy: Rate Of Serious Or Life-Threatening Complications After Abortion Pill Is 22 Times Higher Than FDA Claims\n\nReport: Risky Abortion Drugs Far More Harmful Than FDA Shows – SBA Pro-Life America\n\nStudy of over 865,000 abortion pill patients: 11% suffer ‘serious adverse events’\n\n10 Percent of Women Experience 'Serious Adverse Event' After Taking Abortion Pill, Study Says – The Virginia Star\n\nStudy: OB-GYNs didn’t leave states with pro-life laws after ‘Dobbs’\n\nAbortion Reporting: Illinois (2023) – Lozier Institute\n\n‘Abortion pill’ found to have ‘severe adverse effects’ for 1 in 10 women, study finds\n\nShocking Data Suggests Abortion Pill Injuries 22 Times Higher Than Reported\n\n'Not safe': Serious adverse events from abortion pill are 22 times higher than claim on label * WorldNetDaily * by Ireland Owens, Daily Caller News Foundation\n\nThePatriotLight – Study Shows Risks of Chemical Abortions MASSIVELY Understated With One In TEN Facing Complications – Twitchy\n\nStudy: Women Who Take Abortion Pills 22 Times More Likely to Die\n\nSevere abortion pill complications 22 times higher than FDA discloses, study finds\n\nManipulation of figures on abortion revictimizes pregnant women and unborn children: UNNA\n\nStudy: Rate Of Serious Or Life-Threatening Complications After Abortion Pill Is 22 Times Higher Than FDA Claims\n\nSEN. DAINES: Science is clear, abortion pill not safe for women – The Iowa Standard\n\nNEW STUDY: Nearly 11% of women suffer 'serious adverse events' after taking abortion pill\n\nAAF: Congress Should Raise Ten Questions on the Abortion Drug – EPPC Study Shows 22 Times More Adverse Events Than FDA Let On – Advancing American Freedom\n\nNew Study Exposes Hidden Dangers of Abortion Pill, Contradicting Planned Parenthood Safety Claims\n\nThe Supreme Court issued its first major ruling on abortion in two years. And former President Donald Trump returns to Capitol Hill, holding separate meetings with Senate and House Republicans. These stories and more highlight The Morning Rundown for Friday, June 14, 2024. Supreme Court preserves access to abortion pill In a unanimous decision, the U.S….\n\nReproductive rights are once again center stage in public discourse. While questions persist regarding access to the abortion pill mifepristone and in vitro fertilization (IVF), recent developments indicate that little has changed. Here’s a comprehensive look at the current landscape: Mifepristone access upheld In a unanimous decision, the U.S. Supreme Court ruled that mifepristone —…\n\nThe Supreme Court heard oral arguments in a case that could not only impact access to an abortion pill used by millions of women, but also change the way the Federal Drug Administration approves medicine. However, the justices raised serious questions about challenging the FDA’s approval process and about the plaintiffs standing to sue in…\n\nLast year, a Texas federal judge’s decision to revoke the Food and Drug Administration’s (FDA) approval of the abortion pill mifepristone ignited a nationwide controversy over abortion rights. The legal skirmish over the pill has escalated further following the retraction of a key scientific paper that played a pivotal role in the case. In 2021,…\n\nThe U.S. Supreme Court is set to hear its first abortion case since the controversial Dobbs decision that overturned Roe v. Wade. The high court announced it will hear oral arguments in the case on access to abortion drug, mifepristone, in March. Mifepristone is one of two abortion drugs used to end a pregnancy. “It…\n\nThree judges on the 5th U.S. Circuit Court of Appeals in New Orleans backed some limits on the abortion pill Mifepristone. However, the ruling on Wednesday, Aug. 16 cannot take effect until the Supreme Court weighs in. The appeals court ruling partially overturned a lower court ruling that revoked the Food and Drug Administration’s (FDA)…\n\nThe Supreme Court issued its first major ruling on abortion in two years. And former President Donald Trump returns to Capitol Hill, holding separate meetings with Senate and House Republicans. These stories and more highlight The Morning Rundown for Friday, June 14, 2024. Supreme Court preserves access to abortion pill In a unanimous decision, the U.S….\n\nReproductive rights are once again center stage in public discourse. While questions persist regarding access to the abortion pill mifepristone and in vitro fertilization (IVF), recent developments indicate that little has changed. Here’s a comprehensive look at the current landscape: Mifepristone access upheld In a unanimous decision, the U.S. Supreme Court ruled that mifepristone —…\n\nThe Supreme Court heard oral arguments in a case that could not only impact access to an abortion pill used by millions of women, but also change the way the Federal Drug Administration approves medicine. However, the justices raised serious questions about challenging the FDA’s approval process and about the plaintiffs standing to sue in…\n\nLast year, a Texas federal judge’s decision to revoke the Food and Drug Administration’s (FDA) approval of the abortion pill mifepristone ignited a nationwide controversy over abortion rights. The legal skirmish over the pill has escalated further following the retraction of a key scientific paper that played a pivotal role in the case. In 2021,…\n\nThe U.S. Supreme Court is set to hear its first abortion case since the controversial Dobbs decision that overturned Roe v. Wade. The high court announced it will hear oral arguments in the case on access to abortion drug, mifepristone, in March. Mifepristone is one of two abortion drugs used to end a pregnancy. “It…\n\nThree judges on the 5th U.S. Circuit Court of Appeals in New Orleans backed some limits on the abortion pill Mifepristone. However, the ruling on Wednesday, Aug. 16 cannot take effect until the Supreme Court weighs in. The appeals court ruling partially overturned a lower court ruling that revoked the Food and Drug Administration’s (FDA)…",
        "source_3": "A largest-of-its-kind study found that more than 10% of women who terminate their pregnancies with abortion pills experience serious health problems, even though the drug’s warning label puts the figure at less than 0.5%.\n\nThe analysis of insurance data from 865,727 prescriptions of mifepristone from 2017 to 2023 showed that within 45 days, 10.93% of women were treated for conditions including sepsis, hemorrhaging and infection, while 2.84% ended up undergoing a surgical abortion.\n\n“The real-world rate of serious adverse events following mifepristone abortions is at least 22 times as high as the summary figure of ‘less than 0.5 percent’ in clinical trials reported on the drug label,” said the Ethics and Public Policy Center, a conservative think tank, whichreleasedthe research Monday.\n\nThe study conducted by EPPC President Ryan T. Anderson and Jamie Bryan Hall, the center’s director of data analysis, recommended that the Food and Drug Administration reinstate the safety protocols weakened under the Biden and Obama administrations to expand abortion access.\n\n“In light of this research, we urge the FDA to reinstate earlier, stronger patient safety protocols and reconsider its approval of mifepristone altogether,” the study’s authors wrote. “Women deserve better than the abortion pill.”\n\nThe warning label for Mifeprex, the brand name for mifepristone manufactured by Danco Laboratories, says that the 0.5% figure for serious adverse reactions is based on six U.S. and four non-U.S. clinical studies totaling 30,966 women — far fewer than the number in the EPPC analysis.\n\nThe FDA-approved label is also based on data “from trials taking place more than a decade ago,” the EPPC analysis says.\n\n“Danco Laboratories markets Mifeprex as ‘the safe and effective abortion pill,’ but our research shows that mifepristone abortion, as currently practiced in the U.S., is not safe and effective,” said the study.\n\nThe Washington Times has reached out to Danco Laboratories and the FDA for comment.\n\nMore than 5 million women have used Mifeprex since the drug received FDA approval in 2000. The drug is 97% effective in terminating pregnancies, with 3% of women requiring surgical intervention afterward, according to Danco Laboratories.\n\n“Danco remains confident in the safety and effectiveness of Mifeprex® under the 2023 REMS that currently governs its use,” the drug manufacturer said in a December 2023statement.\n\nThe two-drug abortion protocol of mifepristone and misoprostol has become the most common method of elective pregnancy termination, representing 63% of all U.S. abortions, up from 53% in 2020, according to data from the pro-choice Guttmacher Institute.\n\nThe FDA approved mifepristone for abortions in 2000, but with a slew of precautions, including requiring doctors to prescribe and dispense the drugs in person at their medical offices. The initial protocol also required a follow-up visit and reporting of any adverse events.\n\nBy 2023, however, those safeguards had all been eliminated, allowing the drugs to be prescribed online and delivered by mail to homes, with no follow-up requirements.\n\nThe maximum gestational age for pill-induced abortions has also been increased from seven weeks to 10 weeks.\n\nOur team analyzed 865,727 mifepristone abortions (2017—2023), 28 times larger than all FDA clinical trials combined.Here’s what we found:· 10.93% of women experienced severe or life-threatening events within 45 days of taking Mifepristone, including sepsis, hemorrhage, blood…pic.twitter.com/3EAoGf0R75\n\nThe study found that 0.10% of women suffered sepsis and 1.34% had infections; 3.31% were treated for hemorrhaging; 0.15% received transfusions; 0.66% were hospitalized; 4.73% visited the emergency room, and 0.22% had “other life-threatening events.”\n\nThose figures are significantly higher than thoselistedon the Mifeprex warning label, which place the U.S. occurrence of sepsis at 0.2%; ER visits at 2.9-4.6%, and hospitalizations at 0.04-0.6%. Hemorrhages were described as “not reported.”\n\nThe research also showed that 0.35% of women who took the pills had ectopic pregnancies, a rare but potentially life-threatening condition in which the fertilized egg implants outside the uterus.\n\nThe FDA has warned that women with ectopic pregnancies should not take mifepristone, but the condition is typically detected through an ultrasound or blood test, which requires an in-person medical visit.\n\nFrom 2000-24, 36 women died after taking mifepristone,includingtwo cases of ectopic pregnancy and several cases of sepsis, according to the agency.\n\nAt the same time, the FDA said the deaths “cannot with certainty be causally attributed to mifepristone because of concurrent use of other drugs, other medical or surgical treatments, co-existing medical conditions, and information gaps about patient health status and clinical management of the patient.”\n\nDr. Christina Francis, CEO of the American Association of Pro-Life OBGYNs, said the EPPC study is consistent with what she has observed in her two decades in practice, which includes caring for women who have “suffered significant complications” from the drugs.\n\n“This should serve as a wake-up call for the FDA that the complication rate is over 20 times higher than what it has previously stated and is a public health crisis that should be investigated immediately,” said Dr. Francis in a statement. “Women deserve informed consent about the potentially life-threatening dangers of these drugs.”\n\nHer organization was among those that sued to overturn the FDA’s 2000 approval of mifepristone, but the Supreme Court threw out the case last year over a lack of standing.\n\nCorrection: A previous version of the story incorrectly stated the gestational age at which abortion pills may be used. The story has been updated with the correct information.\n\n• Valerie Richardson can be reached atvrichardson@washingtontimes.com.\n\nCopyright © 2025 The Washington Times, LLC.Click\n                            here for reprint permission.\n\nPope Leo should tell Catholics: Marry young, have many children\n\nTrump’s TikTok delays undermine his China hawks while Intel controversy grows"
    }
}