{
    "question": "How might the swift move to nominate Mike Waltz as UN ambassador just hours after his dismissal as national security adviser affect his Senate confirmation prospects, U.S. credibility at the UN, and perceptions of the administration’s handling of the “Signalgate” incident?",
    "content": {
        "source_1": "President Donald Trumphas nominatedMike Waltzto be the next U.S Ambassador to theUnited Nationsjust hours after firing him as national security advisor.\n\nWaltz was axed after accidentally adding The Atlantic editor Jeffrey Goldberg to a group chat discussing an impending strike on Iran-backed rebels on the Signal messaging app.\n\nBut rather than being shelved on Thursday, he was quickly shuffled back into another top job.\n\nTrump waited for weeks before relieving his security chief from his duties and he made no comment on the “Signalgate” debacle before reassigning him.\n\nThe president revealed the former congressman’s new job on Thursday afternoon, posting on Truth Social: “I am pleased to announce that I will be nominating Mike Waltz to be the next United States Ambassador to the United Nations. From his time in uniform on the battlefield, in Congress and, as my National Security Advisor, Mike Waltz has worked hard to put our Nation’s Interests first. I know he will do the same in his new role.\n\n“In the interim, Secretary of State Marco Rubio will serve as National Security Advisor, while continuing his strong leadership at the State Department. Together, we will continue to fight tirelessly to Make America, and the World, SAFE AGAIN. Thank you for your attention to this matter!”\n\nRubio will be acting as national security advisor until a full-time replacement is named. Special envoy Steve Witkoff and Kennedy Center head Ric Grenell are among those tipped for the position.\n\nIronically, Rep. Elise Stefanik was originally set to take the United Nations job but was asked by Trump to remain in Congress to preserve the slim GOP majority. Waltz gave up his congressional seat to serve as national security advisor.\n\nWaltz was left red-faced after his role was revealed in the Signal saga. He was branded a “f---ing idiot’ by a White House insider for accidentally including the journalist on the White House group that shared information about a military attack being planned against the Houthi rebels in Yemen.\n\nThe strike was not wrecked by the blunder but Trump was said to be furious over the humiliation involving his national security team.\n\nI’m deeply honored to continue my service to President Trump and our great nation.pic.twitter.com/FFTPjnIYkI\n\nWaltz was the first to be pushed out of his job but the quick shake-up meant he wasn’t out of work for long.\n\nAccording to CNN, Trump decided against firing Waltz right away because he didn’t want to hark back to the kind of chaos his first term was infamous for.\n\nJust hours before getting the axe, Waltz was still talking in glowing terms about his boss. After learning that he was being nominated for the UN with its swanky New York residence, he posted on X: “I’m deeply honored to continue my service to President Trump and our great nation.”\n\nNo details were revealed on the fate of Waltz’s deputy, Alex Wong, who is also reportedly departing.",
        "source_2": "US National Security AdviserMike Waltz will leave his postand be nominated to serve as ambassador to the United Nations, President Donald Trump says\n\nWaltz created the Signal group chat, to whicha journalist was inadvertently added, where high-ranking officials planned military strikes in Yemen\n\nTrump's team previously downplayed the security risks and said no classified material was shared in the chat\n\nThe White House appears to havewaited for the Signalgate dust to settle before taking action, writes North American correspondent Anthony Zurcher\n\nThe move comes in the same week Trump has celebrated his first 100 days in office\n\n'Well there you go' - watch moment spokeswoman learns Waltz news\n\nIt has been a whirlwind day here in Washington so let's try to catch you up on how it all went down:\n\nWe'll shortly be pausing our live coverage of developments from the White House, but you can stay up to date with our storyhere.\n\nDonald Trump has just boarded a US Air Force plane, en route to deliver a commencement address at the University of Alabama in Tuscaloosa.\n\nTrump didn't respond to shouted questions from reporters at Joint Base Andrews, or on the White House lawn.\n\nA Reuters photo taken by journalist Evelyn Hockstein at the White House on Wednesday appears to show Mike Waltz, JD Vance, and other senior officials have continued to use the messaging app Signal to communicate, weeks after a journalist was inadvertently added to a group chat.\n\nA photo shows Waltz checking his phone during yesterday's mammoth televised cabinet meeting. When zoomed in, the screen shows ongoing conversations with a contact saved under the name JD Vance.\n\nThe message from the Vance contact read in part:\"I have confirmation from my counterpart it's turned off. He is going to be here.\"\n\nAs a reminder, a defence department memo warned in March that Signal could be vulnerable to Russian hackers and is \"NOT approved to process or store nonpublic unclassified information.\"\n\nThere is no suggestion Waltz's use of the application during the cabinet meeting was in breach of the policy.\n\nThe screen also shows a voice call that morning between Waltz and a contact saved under the name Tulsi Gabbard, who is the director of national intelligence.\n\nWe are learning more about the departure of Mike Waltz from his position as national security adviser, and the future of deputy Alex Wong, after sources spoke to the BBC's US news partner CBS.\n\nThey report that it hasn't been decided who will replace Waltz, and it was a last-minute decision to nominate him as UN ambassador. It was so last minute, sources say, that White House officials had been speaking to other people about assuming the UN post in days in recent days.\n\nTrump reportedly made the decision on Thursday morning, taking action later in the day.\n\nThere had been previous senior-level discussions on removing Waltz from the security role, according to CBS. Reasons for him being removed include the Signal chat situation, a lack of good fit between Waltz and the senior team, and that he didn't vet staff correctly.\n\nHowever, Trump still respects Waltz, as can be seen through the more low-key firing and re-hiring done today, sources say.\n\nAs for deputy Alex Wong, it remains unclear if he will stay at the National Security Council.\n\nThe role of Donald Trump's national security adviser role has been filled by a variety of faces over the years, some lasting longer than others.\n\nThe man of the hour. He will be temporarily replaced by Marco Rubio.\n\nOâBrien was hired by the Trump administration in September 2019 and stayed until the end of his first term in 2021.\n\nKupperman took over for a short stint after his predecessor John Bolton left the post after clashing with Trump.\n\nBolton was Trumpâs longest serving national security adviser, but the two had major foreign policy disagreements.\n\n\"I asked John for his resignation, which was given to me this morning,\" Trump tweeted in September 2019.\n\nA former army general, McMaster was another adviser that did not get along with Trump.\n\nTrump had referred to the armylieutenant general's briefingsas \"gruff and condescending\", a source told CNN.\n\nLike Kupperman, Keith Kellog was the interim adviser after Trump sacked Michael Flynn.\n\nOn the job for just under a month, Flynn resigned in February 2017 over allegations of collusion with Russia before Trump took office.\n\nMarco Rubio already wears many hats in the Trump administration, but is set for another as he steps into the interim post ofnational security adviser.\n\nThis means he will be the key adviser to the president on all national security matters.\n\nHis most prominent role until now wassecretary of state.\n\nThis has seen him play a key role in international diplomacy, from getting a minerals deal with Ukraine over the line, to attempting to negotiate a ceasefire and hostage release deal in Gaza.\n\nRubio also advises the president on foreign policy and oversees the management of embassies and consulates.\n\nHis new role means he'll have four positions in government. The others are asActing Archivistat the National Archives and Records Administration andActing Administratorof the US Agency for International Development\n\nNews of Waltz's nomination to the UN is still fresh, and we don't know yet whether he will be confirmed by the Senate.\n\nBut already, the chatter already among many in Washington is that the move, perhaps, provides a quiet way for Trump to dispose of Waltz without having to publicly fire him.\n\nSeveral staffers at various government departments contacted by the BBC - but who wished to remain anonymous - have told me similar versions of the theories, although none wanted to be quoted or provide evidence.\n\nWhile this is little more than rumour at the moment, it would be a politically-savvy move from an administration that has sought to portray itself as a more disciplined, cohesive one than what we saw during Trump 1.0.\n\nThis cabinet, after all, are his picks, rather than those thrust upon him. Democrats are already using the reshuffling to point to chaos in the administration, and publicly firing Waltz over any perceived infraction or disagreement would have added fuel to the fire.\n\nAnother possibility is that - even if he does get confirmed - having Waltz at the UN puts him in a position that is ultimately less influential to day-to-day policy than being national security adviser.\n\nThis city is one in which rumours spread quickly, however, and for now this is all speculation.\n\nWe just heard from Trump's former National Security Adviser John Bolton, who describes the day's events as \"chaos\" reminiscent of the president's first term.\n\n\"This is highly unusual,\" Bolton told the BBC, commenting on Waltz's proposed move from national security to the UN. \"It's not a normal line of progression.\"\n\nBolton was the longest serving national security adviser under Trump, resigning after less than two years in 2018.\n\nHe said the disarray of that first term is âseeping into the second term right after the first 100 daysâ.\n\nMiddle East envoy Steve Witkoff, whose name is being thrown around as a possible replacement for Waltz in the long term, also \"knows nothing\" about major policy issues, Bolton added.\n\nDemocrats and Republicans are, naturally, divided over news of this reshuffle in the administration.\n\nRepublican Congressman Brian Mast says \"there is no one in Washington the unaccountable UN bureaucrats fear more than Mike Waltz. He will fight to put America First every single day at the UN\".\n\nHowever, Democratic Rep Brad Schneider from Illinois is concerned that Secretary of State Marco Rubio will have too much to juggle as he takes on the additional role of national security adviser.\n\nHe adds: \"The job of the National Security Adviser is more than a full-time job. The same is true for Secretary of State.\n\nThe President is not taking our national security seriously.\"\n\nIt's important to note that the UN ambassador position that Trump says he'll nominate Mike Waltz for will require confirmation by the US Senate.\n\nSenate confirmation hearings are sometimes long, gruelling affairs intended to thoroughly vet candidates nominated to high-ranking positions.\n\nThey often dredge up professional missteps or even pry into the personal lives of nominees (Defence Secretary Pete Hegseth wasamong Trump's cabinet picks to come under intense scrutiny earlier this year).\n\nSimilarly, Waltz will have to go through a hearing and be questioned by a committee of senators before they vote on whether to confirm him.\n\nâSignalgate will now be a major part of Mike Waltz confirmation process,â Former Trump National Security Adviser John Bolton told the BBC.\n\nAbout a month ago, Trumppulled the nomination of New York Rep Elise Stefanikto serve as the US ambassador to the United Nations.\n\nMike Waltz has responded after President Trump confirmed he would no longer be US national security adviser, and instead be nominated for UN ambassador.\n\n\"Iâm deeply honoured to continue my service to President Trump and our great nation,\" he said on social media.\n\nHe posted the short statement on X, alongside a screenshot of the announcement by Trump.\n\nWatch: State Department spokesperson learns of Waltz news from reporter\n\nState Department spokesperson Tammy Bruce just found out about Mike Waltz's job change at the same time as the rest of us.\n\nAt a press conference where she's been speaking, a reporter read out Trump's Truth Social post. Bruce didn't have much to add.\n\n\"I just heard this from you,\" she says, calling it an \"exciting moment\".\n\nThe journalist went on to ask how long Secretary of State Marco Rubio would be handling Waltz's old duties as national security adviser on top of his own.\n\nBruce says she didn't know, but that she was confident it would work out.\n\nâThis is a man who has worn several hats since day one,\" she says. \"The president makes perfect assessments on who will implement his agenda.\"\n\nPresident Trump has just announced that Mike Waltz will no longer be his national security adviser and will be nominated to serve as the US ambassador to the United Nations.\n\nI am pleased to announce that I will be nominating Mike Waltz to be the next United States Ambassador to the United Nations. From his time in uniform on the battlefield, in Congress and, as my National Security Advisor, Mike Waltz has worked hard to put our Nationâs Interests first.  \"I know he will do the same in his new role. In the interim, Secretary of State Marco Rubio will serve as National Security Advisor, while continuing his strong leadership at the State Department.  \"Together, we will continue to fight tirelessly to Make America, and the World, SAFE AGAIN. Thank you for your attention to this matter!\"\n\nUS President Donald Trump has posted on Truth Social, announcing that he will nominate Waltz to be \"the next United States Ambassador to the United Nations\".\n\nContinuing his post, Trump adds that Secretary of State Marco Rubio will also serve as national security adviser in the meantime.\n\nIt comes hours after reports said he was stepping down from the role as national security adviser.\n\nSignalgate, the Trump administration's first so-called scandal did not result from a sophisticated hacking or espionage, but rather a series of mishaps.\n\nSources told the BBC's US partner CBS News and the Guardian that National Security Adviser Mike Waltz was trying to add a top spokesman to the Signal chat when he inadvertently added Atlantic editor Jeffrey Goldberg to a sensitive group where top officials were discussing plans to strike Yemen.\n\nInvestigators reportedly found that Goldberg's number had been accidentally saved in Waltz's phone as an alternative contact for national security spokesman Brian Hughes.\n\nWhen Waltz went to assemble the Signal group chat in March 2025, Waltz believed he was adding Hughes, the sources said. But it was actually Goldberg's number added to the conversation.\n\nWaltz told Fox News last month that another, unnamed contact of his was supposed to be in the chat in Goldberg's place and that \"100% I don't know this guy\".\n\nGoldberg has previously refuted that explanation, and has said the two have met several times.\n\nIn the aftermath of the Signal revelations, Waltz took responsibility. \"I built the group,\" Waltz told Fox News, adding it was \"embarrassing\".\n\nWe can bring you comments as more leading Democrats react to Waltz's reported departure.\n\n\"Trump is ousting his National Security Advisor Mike Waltz,\" House Minority Leader Hakeem Jeffries said in a post on BlueSky.\n\n\"Next up?\n\nThe woefully unqualified Secretary of Defense must resign or be fired immediately.\"\n\nSince The Atlantic broke the Signal group chat story, Democrats have been calling for senior officials who were part of the group chat to leave their jobs over the security breach.\n\n\"Pete Hegseth shows real leadership by passing the blame to Mike Waltz,\" Massachusetts Senator Elizabeth Warren said on X following the news of Waltz's exit.\n\nThere has been recent reporting since The Atlantic story that Hegseth also had another Signal chat group  that included his wife and brother where he shared information about air strikes against Yemen.\n\nâI think theyâre holding the wrong guy accountable,\" Arizona Senator Mark Kelly told CNN referring to Hegseth.\n\nMinnesota governor and former Democratic vice-presidential candidate Tim Walz has made light of the national security adviser's exit.\n\nThe two have history after Waltz during the election campaign accused the governor of exaggerating and lying about his career in the National Guard.\n\nIn August, the Harris campaign separatelyacknowledged that Walz had \"misspoke\" in 2018when he said he carried assault weapons \"in war\".\n\nThe Democratic Party on X also couldn't resist having a bit of fun, posting an image of a group chat saying \"Donald J. Trump removed Michael Waltz\" and another image saying \"Michael Waltz was ejected\".\n\nWe still do not have any official confirmation about Waltz leaving his post. But that hasn't stopped speculations about his replacement in that crucial role.\n\nThe job typically goes to individuals with a military, national security, or diplomatic background. But Trump has been known to make unorthodox hiring decisions.\n\nUS media reports suggestSteve Witkoff,the real estate developer and Trump ally who is currently a US Special Envoy to the Middle East, as a potential replacement. Though he did not previously have diplomatic experience, Trump appointed him to negotiate a ceasefire deal between Israel and Hamas, and dispatched him to Russia to serve as his personal envoy to Vladimir Putin.\n\nAnother name doing the rounds is also one of Trumpâs special envoys,Ric Grenell,who has a longer diplomatic track record. In Trumpâs first term, he served as US ambassador to Germany and later acting director of national intelligence, a high-profile national security role. This time around, Trump has sent him to negotiate with Venezuela over the return of migrants who came to America, and bringing back US citizens held in the country.\n\nThe prayer meeting at the White House has concluded, with artists singing Amazing Grace and audience members joining them.\n\nWe didn't hear anything from President Trump about Mike Waltz. He did not respond to shouted questions from reporters either.\n\nDuring his speech he mentioned several other administration officials, though.\n\nWe will update you if we hear anything further from the president or from official channels at the White House.\n\nMike Waltz's principal deputy national security adviser Alex Wong avoided questions on the Signal group chat scandal when interviewed by BBC's Newsnight programme on Wednesday.\n\nWhen asked by host Adam Fleming if the Signal chat including a journalist made America safer, Wong said: \"The key point here is that chat you referenced was about opening up freedom of navigation and executing an operation that so far has been very successful...\"\n\nWhen pressed again about the security breach, Wong continued to praise Trump's achievements on the world stage.",
        "source_3": "Mike Waltz is out as the national security advisor, along with his deputy. Chief national security correspondent Jennifer Griffin reports the latest on the ousting and what's likely to come.\n\nTrump administration national security advisor Mike Waltz and other staffers are out at the National Security Council, sources confirmed to Fox News.\n\nFox News confirmed Waltz and his deputy, Alex Wong, were ousted Thursday. Sources said additional staffers removed from the office will likely be announced, and PresidentDonald Trumpis expected to speak publicly about the matter.\n\nWaltz, who previously served as a Florida congressman and as a decorated combat Green Beret, has come under fire from Democrats and critics since March, when The Atlantic magazine's Editor-in-Chief Jeffrey Goldberg published a firsthand account of getting added to a Signal group chat with topnational security leaders, including Waltz, Secretary of Defense Pete Hegseth and CIA Director John Ratcliffe, while they discussed strikes against Yemen terrorists.\n\nWaltz took responsibility for the inclusion of a journalist in the group chat, telling Fox News' Laura Ingraham, \"I take full responsibility. I built the group,\" he said. \"It's embarrassing. We're going to get to the bottom of it.\"\n\nWhite House press secretary Karoline Leavitt told Fox News Digital earlier Monday when asked about reports claiming Waltz and others would be shown the door, \"We are not going to respond to reporting from anonymous sources.\"\n\nWALTZ DOUBLES DOWN ON HEGSETH PRAISE AMID ONGOING PENTAGON CONTROVERSY\n\nTrump administration national security advisor Mike Waltz, left, and other staffers are out at the National Security Council, sources confirmed to Fox News.(Reuters)\n\nTrump held a meeting with members of his cabinet on Wednesday following his 100th day back in office on Tuesday, with Waltz attending the meeting.\n\nFollowing confirmation of Waltz's ouster, House Minority Leader Hakeem Jeffries, D-N.Y., told Fox News, \"The National Security Advisor Waltz is out. He’s the first. He certainly won’t be the last.\"\n\nWong served as Waltz's principal deputy national security advisor, who was detailed in the Signal chat leak as the staffer charged with \"pulling together a tiger team\" in Waltz's initial message sent to the Signal group chat in March, The Atlantic reported at the time.\n\n\"Team – establishing a principles [sic] group for coordination on Houthis, particularly for over the next 72 hours,\" Waltz wrote in the group chat. \"My deputy Alex Wong is pulling together a tiger team at deputies/agency Chief of Staff level following up from the meeting in the Sit Room this morning for action items and will be sending that out later this evening.\"\n\nTrump told the media on April 3 that a handful of other National Security Council staffers had been let go following the Atlantic's report on the Signal chat leak, which characterized the Trump administration as texting \"war plans\" regarding a planned strike on Houthi rebelsin Yemen.\n\nTRUMP REVEALS WHO WAS BEHIND SIGNAL TEXT CHAIN LEAK\n\n\"Always, we’re going to let go of people we don’t like, or people we don’t think can do the job, or people who may have loyalties to somebody else,\" Trump said from Air Force One on April 3 when asked about reports on the National Security Council firings.\n\nTrump confirmed at the time that National Security Council members had been fired, but remarked it was not many individuals. He added that he continued to trust his National Security Council team, remarking that they've \"done very well\" and \"had big success with the Houthis.\"\n\nThe Trump administration maintained that no classified material was transmitted in the Signal chat in March, with President Donald Trump repeatedly defending Mike Waltz amid the fallout.(The White House)\n\nThe Trump administration maintained, however, that no classified material was transmitted in the Signal chat in March, with Trump repeatedly defending Waltz amid the fallout. The strikes onHouthi rebelsunfolded on March 15.\n\nWILL CAIN SHARES HIS TAKEAWAY ON THE ATLANTIC'S STORY ON THE TRUMP ADMIN'S 'WAR PLANS' TEXT\n\nLeavitt told the media in March that the White House considered the Signal group chat leak case \"closed\" while continuing to offer support to Waltz, whose office allegedly mistakenly added the journalist to the chat.\n\nNational security advisor Mike Waltz speaks as he sits with President Donald Trump during an Ambassador Meeting in the Cabinet Room of the White House in Washington, D.C., on March 25.(Win McNamee/Getty Images)\n\n\"As the president has made it very clear, Mike Waltz continues to be an important part of his national security team,\" Leavitt told the media in brief remarks during a gaggle outside the White House's press room on March 31. \"And this case has been closed here at the White House, as far as we are concerned.\"\n\n\"There have been steps made to ensure that something like that can obviously never happen again,\" she continued. \"And we're moving forward. And the president and Mike Waltz and his entire national security team have been working together very well, if you look at how much safer the United States of America is because of the leadership of this team.\"\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}