{
    "question": "What are the potential economic and strategic implications of the U.S.–Ukraine agreement that grants U.S. access to Ukrainian rare earth minerals while preserving Kyiv’s control and establishing a reconstruction investment fund?",
    "content": {
        "source_1": "The United States and Ukraine have signed an “economic partnership agreement” that will give Washington access to Kyiv’s mineral resources in exchange for establishing an investment fund in Ukraine.\n\nThe US and Ukraine have been trying to hammer out thenatural resources dealsince US President Donald Trump returned to the White House in January.\n\nCompared to earlier drafts, the final agreement is reportedly less lopsided in favor of the US and is not as far-reaching. It stipulates that future American military assistance to Ukraine will count as part of the US investment into the fund, rather than calling for reimbursement for past assistance.\n\nThe deal comes after weeks of intense negotiations that at timesturned bitterand temporarily derailed Washington’s aid to Ukraine.\n\nRelated articleA ‘historic economic partnership?’ What we know about Trump’s Ukraine mineral deal\n\nSpeaking Wednesday in a call with NewsNation, Trump said he made the deal to “protect” Washington’s contribution to the Ukrainian war effort. “We made a deal today where we get, you know, much more in theory, than the $350 billion but I wanted to be protected,” Trump said. “I didn’t want to be out there and look foolish.”\n\nTrump has falsely claimed that the US has given Ukraine $350 billion since Russia fully invaded its neighbor in February 2022. The actual figure is around $120 billion, according to the Kiel Institute for the World Economy.\n\nThe US president said he told his Ukrainian counterpart Volodymyr Zelensky during their weekend meeting on the sidelines of Pope Francis’ funeral that “it’s a very good thing” if he signed the deal because “Russia is much bigger and much stronger.”\n\nAmong the terms of the agreement are “full ownership and control” of the resources staying with Ukraine, according to Kyiv’s Economy Minister Yulia Svyrydenko, who went to Washington to sign on behalf of the Ukrainian government.\n\n“All resources on our territory and in territorial waters belong to Ukraine,” she said, adding: “It is the Ukrainian state that determines what and where to extract. Subsoil remains under Ukrainian ownership – this is clearly established in the Agreement.”\n\nThe signing comes hours after a last-minute disagreement over which documents to sign Wednesday threatened to derail the deal.\n\nThe details of the agreement have not been made public. However, Ukraine’s Prime Minister Denys Shmyhal said on Sunday that the deal “will not include assistance provided before its signing.”\n\n“It is truly an equal and beneficial international agreement on joint investments in the development and recovery of Ukraine between the US and Ukrainian governments,” Shmyhal added.\n\nMeanwhile, the tone of the US Treasury Department’sannouncementof the deal showed more solidarity with Ukraine than previous statements from the Trump administration, referring to the war as “Russia’s full-scale invasion” of Ukraine.\n\n“As the President has said, the United States is committed to helping facilitate the end of this cruel and senseless war,” Treasury Secretary Scott Bessent said in a statement, calling it a “historic economic partnership.”\n\n“This agreement signals clearly to Russia that the Trump Administration is committed to a peace process centered on a free, sovereign, and prosperous Ukraine over the long term,” Bessent added. “And to be clear, no state or person who financed or supplied the Russian war machine will be allowed to benefit from the reconstruction of Ukraine.”\n\nBessent said the US looks “forward to quickly operationalizing” the agreement, but it’s not clear how swiftly new mining projects and collaborations can be launched as the war rages on.\n\nZelensky was expected to strike the deal during his trip to Washington in February – but the agreement was left unsigned when that visit was cut short following a contentiousOval Office meeting.\n\nAmong the key sticking point of the negotiations was the question of security guarantees – and whether the US would provide them as part of the deal. Trump initially refused that, saying he wants Ukraine to sign the agreement first and talk about guarantees later.\n\nAt that time, Zelensky described the draft agreement as asking him to “sell” his country. Ukrainian officials have since indicated they believed that US investment and the presence of American companies in Ukraine will make the US more interested in Ukraine’s security.\n\nShortly after the doomed White House visit, Trump ordered US aid to Ukraine to be suspended. While the assistance has since been restored, the episode became a major wakeup call for Ukraine’s European allies, who have pledged to step up their help to the country.\n\nRelated articleAfter Putin calls for three-day ceasefire, Trump reiterates demand for permanent Ukraine truce\n\nTrump had previously billed the agreement as Ukraine “paying back” for the aid the US has provided to Ukraine since Russia launched its unprovoked full-scale invasion of the country in February 2022.\n\nSpeaking to Fox News Wednesday, Bessent said the deal is “a signal to the American people, that we have a chance to participate, get some of the funding and the weapons, compensation for those.”\n\nUnder the deal, the US and Ukraine will create a joint investment fund in Ukraine with an equal contributions from both and equal distribution of management shares between them, Ukrainian Prime Minister Shmyhal said.\n\n“The American side may also count new, I emphasize new, military aid to Ukraine as a contribution to this fund,” Shmyhal added.\n\nKyiv’s allies have long eyed Ukraine’s mineral riches. The country has deposits of 22 of the 50 materials classed as critical by the US Geological Survey.\n\nThese include rare earth minerals and other materials that are critical to the production of electronics, clean energy technologies and some weapon systems.\n\nThe global production of rare earth minerals and other strategically important materials has long been dominated by China, leaving Western countries desperate for other alternative sources – including Ukraine.\n\nA memorandum of understanding prepared under the Biden administration last year said the US would promote investment opportunities in Ukraine’s mining projects to American companies in exchange for Kyiv creating economic incentives and implementing good business and environmental practices.\n\nUkraine already has a similar agreement with the European Union, signed in 2021.",
        "source_2": "Representatives from the United States and Ukraine say they signed a long-awaited deal that will create a joint fund to assist in Ukraine’s reconstruction andreportedlyallow the U.S. some access to Ukraine’s minerals, aftermonthsof negotiations.\n\nThe agreement creates the United States–Ukraine Reconstruction Investment Fund, which will be jointly managed with “50% of the revenues from new licenses in the field of critical materials, oil, and gas” in Ukraine being put into it, according to Yulia Svyrydenko, Ukraine’s economy minister.\n\nA draft of the agreement seen byReutersdetailed the U.S. getting “preferential access to new Ukrainian natural resources deals,” the outlet reported Wednesday.\n\nThe U.S. will also contribute to the fund through “direct financial contributions” and through military assistance to Ukraine, Svyrydenko said in a post announcing the deal had been signed, also noting “It is the Ukrainian state that determines what and where to extract.”\n\nThe Treasury Department said in astatementthe fund is in “recognition of the significant financial and material support that the people of the United States have provided to the defense of Ukraine since Russia’s full-scale invasion” and will help “accelerate Ukraine’s economic recovery.”\n\nThe agreement appears to be similar to the original deal that was set to be signed in February and indicated Ukraine would put 50% of the proceeds from its state-owned mineral resources into a fund that would be jointly owned with the U.S., and there were not security guarantees outlined for Ukraine, theBBCreported.\n\nThe deal originated after President Donald Trump indicated Ukraine could give the U.S. access to its minerals in return for U.S. support of Ukraine in its ongoing war with Russia and described the potential agreement as a reimbursement for the U.S.’ aid, theAssociated Pressreported.\n\nGet Forbes Breaking News Text Alerts:We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign uphere.\n\n“This agreement signals clearly to Russia that the Trump Administration is committed to a peace process centered on a free, sovereign, and prosperous Ukraine over the long term,” Treasury Secretary Scott Bessent said in avideoannouncing the agreement.\n\nUkraine President Volodymyr Zelenskyytraveledto the U.S. in February to reportedly sign the deal, but he left the White House without signing it after an Oval Office meeting between him and Trump ended in ashouting match. Zelenskyy put out astatementdays after the visit saying he wanted to end the war with Russia and that Ukraine was ready to sign the minerals deal and  saw it as “a step toward greater security and solid security guarantees.”\n\nIt’s not clear. Back in February, experts expressed concerns to Forbes about the cost and production times associated with mining raw materials, and some said the mining might not result in a huge payoff. Benchmark Minerals Intelligence rare earths pricing analyst George Ingall told Forbes the minerals the U.S. desired at the time “won’t be used to make a profit in the next 10 or 15 years.” Ingall also said it takes up to $2 billion to get a rare earth mineral mine operational. Even though a minerals deal may take time to financially benefit the U.S., obtaining the natural resources from Ukraine could help reduce the U.S.’ reliance on China and Russia to import the materials,The Guardianreported.\n\nUkraine’s Ministry of Environmental Protection and Natural Resourcessaidit has the number-one graphite and lithium reserves in Europe, with its graphite reserve making up 6% of the world’s total. Ukraine has also said it has the largest titanium and uranium reserves in Europe, and alleged its beryllium reserves are “capable of satisfying 40 years of the world's production.”\n\nUkraine has been at war with Russia since Russia invaded in February 2022, and the U.S. has given an estimated $66.5 billion in military assistance as of March. Trump has been critical of the aid former President Joe Biden gave to Ukraine and insisted the war never would have begun were he president at the time. Trump has also faced criticism for seeming to side with Russia and President Vladimir Putin, though he recently has been more critical of Putin,suggestingon social media Saturday Putin “doesn’t want to stop the war, he’s just tapping me along, and has to be dealt with differently.” During his campaign, Trump said he could end the war on his first day in office—though in a recent interview ahead of his 100th day in office, Trumpsaidhe made the comment “figuratively, and I said that as an exaggeration.” Trump and Zelenskyy had not publicly met since their blow up in February until this most recent weekend, when the pair sat down to talk at the funeral of Pope Francis. Trumpsaidon social media he had “a good day in talks and meetings with Russia and Ukraine,” and added: “They are very close to a deal.” Zelenskyy alsosaidon X the two had a “good meeting,” thanked Trump for talking and said they “discussed a lot.”\n\nUkraine Reportedly Agrees To Mineral Deal With U.S.—As Trump Pushes For Russia-Ukraine Ceasefire(Forbes)\n\nTrump’s ‘Big Deal’ For Ukraine Minerals? It Might Not Pay Off Soon—If Ever—Experts Say(Forbes)\n\nTrump-Zelenskyy Talks End Early After Trump Threatens Him In Tense Live Meeting: ‘Make A Deal Or We’re Out’(Forbes)",
        "source_3": "The United States-Ukraine Reconstruction Investment Fund will help accelerate Ukraine’s economic recovery, Treasury Secretary Scott Bessent said. (Credit: Treasury Secretary Scott Bessent via X)\n\nUkraine has signeda deal with the United States, giving the U.S. access to Ukraine's rare minerals as it continues to work with the Trump administration in an effort to end its three-year war with Russia.\n\nUkrainian Economy Minister and Deputy Prime Minister Yulia Svyrydenko flew to Washington, D.C., Wednesday to help finalize the deal.\n\n\"On behalf of the Government of Ukraine, I signed the Agreement on the Establishment of a United States–Ukraine Reconstruction Investment Fund. Together with the United States, we are creating the Fund that will attract global investment into our country,\" she wrote on X.\n\nUpon taking office, PresidentDonald Trumpsaid he wanted Ukraine’s rare earth materials as a condition for continued U.S. support in the war. He described it as reimbursement for the billions of dollars of U.S. military assistance given to Ukraine.\n\nRUSSIAN ATTACKS ON UKRAINE INTENSIFY IN MAKE-OR-BREAK WEEK FOR PEACE TALKS\n\nU.S. Treasury Secretary Scott Bessent and Ukrainian Economy Minister and Deputy Prime Minister Yulia Svyrydenko sign a minerals deal Wednesday in Washington D.C.(Treasury Department)\n\nDiscussions about a possible deal stalled after a combative meeting between Trump administration officials and Ukrainian PresidentVolodymyr Zelenskyyin the Oval Office.\n\nThe agreement will establish the United States-Ukraine Reconstruction Investment Fund to help accelerate Ukraine’s economic recovery, Treasury Secretary Scott Bessent said.\n\nREAD THE FULL TEXT OF THE AGREEMENT –APP USERS, CLICK HERE:\n\n\"This agreement signals clearly to Russia that the Trump Administration is committed to a peace process centered on a free, sovereign, and prosperous Ukraine over the long term,\" Bessent said in a statement. \"President Trump envisioned this partnership between the American people and the Ukrainian people to show both sides’ commitment to lasting peace and prosperity in Ukraine. And, to be clear, no state or person who financed or supplied the Russian war machine will be allowed to benefit from the reconstruction of Ukraine.\"\n\nTRUMP MARKS 100 DAYS IN OFFICE EMBROILED IN TRADE BATTLES, DEADLY WARS AND HARD-PRESSED DEALS\n\nUkrainian President Volodymyr Zelenskyy, right, and President Donald Trump, talk as they attend the funeral of Pope Francis at the Vatican Saturday.(Ukrainian Presidential Press Office via AP)\n\nThe U.S. is seeking access to more than 20 raw materials considered strategically critical to its interests, including some non-minerals such as oil and natural gas. Among them are Ukraine's deposits of titanium, which is used for making aircraft wings and other aerospace manufacturing, and uranium, which is used for nuclear power, medical equipment and weapons.\n\nUkraine also has lithium, graphite and manganese, which are used in electric vehicle batteries.\n\nThe deal will establish an equal partnership between the two countries and last for 10 years. Financial contributions to a joint fund would be made in cash, and only new U.S. military aid would count toward the American share.\n\nNeither party will have a majority vote, reflecting an equal partnership between Ukraine and the United States, Svyrydenko said. The fund is supported by the U.S. government through the U.S. International Development Finance Corporation.\n\nThe Trump administration is seeking a peace agreement with Russian President Vladimir Putin.(Fox News)\n\nUnlike an earlier draft of the agreement, the deal would not conflict with Ukraine’s path towardEuropean Unionmembership, a key provision for Kyiv.\n\nUnder the terms of the deal, the Ukrainian government will determine what minerals will be extracted and where, Svyrydenko said.\n\nLouis Casiano is a reporter for Fox News Digital. Story tips can be sent tolouis.casiano@fox.com.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}