{
    "question": "How might focusing AB 379 on anti-loitering penalties and victim support, while omitting a felony provision for buyers of sex from 16- and 17-year-olds, shape enforcement, victim outcomes, and public trust in California’s approach to combating exploitation?",
    "content": {
        "source_1": "Gov. Gavin Newsom is intervening in a sex trafficking bill that advanced from the Assembly Public Safety Committee. | Noah Berger/AP\n\nHERE WE GO AGAIN:California Democrats are once again getting pulled into the sex trafficking quagmire — this time, though, it’s through legislation from one of their own.\n\nAnd Gov.Gavin Newsomis again intervening at the eleventh hour, issuing a statement moments before publication of this edition calling out Assembly Democrats for maneuvering this week to exclude older teenagers from an existing law that increases penalties on people who solicit minors for sex.\n\nIt’s another example of Newsom seizing on an opportunity to present himself as a common-sense Democrat, one willing to check his own party in Sacramento when he believes lawmakers have strayed too far left. His move will likely force Democratic leaders to backtrack on legislative amendments they pushed over moderate and Republican objections.\n\n“The law should treat all sex predators who solicit minors the same — as a felony, regardless of the intended victim’s age,”Izzy Gardon,a Newsom spokesperson, said in a statement. “Full stop.”\n\nNewsom’s not-so-subtle demand followed several days of the Assembly Public Safety Committee playing so-calledagenda chickenover a bill from Democratic AssemblymemberMaggy Krell. Her legislation would criminalize loitering with the intent to buy sex and expand a soliciting law authored by state Sen.Shannon Groveto include 16- and 17-year-olds after Democrats carved the older teens out of the bill last year.\n\nAlthough ChairNick Schultzand the committee advanced Krell’s bill, the legislation still fueled the online conservative outrage machine that goes into overdrive every time a sex trafficking-related bill hits the Capitol.\n\nToday, the anger was over committee amendments that once again cut from the bill the provision adding older teens back into Grove’s soliciting law.\n\n“These are girls,” said AssemblymemberTom Lackey, a Republican on the committee. “These are people that our society should be doing everything they can to protect. So why are we protecting the predator by removing this tenet?”\n\nAsPlaybook reported last month, it’s not quite that simple. Krell’s bill got caught up in co-author Grove’s latest attempt to score a victory with an issue she’s successfully used against Democrats for the past two years.\n\nThis is not the first time Newsom has elbowed his way into a legislative conflict over sex trafficking legislation. In 2023, the Assembly Public Safety Committee wouldn’t advance a Grove bill on child sex trafficking,prompting Newsom to tell reportershe was trying to “see what we can do.”\n\nThe committee thenheld a special hearing to advance the bill, which the governor eventually signed.\n\nNewsom’s statement puts him at odds with progressive Democrats who supported Grove’s bill last year only with the carveout excluding older teens. They were not happy to see the age range reappear — even in a piece of legislation authored by their own member. State Sen.Scott Wienertold Playbook he was “just floored” by Grove trying to expand the law after agreeing to Democratic amendments last year.\n\nAs opponents to the bill reiterated during the hearing today, Democrats want to remove 16- and 17-year-olds in large part because they fear parents upset about interracial or LGBTQ relationships involving older teens could prompt them to weaponize solicitation laws.\n\nKrell — a former prosecutor who has spent her career working on sex trafficking issues — told reporters she accepted the panel’s amendments because leaders had taken the bill off the agenda, and doing so was the only way to secure a hearing. When asked about Democrats’ long-held concerns about the age range, Krell still seemed surprised they wanted to maintain the carveout.\n\n“I expected support on the totality of the bill,” Krell said. “I did. I thought people would understand it’s wrong to buy 16- and 17-year-olds for sex, that it should be treated as a felony.”\n\nBut legislative Democrats are tired of getting backed into a corner over sex trafficking — a GOP pet issue that also veers into conspiratorial areas of online discourse. Committee members were willing to advance the element of the bill criminalizing loitering for sex purchasers, even though some were not pleased with it and declined to vote. But keeping the portion already cut from Grove’s bill was a bridge too far.\n\nSchultz after the hearing acknowledged trafficking is a “tricky issue for the Democratic caucus” and said his party needs to be “smart on crime.”\n\n“I don’t think that we can avoid these issues,” he said. “We have to talk about sexual exploitation in our communities, getting tough on it and ensuring that we are detecting and deterring that sort of conduct. But we also have to have smarter, more balanced policy solutions.”\n\nIT’S TUESDAY AFTERNOON.This is California Playbook PM, a POLITICO newsletter that serves as an afternoon temperature check on California politics and a look at what our policy reporters are watching. Got tips or suggestions? Shoot an email to[email protected].\n\nAttorney General Rob Bonta and Democratic counterparts from other states said they will file a lawsuit against the White House over its cuts to AmeriCorps. | Noah Berger/AP\n\n100 DAYS, 16 LAWSUITS:Attorney GeneralRob Bontaand Democratic counterparts from other states said they will file a lawsuit today against the White House over its cuts to AmeriCorps — a legal action Newsomannounced earlier this month. The so-called Department of Government Efficiencyplaced most AmeriCorps employees on leaveearlier this month after dismissing 1,500 volunteers for the National Civilian Community Corps which aids with disaster relief.\n\nBonta at a press conference said he volunteered for the agency — working with families in public housing at a program calledLEAP in Connecticut— between 1993 and 1995, shortly after he graduated college.\n\n“Serving in AmeriCorps was one of the most formative experiences I’ve ever had,” Bonta said. “We won’t allow the President to demolish an agency that represents the best of who we are as a nation, the best of what we can be.”\n\nA White House spokesperson in response asserted Trump’s authority to make cuts to the program.\n\n“Americorps has failed eight consecutive audits and identified over $45 million in improper payments in 2024 alone,” White House spokespersonAnna Kellysaid in a statement. “President Trump has the legal right to restore accountability to the entire Executive Branch.”\n\nThe suit is California’s 16th against the White House since Trump’s second term began 100 days ago. It is also the second legal challenge for which Newsom has emphasized his support, California’s lawsuit against many of Trump’s tariffs being the first.\n\nNewsom is not the only potential contender for the 2028 Democratic presidential nomination supporting the suit. Kentucky and Pennsylvania joined through their governors,Andy BeshearandJosh Shapiro.— Blake Jones\n\nAssemblymember Ash Kalra shelved his proposal to lower the state’s cap on annual rent increases. | Rich Pedroncelli/AP\n\nSEE YA NEXT SESSION:AssemblymemberAsh Kalrashelved his proposal to lower the state’s cap on annual rent increases, saying he hopes to pass it next year, ourNicole Normanreports for POLITICO Pro subscribers.\n\nAB 1157, which would slash yearly rent increase caps to 2 percent plus inflation, will not be considered until next year.\n\nThe announcement came on the same morning that the hotly debated piece of legislation was set to be heard in the Assembly Judiciary Committee, which Kalra chairs.\n\n“I am grateful my colleagues on the Assembly Housing Committee acknowledged the pressing need to take action to support tenants statewide and stabilize the rental market,” said Kalra, a progressive representing the San Jose area, in a press release. “However, the robust debate coupled with subsequent discussions with Judiciary Committee members signaled more time is needed to work on the bill.”\n\nMAKING THE CASE:A proposal would allow the University of California and California State University to provide preferential admissions to descendants of slavery passed the Assembly Judiciary Committee today. The measure — part of the Legislative Black Caucus’ reparations package — will almost certainly be challenged in court.\n\nProp 209 prohibits public universities in California from considering race in admissions, and the Supreme Court in 2023 also struck down affirmative action policies in higher education. AssemblymemberIsaac Bryan, vice chair of the caucus, welcomed a court challenge but stressed that “the opportunity to move towards repair and redress is something we have to charge forward on.”\n\n“I would just ask anyone whose family is not a descendant of American slavery to ask how they would feel if it was their family and their family’s legacy and the generations that followed that were disadvantaged because of these discriminatory practices that were pervasive even here in the state of California,” said committee chair Kalra. —Eric He\n\n— California consumer confidence is down 31 percent since October. (Orange County Register)\n\n— San Jose MayorMatt Mahanhas asked his city attorney’s office to assess its legal options to defend against neighboring cities who encourage homeless populations to relocate there. (Mercury News)\n\n— The Anaheim Chamber of Commerce will reorganize and get new leadership, after it was set to close on April 30. (Orange County Register)\n\n— Sacramento-area state lawmakers are calling on state waterway officials to reopen Folsom Lake after it was closed due to the discovery of invasive golden mussels. (Sacramento Bee)\n\n— A judge ruled that Border Patrol cannot arrest people in the Central Valley without a warrant. (Fresno Bee)\n\nClarification: This newsletter has been updated to clarify the attribution for a statement from California Gov. Gavin Newsom’s office.",
        "source_2": "California lawmakers blocked a provision in Assembly Bill 379 that would have made it a felony to purchase sex from 16 and 17-year-olds.\n\nParts of the bill advancing victim support and anti-loitering measures moved forward.\n\nCritics raised concerns about over-criminalization and unintended consequences, while committee leaders urged a cautious approach to legal changes.\n\nCalifornia lawmakers in the Assembly Public Safety Committee blocked an effort that would have made soliciting 16 and 17-year-olds for sex a felony. Former prosecutor and current Democratic Assemblymember Maggy Krell proposedAssembly Bill 379, saying perpetrators who sell or buy children for sex deserve harsher punishment.\n\nLast year, the Golden State passed a measure making it a felony to purchase children 15 and younger for sex. That law went into effect in January.\n\nParts of Krell’s bill did move forward. If AB 379 becomes law, it would still criminalize those who loiter to purchase teens for sex and establish a fund to support victims of sex trafficking.\n\nHowever, the provision that would have made it a felony to solicit sex from older children was removed in order to allow the bill to move forward.\n\n“I disagree with that amendment,” Krell said during the committee hearing. “I needed to take it to get this hearing. I’m grateful for the hearing and I accept the amendment and I look forward to working with the committee –– including Assemblymember [Tom] Lackey, whose comments I really appreciated –– to make sure that we bring another bill to protect 16 and 17-year-olds who are being purchased for sex. They’re victims.”\n\nIn 2020,89% of victimsin active sex trafficking cases were between 14 and 17 years old, according to the DOJ\n\nCritics of the bill’s provisionarguethat it could have led to criminal charges against teenagers involved in consensual relationships –– particularlythose who are in LGBTQ+ or interracial relationshipsand have parents who disapprove.\n\n“There were a lot of youth advocates and activists who were concerned about the way that automatic felonies levied against older teens in relationships with other minors,” said Leela Chapelle, with the Coalition to Abolish Slavery and Trafficking (CAST), as reported by  KXTV.\n\nRepresentatives with CASTspoke to VanGuard News Groupand say the bill is also likely to target certain people as it makes “loitering” a crime, once again. CAST argues people driving around the wrong neighborhood or those walking down the street could get arrested if an officer considers it to be “loitering.”\n\n“AB 379 repeats the failed ‘end demand’ strategy that too often results in the arrest and criminalization of people selling sex—including those who are being trafficked—while ignoring the root causes of exploitation,” according to CAST.\n\nAssemblymember Nick Shultz, the Democratic chairman of the committee, made the ultimate decision to move the bill forward with the amendment. He says he wants to see how cases are prosecuted under the new law before changing it again.\n\n“While I fully understand and empathize with the author’s desire to change the law,” Shultz said during the hearing, “I think it would be more wise to see how cases get prosecuted under this new statutory framework to identify what is working and what is not.”\n\nKrellsaysshe won’t stop fighting and she’ll reintroduce the bill every year until it passes in order to protect children.\n\nCALIFORNIA LAWMAKERS IN THE ASSEMBLY PUBLIC SAFETY COMMITTEE BLOCKED AN EFFORT THAT WOULD’VE MADE THE PURCHASING OF 16 AND 17-YEAR-OLD CHILDREN – A FELONY.\n\nFORMER PROSECUTOR AND NOW DEMOCRATIC ASSEMBLYMEMBER MAGGY KRELL PROPOSED ASSEMBLYBILL 379 BECAUSE SHE SAYS PREPARATORS WHO SELL OR BUY CHILDREN FOR SEX DESERVE HARSHER PUNISHMENT.\n\nLAST YEAR, THE GOLDEN STATE PASSED A MEASURE MAKING IT A FELONY TO PURCHASE CHILDREN 15 AND YOUNGER FOR SEX WHICH WENT INTO EFFECT JANUARY OF THIS YEAR.\n\nIF A-B 379 BECOMES LAW, IT WOULD STILL CRIMINALIZES THOSE WHO LOITER TO PURCHASE TEENS FOR SEX AND ESTABLISHES A FUND TO SUPPORT VICTIMS OF SEX TRAFFICKING.\n\nHOWEVER, THE PROVISION THAT WOULD’VE MADE IT A FELONY TO SOLICIT SEX FROM OLDER CHILDREN – WAS REMOVED IN ORDER TO ALLOW THE BILL TO MOVE FORWARD.\n\n“I DISAGREE WITH THAT AMENDMENT. I NEEDED TO TAKE IT TO GET THIS HEARING. I’M GRATEFUL FOR THE HEARING AND I ACCEPT THE AMENDMENT AND I LOOK FORWARD TO WORKING WITH THE COMMITTEE INCLUDING ASSEMBLYMEMBER LACKEY WHOSE COMMENTS I REALLY APPRECIATED TO MAKE SURE THAT WE BRING ANOTHER BILL TO PROTECT 16 AND 17 YEAR OLDS WHO ARE BEING PURCHASED FOR SEX. THEY’RE VICTIMS.”\n\nCRITICS OF THE BILL’S PROVISION ARGUE THAT IT COULD HAVE LED TO CRIMINAL CHARGES AGAINST TEENAGERS INVOLVED IN CONSENSUAL RELATIONSHIPS.\n\n“THERE WERE A LOT OF YOUTH ADVOCATES AND ACTIVISTS WHO WERE CONCERNED ABOUT THE WAY THAT AUTOMATIC FELONIES LEVIED AGAINST OLDER TEENS IN RELATIONSHIPS WITH OTHER MINORS,”SAID LEELA CHAPELLE, WITH THE COALITION TO ABOLISH SLAVERY AND TRAFFICKING, LOCAL KXTV NEWS REPORTS.\n\nREPRESENTATIVES WITH CAST SPOKE TO VANGUARD NEWS GROUP AND SAY THE BILL IS ALSO LIKELY TO TARGET CERTAIN PEOPLE AS IT MAKES “LOITERING” A CRIME, ONCE AGAIN. CAST ARGUES PEOPLE DRIVING AROUND THE WRONG NEIGHBORHOOD OR THOSE WALKING DOWN THE STREET COULD GET ARRESTED IF AN OFFICER CONSIDERS IT TO BE “LOITERING.”\n\n“AB 379 REPEATS THE FAILED ‘END DEMAND’ STRATEGY THAT TOO OFTEN RESULTS IN THE ARREST AND CRIMINALIZATION OF PEOPLE SELLING SEX—INCLUDING THOSE WHO ARE BEING TRAFFICKED—WHILE IGNORING THE ROOT CAUSES OF EXPLOITATION,”ACCORDING TO CAST.\n\nASSEMBLYMAN NICK SHULTZ, THE DEMOCRATIC CHAIRMAN OF THE COMMITTEE MADE THE ULTIMATE DECISION TO MOVE THE BILL FORWARD WITH THE AMENDMENT.\n\nHE SAYS HE WANTS TO SEE HOW CASES ARE PROSECUTED UNDER THE NEW LAW BEFORE CHANGING IT AGAIN.\n\n“AND WHILE I FULLY UNDERSTAND AND EMPATHIZE WITH THE AUTHOR’S DESIRE TO CHANGE THE LAW, I THINK IT WOULD BE MORE WISE TO SEE HOW CASES GET PROSECUTED UNDER THIS NEW STATUTORY FRAMEWORK TO IDENTIFY WHAT IS WORKING AND WHAT IS NOT.”\n\nKRELL SAYS SHE WON’T STOP FIGHTING AND SHE’LL RE-INTRODUCE THE BILL EVERY YEAR UNTIL IT PASSES IN ORDER TO PROTECT CHILDREN.\n\nA debate over proposed legislation in California to combat child sex trafficking highlights political divisions on how to best protect minors from exploitation.\n\nLawmakers are divided on how to effectively address child sex trafficking without creating unintended consequences.\n\nSome advocates feared a felony provision in the original bill would lead to charges against some young adults in consensual relationships, especially among LGBTQ+ or interracial couples with disapproving parents.\n\nThe debate has centered on political accountability as both sides say they want to protect vulnerable populations.\n\nSynthesized coverage insights across61media outlets\n\nBoth sides agree on the need to protect minors from sexual exploitation and recognize the serious issue of sex trafficking. There is bipartisan support for legislation aimed at improving the resources available for survivors and enhancing penalties for soliciting minors for sex. Notably, active lawmaking efforts are underway, reflecting the importance of this issue in California.\n\nClaims that increasing penalties against solicitors will prevent sex trafficking have been questioned; evidence suggests that simply raising penalties does not effectively mitigate trafficking issues. Many experts advocate for a holistic approach that addresses root causes over punitive measures that often fail to protect the intended groups.\n\nThe long-term effects and experiences of survivors of sex trafficking are often omitted in discussions. While the legislation acknowledges the need for victim support, the complexities of their rehabilitation and the systemic issues surrounding trafficking need comprehensive coverage and deeper exploration.\n\nNo summary available because of a lack of coverage.\n\nIn a break from progressives, Newsom says soliciting older minors for sex should be a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nNo summary available because of a lack of coverage.\n\nCalifornia lawmakers to block effort to make it a felony to buy 16 and 17-year-olds for sex\n\nAssembly committee waters down bill to combat sex trafficking in California\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nControversial bill on trafficking minors moves forward, but with amendments\n\nCalifornia lawmakers weaken proposed punishment for teen sex solicitation\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nNo summary available because of a lack of coverage.\n\nTougher penalties for buyers of older teen prostitutes removed from California bill\n\nCalif. lawmakers block bid to make paying for sex with 16- and 17-year-olds a felony\n\nIn a break from progressives, Newsom says soliciting older minors for sex should be a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCalifornia Child Sex Trafficking Bill Passes Key Hurdle\n\nCalifornia creeps who solicit sex from certain minors can't be charged with felony, thanks to Democrats\n\nCalifornia Child Sex Trafficking Bill Advances After Language Removed To Make Purchase Of 16 & 17-Year-Olds A Felony\n\nCalifornia Dems reject plan to make buying sex from 16-year-olds a felony\n\nState Lawmakers Face Firestorm After This Bizarre Decision on Child Sex Trafficking\n\nCalifornia Democrats Reject Proposal To Make Trafficking 16- and 17-Year-Olds a Felony\n\nDems block felony charges for buyers of kids in gutted sex trafficking bill\n\nDems block felony charges for buyers of kids in gutted sex trafficking bill\n\nCalifornia Child Sex Trafficking Bill Advances After Language Removed to Make Purchase of 16 and 17-Year-Olds a Felony\n\nCalifornia lawmakers veto law to make the purchase of 16- and 17-year-olds for sexual purposes a felony\n\nChild Sex Trafficking Bill in California Gets Weaker\n\nChild Sex Trafficking Bill in California Gets Weaker\n\nAuthor of California child sex trafficking bill forced to exclude felony charge for buyers of teen victims\n\nCalifornia Democrats Block Bill to Make Sex Trafficking of Minors a Felony\n\nRadical California Democrats BLOCK Legislation to Make Sex Trafficking of Minors a Felony\n\nLegislation To Make S*x Trafficking 16 And 17-Year-Olds A Felony Blocked By Democrat State Lawmakers * 100PercentFedUp.com * by Danielle\n\nCA lawmakers refuse to make it a felony to buy teens for sex and… wait, what?\n\nThis Deomcrat Freak Blocked A California Bill To Make It A Felony To Buy 16 And 17 Year Old Children For Sex\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nAssembly Bill 379: A new path against sex trafficking – The Sacramento Observer\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nDemocrats stand pat, argue buying 16, 17-year-olds for sex shouldn't be a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nAuthor of California child sex trafficking bill forced to exclude felony charge for buyers of teen victims\n\nAuthor of California child sex trafficking bill forced to exclude felony charge for buyers of teen victims\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nAuthor of California child sex trafficking bill forced to exclude felony charge for buyers of teen victims | Fox Wilmington WSFX-TVAccessibility ToolsIncrease TextDecrease TextGrayscaleHigh ContrastNegative ContrastLight BackgroundLinks UnderlineReadable\n\nLuz Mary Alpízar presents project to prevent and punish child begging in Costa Rica\n\nDEMONIC: Radical California Democrats BLOCK Legislation to Make Sex Trafficking of Minors a Felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nOp-Ed | AB 379 Will Not End Exploitation—It Will Reinforce It – Davis Vanguard\n\nCA legislature poised to quash bill making buying sex from children a felony\n\nCA legislature poised to quash bill making buying sex from children a felony\n\n'Comprehensive' Illinois human trafficking bill has bipartisan support | Illinois State Bar Association",
        "source_3": "California lawmakers gutted a bill Tuesday that would have made paying for sex with 16- and 17-year-olds a felony charge.\n\nUnder current state law, creeps who buy sex from minors under 16 face extra fines, jail time, and either a misdemeanor or felony charge.\n\nA new bill meant to protect sex trafficking victims, AB 379, would have upped that age to 18, but Democratic committee members demanded the clause be cut before they let the bill move forward in the California State Assembly.\n\nThe bill’s author, Democrat Maggy Krell, who spent two decades overseeing human trafficking cases for the state, called the move a “disgrace.”“I’ve been doing this for 20 years, and I’m not going to quit now. And I am going to bring this part of this bill back every year until I get the books to protect children. That’s what I’m going to do,” shetold KCRA 3.Krell added that she still supports the current version AB 379, which imposes harsher penalties on “loitering with intent to purchase sex” — i.e., prowling street corners for hookups — and establishes a fund for sex trafficking victims.\n\nLast year, Republican lawmakers pushed for a similar bill to crack down on Johns prowling for underage streetwalkers. They managed to cut a deal with Democrats to lower the felony age cutoff from 18 to 16.\n\nDemocrat Nick Shultz, chairman of the Public Safety Committee, said the watering-down of AB 379 was a direct result of that previous deal.“My perspective as chair, there was a carefully crafted deal last year,” Shultz told KCRA 3. “We’re not saying ‘no,’ but what we’re saying is, if we’re going to be thoughtful policy makers, we really need to dive deep into this issue.”"
    }
}