{
    "question": "What are the potential benefits and drawbacks of the White House adding an influencer-focused press briefing ahead of the president’s 100th day in office for the quality of questioning, public trust, and how policy information reaches audiences?",
    "content": {
        "source_1": "‘So what direction do you advise me to go into?’ one MAGA media personality asked during the first ‘official influencer’ briefing that Karoline Leavitt held this week\n\nI would like to be emailed about offers, events and updates from The Independent. Read ourPrivacy notice\n\nFor the second day in a row on Tuesday, White House press secretaryKaroline Leavittheld a press briefing exclusively for members of what she called the“new media,”claiming she was fulfilling a promise she made at the start of the Trump administration to speak to “all media outlets.”\n\nOf course, as she laid bare at the start of Monday’s presser, these sessions are mostly a way to take softball questions and applause lines from a host of MAGA sycophants who are absolutely ecstatic to be given the opportunity to sit in the White House and play reporter.\n\n“This is our first official influencer briefing,” Leavitt said at the start of Monday’s event. “Millions of Americans are now turning to social media and independent media outlets to consume their news, and we are embracing that change, not ignoring it.”\n\nAs has been the case with the “new media” seat she added to the standard White House briefings and rotating press pool, which has beendisproportionately but not exclusivelyfilled by right-wing media personalities, Leavitt packed the “influencer” room with provocateurs and YouTubers who are extremely sympathetic to the president.\n\nDuring Monday’s briefing, for instance, the press secretary was directly asked to give the room marching orders.\n\n“I’m kind of the nerd when it comes to reporting. I’m not the headline news girl. I’m the nuts-and-bolts, I’m the policy-type nerd; so what direction do you advise me to go into?” American First Policy Institute ambassador Kambree Nelson wondered. “Like the White House files that y’all send out every single day? Because that’s what people are used to. When they wanna ask me questions, they wanna know the nuts and bolts of everything.”\n\nLeavitt, meanwhile, reacted by telling Nelson – who boasts 625,000 followers on X (formerly Twitter) and wasonce convincedthe moon had disappeared – that she wished “there were people in the legacy media that were like you” and “cared about the facts” of Trump’s accomplishments.\n\n“The president is doing so many phenomenal things every day that will never be mentioned on cable news at night,” Leavitt added. “We are doing our absolute best to message that. Which is, again, why we’re welcoming independent voices like yours with followings on social media.”\n\nMAGA influencer Arynne Wexler actually got the first question during Monday’s briefing, and she wanted to kick things off by praising the White House for rounding up migrants in her home state.\n\n“Thanks so much, Karoline, both for having us and for granting me the first question here. And I can attest to the deportations in Florida, my Uber drivers finally speak English again, so thank you for that,” she declared before asking Leavitt what the administration planned to do to “those who continue to defy the executive orders” regarding trans athletes.\n\nRight-wing pundit Rogan O’Handley, otherwise known as DC Draino, was perhaps the only one on Monday who came even semi-close to asking a tough question. One of thehandpicked influencers who received the “Epstein Files” bindersfrom Attorney General Pam Bondi in February, which ended up containing no real new information about deceased sex predator Jeffrey Epstein, O’Handley wanted to know when the FBI and DOJ would be releasing more documents on the disgraced financier.\n\n“And also, when might we start seeing some arrests from the client list?” DC Draino wondered.\n\nDescribing the attorney general as a “bulldog”, Leavitt claimed Bondi is “working on this diligently” but that she didn’t have a specific timeline she could share on any additional release, which has been apoint of contention with much of the MAGA base– especially considering how much Bondioverhypedthe initial document dump.\n\nIn the end, O’Handley accepted the press secretary’s response and did not attempt to follow up, even though he received no assurances from Leavitt other than Bondi always “keeps” her promises.\n\nAt the end of Monday’s briefing, which also included former Trump press secretary Sean Spicer asking Leavitt why legacy media wasn’t outright being excluded from the White House, the room erupted in applause as Leavitt wrapped up the meeting. “Thank you, I’m going to walk off now,” she said as the influencers clapped and cheered.\n\nReturning for Round 2 on Tuesday, Leavitt turned to right-wing TikToker Debra Lea, who commented about the “100 incredible days” of the Trump administration before wondering what policies Trump will roll out in the next couple of months “in order to secure the 2026 midterms for the Republican Party and keep his approval ratings historically high.”\n\nIn the meantime, MAGA podcaster Brenden Dilley wanted to know if the press secretary would play a game of “Trump trolling or Trump truthing” when it came to the president’s repeated proposals to annex Greenland, run for a third term in 2028, and make Canada the 51st state.\n\n“Sure, let’s do it. I love it,” Leavitt excitedly responded, letting Dilley know that Trump was “truthing” when it came to both Canada and Greenland but “trolling” on the running in 2028. “Although the hats are flying off the shelves,” she added, referencing the Trump Organization’s latest merchandise drop.\n\nFor the most part, both briefings were essentially a large-scale version of the questions many of the other“new media” members have askedduring the standard pressers Leavitt has held in the James S. Brady Press Briefing Room. Which is to say, they are essentially public displays of fealty from willing propagandists.\n\nEarlier this month, for instance, a “reporter” from the media outlet run by election-denying MyPillow CEO Mike Lindell gushed about how the 78-year-old president looked“healthier than ever before”before asking Leavitt: “Will you guys also consider releasing the president’s fitness plan?”\n\nAnd it was just last week that Tim Pool, the pro-Trump podcaster whounwittingly took vast sums of moneyfrom a Kremlin influence operation, teed up an opportunity for Leavitt to fume about the mainstream media.\n\n“Many of the news organizations that are represented in this room have marched in lockstep on false narratives such as the ‘Very Fine People’ hoax, the Covington smear, and now what’s being called the Maryland Man hoax, where an MS-13 gang member adjudicated by two different judges, I believe, is just simply being referred to as ‘a Maryland Man’ over and over again,” Pool asked. “I’m wondering if you can comment on the unprofessional behavior.”\n\nThe White House did not immediately respond to a request for comment.\n\nJoin thought-provoking conversations, follow other Independent readers and see their replies",
        "source_2": "The White House opened its doors to influencers for the first time, aiming to connect with audiences outside traditional media.\n\nDespite welcoming new voices, the administration is in a legal and access dispute with The Associated Press over its refusal to use \"Gulf of America\" terminology.\n\nAttendees asked favorable questions, prompting criticism that the event lacked journalistic rigor.\n\nThe Trump White House hosted its first official influencer briefing on Monday, April 28. The event marked a shift from traditional media engagement to include modern digital creators. The briefing, typically limited to credentialed journalists, opened its doors to content creators, political commentators and social media personalities.\n\nWhite House press secretary Karoline Leavittled the event. The move reflects the administration’s ongoing effort to engage audiences on platforms where many Americans now consume news, such as Instagram, TikTok and X.\n\n“It’s a shift from relying solely on legacy media outlets,” Leavitt said, reiterating that the Trump administration has aimed to speak to “all media outlets and personalities” since taking office.\n\nDownload the SAN app today to stay up-to-date with Unbiased. Straight Facts™.\n\nDespite welcoming new voices, the administration has maintained a tense relationship with some legacy media –– most notably the Associated Press.\n\nThe AP wasrecently barredfrom major events after it refused to adopt President Donald Trump’s directive to rename the Gulf of Mexico, the “Gulf of America.” Even after a federal courtordered that access be restored, restrictions remained.\n\nEarlier this year, Leavitt announced that anew front-row seatin the briefing room –– normally held for press secretary staff  –– would be reassigned to nontraditional media outlets.\n\nAmong the invited guests was Arynne Wexler, who identifies as “just a nonlib girl in a crazylib world.”\n\nMany comments and questions throughout the event, including Wexler’s, focused on hot-button issues such as transgender policy, immigration and tax cuts.\n\n“I can attest to the deportations in Florida,” Wexler said. “My Uber drivers finally speak English again, so thank you for that.”\n\nCritics noted that many of the questions skewed positive toward the Trump administration, with few offering direct challenges to Leavitt’s responses.\n\nFormer Trump press secretary-turned Substack author Sean Spicer defended the broader media engagement strategy. “A lot of conservatives ask me, ‘Why does [Trump] sit down with people like Terry Moran of ABC or Jeffrey Goldberg of The Atlantic?’” Spicer said. “What is the rationale behind rewarding people who have very vehemently expressed disdain for him personally?”\n\nLeavitt responded with, “because the president is unafraid.”\n\nOne attendee, Kambree Nelson, is an ambassador with the conservative America First Policy Institute. She asked Leavitt for direction on how to best cover White House communications.\n\n“I’m not the headline news girl,” she said. “I’m the nuts-and-bolts, policy-type nerd. So what direction do you advise me to go into?”\n\nLeavitt praised the question, saying, “I wish there were people in the legacy media that were like you and didn’t focus on the sensationalist headlines but actually cared about the facts.”\n\nShe added that Trump is doing “many phenomenal things every day” that don’t get covered by news outlets, and emphasized the administration’s intent to share those updates directly.\n\n“Which is, again, why we’re welcoming independent voices like yours with followings on social media,” Leavitt said.\n\nLeavitt closed the event with a round of applause and a thank-you to attendees. While it remains unclear how often these influencer briefings will occur, the event signals a shift in media strategy, and one focused on building relationships outside the traditional press corps.\n\nMonday marked a first inside the White House—a briefing that’s normally reserved for journalists was opened to a more modern kind of media.\n\n“This is our first official influencer briefing here at the White House.”\n\nIt’s a shift from relying solely on legacy media outlets, something the Trump administration has been open to since taking office. By inviting influencers, the White House is tapping into the platforms where many Americans now get their news—social media.\n\n“The Trump White House will speak to all media outlets and personalities.”\n\nWhile welcoming new voices, the administration has clashed with legacy outlets—most recently the Associated Press. After refusing to adopt the president’s directive to rename the ‘Gulf of Mexico’ the ‘Gulf of America,’ AP reporters were barred from major White House events, even after a federal court ordered access to be restored.\n\nIn January, Press Secretary Karoline Leavitt announced a new “media seat” in the front row, normally reserved for White House staff, making space for more outlets in the briefing room.\n\nMonday’s guest list included content creators, political commentators, and social media personalities—many with larger, right-leaning followings. Arynne Wexler, who brands herself as “Just a nonlib girl in a crazylib world,” was the first to comment and ask her question.\n\n“And I can attest to the deportations in Florida. My Uber drivers finally speak English again, so thank you for that.”\n\nWexler’s comment—like many questions during the event—centered on hot-button issues like transgender rights, immigration, and taxes. Critics say the questions were overwhelmingly favorable to the Trump administration or gave Leavitt room to promote its policies unchallenged.\n\nSean Spicer, former Trump White House Press Secretary, commented: “A lot of conservatives will ask me, ‘Why does he sit down with people like Terry Moran of ABC or Jeffrey Goldberg of The Atlantic? What is the rationale behind that? Rewarding people who have very vehemently expressed disdain for him personally?’” Leavitt responded: “Because the president is unafraid.”\n\nOne influencer, Kambree Nelson, asked Leavitt directly for instruction on how to cover news: “I’m not the headline news girl. I’m the nuts-and-bolts, I’m the policy-type nerd; so what direction do you advise me to go into? Like the White House files that y’all send out every single day?”\n\nLeavitt answered in part: “I wish there were people in the legacy media that were like you and didn’t focus on the sensationalist headlines but actually cared about the facts.”\n\nLeavitt was met with applause as she closed the briefing, thanking the participants for their time. While it’s unclear how often these events will happen, it marks a new strategy to connect with audiences beyond the traditional press corps.\n\nThis story matters because it illustrates a significant shift in how the White House engages with the media landscape, prioritizing social media influencers over traditional journalists.\n\nThe move to include influencers reflects a strategic pivot to reach younger audiences accustomed to digital content.\n\nThis shift in engagement tactics aligns with a broader trend of political figures leveraging non-traditional media to convey messages directly to followers.\n\nThe tension with legacy media highlights ongoing concerns about press freedom and the diversity of voices in political discourse.",
        "source_3": "White Housepress secretaryKaroline Leavittheld court with social media influencers as part of a special new media briefing before PresidentDonald Trumpcommemorates his first 100 days of his second administration.\n\nAmong those in attendance on Monday before Tuesday’s anniversary wereSean Spicer, Trump’s first-ever White House press secretary, who now hosts a YouTube show.\n\n“Mr. Spicer, it’s good to see you here, my predecessor,” Leavitt said.\n\nSpicer asked what priorities Trump was trying to pass through legislation rather than relying on executive orders. Leavitt replied that Trump was seeking to secure more funding for hisborder wallandmass deportations, in addition to protecting his 2017tax cuts, through the reconciliation process.\n\nHouse SpeakerMike Johnson(R-LA) was at the White House on Monday to discuss the pair’s plans for the parliamentary procedure that will help them pass legislation despite slim Republican congressional majorities.\n\n“The president is certainly working on unleashing Americanenergyto drive down costs, but tax cuts are a critical component of really seeing theTrump economic formulabe put together,” she said. “So he wants to see tax cuts passed in this reconciliation package; that includes no tax on tips, no tax onSocial Security, no tax on overtime.”\n\nTrump’s other priority was reducing regulation, according to Leavitt, though she announced the president would be signing an executive order later this week directing theDepartment of Transportationto introduce English literacy tests for truck drivers.\n\nThe 30-minute briefing was added to the public schedule to underscore what the White House considers to be Trump’s accomplishments regardingimmigration.\n\n.@PressSecBriefs Members of the New Media: Today officially marks the 99th day of promises made and kept by@POTUS. Our primary focus today is how@POTUShas fulfilled one of his central campaign promises in record time: ending the massive illegal invasion and securing our…pic.twitter.com/4y7afy8HMJ\n\nOther questions included when the president’s border wall will be completed, whether the administration would grant asylum to British foreign nationals because of issues with free speech in theUnited Kingdom, and why he still sat down for interviews with the legacy media.\n\n“It’s certainly a stark contrast to what we had in the previous administration, a president who was hiding, who actually used this beautiful South Court Auditorium, which we’re happy to be in today, but he used this like it was a fake Oval Office,” Leavitt said. “The president is willing to talk to anyone, not just journalists who have really been posing as journalists, but are actually left-wing activists.”\n\nSince Trump’s return to the White House, his team has sought to reform press access to the president, from taking responsibility for the roster of reporters who attend smaller events to prohibiting theAssociated Pressfor its editorial decision not to refer to theGulf of Mexicoas the Gulf of America.\n\nLeavitt has also implemented a new media seat in the briefing room, calling on that reporter first as opposed to theAssociated Press, as per tradition. Her interpretation of “new media” has been relatively loose, with the inclusion ofAxios, for example.\n\nLater in the week, Trump and his aides will amplify his achievements concerning the economy and social issues. The president is additionally expected to deliver remarks on his domestic investment policies, sit down for an interview with ABC, and participate in a town hall on NewsNation."
    }
}