{
    "question": "How might Putin’s unilateral three-day Victory Day ceasefire shape humanitarian conditions, battlefield dynamics, and the prospects for a longer, unconditional truce—including the U.S. decision on whether to stay involved in negotiations?",
    "content": {
        "source_1": "Russian President Vladimir Putin on Monday declared a unilateral three-day ceasefire in Ukraine next month, a move met with skepticism by Ukrainian officials who demanded the Kremlin leader immediately accept a longer truce proposal from the United States that he has so far rejected.\n\nMoscow said “all military actions” in Ukraine would be suspended from midnight May 8 to midnight May 11, a decision which it said was based on “humanitarian considerations.” The truce would coincide with Russia’s World War II Victory Day commemorations on May 9 and the 80th anniversary of the defeat of Nazi Germany.\n\nPutin’s announcement – which was met with renewed urging from the White House for a “permanent ceasefire” – comes as the Trump administration ramps up pressure on Moscow and Kyiv to agree to a deal to end the war.\n\nOn Sunday, US Secretary of State Marco Rubio said this week would be “very critical” in determining whether the US would persist with its efforts to broker peace.\n\n“While President Trump welcomes Vladimir Putin’s willingness to pause the conflict, the president has been very clear he wants a permanent ceasefire and to bring this conflict to a peaceful resolution,” US National Security Council Spokesman Brian Hughes said on Monday.\n\nLater on Monday, Ukrainian President Volodymyr Zelensky called the ceasefire declaration an “attempt at manipulation,” pointing out that, despite the Kremlin leader saying he wants peace, he has not accepted the US proposal for a 30-day ceasefire that Kyiv has agreed to.\n\n“Russia has consistently rejected everything and continues to manipulate the world, trying to deceive the United States. Now, yet again, another attempt at manipulation: for some reason everyone is supposed to wait until May 8 before ceasing fire – just to provide Putin with silence for his parade,” Zelensky said in apost on X.\n\nZelensky’s chief of staff Andriy Yermak thanked Trump on Monday for “supporting a full ceasefire,” writing in apost on Xthat “only a permanent, unconditional, and comprehensive ceasefire – not a temporary one, as Putin proposes – is necessary to end the war.”\n\n“If Russia truly wants peace, it must cease fire immediately,” Ukrainian Foreign Minister Andrii Sybiha said in response to Monday’s announcement from the Kremlin. “Why wait until May 8th?”\n\n“Ukraine is ready to support a lasting, durable, and full ceasefire. And this is what we are constantly proposing, for at least 30 days,” he added.\n\nThe announcement came a little more than a week after the Kremlin proclaimed a30-hour truceover Easter, which Kyiv cautiously agreed to. Ukraine’s military later accused Russia of violating that April 19 ceasefire with more than 2,900 attacks along the expansive frontlines. Moscow also accused Ukraine of repeatedly breaking that truce.\n\nMonitoring group the Institute for the Study of War said Putin was refusing “any ceasefire other than on terms that advantage his war effort.”\n\n”﻿Russian forces seized on the Easter ceasefire to shell and conduct reconnaissance of frontline Ukrainian positions and damaged vehicles along the frontline in preparation for future Russian assaults, and Russian forces will likely use the Victory Day ceasefire for similar preparatory efforts,” the US-based think tank said in its latest assessment.\n\nRelated articlePutin thanks North Korea for help in Kursk, as Germany criticizes US plan for Ukrainian concessions\n\nSenior Trump administration officials say the coming weeks will be a pivotal time in negotiating an end to the war, more than three years after Russia launched its full-scale invasion of Ukraine.\n\n“We’re close, but we’re not close enough,”Rubio saidon NBC’s “Meet the Press” on Sunday, following a phone call with Russia’s Foreign Minster Sergey Lavrov.\n\nMoscow described a “productive exchange of views” between the two.\n\nUS President Donald Trump has voiced increasing frustration over the failed efforts to broker a peace agreement within his self-imposed target of the first 100 days of his presidency.On Sunday, Trump leveled pointed criticism at Putin in some of his most potent comments to date, urging his Russian counterpart to “stop shooting, sit down and sign a deal.”\n\n“We have the confines of a deal, I believe, and I want him to sign it and be done with it and just go back to life,” Trump said.\n\nTrump’s comments came after he returned to Washington following a trip to Pope Francis’ funeral at the Vatican on Saturday. He met Zelensky on the sidelines of the ceremony for a short talk that both sides described as productive.\n\nSince April 19, when Putin proclaimed the temporary Easter ceasefire, Russian attacks have killed at least 62 civilians and injured another 290 in Ukraine, according to a CNN tally of figures from local authorities and emergency services.\n\n“The Easter ceasefire has already shown that there was no ceasefire in reality,” a senior officer in Ukraine’s Security Service (SBU), who goes by the call sign Bankir and has been fighting in the Zaporizhzhia region, told CNN on Monday.\n\n“There were a lot of enemy drones and artillery continued to work without reducing the intensity,” Bankir reflected. “The Easter ceasefire showed that it was just public statements that were not confirmed in practice.”\n\nThis story has been updated with additional developments.\n\nCNN’s Alex Marquardt and Catherine Nicholls contributed reporting.",
        "source_2": "Shane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nRussian PresidentVladimir Putinhas declared a temporary ceasefire in Ukraine to time with its \"Victory Day\" commemorations marking 80 years since the defeat of the Nazis and the end of World War II.\n\nThe Kremlin said the truce is \"based on humanitarian considerations\" and will last from the passing of midnight on May 7 into May 8, until the passing of midnight on May 10 into May 11.\n\n\"For this period, all hostilities are stopped,\" said the statement. \"Russia believes that the Ukrainian side should follow suit. In the event of violations of the ceasefire by the Ukrainian side, the Armed Forces of the Russian Federation will give an adequate and effective response.\"\n\nNewsweekreached out to the State Department and Ukraine's presidential office for comment.\n\nThe declaration of a truce comes as U.S. PresidentDonald TrumpcriticizesRussia and Putin directly—a rare rebuke—for the ongoing strikes in Ukraine. He urged Putin to \"STOP\" on Truth Social and said he found Russian actions \"very disappointing.\"\n\nHis tone on Ukrainian PresidentVolodymyr Zelenskyalso warmed following their face-to-face meeting at the Vatican duringPope Francis's funeral.\n\nTrump has threatened to walk away from the peace process unless good progress is made quickly. He believes the sides are close to a deal and should hold high-level direct talks to get an agreement over the line.\n\nU.S. Secretary of StateMarco Rubiosaid Sunday that this week would be \"very critical.\" The U.S. needs to \"make a determination about whether this is an endeavor that we want to continue to be involved in,\" he said onNBC'sMeet the Press.\n\nThe Kremlin added in its statement on a truce that it \"once again declares its readiness for peace talks without preconditions, aimed at eliminating the root causes of the Ukrainian crisis, constructive interaction with international partners.\"\n\nUp until now, Putin had refused to accept a complete, unconditional ceasefire, linking it to a halt in Western arms supplies to Ukraine and Ukraine's mobilization effort.\n\nJust before the ceasefire announcement, Ukraine and Russiatargeted each other with long-range strikes.\n\nThe Russian Defense Ministry said its forces downed 119 Ukrainian drones overnight, most of them over Russia's Bryansk border region.\n\nIn Ukraine, air raid sirens sounded across the country on Monday morning. There were no immediate reports of casualties or damage.\n\nPutin had previously declared a unilateral 30-hour Easter truce, a move the Ukrainians said shows peace is in Russia's hands. Both sides accused each other of firing during Putin's Easter truce.\n\nZelenskyhas said previouslythat Ukraine wants \"an immediate, full, and unconditional ceasefire.\"\n\n\"This is absolutely possible–but only if Russia agrees and stops the killing,\" Zelensky wrote in an April 23 post on X, formerlyTwitter. He added: \"Ukraine has repeatedly said that it does not rule out any format that can lead to a ceasefire and, ultimately, real peace.\"\n\nUkrainian President Zelenskyposted on X after his Vatican meeting with U.S. President Donald Trump:\"Good meeting. We discussed a lot one on one. Hoping for results on everything we covered. Protecting lives of our people. Full and unconditional ceasefire. Reliable and lasting peace that will prevent another war from breaking out. Very symbolic meeting that has potential to become historic, if we achieve joint results. Thank you @POTUS.\"\n\nUkraine has not said if it would also adhere to Putin's latest declaration of a truce. However, Ukraine's foreign minister Andrii Sybiha questioned why a ceasefire could not be immediate. He said Ukraine would agree to an immediate truce for 30 days.\n\nThis article includes reporting by The Associated Press.\n\nUpdate 4/28/25, 9:35 a.m. ET: This article was updated with additional information.\n\nUpdate 4/28/25, 9:53 a.m. ET: This article was updated with remarks by Andrii Sybiha.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check                                    ...Read more",
        "source_3": "Fox News White House correspondent Peter Doocy joins 'Fox & Friends' to report on President Donald Trump's meeting with Zelenskyy as the president urges Putin to sign a peace deal and White House highlighting recent violent migrant arrests.\n\nRussian President Vladimir Putin on Monday declared a three-day ceasefire in the war with Ukraine next month to mark the 80th anniversary ofWorld War IIVictory Day.\n\nThe Kremlin said the 72-hour ceasefire would run from the beginning of May 8 and last through the end of May 10.\n\n\"All military actions are suspended for this period,\" the Kremlin said in a statement. \"Russia believes that the Ukrainian side should follow this example.\"\n\n\"In the event of violations by the Ukrainian side,Russia's armed forceswill give an adequate and effective response,\" the statement said.\n\nTRUMP DISAPPOINTED RUSSIA LAUNCHED ROCKETS AT UKRAINE, BLAMES OBAMA, BIDEN FOR CRIMEA GIVEAWAY\n\nRussian President Vladimir Putin has so far refused to accept a complete unconditional ceasefire.(Mikhail Metzel, Sputnik, Kremlin Pool Photo via AP)\n\nThere was no immediate response from Kyiv to the unilateral truce announcement.\n\nPutin has previouslysaid that he agrees in principle with a Russia-Ukraine ceasefire deal, though has so far refused to accept a complete unconditional ceasefire.\n\nVictory Dayis Russia’s largest secular holiday. It regularly features a parade in Moscow’s Red Square to celebrate the Soviet Union’s victory over Nazi Germany during World War II.\n\nDuring Russia’s war with Ukraine,Putin has used the eventto emphasize the victory over Nazi Germany and has even alleged similarities between Germany’s Nazi rule and Ukraine, which he has previously promised to \"de-nazify.\"\n\nRUBIO TAKES SOMBER TONE ON RUSSIA-UKRAINE PEACE DEAL: ‘CLOSE BUT NOT CLOSE ENOUGH’\n\nU.S.Secretary of State Marco Rubiosaid Sunday struck a somber tone for a major peace agreement between Ukraine and Russia, telling NBC’s \"Meet the Press\" that a deal is \"still not there.\"\n\n\"We've made real progress, but the last couple steps of this journey were always going to be the hardest,\" Rubio said. \"It needs to happen soon. We cannot continue to, as I said, to dedicate time and resources to this issue if it's not gonna come to fruition.\"\n\n\"The last week has been about figuring out how close are these sides really, and are they close enough that this merits a continued investment of our time as a mediator in this regard,\" he added.\n\nFox News Digital’s Anders Hagstrom and Fox News' Manahil Ahmad contributed to this report.\n\nFox News' Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.\"\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}