{
    "question": "What are the legal and humanitarian implications of a judge’s claim that a 2-year-old U.S. citizen may have been removed with her mother without meaningful process, and how should procedures handle parental consent, custody, and the child’s due process rights in similar cases?",
    "content": {
        "source_1": "The girl was deported Friday with her mother to Honduras, despite her father’s efforts to keep her in the United States.\n\nThe child had been with her mother and sister during a regular immigration check-in at the New Orleans office of Immigration and Customs Enforcement on Tuesday. | David Dee Delgado/Getty Images\n\nA federal judge is raising alarms that the Trump administration deported a two-year-old U.S. citizen to Honduras with “no meaningful process,” even as the child’s father was franticallypetitioning the courtsto keep her in the country.\n\nU.S. District Judge Terry Doughty, a Trump appointee, said the child — identified in court papers by the initials “V.M.L.” — appeared to have been released in Honduras earlier Friday, along with her Honduran-born mother and sister, who had been detained by immigration officials earlier in the week.\n\nThe judge on Friday scheduled a hearing for May 16, which he said was “in the interest of dispelling our strong suspicion that the Government just deported a U.S. citizen with no meaningful process.”\n\nThe child, whose redacted U.S. birth certificate was filed in court and showed she was born in New Orleans in 2023, had been with her mother and sister during a regular immigration check-in at the New Orleans office of Immigration and Customs Enforcement on Tuesday. Officials there detained them and queued them up for deportation.\n\nTrump administration officials said in court that the mother told ICE officials that she wished to take V.M.L. with her to Honduras. The filing included a handwritten note in Spanish they claimed was written by the mother and confirmed her intent. But the judge said he had hoped to verify that information.\n\n“The Government contends that this is all okay because the mother wishes that the child be deported with her,” Doughty wrote. “But the Court doesn’tknowthat.”\n\n“This parent made the decision to take the child with them to Honduras. It is common that parents want to be removed with their children,” Assistant DHS Secretary Tricia McLaughlin said in a statement. “Parents are asked if they want to be removed with their children or ICE will place the children with someone the parent designates. In this case, the parent stated they wanted to be removed with the children.”\n\n“We take our responsibility to protect children seriously and will continue to work with federal law enforcement to ensure that children are safe and protected,” she added.\n\nThe court battle ignited Thursday, when lawyers for the family filed an emergency petition in the Western District of Louisiana seeking V.M.L.’s immediate release from ICE custody and a declaration that the girl’s detention had been unlawful. The petition was filed under the name of Trish Mack, who the lawyers indicated had been asked by V.M.L.’s father to act as the child’s custodian and take her home from ICE custody.\n\nLawyers for the guardian told the court that V.M.L.’s father had been attempting to contact the girl’s mother to discuss plans for their child but ICE officials denied him the chance to have a substantive phone call. He says ICE allowed the two to speak for about one minute on Tuesday, while the mother was in ICE custody, but that they were unable to make any meaningful decisions about their child.\n\nAs a U.S. citizen, V.M.L. is likely to have the ability to return to the United States, setting her case apart from others that have drawn national attention in recent weeks, such asthe case of Kilmar Abrego Garcia. The Salvadoran native was deported to a prison in his home country in violation of a 2019 immigration court order. But the Louisiana case is the latest concern by the courts that the Trump administration’s rush to carry out deportations is violating due process rights — in this case, the rights of a U.S. citizen child.\n\nDoughty said he attempted to investigate the emergency matter himself on Friday, seeking to get V.M.L.’s mother on the phone to determine whether ICE’s representation about her desire to bring V.M.L. to Honduras was accurate. The judge said he was “independently aware” that the plane he believed was carrying the family was already “above the Gulf of America.”\n\nTrump administration lawyers called the judge back Friday afternoon and said a phone call with the mother would not be possible “because she (and presumably VML) had just been released in Honduras,” Doughty wrote. Doughty then scheduled the May hearing.\n\nDoughty is based in Monroe, Louisiana, about 100 miles north of the staging facility in Alexandria where lawyers who filed the petition said they believed the mother and her daughters were being held prior to their deportation.\n\nDoughty’s sharp criticism of the Trump administration is particularly notable because he issued a series of major decisions in favor of Trump and his allies in recent years, most notably backing conservatives inlegal challenges to the Biden administration’s effortsto rein in what it claimed was misinformation on social media platforms about vaccines and certain politically charged topics.\n\nIndeed, some conservatives considered Doughty so likely to be in their camp that they filed lawsuits in his judicial division in order to have a strong chance the cases would be assigned to him.\n\nEven as Doughty made clear that he was disturbed by the government’s actions, in his order Friday the judge seemed to tip his hat to the president, adopting the term “Gulf of America” for the body of water traditionally known as the Gulf of Mexico.\n\nThe Justice Department did not respond to a request for comment.",
        "source_2": "A federal judge has said that a two-year-old US citizen may have been deported to Honduras with her mother and 11-year-old sister without due process, amid the Trump administration's drive to ramp up deportations.\n\nIn a court filing, Judge Terry Doughty said that there was \"strong suspicion\" that the child - identified only as VML - was deported \"with no meaningful process\".\n\nThe Louisiana-born child and her family members were apprehended during a routine appointment at a New Orleans immigration office on 22 April, according to the document.\n\nA spokesperson for the US Department of Homeland Security said the mother wanted to take her children with her when she was sent to Honduras.\n\nThe judge had sought to arrange a phone call with the girl's mother, but was told by a government lawyer that it \"would not be possible because she (and presumably VML) had just been released in Honduras\", court documents say.\n\nThe immigration status of the girl's mother, father and sister remains unclear. The two-year-old, however, is a US citizen.\n\n\"It is illegal and unconstitutional to deport, detain for deportation, or recommend deportation of a US citizen,\" said the judge.\n\nA hearing has been scheduled for 19 May \"in the interest of dispelling our strong suspicion that the government just deported a US citizen with no meaningful process\".\n\nDepartment of Homeland Security Assistant Secretary Tricia McLaughlin said in a statement to the BBC's US partner, CBS News, that \"the parent made the decision to take the child with them to Honduras\".\n\nShe added: \"It is common that parents want to be removed with their children.\"\n\nEarlier this week, the girl's father had also filed for a temporary transfer of legal authority, which according to state law would give his sister-in-law - also a US citizen - custody of the children.\n\nHowever, an Immigration and Customs Enforcement (Ice) agent spoke to a family attorney and \"refused to honour the request\" and said that the \"father could try to pick her up, but that he would also be taken into custody\".\n\nIn a second, similar case in Florida, a Cuban woman with a one-year-old child and her US citizen husband were detained at a scheduled immigration appointment and flown back to Cuba two days later, according to media reports.\n\nThe woman, identified as Heidy Sánchez, was still breastfeeding her daughter, who suffers from seizures, according to her lawyer. He has argued that Ms Sanchez was not a criminal and should have remained in the US on humanitarian grounds.\n\nThousands of undocumented immigrants have been detained since Donald Trump returned to the White House on 20 January.\n\nTrump's hard-line immigration policies have encountered a number of legal hurdles.\n\nIn the highest-profile case, the government admitted it mistakenly deported El Salvador national Kilmar Ábrego García, but contends he is a member of the MS-13 gang, which his lawyer and family denies. Mr Ábrego García has never been convicted of a crime.\n\nThe Supreme Court unanimously ruled that the government shouldfacilitate bringing back Mr Ábrego García, but the Trump administration has said he will \"never\" live in the US again.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "A federal judge bashed theTrump administrationFriday for what he said may have been the deportation of a 2-year-old U.S. citizen.\n\nJudge Terry Doughty, a Trump appointee to the court in Louisiana, said he had a “strong suspicion that the government just deported a U.S. citizen with no meaningful process.”\n\nThe case touches on a thorny area of deportation in which parental rights clash with those of U.S. citizen children.\n\nGovernment lawyers said the girl’s mother, Jenny Carolina Lopez Villela, said she wanted to take her daughter, Valentina Mendez Lopez, to Honduras when she was deported. She wrote a note on Thursday memorializing that decision.\n\nBut Judge Doughty said he doesn’t know that to be true.\n\nAs the plane was in flight over the Gulf of America he tried to arrange a call with the mother to figure out what was going on. By the time the government got an answer back to the judge, the woman — and presumably the child — had already been released in Honduras.\n\nThe judge said it is illegal to deport a U.S. citizen.\n\nThe American Civil Liberties Union said there was a second case this week with U.S. citizen children ages 4 and 7 being deported with their family.\n\nThe ACLU said in both cases the families were “held incommunicado” before their deportations, raising questions about who was looking out for the children’s interests.\n\nThe ACLU asserted that both families might have had claims to be allowed to remain in the U.S. but were unable to lodge those claims because they weren’t allowed to talk to lawyers in time.\n\nLawyers did file the case on behalf of the 2-year-old, but by the time a judge got involved, the plane was already outside U.S. airspace.\n\nThe case harkens back to 2018, when the firstTrump administrationfaced the opposite problem: It deported parents without their children, who were left behind in the U.S.\n\nThose so-called “family separations” became a major political black eye for theadministration, forcing President Trump to abandon his zero-tolerance border policy.\n\nJudges at that time ruled that parents had the right to decide whether to have their children go with them or remain in the U.S. as Unaccompanied Alien Children, where they would be placed with sponsors.\n\n• Stephen Dinan can be reached atsdinan@washingtontimes.com.\n\nCopyright © 2025 The Washington Times, LLC.Click\n                            here for reprint permission.\n\nPope Leo should tell Catholics: Marry young, have many children\n\nTrump’s TikTok delays undermine his China hawks while Intel controversy grows"
    }
}