{
    "question": "How might the snap timing of this parliamentary vote and the choice among Mark Carney, Pierre Poilievre, and Jagmeet Singh shape the governing mandate Canadians deliver tonight?",
    "content": {
        "source_1": "Mark Carney achieved what seemed like an impossible feat just a few months ago, leading the Liberals to another victory after an election that was shaped by U.S. President Donald Trump's trade war and threats of annexation.\n\nThe CBC Decision Desk is projecting a fourth Liberal term — a rarity in Canadian politics — but it's too close to tell whether it will be majority or minority government.\n\nCarney, a central banker who only jumped into Canadian politics in January, successfully reversed his party's fortunes after polling earlier this year suggested defeat was all but guaranteed. But the race against the Conservatives is shaping up to be closer than many polls predicted.\n\nThe Liberal share of the vote hovers just above 43 per cent and, as of 8 a.m. ET, are leading or projected elected in about 168 seats, short of the 172 needed to form a majority government.\n\nThe Conservative vote share stands at about 41 per cent, which is an extremely strong showing for the party but did not translate into the most seats\n\nWhile some ridings are too close to call still, results suggest Bloc Québécois and NDP support faltered. If the results hold, New Democrats will lose both party status and its leader's seat in one night.\n\nA minority government would be short of the \"strong mandate\" Carney campaigned for and would mean his party will  need the support of one of the opposition parties to pass legislation and stave off an another election in the near future.\n\nStill, a minority government would have felt miraculous at the end of last year. Canadians had soured on former prime minister Justin Trudeau and polls suggested Conservative Leader Pierre Poilievre would snap up the majority government he'd long been waiting for.\n\nThen came Trudeau's early January resignation, U.S. President Donald Trump's trade war and persistent barbs about making Canada the 51st state — flipping the political script.\n\nWith Trump announcing, pausing, then re-announcing devastating tariffs on Canadian goods, the campaign largely became a race about who is best to steer Canada through global uncertainty.\n\nCarney tried to define himself as a steady, mature outsider who is best to deal with the unpredictable president and map out a new economic and security relationship. Heading into the campaign, Carney did not have a seat in the House of Commons. That changed Monday as CBC News projects he's won the Ottawa riding of Nepean.\n\nWhile criss-crossing the country, the freshly minted leader pointed to his time as the governor of the Bank of Canada during the 2008 global financial crisis and head of the Bank of England during the Brexit years as evidence that Canadians should trust him to steer the country's economy through turbulent times.\n\nFULL SPEECH | Carney delivers message of unity as Liberals projected to win 4th term\n\nSpeaking from the election headquarters in downtown Ottawa, Carney opened his speech saying he has lots to be humble about.\n\n\"Humility underscores the importance of governing as a team in cabinet and in caucus and working constructively with all parties across Parliament,\" he said.\n\nHe then spoke to those who didn't vote for him, saying he intends to govern for all Canadians \"no matter where you live, no matter what language you speak, no matter how you voted.\n\n\"Millions of our fellow citizens preferred a different outcome,\" he said from a hockey arena.\n\n\"Let's put an end to the division and anger of the past. We are all Canadian and my government will work for and with everyone.\"\n\nCarney then congratulated his political rivals for \"all the work they did and their service to Canada, now and in the future.\"\n\nWhile the political dust still has to settle on the overall results, Carney already has his eye on one of the next major hurdles: negotiating with the president.\n\n\"When I sit down with President Trump, it will be to discuss the future economy and security relationship between two sovereign nations,\" he said.\n\n\"It will be our full knowledge that we have many, many other options to build prosperity for all Canadians.\"\n\nCarney dances to Down With Webster after election win\n\nDuring his victory speech he reiterated his promise to make the Canadian economy less dependent on the U.S. and to reduce barriers to interprovincial trade by Canada Day.\n\nHe ended the night dancing in a red hoodie with supporters to the band Down With Webster, a staple of his campaign rallies.\n\nThe mood at the Conservative headquarters, just blocks away from where Liberals gathered, was understandably more subdued.\n\n\"Change did not get over the finish line tonight,\" Poilievre told the crowd just after 1 a.m. ET.\n\nHe congratulated Carney, and said the Conservatives will \"do our job to hold the government to account.\"\n\nFULL SPEECH | Poilievre says he intends to stay on as Conservative leader\n\nPoilievre, who has lead the Conservatives since 2022 and has very much shaped the party, added that they will learn lessons from this election for \"an even better result\" next time.\n\nBut CBC News projected he would lose his own seat to Liberal challenger Bruce Fanjoy in the Ottawa Carleton riding Poilievre has held since 2004.\n\nHowever, Poilievre said he intends to stay on as leader.\n\n\"It will be an honour to continue to fight for you,\" he said.\n\nDuring the race, Poilievrefaced criticismthat he was too slow to pivot from the ballot box questions he wanted to campaign on — the carbon tax, affordability and Trudeau's unpopularity — to Trump's trade war and revived Canadian patriotism.\n\nHe defended his approach, arguing Canadians share his concerns about the housing crisis and illegal drugs.\n\nThe night was devastating for the NDP,with results suggesting a near-total collapse. New Democrats are leading or projected elected in just seven ridings, short of the 12 needed for official party status.\n\nSingh gets emotional as he announces he will step down as NDP leader\n\nJagmeet Singh, fronting his third campaign as leader, acknowledged defeat in his concession speech where he also announced he'll step down.\n\n\"Obviously I know this night is a disappointing night for New Democrats,\" he said, repeatedly tearing up after failing to win his seat of Burnaby Central.\n\n\"We had really good candidates that lost tonight. I know how hard you worked. I spent time with you. You're amazing. I am so sorry you are not going to be able to represent your communities.\"\n\nSingh was projected to lose his B.C. Burnaby Central riding to Liberal Wade Chang, finishing in third place.\n\nAt the tailend of the campaign he stood by his decision to not trigger a federal election sooner, even after rippingup the supply-and-confidence agreementhe had signed with the Trudeau Liberals.\n\n\"I could not stomach the idea of Pierre Poilievre and the Conservatives forming a majority government,\" Singh said.\n\n\"I knew that it was going to be bad because of their cuts, because of the division, because of the things they wanted.\"\n\nSingh had been quick to point out his deal with Trudeau pushed the Liberals to bring in pharmacare and a dental care programs, policies that New Democrats sought for years.\n\nBloc Québécois Leader Yves-François Blanchet, who is projected to be re-elected in Beloeil-Chambly, has also been working to hold the balance of power in the House. The separatist party only runs candidates in Quebec and its mandate has long been to act as a voice for Quebecers in Ottawa.\n\nEven thoughthe party is projected to lose a chunk of its seats,it could play an important role if the Liberals preside over a minority government.\n\nIn his address to supporters, Blanchet underscored that Canada would have to answer to Quebec and ensure its interests are respected.\n\n\"You have overcome a challenge that would have literally overwhelmed people of lesser character than yours,\" Blanchet told the crowd in French.\n\n\"This will once again be an example of what distinguishes Quebec and what makes it a great nation that is unique and whose voice will be heard around the world.\"\n\nThe night was also disappointing to the Greens, which saw Kitchener Centre incumbent Mike Morrice lose. Co-Leader Elizabeth May will hold onto her Saanich-Gulf Islands riding, CBC News projects. The other co-leader, Jonathan Pedneault, was hoping to win a seat but is currently in fifth place in the Montreal riding of Outremont.\n\nCatharine Tunney is a reporter with CBC's Parliament Hill bureau, where she covers national security and the RCMP. She worked previously for CBC in Nova Scotia. You can reach her at catharine.tunney@cbc.ca\n\nAudience Relations, CBCP.O. Box 500 Station AToronto, ONCanada, M5W 1E6\n\nIt is a priority for CBC to create products that are accessible to all in Canada including people with visual, hearing, motor and cognitive challenges.\n\nClosed Captioning and Described Video is available for many CBC shows offered onCBC Gem.",
        "source_2": "At a rally in London, Ontario, on Friday, the crowd booed as Mark Carney delivered his core campaign line about the existential threat Canada faces from its neighbour.\n\n\"President Trump is trying to break us so that America could own us,\" the Liberal leader warned.\n\n\"Never,\" supporters shouted back. Many waved Canadian flags taped to ice hockey sticks.\n\nSimilar levels of passion were also on display at the union hall where Pierre Poilievre greeted enthusiastic supporters in the Toronto area earlier in the week.\n\nThe Conservative leader has drawn large crowds to rallies across the country, where \"Bring it Home\" is a call to arms: both to vote for a change of government and a nod to the wave of Canadian patriotism in the face of US tariff threats.\n\nIn the final hours of a 36-day campaign, Donald Trump's shadow looms over everything. The winner of Monday's election is likely to be the party able to convince voters they have a plan for how to deal with the US president.\n\nNational polls suggest the Liberals have maintained a narrow lead entering last stretch.\n\nStill, Trump is not the only factor at play - he was only mentioned once in Poilievre's stump speech.\n\nThe Conservative leader has focused more on voters disaffected by what he calls a \"Lost Liberal decade\", promising change from a government he blames for the housing shortage and a sluggish economy, and for mishandling social issues like crime and the fentanyl crisis.\n\nHis pitch resonates with voters like Eric and Carri Gionet, from Barrie, Ontario. They have two daughters in their mid-20s and said they were attending their first ever political rally.\n\n\"We're pretty financially secure - but I worry about them,\" said Eric Gionet. While he and his wife could buy their first home while young, he said, \"there's no prospect\" their children will be able to do the same.\n\n\"I'm excited to be here,\" said Carri Gionet. \"I'm hopeful.\"\n\nTapping into voter frustration has helped opposition parties sweep governments from power in democracies around the world. Canada seemed almost certain to follow suit.\n\nLast year, the Conservatives held a 20-point lead in national polls over the governing Liberals for months. Poilievre's future as the country's next prime minister seemed baked in.\n\nThen a series of shockwaves came in quick succession at the start of 2025, upending the political landscape: Justin Trudeau's resignation, Carney's subsequent rise to Liberal leader and prime minister; and the return of Trump to the White House with the threats and tariffs that followed.\n\nBy the time the election was called in mid-March, Carney's Liberals were polling neck-and-neck with the Conservatives, and by early April they had pulled slightly ahead, national surveys suggest.\n\nIt has been a stunning reversal of fortunes. Seemingly dead and buried, the Liberals now believe they could win a fourth successive election, and even a majority in Parliament.\n\nCarney is pitching himself as the man most ready to meet this critical moment - a steady central banker who helped shepherd Canada's economy through the 2008 financial crisis and later, the UK through Brexit.\n\nFor Conservative voter Gwendolyn Slover, 69, from Summerside in the province of Prince Edward Island, his appeal is \"baffling\".\n\n\"Many people think Mark Carney is some kind of Messiah,\" she said. \"It's the same party, he's one person. And he's not going to change anything.\"\n\nFor Carney's supporters, they see a strong CV and a poise that has calmed their anxieties over Trump's threats of steep tariffs and repeated suggestions the country should become the 51st US state - though the president has been commenting less frequently on Canada during the campaign.\n\n\"I'm very impressed by the stability and the serious thought process of Mark Carney,\" said Mike Brennan from Kitchener, Ontario, as he stood in line to meet the Liberal leader at a coffee shop in Cambridge, about an hour outside Toronto.\n\nMr Brennan is a \"lifelong Liberal\" who did not initially plan to vote for the party in this election because of his dislike for Trudeau.\n\nThe departure of former prime minister Trudeau, who had grown increasingly unpopular over his decade in power, released \"a massive pressure valve\", said Shachi Kurl, president of the Angus Reid Institute, a non-profit public opinion research organisation.\n\n\"All of these angry Liberals who are either parking their votes with the [left-wing] NDP or parking their votes with the Conservatives start re-coalescing,\" she said.\n\nThen more disaffected Liberals and other progressive voters began to migrate towards Carney's Liberals, driven by Trump, this election's \"main character\", Ms Kurl said.\n\n\"The threats, the annexation talk, all of that has been a huge motivator for left of centre voters.\"\n\nIt has worked to Carney's advantage, with Trump's tariffs threats giving the political neophyte - he is the first prime minister never to have held elected public office - the chance to publicly audition to keep his job during the campaign.\n\nTrump's late-March announcement of global levies on foreign automobile imports allowed Carney to step away from the trail and take on the prime minister's mantle, setting up a call with the president and meeting US Cabinet ministers.\n\nHe's never been tested in a gruelling federal election campaign, with its relentless travel, high-pressure demands for retail politics and daily media scrutiny. Yet on the campaign trail, and in the high-stakes debate with party leaders, he is considered to have performed well.\n\nPoilievre, in contrast, is a veteran politician and polished performer. But on the shifting political ground, Conservatives appeared to struggle to find their footing, pivoting their message from Canada being broken to \"Canada First\".\n\nPoilievre had to fend off criticism from political rivals that he is \"Trump lite\", with his combative style, his vows to end \"woke ideology\", and willingness to take on the \"global elite\".\n\n\"I have a completely different story from Donald Trump,\"he has said.\n\nCanadians have historically voted in either Conservative or Liberal governments, but smaller parties - like the NDP or the Bloc Québécois, a sovereigntist party that only runs candidates in the province of Quebec - have in the past formed Official Opposition.\n\nIn this campaign, both are languishing and face the possibility of losing a number of seats in the House of Commons as anxious voters turn towards the two main political parties.\n\nIf the Liberals and Conservatives both succeed in getting over 38% of the vote share nationally, as polls suggest is likely, it would be the first time that has happened since 1975.\n\nThe message from the NDP - which helped prop up the minority Liberals in the last government - in the final days of campaigning has been to vote strategically.\n\n\"You can make the difference between Mark Carney getting a super majority or sending enough New Democrats to Ottawa so we can fight to defend the things you care about,\" leader Jagmeet Singh said earlier this week.\n\nThe campaign has also highlighted festering divides along regional lines.\n\nWith much of the campaign dominated by the US-Canada relationship and the trade war, many issues - climate, immigration, indigenous reconciliation - have been on the backburner.\n\nEven when the campaigns have focused on other policies, the discussion has centred on the country's economic future.\n\nBoth frontrunners agree in broad strokes on the priorities: the need to pivot away from dependence on the US; the development of oil, gas and mining sectors; protection for workers affected by tariffs; and increased defence spending.\n\nBut they disagree on who is best to lead Canada forward, especially when so much is at stake.\n\n\"It's time for experience, not experiments,\" Carney told his supporters in London.\n\nPoilievre closing message was: \"We can choose change on Monday. We can take back control of our lives and build a bright future.\"\n\nThe 39-year-old built a makeshift shelter to survive in British Columbia's  wilderness and wrote \"help\" on a rock.\n\nThe dog's owner wrote on TikTok that the bear broke into her home and was eating her dog's food before Scout discovered the intruder.\n\nTrump's volatile trade policy has thrown the world economy into chaos, and put some US prices up.\n\nThere are pressures on both sides to give businesses a reprieve, but the tone remains markedly downbeat.\n\nThe Trump administration raised Canada's tariff from 25% to 35%, while granting Mexico a 90-day pause for higher levies.",
        "source_3": "Mark Carney, Pierre Poilievre and Jagmeet Singh, not one of them fought the election he expected. Here's what to know about the federal party leaders\n\nYou can save this article by registering for freehere. Orsign-inif you have an account.\n\nToday iselection day in Canada. A new federal government will be chosen, but none of the party leaders fought the election he expected.\n\nEnjoy the latest local, national and international news.\n\nEnjoy the latest local, national and international news.\n\nCreate an account or sign in to continue with your reading experience.\n\nCreate an account or sign in to continue with your reading experience.\n\nJagmeet Singhof theNDP, who for months seemed the main opposition to a looming Conservative majority, is now facing a wipeout inseat count, even his own. He achieved some policy goals through his deal to prop up the Liberal government of Justin Trudeau through a third term that saw the collapse of its popular support, but he failed to turn that into votes for his own party. With his own seat in jeopardy, it looks grim for Singh’s own future as leader, though not perhaps for his legacy.\n\nMark Carneyhas been toying with theLiberal Partyfor years, and Justin Trudeau’s resignation let him skip to the prime ministership without first winning an election. It could have been a recipe for a disaster of credibility with this politically untested central banker, but Donald Trump’s economic threats quickly transformed Carney from a long running Liberal daydream to the front runner in the polls.\n\nYour guide to the world of Canadian politics. (Subscriber exclusive on Saturdays)\n\nBy signing up you consent to receive the above newsletter from Postmedia Network Inc.\n\nA welcome email is on its way. If you don't see it, please check your junk folder.\n\nThe next issue of First Reading will soon be in your inbox.\n\nWe encountered an issue signing you up. Please try again\n\nPierre Poilievrepresented himself and theConservative Partyas a government in waiting, led by a slightly prickly but detail oriented policy obsessive who wasn’t in it for the personal affection. His goal was common sense. Their foil was Justin Trudeau, leading a washed up, tired out Liberal Party, weak in his own caucus, and disliked by Canadians in general. But then, the volatility of Donald Trump’s trade war upended that tidy ballot question, and threatened to make this an election on sovereignty. A pivot might have come too late for Poilievre, and his real fight was against a reborn Liberal Party under Mark Carney, an accomplished central banker who managed to flip the narrative.\n\nRead more about the three major party leaders in these profiles of the leaders.\n\nUnder Jagmeet Singh, Canada’s New Democratic Party has successes its leftist supporters can be proud of.\n\nA national dental care program, pharmacare and anti-replacement-worker legislation are all in line with the party’s social democratic vision of governance.\n\nBut they came about in a curious way, as the NDP’s policy reward in a tit-for-tat arrangement that kept the governing Liberal party in power well past the end of its popular support.\n\nThe supply and confidence deal that gave Liberals control of the parliamentary agenda, supported by NDP votes, did not benefit Singh’s party as much as it could have, political experts say. It dragged on beyond its purpose. It needed a time limit, an earlier exit clause. For the NDP, it looked like all give and no take.\n\nSingh made this deal in 2022 but never fully capitalized on what he had, and now it might be too late, because he has become a “bit player” in this current campaign, said Tamara Small, professor of political science at the University of Guelph, whose research focuses on the use of digital technologies in politics.\n\n“He’s in a tough position,” Small said. “This race is coming down to two parties and there’s really no space for him.”\n\nNow that Donald Trump has won two presidential votes, though he notoriously claims three, it is easy to forget how disorienting the Brexit referendum was to the political and economic establishment, and how similar a shock.\n\nBrexit happened not long before the first Trump win in 2016, and it seemed to announce a new era. It took down a British prime minister who had argued, alongside the Governor of the Bank of England, Mark Carney, that leaving the European Union was a terrible idea for the U.K., tantamount to economic self sabotage, ginned up by a chaotic new populism that tugged on modern conservatism from the farther right.\n\nSo it fell to Carney, now Canada’s Prime Minister seeking his first election to public office, to use monetary policy to absorb those shocks. And he did. There were recriminations about him being a doomsayer, and accusations of being so unclear on interest rates that he got tagged with the “unreliable boyfriend” nickname in the financial press. But it could have been a lot worse. Doom was dodged.\n\nCanada faces similar economic fears today, and similar imperatives to resolve volatile geopolitics with economic reality. These have transformed Carney from a long-running Liberal daydream to the front runner in the polls.\n\nFor a second, Mark Carney didn’t know where to look.\n\nThe English language debate had just ended. Carney had to look somewhere, he couldn’t just keep shuffling his papers. To his left, host Steve Paikin was walking toward Yves-François Blanchet to say happy birthday. If Carney turned that way, the final image of the leaders all together before this tight election would be him shaking hands with NDP Leader Jagmeet Singh.\n\nFrom Carney’s right came a friendly voice. His head swivelled like a bird looking for food. It made for a striking moment, this little formality, and Pierre Poilievre seemed the more natural for initiating it. Carney leapt at the opportunity, leaning in with a smile to talk in his ear, patting him warmly.\n\nIt was funny to imagine Poilievre and Justin Trudeau looking like that, after such a long animosity. Trudeau especially would look like he was faking nice, as no doubt he would be.\n\nOther moments like this have humanized Poilievre in the eyes of voters. He has shown off his family and told personal stories, talking about being adopted from a teenaged mother, and about his own young daughter who has special needs. But to emotionally familiarize the man behind the politician never seemed like core strategy for the Conservative Party of Canada.\n\nPeople don’t swoon over Poilievre. That’s the point. Many Canadians are frankly embarrassed about having once liked Trudeau so much, whose life they had known since his childhood.\n\nSo it seemed fine just to be the guy who identifies big problems and proposes workable solutions, a slightly prickly but detail oriented policy obsessive who isn’t in it for the personal affection. It’s an election, not a date. This seemed to be the Conservative attitude, and for a while, it looked to be a winner. Odds are you’re never having that beer with the prime minister anyway, so who cares whether you’d have fun or not. On the other hand, if you elect him, you’ll definitely pay his taxes. This was to be an election about economic priorities and common sense.\n\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit ourCommunity Guidelinesfor more information."
    }
}