{
    "question": "How might the restoration of SEVIS records while ICE crafts a new termination framework affect international students’ due process and future immigration prospects?",
    "content": {
        "source_1": "The Trump administration is restoring the legal status of international students who had their records terminated in recent weeks, a government attorney said Friday at a hearing.\n\nElizabeth D. Kurlan, an attorney for the Justice Department, said during the hearing in the Northern District of California in Oakland that records for international students will be reactivated for the time being, as Immigration and Customs Enforcement crafts a new policy that will “provide a framework for status record termination.”\n\nThe move comes weeks after the Trump administration began revoking the visas of some thousands of international students in addition to their records and legal statuses, seemingly taking aim at those who’ve participated in political activism or have had previous charges, like DUIs.\n\n“ICE still maintains the authority to terminate a SEVIS record for other reasons,\" Kurlan said at the hearing, referring to the Student and Exchange Visitor Program, \"such as if a student fails to maintain his or her nonimmigrant status after the record is reactivated, or engages in other unlawful activity that would render him or her removable from the United States under the Immigration and Nationality Act.”\n\nKurlan also said that going forward, ICE will not be terminating statuses solely based on findings in the National Crime Information Center, a computerized index that includes criminal history information, that resulted in some of the recent SEVIS record terminations.\n\nMany international students with terminated statuses began to discover that their records were abruptly restored Thursday afternoon, immigration attorneys and universities across the U.S. told NBC News. The reinstatements occurred with little-to-no explanation, the attorneys said.\n\n“It’s like somebody flipped a light switch on,” Jath Shao, a Cleveland-based immigration attorney who has a client that experienced the sudden reversal.\n\nThe changes have hit many, but not all, students. At the University of California, Berkeley, a dozen of the 23 international students who had their records terminated in the SEVIS weeks ago were reinstated, university spokesperson Janet Gilmore said.\n\nA few students at the Rochester Institute of Technology also experienced reinstatement, the school’s public information director, Carl Langsenkamp, said. Charles Kuck, an Atlanta-based attorney, said he has about a dozen clients who reported a similar reversal.\n\nDavid Wilson, who represents around 20 students in Minnesota, said about half of his clients have had their statuses restored. He added, however, that there’s still a great deal of uncertainty, particularly because many of their student visas still remain revoked.\n\n“That means they’re kind of trapped in the country. So that’ll be the next phase of seeking clarity as to what the government’s actually doing,” Wilson said.\n\nAdditionally, the status termination will still appear on students’ records, potentially jeopardizing any future applications for green cards or other relief, the immigration attorneys said.\n\n“The time that they had their SEVIS status terminated could still have harmful effects for those students,” said Elora Mukherjee, director of the Immigrants’ Rights Clinic at Columbia Law School. “So it’s not enough for the federal government to simply restore service records. The government would need to somehow make the students whole.”\n\nShao, the attorney, said that the development is a small but positive one for international students. However, he said more needs to be done to guarantee their safety in the U.S.\n\n“By now it’s obvious that the Trump administration spent the four years of Biden plotting their revenge on the immigration system,” Shao said. “But once some brave students and lawyers went to the courts — the administration’s defenders were unable or unwilling to explain the rationale.”\n\nChloe Atkins reports for the NBC News National Security and Law Unit, based in New York.",
        "source_2": "Dan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nIn a sudden reversal on Friday, the Trump administration announced it will reinstate thousands of foreign students to active status aftertheir records were terminatedfrom a database earlier this month.\n\nTheDepartment of Justice(DOJ) announcedthe sweeping student visa reversalin federal court, following weeks of mounting legal pressure.\n\n\"While we are hearing about the reopening of some individual SEVIS records, the systemic harm caused by the original unlawful terminations continues—and our case should move forward,\" Miriam Feldblum, president and CEO of the Presidents' Alliance, which filed a lawsuit on the issue Thursday, said in a statement toNewsweek.\n\n\"Reactivating a record does not erase questions about the genesis of this unlawful policy. It also does not remove the original termination notation or the stated reason from SEVIS records, both of which can have long-term negative consequences for students. Nor does it prevent the Trump administration from reversing conduct and returning to these unlawful behaviors.\"\n\nTheDepartment of Homeland Security(DHS) later said it had not reversed course on student visa revocations, but instead the active status of those visa holders.\n\nNewsweekreached out to the DOJ for comment via email Friday morning.\n\nAround 5,000 students are estimated to have had their visas revoked or legal status deleted by the administration in recent weeks, putting them at risk of deportation. Around 100 lawsuits were filed, challenging the move.\n\nAssistant U.S. Attorney Joseph Carilli told a federal court in Washington, D.C., that Immigration and Customs Enforcement (ICE) was developing a framework for SEVIS record terminations, but that, for now, all plaintiffs in the case and other affected students would see their status restored.\n\nSEVIS stands for the Student and Exchange Visitor Information System. It's a web-based system which DHS uses to track the immigration status of foreign students while in the U.S., often in the country on F-1 visas.\n\nThe sweeping revocation of these visas began nearly two months ago. First, with high-profile cases, such asRumeysa Ozturk in Massachusettsbefore morereports started appearing of other revocations.\n\nHundreds of students then sued in various courts across the country, with many of them never having been charged or convicted of a crime or having only faced minor offenses, such as a speeding ticket.\n\nCarilli said Friday that while status was being restored, ICE maintains the authority to terminate the status of those who do not maintain their immigrant status or break any laws.\n\nThe sweeping reversal comes after a judge in Georgia ordered the restoration of 133 visas last week.\n\nIn a separate case Friday, U.S. District JudgeTanya Chutkanordered an Ohio State University student's visa be restored.\n\nGraduate Ahwar Sultan was arrested at a pro-Palestinian rally, which led officials to revoke his visa two weeks ago. Chutkan said this was not grounds for visa revocation.\n\nSultan, who was arrested in April 2024, later saw the charges associated with his arrest dismissed and expunged.\n\nThe judge's ruling came around the same time as the nationwide turnaround.\n\nMiriam Feldblum, president and CEO of the Presidents' Alliance, in her statement toNewsweek: \"Our case seeks a complete end to the unlawful policy, not just piecemeal fixes. This is why systemic litigation like ours remains crucial—to ensure full relief, prevent future harm, and safeguard students' ability to remain in and return to the United States without risk.\"\n\nDHS Assistant Secretary Tricia McLaughlin in a statement toNewsweek: \"We have not reversed course on a single visa revocation. What we did is restore SEVIS access for people who had not had their visa revoked.\"\n\nCharles Kuck, an immigration attorney with Kuck Baxter in Atlanta, toldNewsweek: \"It is good to see ICE recognize the illegality of its actions canceling SEVIS registrations for these students. Sad that it took losing 50 times. What we don't yet know is what ICE will do to repair the damage it has done, especially for those students who lost jobs and offers and had visas revoked. We await their answer.\"\n\nAssistant U.S. Attorney Joseph Carilli reading a written statement Friday:\"ICE is developing a policy that will provide a framework for SEVIS record terminations. Until such a policy is issued, the SEVIS records for plaintiff(s) in this case (and other similarly situated plaintiffs) will remain active or shall be reactivated if not currently active, and ICE will not modify the record solely based on the NCIC finding that resulted in the recent SEVIS record termination.\"\n\nCarilli said Friday that similar statements will be filed in the other student visa cases across the country.\n\nUpdate: 4/25/25, 12:11 p.m. ET: This article has been updated with additional information and remarks.\n\nUpdate: 4/25/25, 12:50 p.m. ET: This article has been updated with additional information.\n\nUpdate: 4/25/25, 1:27 p.m. ET: This article has been updated with additional information.\n\nUpdate: 4/25/25, 3:15 p.m. ET: This article has been updated with comment from DHS and Kuck.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security.                                    ...Read more",
        "source_3": "By signing up to our newsletters you agree to the Just the NewsTerms of ServiceandPrivacy Policy\n\nThe Department of Justice announced the decision in federal court\n\nThe Trump administration on Friday restored thousands of visa registrations for foreign students who had either a minor or dismissed legal infraction.\n\nThe Justice Department announced the decision in federal court,according to the news outlet Politico.\n\nThe administration last month abruptly decided to remove foreign students from a federal database used by universities to track foreign students.\n\nStudents were concerned they lost their immigration status and could be deported.\n\nSeveral judges ruled against the administration and said removing the students from the database was illegal. Over 100 lawsuits were launched as a result of the decision."
    }
}