{
    "question": "How might the FBI’s arrest of a Wisconsin judge for allegedly helping an unauthorized immigrant avoid arrest by ICE influence the relationship between local courts and federal immigration enforcement, as well as public trust in both institutions?",
    "content": {
        "source_1": "A Milwaukee County Circuit judge was arrested by the FBI Friday and charged in federal court for allegedly helping an undocumented immigrant avoid arrest.\n\nJudge Hannah Dugan isfacing two chargesfor obstruction and concealing the individual from arrest. She made an initial appearance in court and was released.\n\nThe arrest on federal charges is an escalation in the Trump administration’s focus on judges’ conduct, particularly as it relates to immigration enforcement. The Justice Department has repeatedly asserted that it will investigate any local officials who do not assist federal authorities on immigration matters.\n\n“We believe Judge Dugan intentionally misdirected federal agents away from the subject to be arrested in her courthouse, Eduardo Flores-Ruiz, allowing the subject — an illegal alien — to evade arrest,” FBI Director Kash Patel said on X in a post Friday morning. “Thankfully our agents chased down the perp on foot and he’s been in custody since, but the Judge’s obstruction created increased danger to the public.”\n\nRelated articleTrump backs down in legal fight over canceling international students’ status records\n\nIn court on Friday, Dugan’s attorney said that “Judge Dugan wholeheartedly regrets and protests her arrest. It was not made in the interest of public safety,” according to the AP.\n\nIn charging documents, investigators said that plainclothes federal agents went to Dugan’s courtroom on April 18 with the intention of arresting Flores-Ruiz. A Mexican immigrant, Flores-Ruiz had been removed from the United States in 2013, but immigration officials learned he was back in the country illegally because of his arrest in a local domestic abuse case.\n\nAfter being informed of the agents’ presence by her courtroom deputy, the judge “became visibly angry, commented that the situation was ‘absurd,’ left the bench, and entered chambers,” court documents say.\n\nWitnesses told investigators that Dugan confronted the federal agents in a public hallway, where she repeatedly demanded they leave, saying they needed a different kind of warrant to make the arrest. Dugan ordered the agents to speak with the chief judge of the courthouse.\n\nSeveral witnesses – including Dugan’s courtroom deputy and both the prosecutor and the Victim Witness Specialist on Flores-Ruiz’s case – allegedly recounted seeing Dugan then direct Flores-Ruiz and his attorney to leave through a “jury door,” which leads to a nonpublic area of the courthouse, court documents say.\n\nOne of the witnesses told investigators that Dugan stopped the two as they tried to exit through the normal door to the courtroom, saying something to the effect of “wait, come with me.”\n\nFlores-Ruiz and his attorney quickly exited the courthouse before the agents were able to catch up to them, investigators say. Agents found Flores-Ruiz outside the courthouse and identified themselves. He took off running but was eventually captured.\n\nCNN has reached out to Flores-Ruiz’s attorney for comment. Flores-Ruiz has not yet entered a plea to federal charges related to his efforts to evade arrest and is being detained, according to his court record. This is a separate case from the charges against Dugan.\n\nOfficials from the Trump administration quickly touted the arrest as an important step in achieving their immigration crackdown, and holding figures they view as corrupt responsible.\n\nAttorney General Pam Bondi said in an interview on Fox News after the arrest was executed that “if you are destroying evidence and you are obstructing justice, when you have victims sitting in a courtroom of domestic violence and you are escorting a criminal defendant out the back door, it will not be tolerated.”\n\n“I think some of these judges think they are beyond and above the law, and they are not,” Bondi added.\n\nTrump’s border czar Tom Homan similarlysaid in a post on Xthat “nobody should be surprised by the arrest of two judges.” The second judge he is referring to is former magistrate Judge Joel Cano, who is charged with harboring three alleged gang members on his property.\n\n“If you actively impede our enforcement efforts or if you knowingly harbor or conceal illegal aliens from ICE you will be prosecuted,” he said.\n\nOpponents of the administration, however, have attacked the arrest as a threat to the legal system.\n\nWisconsin Gov. Tony Evers, a Democrat, saidin a statementthat the Trump administration has used “dangerous rhetoric to attack and attempt to undermine our judiciary at every level,” and emphasized that the “fundamental demand of justice in America” is defendants are innocent until proven guilty.\n\n“I will continue to put my faith in our justice system as this situation plays out in the court of law,” his statement reads.\n\nRelated articleAttorney general directs Justice Department employees to enforce policies targeting care for transgender minors\n\nMilwaukee Mayor Cavalier Johnson says the arrest could scare residents from coming to court, undermining public safety in the city.\n\nAnd democratic Rep. Gwen Moore, whose district includes Milwaukee, described Dugan’s arrest as “shocking” in a statement and said it has “all the hallmarks of overreach.”\n\n“Federal law enforcement coming into a community and arresting a judge is a serious matter and would require high legal bar,” said Moore, adding she was “very alarmed at this increasingly lawless actions of the Trump Administration, and in particular ICE, who have been defying courts and acting with disregard for the Constitution.”\n\nThis story has been updated with additional developments.\n\nCNN’s Evan Perez and Katelyn Polantz contributed to this report.",
        "source_2": "Dan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nJason Lemon is a Senior Politics Editor atNewsweekbased in Brooklyn, New York. Prior to taking on the editor role, Jason's reporting focused on U.S. politics and international affairs. He joinedNewsweekin 2018, and had previously worked as an editor at a Middle Eastern media startup called StepFeed. He also worked a year as a contributor toThe Atlanta Journal-Constitutionand has bylines inThe Christian Science Monitor,The Palm Beach Post, Al Fanar Media andA Magazine. He is a graduate of the American University of Beirut in Lebanon and Andrews University in Michigan. You can get in touch with Jason by emailing j.lemon@newsweek.com. Languages: English, Spanish, French and Levantine Arabic\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nFederal Bureau of Investigation (FBI) DirectorKash Patelsaid on Friday that his agency had arrested Wisconsin Judge Hannah Dugan on charges related to her allegedly helping anundocumented immigrant evade arrest.\n\n\"Just NOW, the FBI arrested Judge Hannah Dugan out of Milwaukee, Wisconsin on charges of obstruction — after evidence of Judge Dugan obstructing an immigration arrest operation last week,\" Patel, who was appointed by PresidentDonald Trump, wrote in a now-deleted post on X, formerlyTwitter.\n\nDugan appeared briefly in federal court in Milwaukee on Friday before being released from custody. Her next court appearance is May 15.\n\n\"Judge Dugan wholeheartedly regrets and protests her arrest. It was not made in the interest of public safety,\" her attorney, Craig Mastantuono, said during the hearing. He declined to comment to an Associated Press reporter following her court appearance.\n\nU.S. Attorney GeneralPam Bondilater said onFox Newsthat the administration would prosecute judges who obstructICE.\n\nNewsweekreached out to the FBI and the Milwaukee County Courts for comment via email Friday morning.\n\n.@AGPamBondi's message to judges who obstruct ICE arrests: \"We are going to prosecute you, and we ARE prosecuting you!\"pic.twitter.com/SdncZesd1H\n\nThe Trump administration hasclashed with judgesat all levels over immigration policies and enforcement since Inauguration Day, but Dugan's arrest marks a significant shift in tensions between the justice system and the Executive branch.\n\nU.S. Immigration and Customs Enforcement (ICE) arrested a Mexican national after he appeared at a hearing in front of Dugan, a Milwaukee County Circuit Court judge, on April 18.\n\nEduardo Flores-Ruiz, 30, was accused of three counts of misdemeanor battery and was in court for a pre-trial hearing. According to theMilwaukee Journal Sentinel, ICE agents came to the courthouse with an arrest warrant that day, presented an arrest warrant, and were sent to the hallway outside Dugan's courtroom.\n\nAccording to the outlet, the judge said in an email that a warrant was not presented. She then allegedly directed the defendant and his attorney to a side door that led to a private hallway and into the public area on the same floor.\n\nIn his Friday post, Patel made it clear that agents were seeking out Flores-Ruiz and said the FBI believed Dugan purposefully directed Flores-Ruiz away from ICE. He was still arrested by federal agents that same day.\n\nPatel deleted the post about the judge's arrest within an hour of sharing it Friday morning. It was not immediately clear why.\n\nDugan's apparent arrest comes after a former Democratic judge in New Mexico was arrested alongside his wifefor allegedly harboring illegal immigrants.\n\nFBI Director Kash Patel, in his deleted post on X:\"We believe Judge Dugan intentionally misdirected federal agents away from the subject to be arrested in her courthouse, Eduardo Flores Ruiz, allowing the subject — an illegal alien — to evade arrest.\n\n\"Thankfully our agents chased down the perp on foot and he's been in custody since, but the Judge's obstruction created increased danger to the public.\"\n\nU.S. Attorney General Pam Bondi on Fox News on Friday: \"The judge learns that ICE was outside to get the guy, because he had been deported in 2013, came back into our country, is charged with committing these crimes...She goes out in the hallway, screams at the immigration officers—she's furious, visibly shaken, upset —sends them off to talk to the chief judge. She comes back in the courtroom... takes the defendant and the defense attorney back in her chambers, takes them out a private exit and tells them to leave.\"\n\nMilwaukee County Judge Marisabel Cabrera, in an email to other justices shared by theMilwaukee Journal Sentinel:\"My understanding is that the warrant presented was an ICE administrative warrant.\n\n\"If the proposed protocol is to accept these warrants, I find it problematic. In effect, the protocol seems to merely facilitate ICE arrests in a manner that is quiet and least disruptive to us. On the other hand, the protocol gives the illusion to the general public that steps are being taken in the courthouse to prevent ICE overreach.\n\n\"In a time where we are seeing that ICE has made grave errors in arrests, are actively making false allegations, and blatantly violating the U.S. Constitution, I have serious concerns about publicly giving the appearance that the protocol is somehow making it safe for folks to come to court when in fact they may still be arrested by ICE and deported to a brutal detention center in El Salvador.\"\n\nThe FBI is yet to clarify details on Dugan's arrest.\n\nUpdate 4/25/25, 11:31 a.m. ET: This article was updated with additional information.\n\nUpdate 4/25/25, 12:25 p.m. ET: This article was updated with additional information and remarks.\n\nUpdate 4/25/25, 1:32 p.m. ET: This article was updated with additional information.\n\nUpdate 4/25/25, 3:17 p.m. ET: This article was updated with additional information.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nJason Lemon is a Senior Politics Editor atNewsweekbased in Brooklyn, New York. Prior to taking on the editor role, Jason's reporting focused on U.S. politics and international affairs. He joinedNewsweekin 2018, and had previously worked as an editor at a Middle Eastern media startup called StepFeed. He also worked a year as a contributor toThe Atlanta Journal-Constitutionand has bylines inThe Christian Science Monitor,The Palm Beach Post, Al Fanar Media andA Magazine. He is a graduate of the American University of Beirut in Lebanon and Andrews University in Michigan. You can get in touch with Jason by emailing j.lemon@newsweek.com. Languages: English, Spanish, French and Levantine Arabic\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security.                                    ...Read more",
        "source_3": "Attorney General Pam Bondi joins America Reports to discuss the arrests of two judges in separate cases for aiding illegal immigrants, one of which is a suspected Tren de Aragua gang member, and the administration's response.\n\nThe FBI arrested a Wisconsin judge Friday morning for allegedly hiding a previously deportedillegal immigrantin her jury room in order to stop him from being arrested by U.S. Immigration and Customs Enforcement (ICE) agents.\n\nMilwaukee County Circuit Court Judge Hannah Dugan was arrested and charged with obstruction of an official proceeding after evidence came to light that she had shielded the migrant from ICE agents, according to a criminal complaint. She was also charged with concealing an individual to prevent discovery and arrest.\n\nThe FBI arrests Milwaukee County Circuit Court Judge Hannah Dugan on Friday, alleging she obstructed the arrest of an illegal immigrant.(Obtained by Fox News)\n\nFederal agents from ICE, FBI, CBP and DEA attempted to arrest the undocumented male – Mexican national Eduardo Flores-Ruiz – following his scheduled criminal court appearance before Dugan on April 18 to face three misdemeanor battery charges for allegedly beating up two people.\n\nDugan demanded that the officers proceed to the chief judge’s office and – after his hearing ended – escorted Flores-Ruiz and his attorney out a restricted jury door, bypassing the public area where agents were waiting in order to help him avoid arrest, per the complaint.\n\nNEW MEXICO SUPREME COURT BANS JUDGE AFTER ALLEGED TDA MEMBER ARRESTED AT HOME\n\nMilwaukee County Circuit Court Judge Hannah Dugan, pictured in 2016, has been arrested for allegedly hiding an undocumented immigrant in her jury room in order to prevent him from being arrested by ICE.(Mike De Sisti / USA Today Network via Imagn Images, left, Mike De Sisti / Milwaukee Journal Sentinel / USA Today Network via Imagn Images, top right, Christopher Dilts/Bloomberg via Getty Images, bottom right.)\n\nDugan appeared in federal court in Milwaukee on Friday and made no public comments during the brief hearing, according to theMilwaukee Journal Sentinel.\n\nHer attorney, Craig Mastantuono, told the court: \"Judge Dugan wholeheartedly regrets and protests her arrest. It was not made in the interest of public safety.\" Her next court appearance is May 15.\n\nIn a statement, Wisconsin Gov. Tony Evers, a Democrat, accused the Trump administration of removing judges who don't rule in its favor and of repeatedly using \"dangerous rhetoric to attack and attempt to undermine our judiciary at every level, including disobeying the highest court in the land.\"\n\n\"I will continue to put my faith in our justice system as this situation plays out in the court of law,\" he said.\n\nEarlier this week, Dugan disputed the accuracy of local reports which claimed she had shielded theillegal migrantfrom ICE.\n\nThe Milwaukee Journal Sentinel reported that Dugan had responded to the accusations in its publication on Tuesday, writing: \"Nearly every fact regarding the 'tips' in your email is inaccurate.\"\n\nMilwaukee County Circuit Court Judge Hannah Dugan was arrested by federal agents on Friday.(Obtained by Fox News)\n\nBorder czar Tom Homan, who is responsible for implementing the Trump administration's deportation program, said no one should be surprised by the arrest surrounding Dugan and a former judge in New Mexico who was also arrested this week.\n\n\"I have said many times within the past few months, that people can choose to support illegal immigration and not assist ICE in removing criminal illegal aliens from our communities, BUT DON’T CROSS THAT LINE,\" Homan wrote on X. \"If you actively impede our enforcement efforts or if you knowingly harbor or conceal illegal aliens from ICE you will be prosecuted. These actions are felonies. More to come.\"\n\nNEW MEXICO JUDGE RESIGNS AFTER ALLEGED TDA MEMBER ARRESTED AT HIS HOME\n\nFox News Digital contacted Dugan’s office by phone on Wednesday, and a worker saidthe judgewas in court and would return the call. Fox News Digital contacted Dugan again on Thursday and has not yet received a response.\n\nAttorney General Pam Bondi blasted Dugan's actions on America Reports.\n\n\"We could not believe that a judge really did that,\" Bondi said. \"You cannot obstruct a criminal case. And really, shame on her. It was a domestic violence case of all cases, and she's protecting a criminal defendant over victims of crime.\"\n\nMexican national Eduardo Flores-Ruiz Mexican, an illegal immigrant who Milwaukee County Circuit Court Judge Hannah Dugan was arrested for allegedly helping evade arrest by U.S. Immigration and Customs Enforcement agents on Friday, faces domestic abuse charges, according to court records.(DHS/Milwaukee Independent via AP)\n\nBondi said that Flores-Ruiz had beat up two people, \"a guy and a girl.\"\n\n\"[He] beat the guy, hit the guy 30 times, knocked him to the ground, choked him, beat up a woman so badly, they both had to go to the hospital.\"\n\nFBI Director Kash Patel said Dugan deliberately obstructed the arrest.\n\nMilwaukee Mayor Cavalier Johnson criticized the Trump administration for Dugan's arrest.(WITI)\n\n\"We believe Judge Dugan intentionally misdirected federal agents away from the subject to be arrested in her courthouse, Eduardo Flores Ruiz, allowing the subject — an illegal alien — to evade arrest,\" he wrote on X. \"Thankfully, our agents chased down the perp on foot and he’s been in custody since, but the Judge’s obstruction created increased danger to the public.\"\n\nFlores-Ruiz was arrested after officials said they found probable cause that he was removable under U.S. immigration law, given he was previously deported and never sought or obtained permission to re-enter the country. When agents identified themselves to him outside the court on April 18, he fled the scene on foot but was arrested after a short chase, according to the complaint.\n\nMilwaukee Mayor Cavalier Johnson blasted the Trump administration for the arrest, labeling it as \"showboating\" and said it would have a chilling effect on people appearing before the courts.\n\n\"They're just trying to have this show of force and in the process of doing this in a courthouse where people need to go for court proceedings they're they're scaring people away from participating in the process… and that makes our community less safe,\" Johnson said in a press briefing Friday.\n\nIn a statement released later, Johnson said the Trump administration should focus more on addressing the economy and \"remedying the mistakes\" made while slashing federal programs instead of \"settling scores.\"\n\nThe FBI arrests Milwaukee County Circuit Court Judge Hannah Dugan on Friday.(Obtained by Fox News)\n\nWhen asked if Flores-Ruiz should be deported, Johnson said he didn't have any information about him.\n\n\"I'm talking specifically about the Trump administration's actions as it relates to this case and what they've been doing with immigration overall since he's been president. They're scaring people in this community. \"They're scaring people in immigrant communities all across the United States.\"\n\nThe incident comes after two people were arrested by ICE officials in the hallways of the courthouse in recent weeks, according to theMilwaukee Journal Sentinel.\n\nIt also follows a New Mexico judge and his wife who were arrested on Thursday forallegedly harboring an illegal migrantand Tren de Aragua member.\n\nState Rep. Bob Donovan,a Republican, addressed the accusations against Dugan earlier this week and said that the FBI was investigating.\n\n\"In all my years of Milwaukee politics and public safety issues, working with cops, district attorneys, and judges, I have never seen a more irresponsible act by an officer of the court, let alone a judge, if true,\" Donovan said in a statement. \"This borders on obstruction of justice and I hopethe FBIcontinues a thorough investigation and, if warranted, prosecution to the fullest extent of the law.\"\n\nREAD THE CRIMINAL COMPLAINT BELOW. APP USERSCLICK HERE.\n\nDugan has worked with legal aid organizations and as executive director of Catholic Charities in the past. She was elected to Branch 31 of the Circuit Court in 2016 and ran unopposed in the 2022 election. She primarily oversees cases in its misdemeanor division, according to the Milwaukee Journal Sentinel.\n\nSen. Dirk Durbin, D-Ill., condemned the judge's arrest, saying the Trump administration \"continues to test the limits of our Constitution.\"\n\n\"When immigration enforcement officials interfere with our criminal justice system, it undermines public safety, prevents victims and witnesses from coming forward, and often prevents those who committed crimes from facing justice in the United States,\" he said. \"How does this make America any safer? How does arresting a sitting judge make America any safer? It is imperative that Judge Dugan is afforded due process and the presumption of innocence, as required by our Constitution and her fundamental rights as an American.\"\n\nMichael Dorgan is a writer for Fox News Digital and Fox Business.\n\nYou can send tips to michael.dorgan@fox.com and follow him on Twitter @M_Dorgan.\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox"
    }
}