{
    "question": "In what ways could the DOJ’s $811 million in competitive grant cuts—some of which were quickly reversed and are subject to appeal—affect services for crime victims, specialized training initiatives, and public confidence in the department’s review process?",
    "content": {
        "source_1": "Acting on recommendations from the Department of Government Efficiency, the Justice Department is cutting grants to hundreds of programs across the country that provide services to crime victims, according to a former DOJ official familiar with the matter and documents obtained by NBC News.\n\nAttorney General Pam Bondi has reversed some of the cuts, the former official and a current Justice Department official said. One restored cut was for a program that provided funds to domestic violence shelters so that they can accommodate the pets of victims.\n\nThe current Justice Department official noted that Bondi “has been an advocate for victims of crimes against women and for animals her entire career.”\n\nJennifer Pollitt Hill, a spokeswoman for the Maryland Network Against Domestic Violence, said in an email to NBC News that the group received a cancellation notice for one of its grants, “and then 24 hours later we got an email saying that the termination notice was rescinded and our grant is still active.” She added: “I have no idea what changed, but we are grateful. All I can say is chaos, confusion and whiplash!”\n\nStaffers at Safe Futures in New London, Connecticut, which runs a domestic violence shelter and other services, were also surprised when they got a termination notice by email on Tuesday at 5:30 p.m., followed by a reversal Wednesday just after 7 p.m. in an email that read, “Please be advised that the grant award will not be terminated,” according to Margaret Soussloff, the chief operating officer.\n\nSoussloff said the money allows the shelter to take in domestic violence victims who have pets, which they consider to be part of victims' families.\n\nThe current Justice Department official said the grants “were meticulously reviewed to ensure that services to victims would not be impacted.” The official added, “If any group can prove the opposite, we allowed a 30-day appeal window and the money can be turned back on if direct impact to victims can be thoroughly established.”\n\nIt wasn’t immediately clear how a “meticulous review” was consistent with grant cuts being reversed within 24 hours.\n\nIn apost on X, Bondi announced that the Justice Department “has started cutting millions of dollars in wasteful grants.”\n\nThe Department of Justice has started cutting millions of dollars in wasteful grants. Some of the greatest hits include:$2M for “national listening sessions of individuals with lived experience”$695k for “a parallel convergent mixed-methods case study research design to…\n\n“Great work by @AGPamBondi @TheJusticeDept,”the DOGE account on X posted.\n\nA list of cuts obtained by NBC News included grants to the National Criminal Justice Association, the National Association for Victims of Crime and the National Crime Victim Law Institute. Several of the grants were described as “increasing options and expanding access for victims of crime.”\n\nThe National Center for Victims of Crime said in a statement it was notified late Tuesday that more than $2.8 million of its federal grant funding was immediately terminated because it no longer “aligned with DOJ priorities.”\n\n“Unless promptly reversed, this careless decision will result in the immediate closure of the VictimConnect Resource Center, a 100% federally funded national hotline that has served tens of thousands of crime survivors since 2015, including more than 16,000 in the last year alone,” the statement said.\n\n“We’re shocked that an administration that claims to care about protecting victims would leave so many vulnerable Americans without access to an essential lifeline,” said Renée Williams, the center's CEO, said in a statement.\n\nThe former DOJ official said that even if some of the programs are restored, the cuts will still be hugely disruptive.\n\n“When programs are halted they have to drop everything and go to great lengths to prove what we already know and could have been verified if they had just done their due diligence,” they said.\n\nNBC NewsreportedThursday that a bipartisan duo in the House had written a letter to Bondi expressing “deep concern” that the Trump administration has put at risk funding grants for programs that help survivors of domestic violence and sexual assault. That letter appears to be referring to a separate set of cuts.\n\n“This administration can’t claim to care about things like supporting crime victims, curbing gun violence, and reducing opioid deaths while slashing grants to entities that do the hard work to achieve these goals,” said Stacey Young, a former DOJ official who co-founded Justice Connection, a group dedicated to raising awareness about changes at the Justice Department.\n\nKen Dilanian is the justice and intelligence correspondent for MSNBC.\n\nLaura Strickler is the senior investigative producer on the national security team where she produces television stories and writes for NBCNews.com.",
        "source_2": "Reporting by Sarah N. Lynch and Peter Eisler; Editing by Scott Malone, Lisa Shumaker and Shri Navaratnam\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nSarah N. Lynch is the lead reporter for Reuters covering the U.S. Justice Department out of Washington, D.C. During her time on the beat, she has covered everything from the Mueller report and the use of federal agents to quell protesters in the wake of George Floyd’s murder, to the rampant spread of COVID-19 in prisons and the department's prosecutions following the Jan. 6 attack on the U.S. Capitol.",
        "source_3": "TheJustice Departmentannounced Thursday it cut more than 360 grants to work with the Department of Government Efficiency, removing millions of dollars that went toward diversity victims and feminist organizations.\n\nThe grants out of theJustice Departmentgo to state entities like police departments and prisons.\n\nAttorney General Pam Bondi reviewed thousands of grants to eliminate those that don’t align with President Trump’s goal of targeting criminals and addressing the nation’s drug epidemic.\n\nIn a press release, the department noted that grants to domestic violence and opioid victims would not be slashed.\n\nAny organization that had funding taken from it has 30 days to prove the money doesn’t go to liberal causes in order to have it returned.\n\nAccording to a DOJ press release, the department cut $1.5 million from a training program and “powerful 17-minute film documenting the journey of three Black police leaders” to “promote racial equity in police practice”; $1.5 million to a “culturally and linguistically specific, trauma-informed, and accessible services” group; and $2 million from a “feminist, culturally specific nonprofit organization” to address “structural racism and toxic masculinities.”\n\nOther cuts included $5 million to an organization that targets certain communities on “racial equity in victim services” and $1 million to a group that focuses on mitigating so-called systemic racism.\n\nThe press release also noted it eliminated $1 million in a program to “bridge socio-ecological contexts” through “culturally specific community-based organizations” and another $1 million to a group that advocates for an alternative way to solve drug crimes out of the court system.\n\n“Under Attorney General Bondi’s leadership, theDepartment of Justiceis committed to ensuring its resources are spent on arresting criminals, getting drugs off the streets, and crucial litigation,” said Gates McGavick, a spokesman for theJustice Department.\n\n“We will always protect victims of crime and legitimate law enforcement initiatives, but we will no longer spend millions on ’listening sessions’ and ’bridging socio-ecological contexts,’” the spokesman said.\n\n• Alex Swoyer can be reached ataswoyer@washingtontimes.com.\n\nCopyright © 2025 The Washington Times, LLC.Click\n                            here for reprint permission.\n\nPope Leo should tell Catholics: Marry young, have many children\n\nTrump’s TikTok delays undermine his China hawks while Intel controversy grows"
    }
}