{
    "question": "How might Judge Colleen Kollar-Kotelly’s decision to block the proof-of-citizenship provisions while allowing the mail-in ballot deadline and citizenship data-collection elements to proceed influence election administration and the legal trajectory of Trump’s executive order?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nCommissioner Donald Palmer speaks during a U.S. Election Assistance Commission Standards Board in-person public meeting, Thursday, April 24, 2025, in Charlotte, N.C. (AP Photo/Chris Carlson)\n\nCommissioner Donald Palmer speaks as General Counsel Camden Kelliher looks on, during the U.S. Election Assistance Commission Standards Board in-person public meeting, Thursday, April 24, 2025, in Charlotte, N.C. (AP Photo/Chris Carlson)\n\nGeneral Counsel, Camden Kelliher speaks at the U.S. Election Assistance Commission Standards Board in-person public meeting, Thursday, April 24, 2025, in Charlotte, N.C. (AP Photo/Chris Carlson)\n\nA meeting goer arrives for a U.S. Election Assistance Commission Standards Board in-person public meeting, Thursday, April 24, 2025, in Charlotte, N.C. (AP Photo/Chris Carlson)\n\nBen Hovland, Commissioner of the U.S. Election Assistance Commission, speaks at the National Association of Secretaries of State winter meeting, Feb. 16, 2023, in Washington. (AP Photo/Patrick Semansky, File)\n\nMaine’s Secretary of State, Shenna Bellows, listens during the U.S. Election Assistance Commission Standards Board in-person public meeting, Thursday, April 24, 2025, in Charlotte, N.C. (AP Photo/Chris Carlson)\n\nMaine’s Secretary of State, Shenna Bellows, speaks at the U.S. Election Assistance Commission Standards Board in-person public meeting, Thursday, April 24, 2025, in Charlotte, N.C. (AP Photo/Chris Carlson)\n\nCommissioner Thomas Hicks takes a picture during the U.S. Election Assistance Commission Standards Board in-person public meeting, Thursday, April 24, 2025, in Charlotte, N.C. (AP Photo/Chris Carlson)\n\nMaine’s Secretary of State, Shenna Bellows, listens during the U.S. Election Assistance Commission Standards Board in-person public meeting, Thursday, April 24, 2025, in Charlotte, N.C. (AP Photo/Chris Carlson)\n\nCommissioner Thomas Hicks speaks during the U.S. Election Assistance Commission Standards Board in-person public meeting, Thursday, April 24, 2025, in Charlotte, N.C. (AP Photo/Chris Carlson)\n\nCommissioner Thomas Hicks speaks during the U.S. Election Assistance Commission Standards Board in-person public meeting, Thursday, April 24, 2025, in Charlotte, N.C. (AP Photo/Chris Carlson)\n\nCHARLOTTE, N.C. (AP) — State and local election officials from around the country on Thursday questioned the leaders of a federal agency directed by PresidentDonald Trumpto implement parts of his sweeping election overhaul executive order, with some expressing concerns about the consequences for voters and the people in charge of voting.\n\nThe U.S. Election Assistance Commission, an independent and bipartisan federal agency, is at the center of Trump’s March 25 order that directs the commission to update the national voter registration form to include a proof-of-citizenship requirement and revise guidelines for voting systems. Trump also wants it to withhold federal money from any state that continues to accept ballots after Election Day even if they are postmarked by then.\n\nWhether the Republican president can order an independent agency to act and whether the commission has the authority to do what Trump wants willlikely be settled in court.\n\nA federal judge on Thursdayissued a preliminary injunctionblocking the proof-of-citizenship requirement from moving forward while the legal challenges over Trump’s executive order play out.\n\nMeanwhile, members of the commission’s Standards Board – a bipartisan advisory group of election officials from every state – met in North Carolina for its annual meeting. It was among the first conversations held by those who oversee the nation’s voting on the implications of Trump’s executive order.\n\nThe meeting was an opportunity for election officials to ask the four EAC commissioners about Trump’s executive order and share their concerns about its effects on election administration and voting.\n\n“I can see on your faces there’s a lot of concern in this room for this process and other aspects of it,” Commissioner Thomas Hicks said. “And I would highly encourage you to send comments to us on that.”\n\nAn election official from Utah raised concern about how Native American communities might be affected under a proof-of-citizenship requirement, while an election official from Florida asked how voting machine companies could be expected to respond when a voting system has yet to be certified to meet the latest guidelines, which were updated in 2021.\n\n“And they’re going to what — ramp up production and provide voting equipment for all 50 states and five territories?” asked Paul Lux, elections supervisor in Okaloosa County.\n\nDonald Palmer, chair of the Election Assistance Commission, sought to reassure election officials that the commission would weigh their concerns and encouraged them to continue sharing their thoughts.\n\n“Wherever we end up in this process, my goal is to provide the least disruption to the states, to mitigate any impact on you and your voting systems,” Palmer told the group.\n\nThe court ruling temporarily blocking the commission from taking steps to implement the proof-of-citizenship requirement came in a consolidated group of lawsuits filed by voting rights groups and Democrats that challenged Trump’s authority to order election changes.\n\n“Our Constitution entrusts Congress and the States—not the President—with the authority to regulate federal elections,” wrote U.S. District Judge Colleen Kollar-Kotelly in the opinion.\n\nThe judge noted Congress was currently debating legislation on a proof-of-citizenship requirement when registering to vote in federal elections and “no statutory delegation of authority to the Executive Branch permits the President to short-circuit Congress’s deliberative process by executive order.”\n\nIn response to the court ruling, Palmer said the agency would comply and was “committed to serving election officials and voters.”\n\nMaine’s chief election official, Secretary of State Shenna Bellows, was at Thursday’s meeting in North Carolina and welcomed the judge’s decision.\n\n“Everyone agrees that only citizens should vote in federal elections,” said Bellows, a Democrat. “And the Trump executive order was an unworkable and unconstitutional attempt to limit voting rights.”\n\nTwo separate groups of Democratic state officials have also filed lawsuits, and those cases are pending.\n\nThe Constitution says it’sup to statesto determine the “times, places and manner” of how elections are run, while Congress has the power to “make or alter” regulations for presidential and congressional elections. It does not grant the president any authority over how elections are administered.\n\nCongress created the Election Assistance Commission after the 2000 presidential election, which includeda contested outcome in Florida, to help states update their voting equipment.\n\nUnder the 2002 law, the commission was charged with distributing federal money for new voting equipment, creating voluntary guidelines for voting systems, establishing a federal testing and certification program for them, and overseeing the national voter registration form. It also has worked closely with the states to gather an array of data and share ideas on how to run elections more efficiently.\n\nTrump, who continues tomake false claimsabout the2020 presidential election, instructed the commission to “take appropriate action” within 30 days to require documentary proof of citizenship on the national voter registration form. The order outlines acceptable documents as a U.S. passport, a REAL ID-compliant driver’s license or official military ID that “indicates the applicant is a citizen,” or a government-issued photo ID accompanied by proof of citizenship.\n\nBoth the process for updating the national voter registration form and making changes to the nation’s voluntary voting system guidelines are outlined in federal law. For the form, that involves getting feedback from state election officials and from the agency’s advisory boards. The process for the voting system guidelines also includes a period for public comment and a hearing.\n\nThe requirement has caused widespread concern that it will disenfranchise millions of voters who don’t have a passport or ready access to their birth certificate or other documents that will prove their citizenship. Similar laws at the state level have caused disruptions, including during town elections last monthin New Hampshireand in Kansas, where a since overturned law ended upblocking the voter registrationsof 31,000 people who were citizens and otherwise eligible to vote.\n\nTrump’s order also directed the Election Assistance Commission to “take all appropriate action to cease” federal money for any state that fails to use the form that includes the proof-of-citizenship requirement, though a handful of states are exempt under federal law from using the national form.\n\nSome states would have to halt their practice of counting late-arriving mail ballots that are postmarked by Election Day. If they don’t, Trump’s executive order directs the commission to withhold election-related funding. Oregon and Washington have fileda separate lawsuitagainst the executive order, saying it would upend their elections because they rely entirely on mail voting.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Jesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current affairs and trending news. He has covered current affairs, healthcare, pop culture, and sports. Jesus joined Newsweek's U.S. bureau in 2024, and has previously worked for The Financial Times and served as an international reporter and newsletter editor for El Espectador in Colombia. He graduated with an M.A. in Journalism and Digital Innovation from New York University. Languages: English, Spanish. You can get in touch with Jesus by emailingj.mosquera@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nA federal judge on Thursday blocked major components of PresidentDonald Trump's sweeping executive orderseeking to overhaul U.S. election procedures, ruling that his administration likely overstepped constitutional boundaries.\n\nU.S. District Judge Colleen Kollar-Kotelly, appointed by GOP icon former President Ronald Reagan and elevated under former PresidentBill Clinton, issued a preliminary injunction halting provisions of the March executive order that would have added a proof-of-citizenship requirement to the National Mail Voter Registration Form.\n\nThe judge also froze efforts to require public assistance applicants to verify citizenship before accessing federal voter registration materials.\n\nTrump's order, signed on March 25, tasked the U.S. Election Assistance Commission (EAC) with implementing changes that, critics argued, would disenfranchise millions of voters.\n\nVoting rights organizations and Democratic groups immediately filed suit, arguing that the directive violated the Constitution's Elections Clause, which grants states—not the federal executive—the authority to regulate elections.\n\nThe decision represents a fresh setback for Trump, who has argued that the requirement is necessary to restore public confidence in elections.\n\nIn a 120-page ruling, the judge stated that the plaintiffs had demonstrated the proof-of-citizenship requirement would inflict irreparable harm on their clients and run counter to the public interest. Meanwhile, the government offered \"almost no defense of the President's order on the merits.\"\n\n\"The President is free to express his views on the policies he believes should be considered,\" Kollar-Kotelly wrote. \"But here, he has issued an 'Order' directing an independent commission to 'require' changes in areas tightly regulated byCongress.\"\n\nThe judge also struck down a portion of Trump's executive order that would have required public assistance recipients to verify their citizenship before accessing the federal voter registration form.\n\nThe plaintiffs in the case included the League of Women Voters, League of United Latin American Citizens (LULAC) and theDemocratic National Committee.\n\nTrump's administration argued that no harm had occurred because the provisions had not been enforced. During an April 17 court hearing, Trump attorney Michael Gates said a preliminary injunction wasn't warranted because the order hadn't been implemented, according to the Associated Press (AP).\n\nThe Justice Department's Civil Rights Division expressed disappointment with the ruling. \"Few things are more sacred to a free society—or more essential to democracy—than the protection of its election systems,\" said Harmeet Dhillon, assistant attorney general for civil rights.\n\nBut the judge allowed other aspects of Trump's sweeping executive order on elections to proceed for now, including a directive to tighten mail-in ballot deadlines nationwide.\n\nShe also declined to block Trump's directive opening certain databases toElon Musk's Department of Government Efficiency, which seeks to examine state voter rolls for noncitizens. The judge said theDemocrats' objections were either premature or better suited for state-level litigation.\n\nRoman Palomares, national president of LULAC, told the AP:\"Our democracy depends on all voters feeling confident that they can vote freely and that their vote will be counted accurately.\"\n\nTrump has long spoken out on his worries and grievances about voter fraud, most notably after he lost the 2020 election to former PresidentJoe Biden, when he repeatedly claimed the Democrats stole it. Trump's legal team is likely to challenge the injunction in appellate court. If the appeals court rules differently, the blocked provisions could be temporarily reinstated.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nJesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current affairs and trending news. He has covered current affairs, healthcare, pop culture, and sports. Jesus joined Newsweek's U.S. bureau in 2024, and has previously worked for The Financial Times and served as an international reporter and newsletter editor for El Espectador in Colombia. He graduated with an M.A. in Journalism and Digital Innovation from New York University. Languages: English, Spanish. You can get in touch with Jesus by emailingj.mosquera@newsweek.com\n\nJesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current affairs and trending news. He has covered current affairs, healthcare, pop culture, and sports. Jesus joined Newsweek's U.S. bureau in 2024, and has previously worked for The Financial Times and served as an international reporter and newsletter editor for El Espectador in Colombia. He graduated with an M.A. in Journalism and Digital Innovation from New York University. Languages: English, Spanish. You can get in touch with Jesus by emailingj.mosquera@newsweek.com\n\nJesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current                                    ...Read more",
        "source_3": "Rep. Mike Lawler, R-N.Y., discusses how Democrats are continuing to push back on requiring voters to show proof of citizenship on ‘The Ingraham Angle.’\n\nA federal judge in Washington, D.C., on Thursday blocked a portion of President Donald Trump's executive order on election integrity, specifically provisions related to providing documentary proof of citizenship before being allowed to register to vote.\n\nJudge Colleen Kollar-Kotelly of the U.S. District Court for the District of Columbia handed down the order in response to lawsuits filed by three separate groups of plaintiffs over five different provisions in aMarch 25 Trump executive orderrelating to election integrity. While Kollar-Kotelly dismissed requests to block three of the provisions, requests to block two other provisions pertaining to a proof of citizenship requirement for voters were granted.\n\nThe first blocked provision sought to compel the Election Assistance Commission to amend standardized national voter registration forms to require documentary proof of citizenship. The second sought to require federal agencies offering voter registration to people on public assistance to \"assess\" the individual's citizenship status before doing so.\n\nCITIZENSHIP VOTER REGISTRATION BILL IS ‘COMMON SENSE,’ GOP LAWMAKER ARGUES\n\nPresident Donald Trump issued an executive order on March 25 calling for various provisions to strengthen the integrity of elections, including proof-of-citizenship requirements for voters.(Donald Trump | Reuters)\n\n\"Our Constitution entrusts Congress and the States — not the President — with the authority to regulate federal elections. Consistent with that allocation of power,Congress iscurrently debating legislation that would effect many of the changes the President purports to order,\" Kollar-Kotelly, a Clinton-appointee, wrote in her order. \"No statutory delegation of authority to the Executive Branch permits the President to short-circuit Congress’s deliberative process by executive order.\"\n\nKollar-Kotelly said she would not block the other provisions that the groups sought to challenge, which cover mail-in ballots and data collection on citizenship status, calling the challenges \"premature\" and indicating they would be best challenged at the state level.\n\nEarlier this month, the Republican-ledHouse of Representativespassed a bill requiring proof-of-citizenship to vote in federal elections. The measure still must passthe Senate,however, before the president can sign it into law.\n\nTOP OFFICIAL APPLAUDS RED STATE'S HISTORIC LEGISLATION REQUIRING PROOF OF CITIZENSHIP TO VOTE: ‘HUGE WINNERS’\n\nMeanwhile, 25 states are considering some form of proof-of-citizenship legislation, according to theVoting Rights Lab,which is tracking such legislation. In total, 15 state constitutions have explicit prohibitions against non-citizen voting.\n\nJudge Colleen Kollar-Kotelly's order blocks two proof-of-citizenship requirements that Trump tried to usher through via executive order.(Getty Images)\n\nIn addition to Trump's proof-of-citizenship orders getting shot down, two other federal judges from Maryland and New Hampshire also shot down additional orders from the president related to ending diversity, equity and inclusion (DEI) programs in K-12 public schools on Thursday.\n\nThe rulings followed lawsuits filed by the National Education Association, the American Civil Liberties Union and the Maryland chapter of the American Federation of Teachers. The groups argued that making federal funding contingent on whether educators squash their DEI programs violates First Amendment rights granted by the Constitution.\n\nFox News Digital reached out to theWhite Housefor comment on this article but did not receive a response in time for publication.\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox"
    }
}