{
    "question": "How might a Supreme Court ruling for the parents in this Maryland K-5 LGBTQ+ books case influence public schools’ approaches to parental opt-outs, religious-liberty claims, and inclusive curriculum goals?",
    "content": {
        "source_1": "WASHINGTON — The Supreme Court on Tuesday appeared likely to rule for parents in Maryland who objected on religious grounds to books made available in a school district's elementary schools that feature stories aboutgay and transgendercharacters.\n\nMembers of the 6-3 conservative majority, which often backs religious rights, seemed sympathetic during the lively 2½-hour oral argument toward the parents’ claims that the Montgomery County Board of Education violated their religious rights by failing to provide an opt-out for their children.\n\nSome justices indicated that the board's refusal to provide an opt-out might have been motivated by hostility toward religion. A ruling is due by the end of June.\n\nAt issue are books included in the English language arts curriculum in Montgomery County. The dispute arose in 2022 after the school board in the large and diverse jurisdiction just outside Washington decided it wanted more storybooks reflecting LGBTQ stories to better reflect the people who live there.\n\nAhead of oral arguments, dueling rallies took place outside the court, with LGBTQ activists holding rainbow-colored umbrellas and one holding a sign saying, \"I will not stay silent.\"\n\nA few yards away, a group supporting the challengers held signs that read \"Let parents parent.\"\n\nOne book, \"Uncle Bobby’s Wedding,\" features a gay character who is getting married. Another, called \"Born Ready,\" is about a transgender child who wants to identify as a boy.\n\nSome parents, including Muslims and Orthodox Christians, objected on religious grounds under the Constitution's First Amendment, saying their children should be able to opt out of any exposure to the content.\n\nConservative Justice Neil Gorsuch was one of several justices who raised comments made by a former member of the school board, Lynne Harris.\n\nShe had suggested in a media interview cited in court papers that a student who objected to the books was \"parroting dogma\" passed on by her parents and compared their complaints to those of white supremacists who opposed civil rights laws.\n\n“Does that suggest a hostility toward religion?” Gorsuch asked, citing a 2018 ruling in whichthe court ruledfor a Christian baker who refused to serve a gay couple on the grounds that a state civil rights commission had shown anti-religious animus.\n\nOther conservative justices expressed disbelief that the school board found it too difficult to provide an opt-out.\n\n“Why isn’t that feasible?” Justice Samuel Alito asked.\n\n“I’m not understanding why it’s not feasible,” Justice Brett Kavanaugh added.\n\nChief Justice John Roberts seemed skeptical of the school board's argument that the policy did not require the children to affirm or support the content of the books.\n\n\"Is that a realistic concept when you are talking about a 5-year-old?\" he asked.\n\nAlong similar lines, Justice Amy Coney Barrett said the content of the books appeared to be presenting children with more than just neutral facts about the existence of LGBTQ people in society.\n\n\"It's not just exposure to the idea, right?\" she asked. \"It's saying this is the right view of the world. This is how we think about things. This is how you should think about things. This is like 2 plus 2 is 4.\"\n\nLiberal justices were more sympathetic to the school board, with Justice Elena Kagan wondering whether a ruling for the parents would lead to an increase in religious objections and, in some situations, lead schools to have to abandon some aspects of the curriculum altogether because of the difficulty of providing opt-outs.\n\n\"So I'm just wondering if that's the next step here,\" she said.\n\nFellow liberal Justice Ketanji Brown Jackson also appeared skeptical, noting that parents have other options if they do not like what their children are taught in school.\n\n\"If the school teaches something that the parent disagrees with, you have a choice. You don't have to send your kid to that school,\" she said.\n\nJustice Sonia Sotomayor, the other member of the liberal minority, questioned how much exposure to the contested contents children actually had.\n\n\"Haven't we made very clear that the mere exposure to things that you object to is not coercion?\" she said.\n\nShe referred to \"Uncle Bobby's Wedding,\" wondering whether a religious objection could be based solely on the depiction of two men getting married.\n\n\"None of them are even kissing in any of these books. The most they are doing is holding hands,\" she said.\n\nAlito, focusing on the same book, took a different view of the same content.\n\n\"The book has a clear message, and a lot of people think it's a good message, and maybe it is a good message, but it's a message that a lot of people who hold on to traditional religious beliefs don't agree with,\" he said.\n\n\"I don't think anybody can read that and say, 'Well, this is just telling children that there are occasions when men marry other men,'\" he added.\n\nThe lead plaintiffs are Tamer Mahmoud and Enas Barakat — a Muslim couple who have a son in elementary school. Other plaintiffs are members of the Catholic and Ukrainian Orthodox churches.\n\nThey are not challenging the curriculum itself, just the lack of an opt-out.\n\nA federal judge and the Richmond, Virginia-based 4th U.S. Circuit Court of Appeals both ruled in favor of the school board.\n\nThe Supreme Court will determine whether the school board policy burdens religious rights. The justices could then determine whether that burden violates the Constitution, or they could send the case back to lower courts to make that determination.\n\nThe parents, represented by the religious liberties group Becket, say that under Supreme Court precedent, they have a right to opt out of any instruction that would interfere with their children’s religious development.\n\nThe school board is “compelling instruction designed to indoctrinate petitioners’ children against their religious beliefs,” the parents’ lawyers wrote.\n\nThe parents have the backing of the Trump administration.\n\nLawyers for the school board said in court papers that there is no attempt to coerce children and that there was an attempt to allow an opt-out \"until doing so became unworkably disruptive.\"\n\nThe lawyers wrote that the court record is \"devoid of evidence that petitioners or their children are compelled or pressured to modify their religious beliefs or practice.\"\n\nThe school board also asserts that although the books are in classrooms and available for children to pick up, teachers are not required to use them in class.\n\nThe Supreme Court has previously backed religious rights in cases involving conflicting arguments made by LGBTQ rights advocates. In 2023, for example, the courtruled in favorof a Christian web designer who refused to work on same-sex weddings.\n\nThe court is hearing anothermajor religious casenext week when it considers whether to approve the country's first public religious charter school.\n\nIn its next term, which starts in October, the court will consider a challenge to state laws that ban \"conversion therapy\" aimed at young people questioning their sexual orientations or gender identities.\n\nLawrence Hurley is a senior Supreme Court reporter for NBC News.",
        "source_2": "The Supreme Court will hear oral arguments on Tuesday in the first of two cases in April involving religion and public schools. InMahmoud v. Taylora coalition of parents from Montgomery County, Md., contend that requiring their children to participate in instruction that includes LGBTQ+ themes violates their religious beliefs and thus their First Amendment right to freely exercise their religion.\n\nMontgomery County, in the suburbs of Washington, D.C., is the largest school district in Maryland and one of the country’s most religiously diverse counties. The dispute before the justices on Tuesday began in 2022, when the county approved books featuring LGBTQ+ characters for inclusion in its language-arts curriculum. One book used for young children,Pride Puppy, tells the story of a puppy that gets lost during a Pride parade. Another book tells the story of a girl attending her uncle’s same-sex wedding.\n\nWhen the county announced in 2023 that it would not allow parents to opt to have their children excused from instruction involving the storybooks, a group of Muslim, Catholic, and Ukrainian Orthodox parents went to federal court. They contended that the refusal to give them the option to opt their children out violated their constitutional right to freely exercise their religion – specifically, their ability to instruct their children on issues of gender and sexuality according to their faith and to control when and how these issues are introduced to their children.\n\nThe lower courts rejected the parents’ request for an order that would temporarily require the county, while the litigation continued, to notify the parents when the storybooks would be used and give them a chance to opt out of instruction. The U.S. Court of Appeals for the 4th Circuit explained that on the “threadbare” record before it, the parents had not shown that exposure to the storybooks compelled them to violate their religion.\n\nThe parents came to the Supreme Court in September, and the justices agreed to take up their case.\n\nIn their brief in the Supreme Court, the parents point to two different Supreme Court cases. First, they say, more than 50 years ago inWisconsin v. Yoder, the justices “recognized ‘beyond debate’ the First Amendment right of parents ‘to guide the religious future and education of their children.’” This means, they say, that under the free exercise clause, parents can opt out of instruction that would “substantially interfere with their religious development.”\n\nInYoder, the parents observe, the court held that Amish parents did not have to send their children to school after the eighth grade, because they believed that doing so conflicted with their religion and way of life. Here, the parents say, they are merely seeking to be able to excuse their young children from one particular subset of the public schools’ instruction that “deliberately seeks to confound their religious values.”\n\nAnd under the Supreme Court’s 1993 decision inChurch of Lukumi Babalu Aye v. City of Hialeah, the parents continue, the school board’s policy is unconstitutional because it is neither neutral nor generally applicable. The board of education, the parents stress, has “long allowed notice and opt-outs for any ‘instruction related to family life and human sexuality.’” But by contrast, the parents write, they cannot opt to have their very young children sit out discussions on “sexuality and gender identity during English class.” Moreover, they add, board members have displayed “explicit religious hostility” to the parents who have objected to the curriculum, suggesting that they were aligned with “white supremacists” and “xenophobes.”\n\nThe Trump administration filed a brief supporting the parents. Sarah Harris, then the acting solicitor general, told the justices that because the county will not notify the parents before the LGBTQ-themed storybooks are used or give them an opportunity to opt out of instruction using those books, parents can only comply with their religious obligations to their children by withdrawing their children from public school altogether. “That,” Harris contends, “is textbook interference with the free exercise of religion” – even if the parents’ children do not ultimately feel pressured or coerced by the instruction using the storybooks.\n\nThe Montgomery County Board of Education (along with the superintendent of schools, Thomas Taylor, and members of the board) counter that under both the Constitution and the Supreme Court’s cases interpreting the free exercise clause, the parents must show that either they or their children are being coerced to change their religious beliefs or practice. The Supreme Court, they contend, has never held that when parents opt to send their children to public schools, their children’s exposure to material to which their parents have religious objections is the kind of coercion needed to establish a claim under the free exercise clause, and it should not do so here.\n\nThe board cautions that accepting the parents’ argument that the lack of an opt-out option imposes a burden on their religious beliefs would “leave public education in shreds” “by entitling parents to pick and choose which aspects of the curriculum will be taught to their children.”\n\nBut in any event, the board continues, the parents have not shown that in this case that there has been any coercion. They have not provided any evidence, the board stresses, “that any parent or child was penalized for his or her religious beliefs, asked to affirm any views contrary to his or her faith, or otherwise prohibited or deterred from engaging in religious practice.”\n\nThe Supreme Court, the board writes, should not consider the parents’ argument that the policy is not neutral and generally applicable, because they did not make it in the lower courts. But in any event, the board adds, the policy is in fact both of those things: “It treats comparable religious and secular activity exactly the same; no opt-outs from ELA lessons using the storybooks are permitted.” And there is no indication that the policy was based on a hostility to religion. Instead, MCPS decided to stop the opt-outs because it received too many requests that werenotbased on religion.\n\nA decision in the case is expected by late June or early July.",
        "source_3": "The Supreme Court appeared on Tuesday to lean in favor of a group of religious parents whosued a Maryland school boardover its refusal to allow their K-5 children to opt out of LGBTQ+ curriculum.\n\nIn 2022, the Montgomery County Board of Education announced new “inclusivity” books for K-5 students and took away parental notice and opt-outs for story books that discuss topics like “gender” transitions, pride parades, and preferred pronouns. Some of the reading materials includeThe Pride Puppy,Uncle Bobby’s Wedding, andBorn Ready: The True Story of a Boy Named Penelope.\n\nIn 2023, a federal courtuphelda lower court decision siding with Maryland’s largest school district, and the mix of Christian, Muslim, and Jewish parents appealed to the Supreme Court. The Supreme Courtagreedto take up the case in January.\n\nIn theirpetition,parents ultimately asked the Supreme Court to answer: “Do public schools burden parents’ religious exercise when they compel elementary school children to participate in instruction on gender and sexuality against their parents’ religious convictions and without notice or opportunity to opt out?”\n\n“The [school] board does not dispute that under its theory, it could compel instruction using pornography, and parents would have no rights,” argued Eric Baxter, the Becket Fund for Religious Liberty attorney representing the parents.\n\n“The First Amendment demands more. Parents, not school boards, should have the final say on such religious matters.”\n\nJustice Amy Coney Barrett noted during oral arguments that the high court “[does not] have to decide whether you get the opt-out.”\n\n“We just have to decide if the 4th Circuit accurately defined what a burden is,” she said.\n\nBarrett later seemed worried that the LGBTQ+ materials were not only about exposing young students to different ideas, but about trying to make student think “this is the right view of the world” and “how you should think.”\n\nJustice Brett Kavanaugh at one point said he is “a bit mystified, as a lifelong resident of the county, how it came to this.”\n\nLater, Kavanaugh told the school board’s attorney, Alan Schoenfeld:\n\nI guess I’m just not understanding. The whole goal, I think, of some of our religion precedents is to look for the win/win, to look for the situation where you can respect the religious beliefs and accommodate the religious beliefs while the state or city or whatever it may be can pursue its goals.\n\n“And, here, they’re not asking you to change what’s taught in the classroom. They’re not asking you to change that at all. A lot of the rhetoric suggests that they might have — that — that they were trying to do that, but that’s not what they’re trying to do,” he continued. “They’re only seeking to be able to walk out so that they don’t have — so the parents don’t have their children exposed to these things that are contrary to their own beliefs.”\n\nJustice Samuel Alito pressed Schoenfeld on why the schools decided not to accommodate students when they have opt-outs for other materials and subjects.\n\n“Well, the — the plaintiffs here are not asking the school to change its curriculum. They’re just saying, look, we want out. Why isn’t that feasible? What is the big deal about allowing them to opt out of this?” Alito said.\n\nAt another point, Justice Neil Gorsuch essentially got Schoenfeld to admit that the school board included the books in the curriculum to “influence” young minds.\n\n“So Pride Puppy was the book that was used for the prekindergarten curriculum. That’s no longer in the curriculum,” Schoenfeld said.\n\n“That’s the one where they are supposed to look for the leather and things — and bondage, things like that, right?” Gorsuch asked.\n\n“It’s not bondage,” Schoenfeld replied. “It’s a woman in leather.”\n\nJustice Barrett later interjected and said it was a “drag queen,” to which Schoenfeld said “correct.”\n\n“Yeah. Okay. And your — you’ve included these in the English language curriculum rather than the human sexuality curriculum to influence students, is that fair? That’s what the district court found. Do you agree with that?” Gorsuch continued.\n\n“I think, to the extent the district court found that it was to influence, it was to influence them towards civility, the natural consequence of being exposed to —” Schoenfeld replied.\n\n“Whatever, but to influence them,” Gorsuch interjected.\n\nThe liberal-leaning justices seemed concerned about how to define “burden.”\n\n“How do we make very clear that the mere exposure to things that you object to is not coercion?” Justice Sonia Sotomayor asked Baxter.\n\nJustice Ketanji Brown Jackson stated that parents “can choose to put their kid elsewhere” instead of public schools if they do not believe with what is being taught.\n\n“I guess I’m struggling to see how it burdens a parent’s religious exercise if the school teaches something that the parent disagrees with,” she admitted. “You have a choice, you don’t have to send your kids to that school.”\n\nJackson also claimed: “We don’t at this moment, based on the record you’ve provided, know that these books aren’t just sitting on the shelves.”\n\nHowever, the question had already been addressed early in oral arguments when conservative leaning Justice Clarence Thomas asked Baxter how the record “shows that the children are more than merely exposed to the — these sorts of things in the storybooks?”\n\n“We know that the — the teachers are required to use the books. When the books were first introduced in August of 2022, the Board suggested they be used five times before the end of the year,” Baxter said, citing transcripts and evidence submitted to the court. “One of the schools, the Sherwood School, in June, for Pride Month, said that they were going to read one book each day to celebrate Pride Month. The Board’s own testimony through Superintendent Hazel said that the books must be used as part of the instruction and…that discussion will ensue.”\n\n“That was the entire point of withdrawing the opt-outs and removing even notifying parents. They’re not even allowed to know,” Baxter explained. “The Board said in that statement it was so that every student would be taught from the inclusivity storybooks.”"
    }
}