{
    "question": "How might Trump’s public criticism of Putin and call for a peace deal following the latest deadly strikes on Kyiv affect diplomatic calculations among the parties to the Ukraine war?",
    "content": {
        "source_1": "At least 12 people were killed and over 100 were injured, officials said.\n\nLONDON --At least 12 people were killed and more than 100 were injured in an overnight Russian attack on several districts and residential areas in Kyiv, Ukrainian officials said on Thursday, prompting PresidentDonald Trumpto issue a directive to Russian President Vladimir Putin: \"Vladimir, STOP!\"\n\n\"I am not happy with the Russian strikes on KYIV. Not necessary, and very bad timing,\" Trump said on social media Thursday. \"Vladimir, STOP! 5000 soldiers a week are dying. Lets get the Peace Deal DONE!\"\n\nWhen asked by a reporter at the White House on Thursday if he thinks Putin will listen to him, Trump responded, \"I do, yeah.\"\n\nUkrainian President Volodymyr Zelenskyy called Russia's attack on Kyiv one of the war's most \"intense and brazen\" at a press conference during his visit to South Africa on Thursday.\n\nThe Russian attack came amid intensifying negotiations to end the war, with White House officials pressuring Zelenskyy and Ukraine to accept a potential peace plan that may include ceding land to Russia, according to a senior Ukrainian official. Trump on Wednesday accused Zelenskyy of prolonging \"the killing field.\"\n\nAt the White House on Thursday, Trump said he has a \"deadline\" for negotiations to achieve a peace deal for the war in Ukraine and wants an agreement \"fast.\"\n\n\"So we are thinking that very strongly that they both want peace, but they have to get to the table,\" he said. \"We're waiting a long time. They have to get them to the table. And I think we're going to get peace.\"\n\nAsked what concessions Russia has offered up to get closer to peace, Trump said, \"Stopping the war. Stopping, taking the whole country. Pretty big concession.\"\n\nFollowing the strike in Kyiv, Zelenskyy said he does not see signs of strong U.S. pressure on Russia.\n\n\"We believe that with greater pressure on the Russian Federation, we will be able to bring our sides closer, if you like. Although we are close,\" he said.\n\nZelenskyy, who is traveling in South Africa, said earlier Thursday that he would cancel part of his planned visit and return to Ukraine earlier than expected.\n\n\"It is extremely important that everyone around the world sees and understands what is really happening,\" he said. \"Nearly 70 missiles, including ballistic ones. And about 150 attack drones.\"\n\nZelenskyy claimed the Russians used a ballistic missile manufactured in North Korea in the Kyiv attack, citing preliminary information.\n\n\"If the information that this missile was made in North Korea is confirmed, this will be further proof of the criminal nature of the alliance between Russia and Pyongyang,\" he said. North Korea has alsosupplied over 12,000 ground troopsfor the war, according to U.S. estimates.\n\nAt least 100 people were injured in the attacks Thursday, according to Zelenskyy.\n\nAt least 12 children were among the injured, according to Tymur Tkachenko, head of the Kyiv City Military Administration.\n\nTwenty-five residential buildings were hit during the attack, Ukrainian police said.\n\n\"Overnight, Russia held a massive attack on Ukraine,\" the Ministry of Defense said. \"Cruise missiles, drones, ballistic weapons -- yet another strike on peaceful cities and Ukrainian homes.\"\n\nKremlin spokesperson Dmitry Peskov confirmed the strike, saying the Russian \"military continues to fulfill its tasks, which are set by the supreme commander-in-chief.\" He added that military orders from Moscow include striking \"military and near-military targets.\"\n\nRescue operations were continuing early on Thursday in the capital, where first responders were digging through the rubble of residential buildings for survivors, defense officials said.\n\n\"These attacks are yet another confirmation -- Russia is not seeking peace. It continues to kill Ukrainians,\" the ministry said on social media.\n\nThe Kyiv mayor declared Friday, April 25, a day of mourning in memory of the victims of the attack on the capital.\n\nOutside of Kyiv, Russia also targeted the Zhytomyr, Dnipropetrovsk, Kharkiv, Poltava, Khmelnytskyi, Sumy and Zaporizhzhia regions overnight into Thursday, the ministry said.\n\n\"While claiming to seek peace, Russia launched a deadly airstrike on Kyiv,\" Kaja Kallas, the European Union's high representative for Foreign Affairs, said on social media. \"This isn't a pursuit of peace, it's a mockery of it. The real obstacle is not Ukraine but Russia, whose war aims have not changed.\"",
        "source_2": "President Donald Trump told Time Magazine that “Crimea will stay with Russia”—a concession Ukraine has strenuously objected to—a day after Trump issued rare criticism of Russian President Vladimir Putin as the U.S. continues to try negotiating a peace agreement.\n\n“Crimea will stay with Russia,” Trump toldTime, suggesting, “[Ukrainian President Volodymyr] Zelenskyy understands that, and everybody understands that it’s been with [Russia] for a long time.”\n\nRussia forcibly annexed the Crimean Peninsula shortly after invading Ukraine in 2014, and Zelenskyy has repeatedly refused to surrender the Russian-occupied territory in peace talks with Russia in the latest conflict, for which Trump recently accused the Ukrainian leader of prolonging the “killing field.”\n\nTrump on Fridaywroteon Truth Social saying work on a peace deal between Ukraine and Russia was “going smoothly,” though he noted Zelenskyy had not yet signed a minerals deal despitesignalinghis approval in March.\n\nWhile speaking in the Oval Office on Thursday, Trump said Russia agreed to “pretty big concessions” to end the war in Ukraine by no longer saying he wants “the whole country,” hours after he pleaded with Putin on Truth Social to “get the peace deal DONE!”\n\nTrump’s request to accelerate peace talks came with a rare criticism of Putin, as Trump noted he was “not happy with the Russian strikes on KYIV” earlier on Thursday, which Zelenskyy said killed at least nine people, with Trump saying they were “not necessary, and very bad timing. Vladimir, STOP!”\n\nTrump, who said he believed “Russia is ready” for a peace deal, has said he “thought it might be easier to deal with Zelenskyy” than Putin, though “so far, it’s been harder, but that’s OK.”\n\nGet Forbes Breaking News Text Alerts:We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign uphere.\n\nTrump’s envoy Steve Witkoff met with Putin in Moscow on Friday, though details of their meeting have not been disclosed. Yuri Ushakov, Putin’s foreign policy aide, and envoy for international cooperation Kirill Dmitriev were alsoreportedlypresent.\n\n“I am not happy with the Russian strikes on KYIV. Not necessary, and very bad timing,” TrumpwroteThursday. “Vladimir, STOP! 5000 soldiers a week are dying. Let's get the Peace Deal DONE!\n\nIn March, Trump toldNBC Newshe was “very angry” and “pissed off” after Putin criticized the legitimacy of Zelenskyy’s leadership, suggesting Putin’s criticism was “not going in the right direction.” Trump, who threatened to impose tariffs on “all oil coming out of Russia,” previouslyaccusedZelenskyy of being a “dictator” who “refuses to have elections,” though he later appeared to walk back his statement. Trump issued critical statements on Putin shortly after his inauguration in January,reportedlysaying he believed Putin was “destroying Russia” as conflict continued in Ukraine. “Russia is bigger, they have more soldiers to lose, but that’s no way to run a country,” Trump said. Trump alsocondemnedPutin during his first presidency, accusing Putin in 2018 of being “mindless” and an “animal” for what he claimed were chemical attacks in Syria. Despite his criticism, TrumppraisedPutin earlier that year and said the Russian leader was “extremely strong and powerful.”\n\nA feud between Trump and Zelenskyy escalated in the weeks after Trump’s inauguration, as Trump called on the Ukrainian leader to accelerate peace talks. In February, Trump called on Zelenskyy to “move fast” to achieve peace or “he is not going to have a country left.” Zelenskyy responded by claiming Trump has “helped Putin out” by holding talks without inviting Ukrainian officials, as hewarnedUkraine would not accept a peace deal if only Trump and Russia were involved in negotiations. At the time, Trumpsaidhe believed he and Zelenskyy “have a very good relationship.” During Zelenskyy's visit to the White House on Feb. 28, ameetingbetween Zelenskyy, Trump and Vice President JD Vance in the Oval Office quickly became tense and verged on a shouting match. In the meeting, Vance defended Trump’s push for a peace deal with Putin, suggesting the “path for peace” included “engaging in diplomacy,” to which Zelenskyy responded by arguing Putin was unreliable. Vance accused Zelenskyy of being “disrespectful,” while Trump claimed Zelenskyy was “gambling with World War III.”\n\nTrump hasclaimedfor years he would have Ukraine’s war with Russia “settled in one day,” while alsosuggestingRussia would never have invaded Ukraine if the U.S. had a “real president.” He attempted to broker a peace deal between Ukraine and Russia in February, though the Trump administration held talks without any Ukrainian delegates present. Ukraineagreedin March to an immediate 30-day ceasefire in negotiations with the U.S., which said at the time, “the ball is now in [Russia’s] court.” Terms of the ceasefire and what concessions, if any, Ukraine and Russia would have to make in the deal are unknown, though Zelenskyy hassaidUkraine needs to be in a “strong position” to accept a peace deal and that lasting security guarantees are needed. Earlier this week, Putinsaidhe was open to hold direct talks with Ukraine for the first time, after Secretary of State Marco Rubio expressed frustration about the lack of progress and said the U.S. was prepared to “walk away” from negotiations.\n\nPutin Says Russia Is Open To Direct Talks With Ukraine—After U.S. Threatens To Leave Negotiations(Forbes)",
        "source_3": "President Trump blasted Vladimir Putin on Thursday and urged the Russian president to “STOP!” after Moscow launched itsdeadliest attack on Ukraine in almost a yearovernight.\n\n“I am not happy with the Russian strikes on KYIV,” Trumpraged in a Truth Social post.\n\n“Not necessary, and very bad timing. Vladimir, STOP! 5000 soldiers a week are dying. Lets get the Peace Deal DONE!”\n\nHis rare criticism of Putin came soon after Russia struck Kyiv with an hours-long barrage of missiles and drones — killing at least nine and wounding more than 70.\n\nUkrainian President Volodymyr Zelenskybranded the attack, which is the deadliest there since last July, as “one of the most outrageous.”\n\nHe also pointed out that Russia has continued to rebuke Trump’s cease-fire proposal for a month and a half.\n\n“This was a proposal from the United States,” he said. “And it has been 44 days of Russia continuing to kill our people and evading tough pressure and accountability for its actions.”\n\nDespite this, Trump on Wednesday questioned Kyiv’s readiness to reach a peace deal, claiming without proof that Moscow was “ready” to end its war.\n\nSecretary of State Marco Rubioon Thursday said he didn’t know if a peace deal would be signed “by the end of the week” as Trump had hoped, according to the Kyiv Independent.\n\n“I’m hopeful that we can get to something quickly,” he said. “And I remain hopeful that we can get something done because this is a terrible war and it needs to end.”\n\nHowever, he noted that the Trump administration may not be able to solve the conflict, after all.\n\n“We have a better understanding of (the Russian position) now — because we’ve actually spoken to them after three years of not speaking to them — what is the Ukrainian position, and figure out, ‘are these guys even in the same neighborhood because of their completely different zip codes?’” he said.\n\n“Then, we may have to conclude that they’re so far apart that peace is impossible at this time,” he added.\n\nHe still expressed hope that “we can be successful, but ultimately it’s not up to us.”\n\n“It’s up to Russia, and it’s up to Ukraine,” he said. “They have to make the decision that they’re willing to move closer to one another, and we need to start to see progress.”"
    }
}