{
    "question": "How might Trump’s warning and the US-proposed ceasefire along current front lines—paired with Kyiv’s refusal to recognize Russia’s control of Crimea—shape Ukraine’s negotiating leverage and the chances of a durable settlement?",
    "content": {
        "source_1": "President Donald Trump slammed Ukraine’s President Volodymyr Zelensky on Wednesday for his comments that Ukraine wouldn’t recognize Russian control of Crimea, calling the remarks “very harmful to the Peace Negotiations with Russia.”\n\n“It’s inflammatory statements like Zelenskyy’s that makes it so difficult to settle this War. He has nothing to boast about! The situation for Ukraine is dire — He can have Peace or, he can fight for another three years before losing the whole Country,” heposted on Truth Social.\n\nAny move to recognize Russia’s control of Crimea would reverse a decade of US policy and could upset the widely held post-World War Two consensus that international borders should not be changed by force.\n\nRussian missiles struck Ukraine’s capital city Kyiv and the country’s second largest city Kharkiv hours after Trump’s post, Ukrainian authorities said, with at least nine people killed and some 70 wounded in the latest attacks.\n\nTrump’s comments came after a meeting in London aimed at bringing about an end toRussia’s war in Ukrainehad been downgraded after US Secretary of State Marco Rubio said he wouldn’t attend.\n\nRubio had been expected to take part in the discussions with Ukrainian, UK and European officials, but State Department spokesperson Tammy Bruce said Tuesday that he would no longer attend due to “logistical issues,” though a US official and two European diplomats familiar with the matter said the top US diplomat didn’t go because the administration did not feel that they were at a decisive point in the ongoing talks and Rubio didn’t feel attending would be the best use of his time.\n\n“It was better to let talks play out than create the illusion that a breakthrough was imminent,” said one of the European diplomats.\n\n“Emotions have run high today,” Zelensky said on X Wednesday after the talks.\n\nIn what seemed to be an indirect response to Trump’s criticism of Zelensky being unwilling to recognize Russian control of Crimea, Zelensky vowed Kyiv would abide by its constitution: “Ukraine will always act in accordance with its Constitution and we are absolutely sure that our partners - in particular the USA - will act in line with its strong decisions.”\n\nZelensky shared a screenshot of former Secretary of State Mike Pompeo’s 2018 Crimea Declaration which rejected Russia’s occupation of the peninsula.\n\nBritain’s Foreign Office had confirmed earlier on Wednesday that the meeting would take place at a lower level. “Official level talks will continue but these are closed to media,” the department said in a message to journalists.\n\nThe developments throw new uncertainty over the diplomatic efforts to end Russia’s war. The United States has become increasingly steadfast in its push to force Kyiv to an agreement, but Ukraine is adamant that it will not give up Crimea, which has been occupied by Russia since 2014, or parts of eastern Ukraine that were captured following Moscow’s full-scale invasion in 2022.\n\nUS Vice President JD Vance threatened to abandon negotiations on Wednesday, telling reporters during a visit to India: “We’ve issued a very explicit proposal to both the Russians and Ukrainians, and it’s time for them to either say yes or for the US to walk away from this process. We’ve engaged in an extraordinary amount of diplomacy, of on the ground work.”\n\nRelated articleRussia launches deadly aerial barrage on Ukraine as US pushes for peace plan\n\nBut Ukraine’s European allies, particularly Britain and France, have been hoping to bridge the divide. Wednesday’s talks were due to follow a meeting in Paris last week in which officials from the US, the United Kingdom, France and Germany discussed the American framework for a ceasefire.\n\nAfter Rubio reversed plans to attend the latest talks, Bruce said President Donald Trump’s special envoy for Ukraine and Russia, Keith Kellogg, would represent the US in London instead.\n\nTrump’s special envoy Steve Witkoff is expected to meet with Russian President Vladimir Putin in Russia on Friday, a US official said.\n\nThe US proposal that has caused deadlock includesrecognizing Russia’s control of Crimea, the southern Ukrainian peninsula illegally annexed by Moscow, an official familiar with the framework told CNN. It would also put a ceasefire in place along the front lines of the war, the official said.\n\nZelensky made clear Tuesday that he was open to talks with Russia, but that Kyiv would not accept a deal that recognizes Moscow’s control of Crimea.\n\n“Ukraine will not legally recognize the occupation of Crimea,” he told reporters. “There is nothing to talk about. It is against our constitution.”\n\nAsked to clarify about whether he meant the US wanted to freeze the territorial lines where they are, Vance said Wednesday, “No, I didn’t say that. What I said is the current line, somewhere close to them is where you’re ultimately, I think, going to draw the new lines in the conflict. Now of course, that means the Ukrainians and the Russians are both going to have to give up some of the territory they currently own. There’s gonna have to be some territorial swaps.”\n\nThe war has resumed with full force this week, following a surprise ceasefire over the Easter weekend that both sides accused each other of breaching.\n\nThe talks in London were scheduled as US officials publicly voiced frustration over the lack of progress at bringing an end to the war.\n\nTrump has said he would “have to see an enthusiasm to want to end it” from both sides for the US to continue negotiations, after Rubio warned last week that Washington could walk away from its efforts to end the conflict if there were no signs of progress.\n\nThe broad framework has been presented to both sides, Rubio and the State Department have said, to determine whether the differences can be narrowed in a short timeframe. There are still pieces of the framework to be filled out and the US plans to work with the Europeans and the Ukrainians on that this week, the official told CNN.\n\nRelated articleThe Kremlin’s 30-hour truce was designed to shift blame to Ukraine. Did Trump buy it?\n\nWhite House press secretary Karoline Leavitt said Tuesday the negotiations were “hopefully moving in the right direction,” and declined to say what “stepping back” from the peace efforts might look like for the US.\n\nMoscow has previously stalled on ceasefire negotiations and rejected an earlier US proposal for a 30-day ceasefire agreed to by Kyiv.\n\nHowever, under pressure from Trump, Ukraine and Russia have expressed willingness to negotiate for the first time in years; the two sides have not held direct talks since the early weeks of Moscow’s invasion in 2022.\n\nOn Monday, Putin raised the prospect of holdingdirect talkswith Ukraine about a ceasefire that would halt striking civilian targets, but said further discussion was needed on how to define a civilian target.\n\nKremlin spokesman Dmitry Peskov later confirmed the Russian president’s remarks, saying “(Putin) had in mind negotiations and discussions with the Ukrainian side,” Reuters reported, citing Russia’s Interfax news agency.\n\nThis story has been updated with additional information. CNN’s Anna Chernova, Shania Shelton, Kosta Gak, Kit Maher, Jennifer Hansler, Alex Marquardt & Jerome Taylor contributed reporting.",
        "source_2": "US President Donald Trump has accused Volodymyr Zelensky of harming peace negotiations, after the Ukrainian president said Kyiv would not recognise Russian control of Crimea.\n\nWriting on Truth Social, Trump claimed a deal to end the war was \"very close\", but that Zelensky's refusal to accept US terms \"will do nothing but prolong\" the conflict.\n\nEarlier, US Vice-President JD Vance laid out the US vision for a deal, saying it would \"freeze the territorial lines [...] close to where they are today\".\n\nUkraine has long said it will not give up Crimea, a southern peninsula illegally annexed by Russia in 2014.\n\nVance said the deal would mean Ukraine and Russia \"are both going to have to give up some of the territory they currently own\".\n\nThe administration has yet to publicly offer specifics about what geographic concessions would have to be made.\n\nWhen asked by reporters at the White House about whether the administration was looking to recognise Russia's sovereignty over Crimea, Trump said he just wanted to see the war end.\n\n\"I have no favourites. I don't want to have any favourites. I want to have a deal done,\" he said.\n\nRecognising Russia's illegal occupation of Crimea would not only be politically impossible for Zelensky to accept, it would also be contrary to post-war international legal norms that borders should not be changed by force.\n\nHe has consistently rejected the suggestion that his country give up its claim to the Crimean Peninsula.\n\n\"There's nothing to talk about here. This is against our constitution,\" he said.\n\nOvernight, Ukraine reported a Russian missile and drone attack on several regions.\n\nIn the capital Kyiv, Mayor Vitali Klitschko said two people were killed and 54 injured, including children and a pregnant woman. Drone wreckage triggered several fires,  and a number of people were trapped under the rubble of a residential building, he said.\n\nIn Kharkiv, in the north-east, blasts were reported in the city.\n\nNine people were earlier killedand dozens more wounded in the eastern Ukrainian city of Marhanets when a Russian drone hit a bus carrying workers.\n\nThe back-and-forth comments from Trump and Zelensky are the latest chapter in an often fractious relationship.\n\nIn February, the pairclashed in a fiery meeting in the Oval Office.\n\nTrump said on Wednesday in the Oval Office that he found it easier to deal with Russia compared to Ukraine.\n\n\"I think Russia is ready,\" Trump said, noting he believed they were nearing a deal with the Kremlin but aren't there with Ukraine. \"I thought it might be easier to deal with Zelensky. So far, it's been harder.\"\n\nHe left open the idea of meeting with the Ukrainian leader when world leaders gather for Pope Francis's funeral on Saturday.\n\nOn the campaign trail, Trump repeatedly said he could end the Ukraine-Russia war in one day, but as he approaches his 100th day in office, a truce remains elusive.\n\n\"The president is frustrated,\" White House Press Secretary Karoline Leavitt told reporters. \"His patience is running very thin.\"\n\nVance warned on Wednesday that the US would \"walk away\" from its deal-making role if Russia and Ukraine do not come to an agreement - echoing comments last week by Trump and US Secretary of State Marco Rubio.\n\nUS officials also pulled out of a London meeting to focus on talks in Moscow, as thepace of diplomacy to end the war quickens.\n\nThe London talks between officials from the UK, France, Germany, Ukraine and the US aimed at securing a ceasefire were downgraded this week after Rubio and special envoy Steve Witkoff pulled out.\n\nInstead, Trump's Ukraine envoy Gen Keith Kellogg attended the talks in London, and Witkoff will head to Russia to meet President Vladimir Putin for the fourth time.\n\nBritish diplomats said they were not entirely clear why Rubio and Witkoff had pulled out of the London talks.\n\nThe US state department blamed logistical reasons, but it was clear the decision was last-minute and left the Foreign Office wrongfooted.\n\nSpeaking to BBC Radio 4's Today programme, Yuriy Sak, an adviser to Ukraine's ministry of strategic industries, said Ukrainian negotiators would attend the London meeting on a \"very clear, narrow mandate\" to achieve a ceasefire that will \"pave the way for further talks\".\n\nRussia intensified attacks on Ukraine since Wednesday followed a brief lull over Easter when it halted air strikes.\n\nPutin called a temporary ceasefire for the Easter weekend but UK Defence Secretary John Healey told the House of Commons on Tuesday that British military intelligence had found no evidence of a let-up in attacks.\n\n\"While Putin has said he declared an Easter truce, he broke it,\" he said. \"While Putin says he wants peace, he has rejected a full ceasefire; and while Putin says he wants to put an end to the fighting, he continues to play for time in the negotiations.\"\n\nIt is estimated that hundreds of thousands of people have been killed or injured on all sides since Russia invaded Ukraine on 24 February 2022, and nearly seven million Ukrainians are currentlylisted as refugeesworldwide.\n\nThe conflict goes back more than a decade, to 2014, when Ukraine's pro-Russian president was overthrown. Russia then annexed Crimea and backed militants in bloody fighting in eastern Ukraine.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nWill Vernon gets exclusive access to a pioneering summer camp for Ukrainian children with missing parents.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.",
        "source_3": "President Trump issued a stark warning to Ukrainian President Volodymyr Zelensky on Wednesday, saying Kyiv’s leader was in a “dire” situation and “can have Peace or, he can fight for another three years before losing the whole Country,” — hours before claiming without proof that Moscow is “ready” to end its war.\n\nTrump, 78, was responding to Zelensky telling reporters Tuesday that “Ukraine will not legally recognize the [Russian] occupation of Crimea” — akey part of a US-proposed peace planunder discussion with Ukrainian, British and European officials in London Wednesday, and a condition that has long been a red line for Kyiv.\n\n“This statement is very harmful to the Peace Negotiations with Russia in that Crimea was lost years ago under the auspices of President Barack Hussein Obama, and is not even a point of discussion,” the president seethed on Truth Social.\n\nIn the Oval Office Wednesday, Trump claimed “I think Russia is ready” to agree to a peace deal, but questioned Ukraine’s readiness — despite Kyiv having signed on to a Trump-proposed cease-fire agreement more than a month ago.\n\n“A lot of people said Russia wanted to go through the whole thing, and I think we have a deal with Russia, and we have to get a deal with Zelensky, and I hope that Zelensky, I thought it’s been so far, it’s been hard,” Trump said. “That’s okay, but, but I think we have a deal with both.”\n\nOn Tuesday, Russian officials acknowledged they wanted to drag the peace process out, with Kremlin spokesman Dmitry Peskov calling Trump’s push for a deal this week “futile.”\n\nMoscow, unlike Ukraine, also has so far resisted arrangements to meet in-person with US officials this week.\n\nWhite House press secretary Karoline Leavitt on Wednesday said Trump was “frustrated” and “his patience is running very thin” with his Ukrainian counterpart.\n\n“In order to make a good deal, both sides have to walk away a little bit unhappy,” Leavitt said, “and unfortunately, President Zelensky has been trying to litigate this peace negotiation in the press, and that’s unacceptable to the president. These should be closed door negotiations. The President’s national security team, his advisers, have exuded significant time, energy and effort to try to bring this war to an end. The American taxpayer has funded billions of dollars in this effort, and enough is enough.”\n\n“He wants to do what’s right for the world,” the press secretary went on. “He wants to see peace. He wants to see the killing stop but you need both sides of the war willing to do that, and unfortunately President Zelensky seems to be moving in the wrong direction.”\n\nTrump has repeatedlycriticized Obama for not interveningwhen Russia annexed Crimea. Kyiv has been working since 2014 to get its territory back and expel Russians from eastern Ukraine.\n\nNow, the US is proposing formally recognizing the Black Sea peninsula as Russian territory — which would represent a major change to American foreign policy, a senior administration official told The Post.\n\n“There’s a doctrine out there called the Welles Declaration, that goes back to 1940, that says that the United States will not acknowledge the occupation of a foreign land by another nation,” the official said.\n\n“We don’t say that this is your result, but we acknowledge the fact that it’s annexed physically, but you don’t own the land you’re on.”\n\nThat doctrine, declared 85 years ago, was created to push back against the Soviet Union’s annexation of Estonia, Latvia and Lithuania. The US was the leader in influencing other nations to do the same, and more than 50 nations followed suit.\n\nA US official insisted to The Post Friday that the US has not dropped its commitment to the doctrine “at all,” though that would change if Trump’s peace plan was adopted.\n\nTrump again refrained in Wednesday’s message from criticizing Russian President Vladimir Putin over thelack of progress on a peace agreement.\n\nThroughout the attempted peace process, the president has not issued any coercive punishments to Moscow to bring them to the table, but briefly cut intelligence sharing and military aid to Ukraine in an attempt to force them into compliance.\n\nInstead, Trump blamed Zelensky for speaking out against the acknowledgment of Crimea by the US.\n\n“It’s inflammatory statements like Zelenskyy’s that makes it so difficult to settle this War,” Trump went on. “He has nothing to boast about!”\n\nThe president also referenced in his post anotorious Feb. 28 shouting matchin the Oval Office between himself, Zelensky and Vice President JD Vance.\n\n“I have nothing to do with Russia, but have much to do with wanting to save, on average, five thousand Russian and Ukrainian soldiers a week, who are dying for no reason whatsoever,” the wrote.\n\n“The statement made by Zelenskyy today will do nothing but prolong the ‘killing field,’ and nobody wants that! We are very close to a Deal, but the man with ‘no cards to play’ should now, finally, GET IT DONE.”\n\nAdministration officials have suggested that the US would be willing to walk away from its peace efforts in eastern Europe if an agreement is not reached this week, with the London talks widely seen as the last best chance for significant progress.\n\nWhen asked if Trump would wash his hands of the conflict, Leavitt answered: “Not by the end of the day today, but the President has maintained that his frustration is growing and he needs to see this thing come to an end.”"
    }
}