{
    "question": "How might Bill Owens’ resignation, citing a loss of independence, shape perceptions of 60 Minutes’ editorial autonomy and public trust as CBS navigates the ongoing Trump lawsuit and corporate pressures?",
    "content": {
        "source_1": "\"60 Minutes\" executive producer Bill Owens, left, shown with executive editor Tanya Simon in 2019. Owens resigned Tuesday, saying corporate leaders were no longer letting him \"make independent decisions based on what was right for 60 Minutes, right for the audience.\"Evan Agostini/Invision/AP/Invisionhide caption\n\nThe longtime head of CBS'60 Minutesresigned Tuesday, as the network's parent company contemplates a settlement with President Trump over his lawsuit focusing on an interview the show did with then-Vice President Kamala Harris last fall.\n\nIn an emotionally charged meeting Tuesday afternoon, and again in a note to staff released publicly shortly after, the show's executive producer, Bill Owens said he was departing after 37 years with CBS News following months of heavy-handed treatment of the show by corporate leaders.\n\nOwens, only the third leader of the show in its more than half-century history, did not explicitly cite Trump. But the president's open rancor toward60 Minuteslooms over all. Corporate parent Paramount and its controlling owner, Shari Redstone, are seeking the approval of federal regulators to sell it to the son of Oracle founder Larry Ellison. The billionaire software mogul isa friend of Trumpwho visited the president at the White House earlier this year.\n\n\"Over the past months, it has also become clear that I would not be allowed to run the show as I have always run it. To make independent decisions based on what was right for 60 Minutes, right for the audience,\" Owens wrote. \"So, having defended this show- and what we stand for – from every angle, over time with everything I could, I am stepping aside so the show can move forward.\"\n\nAt the meeting, according to two attendees, Owens said he had \"lost independence from corporate.\" (The two people required anonymity to speak publicly due to the fraught professional environment at the show and the network.)\n\n60 Minutescorrespondent Scott Pelley, a longtime collaborator and friend of Owens, told colleagues, \"This isn't something Bill is doing of his own volition: There was no choice in any of this,\" according to one of the attendees.\n\nLast fall, before regaining office, Trump sued CBS' parent company Paramount in his personal capacity. Trump pointed to the fact that the network aired two different versions of an answer Harris gave about Israel and Gaza – one onFace the Nationand the other on60 Minutes. He demanded the network release the transcript of the raw interview, which it ultimately did this year once Trump was in office and his chief broadcasting regulator sought it. Trump was laterjoined by a Congressional allyin his lawsuit and doubled his demand to $20 billion.\n\nLegal observers spanning the ideological spectrum say Trump does not have a good case. His lawsuit spuriously alleges election interference by CBS over the kind of discretionary editorial choices that routinely confront broadcast journalists, they say.\n\nRedstone had been outspoken about the massacre of Israeli civilians by Hamas in October 2023. She was rankled by some CBS coverage of Gaza, including aCBS Morningssegment last fall and a60 Minutesstory in January.\n\nOwens has repeatedly told colleagues he would refuse to apologize to Trump. The chief executive of CBS News and Stations, Wendy McMahon, also has opposed settling.\n\nAccording to an attendee of Tuesday's meeting, McMahon appeared tearful and told the people assembled that she had been supportive of everything that Owens had done.\n\nIn her own note announcing Owens' departure, McMahon wrote, \"working with Bill has been one of the great privileges of my career. Standing behind what he stood for was an easy decision for me, and I never took for granted that he did the same for me.\"\n\nShe said CBS News already had begun conversations with correspondents and senior leaders about the next steps for the show. Owens' deputy Tanya Simon, a longtime60 Minutesproducer whose father was a correspondent for the show, will run the program for now; the network says it will be led permanently by someone who comes from within its ranks.\n\nIn Trump's lawsuit, filed before aTrump-appointed federal judgein Texas, Trump's lawyers argued that CBS engaged in \"unlawful acts of election and voter interference through malicious, deceptive and substantial news distortion.\"\n\n\"It's laughable and it's an affront to the First Amendment,\" Heidi Kitrosser, a law professor at Northwestern University who focuses on issues involving free speech and presidential powers, says of Trump's case. \"His concern first and foremost is to intimidate the press.\"\n\nRedstone, Paramount's controlling owner, has billions of dollars at stake in the potential sale of the company. The deal is under formal review by the Federal Communications Commission, led by Trump's pick as chairman,Brendan Carr. The FCC is reviewing the acquisition because it entails the transfer of Paramount's licenses to use the public airwaves for its 27 local television stations.\n\nCarr gave ballast to Trump's suit by requesting CBS share raw footage and full transcripts of the60 MinutesHarris interview, which was one of Trump's demands. Carr did so after reviving a complaint against CBS that had been filed by a conservative public interest group. Carr's Democratic predecessor had dismissed the complaint in her final days in office.\n\nCBS had previously refused to release the raw materials, citing the importance of maintaining journalistic independence from governmental interference.\n\nShortly after Carr's request, CBS announced it was legally required to comply, though the network had challenged the agency's requests and demands in the past. (One such appeal, over acomplaint filed by the late former President Jimmy Carter, reached the U.S. Supreme Court in 1981.)\n\nAfter receiving the unedited material, the FCC publicly postedlinksto it. CBS swiftly followed suit. The network also published a statement that said the material showed there had been no bias in how it presented the Harris interview.\n\nCarr told Fox Newsthat day that an investigation was warranted under \"news distortion\" concerns because CBS played different answers on two different programs in response to the same question.\n\n\"The [federal] policy says you can't, you know, swap answers out to make it look like somebody said something entirely different,\" Carr said. \"Clearly, the words of the answers were very different.\"\n\nThe transcriptsand videos appear to show that CBS editors pulled from slightly different points in the same response, with Harris speaking vaguely as she attempted to sidestep controversy over the incendiary issue of Israel and Hamas.\n\nAfter the transcript's release,Trump denounced CBS. \"CBS should lose its license, and the cheaters at 60 Minutes should all be thrown out, and this disreputable 'NEWS' show should be immediately terminated,\" Trump posted online. (CBS as a network doesn't hold a license; the local stations on which it is broadcast do.)\n\nOn April 13, Trump doubled down, accusing60 Minutesof treating him unfairly and saying he was \"honored\" to be suing the show, CBS and Paramount.\n\n\"They did not one, but TWO, major stories on 'TRUMP,' one having to do with Ukraine, which I say is a War that would never have happened if the 2020 Election had not been RIGGED, in other words, if I were President and, the other story was having to do with Greenland, casting our Country, as led by me, falsely, inaccurately, and fraudulently,\" Trumpposted to Truth Social.\n\nIn his parting note, Owens urged the60 Minutesstaff to stay the course.\n\n\"60 Minutes will continue to cover the new administration, as we will report on future administrations. We will report from War zones, investigate injustices and educate our audience. In short, 60 Minutes will do what it has done for 57 years,\" he said.",
        "source_2": "Bill Owens announced his resignation as executive producer of CBS's \"60 Minutes,\" citing a loss of independence in decision-making.\n\nPresident Trump is suing CBS and Paramount, alleging that the network edited an interview with former Vice President Kamala Harris to portray her favorably.\n\nOwens expressed confidence that \"60 Minutes\" will continue to report on future administrations despite his departure.\n\nSince its creation nearly 60 years ago, CBS’ “60 Minutes” has had only three executive producers. Now, one of them is leaving the award-winning show.\n\nThe top producer of the long-running Sunday news program, Bill Owens, revealed in an internal memoobtained by The New York Timesthat he’s stepping down. The memo cited the loss of the ability to “make independent decisions” as the reason for his departure.\n\nOwensreportedly saidin the all-staff memo that he would no longer be allowed to run the show like he had and that he was stepping aside to let the show “move forward.”\n\n“Over the past months, it has become clear that I would not be allowed to run the show as I have always run it, to make independent decisions based on what was right for ‘60 Minutes,” right for the audience,” Owens wrote in the memo. “So, having defended this show — and what we stand for — from every angle, over time with everything I could, I am stepping aside so the show can move forward.”\n\nDownload the SAN app today to stay up-to-date with Unbiased. Straight Facts™.\n\nAs Straight Arrow News haspreviously reported, President Donald Trump has criticized “60 Minutes.” Trump filed a lawsuit against CBS and its parent company, Paramount, accusing the network of editing an interview with former Vice President Kamala Harris during the 2024 election to show her in a more favorable light. The lawsuit contends CBS deceptively shortened Harris’ answer to a question about the war in Gaza during the televised program. CBS argues the answer was shortened due to time constraints and said the full answer was available online.\n\nTrump pushed for CBS to lose its broadcast license onTruth Socialon April 13, citing an interview on “60 Minutes” with Ukrainian President Volodymyr Zelenskyy. During the program,Trump was showncommending Russian President Vladimir Putin while criticizing Zelenskyy. The president also said a piece on Greenland showed him in a false light.\n\nOwens previously said he would not apologize as part ofa settlementwith Trump, which Paramount is reportedly considering. Its leading shareholder, Shari Redstone, is seeking approval from the Trump administration for the sale of her company to Skydance.\n\nAccording to The Times, settlement talks between Paramount and Trump are still underway.\n\nIn his farewell memo,The Times reportedthat Owens vowed the program would continue covering Trump.\n\n“‘60 Minutes’ will continue to cover the new administration as we will report on future administrations,” Owens said. “The show is too important to the country. It has to continue, just not with me as the executive producer.”\n\nOwens was hired as the executive producer for “60 Minutes” in 2019 and reportedlyinterned at CBS in 1988.\n\nIt’s currently unclear who the next executive producer of the program will be. CBS News and Stations President Wendy McMahonreportedlyannounced Tuesday, April 22, that she is “committed to ‘60 Minutes’ and to ensuring that the mission and the work remain our priority.”\n\nC-B-S’ ‘60 MINUTES’ HAS ONLY SEEN THREE EXECUTIVE PRODUCERS IN ITS NEARLY 60 YEAR HISTORY.\n\nTHE TOP PRODUCER OF THE LONG-RUNNING SUNDAY NEWS PROGRAM, BILL OWENS, REVEALING IN AN INTERNAL MEMO OBTAINED BY THE NEW YORK TIMES, HE’S RESIGNING, CITING THE INABILITY TO “MAKE INDEPENDENT DECISIONS.”\n\nOWENS REPORTEDLY SAYS IN THE ALL STAFF MEMO, “OVER THE PAST MONTHS, IT HAS BECOME CLEAR THAT I WOULD NOT BE ALLOWED TO RUN THE SHOW AS I HAVE ALWAYS RUN IT, TO MAKE INDEPENDENT DECISIONS BASED ON WHAT WAS RIGHT FOR ‘60 MINUTES,’ RIGHT FOR THE AUDIENCE,” OWENS CONTINUED, “SO, HAVING DEFENDED THIS SHOW– AND WHAT WE STAND FOR– FROM EVERY ANGLE, OVER TIME WITH EVERYTHING I COULD, I AM STEPPING ASIDE SO THE SHOW CAN MOVE FORWARD.”\n\nAS STRAIGHT ARROW NEWS REPORTED, ‘60 MINUTES’ IS FACING A LAWSUIT FROM PRESIDENT TRUMP, ACCUSING THE NETWORK OF DECEPTIVELY EDITING AN INTERVIEW WITH FORMER VICE PRESIDENT KAMALA HARRIS DURING THE 2024 ELECTION BY SHORTENING HER ANSWER TO A QUESTION ON ISRAEL’S WAR AGAINST HAMAS. C-B-S CONTENDS THE ANSWER TO THE QUESTION WAS SHORTENED DUE TO TIME CONSTRAINTS AND SAID THE FULL INTERVIEW WAS AVAILABLE ONLINE.\n\nTRUMP MORE RECENTLY, PUSHED FOR C-B-S TO LOSE ITS BROADCAST LICENSE EARLIER THIS MONTH ON TRUTH SOCIAL, CITING AN INTERVIEW ON ‘60 MINUTES’ WITH UKRAININAN PRESIDENT VOLODYMYR ZELENSKYY, SHOWING TRUMP COMMENDING RUSSIAN PRESIDENT VLADIMIR PUTIN WHILE CRITICIZING ZELENSKKY. TRUMP ALSO TOOK ISSUE WITH A ‘60 MINUTES’ PIECE ON GREENLAND, HE SAYS SHOWED HIM IN A FALSE LIGHT.\n\nOWENS PREVIOUSLY SAID HE WOULD NOT APOLOGIZE AS PART OF A POTENTIAL SETTLEMENT WITH TRUMP OVER THE LAWSUIT. PARAMOUNT, HOWEVER, IS REPORTEDLY CONSIDERING A DEAL AS ITS LEADING SHAREHOLDER SHARI REDSTONE SEEKS F-T-C APPROVAL FOR THE SALE OF HER COMPANY TO SKYDANCE.\n\nACCORDING TO THE TIMES, SETTLEMENT TALKS BETWEEN PARAMOUNT AND TRUMP ARE STILL UNDERWAY.\n\nIN HIS FAREWELL MEMO, THE TIMES REPORTS, OWENS VOWS “‘60 MINUTES’ WILL CONTINUE TO COVER THE NEW ADMINISTRATION AS WE WILL FUTURE ADMINISTRATIONS.” OWENS ADDING, “THE SHOW IS TOO IMPORTANT TO THE COUNTRY. IT HAS TO CONTINUE, JUST NOT WITH ME AS THE EXECUTIVE PRODUCER.”\n\nFOR MORE ON THIS STORY– DOWNLOAD THE STRAIGHT ARROW NEWS APP OR VISIT SAN DOT COM.\n\nThe resignation of Bill Owens from CBS's \"60 Minutes\" underscores significant challenges to journalistic independence amidst ongoing legal and political pressures, reflecting wider concerns for media integrity in the current landscape.\n\nOwens' departure highlights the crucial need for editorial autonomy in news organizations, particularly in the face of legal disputes that may influence the direction of coverage.\n\nThe ongoing lawsuit from former President Trump emphasizes the tensions between media entities and political figures that can lead to potential conflicts over reporting standards.\n\nThe intersection of corporate interests and journalism is brought to light by the merger negotiations involving CBS's parent company, which may compromise the integrity of the news production.\n\nSynthesized coverage insights across50media outlets\n\nBoth left-leaning and right-leaning articles converge on the troubling aspect of editorial independence at CBS News, highlighted by Bill Owens' resignation from \"60 Minutes.\" They agree that the pressure from corporate leadership and ongoing lawsuits from President Donald Trump have created an atmosphere where journalistic integrity is compromised, impairing the show's ability to operate freely.\n\nThe left-leaning articles emphasize the importance of defending journalistic standards, noting the editorial practices at \"60 Minutes\" as traditionally rigorous. In contrast, the right-leaning sources focus on accusing CBS of political bias and presenting the resignation as a victory over perceived \"fake news\" practices, suggesting Owens was removed due to incompetency or liberal bias.\n\nThere is limited coverage on the broader implications of Big Media companies facing legal actions that could hinder their journalistic autonomy. The potential chilling effect on investigative journalism, especially in the context of powerful political figures exerting influence over media narratives, appears underexplored in both sides of coverage.\n\n‘60 Minutes’ Top Producer Resigns, Citing Inability 'To Make Independent Decisions'\n\n‘60 Minutes’ Boss Quits With Dire Warning as Trump Sues Show\n\nTop \"60 Minutes\" producer quits, saying he can no longer run the show as he has\n\n‘60 Minutes’ executive producer resigns, citing a loss of independence in the wake of Trump lawsuits\n\n‘60 Minutes’ Chief Caught Up in Trump Fight Leaves Program\n\n’60 Minutes’ Chief Quits, Citing Interference from Paramount\n\nBill Owens, Executive Producer Of ’60 Minutes,’ Resigns, Saying He Lost His Ability To Make “Independent Decisions” About The Show\n\nTop '60 Minutes' producer quits, saying he can no longer run the show as he has in the past\n\nRead the exit memo from '60 Minutes' top producer, who said he lost editorial independence\n\n'60 Minutes' chief resigns, saying show's independence was compromised\n\n'60 Minutes' producer leaves show, citing a loss of journalistic independence\n\n’60 Minutes’ Producer Bill Owens Resigns Citing Inability to Make “Independent Decisions”\n\nBREAKING: ’60 Minutes’ Executive Producer Resigns, Says Show Lost Independence Amid Trump Threats\n\nTop “60 Minutes” producer quits, saying he can no longer run the show as he has\n\n'60 Minutes' EP Bill Owens Quits, Says He Lost Ability to Make Independent Decisions\n\nNo summary available because of a lack of coverage.\n\nTop “60 Minutes” producer quits, saying he can no longer run the show as he has\n\nTop producer of ’60 Minutes’ resigns in wake of Trump lawsuit\n\nTop \"60 Minutes\" producer quits, saying he can no longer run the show as he has in the past\n\n‘60 Minutes’ Top Producer Resigns: Says He Lost Journalistic Independence Amid Trump Fight\n\nTop ’60 Minutes’ producer resigns amid Trump lawsuit, says ‘independence’ being suppressed\n\nTop producer at ‘60 Minutes’ quits, citing loss of journalistic independence\n\n‘60 Minutes’ executive producer resigns, citing a loss of independence in the wake of Trump lawsuit\n\nTop ’60 Minutes’ producer quits, saying he can no longer run the show as he has\n\nTop \"60 Minutes\" producer quits, saying he can no longer run the show as he has\n\nTop ’60 Minutes’ producer quits, saying he can no longer run the show as he has in the past\n\nTop ’60 Minutes’ producer quits, saying he can no longer run the show as he has\n\nTop ’60 Minutes’ producer quits, saying he can no longer run the show as he has\n\nTop ’60 Minutes’ producer quits, saying he can no longer run the show as he has\n\nTop \"60 Minutes\" producer quits, saying he can no longer run the show as he has\n\nTop ’60 Minutes’ producer quits, saying he can no longer run the show as he has\n\nTop ’60 Minutes’ producer quits, saying he can no longer run the show as he has\n\nTop \"60 Minutes\" producer quits, saying he can no longer run the show as he has\n\nTop '60 Minutes' producer resigns amid Trump lawsuit, says 'independence' being suppressed\n\nTop ’60 Minutes’ producer quits, saying he can no longer run the show as he has\n\nTop \"60 Minutes\" producer quits, saying he can no longer run the show as he has\n\nTop \"60 Minutes\" producer quits, saying he can no longer run the show as he has\n\nTop '60 Minutes' producer quits, saying he can no longer run the show as he has in the past\n\n‘60 Minutes’ producer Bill Owens quits under pressure from Trump’s CBS lawsuit\n\nTop '60 Minutes' producer quits, saying he can no longer run the show as he has\n\nVeteran '60 Minutes' Producer on the Outs After Disastrous Kamala Interview, Trump Lawsuit\n\nTop '60 Minutes' producer resigns from show, cites lack of independence\n\nJUST IN: Top 60 Minutes Producer Abruptly Resigns As Trump's Massive Lawsuit Against CBS Continues\n\nTop \"60 Minutes\" producer quits, saying he can no longer run the show as he has\n\nTop \"60 Minutes\" producer quits, saying he can no longer run the show as he has in the past\n\nProducer of \"60 Minutes\" resigning arguing cannot direct the program\n\n60 Minutes EP Resigns: Not Allowed \"To Make Independent Decisions\"\n\nIn a memo, 60 Minutes EP Bill Owens says he is resigning because he had lost his journalistic independence; the show is under pressure from Trump and Paramount\n\nTop \"60 Minutes\" producer quits, saying he can no longer run the show as he has\n\nPresident Donald Trump called for CBS’ broadcast license to be revoked after “60 Minutes” aired two stories he viewed as inaccurate and fraudulent. What did Trump say? The president posted on Truth Social on Sunday, April 13, saying CBS News should lose its license. “They are not a ‘News Show,’ but a dishonest Political Operative…\n\nCBS News’ parent company, Paramount, is seeking to have President Donald Trump’s $20 billion lawsuit against the network tossed, contending that the suit is an “affront to the First Amendment and is without basis in law or fact.” Paramount filed a pair of motions in the U.S. District Court for the Northern District of Texas…\n\nFull Story A federal judge has denied CBS and Paramount Global’s motion to dismiss President Donald Trump’s $20 billion lawsuit, allowing the case to proceed. Trump accuses the media giants of election interference, claiming a “60 Minutes” interview was deceptively edited to benefit former Vice President Kamala Harris ahead of the election. The week of…\n\nFull Story The Federal Communications Commission and CBS have released transcripts of the network’s “60 Minutes” interview with then-Vice President Kamala Harris during the 2024 presidential campaign. President Donald Trump sued the network for $10 billion, claiming it deceptively edited the interview to help Harris in October as she and Trump battled down the home…\n\nOfficials at CBS said they will hand over the transcripts from the “60 Minutes” interview with former Vice President Kamala Harris to the Federal Communications Commission. This comes after President Donald Trump voiced concerns about how the network handled a story about his former opponent. Why did Trump take issue with the interview? President Trump…\n\nFormer President Donald Trump filed a $10 billion lawsuit against CBS News on Thursday, Oct. 31, accusing the network of manipulating an interview with Vice President Kamala Harris on “60 Minutes.” Trump’s legal team claims the network’s editing misrepresented Harris’ answer in a way that could influence the 2024 election. The lawsuit alleges that CBS…\n\nFormer President Donald Trump’s lawyers have sent a letter to CBS News demanding the release of the transcript from the “60 Minutes” interview with Vice President Kamala Harris. This latest threat of litigation escalates the ongoing conflict between Trump and the network over the editing of one of Harris’ responses. The CBS legal department addressed…\n\nCBS is responding to claims that the network engaged in deceitful editing when it aired two different answers to the same question in its interview with Vice President Kamala Harris. While CBS has issued a statement, calls for the release of the full transcript continue. A Federal Communications Commission (FCC) commissioner also advocated for an…\n\nCBS News says former President Trump has backed out an upcoming interview with “60 Minutes.”  For decades, “60 Minutes” has broadcast election specials with the presidential candidates. CBS reported both Trump and Vice President Harris had agreed to take part in this year’s special in separate one-on-one interviews, but Trump has since reportedly changed his mind.  In…\n\nPresident Donald Trump called for CBS’ broadcast license to be revoked after “60 Minutes” aired two stories he viewed as inaccurate and fraudulent. What did Trump say? The president posted on Truth Social on Sunday, April 13, saying CBS News should lose its license. “They are not a ‘News Show,’ but a dishonest Political Operative…\n\nCBS News’ parent company, Paramount, is seeking to have President Donald Trump’s $20 billion lawsuit against the network tossed, contending that the suit is an “affront to the First Amendment and is without basis in law or fact.” Paramount filed a pair of motions in the U.S. District Court for the Northern District of Texas…\n\nFull Story A federal judge has denied CBS and Paramount Global’s motion to dismiss President Donald Trump’s $20 billion lawsuit, allowing the case to proceed. Trump accuses the media giants of election interference, claiming a “60 Minutes” interview was deceptively edited to benefit former Vice President Kamala Harris ahead of the election. The week of…\n\nFull Story The Federal Communications Commission and CBS have released transcripts of the network’s “60 Minutes” interview with then-Vice President Kamala Harris during the 2024 presidential campaign. President Donald Trump sued the network for $10 billion, claiming it deceptively edited the interview to help Harris in October as she and Trump battled down the home…\n\nOfficials at CBS said they will hand over the transcripts from the “60 Minutes” interview with former Vice President Kamala Harris to the Federal Communications Commission. This comes after President Donald Trump voiced concerns about how the network handled a story about his former opponent. Why did Trump take issue with the interview? President Trump…\n\nFormer President Donald Trump filed a $10 billion lawsuit against CBS News on Thursday, Oct. 31, accusing the network of manipulating an interview with Vice President Kamala Harris on “60 Minutes.” Trump’s legal team claims the network’s editing misrepresented Harris’ answer in a way that could influence the 2024 election. The lawsuit alleges that CBS…\n\nFormer President Donald Trump’s lawyers have sent a letter to CBS News demanding the release of the transcript from the “60 Minutes” interview with Vice President Kamala Harris. This latest threat of litigation escalates the ongoing conflict between Trump and the network over the editing of one of Harris’ responses. The CBS legal department addressed…\n\nCBS is responding to claims that the network engaged in deceitful editing when it aired two different answers to the same question in its interview with Vice President Kamala Harris. While CBS has issued a statement, calls for the release of the full transcript continue. A Federal Communications Commission (FCC) commissioner also advocated for an…\n\nCBS News says former President Trump has backed out an upcoming interview with “60 Minutes.”  For decades, “60 Minutes” has broadcast election specials with the presidential candidates. CBS reported both Trump and Vice President Harris had agreed to take part in this year’s special in separate one-on-one interviews, but Trump has since reportedly changed his mind.  In…",
        "source_3": "Fox News senior national correspondent Aishah Hasnie has more from the campaign trail as the former president reaches out to minority voters on 'Special Report.'\n\nTop \"60 Minutes\" producer Bill Owens abruptly resigned from the program on Tuesday, saying he no longer had sufficient independence to run the program how he wanted.\n\n\"Over the past months, it has also become clear that I would not be allowed to run the show as I have always run it,\" he wrote in a memo to staff obtained byFox News Digital. \"To make independent decisions based on what was right for 60 Minutes, right for the audience. So, having defended this show- and what we stand for – from every angle, over time with everything I could, I am stepping aside so the show can move forward.\n\n\"The show is too important to the country, it has to continue, just not with me as the Executive Producer.\"\n\nThe news comes as \"60 Minutes\" and CBS are embroiled in a $20 billion lawsuit launched by PresidentDonald Trumpover the show's interview of then-Vice President Kamala Harris on the show last year. The network aired different parts of Harris' response to a question about Israel on separate nights, leading Trump to accuse CBS of election interference.\n\nPresident Trump and others were not pleased with CBS News’ \"60 Minutes\" over a controversial edit of its interview with then-Vice President Kamala Harris.(Left: (Photo by Spencer Platt/Getty Images), Center: Screenshot/60Minutes, Right: (Photo by Andy Manis/Getty Images))\n\nTRUMP, CBS PARENT COMPANY SET FOR MEDIATION IN $20 BILLION ‘60 MINUTES’ LAWSUIT\n\nTrump has said CBSshould lose its broadcast license and accused it of \"fraudulent\" reporting.\n\nOwens' comment about losing independence appeared to allude to the Trump suit hanging over the network. According to the New York Times, which first reported on Owens' resignation, Owens said earlier this year that he would not apologize for the Harris segment as part of any settlement with the president.\n\nCBS parent company Paramount Global is reportedly considering settling the suit ahead of a planned merger with Skydance Media in hopes of preventing potential retribution by Trump's FCC, which has the authority to halt the multibillion-dollar transaction. Shari Redstone, Paramount’s controlling shareholder, is reportedly in favor of settling with the president.\n\nMany media observers don't want CBS tosettle the suit, which critics have called a hyperbolic reaction to a typical editing decision.\n\nCBS News President Wendy McMahon praised Owens in a message to staff on Tuesday and indicated his replacement would be from within the CBS family. Owens was only the third executive producer in the history of the show, which debuted in 1968.\n\nFAIR ELECTION FUND URGES FCC TO HOLD CBS ACCOUNTABLE FOR 'UNLAWFUL CONDUCT’ RELATED TO ’60 MINUTES’ INTERVIEW\n\n\"60 Minutes\" executive producer Bill Owens resigned on Tuesday.(Piaras Ó Mídheach/Sportsfile for Collision via Getty Images)\n\n\"As Executive Producer, Bill has led 60 Minutes with unwavering integrity, curiosity, and a deep commitment to the truth,\" she wrote. \"He has championed the kind of journalism that informs, enlightens, and often changes the national conversation.  His dedication to finding and nurturing talent will be felt across CBS News for years.\"\n\nFox News Digital reached out to CBS News representatives for additional comment.\n\nTrump's legal entanglements with media organizations are nothing new.\n\nABC settled a defamation lawsuitin December with then-President-elect Trump for $15 million, after anchor George Stephanopoulos repeatedly asserted Trump had been found \"liable for rape\" in a civil trial last year.\n\nFox News Digital's Joseph A. Wulfsohn contributed to this report.\n\nBrian Flood is a media editor/reporter for FOX News Digital. Story tips can be sent tobrian.flood@fox.comand on Twitter: @briansflood.\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}