{
    "question": "What factors may be driving the reported resurgence of Christianity among Gen Z, and how might this trend influence religious institutions, community life, and public discourse?",
    "content": {
        "source_1": "As a new report suggests that the number of young churchgoers has quadrupled,Helen Coffeyinvestigates this potential UK spiritual revival – and asks why the next generation is more likely to be keeping the faith\n\nI would like to be emailed about offers, events and updates from The Independent. Read ourPrivacy notice\n\nIt’s 10am on Sunday, and people are already starting to filter through the doors of Harbour Church. Sun streams through the windows – there’s an air of anticipation as congregation members greet each other and catch up on the week just gone. Soon, the room is filling up, the sound of gentle chatter swelling as the throng grows and people take their seats. The five-piece worship band strikes up; the crowd gets to its feet; the air vibrates as more than a hundred voices sing praises toGod.\n\nThere’s no special occasion to pin the numbers on – it’s not Christmas orEasteron this particular Sunday, nor is there awedding dress, christening gown or coffin in sight. It’s just a regular, run-of-the-mill service at this church in Folkestone, Kent.\n\nIt was a different story 25 years ago when church leaders Sarah and Gareth arrived. Back then, 15 people would show up on a Sunday morning; these days, there are somewhere between 150 and 180 attendees every single week. This, in itself, feels a miraculous feat amid a wider trend that has seenChristianityin modern Britainstuck on a constant downward trajectory. But perhaps the most surprising thing of all is the number of young people who are going against the secular grain. Looking around on a Sunday morning, the demographics are wildly different from the expected cluster of silver-haired worshippers – instead, there’s a diverse spectrum comprised of teenagers, young adults and extended families withtoddlers and kids zooming around, as well as people in their thirties, forties and every decade beyond.\n\nIt's a trend that is being seen far beyond the confines of this one church, according to new research. The Bible Society’s“The Quiet Revival”reporthas made some remarkable claims about a resurgence of Christianity in the UK. Although the percentage of Brits identifying as Christian has fallen to 39 per cent, “The Church is in a period of rapid growth, driven by young adults and in particular young men”, reads the report, which analysed the results of a largescale YouGov survey asking participants how often they attended church aside from weddings, baptisms and funerals. The number of people reporting monthly attendance has risen from 8 per cent in 2018 to 12 per cent in 2024. But the most remarkable jump in reported attendance has been amongGeneration Z, quadrupling from 4 per cent to 16 per cent of 18- to 24-year-olds. There’s been an even more dramatic shift for young men: a fivefold growth from 4 to 21 per cent.\n\n“These are striking findings that completely reverse the widely held assumption that the Church in England and Wales is in terminal decline,” said study co-author Dr Rhiannon McAleer. “While some traditional denominations continue to face challenges, we’ve seen significant, broad-based growth among most expressions of church – particularly in Roman Catholicism and Pentecostalism. There are now over 2 million more people attending church than there were six years ago.”\n\nThere are other markers, too, that indicate a potential reversal of fortunes for the Christianfaith. According toNielsen BookScan data, UK Bible sales went from netting £2.69m in 2019 to £5.02m in 2024 – an increase of £2.33m in just five years. To put this in context, Bible sales increased by just over £277,000 in total in the 11 years from 2008 to 2019. This renewed interest in scripture is also being attributed to Gen Z; theGood News Bible – The Youth Edition, for example, has seen sales nearly double since 2021. And it’s not a UK-only phenomenon: US Bible sales have seen a 22 per cent uplift in the past year alone, with publishers reporting more first-time buyers than ever.\n\nArecent piece of researchcommissioned by Christian student movement Fusion, meanwhile, found that even non-religious students were open to exploring Christian ideas. Survey data from 2,030 undergraduates, of which 39 per cent identified as Christian and 36 per cent identified as “noreligion”, revealed that half of all respondents said they were interested in reading the Bible in their spare time. Some 37 per cent of students with “no religion” stated that they already owned a copy of the Bible; 13 per cent of the same group claimed they prayed weekly. “This indicates that for some students, spiritual practices persist even without a formal religious identity,” the report concluded.\n\nGen-Zers have even been dubbed the “spiritual generation” after research found that they are far more likely to describe themselves this way:62 per cent of 18- to 24-year-olds claim to be “very” or “fairly” spiritual, compared to just 35 per cent of those over 65. Only 13 per cent of Gen-Zers identify as atheists, in contrast to 20 per cent of millennials and 25 per cent of Gen X. It makes sense; for the two generations above, Christianity was presented in popular culture as deeply uncool at best – thinkSongs of Praisestuffiness combined with Ned Flanders’s brand of “Okily dokily!” cringe inThe Simpsons– and sexist or homophobic at worst, darkly epitomised by the dangerous “pray the gay away” ideology espoused at conversion therapy camps. It coincided with the rise of populist atheism, pedalled by academics likeRichard Dawkinsin the Noughties, to create an environment in which professing to have faith of any kind felt like deviant behaviour.\n\nBut we’re now witnessing a “significant cultural shift regarding matters of faith and religion”, argues Sam Richardson, CEO at Christian publisher SPCK. “We are seeing an increased curiosity about Christianity,” he says. “Rather than relying on atheist thought leaders (or, for that matter, church leaders), we are seeing people want to draw their own conclusions by reading Christian books in general and the Bible in particular.”\n\nSo what’s the appeal and relevance of Christianity, often presented as something quaintly “traditional” or hopelessly antiquated, for today’s young people?\n\nMuch has been made of the fact that young men seem to be flocking to religion, potentially drawn by alt-right content creators –for instance, Jordan Peterson– who weave Christianity into problematic narratives around masculinity and traditional gender roles. But that doesn’t reflect the reality of many of the Gen ZChristiansI encounter.\n\nAs someone who struggles with depression and anxiety, my faith gives me some peace and clarity\n\nFor Harry Clark, the 24-year-old winner of season two ofThe Traitors, his Catholic faith helps him feel less “lost”. In advance of his appearance on the latest series of BBC 1 showPilgrimage, in which he’ll explore all things faith with his fellow celebrity castmates as they trek through the Austrian and Swiss Alps, Clark toldThe Telegraph: “You can be so lost but then you are found. God is the only one who knows everything about me. It’s like a vase that shatters and God is the one that can put together the shards.”\n\nThe young Christians I speak to share similar stories of feeling fully “known” and loved by God. Jordan, 26, tells me that faith has given her “an overwhelming sense of peace”. Yes, being religious has been framed as profoundly countercultural throughout her life – “As a uni student I didn’t get swept away with the drinking culture; I got married young (engaged at 19, married at 21), which blew a lot of my non-Christian friends’ minds” – but she has no regrets. “Am I allowed to say everything?” she responds when I ask her to name the best thing she gets from her faith. “Knowing it’s not my strength I rely on, but God’s, brings such peace and joy. And a sense of community and family with other Christians.”\n\nJosh, 27, was raised in a Christian household and has gone to church since he was a child. While growing up he felt part of a tiny minority, he’s noticed a real change in the past few years – particularly since Covid. “People have become much more receptive to faith; they’re searching for answers and a need for something bigger than themselves,” he says. Josh’s own reasons for keeping the faith also include the community aspect, plus “knowing God personally”: “He is a comfort in hard times. I like seeking Him for guidance in everything.”\n\nWhat has been described as a global “mental healthcrisis” among young people is perhaps one potential explanation for faith’s renewed appeal in 2025. Between 2010 and 2015, suicide rates among 10- to 14-year-old girls and boys increased by 167 and 92 per cent, respectively; self-harm rates for teenage girls in the UK soared by 78 per cent; and anxiety diagnoses for those aged 18 to 25 jumped by 92 per cent. These grim statistics have gonehand in hand with the stratospheric rise in social media and smartphone use, according to social psychologist Jonathan Haidt, author of the bestselling bookThe Anxious Generation.\n\nBy contrast, “The Quiet Revival”report found that Christians reported higher life satisfaction than non-churchgoers, with a greater connection to their community and less stress and anxiety. Interestingly, a major piece of research on teenage wellbeing conducted by scientists at the University of Oxford and Swansea University last year found that just three elements strongly correlated with better adolescent mental health: getting enough sleep, regular exercise and – wait for it – attending religious services. “These three consistently predicted low anxiety, low depression, high wellbeing, high flourishing, and high agency,” according to the report.\n\nIt's something that 27-year-old Lizzie has found hugely beneficial in terms of being a Christian. “As someone who struggles with depression and anxiety, my faith gives me some peace and clarity,” she says. “I know there’s always someone there who loves me unconditionally and will never judge me for the things I do or don’t do. Sometimes it feels freeing to give myself over to a higher power, and let the chips fall as they may as part of a greater plan.”\n\nLottie, 28, agrees that “it massively helps with mental health. It gives you a sense of purpose that drives you.” It’s also helped her in supporting her husband, a fellow Christian who suffers from depression: “I needed faith to help us through that situation. Mental health isn’t absent in church – and it doesn’t mean that if you have faith, you’re not going to have mental health difficulties – but it’s something that can help, knowing that there’s a higher meaning to it all.”\n\nI feel like I can be vulnerable; I feel like I can be honest about who I am, the struggles that I’m going through\n\nThe Bible Society report posits two interlinking factors for the uplift in young people seeking religion: a “change of climate” as the perception of Christianity has shifted from hostility to apathy to openness, andthe quest for belonging. The former has been reflected in various media moments in recent years, from Phoebe Waller-Bridge’s“hot priest” love interest inFleabagto praise for Church of England priestRichard Coles’s faith-infused wisdomduring his stint onI’m a Celebrity…last year. The latter, meanwhile, could well be fundamental; every Christian I interview cites the sense ofbelonging that comes from being part of a loving churchas one of the major benefits. “I feel like I can be vulnerable; I feel like I can be honest about who I am, the struggles that I’m going through,” says Lottie. “I think it’s hard to come across a community like that that looks after you so well.”\n\nAnd research supports the theory that getting involved in a community could have a positive impact on young people’s mental health. Andrea Danese, a professor of child and adolescent psychiatry at King’s College London and Maudsley NHS Foundation Trust, says that participation in community activities and access to safe social spaces “can provide adolescents with opportunities to build social skills and resilience”, acting as abuffer against social anxiety.\n\nIn an unstable world where uncertainty reigns, perhaps the biggest gift that religion can provide young people with is a pathway through the chaos, a light in the dark. As Lizzie puts it: “Hope is one of the biggest things I get out of my faith ... You’re never alone, no matter how much you may feel it. And I think that’s beautiful.”\n\nJoin thought-provoking conversations, follow other Independent readers and see their replies",
        "source_2": "British clerics are noting strong attendances at Lenten and Easter services. Credit: Getty\n\nIs Christianity back? Across several countries, the last few months have seen numerous anecdotal reports of a resurgence of Christian observance. Many British clerics are notingstrong attendancesat Lenten and Easter services. Similarreportsare emerging in the USA, where younger people make up much of the increase. Meanwhile, France has had a50% risein adult baptisms, and survey data suggests afourfold increasein Catholic observance among 18 to 24-year-olds in Britain.\n\nIt is possible that this is a false dawn. But equally, perhaps these faint glimmerings do represent something real. If there is real revival among younger generations, that may be because they have grown weary of the extremely rigorist morality that dominates the contemporary world, and are seeking an alternative.\n\nNow Christianity does of course make considerable moral demands on its adherents.  Believers are expected to reorient their lives in many important respects, and to make personal sacrifices. In different ways, across different traditions, they are strongly encouraged to be honest about their failings, whether through a formal sacrament like Catholic Confession, or as part of small groups as in many Evangelical congregations, or corporately in the liturgy.\n\nAt its best, Christianity is not a moralistic religion — in other words, it does not place the expectation of perfect behaviour at its core. It is repentance and reconciliation, not respectability, that are central to the internal logic of the faith. The Christian moral system is also coherent and predictable.\n\nModern secular morality, by contrast, is extremely censorious and has a strongly arbitrary element, as we have seen in the last decade or so of “cancel culture”. People have been subjected to storms of anonymous criticism, resulting in lost jobs and lost livelihoods, with no clear limiting principle and no real interest in proportionality. To make matters worse, this is all highly impersonal and offers no clear pathway for restoration and forgiveness. Were those who loudly condemned ProfessorTim Hunt, orDanny Baker, or the scientistMatt Taylor, interested in those men having a way back to the good graces of official opinion? It seems unlikely.\n\nSo much of this activism has a hard political edge, too. The grimly fanatical climate activism that we have seen in the last few years makes revolutionary demands, and is unconcerned with the compromises and concessions to humane individualism that characterise normal human political life.\n\nIt is no wonder if many people find this all exhausting and fruitless. People will always be seeking a way to make sense of the universe, and to integrate themselves into a moral community. But a heavily politicised system, without mechanisms that take into account human weakness, universal frailty, and the need to reconcile, cannot fulfil this role for long. Christians have certainly often failed to properly emphasise the need for humility and forgiveness.\n\nHowever, at its heart the faith is fundamentally humane, in its attempt to offer both a vision and pattern for human life, and a way of living with our inevitable failures to meet that ideal. “The man that is will shadow / The man that pretends to be” wrote TS Eliot in his Choruses From The Rock. Humans will always be searching for a way to live with the tension between the ideal and the reality, and Christianity offers such a way.\n\nNiall Goochis a public sector worker and occasional writer who lives in Kent.\n\nWe welcome applications to contribute to UnHerd – please fill out the form below including examples of your previously published work.Pleaseclick hereto submit your pitch.\n\nPleaseclick hereto view our media pack for more information on advertising and partnership opportunities with UnHerd.",
        "source_3": "Sydney Johnston grew up in a nondenominational Christian household — but now the Upper West Side millennial is a devout Catholic.\n\n“There’s just something so beautiful and transcendent about the rituals and the ancient history in the Catholic Mass that’s been preserved,” Johnston, 30, told The Post. “The church really communicates a degree of reverence that I didn’t find in the more liberal, laissez-faire approach of nondenominational churches.”\n\nConfirmed in December 2024 at the Church of Notre Dame in Morningside Heights, Johnston is one of a growing number of young people turning to the Catholic Church from other denominations, religions and even no faith at all.\n\nAccording to the National Catholic Register, some dioceses are reporting year-over-year increases of 30% to 70% in new converts. The Diocese of Fort Worth, Texas, for instance, experienced a 72% jump in converts just from 2023 to 2024.\n\nThe Post spoke to several young new Catholics who cite the pandemic, the internet and a distaste for “lax” Protestant alternatives as reasons for turning to the faith.\n\nGrowing up in Orange County, California, Johnston never quite felt satisfied with her Protestant faith.\n\n“It felt much more like a cultural experience than something that was really rooted in history with a deep theological foundation,” she recalled.\n\nBy her early 20s, she had walked away from the church entirely, but, when the pandemic hit while Johnston was studying physics and history at Columbia, she suddenly had time to consider what was missing from her life.\n\n“Up until that point, I was such a workaholic, but during the pandemic, I started thinking and revisiting my criticisms of Christianity,” she said. “I just started reading the Bible, and I found so much wisdom and beauty and meaning.”\n\nComing out of lockdown, she set out on a two-year quest across dozens of denominations to find a church that was a fit.\n\n“I had this question on my mind, like, do I feel God here? Does this feel like a holy place? And so I really paid attention to the aesthetic and spiritual aspects of the services,” she recalled. “And I ultimately just felt myself most drawn to the Catholic Mass.”\n\nThe Rev. Raymond Maria La Grange of the Church of St. Vincent Ferrer on Lexington Avenue confirmed to The Post that at least three-quarters of his new converts are in their 20s or early 30s and that “it was really after [the pandemic] that the parish in general started to grow.”\n\n“Some were Protestants, some were nonreligious, some were Catholics who never practiced the faith. Both men and women,” he said. “Some well-off, others living day to day. Some are intellectuals, some are mystics. Some got to know Catholics who brought them in, others came in on their own and hardly know any Catholics.”\n\n“It is a fun time to be a priest. It’s busy, in a good way,” La Grange added.\n\nA 30-year-old software developer in Southern California, Lawson was raised nondenominational and was an atheist as a teen, but ultimately found the evangelical church in his early 20s when he was suffering.\n\n“I was wrestling with mental illness and the meaning of life, and those are questions that I could not answer without religion,” he said. “My mental health improved very quickly, and church showed me a different way of looking at life. I just became less self-centered, and that made me a lot happier.”\n\nBut he was moved to look into Catholicism after watching abuzzy online debatebetween a Catholic and a Protestant creator, Cameron Bertuzzi, about church history.\n\nBertuzzi’s own very public conversion after that debate is often cited by young Catholic converts online as a “red pill” moment for them.\n\nThe 38-year-old Houston native, who was raised as a charismatic Christian and has made Protestant content on YouTube for years, said the debate led him to the conclusion that he had no choice but to convert.\n\n“Eventually I was just like, you know, ‘I just need to do this. I just need to become Catholic,’” he told The Post. “I sort of worked through the objections that I had, and I didn’t really have any objections left, and I was like ‘There’s nothing really holding me back from Catholicism, so I should probably just embrace it.’”\n\nBertuzzi has sincebeen very openabout being a convert on his popular YouTube Channel — a resource Lawson turned to often in his own journey to Catholicism.\n\nDespite his parents’ “very strong negative reaction,” Lawson started attending Catholic services in 2022 and converted a year ago.\n\n“I had anxiety, depression, and panic attacks, but since I’ve started praying the rosary regularly, I haven’t had any of those issues,” he said.\n\nAs a catechist — a lay member who teaches others about the faith — at his parish, Lawson estimates there’s been a 50% year-over-year increase in converts, many of them in their 20s and 30s. He has observed that converts tend to be “more traditional” and “a little more fervent and a little more forceful in their beliefs.”\n\n“I think a lot of people are feeling unsatisfied with their experience in the Protestant churches,” he said. “And I think a lot of young people are seeking community and they’re seeking purpose — and they’re finding that in the Catholic Church.”\n\nSome young people are converting from outside Christianity entirely. Marin Minamiya, 28, of Austin, was raised in the Shinto faith in Japan but began to explore Catholicism while studying information sciences at Columbia University.\n\n“I think being Catholic inevitably makes one have a positive outlook on life because God is good,” said Minamiya, who graduated in February. “It gives me a lot of confidence, and it gives me a lot of support through the Catholic community to become a better person and a virtuous person.”\n\nMinamiya, who works in IT andholds the recordas the youngest woman to have climbed Mount Manaslu in Nepal, converted in December 2024.\n\nThe decision to become Catholic was more difficult for 27-year-old Cincinnati native Taylor New. At 21, while an active member of her evangelical church community, she stumbled upon a YouTuber explaining why studying the history of Catholicism made her convert.\n\n“I decided to watch it, not thinking much of it — but I joke that that video ruined my life in the best way, because that set me on my spiral of research,” New told The Post.\n\nAfter months of reading and watching videos, New, who works in insurance, came to the conclusion that the history of the Catholic Church made it the only legitimate Christian faith — but she was afraid to leave her community behind.\n\n“It was something that I didn’t want to do. I begged God to not make me Catholic,” she said. “I found a lot of support in my church, just because I didn’t have a super-tight-knit family at home.”\n\nBut, after years of internal conflict, she finally decided to attend Order of Christian Initiation of Adults classes to convert in 2024.\n\nIn retrospect, she credits the internet for showing the way: “A lot of young people are converting to the faith, and I think that’s just because there’s a wealth of things to search on the internet, and people are just on a search for truth which has them gravitating to the Catholic Church.”\n\nLa Grange’s theory: “I’d say the most common impetus of the young is that they realize the world cannot provide them with any moral order, or reasons for living in any particular way. A culture of license has left them unmoored.”"
    }
}