{
    "question": "How might the competing claims about violations of the Easter ceasefire influence the chances of extending the truce and the broader prospects for negotiations?",
    "content": {
        "source_1": "Moscow said its forces were “strictly observing” the ceasefire and accused Ukraine of violating the pause in fighting.\n\nRussian forces violated President Vladimir Putin’s self-imposed Easter ceasefire in his Ukraine war with numerous strikes and assaults, Ukrainian President Volodymyr Zelenskyy said on Sunday.\n\n“We can say that the Russian army is trying to create a general impression of a ceasefire, but in some places it is still trying to make individual attempts to advance and inflict losses on Ukraine,” Zelenskyy said onhis Telegram channel.\n\nThe Kremlin on Saturdayannounceda unilateral ceasefire on the occasion of Easter until midnight Sunday. But Saturday night the Ukrainian army already reported continued Russian attacks with artillery and drones — in line with Moscow’slong history of violating ceasefires.\n\n“Since the beginning of the day, the Russian army has violated Putin’s ceasefire more than two thousand times,” Zelenskyy said in a social media post relaying an 8 p.m. report from Ukrainian commander-in-chief Oleksandr Syrskyi. “There have already been 67 Russian assaults against our positions across various directions, with the highest number in the Pokrovsk direction.\n\nAn earlier post from Zelenskyy said that some Ukrainian troops were killed in an ambush in the Toretsk region.\n\nZelenskyy vowedto “mirror” Putin’s actionsin the Kursk, Belgorod, Zaporizhzhia and Donetsk regions, among others.\n\nRussia’s defense ministry said on Sunday that its forces had been“strictly observing”the ceasefire and accused Ukraine of violating the pause in fighting. The ministry said that Ukrainian units had shot at Russian positions 444 times during the night and carried out more than 900 drone attacks.\n\n“As a result, there were deaths and injuries among the civilian population and damage to civilian objects,” the Russian ministry claimed in astatement.\n\nZelenskyy’s post did say, however, that there were no air raid alerts during the day.\n\n“This is a format of ceasefire that has been achieved and that is the easiest to extend,” he said. Ukraine proposes to cease any strikes using long-range drones and missiles on civilian infrastructure for a period of at least 30 days, with the possibility of extension.\n\nRussian press secretary Dmitry Peskov told state news service TASS that there were no orders to extend the ceasefire.\n\nThe U.S. has been trying to broker a truce agreement between both sides for weeks, but Moscowrejected a recent offer for a month-long full ceasefire, which Ukraine had already agreed to. While Putin did agree to halt attacks on energy facilities and civilian infrastructure, the Kremlinviolated that deal after one hour.\n\nU.S. President Donald Trump hasthreatenedto abandon peace talks if both sides don’t play ball and make progress toward a ceasefire.\n\n“If for some reason, one of the two parties makes it very difficult, we’re just going to say ‘you’re foolish, you’re fools, you’re horrible people’ and we’re going to take a pass,” Trump said on Friday.\n\nLate on Sunday, he wrote on his Truth Social media platform: “HOPEFULLY RUSSIA AMD UKRAINE WILL MAKE A DEAL THIS WEEK. BOTH WILL THEN START TO DO BIG BUSINESS WITH THE UNITED STATES OF AMERICA, WHICH IS THRIVING, AND MAKE A FORTUNE!”\n\nA week ago, Russialaunched a missile attackon the Ukrainian city of Sumy as people were gathering to celebrate Palm Sunday, killing more than 30 and wounding another 117 in one the deadliest attacks this year.\n\nThis article has been updated.Joe Stanley-Smith contributed to this report.\n\nEuropean Commission president defeats far-right plan to bring her down.\n\nEuropean Commission president expected to easily survive ― but she has made two major concessions.\n\nEuropean Commission president suggests a stronger role for regions to consolidate her support in a key vote on Thursday.\n\nThe Patriots for Europe, a new far-right force in Brussels, has won the right to lead the European Parliament’s 2040 climate target discussions.",
        "source_2": "Reporting by Lidia Kelly in Melbourne; Pavel Polityuk in Kyiv and Guy Faulconbridge and Vladimir Soldatkin in Moscow; additional reporting by Anatolii Stepanov in Donetsk region\nEditing by William Mallard, Helen Popper, Giles Elgood and Leslie Adler\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nAs Moscow bureau chief, Guy runs coverage of Russia and the Commonwealth of Independent States. Before Moscow, Guy ran Brexit coverage as London bureau chief (2012-2022). On the night of Brexit, his team delivered one of Reuters historic wins - reporting news of Brexit first to the world and the financial markets. Guy graduated from the London School of Economics and started his career as an intern at Bloomberg. He has spent over 14 years covering the former Soviet Union. He speaks fluent Russian.",
        "source_3": "Ukraine failed to uphold the 30-hour Easter ceasefire which expired at midnight on Monday, Russian Foreign Ministry spokeswoman Maria Zakharova has said.\n\nShe made her remarks on Sunday evening after the US State Department said it would welcome an extension of the short truce“beyond Sunday.”\n\n“Well, the Kiev regime failed to observe it during Easter,”Zakharova wrote on Telegram.“Moreover, the [Ukrainian government] has violated the truce using American HIMARS systems,”she added.\n\n“It is not a coincidence, but a pattern: during the moratorium on strikes on energy facilities, Zelensky – despite having agreed to it – was deliberately targeting civilian energy infrastructure,”Zakharova wrote.\n\nUkrainian leader Vladimir Zelensky said he would respect the temporary ceasefire announced by Russian President Vladimir Putin if Moscow stayed true to its word.\n\nThe Russian Defense Ministry, however, recorded more than 1,300 artillery and drone attacks after the truce took effect at 6pm local time on Saturday. Zelensky, in turn, accused Russia of around 3,000 violations on Sunday.\n\nAccording to the Russian MOD, Ukraine regularly targeted fuel depots and parts of the power grid during the 30-day energy truce brokered last month by the US.\n\nOne of the largest breaches occurred on March 21, when Ukraine struck a gas metering station in Sudzha, which is part of a major pipeline used to deliver gas to the EU, the Russian Defense Ministry said.\n\n© Autonomous Nonprofit Organization “TV-Novosti”, 2005–2025. All rights reserved.\n\nThis website uses cookies. Read RTPrivacy policyto find out more."
    }
}