{
    "question": "In what ways could the Trump administration’s decision to revise covid.gov to declare a lab-leak origin as COVID-19’s “true” source shape public understanding and future government health communication amid ongoing scientific debate?",
    "content": {
        "source_1": "Posts from this topic will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nThe webpage purports to reveal the ‘true origins’ of covid.\n\nThe webpage purports to reveal the ‘true origins’ of covid.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nCovid.gov, the government website where you couldpreviously find informationabout covid, nowredirects to a pagethat pushes the conspiracy theory that the virus originated from a lab. Navigating to the website reveals a prominent banner with the words “Lab Leak” and a photo of Donald Trump, asspotted earlier byWired’s Andrew Couts.\n\nCovidtests.gov, where you could order free covid tests, also redirects to the new webpage.\n\nThe website purports to reveal the “true origins” of covid, blaming a Chinese lab’s “inadequate biosafety levels” for allegedly “leaking” the virus. It goes on to push other blatant conspiracy theories, such as the claim that the Biden administration misled the public about covid’s origins and “demonized alternative treatments.” The page also claims that the WHO “caved to pressure from the Chinese Communist Party” in its response to the pandemic.\n\nIt’s not clear exactly when the covid.gov page changed. As shown on an archivedversion of the webpage, covid.gov included resources about the virus up until at least April 10th. The page now includes a link to the House Oversight Committee report, which similarly promotes the lab leak conspiracy theory.\n\nSince February, the Trump administration has been working torip down webpages from federal websitesthat don’t align with its beliefs – particularly informationrelated to climate change, racial equity, and gender identity. Though a court order brought some of these pages back online, the Trump administration ordered federal agencies to includedisclaimers around“gender ideology.”\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.",
        "source_2": "Jesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current affairs and trending news. He has covered current affairs, healthcare, pop culture, and sports. Jesus joined Newsweek's U.S. bureau in 2024, and has previously worked for The Financial Times and served as an international reporter and newsletter editor for El Espectador in Colombia. He graduated with an M.A. in Journalism and Digital Innovation from New York University. Languages: English, Spanish. You can get in touch with Jesus by emailingj.mosquera@newsweek.com\n\nJason Lemon is a Senior Politics Editor atNewsweekbased in Brooklyn, New York. Prior to taking on the editor role, Jason's reporting focused on U.S. politics and international affairs. He joinedNewsweekin 2018, and had previously worked as an editor at a Middle Eastern media startup called StepFeed. He also worked a year as a contributor toThe Atlanta Journal-Constitutionand has bylines inThe Christian Science Monitor,The Palm Beach Post, Al Fanar Media andA Magazine. He is a graduate of the American University of Beirut in Lebanon and Andrews University in Michigan. You can get in touch with Jason by emailing j.lemon@newsweek.com. Languages: English, Spanish, French and Levantine Arabic\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nThe Trump administration has doubled down on the lab-leak theory of COVID-19's origins, publishing an in-depth statement Friday accusing public health officials and intelligence agencies of suppressing the theory for political purposes.\n\n\"Public health officials often mislead the American people through conflicting messaging, knee-jerk reactions, and a lack of transparency. Most egregiously, the federal government demonized alternative treatments and disfavored narratives, such as the lab leak theory, in a shameful effort to coerce and control the American people's health decisions,\" the new White House webpage said.\n\nThe White House took aim at Dr.Anthony Faucidirectly, saying he pushed \"the preferred narrative that COVID-19 originated naturally.\"\n\nThe release follows a declassifiedCIAreportthat assessed the COVID-19 pandemic most likely originatedfroma research lab in Wuhan, China. The assessment, released Saturday, emphasized that both lab-related and natural origins remain plausible and admitted a \"low confidence\" rating in its findings.\n\nJohn Ratcliffe, who was sworn in last week as CIA director, said the decision to publish the report was a matter of transparency.\n\nFramed as an in-depth exposé, the webpage promotes the lab-leak theory using bullet-pointed arguments, official citations, and pointed critiques of U.S. institutions.\n\nIt targets not only Dr. Anthony Fauci but also former New York GovernorAndrew Cuomo, the National Institutes of Health (NIH), EcoHealth Alliance, and the World Health Organization—accusing them of covering up or obstructing investigations into the origins of the virus.\n\nThe site alleges that U.S. taxpayer money funded high-risk gain-of-function research in Wuhan and claims that federal agencies actively delayed or blocked oversight efforts. It cites ongoing congressional investigations by the House Oversight Committee and accuses the Biden administration's Department of Health and Human Services of shielding key public health officials from scrutiny.\n\nThis aggressive messaging reflects the long-running effort by Trump-era officials to elevate the lab-leak hypothesis. In 2020, then-PresidentDonald Trumpand Secretary of StateMike Pompeopublicly stated that the virus likely originated in a Chinese lab.\n\n\"We weren't cherry-picking the evidence. We were reading all of the intelligence,\" Pompeo told Politico. \"And the world now knows that our judgments were supported by an enormous amount of evidence that continues to grow.\"\n\nThe latest CIA report, however, does not present new intelligence. Instead, it reflects a reevaluation of existing data.\n\n\"The CIA has 'low confidence' in its assessment that a 'research-related origin' of the COVID-19 pandemic is more likely,\" a senior intelligence official told Reuters. The agency maintains that both lab-based and natural origin theories remain plausible and says it is open to considering new evidence as it emerges.\n\nChina quickly rejected the CIA's conclusion. \"We firmly oppose the politicization and stigmatization of the source of the virus,\" said Liu Pengyu, spokesperson for China's U.S. embassy, in a statement to the Associated Press.\n\nThe webpage was released after Dr. Anthony Fauci—who retired in 2022 following decades as director of the National Institute of Allergy and Infectious Diseases—received a sweepingpreemptive pardonfrom former PresidentJoe Biden. Issued in Biden's final days in office, the pardon covers Fauci from 2014 onward, effectively insulating him from potential retroactive legal exposure related to the virus's origins or the U.S. role in overseas research.\n\nIn the early pandemic, Fauci was a prominent figure in the federal response and often clashed with Trump over mask mandates and other health measures. While many saw Biden's pardon as a buffer against MAGA-aligned investigations, the decision's backdating to a period years before the first known COVID-19 cases raised additional scrutiny.\n\nRepresentative Brad Wenstrup, an Ohio Republican and chair of the Select Subcommittee on the Coronavirus Pandemic, opened the report by stating:\"The possibility that COVID-19 emerged because of a laboratory or research-related accident is not a conspiracy theory.\"\n\nDr. Anthony Fauci, testifying before the same subcommittee in 2023, said:\"I have kept an open mind throughout the entire process, despite the fact that I felt then, and still do, that the most likely origin is a natural occurrence.\"\n\nLiu Pengyu, spokesperson for China's U.S. embassy, reiterated Beijing's stance:\"Once again we call on everyone to respect science and stay away from conspiracy theories.\"\n\nTheDepartment of Justicehas opened an investigation into EcoHealth Alliance's activities during the pandemic. Congressional hearings, potential subpoenas, and further declassifications are expected as debate over the virus's origin enters a new and more politically charged phase.\n\nUpdate 4/18/25, 12:27 p.m. ET: This article was updated with additional information.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nJesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current affairs and trending news. He has covered current affairs, healthcare, pop culture, and sports. Jesus joined Newsweek's U.S. bureau in 2024, and has previously worked for The Financial Times and served as an international reporter and newsletter editor for El Espectador in Colombia. He graduated with an M.A. in Journalism and Digital Innovation from New York University. Languages: English, Spanish. You can get in touch with Jesus by emailingj.mosquera@newsweek.com\n\nJason Lemon is a Senior Politics Editor atNewsweekbased in Brooklyn, New York. Prior to taking on the editor role, Jason's reporting focused on U.S. politics and international affairs. He joinedNewsweekin 2018, and had previously worked as an editor at a Middle Eastern media startup called StepFeed. He also worked a year as a contributor toThe Atlanta Journal-Constitutionand has bylines inThe Christian Science Monitor,The Palm Beach Post, Al Fanar Media andA Magazine. He is a graduate of the American University of Beirut in Lebanon and Andrews University in Michigan. You can get in touch with Jason by emailing j.lemon@newsweek.com. Languages: English, Spanish, French and Levantine Arabic\n\nJesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current affairs and trending news. He has covered current affairs, healthcare, pop culture, and sports. Jesus joined Newsweek's U.S. bureau in 2024, and has previously worked for The Financial Times and served as an international reporter and newsletter editor for El Espectador in Colombia. He graduated with an M.A. in Journalism and Digital Innovation from New York University. Languages: English, Spanish. You can get in touch with Jesus by emailingj.mosquera@newsweek.com\n\nJesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current                                    ...Read more",
        "source_3": "Fox News' Alexandria Hoff provides details on CIE Director John Ratcliffe's move to declassify findings from an analysis on the origins of the COVID-19 pandemic. 'Outnumbered' panelists weigh in.\n\nFIRST ON FOX:The Trump administration rolled out a revamped COVID.gov website Friday showing the \"true origins\" of the coronavirus, while admonishing Democrats and the media for discrediting the theory that the virus leaked from a lab and alternative health treatments, and for imposing strict mandates.\n\n\"This administration prioritizes transparency over all else,\" a senior administration official told Fox News Digital Friday. \"The American people deserve to know the truth about the COVID pandemic, and we will always find ways to reach communities with that message.\"\n\nThe website, which previously had focused on promoting the coronavirus vaccine to Americans, now walks readers through evidence supporting the lab leak theory, how former National Institute of Allergy and Infectious Diseases Director Anthony Fauci promoted the idea that COVID-19 originated naturally, former PresidentJoe Bidenpardoning Fauci for \"any offenses against\" the U.S. he may have committed, and providing details on the origin of the \"social distancing\" rules and mask mandates.\n\nLEGACY MEDIA, DC JOURNOS COME AROUND TO INVESTIGATING DEM SCANDALS YEARS AFTER CONSERVATIVES SOUNDED ALARM\n\nThe new COVID.gov website showing what the White House calls the \"true origins of\" the coronavirus.(Covid.gov )\n\n\"'The Proximal Origin of SARS-CoV-2' publication — which was used repeatedly by public health officials and the media to discredit the lab leak theory — was promoted by Dr. Fauci to push the preferred narrative that COVID-19 originated naturally,\"the site states,before launching into five bullet points on the origins of the virus.\n\nThe new site outlines that a biological characteristic found in the virus was not found in nature, bolstering the lab-leak theory, while noting that Wuhan, China, where the firstcoronavirus case was found,is also home to China's \"foremost SARs research lab\" and that \"if there was evidence of a natural origin it would have already surfaced. But it hasn't.\"\n\nHOUSE SUBCOMMITTEE CONCLUDES COVID-19 'MOST LIKELY' LEAKED FROM WUHAN LAB\n\nThe Trump administration launched a new COVID.gov website April 18, 2025.(Covid.gov )\n\nThe Trump administration's CIA reported earlier in 2025 that a lab leak was thelikely origin of the COVID-19 virus,which had been passed off by media outlets and scientists as a likely conspiracy theory during the early days of the pandemic. The Department of Energy under the Biden administration and former FBI Director Christopher Wray in 2023 also said evidence indicated that the coronarius was the result of a lab leak.\n\nCREDIBILITY CRISIS: NEW YORK TIMES HELPED MISLEAD AMERICA OVER COVID LAB LEAK THEORY\n\nThe website also walks readers through the origins of COVID-era rules, such as mask mandates and social distancing.\n\n\"The ‘six feet apart’ social distancing recommendation — which shut down schools and small business across the country — was arbitrary and not based on science,\" it states. \"During closed-door testimony, Dr. Fauci testified that guidance 'sort of just appeared.\"\n\nThe website says of mask mandates: \"There was no conclusive evidence that masks effectively protected Americans from COVID-19. Public health officials flip-flopped on the efficacy of masks without providing Americans scientific data — causing a massive uptick in public distrust.\"\n\nMany media outlets dismissed Trump in 2020 when he said he had seen evidence that the virus originated in a Wuhan, China, lab.(Alex Brandon/The Associated Press)\n\nThe website notes that content on the page was sourced directly from the House Oversight Committee's Select Subcommittee on the Coronavirus Pandemic.\n\n\"Public health officials often mislead the American people through conflicting messaging, knee-jerk reactions, and a lack of transparency,\" the website states under a portion called \"COVID-19 misinformation.\" \"Most egregiously, the federal government demonized alternative treatments and disfavored narratives, such as the lab leak theory, in a shameful effort to coerce and control the American people's health decisions.\"\n\nTRUMP MADE ME DO IT: LIBERAL MEDIA BLAMES ITS DISMISSAL OF LAB LEAK THEORY ON EX-PRESIDENT'S ‘XENOPHOBIA’\n\nThe new COVID.gov website takes aim at narratives pushed by media and Democrats during the pandemic.(Covid.gov )\n\nMany media outlets dismissed Trump in 2020 when he said he had seen evidence that the virus originated in a Wuhan, China, lab, before U.S. intelligence officials such as Wray and the Department of Energy reported that the virus likely originated there.\n\nMany outlets have since published articles showing that the theory is credible, including the New York Times running a March column claiming the scientific community had \"badly misled\" the public in an effort to suppress the theory, even after the paper's own science writer called the theory \"racist.\"\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}