{
    "question": "In what ways could the remedies phase of this antitrust case alter the balance of power in online advertising technology, and what trade-offs should be weighed for publishers, advertisers, and consumers?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nA man walks past Google’s offices in London’s Kings Cross area, on Aug. 10, 2024. (AP Photo/Brian Melley, File)\n\nSAN FRANCISCO (AP) — Google has been branded an abusive monopolist by a federal judge for the second time in less than a year, this time for illegally exploiting some of its online marketing technology to boost the profits fueling an internet empire currently worth $1.8 trillion.\n\nThe ruling issued Thursday by U.S. District Judge Leonie Brinkema in Virginia comes on the heels ofa separate decision in Augustthat concluded Google’s namesake search engine has been illegally leveraging its dominance to stifle competition and innovation.\n\nAfter the U.S. Justice Department targeted Google’s ubiquitous search engineduring President Donald Trump’s firstterm, the same agency went after the company’s lucrative digital advertising network in 2023 duringPresident Joe Biden’s ensuing administrationin an attempt to undercut the power that Google has amassed since its inception in a Silicon Valley garage in 1998.\n\nAlthough antitrust regulators prevailed both times, the battle is likely to continue for several more years as Google tries to overturn the two monopoly decisions in appeals while forging ahead in the new and highly lucrative technological frontier ofartificial intelligence.\n\nThe next step in the latest case is a penalty phase that will likely begin late this year or early next year. The same so-called remedy hearings in the search monopoly case are scheduled to begin Monday in Washington D.C., where Justice Department lawyers will try to convince U.S. District Judge Amit Mehta to impose a sweeping punishment that includesa proposed requirement for Google to sell its Chrome web browser.\n\nBrinkema’s 115-page decision centers on the marketing machine that Google has spent the past 17 years building around its search engine and other widely used products and services, including its Chrome browser, YouTube video site and digital maps.\n\nThe system was largely built around a series of acquisitions that started with Google’s $3.2 billion purchase of online ad specialist DoubleClick in 2008. U.S. regulators approved the deals at the time they were made before realizing that they had given the Mountain View, California, company a platform to manipulate the prices in an ecosystem that a wide range of websites depend on for revenue and provides a vital marketing connection to consumers.\n\nThe Justice Department lawyers argued that Google built and maintained dominant market positions in a technology trifecta used by website publishers to sell ad space on their webpages, as well as the technology that advertisers use to get their ads in front of consumers, and the ad exchanges that conduct automated auctions in fractions of a second to match buyer and seller.\n\nAfter evaluating the evidence presented during a lengthy trial thatconcluded just before Thanksgiving last year,Brinkema reached a decision that rejected the Justice Department’s assertions that Google has been mistreating advertisers while concluding the company has been abusing its power to stifle competition to the detriment of online publishers forced to rely on its network for revenue.\n\n“For over a decade, Google has tied its publisher ad server and ad exchange together through contractual policies and technological integration, which enabled the company to establish and protect its monopoly power in these two markets.” Brinkema wrote. “Google further entrenched its monopoly power by imposing anticompetitive policies on its customers and eliminating desirable product features.”\n\nDespite that rebuke, Brinkema also concluded that Google didn’t break the law when it snapped up Doubleclick nor when it followed up that deal a few years later by buying another service, Admeld.\n\nThe Justice Department “failed to show that the DoubleClick and Admeld acquisitions were anticompetitive,” Brinkema wrote. “Although these acquisitions helped Google gain monopoly power in two adjacent ad tech markets, they are insufficient, when viewed in isolation, to prove that Google acquired or maintained this monopoly power through exclusionary practices.”\n\nThat finding may help Google fight off any attempt to force it to sell its advertising technology to stop its monopolistic behavior.\n\n“This is a landmark victory in the ongoing fight to stop Google from monopolizing the digital public square,” U.S. Attorney General Pamela Bondisaid in a statement.\n\nIn a statement, Google said it will appeal the ruling.\n\n“We disagree with the Court’s decision regarding our publisher tools,” said Lee-Anne Mulholland, Google’s vice president of regulatory affairs. “Publishers have many options and they choose Google because our ad tech tools are simple, affordable and effective.”\n\nAnalysts such as Brian Pitz of BMO Markets had been predicting that Google would likely lose the case, helping to brace investors for the latest setback to the company and its corporate parent, Alphabet Inc., whose shares declined by about 1% Thursday to close at $151.22. Alphabet’s stock has plunged by 20% so far this year.\n\nOn top of the setbacks in search and advertising, Google also is fightinga federal jury’s 2023 verdictthat determined its Play Store for apps on smartphones powered by its Android software is also an illegal monopoly.\n\nAs it did in the search monopoly case, Google vehemently denied the Justice Department’s allegations. Its lawyers argued the government largely based its case on an antiquated concept of a market that existed a decade ago while underestimating a highly competitive market for advertising spending that includes the likes of Facebook parent Meta Platforms, Amazon, Microsoft and Comcast.\n\nThe market as drawn in the Justice Department’s case didn’t include ads that appear on mobile apps, streaming television services, or other platforms to which internet users have increasingly migrated, prompting Google lawyer Karen Dunn to compare the government’s definition a “time capsule with a BlackBerry, an iPod and a Blockbuster video card” during her opening statementwhen the trial began last September.\n\nAt trial, the Justice Department’s lawyers emphasized the harm to news publishers that has arisen from Google’s alleged dominance of the marketplace. Witnesses from Gannett, the publisher of USA Today and other newspapers, and News Corp., the publisher of The Wall Street Journal, testified about the difficulties they have faced and what they said was a lack of alternatives to Google’s ad tech. Those companies rely on online advertising to fund their news operations and make their articles free to consumers on the internet, government lawyers have argued.\n\nNow the government is in position to try to dismantle that byzantine ad system. When the case was filed more than two years ago during the Biden administration, the Justice Department asserted Google should be forced to sell, at a minimum, its Ad Manager product, which includes the technology used by website publishers and the ad exchange.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "A federal judge ruled on Thursday Google violated antitrust laws to hold a monopoly over online advertising technology, a major loss for the company in its latest antitrust case as Google may soon be forced to sell its Chrome browser and other assets.\n\nJudge Leonie BrinkemaruledThursday that Google has “willfully engaged in a series of anticompetitive acts” to maintain a monopoly in the publishing ad server and ad exchange markets, including eliminating competitors through acquisitions and forcing customers to use the company’s products, among others.\n\nBrinkema, however, also ruled prosecutors failed to successfully argue Google held a monopoly over advertiser ad networks, suggesting they used a market term “not common in the digital advertising industry.”\n\nGoogle’s attorneys argued the company faced competition from Amazon and Comcast, and that social networks like TikTok also posed market challenges, though the Justice Department claimed Google held an 87% market share in ad-selling technology.\n\nThursday’s decision is the latest against Google after Judge Amit Mehtaruledin August the company violated antitrust laws to maintain a monopoly with its search engine, and the Justice Department in NovemberaskedMehta to force Google to sell its Chrome browser, which prosecutors said “fortified” the company’s dominance.\n\nBrinkema’s ruling could allow prosecutors to request Google break up its advertising products, and the Justice Department has argued the company should at least sell Google Ad Manager, a platform that includes the company’s ad server and ad exchange.\n\nLee-Anne Mulholland, Google’s vice president of regulatory affairs, said in astatementthe company disagrees with Brinkema’s ruling and will appeal the decision.\n\nGet Forbes Breaking News Text Alerts:We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign uphere.\n\nSome industry analysts havereportedlyspeculated that Google’s advertising technology business, if spun off as a separate company, could be worth up to $95 billion. Google Network, a division of Google’s business that manages an auction-style system for advertisers to purchase digital ad space, generated $31.4 billion in revenue in 2023.\n\nMehta will oversee a hearing Monday on the Justice Department’s request to make Google sell its Chrome browser and implement other changes to end its online search monopoly. The trial is expected to last three weeks.\n\nThe Justice Department brought a series of antitrust cases against Google under the Biden administration, including an October 2020 lawsuit alleging Google held a monopoly over the search engine market. ProsecutorsclaimedGoogle made up nearly 90% of Americans’ online search queries, though Google disputed that estimate. In his ruling, Mehta wrote, “Google is a monopolist” and has “acted as one to maintain its monopoly.” In 2023, Googleagreedto pay $700 million to resolve settle an antitrust case that alleged the company forced app makers to use its payment system on its Play Store marketplace. The DOJ sued Google again that year, claiming Google illegally maintained a monopoly on advertising technology markets. Prosecutors argued Google locked publishers into using its software for advertising, and some of the company’s market dominance stemmed from a $3.1 billion acquisition of the advertising software firm DoubleClick in 2008.\n\nMeta could be forced to restructure its business or sell Instagram and WhatsApp, as the company faces an antitrust suit. The Federal Trade Commission claims Meta purchased the two apps to eliminate competition for Facebook, though the company has denied this claim and countered that it faces competition from TikTok and other social media companies.\n\nDOJ’s Proposal To Stop Google’s Search Monopoly Includes Forced Sale Of Chrome, Changes To Android Search(Forbes)\n\nGoogle Illegally Acted As A Search Monopoly, Judge Rules In Major Case(Forbes)",
        "source_3": "Google operates illegal monopolies over two separate markets related to digital advertising technology, a federal judge ruled on Thursday – dealing the Big Tech giant another historic antitrust loss that could result in a breakup of its online empire.\n\nThe bombshell ruling by US Judge Leonie Brinkema in the Eastern District of Virginia determined that Google violated the Sherman Act by dominating the online publisher ad server market and the ad-exchange market that connects ad buyers to sellers.\n\n“Google further entrenched its monopoly power by imposing anticompetitive practices on its customers and eliminating desirable product features,” Brinkema wrote.\n\n“In addition to depriving rivals of the ability to compete, this exclusionary conduct substantially harmed Google’s publisher customers, the competitive process, and, ultimately, consumers of information on the open web,” the judge added.\n\nShares of Google parent Alphabet were off 1.2% at $153.64 on Thursday.\n\nA Google breakup “looks likely” in light of the court rulings, according to Mike Davis, an antitrust adviser to President Trump and founder of the conservative Internet Accountability Project.\n\nThe Justice Department has argued that the court should force Google to sell off its digital advertising products, especially the Google Ad Manager, which includes both its publisher ad server and its ad exchange.\n\n“Google made its trillions by monopolizing the online advertising market, then Google uses its market power to crush competition, shutter small businesses and cancel conservatives,” Davis said. “That’s coming to an end.”\n\nThe News/Media Alliance, a nonprofit that represents more than 2,200 publishers including The Post and a longtime critic of Google’s business practices, said Brinkema’s ruling marked “a big day for our industry.”\n\n“The news media industry hails the court’s decision to again hold Google accountable for decades of abuse of its market power,” said Danielle Coffey, the nonprofit’s president and CEO. “Google’s monopolistic tactics—this time in the advertising market—have starved content creators of the revenues they deserve and need to sustain quality journalism.”\n\nBrinkema said the DOJ had failed to prove that Google has a monopoly over a third market for advertiser ad networks during the three-week nonjury trial, which was originally brought in 2023 by the DOJ and a coalition of US states.\n\nAs a result, Google claimed partial victory and vowed to challenge the rest of the judge’s determinations.\n\n“We won half of this case and we will appeal the other half,” Google vice president of regulatory affairs Lee-Anne Mulholland said in a statement.\n\n“We disagree with the Court’s decision regarding our publisher tools. Publishers have many options and they choose Google because our ad tech tools are simple, affordable and effective,” Mulholland added.\n\nOnline watchdogs lauded Brinkema’s ruling as a major victory for Google’s critics.\n\n“This ruling is an unequivocal win for the American people that will help lower prices, increase competition, and lead to a better internet for everyone,” said Sacha Howarth, executive director of the Tech Oversight Project.\n\n“We applaud Judge Brinkema’s decision that Google must face accountability for its illegal and exclusionary conduct in the advertising technology sector,” Yelp General Counsel Aaron Schur said in a statement. “We are hopeful that the DOJ will propose significant remedies that provide a path to fair competition and an open internet for all.”\n\n“With this decision, and the remedies the Court decides to impose, Gannett anticipates that balance will be restored to the digital advertising market and that publishers like Gannett will have the ability to compete fairly without having to contend with Google’s market manipulation,” a Gannett spokesperson said.\n\nDOJ attorneys argued during trial that Google has harmed online publishers and businesses alike by abusing its power as primary gatekeeper for online ad deals. During the trial, the feds said Google leverages monopoly power to siphon up to 35 cents for every dollar spent on its ad platforms.\n\nAccording to one document presented at trial, a Google executive boasted in 2009 that the company’s goal in thedigital ads business was to “crush” rivals.\n\nMeanwhile, Google’s attorneys had argued that the DOJ’s case was based on an outdated understanding of the internet and warned that it carried a “serious risk of error or unintended consequences” if the government intervened.\n\nA second trial phase will be held to “determine the appropriate remedies” to tackle Google’s monopoly, Brinkema said.\n\nThe ruling is another major legal blow for Google. Last year, a federal judge ruled in a separate case that Google has an illegal monopoly over the online search market.\n\nThe remedies phase for that trial is set to begin Monday, with prosecutors seeking a forced selloff of its Chrome web browser, among other fixes."
    }
}