{
    "question": "What considerations should guide university and state responses to the FSU shooting—where two people were killed and the suspected student gunman allegedly used his deputy mother’s former service weapon—in terms of campus safety, secure firearm storage, and support for students with prior trauma?",
    "content": {
        "source_1": "Updated on:  April 18, 2025 / 5:41 PM EDT/ CBS News\n\nTwo people were killed and six were injured after an active shooter opened fire on the Florida State University campus in Tallahassee on Thursday, law enforcement said at a news conference.\n\nPolice on Friday clarified to CBS News that five of the injured victims were wounded by gunfire, and a sixth was injured while fleeing the scene. The suspected gunman was shot by police and also taken to a local hospital, where he remained hospitalized Friday.\n\nThe alleged gunman has been identified as 20-year-old Phoenix Ikner, an FSU student who is the son of a Leon County sheriff's deputy, Leon County Sheriff Walter McNeil said at the briefing.\n\nThe suspect was taken into custody after being shot by police, officials said, adding that he invoked his right not to speak with police.\n\nTallahassee Police Chief Lawrence Revell released a video statement Friday, saying there is no known connection between the suspect and any of the victims.\n\nRevell said the suspect was seriously injured and will require a significant amount of time in the hospital. He will then be transferred to a detention facility and face charges up to and including first-degree murder.\n\nInvestigators say the suspect used his mother's former service weapon, now owned by her as a personal handgun, which was found at the scene. They said he was also armed with a shotgun.\n\nCBS News later learned that the sheriff's deputy is the suspect's stepmother, and that his birth parentshad been engaged in a years-long custody disputethat began in 2007 and lasted until 2023.\n\nThe sheriff's deputy has been at the agency for more than 18 years and her service to the community has been exceptional, the sheriff said. \"Unfortunately her son had access to one of her weapons,\" Sheriff McNeil said. He also said that the alleged shooter was a longstanding member of the Leon County Sheriff's Office citizen advisory or youth advisory council and engaged in a number of their training programs. He had \"been steeped in the Leon County Sheriff Office's family,\" the sheriff said.\n\nPolice said the two people killed in the shooting were not students. The victims' names have not been released.\n\nTallahassee policesaidat about 3:15 p.m. ET that the campus has been secured, although multiple law enforcement agencies remain on site for the ongoing investigation. \"Law enforcement has neutralized the threat,\" FSUtweeted. The university said the student union and several other buildings on campus should be avoided \"as they are still considered an active crime scene.\"\n\nPolice responded to an active shooter call from the area of the student union around 12:01 p.m., FSU said. Police later said the shooter opened fire at about 11:50 a.m. The school sentan alertwarning those on campus to \"seek shelter and await further instructions.\" The university also cautioned students to lock and stay away from all doors and windows.\n\nThe wounded arebeing treatedat Tallahassee Memorial HealthCare Hospital, a hospital spokesperson confirmed to CBS News Miami.\n\nIn an briefing Friday afternoon, hospital doctors said all the injured patients, which include the suspect, were in stable condition and are expected to make a full recovery.\n\nThree patients had operations and are out of surgery, hospital staff said, including two patients who needed abdominal surgery procedures and one patient who needed a facial surgery. Hospital staff also treated gunshot wounds to extremities.\n\nTwo of the other victims may go home as early as Friday, hospital staff said.\n\nAva Arenado, an FSU student who was in class when the university alert went out, described a terrifying scene.\n\n\"One of my classmates got an alert on her phone and announced it to the rest of the class,\" Arenadotold CBS News Miami. \"My teacher immediately started barricading the door… and then another student said she'd rather go home, so we all just kind of ran to our cars.\"\n\nFSU student Blake Leonard told CBS News Miami he heard a total of about 30 shots fired. Leonard said he was about 400 feet from the student union when he heard gunfire and started running.\n\n\"I heard about 12 shots go off. In my head I thought it was construction at first, until I looked behind me and saw people running from the union towards my direction, and then I heard another 12 or 15 shots go off, so I started running away from there too,\" he said.\n\nFlorida Gov. Ron DeSantistweeted, \"Our prayers are with our FSU family.\"\n\nTheFBIandATFsaid they had agents at the scene to assist local law enforcement.\n\nWhite House press secretary Karoline Leavitt said President Trump has been briefed on the shooting, and Mr. Trump made brief remarks about it Thursday afternoon.\n\n\"It's a shame. It's a horrible thing. Horrible thing. Things like this take place. And we'll have more to say about it later,\" Mr. Trump said.\n\nAsked later if he would take a look at gun laws in light of the shooting,the president said, \"Well, I'm going to have to look. I'm a big advocate of the Second Amendment. ... These things are terrible. But the gun doesn't do the shooting, the people do.\"\n\nThe university said classes and all events were canceled through Friday, and sports events canceled through Sunday.\n\nThursday's incident wasnot the first time there was a shootingat the school. Three people were shot in the university's libraryin 2014, before the gunman, a former student, was shot by police.\n\nSo far in 2025, there have been 80 mass shootings in the U.S., including the most recent incident at Florida State University, according to the Gun Violence Archive. That's a little more than five incidents per week. In all of 2024, there were 502 incidents, which is a little less than 10 incidents per week.\n\nThe Gun Violence Archive defines a mass shooting as an incident where four or more people are shot or killed, not including the shooter.\n\nCara Tabachnick is a news editor at CBSNews.com. Cara began her career on the crime beat at Newsday. She has written for Marie Claire, The Washington Post and The Wall Street Journal. She reports on justice and human rights issues. Contact her at cara.tabachnick@cbsinteractive.com",
        "source_2": "Gabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nPresidentDonald TrumpaddressedThursday's deadly shooting at Florida State University.\n\nSpeaking to reporters during Italian Prime Minister Giorgia Meloni's visit, the president said, \"I've been fully briefed as far as where we are right now. It's a shame, it's a horrible thing ... horrible that things like this take place. And we'll have more to say about it later.\"\n\nTrump said later in the Oval Office, \"It's a shame,\" he said, calling himself a \"big advocate\" of the Second Amendment and the right to bear arms. \"The gun doesn't do the shooting, the people do,\" Trump said.\n\nA 20-year-old Florida State University student,identified as Phoenix Ikner,opened fire on campus Thursday using his mother's former service weapon, killing two people and injuring at least five others, according to investigators. Ikner, who was shot by law enforcement and remains hospitalized, is the son of a sheriff's deputy, and the shooting unfolded just outside the student union around lunchtime, sending students and parents scrambling for safety—some taking cover in a bowling alley and a freight elevator inside the building.\n\n'It's a shame, it's a horrible thing'US President Donald Trump reacts to the shooting that took place at Florida State University.Read more:https://t.co/AQytYS23pm📺 Sky 501, Virgin 602, Freeview 233 and YouTubepic.twitter.com/OLQZY3066v\n\nThe U.S. average yearly rate of student exposure to a school shooting has increased threefold, from 19 per 100,000 students in 1999-2004 to 51 in 2020-2024, according to KFF, a health policy research, polling and journalism nonprofit.\n\nDonald Trump has consistently positioned himself as a staunch defender of the Second Amendment,framing gun ownership as a fundamental constitutional right.During both of his presidential campaigns, Trump received strong backing from gun rights organizations, including the National Rifle Association (NRA), and has promised to protect law-abiding citizens' right to bear arms. He has opposed measures such as bans on assault weapons or high-capacity magazines, and has advocated for expanding concealed carry rights, including national reciprocity laws that would allow gun permits to be valid across state lines.\n\nAt the same time, Trump has expressed support for certain gun violence prevention efforts, particularly in the wake of mass shootings. Following the 2018 Parkland school shooting, he voiced support for strengthening background checks and temporarily seizing firearms from individuals deemed dangerous, though these proposals were not implemented.\n\nTrump has repeatedly emphasized that addressing mental health issues, not restricting gun ownership, is the key to reducing gun violence.\n\nREPORTER: There are 2 deceased following that shooting at Florida State University. Is there any changes you want to see to gun legislation?TRUMP: Look, I'm a big advocate of the 2nd Amendment ... these things are terrible but the gun doesn't do the shooting, the people dopic.twitter.com/8gdsKeHwIH\n\nRepublican Gov.Ron DeSantiswrote on X,\"Our prayers are with our FSU family and state law enforcement is actively responding.\"\n\nAttorney General Pam Bondi wrote on X,\"The@FBIis on the scene at Florida State and we are in communication with agents on the ground. Our priority is the safety of everyone involved. We will keep updating as we learn more. Praying for all.\"\n\nDemocratic Rep. Jared Moskowitz posted on X,\"I'm monitoring this horrible tragedy in Tallahassee. My thoughts are with those in the hospital, their families, and the FSU community during this time. Students should be able to go to school without the threats of gun violence. This is why we passed the Marjory Stoneman Douglas School Safety Act.\"\n\nRepublican Florida Sen. Rick Scott posted on X,\"Praying for the safety of everyone at FSU and a swift recovery for those injured. My team has been in touch with local law enforcement and continues to monitor the situation - students should continue to follow directions from school officials.\"\n\nFBI Director Kash Patel wrote on X,\"My team and I have been briefed on the tragic shooting at Florida State and ourFBIJacksonville team is on the ground assisting. We will provide full support to local law enforcement as needed. Please keep the FSU community in your prayers.\"\n\nUpdate: 4/17/25, 2:46 p.m. ET: This article has been updated with additional information.\n\nUpdate: 4/17/25, 2:57 p.m. ET: This article has been updated with additional information.\n\nUpdate: 4/17/25, 3:04 p.m. ET: This article has been updated to clarify the number of reported victims in the shooting.\n\nUpdate: 4/17/25, 4:18 p.m. ET: This article has been updated with additional remarks.\n\nUpdate: 4/17/25, 4:56 p.m. ET: This article has been updated with additional information.\n\nUpdate: 4/17/25, 6:05 p.m. ET: This article has been updated with additional remarks from President Trump.\n\nUpdate: 4/17/25, 8 p.m. ET: This article has been updated with additional remarks.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he                                    ...Read more",
        "source_3": "A father whose child was murdered in the Parkland High School shooting revealed that several of his daughter’s surviving classmates were at Florida State University when agunman opened fire on studentsthere Thursday.\n\n“America is broken. My daughter Jaime was murdered in the Parkland school shooting. Many of her friends who were lucky enough to survive that shooting went on to attend FSU,” father Fred Guttenbergwrote on Xshortly after gunfire broke out at FSU’s Tallahassee campus.\n\n“Incredibly, some of them were just a part of their 2nd school shooting and some were in the student union today. As a father, all I ever wanted after the Parkland shooting was to help our children be safe.”\n\n“Sadly, because of the many people who refuse to do the right things about reducing gun violence, I am not surprised by what happened today,” wrote the anti-gun violence advocate.\n\nGuttenberg’s 14-year-old daughter Jamie was among 17 people killed when a deranged gunman opened fire at the high school in February 2018.\n\nAt least one person is dead at FSU after Thursday’s shooting, while six more are wounded – one in critical condition."
    }
}