{
    "question": "In what ways could the apparent DMS/DMDS signal in K2-18b’s atmosphere be explained without invoking life, and what observations over the next one to two years would most decisively test those alternatives?",
    "content": {
        "source_1": "This artist's impression depicts what a water world with a hydrogen atmosphere, such as planet K2-18b, might look like.A. Smith, N. Madhusudhan/University of Cambridgehide caption\n\nAn ocean world that's teeming with microbes — and who knows what other kinds of life — is currently the best explanation for some chemical signatures that the James Webb Space Telescope has spotted in the atmosphere of a distant planet.\n\nThat's according toNikku Madhusudhanof the University of Cambridge's Institute of Astronomy, who called his team's new findings \"astounding.\"\n\n\"These are the first hints we are seeing of an alien world that is possibly inhabited,\" he told reporters in a press briefing. \"This is a revolutionary moment.\"\n\nIt's also a harbinger of future claims about possible signs of life beyond our solar system that should become increasingly common, as scientists take advantage of the James Webb Space Telescope's unprecedented ability to probe the atmosphere of small planets that orbit far away stars.\n\nIn this case, the purportedly tell-tale gases that appear to be in this planet's atmosphere are either dimethyl sulfide, dimethyl disulfide, or some combination of the two. On Earth, these are only produced by life, particularly by marine microbes.\n\nMadhusudhan, despite his enthusiasm, noted that the detection of these gases needs to be confirmed with more telescope observations. And other astronomers  are skeptical.\n\n\"I think this is one of those situations where extraordinary claims require extraordinary evidence,\" saysLaura Kreidberg, an astronomer at the Max Planck Institute for Astronomy in Germany who was not part of the research team. \"I'm not sure we're at the extraordinary evidence level yet.\"\n\nShe says scientists are still learning how to use this powerful new space telescope to analyze the make-up of alien atmospheres by studying the tiny amount of starlight that filters through them.\n\n\"I want to emphasize this is an insanely difficult measurement,\" says Kreidberg.\n\nMåns Holmberg, a researcher at the Space Telescope Science Institute who was part of the group announcing the findings, said the data they used would be publicly available within days, and he urged other astronomers to independently analyze it.\n\n\"For looking at things like this, it requires a dedicated community effort,\" says Holmberg.\n\nEven if the chemical signal they saw is confirmed, the researchers say, scientists will still have to figure out if these molecules could potentially be produced on this planet by previously unknown processes that don't involve life.\n\n\"We should be cautious. I want that to be front and center,\" says Holmberg. \"Any claim of life on another planet requires a lot of justification, and I don't think we're there yet.\"\n\nThe planet in question, K2-18b, was discovered in 2015 by NASA's Kepler mission, which revealed that planets outside our solar system are so common that they outnumber stars.\n\nK2-18b orbits a cool dwarf star that lies about 124 light years away, in the constellation of Leo. The planet is found in the \"Goldilocks zone\" around the star, where temperatures are not too hot and not too cold to have liquid water and, presumably, possible life.\n\nThe planet is smaller than Neptune but bigger than Earth, and belongs to a mysterious class of planets not found in our own solar system. Variousobservationshave led some astronomers to suggest K2-18b could be a world completely covered by a deep ocean, with a hydrogen-rich atmosphere.\n\nWhen researchers first used the James Webb Space Telescope to study this planet a couple of years ago, they reported detecting methane and carbon dioxide.\n\nIntriguingly, they also saw hints of dimethyl sulfide.This sulfur-based molecule is seen as a potential indicator of life because on Earth, it's only made by living things such as ocean phytoplankton.\n\nThe team announced this possible detection of dimethyl sulfide in 2023, but when other scientists followed up, itdidn'tpan out.\n\n\"That was weak from the beginning,\" says Holmberg, who said the instrument on the telescope that they used made it hard to distinguish this molecule from others like methane. \"We didn't have much statistical evidence.\"\n\nNow, though, the team has different and more robust data that they collected about a year ago, using another telescope instrument that Holmberg says is better suited to find the stuff.\n\nAnd this time, the researchers saw signs that could be either dimethyl sulfide, a related chemical called dimethyl disulfide, or some mixture of both life-associated gases.\n\nAt a personal level, says Madhusudhan, \"when you are seeing something like this, it's like — this is a question humanity has been asking for thousands of years, and if you're witnessing it for the first time, it is a shock to the system. And it takes a while to recover from that, from the enormity of it.\"\n\nHe says the researchers were faced with \"potentially one of the biggest landmarks in the history of science. And I know this sounds grand, and it's not my intention to make it sound grand, but there's no other way to put it.\"\n\nThey spent months testing and working with the data \"just trying to get rid of the signal,\" but it persisted, he says, noting that this is the first time that potential indicators of life in a planet that lies in the habitable zone around a star have been discovered \"in the history of our species.\"\n\nStill, he said, \"we're not currently claiming that it is due to life.\"\n\nTheir work, reported inThe Astrophysical Journal Letters, suggests the concentration of these gases in the planet's atmosphere is thousands of times higher than on Earth.\n\nA planet covered entirely in an ocean at higher temperatures could produce more biological productivity, says Madhusudhan, adding that what they saw is consistent with previous predictions about this kind of world.\n\nEdward Schwieterman, an astrobiologist at the University of California, Riverside who wasn't part of the research team that worked on these new results from K2-18b, says that to him this detection seems \"tentative.\"\n\n\"It is not a sure thing,\" he says. And while he thinks the researchers were right to report it, he also thinks it would not be surprising \"if the signal went away\" when other groups reanalyzed the data.\n\nIf the gas or gases are really there, however, he says researchers will have to brainstorm to figure out if anything besides life might produce them at the rate required to sustain such a high level in an atmosphere that could look very different from Earth's.\n\nSchwieterman finds it incredible that scientists are now able to analyze the chemical make-up of distant planets' atmospheres to search them for signs of life.\n\nIn the few years that the James Webb Space Telescope has been operating, he says, scientists have learned more about these planets' atmospheres than in the entire three decades before.\n\n\"But because we are operating so close to the limits of our capabilities,\" says Schwieterman, \"we are going to have these problems of interpretation and potential false positives.\"\n\nAnd they will likely become more common in the years ahead, as more planets get studied in detail.\n\n\"For most planets where we think there's a chance that they're habitable, we're still at a much earlier stage, just trying to figure out if they have any atmosphere at all, let alone what that atmosphere is made out of or whether it's showing signs of life,\" says Kreidberg.\n\nNikole Lewis, an exoplanetary scientist at Cornell University, says that for scientists who specialize in trying to learn about planets beyond our solar system, this phase after the launch of the James Webb Space Telescope is like the burst of new thinking that followed NASA's Voyager mission.\n\nThe twin Voyager spacecraft flew by outer planets such as Jupiter and Saturn, revealing a huge amount of information about their moons and kicking off a serious search for life there.\n\n\"We have lots of people all over the country thinking about what life might look like in the oceans of Europa, what life might look like on the surface of Titan and all of that stuff,\" says Lewis,noting that it takes a lot of theoretical and laboratory work to get a handle on the possibilities.\n\nWhen it comes to planets beyond our solar system, she says, the field is entering a time when researchers need to let \"the observational data sort of lead us in a way that we really need our theory and our laboratory work to catch up with.\"\n\nThat's why she thinks this new finding about planet K2-18b is \"interesting and it's certainly something that we need to keep following through. But I'm not running out of my front door crying, 'Aliens!'\"",
        "source_2": "Scientists have found new but tentative evidence that a faraway world orbiting another star may be home to life.\n\nA Cambridge team studying the atmosphere of a planet called K2-18b has detected signs of molecules which on Earth are only produced by simple organisms.\n\nThis is the second, and more promising, time chemicals associated with life have been detected in the planet's atmosphere by Nasa's James Webb Space Telescope (JWST).\n\nBut the team and independent astronomers stress that more data is needed to confirm these results.\n\nThe lead researcher, Prof Nikku Madhusudhan, told me at his lab at Cambridge University's Institute of Astronomy that he hopes to obtain the clinching evidence soon.\n\n\"This is the strongest evidence yet there is possibly life out there. I can realistically say that we can confirm this signal within one to two years.\"\n\nK2-18b is two-and-a-half times the size of Earth and is 700 trillion miles, or 124 light years, away from us - a distance far beyond what any human could travel in a lifetime.\n\nJWST is so powerful that it can analyse the chemical composition of the planet's atmosphere from the light that passes through from the small red Sun it orbits.\n\nThe Cambridge group has found that the atmosphere seems to contain the chemical signature of at least one of two molecules that are associated with life: dimethyl sulphide (DMS) and dimethyl disulphide (DMDS). On Earth, these gases are produced by marine phytoplankton and bacteria.\n\nProf Madhusudhan said he was surprised by how much gas was apparently detected during a single observation window.\n\n\"The amount we estimate of this gas in the atmosphere is thousands of times higher than what we have on Earth,\" he said.\n\n\"So, if the association with life is real, then this planet will be teeming with life,\" he added.\n\nProf Madhusudhan went further: \"If we confirm that there is life on K2-18b, it should basically confirm that life is very common in the galaxy.\"\n\nHe told BBC Radio 5Live on Thursday: \"This is a very important moment in science, but also very important to us as a species.\n\n\"If there is one example, and the universe being infinite, there is a chance for life on many more planets.\"\n\nDr Subir Sarkar, a lecturer in astrophysics at Cardiff University and part of the research team, said the research suggests K2-18b could have an ocean which could be potentially full of life - though he cautioned scientists \"don't know for sure\".\n\nHe added that the research team's work will continue to focus on looking for life on other planets: \"Keep watching this space.\"\n\nThere are lots of \"ifs\" and \"buts\" at this stage, as Prof Madhusudhan's team freely admits.\n\nFirstly, this latest detection is not at the standard required to claim a discovery.\n\nFor that, the researchers need to be about 99.99999% sure that their results are correct and not a fluke reading. In scientific jargon, that is a five sigma result.\n\nThese latest results are only three sigma, or 99.7%. Which sounds like a lot, but it is not enough to convince the scientific community.However, it is much more than the one sigma result of 68% the team obtained 18 months ago,which was greeted with much scepticism at the time.\n\nBut even if the Cambridge team obtains a five sigma result, that won't be conclusive proof that life exists on the planet, according to Prof Catherine Heymans of Edinburgh University and Scotland's Astronomer Royal, who is independent of the research team.\n\n\"Even with that certainty, there is still the question of what is the origin of this gas,\" she told BBC News.\n\n\"On Earth it is produced by microorganisms in the ocean, but even with perfect data we can't say for sure that this is of a biological origin on an alien world because loads of strange things happen in the Universe and we don't know what other geological activity could be happening on this planet that might produce the molecules.\"\n\nThat view is one the Cambridge team agree with. They are working with other groups to see if DMS and DMDS can be produced by non-living means in the lab.\n\n\"There is still a 0.3% chance that it might be a statistical fluke,\" Prof Madhusudhan said.\n\nSuggesting life may exist on another planet was \"a big claim if true\", he told BBC Radio 4's Today programme, adding: \"So we want to be really, really thorough, and make more observations, and get the evidence to the level that there is less than a one-in-a-million chance of it being a fluke.\"\n\nHe said this should be possible in \"maybe one or two years\".\n\nOther research groups have put forward alternative, lifeless, explanations for the data obtained from K2-18b. There is a strong scientific debate not only about whether DMS and DMDS are present but also the planet's composition.\n\nThe reason many researchers infer that the planet has a vast liquid ocean is the absence of the gas ammonia in K2-18b's atmosphere. Their theory is that the ammonia is absorbed by a vast body of water below.\n\nBut it could equally be explained by an ocean of molten rock, which would preclude life, according to Prof Oliver Shorttle of Cambridge University.\n\n\"Everything we know about planets orbiting other stars comes from the tiny amounts of light that glance off their atmospheres. So it is an incredibly tenuous signal that we are having to read, not only for signs of life, but everything else,\" he said.\n\n\"With K2-18b part of the scientific debate is still about the structure of the planet.\"\n\nDr Nicolas Wogan at Nasa's Ames Research Center has yet another interpretation of the data. Hepublished research suggesting that K2-18b is a mini gas giant with no surface.\n\nBoth these alternative interpretations have also been challenged by other groups on the grounds that they are inconsistent with the data from JWST, compounding the strong scientific debate surrounding K2-18b.\n\nProf Chris Lintott, presenter of the BBC's The Sky at Night, said he had \"great admiration\" for Prof Madhusudhan's team, but was treating the research with caution.\n\n\"I think we've got to be very careful about claiming that this is 'a moment' on the search to life. We've [had] such moments before,\" he told Today.\n\nHe said the research should be seen instead as \"part of a huge effort to try and understand what's out there in the cosmos\".\n\nProf Madhusudhan acknowledges that there is still a scientific mountain to climb if he is to answer one of the biggest questions in science. But he believes he and his team are on the right track.\n\n\"Decades from now, we may look back at this point in time and recognise it was when the living universe came within reach,\" he said.\n\n\"This could be the tipping point, where suddenly the fundamental question of whether we're alone in the universe is one we're capable of answering.\"\n\nThe research has been published in The Astrophysical Journal Letters.\n\nGet our flagship newsletter with all the headlines you need to start the day.Sign up here.\n\nThe most striking images from the world of science this week: including an anniversary on Mars, a maze of 1.5 million books, and apes with a taste for alcoholic fruit.\n\nThese strange objects could explain how water arrived on Earth, but may also be a previously unrecognised threat to our planet. Now, a spacecraft is headed towards one to investigate.\n\nThe CAA licence allows Skyrora to launch its rocket from the SaxaVord Spaceport in Shetland.\n\nThe company behind the country's first orbital rocket called the launch a 'giant leap' despite crashing after only 14 seconds.\n\nThe first Space Shuttle was originally going to be named Constitution. US President Gerald Ford agreed to rename it Enterprise – here's how Star Trek fans persuaded him.",
        "source_3": "Astronomers have discovered a major sign of life — and “the first hints… of an alien world” on a distant planet orbiting outside the solar system, according to a new report.\n\nThe scientists believe the exoplanet, K2-18b, is a “Hycean planet” — meaning it’s home to an abundance of a life-signifying molecules including one that is only produced on Earth by living organisms such as marine algae, according to a new report.\n\nK2-18b — which is eight times the size of Earth and 124 light-years away — shows signs of the unique molecule dimethyl sulfide, according to a new study published in the Astrophysical Journal on Wednesday.\n\n“This is a revolutionary moment,” Dr. Nikku Madhusudhan, an astronomer at the University of Cambridge and author of the study, said at a news conference Tuesday,according to NPR.\n\n“These are the first hints we are seeing of an alien world that is possibly inhabited,” he claimed.\n\nThe organic compound — composed of sulfur, carbon, and hydrogen — is naturally produced by phytoplankton and sometimes in bacteria in beer, and appears en masse over Earth’s oceans.\n\nMadhusudhan and his team reported taking atmospheric measurements of the dimethyl sulfide on K2-18b back in 2023 — and confirmed the molecule’s overwhelming presence in tests conducted last year with the James Webb Space Telescope.\n\nThose signals from the life-byproduct were so strong that researchers had to work diligently simply to omit their presence while conducting other tests — dimethyl sulfide measured at 1,000 times the levels found on Earth, according to the study.\n\n“It is a shock to the system,” Madhusudhan said at the press event. “We spent an enormous amount of time just trying to get rid of the signal.”\n\nK2-18b was already known to contain water vapor and the newly found presence of dimethyl sulfide indicated to researchers something they first predicted in 2021 — that K2-18b is a “Hycean world.”\n\n“Hycean” is a termcoined by Dr. Madhusudhanin 2021 for a sub-species of exoplanets called “sub-Neptunes,” that have liquid oceans and have hydrogen-rich atmospheres — which they believed at the time applied to K2-18b.\n\nDuring James Webb readings in 2023, Madhusudhan and his team were able to confirm the presence of several molecules predicted by their “Hycean” theory, including hydrogen, methane, and other carbon components — and also made the initial discovery of dimethyl sulfide.\n\nTo get these measurements, scientists use the James Webb Space Telescope to record light from the host star as it is refracted through the planet’s atmosphere as the sub-Neptune passes across the star’s face from Earth’s perspective.\n\nElements within the atmosphere will produce different colors as the planet passes across its native star, indicating to scientists what, if any, atmospheric conditions exist.\n\nDespite the undisputed measurements of the life-sustaining elements, some scientists said more information and confirmation are needed before a consensus around life on K2-18b can be confirmed.\n\n“It’s not nothing,” Johns Hopkins University planetary scientist Stephen Schmidt told the New York Times. “It’s a hint. But we cannot conclude it’s habitable yet.”\n\n“Unless we see E.T. waving at us, it’s not going to be a smoking gun,” Christopher Glein, planetary scientist at Southwest Research Institute in San Antonio, told the outlet.\n\nMans Holmberg, a researcher at the Space Telescope Science Institute, participated in the study and called on astronomers to conduct their own independent analysis of the data, NPR reported.\n\n“For looking at things like this, it requires a dedicated community effort,” Holmberg told the outlet.\n\n“We should be cautious. I want that to be front and center. Any claim of life on another planet requires a lot of justification, and I don’t think we’re there yet,” he added.\n\nIn 2015, K2-18b was first discovered by NASA’s Kepler mission, which determined it was in the “Goldilocks zone” of its home star, meaning temperatures were appropriate for water, which is presumed to be a building block of all life.\n\nK2-18b is about eight times the size of Earth but has a much shorter orbital path, completing a circuit around its host star in time equivalent to 33 days."
    }
}