{
    "question": "What would be the practical consequences for audiences, stations, and journalism if Congress ended federal support for NPR and PBS, and what safeguards or alternative funding models could preserve their public-service roles?",
    "content": {
        "source_1": "The latest Republican effort to defund public media ignores the extraordinary difference a tiny portion of the federal budget makes to communities nationwide.\n\nAnyone can access the link you share with no account required.Learn more.\n\nWith aPress Heraldsubscription, you can gift 5 articles each month.\n\nIt looks like you do not have any active subscriptions. To get one,go to the subscriptions page.\n\nWith aPress Heraldsubscription, you can gift 5 articles each month.\n\nRecently the heads of National Public Radio and the Public Broadcasting Service testified in a politically chargedcongressional subcommittee hearingamid the latest Republican effort to defund U.S. public media.\n\nChaired by Republican firebrand Marjorie Taylor Greene, the hearing (in hyperbolic language that echoed that used in the Joseph McCarthy era) is called “Anti-American Airwaves: Holding the Heads of NPR (National Public Radio) and PBS (Public Broadcasting System) Accountable.” Greene is head of a “delivering on government efficiency” (DOGE) group within the House Oversight Committee.\n\nThis is just the latest version of the perennial attacks the Republican Party has waged against the Corporation for Public Broadcasting (CPB) and public media in general in the hopes of zeroing out funding in Congress. This is nothing new for the conspiracy theory-loving Georgia congresswoman who has charged “NPR and PBS have increasingly become radical left-wing echo chambers,” and with zero evidence has accused NPR of having a “communist agenda.” In this quest she is assisted by the unelected bureaucrat and world’s richest man, the chainsaw-wielding Elon Musk.\n\nA few nuts and bolts: CPB is a private, nonprofit corporation that was authorized by the Congress in the Public Broadcasting Act of 1967. The act was created to provide universal and free access to quality media that was not solely created to sell products. Ninety-nine percent of Americans have access to public media. And, despite the proliferation of outlets offered via cable and via the internet, the need for this service has only increased.\n\nHere’s where the funding goes:  386 radio grantees, representing 1,216 public radio stations and 158 television grantees, representing 365 public TV stations. Overall, 245 of the total 544 radio and TV grantees are considered rural (like Maine). The cost of this modest federal investment is about $1.60 per person each year — less than a cup of coffee.\n\nPublic and community broadcasting (both radio and television) is essential to rural states like Maine, providing a free and vital service like no other.\n\nFirst out of the box is the infrastructure. It is the backbone of the emergency alert system that covers and protects the entire state of Maine. It provides storm and other alerts in regions that have no mobile coverage. It requires no one to have a cell phone plan — one only needs to have an inexpensive radio.\n\nEqually important is the cultural and educational value to the citizens of Maine. For free with no paywall. Public and community stations provide children’s programming, science, arts, drama, public affairs, live concerts, environmental coverage, high school basketball and investigative and even-handed journalism.\n\nAnd, no, streaming and cable do not do it. The quality is not there and high-end affordable internet is not free or even universally available. Maine is extraordinarily fortunate to have vibrant television and radio stations likeMaine PublicandCommunity Radio WERU-FM.\n\nAlas, the local production of television and radio is not free. Although very frugally run, the stations still have all the bills that any small enterprise (even a nonprofit) would have and more due to the broadcasting infrastructure.\n\nIt’s important to note that much of rural Maine, especially the 2nd District, is financially disadvantaged. Loss of CPB funding would force these vital services to make serious decisions on what they are able to provide to the public for those who need them the most.\n\nCPB is such a tiny portion of the federal budget and yet it makes such an important difference across America — from Alaska to Maine, Florida to Texas, Puerto Rico and Native American tribal lands across the country, to Guam.\n\nYou get the picture — everywhere in the nation. It is not, as some have said, a frill or elitist. It is about whether we, the citizens of Maine and the United States, recognize that a well-educated public is important and essential to democracy in America.\n\nWe believe it’s important to offer commenting on certain stories as a benefit to our readers. At its best, our comments sections can be a productive platform for readers to engage with our journalism, offer thoughts on coverage and issues, and drive conversation in a respectful, solutions-based way. It’s a form of open discourse that can be useful to our community, public officials, journalists and others.Read more...\n\nWe do not enable comments on everything — exceptions include most crime stories, and coverage involving personal tragedy or sensitive issues that invite personal attacks instead of thoughtful discussion.\n\nFor those stories that we do enable discussion, our system may hold up comments pending the approval of a moderator for several reasons, including possible violation of our guidelines. As the Maine Trust’s digital team reviews these comments, we ask for patience.\n\nComments are managed by our staff during regular business hours Monday through Friday and limited hours on Saturday and Sunday. Comments held for moderation outside of those hours may take longer to approve.\n\nBy joining the conversation, you are agreeing to ourcommenting policy and terms of use. More information is found on ourFAQs.\n\nPleasesign intoyour Press Herald account to participate in conversations below. If you do not have an account, you canregisterorsubscribe. Questions? Pleasesee our FAQs.",
        "source_2": "The chief executives of NPR and PBSfaced questions in a March 26 congressional hearingas Congress considers legislation that wouldprohibit federal funding for the public broadcasters.\n\nAbout a quarter of U.S. adults (24%) say Congress should remove federal funding from NPR and PBS, according to a Pew Research Center survey conducted March 10-16. A larger share (43%) say NPR and PBS should continue to receive funding from the federal government, while 33% say they are not sure.\n\nThefunding structures for NPR and PBSare complicated, and much of their revenue comes from nongovernment sources like member donations and corporate sponsorships. Butthe proposed billwould ban all federal funding for the Corporation for Public Broadcasting (CPB), which has received $535 million annually inrecent federal budgets. The CPB helps to fund NPR and PBS both directly and through individual local public media stations, many of whichpay NPR and PBSin the form of membership orprogramming fees.\n\nPew Research Center asked these questions to better understand Americans’ views of NPR and PBS as some elected officials call to end federal funding for the country’s two major public broadcasters.\n\nThis adds to our past work analyzing data onaudiences and economics for public broadcastersand survey data onnews consumption and trust of a wide range of news sources. The questions about whether Americans get news from NPR and PBS and trust these outlets are part of a forthcoming study of views toward dozens of media brands across different platforms (e.g., television, print, radio and digital).\n\nFor this analysis, we surveyed 9,482 U.S. adults from March 10 to 16, 2025. Everyone who took part in this survey is a member of the Center’s American Trends Panel (ATP), a group of people recruited through national, random sampling of residential addresses who have agreed to take surveys regularly. This kind of recruitment gives nearly all U.S. adults a chance of selection. Interviews were conducted either online or by telephone with a live interviewer. The survey is weighted to be representative of the U.S. adult population by gender, race, ethnicity, partisan affiliation, education and other factors. Read more about theATP’s methodology.\n\nHere are thequestions used for this analysis, thetoplineand thesurvey methodology.\n\nRepublicans are much more likely than Democrats to support ending federal funding for public media. Among Republicans and GOP-leaning independents, 44% say Congress should end funding for NPR and PBS, while 19% say funding should continue and 37% say they are not sure. Republicans ages 50 and older are especially likely to support ending federal funding for public broadcasters.\n\nBy contrast, just 5% of Democrats and Democratic leaners say federal funding for NPR and PBS should be cut off, while 69% say funding should continue and 26% are not sure.\n\nThere also are large partisan differences in how many people get news from NPR and PBS – and whether they trust these outlets as sources of news.\n\nOverall, 20% of U.S. adults say they regularly get news from NPR, and 21% say the same about PBS. In both cases, Democrats are much more likely than Republicans to say this:\n\nThese questions were asked as part of a forthcoming study of Americans’ views toward dozens of media brands across different platforms (e.g., television, print, radio and digital). These include a wide variety of news sources with audiences across the ideological spectrum.\n\nDemocrats are also more likely than Republicans to trust NPR and PBS as sources of news:\n\nNote: Here are thequestions used for this analysis, thetoplineand thesurvey methodology.\n\nMichael Lipkais an associate director focusing on news and information research at Pew Research Center.\n\nKaterina Eva Matsais a director of news and information research at Pew Research Center.",
        "source_3": "Sign up to have blog posts delivered straight to your inbox!\n\nPresident Donald Trump is not a libertarian, but some of his policies for downsizing the federal government certainly fall in the libertarian column. This is true, for instance, of the administration’s drive to defund the Corporation for Public Broadcasting (CPB), which helps to fund PBS and NPR. Scholars at the Cato Institute have called on Congress for decades to stop subsidizing the CPB. With enough political momentum behind them, perhaps Congress can get it done this time.\n\n“Republicans must defund and totally disassociate themselves from NPR & PBS,” said Trump on Truth Social on April 1. In late March, he told reporters that he “would love to” defund PBS and NPR. “It’s been very biased. The whole group … and it’s a waste of money especially,” he said.\n\nElon Musk, who advises the Department of Government Efficiency (DOGE) on reducing federal waste, tweeted in February, “Defund NPR. It should survive on its own.”\n\nOn March 26, the House Subcommittee on DOGE held a hearing entitled, “Anti-American Airwaves: Holding the heads of NPR and PBS accountable.” The chairman of that subcommittee, Rep. Marjorie Taylor Greene (R‑GA), said,“For far too long, federal taxpayers have been forced to fund biased news. This needs to come to an end, and now.”\n\nIt is long overdue. The CPB was established by Congress in 1967; in 1970, the CPB founded NPR. On its website, the CPB says it “is the steward of thefederal government’s investmentin public broadcasting and the largest single source of funding for public radio, television, and related online and mobile services.” More than 70 percent of the funds the CPB receives are redistributed to 1,500-plus public radio and TV stations nationwide.\n\nThe so-called “investment” by the federal government is roughly $500 million a year—that’s taxpayer money. For FY2025, the CPB was allocated$535 million. Some of that money is distributed to NPR and PBS. For instance, the Corporation for Public Broadcasting provides grants to local radio stations that, in turn, pay to use content created by NPR, such as the news programsAll Things ConsideredandMorning Edition. NPR also receives funding from private donors, corporate sponsors, foundations, and state and local governments.\n\nPBS started in 1970, supplanting National Education Television, which was originally funded by the Ford Foundation. In addition to the CPB funding, PBS gets donations from individuals and foundations, corporate sponsorships, and the leasing of programs to its member stations. Some of those shows includePBS NewsHour,Frontline, andSesame Street.\n\nToday, with cable news and the Internet, there are thousands of media outlets American consumers can access, nationally and globally. There is no reason why the programs on PBS and NPR, many of which are popular—Sesame Street, NewsHour—should not compete in the same marketplace as everyone else. Further, nowhere in the Constitution does it say Congress should fund a national media.\n\n“We wouldn’t want the federal government to publish a national newspaper,” Cato’sDavid Boaztestified before Congress in 2005. “Neither should we have a government television network and a government radio network.” Congress should “terminate the funding for CPB,” he added.\n\nBoaz, author ofThe Libertarian Mindand former Distinguished Senior Fellow at Cato, further testified, “If anything should be kept separate from government and politics, it’s the news and public affairs programming that informs Americans about government and its policies. When government brings us the news—with all the inevitable bias and spin—the government is putting its thumb on the scales of democracy. Journalists should not work for the government. Taxpayers should not be forced to subsidize news and public affairs programming.”\n\nThe Cato Institute has called for defunding the Corporation for Public Broadcasting (and NPR and PBS) since the 1970s. In theCato Handbook for Policymakers,9th Edition, it says that Congress should “eliminate the National Endowment for the Arts; eliminate the National Endowment for the Humanities; and defund the Corporation for Public Broadcasting.” (In a new briefing paper, Cato’sRyan Bournedetails why DOGE and Congress should work to eliminate theNational Endowment for the Arts.)\n\n“In a society that constitutionally limits the powers of government and maximizes individual liberty, there is no justification for the forcible transfer of money from taxpayers to artists, scholars, and broadcasters,” states theHandbook. “… [W]hen government gets into the arts funding business, political conflicts ensue. To avoid political battles over how to spend the taxpayers’ money, to keep art and its power in the realm of persuasion, we would be well advised to establish the separation of art and state.”\n\nOn March 24, House Rep.Ronny Jackson(R‑TX) reintroduced the “No Partisan Radio and Partisan Broadcasting Services Act,” also called the “NPR and PBS Act.” It would eliminate “taxpayer funding for the partisan broadcasting outlets known as National Public Radio and the Public Broadcasting Service.” The legislation currently has 13 co-sponsors.\n\nWay back in 1964,Ronald Reagansaid, “No government ever voluntarily reduces itself in size. Government programs, once launched, never disappear. Actually, a government bureau is the nearest thing to eternal life we’ll ever see on this earth.”\n\nBut perhaps Ronald Reagan was too fatalistic. Maybe PBS and NPR can be eliminated. After all, who thought four months ago that the Department of Education would be largely dismantled, USAID slashed, and thousands of government bureaucrats shown the door?\n\nSign up for the newsletter to receive periodic updates on Cato research, events, and\n          publications."
    }
}