{
    "question": "How might the court’s decision to reduce Karmelo Anthony’s bail to $250,000 and place him under house arrest with monitoring affect perceptions of fairness, public safety, and the handling of the case as it moves toward trial?",
    "content": {
        "source_1": "Updated on:  April 20, 2025 / 4:28 PM CDT/ CBS Texas\n\nIn the wake of thefatal stabbing at a Frisco high school track meet, the CBS News Texas I-Team found a surge of misinformation has swept through social media platforms, causing confusion and fear.\n\nHigh-profile X accounts (formerly Twitter), including @EndWokeness and @LibsofTikTok, quickly amplified the incident just hours after it occurred on April 2, claiming it received \"zero national outrage\" and didn't \"fit the narrative.\" These posts garnered nearly 50 million views.\n\nSoon after, a fake X account posing as theFrisco Police Chief began disseminating fabricated details about the investigation. The next day, a fake autopsy report surfaced on Facebook, falsely claiming drugs were involved. The disinformation continued to spread, with fake Instagram screenshots of guns further fueling anger and uncertainty.\n\nTheCBS News Confirm team, along with law enforcement, confirmed these social media posts to be fabricated.\n\nWhile most misinformation posted online is not a crime, impersonating a police officer is. The Frisco Police Department, along with the FBI, is investigating the fake X account that impersonated the police chief.\n\nTracking down the original creators of misinformation is challenging, as people post anonymously, the content spreads quickly, and original posts can be deleted or edited long before anyone figures out who is behind them.\n\nDr. Daxton \"Chip\" Stewart, a journalism professor at Texas Christian University specializing in social media and free speech, explained that while the spread of disinformation online isn't new, recent changes by Meta—the parent company of Facebook and Instagram—have, in his opinion, exacerbated the problem.\n\nEarlier this year,Meta CEO Mark Zuckerberg announced the end of the use of fact-checkerson their platforms, relying instead on users to flag misinformation through a feature called Community Notes, similar to what Elon Musk's social platform X uses. The official removal of third-party fact-checkers on Meta platforms happened earlier this month.\n\nThe consequences of this disinformation on the fatal Frisco stabbing case have been severe.\n\nBoth the victim and the suspect's families have had their home addresses posted online and have received threats. Extra security was present at the funeral of Austin Metcalf due to online posts.\n\nBrian New has been a member of the CBS 11 News team since 2013. In 2017, he was awarded the Lone Star Emmy for best investigative reporter. This is one of 10 Emmy awards Brian has been honored with during his career.",
        "source_2": "James Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics in Texas, as well as other general news across the United States. James joined Newsweek in July 2022 from LBC, and previously worked for the Daily Express. He is a graduate of Oxford University. Languages: English. Twitter: @JBickertonUK. You can get in touch with James by emailing j.bickerton@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nSome supporters of PresidentDonald Trump's Make America Great Again (MAGA) movement have reacted with fury after Karmelo Anthony, who is accused of murdering fellow high school student Austin Metcalf, was able to bond out after a judge on Monday reduced his bond from $1 million to $250,000.\n\nNewsweekcontacted Anthony's attorney Mike Howard for comment via email on Tuesday outside of regular office hours.\n\nOn April 2 Metcalf, a 17-year-old student at Memorial High School in Frisco, a northern suburb of Dallas, wasstabbed to death during a track eventat the Kuykendall Stadium according to authorities.\n\nAnthony, a 17-year-old Centennial High School student and football player, was arrested andcharged with first degree murder. His legal team insist he acted in self-defense.\n\nThe case has sparked some racial divisions online, with Anthony being Black while Metcalf was white.\n\nOn Monday Judge Angela Tucker reduced Anthony's bond from $1 million to $250,000, which his family were able to pay leading to him being freed from custody.\n\nMore than $420,000 has been raised on crowd funding website GiveSendGo to support \"Karmelo and his family.\"\n\nCharlie Kirk, founder and CEO of Trump supporting campaign groupTurning Point USA, shared an X post from Minister Dominique Alexander, a self-styled \"civil and human rights activist,\" welcoming Anthony's release.\n\nKirk said: \"Karmelo Anthony brutally murdered Austin Metcalf, and the support for him in the black community is growing. Murdering a white kid in cold blood seems acceptable to some.\"\n\nKarmelo Anthony brutally murdered Austin Metcalf, and the support for him in the black community is growing. Murdering a white kid in cold blood seems acceptable to some.https://t.co/PckmdspROH\n\nIn his original post Alexander shared a pictured of Anthony adding: \"Karmelo Anthony is SAFE at home. This moment is a reminder that a community united can never be divided. The journey ahead is long, but today—we celebrate a victory for justice, for family, and for the power of people coming together to protect our youth.\"\n\nCJ Pearson, co-chair of theRepublican Partyyouth advisory council,wrote: \"Karmelo Anthony murdered a young man in cold blood yet somehow, he's walking the streets of Texas a free man? Now imagine if he were white and the victim was black.\n\n\"BLM would be burning down whole cities. This is a DISGRACE. Black or not, I REFUSE to defend this or him.\"\n\nKarmelo Anthony murdered a young man in cold blood yet somehow, he's walking the streets of Texas a free man?Now imagine if he were white and the victim was black.BLM would be burning down whole cities. This is a DISGRACE.Black or not, I REFUSE to defend this or him.pic.twitter.com/hZXaVMQ64B\n\nGunther Eagleman, a Trump supporting X user with 1.3 million followers, wrote: \"Karmelo Anthony should never see the light of day again, but the hacktivist of a judge cut his bail substantially so he gets to enjoy life outside of prison until he works through the court. It's a f***** disgrace.\"\n\nOther commentators spoke out in Anthony's defense with a number comparing him toKyle Rittenhouse, who wasfound not guilty of murderduring a riot in Kenosha County, Wisconsin, in August 2020 after a jury concluded he shot two people dead in self-defense.\n\nBishop Talbert Swan, a pastor and activist with 216,000 X followers, said: \"Y'all said 17 yr old Kyle Rittenhouse was justified in killing two people with an AR 15 because he felt threatened.\n\n\"17 yr old Karmelo Anthony was defending himself when he killed Austin Metcalf with a knife and y'all think he deserves to go to prison. I wonder whyTE.\"\n\nAnother X user commented: \"Kyle Rittenhouse can be 17 with an AR-15, Karmelo Anthony CAN'T be 17 with a knife. Make it make sense.\"\n\nAccording to the arrest report, an altercation began when Metcalf asked Anthony to move from under Memorial's pop-up tent, at which point one witness said Anthony reached into a bag and replied: \"Touch me and see what happens.\"\n\nThe arrest report said Anthony confessed to the police, saying: \"I'm not alleged. I did it.\"\n\nThe report said he later told the police: \"I was protecting myself,\" adding, \"He put his hands on me.\"\n\nSpeaking with theNew York Post, Anthony's father said his son had been \"provoked\" and \"was not the aggressor.\"\n\nSeparately, two fundraisers created to support the Metcalf family had raised $526,000 as of 10 a.m. ET on Tuesday.\n\nThe first, created by Austin Metcalf's father, Jeff, had received over $350,000.\n\n\"I love you forever, son. It's not goodbye, it's see you later,\" Jeff Metcalf wrote. \"God will take care of us till we meet again. RIP. Love, Dad.\"\n\nThe second, launched to honor \"the life of Austin Metcalf,\" had raised more than $176,000. This was created by Kari Ordas, who owns a pizza restaurant where Austin used to work alongside his twin brother Hunter and mother Meghan.\n\n\"Any money raised will be given to Meghan and Hunter to help cover funeral costs, a scholarship in Austin's name and any future legal battles they may endure going forward,\" Ordas wrote.\n\nAccording to Fox News defense attorney Mike Howard told Monday's hearing:\"Given that Karmelo has no prior criminal history… given that this young man has not been in any sort of trouble before, $1 million is not necessary.\n\n\"This family needs to be able to survive. There's been a tremendous amount of pressure. I think at this point, living in a gated community, given everything, the safety of their younger children is very warranted. Security details and criminal defense are not cheap.\"\n\nUnder the terms of his release Anthony has been placed under house arrest, fitted with an ankle monitor and banned from social media. His trial date has yet to be announced.\n\nUpdate 4/15/25, 10:44 a.m. ET: This story has been updated to reference two fundraisers established to support Austin Metcalf's family.\n\nJames Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics in Texas, as well as other general news across the United States. James joined Newsweek in July 2022 from LBC, and previously worked for the Daily Express. He is a graduate of Oxford University. Languages: English. Twitter: @JBickertonUK. You can get in touch with James by emailing j.bickerton@newsweek.com\n\nJames Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics in Texas, as well as other general news across the United States. James joined Newsweek in July 2022 from LBC, and previously worked for the Daily Express. He is a graduate of Oxford University. Languages: English. Twitter: @JBickertonUK. You can get in touch with James by emailing j.bickerton@newsweek.com\n\nJames Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics                                    ...Read more",
        "source_3": "Judge Angela Tucker said that \"they've never had the security issues they've faced with this case.\"\n\nJudge Angela Tucker said that \"they've never had the security issues they've faced with this case.\"\n\nI guess I don't understand what all the fuss is about. About 9% of the population is responsible for over 60% of the homicides in the US. This is standard operating procedure so nobody should be surprised.\n\nWe’re independent and can’t be cancelled. The establishment media is increasingly dedicated to divisive cancel culture, corporate wokeism, and political correctness, all while covering up corruption from the corridors of power. The need for fact-based journalism and thoughtful analysis has never been greater. When you support The Post Millennial, you support freedom of the press at a time when it's under direct attack.Join the ranks of independent, free thinkers by supporting us today for as little as $1.\n\nTo find out what personal data we collect and how we use it, please visit ourPrivacy Policy"
    }
}