{
    "question": "What does the fact that about 60% of Coachella GA tickets were purchased through payment plans suggest about live-event affordability and consumer behavior, and what could it mean for festivals and fans going forward?",
    "content": {
        "source_1": "With prices for live music going through the roof, fans are turning to payment plans as an interest-free way to pay for their festival tickets.\n\nTens of thousands of music fans will descend on the California desert this weekend for the first of two iterations of the Coachella Music and Arts festival outside of Palm Springs, Calif.\n\nApproximately 80,000 to 100,000 fans each weekend will have coughed up the $599 ticket price to see headlinersLady Gaga,Travis Scott,Green DayandPost Malone. But ticket price is often just the cost of entry — many of those fans will spend more than a $1,000 per weekend on lodging and cough up hundreds of dollars more for food, drinks and merchandise. It’s a substantial spend for any of the 20-somethings in Coachella’s target demographic. But festival organizers have increasingly helped finance their purchase through payment plan programs.\n\nApproximately 60 percent of general admission ticket buyers at this year’s festival opted to use Coachella’s payment plan system, which requires as little as $49.99 up front for tickets to the annual concert. The desert festival isn’t alone — Lollapalooza, Electric Daisy Carnival and Rolling Loud all sell the majority of their tickets using some kind of payment plan system.\n\nRepresentatives at Goldenvoice, which puts on Coachella, declined to comment for this story. One source, who asked to remain anonymous because they weren’t authorized to speak to the media, toldBillboardthat payment plans have fundamentally changed how festivals are marketed to the public.\n\n“Festivals are now marketing a cheap down payment as their main call to action,” the source says. “The messaging is $20 down gets you in the door, or $50 down gets you started. It’s no longer about the artists, or the festival lifestyle — the message is, ‘You can afford this if you act today.’”\n\nThe same source told Billboard it’s not uncommon for some fans to have four or five different festival payment plans hitting their accounts at one time. Typically, fans pay as little as $19.99 to get started on a payment plan that’s extended over a period of several months — three months generally for Coachella, since most buying happens after the lineup is announced, which until 2025 took place in early January. This year, fans who signed up before Jan. 25 had their payments split into three payments, with the last payment hitting a user’s account in March.\n\nThe system is different than those of popular fintech payment-plan firms like Klarna, Affirm and Sezzle, which pay out the vendor in full and reimburse themselves by collecting the remaining payments from buyers. These firms make money from merchant and processing fees they collect from vendors and, in some cases, interest payments charged to customers that go beyond the terms of their original payment plan. Because firms like Klarna and Affirm essentially grant buyers credit, and often run credit histories on their users, they are heavily regulated under a number of state and federal financial frameworks.\n\nThe payment systems used by festival promoters are administered by ticketing companies like AXS, Ticketmaster and Frontgate, and are offered as a service in exchange for the festival promoter’s business. These systems are not considered credit providers since there’s no third party fronting the vendor the full price of the transaction. Instead, the vendor is paid out over time, as each payment goes through.\n\nTicket buyers are charged a $41 fee for using Coachella’s payment plan, similar to what other festivals charge fans for the use of payment plans. The fee is equivalent to approximately eight percent of the ticket price, which is still far cheaper than what a fan might pay for financing a ticket on their credit card. The revenue generated from this fee is split between the ticketing company and the promoter.\n\nWhile some have criticized festivals for using fees as a revenue generator, fest organizerBob Sheehanwith the California Roots Festival in Monterey, Calif. tells Billboard that payment plans “are a critical link between fan affordability and generating the revenue needed to finance a modern multiday festival.”\n\nSheehan estimates that 65 percent to 70 percent of his festival attendees use payment plans to pay for their tickets and adds “the entire system is built upon trust — trust that we will deliver the experience we promised and trust that our fans will make their payments on time.”\n\nIf Coachella attendees miss their scheduled payments — typically, the attempt to debit their account is declined for insufficient funds or having an expired credit card — they are given 10 days to bring their account current. If the 10th day passes and the payment is not received, then the order is cancelled and the fan is issued a credit that can be used towards next year’s festival.\n\n“Credit expires 12 months from issuance,” Coachella officials explain on their website. “No exceptions.”\n\nExpired monies and credits — often referred to as “breakage” in business — are governed by state law, though one source says the revenue generated from breakage is miniscule.\n\n“Most defaults happen after the initial deposit is made on the first payment — it’s very rare that a fan will default on tickets after two payments have been made, so the revenue from breakage is very low,” explains one source familiar with how festivals operate their payment plans. “All of the incentives for the promoter are that the fan pay off their ticket in full and attend the event so they can spend money on beer and parking and merchandise.”",
        "source_2": "BILLBOARD- Tens of thousands of music fans will descend on the California desert this weekend for the first of two iterations of the Coachella Music and Arts festival outside of Palm Springs, Calif.\n\nApproximately 80,000 to 100,000 fans each weekend will have coughed up the $599 ticket price to see headliners Lady Gaga, Travis Scott, Green Day and Post Malone. But ticket price is often just the cost of entry — many of those fans will spend more than a $1,000 per weekend on lodging and cough up hundreds of dollars more for food, drinks and merchandise. It’s a substantial spend for any of the 20-somethings in Coachella’s target demographic. But festival organizers have increasingly helped finance their purchase through payment plan programs.\n\nApproximately 60 percent of general admission ticket buyers at this year’s festival opted to use Coachella’s payment plan system, which requires as little as $49.99 up front for tickets to the annual concert. The desert festival isn’t alone — Lollapalooza, Electric Daisy Carnival and Rolling Loud all sell the majority of their tickets using some kind of payment plan system.\n\nRepresentatives at Goldenvoice, which puts on Coachella, declined to comment for this story. One source, who asked to remain anonymous because they weren’t authorized to speak to the media, told Billboard that payment plans have fundamentally changed how festivals are marketed to the public.\n\n“Festivals are now marketing a cheap down payment as their main call to action,” the source says. “The messaging is $20 down gets you in the door, or $50 down gets you started. It’s no longer about the artists, or the festival lifestyle — the message is, ‘You can afford this if you act today.’”\n\nThe same source told Billboard it’s not uncommon for some fans to have four or five different festival payment plans hitting their accounts at one time. Typically, fans pay as little as $19.99 to get started on a payment plan that’s extended over a period of several months — three months generally for Coachella, since most buying happens after the lineup is announced, which until 2025 took place in early January.\n\nTicket buyers are charged a $41 fee for using Coachella’s payment plan, similar to what other festivals charge fans for the use of payment plans.\n\nWhile some have criticized festivals for using fees as a revenue generator, fest organizer Bob Sheehan with the California Roots Festival in Monterey, Calif. tells Billboard that payment plans “are a critical link between fan affordability and generating the revenue needed to finance a modern multiday festival.”\n\nSheehan estimates that 65 percent to 70 percent of his festival attendees use payment plans to pay for their tickets and adds “the entire system is built upon trust — trust that we will deliver the experience we promised and trust that our fans will make their payments on time.”\n\nIf you’re financing your festival tickets, honestly, who cares? You gotta flex that carefully staged Instagram shot in front of the Ferris wheel somehow, right?\n\nNothing screams financial stability like throwing a $49 down payment on a $600 ticket, then praying your direct deposit hits before your third installment bounces.\n\nYou wouldn’t want your Instagram followers knowing the ugly truth right? That your credit score barely qualifies you to rent a scooter, let alone pretend you’re a VIP at Coachella.\n\nThis story right here. We’ve finally reached peak America 2025.\n\nThese festivals, man. Coachella, Rolling Loud, EDC- they were at one time, long ago, in a galaxy far far away about music, sketchy substances, and terrible hygiene.\n\nNow they’re full-blown pyramid schemes designed to vacuum every cent from kids who’ve never had to choose between groceries and Post Malone tickets before.\n\nThey’re literally selling the concept of going broke in installments.\n\nSixty percent of these festival kids are financing their tickets now. Think about that.\n\nThousands of young adults effectively signing up for the “buy now, regret forever” plan, all for the privilege of half-watching Travis Scott through the cracked screen of their iPhone.\n\nFestival organizers have cracked the code to Gen Z’s wallet. You almost have to respect it. And wonder how nobody came up with it sooner.\n\nLow monthly payments for a weekend they’ll be too blackout drunk to remember.\n\nAnd perhaps the best part is that these festivals actually have the gall to slap you with a $41 “convenience fee” for financing. Charging someone extra for the privilege of paying over time? Awesome.\n\nIt’s not convenience, it’s capitalism, baby, pure and simple.\n\nThese promoters even have the audacity to pretend they’re doing you a favor, calling it “trust.”\n\nYou’re trusting a kid who still calls their mom to ask how to do laundry to reliably make payments? Good luck with that.\n\nNothing saystrustlike charging broke college kids 8% extra because they didn’t learn financial responsibility from their parents who probably also finance their vacations to Cabo.\n\nBut not to worry. If you default, Coachella graciously offers you a “credit” towards next year’s festival.\n\nBecause the perfect way to teach someone financial responsibility is to force them to repeat their mistakes.\n\nThe Woodstock generation has got to be throwing up in their mouths.\n\nNo peace, love, and freedom of expression uniting everybody through music.\n\nThis is just corporate vultures picking at the carcasses of broke college kids desperate for social media clout.\n\nYou’re not “sticking it to the man”; you’re paying him in monthly installments for a picture in front of a goddamn Ferris wheel.\n\nThis is actually the total opposite of everything Woodstock (the og music festival) stood for. And the epitome of America right now. Over leveraged, over extended youth, digging themselves deeper into a hole. All so they can stunt, (in flower crowns), and keep up with the joneses. The definition of whistling past the graveyard.\n\nAll while corporate America continues extracting cash from kids who don’t realize their “festival drip” is putting them on a direct path to a 400 credit score.\n\nBut all good bro, enjoy that festival flex and crippling debt until your mid-thirties. At least you’ll always have the photo to remember it by. That’s probably all you’ll ever actually own. (Sidebar- actually no, Zuckerberg technically owns that)\n\nP.s. - the entire music business model is so fucking broken right now",
        "source_3": "Overpriced, inedible concessions at Coachella have outraged critics who are calling out the music festival for being a “money trap” as hundreds of thousands descended on the Southern California desert.\n\nOne influencer claimed she spent over $100 for her meal consisting of tacos and lemonade on the first night of Coachella on Friday, which pop megastar Lady Gaga headlined on the festival’s main stage.\n\nRuth Viveros, who has chronicled her experience in Coachella Valley since Friday, shared a glimpse into the food at the famous music festival.\n\nInher TikTok video, Viveros raved about the lemonade despite the $17 pricetag for the mostly iced beverage.\n\nShe admitted it was her second cup of the citrusy drink, totaling $34 spent that day.\n\nViveros and her friend also ordered tacos — consisting of five tortilla shells filled with steak, onions and salsa — and a plate of nachos.\n\nThe entire spread of two orders of tacos, nachos and two cups of lemonade cost Viveros $102.\n\nViveros was not thrilled with the quality of the nachos.\n\n“They’re not good, not good at all,” she said. “The tortillas are like freezing cold.”\n\nTikTok users shared a similar opinion for the music festival fare calling out the pricing for the food.\n\n“Coachella seems like a miserable money trap that everyone falls for,” another user said.\n\n“It’s literally the worst festival ever. Omg,” a third person wrote.\n\nOther revelers fumed over the pricy concession items after paying a premium to access the festival grounds and parking fees.\n\n“The fact that GENERAL ADMISSION is $600 and you still have to pay that much for mid food is making me irrationally angry,” another comment read.\n\nThe cost to attend Coachella varies by weekend. General admission tickets which allow attendees to access the venue for all three days on opening weekend cost $649 and $599 for its second weekend.\n\nA Reddit user shared the high prices for a variety of alcoholic drinks inside one of the festival’s VIP tents.\n\nThe menu, shared to theCoachella subreddit,displayed a $23 charge for a Red Bull Vodka, $17 for hard liquors including Absolut Vodka, Jameson Irish Whiskey and Malibu Rum.\n\nA White Claw Hard Seltzer would set back a customer $16 while beer was worth $15.\n\nSodas were priced at $7 and as a recent tradition for Coachella, water was being served for $2.\n\nOne user called Coachella food “expensive” as lower priced items are around $15 while “meals” average around $20 to $30.\n\nHigh food prices aren’t the only problem revelers have experienced at Coachella this year.\n\nOn the festival’s first day, thousands were caught in“literal hell” when cars travelingto the area turned into a large parking lot, creating 12 hours of traffic while suffering in near-record heat blazed down on them.\n\n“This is the worst organization I have ever seen at a festival and this is Coachella for god sakes [sic],” one person posted on Reddit.\n\nLast year, afestival-goer went viralafter she spent $64 for cucumber water and two breakfast burritos.\n\n“Capitalism is crazy and I am part of the problem,” TikTok user Jackie Tanti said."
    }
}