{
    "question": "In what ways could the ruling permitting Mahmoud Khalil’s deportation under the INA’s “adverse foreign policy consequences” clause influence future immigration cases involving political speech and campus protests?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nColumbia University graduate student Mahmoud Khalil can be kicked out of the U.S. an immigration judge in Louisiana found Friday during a hearing over the legality of deporting the activist who participated in pro-Palestinian demonstrations.\n\nStudent negotiator Mahmoud Khalil is seen at a pro-Palestinian protest encampment on the Columbia University campus in New York, April 29, 2024. (AP Photo/Ted Shaffrey, File)\n\nClergy hug outside the Central Louisiana ICE Processing Center in Jena, La., after an immigration hearing for Mahmoud Khalil, the Columbia University activist facing deportation for his role in pro-Palestinian campus protests, Friday, April 11, 2025. (AP Photo/Gerald Herbert)\n\nHuman rights attorney Sabrine Mohamed reads a message from Mahmoud Khalil, the Columbia University activist facing deportation for his role in pro-Palestinian campus protests, after his immigration hearing, outside the Central Louisiana Ice Processing Center in Jena, La., Friday, April 11, 2025. (AP Photo/Gerald Herbert)\n\nVisitors walk into the Central Louisiana ICE Processing Center in Jena, La., during an immigration hearing for Mahmoud Khalil, the Columbia University activist facing deportation for his role in pro-Palestinian campus protests, Friday, April 11, 2025. (AP Photo/Gerald Herbert)\n\nA supporter holds a sign outside the Central Louisiana ICE Processing Center in Jena, La., after an immigration hearing for Mahmoud Khalil, the Columbia University activist facing deportation for his role in pro-Palestinian campus protests, Friday, April 11, 2025. (AP Photo/Gerald Herbert)\n\nSecurity personnel stand post outside the Central Louisiana ICE Processing Center in Jena, La., during an immigration hearing for Mahmoud Khalil, the Columbia University activist facing deportation for his role in pro-Palestinian campus protests, Friday, April 11, 2025. (AP Photo/Gerald Herbert)\n\nClergy stand during a news conference of supporters outside the Central Louisiana ICE Processing Center in Jena, La., after an immigration hearing for Mahmoud Khalil, the Columbia University activist facing deportation for his role in pro-Palestinian campus protests, Friday, April 11, 2025. (AP Photo/Gerald Herbert)\n\nSupporters hug outside the Central Louisiana Ice Processing Center in Jena, La., after an immigration hearing for Mahmoud Khalil, the Columbia University activist facing deportation for his role in pro-Palestinian campus protests, Friday, April 11, 2025. (AP Photo/Gerald Herbert)\n\nSecurity personnel stand guard outside the Central Louisiana Ice Processing Center in Jena, La., during an immigration hearing for Mahmoud Khalil, the Columbia University activist facing deportation for his role in pro-Palestinian campus protests, Friday, April 11, 2025. (AP Photo/Gerald Herbert)\n\nA supporter who identified himself as Palestinian is hugged by a fellow supporter after speaking at a news conference outside the Central Louisiana ICE Processing Center in Jena, La., after an immigration hearing for Mahmoud Khalil, the Columbia University activist facing deportation for his role in pro-Palestinian campus protests, Friday, April 11, 2025. (AP Photo/Gerald Herbert)\n\nJENA, La. (AP) — Columbia University graduate studentMahmoud Khalilcan be forced out of the country as a national security risk, an immigration judge in Louisiana ruled Friday after lawyers argued the legality of deporting the activist who participated in pro-Palestinian demonstrations.\n\nThe government’s contention that Khalil’s presence in the U.S. posed “potentially serious foreign policy consequences” satisfied requirements for deportation, Immigration Judge Jamee E. Comans said at a hearing in Jena.\n\nVisitors walk into the Central Louisiana ICE Processing Center in Jena, La., during an immigration hearing for Mahmoud Khalil, the Columbia University activist facing deportation for his role in pro-Palestinian campus protests, Friday, April 11, 2025. (AP Photo/Gerald Herbert)\n\nComans said the government had “established by clear and convincing evidence that he is removable.”\n\nAfter the immigration court hearing, Khalil attorney Marc Van Der Hout told a New Jersey federal judge that Khalil will appeal to the Board of Immigration Appeals within weeks.\n\nAddressing the judge at the end of the immigration hearing, Khalil recalled her saying at ahearing earlier in the weekthat “there’s nothing more important to this court than due process rights and fundamental fairness.”\n\n“Clearly what we witnessed today, neither of these principles were present today or in this whole process,” he added. “This is exactly why the Trump administration has sent me to the court, 1,000 miles away from my family.”\n\nVan Der Hout, also criticized the hearing’s fairness.\n\n▶ Stay up to date with the latest U.S. news by signing up to our WhatsApp channel.\n\n“Today, we saw our worst fears play out: Mahmoud was subject to a charade of due process, a flagrant violation of his right to a fair hearing, and a weaponization of immigration law to suppress dissent,” Van Der Hout said in a statement.\n\nKhalil, a legal U.S. resident, wasdetained by federal immigration agentsMarch 8 in the lobby of his university-owned apartment, the first arrest under President Donald Trump’s promised crackdown on students who joined campus protests against the war in Gaza.\n\nWithin a day, he was flown across the country to an immigration detention center in Jena, far from his attorneys and wife, a U.S. citizen due to give birth soon.\n\nKhalil’s lawyers have challenged the legality of his detention, saying the Trump administration is trying to block free speech protected by the First Amendment.\n\nSecretary of State Marco Rubio has cited a rarely used statute to justify Khalil’s deportation, which gives him power to deport those who pose “potentially serious adverse foreign policy consequences for the United States.”\n\nAt Friday’s hearing, Van Der Hout told the judge that the government’s submissions to the court prove the attempt to deport his client “has nothing to do with foreign policy” and said the government is trying to deport him for protected speech.\n\nKhalil, a Palestinian born and raised in Syria after his grandparents were forcibly removed from their ancestral home in Tiberias, isn’t accused of breaking any laws during the protests at Columbia.\n\nThe government, however, has said noncitizens who participate in such demonstrations should be expelled from the country for expressing views that the administration considers to be antisemitic and “pro-Hamas,” referring to the Palestinian militant group that attacked Israel on Oct. 7, 2023.\n\nKhalil, a 30-year-old international affairs graduate student, had served as a negotiator and spokesperson for student activists at Columbia University who took over a campus lawn last spring to protest Israel’s military campaign in Gaza.\n\nStudent negotiator Mahmoud Khalil is seen at a pro-Palestinian protest encampment on the Columbia University campus in New York, April 29, 2024. (AP Photo/Ted Shaffrey, File)\n\nThe university summoned police to dismantle the encampment after a small group of protesters seized an administration building. Khalil is not accused of participating in the building occupation and wasn’t among those arrested.\n\nBut images of his maskless face at protests and his willingness to share his name with reporters have drawn scorn from those who viewed the protesters and their demands as antisemitic. The White House accused Khalil of “siding with terrorists” but has yet to cite any support for the claim.\n\nFederal judges in New York and New Jersey have ordered the government not to deport Khalil while his case plays out in multiple courts.\n\nThe Trump administration has said it is taking at least $400 million in federal funding away from research programs at Columbia and its medical center to punish it for not adequately fighting what it considers to be antisemitism on campus.\n\nSome Jewish students and faculty complained about being harassed during the demonstrations or ostracized because of their faith or their support of Israel.\n\nImmigration authorities have cracked down on other critics of Israel on college campuses, arresting aGeorgetown University scholarwho had spoken out on social media about the Israel-Gaza war, canceling the student visas of some protesters anddeporting a Brown University professorwho they said had attended the Lebanon funeral of a leader of Hezbollah, another militant group that has fought with Israel.\n\nBrumback reported from Atlanta. Associated Press reporter Larry Neumeister in New York contributed.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "A US judge has ruled the Trump administrationcan deportMahmoud Khalil, a Columbia University graduate detained last month over his role in pro-Palestinian protests.\n\nMr Khalil, a permanent legal US resident, has not been charged with a crime. In a letter written from the facility, he has said his \"arrest was a direct consequence\" of speaking out for Palestinian rights.\n\nThe government has cited a Cold War-era immigration law, declaring that his presence in the US was adverse to American foreign policy interests.\n\nThe immigration court's ruling does not mean Mr Khalil would be immediately removed from the country. The judge gave his lawyers until 23 April to appeal against the order.\n\nThe activist has been held at a Louisiana detention centre since 8 March, when  immigration officers told him he was being deported for taking part in protests against the war in Gaza.\n\nThe 30-year-old was a prominent voice at Columbia University's protests against the war in Gaza last year.\n\nThe Trump administration has cited a 1952 law that empowers the government to order someone deported if their presence in the country could pose unfavourable consequences for American foreign policy.\n\nThe judge said the Trump administration was allowed to move forward with its effort to deport Mr Khalil because the argument that he poses \"adverse foreign policy consequences\" for the US is \"facially reasonable\".\n\nMr Khalil, who was otherwise silent, addressed the court after the ruling.\n\n\"I would like to quote what you said last time that there's nothing that's more important to this court than due process rights and fundamental fairness,\" Mr Khalil said in court.\n\n\"Clearly what we witnessed today, neither of these principles were present today or in this whole process,\" he said. \"This is exactly why the Trump administration has sent me to this court, 1,000 miles away from my family.\"\n\nThe American Civil Liberties Union (ACLU) described the decision as \"pre-written\".\n\nThe rights group said the ruling came less than 48 hours after the US government \"handed over the 'evidence' they have on Mr. Khalil - which included nothing more than a letter from Secretary of State Marco Rubio that made clear Mr Khalil had not committed a crime and was being targeted solely based on his speech\".\n\nThe government, particularly Rubio, has said its efforts to deport Mr Khalil were also to \"protect Jewish students from harassment and violence in the United States\" even if his activities were \"otherwise lawful\".\n\nDepartment of Homeland Security Secretary Kristi Noem praised the judge's ruling on Friday.\n\n\"It is a privilege to be granted a visa or green card to live and study in the United States of America,\" she wrote on social media. \"When you advocate for violence, glorify and support terrorists that relish the killing of Americans, and harass Jews,  that privilege should be revoked, and you should not be in this country. Good riddance.\"\n\nMr Khalil's legal team has repeatedly said evidence of antisemitism has not been presented.\n\nHis lawyer, Marc Van Der Hout, condemned the decision and said his team was going to fight for Mr Khalil's \"right to speak out against what's happening in the US\".\n\nThe legal team also said they expected further hearings in the case.\n\n\"I actually had a long conversation with him after the hearing,\" Johnny Sinodis, another member of Mr Khalil's legal team, told the BBC later on Friday. \"He's feeling confident. He's feeling supported.\"\n\n\"Mahmoud is not against the United States, he is not antisemitic,\" he said. \"He has done nothing wrong.\"\n\nMr Khalil has also filed a federal court lawsuit in New Jersey challenging his arrest as unconstitutional. His lawyers have said the outcome of that case could block his deportation if they win.\n\nThe Trump administration has separately alleged that the student committed immigration fraud by failing to disclose certain information on his green card application.\n\nThis includes working for the British embassy in Beirut and the United Nations agency for Palestinian migrants and refugees. But the government has not submitted any new evidence related to this.\n\nIn a statement, White House Assistant Press Secretary Taylor Rogers said the Trump administration is \"committed to the enforcement of our immigration laws and will take swift action to remove aliens who pose serious adverse foreign policy consequences for the United States\".\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "A U.S. immigration judge in Louisiana ruled Friday that theTrumpadministration can move forward withdeportationproceedings againstMahmoud Khalil.\n\nThe Columbia University graduate student and pro-Palestinian activist’s case has become a flashpoint in the national debate over student protests and immigration policy. Judge James Comans at the LaSalle Immigration Court ruled that Khalil is removable under U.S. immigration law, finding the government had “established by clear and convincing evidence that he is removable.”\n\nComans cited arecent letterfrom Secretary of StateMarco Rubiothat deemed Khalil’s presence in the United States a threat to foreign policy. The judge said theDepartment of Homeland Securitymet its burden of proof.\n\nKhalil, 30, was arrested on March 8 at his Columbia University apartment and transferred to a detention facility in rural Louisiana, where he remains in custody. His attorneys have until April 23 to apply for relief from deportation.\n\nKhalil was born in a Palestinian refugee camp in Syria and holds Algerian citizenship. He became a U.S. lawful permanent resident last year and is married to a U.S. citizen.\n\nDespite not being charged with any crimes, the Trump administration has targeted Khalil for removal based on a provision of the Immigration and Nationality Act that allows for deportation if an immigrant is deemed a foreign policy threat.\n\nRubio’s letter to the immigration court accused Khalil of playing a role in “antisemitic protests and disruptive activities” on campus, which the administration argues create a hostile environment for Jewish students.\n\nWhile the letter acknowledged Khalil had not broken any laws, it asserted that lawful speech and associations can still warrant removal if they endanger U.S. interests abroad.\n\nDuring the immigration court proceeding, Khalil stood up to offer a brief rebuke of the judge’s decision, noting that she said at a hearing earlier in the week, “There’s nothing more important to this court than due process rights and fundamental fairness.”\n\n“Clearly what we witnessed today, neither of these principles were present today or in this whole process,” he said, adding, “This is exactly why the Trump administration sent me to this court 1,000 miles away from my family.”\n\nKhalil has also filed a federal lawsuit in New Jersey challenging his arrest and transfer to Louisiana, which his attorneys say was designed to isolate him from his legal team and family in New York.\n\nThe defendant’s attorney Marc Van Der Hout told a federal judge in New Jersey that Khalil will appeal to the Board of Immigration Appeals after the immigration judge issues her final written ruling.\n\n“So nothing is going to happen quickly in the immigration proceeding even though she’s found him removable on the foreign policy grounds,” the lawyer said, noting he can also pursue an asylum case on Khalil’s behalf.\n\nThe White House celebrated the news in a post on X later in the afternoon, posting animageof an article about the judge’s decision.\n\nMAHMOUD KHALIL’S LAWYERS SEEK RUBIO TESTIMONY TO EXPAND ON DHS EVIDENCE\n\nFriday’s hearing was held before an immigration judge appointed by the Justice Department, separate from the government’s federal judicial branch.\n\nKhalil’s case is being closely watched as a test of how far the Trump administration is willing to go in using immigration law to police foreign students’ political activity, especially those involved in campus protests over the U.S.’s role in the Israel-Hamas conflict."
    }
}