{
    "question": "How might the multistate lawsuit over the USDA’s SNAP data-sharing directive shape how courts balance fraud prevention goals with privacy protections and limits on using benefit data for immigration enforcement?",
    "content": {
        "source_1": "New York Attorney General Letitia James is leading a coalition of officials from across the country to beat back what it says is the targeting of the Supplemental Nutrition Assistance Program.\n\nMembers of the coalition say it's the latest attempt by the Trump administration to weaponize federal aid to attack undocumented immigrants.\n\nJames, along with the attorneys general from California and Michigan, have filed a lawsuit on behalf of officials in 22 states. New Jersey joined on behalf of its more than  824,000 SNAP recipients.\n\n\"This administration is attempting to use this program as a tool in their cruel and chaotic targeting of immigrants. It is outrageous. It is unacceptable,\" James said.\n\nThe suit, which was filed in the Northern District of California, challenges what officials say is a new requirement that low-income families turn over a raft of personal information, including immigration status for the past five years, in order to get benefits.\n\nJames says it's illegal and is being, \"illegally used to hunt down immigrants and their families.\"\n\nThe coalition is seeking a court judgment to declare the policy illegal and prevent its enforcement.\n\nMore than 40 million people nationwide rely on SNAP benefits including 2.9 million in New York. Of those, 1.8 million are in New York City. They received $7.35 billion in assistance last year, with benefits ranging from $292 per month for one person up to $1,756 for a household of eight.\n\nUnder the program, immigrants who are citizens can receive SNAP benefits and non citizens can apply for SNAP benefits for their children who are born here and have birthright citizenship.\n\nImmigrants rights experts say it's another attempt at expanded surveillance.\n\n\"They're trying to utilize every single federal data base to further their mass family separation and mass deportation agenda -- those who are here lawfully, as well as those who have fallen out of state, to target them for enforcement,\" said Murad Awawdeh, president and CEO of the New York Immigration Coalition.\n\nAsked about the suit, a spokesperson for the Department of Justice issued a terse, \"No comment.\"\n\nMarcia Kramer joined CBS News New York in 1990 as an investigative and political reporter. Prior to CBS2, she was the City Hall bureau chief at the New York Daily News.",
        "source_2": "Aliss Higham is a Newsweek reporter based in Glasgow, Scotland. Her focus is reporting on Social Security, other government benefits and personal finance. She has previously extensively covered U.S. and European politics, Russia's invasion of Ukraine and the British Royal Family. Aliss joined Newsweek full time in January 2024 after a year of freelance reporting and has previously worked at digital Reach titles The Express and The Mirror. She is a graduate in English and Creative Writing from Goldsmiths, University of London. You can get in touch with Aliss by emailinga.higham@newsweek.com. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nA coalition of 20 state attorneys general filed a lawsuit on Monday against the Trump administration, seeking to block a data request that would require states to turn over private information about millions of low-income Americans receiving food assistance.\n\nUnder a directive issued by the U.S. Department of Agriculture (USDA), states have been ordered to share private recipient and applicant information relating to Supplemental Nutrition Assistance Program (SNAP) beneficiaries with the federal government. Attorneys general across 19 states and Washington, D.C., have said they will not comply with the USDA's request, citing concerns over its legality and SNAP recipients' privacy.\n\nThe USDA toldNewsweekin an emailed statement that it will \"not comment on pending litigation.\"\n\nThe USDA, which oversees SNAP, first announced this data push in May as part of PresidentDonald Trump's executive order to increase data sharing across federal and state programs.\n\nThe USDA issued the directive last week, giving states a deadline of July 30 to comply. The requested data includes information such as names, dates of birth, personal addresses and Social Security numbers—data that state officials argue is protected under existing privacy laws.\n\nAccording to the USDA, the goal of the data collection is to help root outfraud in the program, which currently serves some 42 million people nationwide.\n\nStates attorneys general involved in the legal challenge—including New York's Letitia James and California's Rob Bonta—say the request violates federal privacy laws and the U.S. Constitution. They also cite concerns that the information could be used tofacilitate immigration enforcement.\n\nThe USDA directive does not mention immigration enforcement as a reason for data collection.\n\nThe lawsuit asks the court to issue an injunction blocking the transfer of SNAP recipient data. It also seeks a ruling that prohibits the administration from sharing the requested information with the Department of Government Efficiency or theDepartment of Homeland Securityfor any purpose beyond administering the SNAP program.\n\nThe legal action comes amid broader efforts by the Trump administration to access private data from various federal and state programs. Agencies such as the Internal Revenue Service and the Centers for Medicare and Medicaid Services have been directed to share personal information with immigration authorities in recent months.\n\nPrior to the directive issued last week, the USDA said it would pause data collection after its original request on May 6 was met with amotion for a temporary restraining orderfiled by a group of nonprofits and SNAP beneficiaries. The group argued that the demand violated the Paperwork Reduction Act, the Privacy Act and other statutes.\n\nAt the time, a USDA spokesperson toldNewsweek, \"We do not comment on pending litigation.\"\n\nThe attorneys general of the following states and the District of Columbia have signed on to the lawsuit:\n\nThe office of Kentucky GovernorAndy Beshearis also a plaintiff in the case.\n\nNew York Attorney General Letitia James said in a Monday news conference regarding the lawsuit: \"We will not allow this lifesaving program to be illegally used to hunt down immigrants and their families.\"\n\nCalifornia Attorney General Rob Bonta said: \"It's a bait-and-switch of the worst kind. SNAP recipients provided this information to get help feeding their families, not to be entered into a government surveillance database or be used as targets in the president's inhumane immigration agenda.\"\n\nAgriculture Secretary Brooke Rollins said in a May 6 news release announcing the data-sharing plans: \"President Trump is rightfully requiring the federal government to have access to all programs it funds, and SNAP is no exception. For years, this program has been on autopilot, with no USDA insight into real-time data. The Department is focused on appropriate and lawful participation in SNAP, and today's request is one of many steps to ensure SNAP is preserved for only those eligible.\"\n\nThe USDA has not publicly responded to the lawsuit.\n\nUpdate 7/29/25, 9:20 a.m. ET: This article was updated with comment from the USDA.\n\nAliss Higham is a Newsweek reporter based in Glasgow, Scotland. Her focus is reporting on Social Security, other government benefits and personal finance. She has previously extensively covered U.S. and European politics, Russia's invasion of Ukraine and the British Royal Family. Aliss joined Newsweek full time in January 2024 after a year of freelance reporting and has previously worked at digital Reach titles The Express and The Mirror. She is a graduate in English and Creative Writing from Goldsmiths, University of London. You can get in touch with Aliss by emailinga.higham@newsweek.com. Languages: English.\n\nAliss Higham is a Newsweek reporter based in Glasgow, Scotland. Her focus is reporting on Social Security, other government benefits and personal finance. She has previously extensively covered U.S. and European politics, Russia's invasion of Ukraine and the British Royal Family. Aliss joined Newsweek full time in January 2024 after a year of freelance reporting and has previously worked at digital Reach titles The Express and The Mirror. She is a graduate in English and Creative Writing from Goldsmiths, University of London. You can get in touch with Aliss by emailinga.higham@newsweek.com. Languages: English.\n\nAliss Higham is a Newsweek reporter based in Glasgow, Scotland. Her focus is reporting on Social Security, other government benefits                                    ...Read more",
        "source_3": "Kentucky Senate candidate Daniel Cameron joins 'Fox & Friends First' to discuss his reaction to the looming lawsuit after the Trump admin. accused her of mortgage fraud and challenges associated with the Real ID requirement.\n\nNew York Attorney GeneralLetitia Jameson Monday said she is helping lead a group of 20 Democratic attorneys general in suing the Trump administration over its demands that they turn over information about food stamp recipients and applicants in their state—an effort she excoriated as a \"dangerous and illegal overreach\" by the administration to unlawfully locate and track down illegal immigrants.\n\nThe lawsuit, led by James, California Attorney General Rob Bonta, and Michigan Attorney General Dana Nessel, comes after the Trump administration demanded states turn over detailed personal information related to recipients and applicants of the Supplemental Nutrition Assistance Program, or SNAP, before July 30.\n\nThe Trump administration has threatened to withhold SNAP funding from states who fail to comply with the July 30 deadline—teeing up a high-stakes, eleventh-hour court clash between Trump officials and leaders from 20 Democratic-led states.\n\nSpeaking to reporters on a press call Monday, James and other attorneys general took umbrage with the new SNAP data-sharing requirement, describing it as an \"illegal data grab\" designed to intimidate vulnerable communities and help track down migrants who might be subject to deportation.\n\n\"This administration is attempting to use this program as a tool in their cruel and chaotic targeting of immigrants,\" James said.\n\nTRUMP FOE LETITIA JAMES LEADING CHARGE ON NEW MULTISTATE LAWSUIT OVER HHS CUTS\n\nNew York Attorney General Letitia James speaks during a press conference, Sept. 21, 2022, in New York.(AP Photo/Brittainy Newman, File)\n\nThe lawsuit is not the first time James, a longtime Trump foe, has sparred with Trump in court since the start of his second presidential term.\n\nTo date, she's joined Democratic attorneys general in more than a dozen other lawsuits challenging his early actions.\n\nBonta, for his part, described the USDA's new demands as a cruel bait-and-switch from the Trump administration.\n\nHe noted that the data the administration is allegedly attempting to mine comes from a decades-old aid program designed to help ensure that low-income families have access to food.\n\n\"SNAP recipients provided this information to get help to feed their families—not to be entered into a government surveillance database, or be used as targets for the president's inhumane immigration agenda,\" Bonta said on Tuesday.\n\n\"This kind of targeting doesn't make America safer. It threatens kids' access to school meals, it jeopardizes wildfire survivors' access to relief,\" he added.\n\n\"And it sends a chilling message: if you reach out for help, you may be punished for it.\"\n\n100 DAYS OF INJUNCTIONS, TRIALS AND 'TEFLON DON': TRUMP SECOND TERM MEETS ITS BIGGEST TESTS IN COURT\n\nCalifornia Attorney General Rob Bonta speaks during a news conference at Gemperle Orchard on April 16, 2025, in Ceres, California.(Justin Sullivan/Getty Images)\n\nThe trio also rejected the assertion that USDA's request for the additional SNAP data, first announced in March, was made under the guise of helping eliminate \"waste and fraud\" within the federal government—noting that the SNAP program historically has \"very low rates of fraud.\"\n\nRather, the Democratic attorneys general described the demand for information as a \"flat-out illegal\" attempt by the Trump administration to unlawfully obtain personal information about immigrants living in their states.\n\nThey noted that, in addition to threatening to withhold SNAP funds, Trump officials have expanded the amount of data that states are required to submit about the individuals in the program.\n\nThe new USDA demands,released last week, require states to provide a list of individuals who have applied or are currently receiving SNAP benefits, in addition to other information such as a list of their immigration statuses in the U.S., and information including their marital statuses, their residential and mailing addresses, and education and employment history, among other things.\n\nEach of the attorneys general said Monday that the program would require them to share the personal information of millions of residents in their states, dating back to 2020, and bypassing federal laws that dictate how such information can be used.\n\n\"This is not for research,\" James said. \"They are basically trying to weaponize the SNAP program against immigrant communities, in violation of the law.\"\n\nCalifornia Attorney General Rob Bonta, for his part, described the push by the administration as an attempt to \"hunt down\" and obtain personal information for millions of residents in their states.\n\n\"They're bypassing legal procedures, ignoring privacy protections, and demanding data that federal law explicitly says can only be used for administering the SNAP program,\" Bonta said, noting that they \"ignored hundreds of public comments pointing out major flaws in the government's plans.\"\n\nFEDERAL JUDGES IN NEW YORK AND TEXAS BLOCK TRUMP DEPORTATIONS AFTER SCOTUS RULING\n\nTrump's USDA is moving to ensure that illegal immigrants do not receive food stamps.(AP/Getty)\n\nThe lawsuit comes as James and other Democratic-led states have taken aim atTrump's sweeping policy goalsand executive orders in court, which they describe as excessive and unconstitutional.\n\nSince his inauguration in January, Bonta noted, Democrat-led states have filed 35 lawsuits against the Trump administration.\n\nBonta said Monday that the USDA requirement is a \"clear violation\" of the \"Spending Clause, federal privacy statutes, and the USDA's own authority,\" prompting them to file suit.\n\n\"President Trump made promises to the American people and now he's breaking them,\" the group said Monday.\n\n\"He's rewriting the rules, targeting the most vulnerable and expecting states to fall in line.\"\n\nBreanne Deppisch is a national politics reporter for Fox News Digital covering the Trump administration, with a focus on the Justice Department, FBI, and other national news.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}