{
    "question": "What economic and geopolitical consequences might follow from China raising tariffs on U.S. goods to 125% in response to the U.S. imposing 145% tariffs on Chinese goods?",
    "content": {
        "source_1": "BEIJING/WARSAW/WASHINGTON, April 11 (Reuters) - Beijing on Friday increased its tariffs on U.S. imports to 125%, hitting back againstU.S. President Donald Trump's decision to hike duties on Chinese goodsto 145% and raising the stakes in a trade war that threatens to up-end global supply chains.\n\nMeanwhile, the turmoil unleashed by Trump's tariffs showed few signs of easing on Friday, with markets tumbling and foreign leaders puzzling how to respond to the biggest disruption to the world trade order in decades.\n\nA brief reprieve for battered stocks seen after Trump decided to pause duties for dozens of countries for 90 days quickly dissipated, as attention returned to his escalating trade war with China that has fuelled global recession fears.\n\nGlobal stocks fell, the dollar slid and a sell-off in U.S. government bonds picked up pace on Friday, reigniting fears of fragility in the world's biggest bond market. Gold, a safe haven for investors in times of crisis, scaled a record high.\n\n\"Recession risk is much, much higher now than it was a couple weeks ago,\" said Adam Hetts, global head of multi-asset at Janus Henderson.\n\nU.S. Treasury Secretary Scott Bessent tried to assuage sceptics by telling a cabinet meeting on Thursday that more than 75 countries wanted to start trade negotiations. Trump himself expressed hope of a deal with China, the world's No.2 economy.\n\nMore:Trump 'would love' deal with China, but tariffs at 145% as markets sink\n\nBut the uncertainty in the meantime extended some of the most volatile trading since the early days of the COVID-19 pandemic.\n\nAsian indices mostly followed Wall Street lower on Friday. In Europe, China's latest tariff hike sent stocks lower, leaving the STOXX 600 .STOXX down more than 1% on the day and set for another drop this week, one of its most volatile on record.\n\nBessent shrugged off the renewed market turmoil on Thursday and said striking deals with other countries would bring certainty.\n\nThe U.S. and Vietnam have agreed to begin formal trade talks, the White House said. The Southeast Asian manufacturing hub is prepared to crack down on Chinese goods being shipped to the United States via its territory in the hope of avoiding tariffs, Reuters exclusively reported.\n\nJapanese Prime Minister Shigeru Ishiba, meanwhile, has set up a trade task force that hopes to visit Washington next week.\n\nAs Trump suddenly paused his 'reciprocal' tariffs on other countries hours after they came into effect earlier this week, he ratcheted up duties on Chinese imports as punishment for Beijing's initial move to retaliate.\n\nHe has now imposed new tariffs on Chinese goods of 145% since taking office, a White House official said.\n\n\"The U.S. imposition of abnormally high tariffs on China seriously violates international and economic trade rules, basic economic laws and common sense and is completely unilateral bullying and coercion,\" China's finance ministry said in a statement.\n\nTrump told reporters at the White House on Thursday that he thought the United States could make a deal with China and said he respected Chinese President Xi Jinping.\n\nMore:What's next for Trump's tariffs? Where the trade war goes from here after sudden retreat.\n\n\"In a true sense he's been a friend of mine for a long period of time, and I think that we'll end up working out something that's very good for both countries,\" he said.\n\nXi, in his first public remarks on Trump's tariffs, told Spanish Prime Minister Pedro Sanchez during a meeting in Beijing on Friday that China and the European Union should \"jointly oppose unilateral acts of bullying,\" China's state news agency Xinhua reported.\n\n\"There are no winners in a trade war,\" the Chinese leader told his guest, adding that by acting together, the world's second-largest economy and the 27-strong European trade bloc could help uphold \"the global rules-based order.\"\n\nEuropean authorities estimate the impact of the U.S. tariffs on the region's economy would total 0.5% to 1.0% of GDP. Given the EU economy as a whole is forecast to grow 0.9% this year, according to the European Central Bank, the U.S. tariffs could tip the EU into recession.\n\nThe euro has surged 1.7% to $1.13855, a level last seen in February 2022.\n\nTrump's decision for a 90-day suspension on tariffs gave room for only a \"fragile pause,\" French President Emmanuel Macron said, partly because tariffs on steel, aluminium and cars remained, as well as across-the-board 10% duties.\n\nFragile, also, \"because this 90-day pause means 90 days of uncertainty for all our businesses, on both sides of the Atlantic and beyond,\" Macron said on X.\n\n(Reporting by Reuters newsrooms; Writing by John Geddie and Ingrid Melander; Editing by Lincoln Feast and Toby Chopra)",
        "source_2": "China fires back — for what it says is the last time — by lifting U.S. tariffs to 125%\n\nChina on Friday fired back for what it said was the final time.\n\nChina’s finance ministry raised its tariffs on the U.S., to 125%, from 84%, as the tit-for-tat continues. The China tariffs are effective on April 12.\n\nSteven Goldstein is based in London and responsible for MarketWatch's coverage of financial markets in Europe, with a particular focus on global macro and commodities. Previously, he was Washington bureau chief, directing MarketWatch's economic, political and regulatory coverage. Follow Steve on Twitter: @MKTWgoldstein.\n\nCopyright ©2025MarketWatch, Inc. All rights reserved.",
        "source_3": "Chinaincreased its tariff on U.S. goods to 125% on Friday in a retaliatory measure against PresidentDonald Trump’s 145% tariffs against China.\n\nChina’s latest levy goes into effect on April 12. It comesafter the Asian country raisedtariffs on U.S. exports to 84% on Wednesday in response to Trump slapping Beijing with a 104% tariff that same day. With China being the third-largest export market in 2023 for the United States, the tariff willaffectroughly $145 billion worth of American exports, particularly agricultural products such as oilseeds and grains, as well as oil and gas.\n\nA statement from the Chinese Ministry of Finance suggested the 125% levy could be the last time China hikes tariffs on the U.S.\n\n“Given that American goods are no longer marketable in China under the current tariff rates, if the U.S. further raises tariffs on Chinese exports, China will disregard such measures,” the finance ministry said in a statement.\n\n“The U.S. alternately raising abnormally high tariffs on China has become a numbers game, which has no practical economic significance, and will become a joke in the history of the world economy. However, if the U.S. insists on continuing to substantially infringe on China’s interests, China will resolutely counter and fight to the end,” the statement continued.\n\nDuring an interview Wednesday morning on Fox Business Network, Treasury Secretary Scott Bessent argued theescalation was a “loser” for Beijingand said, “It’s unfortunate that the Chinese actually don’t want to come and negotiate because they are the worst offenders in the international trading system.”\n\nTRUMP PAUSES TARIFFS FOR 90 DAYS ON DOZENS OF COUNTRIES, RAISES RATE ON CHINA TO 125%\n\n“They have the most imbalanced economy in the history of the modern world,” he continued. “And I can tell you that this escalation is a loser for them, that they have some very smart — the economists, the academicians, technocrats within their bureaucracy — and they would be telling the leadership that we do not have the edge here. They are the surplus country, and their exports to the U.S. are five times our exports to China, so they can raise their tariffs, but so what?”\n\nThe escalating trade war is already having a real impact, with Tesla pausing orders for imported models in China and removing the option for Chinese buyers to order cars on its website Friday morning. Certain models will remain available in China if there is inventory."
    }
}