{
    "question": "How might the Supreme Court’s unanimous order to facilitate Kilmar Abrego Garcia’s return—while emphasizing deference to the executive in foreign affairs—shape future judicial remedies and executive accountability in wrongful deportation cases?",
    "content": {
        "source_1": "Trump administration admitted sending him to notorious prison was ‘administrative error’\n\nI would like to be emailed about offers, events and updates from The Independent. Read ourPrivacy notice\n\nTheSupreme Courthas ruledDonald Trump’s administration must “facilitate” the return of awrongfully deported Maryland father Kilmar Abrego Garcia imprisoned in a brutal El Salvador jail.\n\nWith no noted dissents, Thursday’s unsigned order from the nation’s high court states that the administration “should be prepared to share what it can concerning the steps it has taken and the prospect of further steps.”\n\nA lower courtjudge who ordered Abrego Garcia’s returnto the United States must now “clarify” the ruling, “with due regard to the deference owed to the executive branch in the conduct of foreign affairs,” the justices noted.\n\nThat order “properly requires the Government to ‘facilitate’ Abrego Garcia’s release from custody inEl Salvador,and to ensure that his case is handled as it would have been had he not been improperly sent to El Salvador,” according to the court’s decision. “The intended scope of the term ‘effectuate’ in the District Court’s order is, however, unclear, and may exceed the District Court’s authority.”\n\nA separate statement from the court’s three liberal justices said “the proper remedy is to provide Abrego Garcia with all the process to which he would have been entitled had he not been unlawfully removed toEl Salvador.”\n\nDepartment of Homeland Security spokesperson Tricia McLaughlin said the decision “agreed with us that the District Court improperly interfered with the President’s foreign affairs power” and was “overbearing.”\n\n“We look forward to continuing to advance our position in this case,” she toldThe Independentin a text message.\n\nImmigration and Customs Enforcementagents deported Abrego Garcia last month despite a court order that blocked his removal from the country. Administration officials conceded he was sent toEl Salvadordue to an “administrative error” but insisted it was impossible to bring him back.\n\nIn a 22-page ruling on April 6,MarylandDistrict Judge Paula Xinis ripped the Trump administration for its “wholly lawless” and “grievous error” that “shocks the conscience.”\n\n“As defendants acknowledge, they had no legal authority to arrest him, no justification to detain him, and no grounds to send him to El Salvador — let alone deliver him into one of the most dangerous prisons in the Western Hemisphere,” Judge Xinis wrote.\n\nTrump appealed to the nation’s highest court hours before the judge’s midnight deadline to return Abrego Garcia to the United States. Chief JusticeJohn Robertsthen issueda single-page orderthat paused the lower court’s order as the justices considered the case.\n\nIn their response to Trump’s appeal, lawyers for Abrego Garcia said he “sits in a foreign prisonsolelyat the behest of the United States, as the product of a Kafka-esque mistake.”\n\nThe president “may not seize individuals from the streets, deposit them in foreign prisons in violation of court orders, and then invoke the separation of powers to insulate its unlawful actions from judicial scrutiny,” they wrote.\n\nThe administration sent Abrego Garcia to El Salvador’s mega prison — which human rights groups have derided as a“tropical gulag”— on March 15. He joined dozens of mostly Venezuelan immigrants on removal flights after the presidentsecretly invoked the wartime Alien Enemies Act to summarily deport alleged Tren de Aragua gang members.\n\nOne of those planes allegedly carried immigrants with court orders for their removal, not under the president’s wartime authority. Abrego Garcia was on that plane — something administration officials have called an “oversight” — even though there were no orders for his removal from the country.\n\nIn 2019, a judge blocked Abrego Garcia’s removal from the U.S. after his credible testimony that he fears violence and death in El Salvador, from which he fled as a teenager in 2011.\n\nUnder that American court order, Abrego Garcia is allowed to live and work in the United States, but must attend regular check-ins withImmigration and Customs Enforcement. His most recent appearance was in January, according to court documents.\n\nAbrego Garcia has no criminal record in either the United States or El Salvador, according to his attorney. He has been living inMarylandwith his wife and 5-year-old child — both U.S. citizens — and helping raise two children from a previous relationship.\n\nAfter he was granted humanitarian protections, Abrego Garcia found work as a sheet-metal worker and enrolled in a five-year licensing program with the University of Maryland as he helped his three children, including his young son, who was diagnosed with autism.\n\nDespite admitting the “error,” government lawyers have fought to keep him imprisoned.\n\nFollowing news of the government’s admitted error in court filings, Vice President JD Vance falsely labeled Abrego Garcia a “convicted gang member.” White House Press Secretary Karoline Leavitt admitted there was a “clerical error” in his case, but claimed,without providing evidence, that Garcia was a “leader” of theMS-13gang, and “involved in human trafficking.”\n\nIn a brief to the Supreme Court on April 8, the Trump administration argued that courts cannot direct the president’s “foreign policy” decision-making when it comes to removing Abrego Garcia out of a Salvadoran prison.\n\nGovernment attorneys once again accused Abrego Garcia of being a member ofMS-13, and “the United States has a compelling interest in not having a member of a foreign terrorist organization on U.S. soil, and the public interest strongly favors the exclusion of foreign terrorists from the United States,” they wrote.\n\nJudge Xinis has noted that “the ‘evidence’ against Abrego Garcia consisted of nothing more than his Chicago Bulls hat and hoodie” as well as “a vague, uncorroborated allegation from a confidential informant claiming he belonged to MS-13’s ‘Western’ clique in New York — a place he has never lived.”\n\nAndrew Feinberg contributed reporting from Washington, D.C.\n\nJoin thought-provoking conversations, follow other Independent readers and see their replies",
        "source_2": "The US Supreme Court has ruled unanimously that the Trump administration must try to release a Maryland man who was mistakenly deported to a mega-jail in El Salvador.\n\nIn a 9-0 ruling, the justices declined to block a lower court's order to \"facilitate\" bringing back Kilmar Ábrego García, but they also said Judge Paula Xinis may have exceeded her authority.\n\nOn Friday Judge Xinis directed the Trump administration to provide her with daily updates on what steps they are taking to bring Mr Ábrego García back to the US.\n\nThe government has conceded Mr Ábrego García was deported due to an \"administrative error\", though it also alleges he is a member of the MS-13 gang, which his lawyer denies.\n\nMr Ábrego García, a Salvadorean, is one of dozens of alleged gang member migrants placed by the US on military planes last month and flown to El Salvador's notorious Cecot (Terrorism Confinement Centre) under an arrangement between the two countries.\n\nFollowing the Supreme Court's order, lawyers for the Trump administration went in front of Judge Xinis of the Maryland district court on Friday to explain how they will release Mr Ábrego García.\n\nThe judge had asked the government to explain by that morning how they planned to bring Mr Ábrego García back, but justice department attorneys filed a motion asking for the deadline to be extended until Tuesday evening.\n\nIn a two-page filing, government lawyers called her deadlines \"impracticable\".\n\nDuring an at-times tense hearing that lasted about half an hour, Judge Xinis repeatedly pressed the justice department for specifics on Mr Ábrego García's whereabouts.\n\n\"I'm not asking for state secrets,\" she said. \"I'm asking a very simple question: where is he?\"\n\nJudge Xinis ultimately ruled that the government must provide her with daily updates on Mr Ábrego García's location and status, what efforts it had previously taken to get him back to the US and what efforts it will undertake.\n\nIn court documents, Mr Ábrego García's lawyers accused the government of trying to \"delay, obfuscate and flout court orders, while a man's life and safety is at risk\".\n\nIn its emergency appeal to the Supreme Court last week, the Trump administration argued that Judge Xinis lacked the authority to issue the order to return Mr Ábrego García by Monday night, and that US officials could not compel El Salvador to return him.\n\nUS Solicitor General Dean John Sauer wrote in his emergency court filing: \"The Constitution charges the president, not federal district courts, with the conduct of foreign diplomacy and protecting the nation against foreign terrorists, including by effectuating their removal.\"\n\nThe Supreme Court, which has a 6-3 conservative majority, issued its decision in an unsigned order on Thursday.\n\nThe justices did not give the administration a deadline for when Mr Ábrego García should be freed.\n\nThey said Judge Xinis may have exceeded her authority when she required the Trump administration to \"effectuate\" Mr Ábrego García's return.\n\n\"The district court should clarify its directive, with due regard for the deference owed to the executive branch in the conduct of foreign affairs,\" the Supreme Court order said.\n\nOn Friday, President Donald Trump told reporters that if the Supreme Court said \"bring somebody back I would do that\".\n\nA justice department spokesperson told the BBC that the Supreme Court correctly recognised \"it is the exclusive prerogative of the president to conduct foreign affairs\".\n\n\"By directly noting the deference owed to the executive branch, this ruling once again illustrates that activist judges do not have the jurisdiction to seize control of the president's authority to conduct foreign policy.\"\n\nMr Ábrego García, 29, entered the US illegally as a teenager from El Salvador. In 2019, he was arrested with three other men in Maryland and detained by federal immigration authorities.\n\nBut an immigration judge granted him protection from deportation on the grounds that he might be at risk of persecution from local gangs in his home country.\n\nDemocratic Senator Chis Van Hollen, who represents Mr Ábrego García, said the case marks a \"troubling moment\" for the US when it comes to the rule of law.\n\n\"It took them only 72 hours to illegally abduct Abrego Garcia and take him out of the country to El Salvador,\" Van Hollen told BBC News. \"They can get them back in 72 hours or less, and they need to do that. And they need to do it now.\"\n\nMr Ábrego García's wife, Jennifer Vásquez Sura, is a US citizen and has been calling for his release since his deportation.\n\n\"I will continue fighting until my husband is home,\" she told the New York Times on Thursday.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "The Supreme Court on Thursday ruled that the Trump administration must “facilitate” the return ofKilmar Abrego Garcia, the wrongfully deported Maryland man, to the US, but scrapped the deadline set by a lower court for his homecoming.\n\nIn a unanimous decision, the high court left part of Biden-appointed Maryland District Court Judge Paula Xinis’ order in effect but remanded the case to her for clarification on exactly how the government should “effectuate” his release from a notorious El Salvador mega-prison.\n\nThe justices noted that the Trump administration’s emergency request to stayXinis’ April 7 deadline for Abrego Garcia’s returnis “effectively granted” because the deadline already passed.\n\nAbrego Garcia, whom the Trump administration suspects of being a member of the ruthless MS-13 gang, has been held at thebrutal Center for Terrorism Confinement (CECOT)in El Salvador since last month.\n\nHis deportation wasacknowledged by the Trump administrationto have been “illegal” because he was “subject to a withholding order forbidding his removal to El Salvador,” according to the high court.\n\n“The [lower court] order properly requires the Government to ‘facilitate’ Abrego Garcia’s release from custody in El Salvador and to ensure that his case is handled as it would have been had he not been improperly sent to El Salvador,” read the opinion.\n\n“The intended scope of the term ‘effectuate’ in the District Court’s order is, however, unclear, and may exceed the District Court’s authority,” it continued. “The District Court should clarify its directive, with due regard for the deference owed to the Executive Branch in the conduct of foreign affairs.”\n\n“For its part, the Government should be prepared to share what it can concerning the steps it has taken and the prospect of further steps.”\n\nThe Trump administration, however, contends that it “cannot guarantee success in sensitive international negotiations” over Abrego Garcia’s release from foreign custody.\n\n“The United States does not control the sovereign nation of El Salvador, nor can it compel El Salvador to follow a federal judge’s bidding,” Solicitor General John Sauer wrote in the administration’s Supreme Court petition earlier this week.\n\n“While the United States concedes that removal to El Salvador was an administrative error,” he added, “that does not license district courts to seize control over foreign relations, treat the Executive Branch as a subordinate diplomat, and demand that the United States let a member of a foreign terrorist organization into America tonight.”\n\nAdministration officials claim that Abrego Garcia was “confirmed to be a ranking member of the MS-13 gang by a proven and reliable source.” They also alleged that he entered the country illegally in 2011 and originally came from El Salvador.\n\nAbrego Garcia’s family and lawyers maintain that he has no gang ties. They allege that since 2006, gang members have threatened to abduct and kill him to extort money from his parents back in Central America.\n\nIn a statement in support of the ruling, Justice Sonia Sotomayor argued that the Trump administration should be working faster to correct “its egregious error” and was “plainly wrong” to suggest Abrego Garcia could not be returned to the US.\n\n“The Government’s argument, moreover, implies that it could deport and incarcerate any person, including US citizens, without legal consequence, so long as it does so before a court can intervene,” Sotomayor wrote."
    }
}