{
    "question": "How should policymakers and watchdogs balance the need to communicate market-moving decisions, like the 90-day tariff pause, with safeguards against potential insider trading, given the rapid market surge and ensuing calls for an investigation?",
    "content": {
        "source_1": "Donald Trump is openly bragging about just how much money his billionaire buddies made off of his dangerous tariff gambit.\n\nAfter announcing a 90-day pause Wednesday on his sweeping “reciprocal tariff” policy on nearly every country—with the exception of China—Trump was excited to take credit for making a buck for his guests at the Oval Office.\n\n“He made $2.5 million today, and he made $900 million! That’s not bad,” Trumpsaid, pointing to financial investorCharles SchwabandRoger Penske, a Nascar team owner, respectively.\n\nSchwab’s estimated net worth is$12.6 billion, while Penske’s is$5.6 billion.\n\nBloombergreportedthat Wednesday was the “best day ever” for billionaires, as the world’s wealthiest people raked in a heaping $304 billion as the markets shot back up.\n\nThe day’s biggest individual winner should come as no surprise: Elon Musk made a whopping $36 billion as Tesla stock soared up 23 percent. Trump’s surprising decision to temporarily back off his steep tariffs has sparked major concerns of obviousmarket manipulation, and even potentialinsider trading.\n\nRepresentative Alexandria Ocasio-Cortez and other Democrats are accusing Donald Trump and his administration ofmanipulating the marketto their benefit.\n\nJust days after Trump announced his”Liberation Day” tariffsthat sparked global financial chaos andtanked markets, Trump at the last minutepausedmost of the tariffs for 90 days, despite previous vehement claims that he would not back down on his plan.\n\nFollowing the pause, stock performances across the board surged drastically—the Nasdaqjumpedby 12.2 percent and the Dow Jones Industrial average increased by 3,000 points, the largest single-session increase ever recorded. Anyone who knew about the pause in advance would’ve made a killing.\n\n“Any member of Congress who purchased stocks in the last 48 hours should probably disclose that now,” AOC wrote in aposton X on Wednesday. “I’ve been hearing some interesting chatter on the floor. Disclosure deadline is May 15th. We’re about to learn a few things. It’s time to ban insider trading in Congress.”\n\nHer post was accompanied by a screenshot that showed a drastic spike in Nasdaq call volume right before Trump announced the pause, indicating the president may have leaked the information to his allies, who could have invested knowing stocks would soar. Just hours before his shocking flip went public, Trump also published a series of suspicious posts on Truth Social.\n\n“BE COOL! Everything is going to work out well. The USA will be bigger and better than ever before!” he wrote Wednesday morning. “THIS IS A GREAT TIME TO BUY,” Trumppostedminutes later.\n\nAOC isn’t the only Democrat suspicious of the GOP’s brinkmanship. In a floor speech Wednesday, Senator Elizabeth Warrencalledfor an investigation into Trump’s volatile change of course.\n\n“We need an independent investigation into market manipulation because Americans need to know whether President Trump or anyone in his administration manipulated the market to benefit their donors, all while they are working for the American people, and while small businesses and those working families are paying the price,” Warren said.\n\nSenator Adam Schiff warned the president’s “constant gyrations in policy provide dangerous opportunities for insider trading.”\n\n“Who in the administration knew about Trump’s latest tariff flip flop ahead of time? Did anyone buy or sell  stocks, and profit at the public’s expense?” the California Democratwrotein a Bluesky post. “I’m writing to the White House—the public has a right to know.”\n\nThe GOP is now left scrambling to defend Trump’s seemingly unjustifiable decision, as the fear of recession looms and U.S. legitimacy continues to dwindle.\n\nElon Musk’s Department of Government Efficiency fired car safety experts in the National Highway Traffic Safety Administration who directly regulated Tesla.\n\nTheFinancial Timesreportsthat DOGE fired 30 employees from the agency back in February, including several from the office of vehicle automation safety, which is in charge of regulating self-driving vehicles, a key part of Musk’s car company.\n\nThe layoffs made up 4 percent of the agency’s 800-person staff, including employees who were due for promotions and workers who had just been hired. The automation safety staff were disproportionately affected because the office had only been formed in 2023 and was predominately made up of probationary hires.\n\nIn a Valentine’s Day email announcing the firings, poor performance was cited as the reason, although this was rejected by an unnamed senior employee still at NHTSA who spoke to theTimes.\n\nThe NHTSA has eight active investigations against Tesla, including five focusing on Musk’s claims about the company’s Autopilot system and Full Self-Driving software, and has published over 10,000 complaints about the company from the public. The agency has also ordered multiple recalls of Tesla cars and delayed the rollout of the company’s self-driving and driver-assistance software.\n\nMusk has promised to launch a driverless ride-hailing service in Austin, Texas, in June, and to start building a fleet of autonomous “cybercabs” next year, which would require an NHTSA exception because the cybercabs don’t have a steering wheel or pedals.\n\n“Letting DOGE fire those in the autonomous division is sheer madness—we should be lobbying to add people to NHTSA,” one Tesla manager told theTimes. They “need to be developing a national framework for [autonomous vehicles], otherwise Tesla doesn’t have a prayer for scale in FSD or robotaxis.”\n\nAnd, much like DOGE’s other firings at agencies across the government that regulate or deal with Musk’s companies, the NHTSA layoffs have majorethical implications.\n\n“There is a clear conflict of interest in allowing someone with a business interest influence over appointments and policy at the agency regulating them,” a former NHTSA employee told theTimes.\n\nMusk owes much of his wealth togovernment subsidies and contracts, and many of DOGE’s moves havesquashed government oversightinto his businesses. As long as Trump keeps giving him unprecedented power, the tech oligarch andfascism enthusiastwill continue to keep serving his own interests.\n\nBuried within Donald Trump’s executive order “undoing the left’s war on water pressure” was a shady phrase to help the president fast-track his deregulatory crusade.\n\nIn asectionof the order signed Wednesday repealing a 13,000-word regulation defining “showerhead,” Trump noted that notice and comment on the recission would not be accepted.\n\n“Notice and comment is unnecessary because I am ordering the repeal,” the order stated.\n\nNotice-and-comment rulemaking, asoutlinedby the Administrative Procedure Act, or APA, requires federal agencies to give the public time to comment after presenting a new rule. The agency must then consider all relevant, timely submitted comments before publishing the final rule.\n\nBut in his order, Trump implies that because he was the one rewriting the rule, the public would not be given the opportunity to comment, essentially fast-tracking any deregulation effort he pitches in the future.\n\nLegal experts were quick to challenge Trump’s rulemaking rule change.\n\n“This is so illegal. Just utterly, utterly unlawful,” wrote Aaron Reichlin-Melchick, a senior fellow at the American Immigration Council, in an XpostWednesday. “The President cannot overturn the commands of the APA by just declaring ‘because I said so.’”\n\n“If President Biden could have written executive orders requiring rules just be written without comment, we’d have a whole helluva lot of new regulations on the books protecting consumers, workers, and the environment,” Todd Phillips, an assistant law professor at Robinson College of Business,wroteon X.\n\nIn aseparate post, Phillips warned that rescissions would be challenged “so, so, so quickly. And in the D.C. Circuit.”\n\nIn a separateexecutive ordersigned Wednesday, Trump ordered U.S. agencies to get moving on rescinding “unlawful” regulations under several Supreme Court decisions, includingLoper Bright Enterprises v. Raimondo, by once again skipping the process of notice and comment—this time claiming a “good cause” exception.\n\n“In effectuating repeals of facially unlawful regulations, agency heads shall finalize rules without notice and comment, where doing so is consistent with the ‘good cause’ exception in the Administrative Procedure Act,” the order stated. “That exception allows agencies to dispense with notice-and-comment rulemaking when that process would be ‘impracticable, unnecessary, or contrary to the public interest.’”\n\nIn February, the Department of Health and Human Services issued a statementrevokingits long-standing policy of using notice-and-comment rulemaking, which could potentially allow for expedited reforms to Medicaid programs.\n\nThe public reaction to Donald Trump’s tariff reversal has not been good.\n\nCNN’s John Berman decided to spew off a list of headlines Thursday morning related to the market frenzy while introducing Republican strategist David Urban, who was left with little more than sticks and stones and some misdirection to defend the president’s whiplash tariff rollout and his subsequent cave.\n\n“Let’s go over some of the headlines and leads in today’s papers,” Bermanstarted. “The Washington Post, ‘Trump Blinked.’Wall Street Journalopinion, ‘Trump Blinks.’The New York Timeslede says ‘Bond Yields cause Mr. Trump to blink.’ TheFinancial Times, ‘Why did Donald Trump buckle?’\n\n“And just for the sugar on top here, Politico says, ‘Getting yippy with it,’ and Puck says, ‘Un-liberation Day,’” Berman continued.\n\n“So David Urban, blink, blink, buckle,” Berman concluded, before asking Urban, “Was this all bungled?”\n\n“No, John, I don’t think it was bungled. I think that the markets got a little skittish,” Urban said. “I think the House and Senate are working diligently to get this tax bill done and get some things pushed through.”\n\nUrban then blamed the markets, claiming that if investors “were a bit more patient,” they would have seen the administration get “a lot of good things done.” The lobbyist then posited that a forthcoming “stablecoin bill” would make the U.S. dollar stronger again on a global scale.\n\n“However, you know, the bond markets, as you noted there, really put a scare into the administration, I think, when the cost of borrowing for the federal government goes way, way up and the U.S. dollar doesn’t become the reserve currency, which was what it looks like when you have a bond market sell-off like it was happening,” Urban said. “I think that’s what caused the pause button to be pushed.”\n\nBut Urban conceded, ultimately, that no one can know how the markets will react.\n\nTrump appeared to intentionally sow volatility last week, when he announced some 200 tariffs on countries around the world (whose rates were discovered to befounded on bad math). After a week of panicked investors and a tanking economy, as well as a midday trade war with China, Trump decided to undo it all, with the White House revealing that it would be pausing the majority of its tariffs (except on China) and lowering the tariffs to a universal baseline rate of 10 percent. That sent the market into a different kind of frenzy, whose biggest winners were the demographic already with the most money:billionaires.\n\nIn its latest attack on the free press, the Trump administration is withholding pool reports that make it look bad.\n\nTwo recent dispatches from White House pool reporters, a rotating group of reporters designated to cover the president and share information with the rest of the press corps, never made it public, StatusreportedWednesday.\n\nOn Tuesday evening,Dallas Morning NewsreporterJoseph Gordon, who was in the pool that day, sent a standard email noting that reporters were following Trump to a dinner but that two photographers from the Associated Press were “turned away from joining the pool.” The pool report never made it to news outlets, Gordon later learned. In February, the Associated Press wasbannedfrom the White House press pool for refusing to adopt Trump’s renaming of the Gulf of Mexico to the Gulf of America, but a judgeorderedthe White House to lift the ban Tuesday.\n\nAlso earlier this week, Philip Wegman of RealClearPolitics sent a report noting the abrupt cancellation of a joint press conference with Trump and Israeli Prime Minister Benjamin Netanyahu. That report also never made it to press, Status reported.\n\nThe White House press pool is essential to distributing information to news outlets across the country, and the censorship of its reports marks yet another attempt by the Trump administration to control journalists. In February, White House press secretary Karoline LeavittannouncedTrump’s press team would take over the press pool and determine which journalists get to travel with the president, declaring the job “a privilege, not a legal right.”\n\nThe announcement broke decades of historical precedent and marked the beginning of unparalleled hostility between the White House and reporters. Trump, Leavitt, and other MAGA members have since tried a number of ways to control the media and avoid being held accountable for their attack on democracy—it looks like censoring pool reports is their next attempt to do so.\n\nDonald Trump claimed that his party was “working nicely together,” just hours after House Republicans’ infighting forced them to delay a vote on a multitrillion-dollar budget bill.\n\n“Great News! ‘The Big, Beautiful Bill’ is coming along really well. Republicans are working together nicely. Biggest Tax Cuts in USA History!!! Getting close,” Trumpwroteon Truth Social Thursday morning.\n\nHouse GOP members were anything but united. The night before, Republican Representative Rich McCormicktoldCNN’s Manu Raju that there were still 15 Republican holdouts on the bill, which would provide the funding for Trump’s sweeping agenda, including tax cuts and bolstering immigration initiatives.\n\nRepresentative Thomas Massie, who has become a regular holdout against Republican-backed government spending bills, said that aprovisionRepublicans had added that would prevent efforts to roll back Trump’s tariffs was “illegal.”\n\n“They used the Rules Committee resolution to circumvent U.S. law,” Massie told Raju.\n\nOn Wednesday night, House Speaker Mike Johnson said he hadn’t decided how best to rally Republican support behind the budget blueprint.\n\n“We have a pretty well-developed playbook, and it’s got a number of plays in it, and I just haven’t made the call on which one it is yet,” hesaid.\n\nHouse Republicans areexpectedto vote again on the bill at 10:20 a.m. before setting off on a two-week recess.\n\nDonald Trump is taking revenge against two officials from his first term.\n\nOn Wednesday, the president issueddirectivesstripping the security clearances ofChris KrebsandMiles Taylorand ordering the Department of Justice to open investigations against them, characterizing Taylor’s criticisms of him as “treasonous” and calling Krebs “a significant bad-faith actor.”\n\nKrebs, who ran the Cybersecurity and Infrastructure Security Agency,affirmedJoe Biden’s election victory in 2020, saying at the time that “claims [of fraud] either have been unsubstantiated or are technically incoherent” and authorizing a statement from CISA that the election was secure. Trump subsequentlyfiredhim by tweet.\n\nLater, Krebs was a witness for the House January 6 committee, providing information on securing the 2020 election, testifying that “Republican officials, senior officials, including the former president, lied to the American people about the security of the 2020 election.”\n\nKrebs now works at cybersecurity company SentinelOne, and Trump’s order not only targets him but strips the security clearances of anyone at the company who works with him. As Trump signed the order against Krebs Wednesday, he let everyone know that he still isn’t over losing in 2020, calling the election “rigged.”\n\n“It was proven by so many different ways in so many different forms,” Trump said. “We’re going to find out about this guy too, because this guy is a wise guy.”\n\nTaylor famously wrote an anonymousNew York Timesop-ed criticizing Trump in 2018 while working for the Department of Homeland Security. He left the Trump administration in 2019 and, upon revealing his identity, wrote a book detailing the chaos he observed from Trump. He went on to endorse Biden before the 2020 election, although Trump on Wednesday said, “I barely remember him.”\n\n“Somebody that went out and wrote a book and said all sorts of terrible things that were all lies,” Trump said. “I think he’s guilty of treason.”\n\nThe orderagainst Tayloris so broad that it even suspends the security clearances of “individuals at entities associated with Taylor, including the University of Pennsylvania, pending a review of whether such clearances are consistent with the national interest.”\n\n“Dissent isn’t unlawful. It certainly isn’t treasonous. America is headed down a dark path. Never has a man so inelegantly proved another man’s point,” Taylor wrote.\n\nAll of this shows that Trump would not only escape consequences for his actions if he was reelected but that he always planned to takerevengeon his critics if he was able to return to the White House. Now the checks on his power are minimal at best.\n\nMany weresurprisedWednesday by Donald Trump’s decision to put a90-day pauseon a majority of his sweeping tariffs on other countries (with the exception of China), but only one person was in the midst of defending those very tariffs to Congress.\n\nU.S. Trade Representative Jamieson Greer sat before the House Ways and Means Committee, where he’d been testifying for nearly four hours in defense of Trump’s “reciprocal tariff” policy, when the president announced the pause.\n\nDemocratic Representative Steven Horsford was the first toquestionGreer about the pause, and asked when exactly he had been made aware that Trump planned to walk back his sweeping tariffs.\n\n“I understood the decision was made a few minutes ago,” Greer said, noting it had been “under discussion.”\n\n“So did you know that this was ‘under discussion,’ and why did you not include this in your opening remarks?” Horsford said.\n\nGreer said he wouldn’t “divulge the contents” of his discussions with the president.\n\nHorsford pressed for details from Greer, but the trade representative couldn’t provide any information on the 90-day deadline, saying he didn’t know all the details because he’d been in the hearing all day.\n\n“So the trade representative hasn’t spoken to the president of the United States about a global reordering of trade? And yet he’s—but yet he announced it on a tweet!” Horsford said above Greer’s protests. “WTF! Who’s in charge?!”\n\n“The president of the United States is in charge,” Greer replied.\n\n“And what do you know about those details? It looks like your boss just pulled out the rug from under you and paused the tariff—the taxes on the American people,” Horsford said. “There is no strategy! You just found out three seconds ago, sitting there; we saw you!”\n\nThe Nevada Democrat continued topressGreer on his failure to disclose Trump’s plan at any point during the lengthy hearing. “If you came here knowing that these tariffs were going to be turned off, why didn’t you include that in your opening statement, why didn’t you reference that as part of your testimony?”\n\nGreer repeated that he wouldn’t discuss his conversations with the president.\n\n“These were specific questions. We asked you all along, what’s the strategy? These are real consequences for the American people and small businesses,” Horsford said, exasperated.\n\n“This is amateur hour, and it needs to stop! What does this even mean for your negotiating strategy? How are you in charge of negotiation if the president is tweeting about this, wherever the hell he is?”\n\nWhen Horsford asked Greer directly if he knew it was happening, Greer would only repeat that they’d been “discussing it.”\n\n“There was no strategy, there was no plan. The president chose to take actions that he didn’t have the authority to take. He has put our economy in near collapse,” Horsford said.\n\nHe then asked Greer about the issue on everyone’s mind. Earlier Wednesday, amid a roiling stock market, Trump hadadvisedhis followers on Truth Social that it was a “great time to buy.” After announcing the 90-day pause on tariffs, the market shot back up.\n\n“Why not? If it was a plan, if it was always the plan, how is this not market manipulation?” Horsford asked.\n\n“It’s not market manipulation, Sir,” Greer insisted.\n\n“Well then what is it, because it sure is not a strategy!” Horsford said.\n\n“We’re trying to reset the global trade system—” Greer said, before he was cut off.\n\n“And what has that done? And how have you achieved any of that? But to enact enormous harm on the American people, which was our concern from the very beginning!” Horsford said, adding, “So, if it’s not market manipulation, what is it? Who’s benefiting? What billionaire just got richer?”\n\nHorsford noted that all the Republican members of the committee had left “because they don’t want to defend this!”\n\nOn X, Horsfordposteda picture of Greer conferring with his colleague, captioning it: “What it looks like when you’re the country’s trade representative testifying before Congress and you find out Trump changed his mind on tariffs.”\n\n“This is reckless governing. There is no strategy and it’s obvious this is amateur hour,” Horsford wrote.\n\nThe Trump administration is now going to screen immigrants’ social media as grounds for denying immigration benefits, including international students and people applying for permanent residency.\n\nThe Department of Homeland Security announced the move in apress releaseWednesday afternoon, saying that U.S. Citizenship and Immigration Services would be taking action, effective immediately, against “antisemitic activity on social media and the physical harassment of Jewish individuals.”\n\n“DHS will enforce all relevant immigration laws to the maximum degree, to protect the homeland from extremists and terrorist aliens, including those who support antisemitic terrorism, violent antisemitic ideologies and antisemitic terrorist organizations such as Hamas, Palestinian Islamic Jihad, Hezbollah, or Ansar Allah aka: ‘the Houthis,’” the statement read.\n\nThe move follows the visa revocations and detention of students who have advocated for Palestine, such as Tufts University doctoral studentRümeysa Öztürk, as well as the arrest and detention of Columbia University graduate and permanent residentMahmoud Khalil. In both cases, the government made no indication that it has followed due process, and the two are not alone: Secretary of State Marco Rubio claims to have revoked the visas of over 300 students before Wednesday’s announcement.\n\nNow DHS will begin policing the opinions of anyone seeking to study in the United States, ostensibly on grounds of opposing “antisemitic terrorism.” In reality, there is no proof that Khalil, Öztürk, or many other targeted students engaged in terrorism. Rather, the Trump administration has redefined terrorism to mean opposition to Israel’s brutal war in Gaza and support for Palestinian self-determination. In effect, the message is that immigrants and visitors to the U.S. no longer have the right to free speech.",
        "source_2": "Christiaan Hetzner is a former writer forFortune, where he covered Europe’s changing business landscape.\n\nLeading Democrats in Congress are alleging allies of President Donald Trump may be illegally profiting from his tariff brinkmanship.\n\nTrump’s on-again, off-again trade war has sent global asset prices on a wild ride. On Wednesday, the Dow Jones industrial average gained 3,000 points for the first time ever in a single session while “Magnificent Seven” stockTeslasoared 22%, after the White House called pause on its so-called reciprocal tariffs.\n\nThanks to the volatility, anyone with advance knowledge of the administration’s plans could make a killing on the market. Now, Democrats are questioning whether their Republican peers did just that.\n\n“Any member of Congress who purchased stocks in the last 48 hours should probably disclose that now. I’ve been hearing some interesting chatter on the floor,”wroteNew York Rep. Alexandria Ocasio-Cortez. “It’s time to ban insider trading in Congress.”\n\nHer comments were in response to indications that word of Trump’s pivot may have leaked just prior to the announcement.\n\nShortly before the announcement, there was aflurry of call options buyingin the derivatives market for exchange-traded funds passively tracking equity indexes like the SPDR S&P 500 and Invesco QQQ that moves in tandem with theNasdaq100.\n\nOn Wednesday, the White Houseposteda video in which the president turns toCharles Schwab, the 87-year-old founder of the eponymous brokerage firm, saying how he had just made $2.5 billion that day.\n\n“That’s not bad,” Trump remarked. He did not say whether Schwab made any trades on that day, and his company did not respond to a request fromFortunefor comment.\n\nEarlier in the day, however, Trump put out a post on Truth Social recommending, “THIS IS A GREAT TIME TO BUY.” CNBC then quizzed the U.S. secretary of commerce on the president’s uncanny ability to time the market. “I always bet on Donald Trump,” Howard Lutnick replied.\n\nTrump also ended the post with his initials, DJT. Typically, this is a way for politicians to signal that they wrote the post themselves rather than their staff, but a hallmark of the president is that he writes his own statements on social media, so signing off is not necessary.\n\nHis DJT initials also happen to be the ticker for Truth Social’s parent company, Trump Media & Technology Group, which likewise soared over 20% on the day.\n\nAsked about that detail, the commerce secretary claimed Trump uses his initials to name himself as the sender in all of the text messages Lutnick receives from his boss.\n\nBecause President Trump has determined Washington’s moves in the recent trade brinkmanship, investors have had little choice but to hang on Trump’s every pronouncement.\n\nEven an apparently harmless misunderstanding over comments by economic advisor Kevin Hassett sent markets on aroller-coaster rideon Monday.\n\nThis unpredictability presents problems, however, as those in his orbit could enjoy an advantage and may be tempted to speculate thanks to the information gleaned through their proximity to the Oval Office.\n\nCase in point, when asked which U.S. companies his administration might exempt from tariffs—a move that could have enormous implications for the stock prices of companies like Apple—Trump answered these decisions would be taken “instinctively.”\n\nJust hours before Trump changed course, he proclaimednow was a great timeto buy assets, a statementcrypto scam sleuthStephen Findeisen argued offered the “perfect plausible deniability” needed for insider trading.\n\nIt remains unclear whether, at the time he posted that on Truth Social, he was already planning a U-turn on tariffs. The White House did not respond toFortune’s request for comment.\n\n“Was that market manipulation? Was it corruption in plain sight?” Sen. Elizabeth Warren said on the floor of Congress, calling for an official investigation. “Americans need to know whether President Trump or anyone in his administration manipulated the market to benefit their donors.”\n\n© 2025 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of ourTerms of UseandPrivacy Policy|CA Notice at Collection and Privacy Notice|Do Not Sell/Share My Personal InformationFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.",
        "source_3": "'Special Report' anchor Bret Baier joins 'The Brian Kilmeade Show' to discuss the latest on President Donald Trump's tariffs, new details on Joe Biden's mental decline and the debate surrounding paying college athletes.\n\nThe White House slammed Democrats for playing \"partisan games\" and calling for an investigation into alleged insider trading after PresidentDonald Trumppaused customized reciprocal tariffs for 90 days on Wednesday.\n\n\"It is the responsibility of the President of the United States to reassure the markets and Americans about their economic security in the face of nonstop media fearmongering. Democrats railed againstChina’s cheating fordecades, and now they’re playing partisan games instead of celebrating President Trump’s decisive action yesterday to finally corner China,\" White House spokesman Kush Desai said in comment to Fox Digital when asked about Democrats claiming Trump manipulated the market.\n\nSens. Adam Schiff, D-Calif., and Ruben Gallego, D-Ariz., wrote a letter on Thursday to White House Chief of Staff Susie Wiles, as well as Trade Representative Jamieson Greer, calling for an investigation into potential insider trading.\n\n\"This sequence of events raises grave legal and ethics concerns. The President, his family, and his advisors are uniquely positioned to be privy to and take advantage of non-public information to inform their investment decisions,\" the senators wrote.\n\nTRUMP SAYS HE'LL 'TAKE A LOOK' AT EXEMPTING SOME LARGER US COMPANIES HIT ESPECIALLY HARD BY TARIFFS\n\nPresident Donald Trump holds a chart as he delivers remarks on reciprocal tariffs during an event titled \"Make America Wealthy Again\" in the Rose Garden at the White House in Washington, D.C., on April 2.(Brendan Smialowski/AFP via Getty Images)\n\nTrump, ahead of pausing the reciprocal tariffs, posted to Truth Social, \"BE COOL! Everything is going to work out well. The USA will be bigger and better than ever before!\" and \"THIS IS A GREAT TIME TO BUY!!! DJT.\" The president had previously said he would not pause tariffs but was open to negotiating with other nations.\n\nTrump paused only the higher, customized tariffs he placed on nations that historically installedtrade barrierson U.S. goods, with nations across the world instead facing a lower 10% tariff on goods, as the Trump administration and world leaders hash out negotiations for the reciprocal tariffs.\n\nDONALD TRUMP'S ALLIES, SUPPORTERS AND DONORS, LED BY ELON MUSK, PUSH TO END TARIFF WAR\n\nSen. Adam Schiff, D-Calif., wrote a letter calling for an investigation into potential insider trading.(Screenshot/NBC)\n\nChina, however, was not part of the tariff pause and was instead hit with a higher 125% tariff after retaliating with its own additional tariffs against the U.S.\n\n\"I’m going to do my best to find out,\" Schiff, who has long been a Trump foe,told Timeof investigating the president for alleged insider trading. \"Family meme coins and all the rest of it are not beyond insider trading or enriching themselves. I hope to find out soon.\"\n\nCHARLIE GASPARINO BREAKS DOWN TRUMP'S TARIFF PAUSE: ‘THIS IS WHAT FORCED THE HAND’\n\nTreasury Secretary Scott Bessent said the customized tariffs were pauseddue to Trump wantingto be \"personally involved\" in negotiations as dozens of nations contacted the White House to strike deals.\n\nPresident Donald Trump is keeping high tariffs in place on China, while putting a 90-day pause on reciprocal tariffs for countries that have said they are open to negotiation.(Andrew Harnik/Getty Images)\n\n\"We've had more than 75 countries contact us. And I imagine after today, there will be more. So it is just a processing problem. Each one of these solutions is going to be bespoke. It is going to take some time. And President Trump wants to be personally involved. So, that's why we're getting the 90-day pause,\" Bessent said during a gaggle with the media outside the White House on Wednesday afternoon.\n\nTrump added on Wednesday that he was watching the volatile bond market, calling it \"tricky\" and making people a \"little queasy,\" but denied it persuaded him to change course on customized tariffs.\n\n\"I thought that people were jumping a little bit out of line. They were getting yippy. You know, they we're getting a little bit yippy, a little bit afraid, unlike these champions, because we have a big job to do. No other president would have done what I did. … I know the presidents, they wouldn't have done it, and it had to be done,\" Trump added in his remarks.\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox"
    }
}