{
    "question": "How might the 90-day pause on most tariffs—paired with sharply higher duties on China—shape U.S. negotiating leverage, business confidence, and bond-market stability in the coming weeks?",
    "content": {
        "source_1": "President Donald Trump’s abrupt decision to reverse course on his sweeping tariff plan by announcing athree-month pauserevealed his threshold for political pain: One week.\n\n“They were getting yippy,” Trump said, explaining the rising criticism raining down on the White House over the last week. “They were getting a little bit yippy, a little afraid.”\n\nEven for a president famous for his policy bobs and weaves, Wednesday’s announcement he was pausing his long-touted reciprocal tariffs for three months amounted to a stunning reversal of a plan he had appeared only a day earlier to be fully behind and came as his own trade representative was testifying on Capitol Hill to the benefits of the tariffs, seemingly catching him unaware of the pause.\n\nDays of pressure from fellow Republicans, business executives and even his close friends hadn’t appeared to move Trump, who insisted last week: “MY POLICIES WILL NEVER CHANGE.”\n\nRelated articleTrump announces 90-day pause on ‘reciprocal’ tariffs with exception of China\n\nBy Wednesday, however, it had become evident the campaign to convince Trump to change course would not let up. It had also become plain after a sharp sell-off in US government bond markets — usually a safe corner for investors — that the economic ramifications of the president’s strategy were potentially catastrophic and worse than his advisers had previously predicted.\n\nThe growing alarm inside the Treasury Department over developments in the bond market was a central factor in Trump’s decision to hit pause on his “reciprocal” tariff regime, according to three people familiar with the matter.\n\nTreasury Secretary Scott Bessent raised those concerns directly to Trump Wednesday in a meeting that preceded the pause announcement, underscoring concerns shared by White House economic officials who had briefed Trump on the accelerating selloff in the US Treasury market earlier in the day.\n\nCalls to top White House advisors from key business community allies also increasingly focused on the troubling developments in the bond market as they made the case for Trump to pull back.\n\nTrump had not yet made the decision to pause the dramatic new tariff rates when he was posting on social media about the stock market Wednesday morning, two of the people said.\n\nBut he acknowledged later in the afternoon that he’d been watching the bond market turmoil closely.\n\n“The bond market is very tricky, I was watching it,” Trump told reporters. “The bond market right now is beautiful. But yeah, I saw last night where people were getting a little queasy.”\n\nSitting in the Oval Office to tap out his announcement, Trump was joined by two advisers who had become dueling faces of the tariff plan: Bessent and Commerce Secretary Howard Lutnick.\n\n“We didn’t have access to lawyers or – it was just wrote up. We wrote it up from our hearts, right? It was written from the heart, and I think it was well written too, but it was written from the heart,” Trump said afterward, describing a process driven more by impulse than mapped-out strategy.\n\nEven as Trump calmed the markets – for now, at least – he also raised new questions by suggesting he would consider exempting some US companies from tariffs, saying he would make any such decisions “instinctively.”\n\nIt was another whirlwind Wednesday at the White House, with advisers scrambling to keep pace with the president’s decisions. He sought to take a victory lap after one of the most humbling retreats of his presidency, eager to take credit for the stock market gains Wednesday – without mentioning the record-setting, trillion-dollar losses over the last week.\n\n“It’s the biggest increase in the history of the stock market. That’s pretty good,” Trump told reporters in the Oval Office. “If you keep going, you’re going to be back to where it was four weeks ago.”\n\nIf Trump was planning early Wednesday to pause his new tariffs after days of market turmoil, he did not reveal his intentions widely. Many White House officials heard of his decision at the same time the world learned, via post on Truth Social, that the new tariffs were on pause.\n\nEven his own top trade official seemed only vaguely aware the change was possible by the time Trump announced the reversal on social media.\n\n“It looks like your boss just pulled out the rug from under you and paused the tariffs,” Democratic Rep. Steven Horsford of Nevada told US Trade Representative Jamieson Greer during a hearing that was underway on Capitol Hill when Trump made his announcement. Greer had offered zero indication to that point the major shift was coming.\n\nBessent and other officials insisted the decision to pause the new tariffs on all nations except China was not a backdown; instead, they framed the move as all part of Trump’s master plan to bring nations to the negotiating table.\n\n“It took great courage, great courage for him to stay the course until this moment,” said Bessent, who flew to Palm Beach last weekend for a lengthy discussion with Trump on the endgame of the tariffs.\n\nEven as his advisers danced around it, though, the president acknowledged that the rising criticism, deepening angst and mounting losses in the financial markets contributed to his abrupt decision on Wednesday afternoon to impose a three-month pause on many of the tariffs.\n\n“I thought that people were jumping a little bit out of line,” Trump told reporters.\n\nThe administration’s economic team spent Wednesday morning intensely focused on the bond selloff that had intensified a day earlier and accelerated aggressively overnight, driving yields higher and, in effect, demonstrating the exact opposite of what would normally happen during such an unstable and volatile moment in the global economy.\n\nHistorically, Treasurys rally in moments of stock market selloffs as investors rush to shift assets to a global safehaven, the longstanding status due to the safety and liquidity provided by the US market.\n\nWatching the inverse play out, then accelerate after unexpectedly weak demand at the first Treasury Department auction to take place since Trump’s announced his tariff regime, led to growing alarm. The sharp selling of Treasurys – coupled with low demand for a sale of new US Treasury debt – sparked further concerns that foreign countries were abstaining from buying new US Treasurys and selling the debt they had. Because bond revenue pays for the cost of government programs that tax revenue doesn’t cover, worries abounded that Trump’s broader agenda was in jeopardy.\n\nIn a television interview Wednesday, Bessent dismissed the moves as “uncomfortable, but normal.”\n\nBut for Bessent, whose finance career was deeply intertwined with the bond market and who has been fixated on driving down the 10-year yields in his cabinet post, the alarm relayed by senior Treasury officials was understood and reflected in the later conversation with Trump.\n\nThe president, who is a close monitor of his own coverage on television, had seen even some of his close allies issue dire warnings about the prospects of a recession as a result of the tariffs. He was watching Fox Business channel on Wednesday morning when JPMorgan Chase CEO Jamie Dimon said a recession was “a likely outcome” of an escalating trade war resulting from Trump’s tariff policies.\n\n“Markets aren’t always right, but sometimes they are right,” Dimon told Fox Business’ Maria Bartiromo.\n\nInside the White House, telephone calls had been coming quickly from business executives, Republicans and other allies of the President urging him to reconsider his tariffs, but they received little indication a pause was in the works.\n\nExecutives had been lighting up the phone lines of chief of staff Susie Wiles, Vice President JD Vance, and Treasury secretary Scott Bessent to make the case to Trump directly as trade hawks continued to promote Trump’s tariffs-at-all-costs approach on television as the market continued to sink.\n\nWiles, these sources said, had been particularly effective in convincing Trump that the market rout was costing considerable political capital that he would need for future agenda items, with lawmakers fielding increasingly angry constituent calls as the market continued sinking.\n\nBessent, whose conversation with Trump in Florida over the weekend focused on zeroing in on the overall goal of the tariffs, also appeared to assume more of a role in the public messaging, talking frequently about the dozens of countries now jockeying for trade deals.\n\n“This was driven by the President’s strategy. He and I had a long talk on Sunday, and this was his strategy all along,” Bessent said on Wednesday.\n\nTrump, however, acknowledged he’d been keeping a close eye on markets, calling their performance “glum” over the last few days.\n\nA week after making a tariff announcement that upended the global trading system, the president stood outside the White House in front of three colorful race cars and reflected on what led to his retreat. He sought to take credit for a problem largely of his own making, saying his credibility was not eroded by the whiplash.\n\n“You have to have flexibility,” Trump said. “I think in financial markets, because they change, look how much you change today.”",
        "source_2": "Sonam Sheth is an Evening Politics Editor at Newsweek who is based in New York. She joined Newsweek in 2024 and previously worked at Business Insider and CNBC. Sonam has extensive experience coveringnational security, foreign policy,elections, andstoriesat theintersection of law and politics. Her work has been cited in The Washington Post, The Atlantic, Vanity Fair, and others. She has also frequently appeared on national television and radio, including MSNBC, NBC News, BBC World News, BBC News radio, and more. You can get in touch with Sonam at s.sheth@newsweek.com. Languages: English, Hindi, and French.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nPresidentDonald Trumpexplained his decision on Wednesday to pause reciprocal tariffs for 90 days, telling reporters at the White House that people were \"getting a little bit yippy\" and \"queasy\" over days of market turmoil.\n\nTrump abruptly announced in the afternoon that he would pause most reciprocal tariffs for 90 days and increase tariffs on China to 125 percent after Beijing announced its retaliatory tariffs on U.S. exports.\n\nThe announcement followed days of uncertainty as Trump and his advisers repeatedly insisted that he would not back down on his tariff threats, which consisted of a 10 percent baseline tariff across the board and reciprocal tariffs on dozens of countries, including many of the United States' top trading partners.\n\nTrillions of dollars evaporated from the market over the last several days, and the S&P 500 flirted with bear market territory on Wednesday morning. Uncertainty over the president's trade war also hit the bond market as Trump's reciprocal tariffs went into effect at midnight Wednesday.\n\n\"Well, I thought that people were jumping a little bit out of line,\" the president said when a reporter asked him Wednesday to elaborate on his decision to back down on reciprocal tariffs for 90 days.\n\n\"They were getting yippy, you know, they were getting a little bit yippy, a little bit afraid...because we have a big job to do,\" Trump said.\n\n\"No other president would have done what I did...and it had to be done,\" he added. \"But somebody had to do it...because it was not sustainable.\"\n\nHe also referenced the slide in the bond market, saying that \"people were getting a little queasy\" over it.\n\nThe stock market skyrocketed following Trump's announcement of a tariff pause, with the broad market index spiking more than 8 percent in Wednesday afternoon trading. TheDow JonesIndustrial Average jumped 2,721 points, or 7.23 percent, while the tech-heavy Nasdaq Composite Index soared more than 11 percent.\n\nTrump wrote on Truth Social that although the U.S. will pause reciprocal tariffs on about 75 countries, a 10 percent baseline tariff across the board will remain in place. The White House raised tariffs on China to 125 percent after Beijing announced that it would increase tariffs on the U.S. to 84 percent.\n\nThe U.S.-China trade war intensified last week when Trump first announced the U.S. would impose a reciprocal tariff of 34 percent on Chinese goods. However, the White House clarified that the penalty would be in addition to a 20 percent tariff on China already in place, bringing the total tariff on China to 54 percent.\n\nChina responded with a 34 percent tariff on the U.S., after which Trump said the U.S. would impose another 50 percent tariff on Chinese goods, bringing the total penalty up to 104 percent. China hit back by raising tariffs on the U.S. to 84 percent, which Trump responded to by increasing his tariffs on China to 125 percent.\n\nTrump called China \"the biggest abuser in history\" at the White House on Wednesday, adding that Beijing wants to \"make a deal\" with the U.S. but doesn't know \"how to go about it\" because \"they're quite proud people.\"\n\nTheEuropean Unionalso announced earlier Wednesday that it would impose a 25 percent tariff on some U.S. imports.\n\nWhite House press secretary Karoline Leavitt told reporters on Wednesday:\"Many of you in the media have clearly missed the art of the deal.\"\n\nCommerce Secretary Howard Lutnick, on X, formerly Twitter:\"[Treasury Secretary]Scott Bessentand I sat with the President while he wrote one of the most extraordinary Truth posts of his Presidency. The world is ready to work with President Trump to fix global trade, and China has chosen the opposite direction.\"\n\nKentucky Senator Rand Paul told Punchbowl News:\"I hope there's a lesson learned. When you add a bunch of tariffs, you'll lose six trillion in the marketplace. When you get rid of the tariffs, guess what, it comes bounding back.\"\n\nDemocratic strategist Sawyer Hackett wrote on X:\"Wow. Trump just caved on the sweeping across-the-board tariffs, issuing a 90-day pause. All of that chaos, trillions of dollars evaporated—for nothing at all.\"\n\nUpdate 4/9/25, 3:50 p.m. ET: This article was updated with additional information.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nSonam Sheth is an Evening Politics Editor at Newsweek who is based in New York. She joined Newsweek in 2024 and previously worked at Business Insider and CNBC. Sonam has extensive experience coveringnational security, foreign policy,elections, andstoriesat theintersection of law and politics. Her work has been cited in The Washington Post, The Atlantic, Vanity Fair, and others. She has also frequently appeared on national television and radio, including MSNBC, NBC News, BBC World News, BBC News radio, and more. You can get in touch with Sonam at s.sheth@newsweek.com. Languages: English, Hindi, and French.\n\nSonam Sheth is an Evening Politics Editor at Newsweek who is based in New York. She joined Newsweek in 2024 and previously worked at Business Insider and CNBC. Sonam has extensive experience coveringnational security, foreign policy,elections, andstoriesat theintersection of law and politics. Her work has been cited in The Washington Post, The Atlantic, Vanity Fair, and others. She has also frequently appeared on national television and radio, including MSNBC, NBC News, BBC World News, BBC News radio, and more. You can get in touch with Sonam at s.sheth@newsweek.com. Languages: English, Hindi, and French.\n\nSonam Sheth is an Evening Politics Editor at Newsweek who is based in New York. She joined Newsweek in 2024                                    ...Read more",
        "source_3": "President Trump finally decided to take the proverbial “win” on tradeand the stock market rallied nearly 3,000 points.\n\nYou can thank the bond market, with an assist fromTreasury Secretary Scott Bessent, for making it happen.\n\nWe have been hyper-focused on how the stock market dropped ever since Trump declared trade war on the entire world, how he kept upping the ante, demanding ever higher degrees of compensation from our trade partners, even those who appeared to be acting in good faith and wanting to negotiate peace.\n\nTrump’s trade intransigence was a reflection of his own oft-stated desire to level the playing field, ending our perpetually large trade deficits with the world.\n\nAlso certainly in the back of his “art-of-the-deal” mindset was an attempt to maximize leverage in negotiations.\n\nHe was also goaded by two of the most hawkish and protectionist advisers to have ever set foot in the White House:Howard Lutnick, the commerce secretary, andPeter Navarro, who holds the title of senior counsel to the president.\n\nPushed aside, until recently, was Bessent, a veteran Wall Street financier who sought a middle ground, doing deals with countries but not engaging in outright war.\n\nThe hawks seemed to be firmly in control even as markets around the world continued to crater, the US stock indices losing trillions of dollars in value.\n\nTrump continued to ignore olive branches from the EU, which stated publicly it wanted zero tariffs with the US on many goods. Trump even kept toying with Israel, one of our closest allies, after Prime MinisterBenjamin Netanyahutold him he’d eliminate all tariffs on US goods, wiping out the trade deficit with the US.\n\nThat long game came to an end Tuesday night in the form of a bond market rout for the ages.\n\nBut the US has $36 trillion in bonds in circulation, much of it in foreign hands, that we use to finance government operations.\n\nThe bond market is also the plumbing of the economy because it sets interest rates on consumer and business loans.\n\nIf the US can’t sell its debt, it can’t pay for stuff like Social Security, the military or plug our enormous deficit.\n\nIn other words, when bond prices fall and their interest rates spike, it could spell economic disaster.\n\nThat’s what the bond market was signaling Tuesday night, bringing real panic as the yield on the 10-year bond shot to 4.51% and the yield on the 30-year bond jumped above 5%.\n\nSomeone was unloading bonds en masse amid the trade turmoil.\n\nA recent Treasury auction didn’t go so well, adding to the upheaval.\n\nMarket experts speculated that hedge funds were unwinding some complex trades.\n\nEven worse, I was told by the CEO of a major financial institution that one of our biggest foreign holders of treasuries, the Japanese, were unloading US debt in huge quantities.\n\nMany fingers pointed to China, our long-term adversary economically and militarily, but it was a friendly country, selling in huge quantities and sending interest rates into dangerous territory.\n\nThat type of instability clearly made an impression on Bessent, I am told.\n\nIt was Bessent, not Lutnick or Navarro, who held a press conference Wednesday saying our trade war with the world — except a hyper-belligerent China — was over, or at least on pause.\n\nHe attributed it to Trump’s negotiating style, playing the long game and getting people to the table to discuss lowering trade barriers."
    }
}