{
    "question": "What are the potential economic and diplomatic implications of the EU’s 90-day suspension of planned retaliatory tariffs after the U.S. reduced its tariff on the bloc from 20% to 10%?",
    "content": {
        "source_1": "The European Union has announced a 90-day pause on countermeasures against the United States, a day after President Donald Trump unveiled asimilar pauseon his “reciprocal”tariffs.\n\n“We want to give negotiations a chance,” European Commission President Ursula von der Leyen said Thursday.\n\nThis comes after the EU on Wednesdayannouncedit would begin collecting higher duties on US imports, in retaliation for the steel and aluminum tariffs announced by Trump in March.\n\nJust after the EU agreed on its response, the US president said he would pause his “reciprocal” tariffs on dozens of countries for 90 days, claiming he did so because more than 75 countries had contacted the White House to “negotiate” on trade policy.\n\nHowever, von der Leyen, head of the EU’s executive arm, stressed that “if negotiations are not satisfactory, our countermeasures will kick in.”\n\nThe bloc of 27 countries had been hit by three sets of US tariffs: 25% tariffs on steel and aluminum exports, 25% levies on car exports and 20% so-called reciprocal tariffs on all other goods.\n\nDespite the pause on the “reciprocal” tariffs, Trump said the industry-specific ones would remain in place — as well as his 10% flat-rate minimum tariff on all nations.\n\nAlthough Trump’s abrupt tariff reversal came as a relief to many in Europe, investors and analysts have warned that the unpredictable, stop-start nature of his trade policy will likely dampen investment and could slow global economic growth.\n\n“Clear, predictable conditions are essential for trade and supply chains to function,” von der Leyen said in a separate statement Thursday.\n\nDespite the tariff pause, Stéphane Séjourné, who leads the European Commission’s industrial strategy, warned EU companies to remain “calm and cautious.”\n\n“The only certainty is that instability will remain for the next four years,” he wrote on X.\n\nWhile the EU “remains committed to constructive negotiations” with the US, the bloc is also focused on “diversifying its trade partnerships, engaging with countries that account for 87% of global trade,” von der Leyen said.\n\nOlaf Gill, a trade spokesperson for the European Commission, said the bloc had “pressed the pause button to allow space for negotiations” with the US and to consult with member states to decide on the “most coherent strategy.”\n\nSince returning to the White House in January, Trump has chastised the EU with a fury that was largely absent during his first term. The president has said the bloc was created to “screw” the US.\n\n“They rip us off,” Trump said of the bloc when announcing his sweeping tariffs last week. “It’s so sad to see. It’s pathetic.”\n\nTrump has also criticized the EU for its value-added tax — a 15% standard minimum tax on most goods and services sold in the bloc, whether home-grown or imported, which Trump has characterized as a tariff on US goods and an “unfair” trade practice.\n\nUsing a crude methodology that has been criticized by trade economists, Trump claimed the EU had in place a tariff of 39% on US products. The average tariff rate applied on goods by both sides is around 1%,accordingto the European Commission.\n\nThis article has been updated with additional information and context.",
        "source_2": "Reporting by Reuters newsrooms; Writing by Joseph Ax and Daniel Trotta; Editing by Lincoln Feast, Sharon Singleton, Nick Zieminski and Matthew Lewis\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nJeff Mason is a White House Correspondent for Reuters. He has covered the presidencies of Barack Obama, Donald Trump and Joe Biden and the presidential campaigns of Biden, Trump, Obama, Hillary Clinton and John McCain. He served as president of the White House Correspondents’ Association in 2016-2017, leading the press corps in advocating for press freedom in the early days of the Trump administration. His and the WHCA's work was recognized with Deutsche Welle's \"Freedom of Speech Award.\" Jeff has asked pointed questions of domestic and foreign leaders, including Russian President Vladimir Putin and North Korea's Kim Jong Un. He is a winner of the WHCA's “Excellence in Presidential News Coverage Under Deadline Pressure\" award and co-winner of the Association for Business Journalists' \"Breaking News\" award. Jeff began his career in Frankfurt, Germany as a business reporter before being posted to Brussels, Belgium, where he covered the European Union. Jeff appears regularly on television and radio and teaches political journalism at Georgetown University. He is a graduate of Northwestern University's Medill School of Journalism and a former Fulbright scholar.\n\nJoe Cash reports on China’s economic affairs, covering domestic fiscal and monetary policy, key economic indicators, trade relations, and China’s growing engagement with developing countries. Before joining Reuters, he worked on UK and EU trade policy across the Asia-Pacific region. Joe studied Chinese at the University of Oxford and is a Mandarin speaker.",
        "source_3": "The European Union will put retaliatory tariffs on the United States on hold following President Donald Trump’s Wednesday announcement that he was pausing most tariffs on all countries except China.\n\nEuropean Commission President Ursula von der Leyen said Thursday that the body would put a 90-day pause on its retaliatory actions in order for negotiations to take place. That is the same amount of time that Trump said he would pause most tariffs on all countries but China to work out trade deals that are more favorable to the United States.\n\nIn a statement posted on X, von der Leyen said that European retaliatory tariffs could still take effect if negotiations fell through.\n\n“We took note of the announcement by President Trump. We want to give negotiations a chance. While finalising the adoption of the EU countermeasures that saw strong support from our Member States, we will put them on hold for 90 days,” she said. “If negotiations are not satisfactory, our countermeasures will kick in. Preparatory work on further countermeasures continues. As I have said before, all options remain on the table.”\n\nWe took note of the announcement by President Trump.\n\nWhile finalising the adoption of the EU countermeasures that saw strong support from our Member States, we will put them on hold for 90 days.\n\n— Ursula von der Leyen (@vonderleyen)April 10, 2025\n\nThe announcement comes after the European Unionvoted26-1 to impose tariffs on more than $20 billion of U.S. goods.American products like soybeans, meat, iron, steel, textiles, tobacco, and ice cream were expected to be hit with tariffs of up to 25%,accordingto a copy of the retaliatory plan obtained by The Washington Post.\n\nEarlier on Thursday, von der Leyensaidshe welcomed Trump’s decision to pause most tariffs, calling it an “important step towards stabilizing the global economy.”\n\nShe also said she would support a “zero-for-zero” tariff agreement with the United States.\n\n“Tariffs are taxes that only hurt businesses and consumers. That’s why I’ve consistently advocated for a zero-for-zero tariff agreement between the European Union and the United States,” von der Leyen said. “The European Union remains committed to constructive negotiations with the United States, with the goal of achieving frictionless and mutually beneficial trade.”\n\nAt the same time Trump paused most reciprocal tariffs he hiked the tariff on Chinese goods to 125%. That came after Chinese officials announced an 84% tariff on American goods, which went into effect on Thursday.\n\nTrumpsaidWednesday that he expected to make a deal with all countries, including China.\n\n“A deal is going to be made with China,” he said. “A deal is going to be made with every one of them, and there will be fair deals. I just want fair.”\n\nYour information could be the missing piece to an important story. Submit your tip today and make a difference."
    }
}