{
    "question": "What specific economic and behavioral indicators would most credibly signal that the U.S. is heading into a recession amid the new tariff policy, and how should businesses and policymakers interpret mixed signals from markets, corporate earnings, and consumer spending?",
    "content": {
        "source_1": "While some people anxiously watch the stock market for signs of a recession, others look for more subtle cues that the economy is in trouble.\n\nOne of them isCatherine De Noire, a manager of a legal brothel, a Ph.D. candidate in organizational psychology and an influencer. When business at her brothel unexpectedly dips, De Noire takes it as a sign that the economy is in trouble.\n\nAlthough De Noire is based in Europe, she believes that economic upheaval in the United States “triggers huge uncertainty” across the pond because of America’s global influence. De Noire first noticed a decline in business right afterDonald Trumpwas elected in November 2024, as Americans and the rest of the world anticipated upheaval.\n\nStrippers in the U.S. are also feeling the pinch. Dancer and influencerVulgar Vanitysaid that when she first started dancing in 2022, she could earn six figures just by dancing during a handful of big events in Austin, such as the Formula 1 Grand Prix and South by Southwest music festival. This year is different.\n\n“I didn’t even bother working South by Southwest because the first Friday night I attempted to work, I walked into a completely empty club and didn’t make any money at all,” she said.\n\nVanity also says that many of her regular customers aren’t tipping at all or tipping less than half of what they used to. She is quick to point out that she is just one dancer and “obviously not an economist,” but she notes that other dancers and tipped workers are also hurting. Her theory is that her customers are no longer tipping as generously because of rising costs and economic uncertainty. Vanity is worried that this means we are on the verge of a recession or full-blown depression.\n\nAre these astute women onto something? Indicators like a decline in business at brothels, lower tips for strippers and other nontraditional measures of economic health “have a measure of validity but may be more coincident indicators than leading ones,” saidMarta Norton,a chief investment strategist atEmpower. While Norton finds this type of anecdotal evidence interesting, she says she looks at more traditional sources of data, especially corporate earnings and the stock market, to predict if a recession is in our future. By those traditional measures, “We may be slowing, but we aren’t facing a looming recession. Yet,” she said. De Noire believes that the tariffs Trump announced on what he called “Liberation Day” will “definitely contribute to a further decline and recession.”\n\nNevertheless, the past has shown that nontraditional measures can tell us a lot about the economy’s health. Here are some of the anecdotal indicators of the economy about whether a recession is likely.\n\nAccording to De Noire, business at her brothel usually picks up in the spring once people give up on their New Year’s resolutions and recover from holiday spending. But this year, business is down.She attributes the “huge dip” in earnings at her brothel to customers feeling insecure about the economy.\n\n“There are significantly fewer clients coming in, and the sex workers are reporting noticeably lower earnings,” she said. Although De Noire emphasizes that the top sex workers at her brothel are still earning more compared to the general population, she said some of the highest earners at her brothel are earning about half of what they did during the same time last year.\n\n“We’re seeing clients come in less often, try to negotiate lower prices or stop visiting altogether. We’re also hearing from our workers that more clients are going for the cheapest possible service,” she said.\n\nAccording to De Noire, this suggests that people are saving money or reallocating their spending toward things they see as more essential, likely because they’re preparing for challenging times ahead.\n\nLegal brothels in the U.S. are seeing a similar trend, according toAndrew Lokenauth, a data analyst and founder of BeFluentInFinance.com. He explains that revenue at legal brothels in Nevada is down roughly 20% since last quarter. “My research shows this correlates strongly with discretionary spending trends,” indicating a recession is likely.\n\nStrippers are often the first ones tonotice a downturn in the economy.Dancers are “obviously not a priority or household necessity” and “are the first to feel it because we’re the first ones tossed aside,” Vanity said.\n\n“The ‘stripper index’ is one of those odd but oddly effective indicators” of economic health, saidDavid Kindness,a certified public accountant and finance expert. It tracks how much strippers are earning and how often customers are going to strip clubs, he explained.\n\n“When tips slow down and foot traffic thins out, it often means people are holding onto their extra cash,” Kindness explained. According to Lokenauth, Vanity isn’t the only dancer feeling the squeeze, and that’s not a good sign. “Strip club revenue in Vegas is down about 12%,” which could indicate we are headed for a recession, Lokenauth said.\n\nWhat type of beer people drink is a “pretty good indicator” of whether a recession is on the horizon, saidJack Buffington, an assistant professor of supply chain managementat theDaniels College of Business at the University of Denver.\n\n“Beer is a discretionary spend and a social spend,” so people cut back on how much they spend on beer when they are worried about the economy, he explained. Since it’s much less expensive to pick up a six-pack than to go out for draft beers, how much money people are spending on draft beer, and pricey craft beers in particular, is a harbinger of a recession.\n\n“Craft beer sales are way down,” potentially indicating a recession is likely, Buffington said.\n\nIn 2008, former Federal Reserve Chairman Alan Greenspan observed thatdeclining sales of men’s underwearlikely meant we were headed for a recession. “There’s a concerning trend. Sales dropped roughly 6% over these past months,” Lokenauth says. “Guys only skip replacing underwear when they’re worried about money,” so we may be in trouble, he says.\n\nThe “lipstick index” “illustrates a seemingly contradictory consumer pattern during economic recessions,” explainsKevinShahnazari, a data analyst and co-founder of FinlyWealth.\n\nThe Lipstick Index doesn’t just apply to lipstick. The theory behind the Lipstick Index is that when money is tight, consumers substitute costly purchases with cheap luxuries like lipstick.\n\n“In the 2008 recession, cosmetics sales increased, showing that even in tough times, individuals crave tiny comfort purchases that give psychological boosts without a hefty financial outlay,”Shahnazariexplained.\n\nFor example, someone might skip a costly facial but buy a $10 lipstick. Or they might skip an expensive dinner out but still buy a $6 latte or a box of expensive chocolates.\n\nToday, cosmetics sales are strong. “MAC and Sephora sales are up about 15%, not a great sign for the broader economy,” Lokenauth said.Moreover, there “is a quiet trend towards lower-cost, no-frills beauty,” and cosmetic sales in drugstores have risen over the past few months,Shahnazarisaid. This could be a sign we are headed for a recession.\n\nHow people date can also indicate whether or not we are headed for a recession. Paid subscriptions for online dating services have fallen, even though the total number of users has risen,Shahnazarisaid. “Free and lower-tier use of dating apps has risen by about 12%, indicating social and financial stress,”heexplained.\n\nAdditionally,increased use of online dating apps can be a sign that people are looking for “cheaper entertainment and companionship instead of expensive nights out,” Lokenauth said. “I’ve tracked this metric for years, and it’s scarily accurate,” he added.\n\nHemlines “rise with optimism, fall with doubt,” Shahnazari said. “Although absurd, this psychological anomaly quantifies consumer confidence and social mood,” he explained.Historically, shorter hemlines meant economic optimism, and longer hemlines signaled economic trouble. For example, the happy-go-lucky flappers in the Roaring Twenties wore short dresses, but hemlines got longer during the Great Depression in the 1930s.\n\nCurrently, the Hemline Index is sending mixed signals because recent designer collections are featuring both long and short hems, Lokenauth said. Thanks to fast fashion, hemlines aren’t as clear an indicator as they once were, he explains. However, given the accuracy of the Hemline Index in the past, he thinks it’s worth keeping an eye on the runways next season.\n\nFor two decades, HuffPost has been fearless, unflinching, and relentless in pursuit of the truth. Support our mission to keep us around for the next 20 — we can't do this without you.\n\nWe remain committed to providing you with the unflinching, fact-based journalism everyone deserves.\n\nThank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever.We hope you will join us once again.\n\nWe remain committed to providing you with the unflinching, fact-based journalism everyone deserves.\n\nThank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever.We hope you will join us once again.\n\nIf you notice fewer blond hairdos, it could be a sign a recession is looming. “Stylists are often the first to notice economic shifts, and lately, many have mentioned clients asking for easier and cheaper options,” Kindness said.\n\nClients may shift from high-maintenance hairstyles to lower-maintenance natural looks as a way to save money, Kindness explained. There are signsspending at salons is down. If you see formerly blond “recession brunettes” out and about, it might be a sign a recession is coming, he said.\n\nBy entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to ourTerms of ServiceandPrivacy Policy.",
        "source_2": "Kate Plummer is a Newsweek reporter based in London, U.K. Her focus is on U.S. politics and national affairs, and she is particularly interested in the impact of social policy decisions on people as well as the finances of political campaigns, corruption, foreign policy, democratic processes and more. Prior to joining Newsweek, she covered U.K. politics extensively. Kate joined Newsweek in 2023 fromThe Independentand has also been published in multiple publications includingThe Timesand theDaily Mail. She has a B.A. in History from the University of Oxford and an M.A. in Magazine Journalism from City, University of London.\n\nYou can get in touch with Kate by emailingk.plummer@newsweek.com, or by following her on X at @kateeplummer.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nLarry Summers has predicted that the U.S. could enter a recession because of PresidentDonald Trump's tariff policies.\n\nSince Trump announced a minimum tariff of 10 percent on imports from nearly all U.S. trading partners last Wednesday, experts have expressed concerns about a potential recession as markets tumbled.\n\nLast Thursday, in the wake of the tariff announcement,JP Morgan increased the chances of a U.S. recession this year from 40 percent to 60 percent.\n\nOn Monday, Goldman Sachs raised the odds of a U.S. recession to 45 percent from 35 percent.\n\nSummers, a former top economic adviser to former PresidentBarack Obama, has now joined the chorus of those suggesting an economic downturn. Hepreviously correctly predictedthat there would be inflation caused by former PresidentJoe Biden's rescue plan in 2021. He also correctly forecast increasing gas prices in 2022.\n\nSpeaking onBloombergTelevision'sWall Street Week with David Westin, Summers suggested Trump backs off the tariffs that have been announced, suggesting their impact could be worse than the depression in the 1930s.\n\nClaiming that Trump is the sole cause of economic pressures by spooking the markets, he said: \"It's more likely than not that we're going to have a recession—and in the context of a recession, we'll see an extra 2 million people be unemployed. We'll see losses in household income\" of $5,000 per family or more.\n\nHe added: \"I think we could be looking for fairly serious economic problems, and I think it will cast a shadow forward because if we have a recession, the budget deficit will go up, the accumulated debt that we have to deal with will go up.\"\n\nSummers also said the impact would spread to other countries. \"There will be financial distress that will affect higher-risk companies and also higher-risk countries in the global economy,\" he said.\n\nSimon Johnson, former IMF chief economist,previously toldNewsweek:\"The uncertainty caused by on-off tariffs and aggressive but inconsistent messaging from the White House is definitely contributing to postponement of investment and an economic slowdown.\"\n\nHe noted that it \"remains to be seen\" whether these effects will ultimately combine to cause a recession.\n\nJesse Rothstein, economics professor at the University of California, Berkeley, added it was unclear whether or not there will be a recession:\"It is always difficult to attribute outcomes like recessions to specific causes. I am worried that the risk of a recession is uncomfortably high, and I think the combination of tariffs already imposed and uncertainty about future tariffs is an important contributing factor.\"\n\nTrump has shown no signs he will repeal the tariff hikes. Whether that changes in response to market pressures remains to be seen.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nKate Plummer is a Newsweek reporter based in London, U.K. Her focus is on U.S. politics and national affairs, and she is particularly interested in the impact of social policy decisions on people as well as the finances of political campaigns, corruption, foreign policy, democratic processes and more. Prior to joining Newsweek, she covered U.K. politics extensively. Kate joined Newsweek in 2023 fromThe Independentand has also been published in multiple publications includingThe Timesand theDaily Mail. She has a B.A. in History from the University of Oxford and an M.A. in Magazine Journalism from City, University of London.\n\nYou can get in touch with Kate by emailingk.plummer@newsweek.com, or by following her on X at @kateeplummer.\n\nKate Plummer is a Newsweek reporter based in London, U.K. Her focus is on U.S. politics and national affairs, and she is particularly interested in the impact of social policy decisions on people as well as the finances of political campaigns, corruption, foreign policy, democratic processes and more. Prior to joining Newsweek, she covered U.K. politics extensively. Kate joined Newsweek in 2023 fromThe Independentand has also been published in multiple publications includingThe Timesand theDaily Mail. She has a B.A. in History from the University of Oxford and an M.A. in Magazine Journalism from City, University of London.\n\nYou can get in touch with Kate by emailingk.plummer@newsweek.com, or by following her on X at @kateeplummer.\n\nKate Plummer is a Newsweek reporter based in London, U.K. Her focus is on U.S. politics and national affairs, and                                    ...Read more",
        "source_3": "JPMorgan Chase Chairman and CEO Jamie Dimon talks tariffs, the future of U.S. trade and competition, earnings expectations, recession likelihood and more in an exclusive interview on 'Mornings with Maria.'\n\nJamie Dimon, the chairman and CEO of JPMorgan Chase, has his finger on the pulse of America’s financial state — which he claims could have more doom and gloom today than optimism.\n\n\"I hear it from just everybody now, ‘I'm going to cut back a little bit, I'm gonna wait, see what happens.’ That is kind of recessionary talk,\" Dimon said Wednesday in an exclusive interviewon \"Mornings with Maria.\"\n\nWhen asked if he’s personally expecting a recession, Dimon responded: \"I am going to defer to my economists at this point, but I think probably that's a likely outcome.\"\n\nThe top banker didn’t shy away from discussing President Donald Trump’s tariffs and the state of the economy following $6 trillion in value being wiped from the stock market in under a week.\n\nSCOTT BESSENT BLASTS CHINA'S RETALIATORY TARIFF PLAY AS LOSING MOVE\n\nJPMorgan Chase Chairman and CEO Jamie Dimon on the importance of leadership skills, deregulation policy, energy independence and the Federal Reserve helping small banks and businesses.\n\nOvernight, China fired back with an 84% retaliatory tariff after Trump put forth a 104% levy on Chinese imports. The White House continues to reiterate it is open to negotiations with China as well as any other country.\n\n\"I'm taking a calm view, but I think it could get worse if we don't make some progress here,\" Dimon said.\n\n\"It is perfectly reasonable for someone to say that trade was unfair. There were unfair trade things,\" he noted. \"I think they have the [value-added tax] wrong, how they understand it. And I think they should really get a better understanding, to make it easier to negotiate.\"\n\nTreasury Secretary Scott Bessent responds to China imposing 84% tariffs on U.S. goods, the state of the Chinese economy and a potential backup plan for corporate America seemingly 'shutting down' in light of tariffs.\n\nThe tariffs were \"beyond what people expected,\" the CEO argued while expressing his confidence in Treasury Secretary Scott Bessent.\"That will cause a little inflation, slow down growth, but I hope what they really do is let Scott Bessent, who I think is a professional, negotiate. I know Japan's here, I gather Korea, Vietnam have called, and then eventually Europe… Get those things done quickly,\" Dimon urged.\n\n\"If you want tocalm down the markets, show progress in those things, then let Scott take the time,\" he added. \"Trade deals are very large and very complex. They can't be done overnight, but you really have to have teams working on them to get them right.\"\n\nHe further cautioned against \"trade wars,\" claiming countries and companies are now faced with long-term and short-term choices to make.\n\n\"I think today I saw Delta remove their guidance, and things like that will affect stock prices again. So, it's not over yet,\" Dimon said. \"And then you've seen tremendous moves in swap prices, asset prices, Treasury prices.\"\n\n'The Claman Countdown' panelists Jack Janasiewicz and Keith Fitz-Gerald discuss responding to market volatility amid tariff policy.\n\n\"Let them settle down, take a deep breath, negotiate some trade deals. That's the best thing they can do.,\" he said.\n\nIn his annual letter to shareholders earlier this week, Dimon put emphasis on national security in reaction to Trump's \"menu of tariffs,\" but admitted it takes time tostreamline supply chainswithin the U.S. only. He expanded with host Maria Bartiromo on how fast it could be done.\n\n\"We need to do that for rare earths, pharmaceutical devices, semiconductor chips. We should do it right. I mean, we shouldn't do it in a way that wastes a lot of money and lets corporations feed it, that great tax trough, or something like that. And it could be done, but it will take years,\" he said.\n\nJack Otter and the 'Barron's Roundtable' panel look ahead after a volatile week on Wall Street following Trump's reciprocal tariffs plan.\n\n\"Economic security, national security are almost directly related in the long run… I think it would be in Russia's and North Korea's, Iran's and China's interests to fragment the Western world. And I think that would be the biggest long-term mistake,\" he continued. \"I don't want to read the book about how the West was lost.\"\n\n\"But I do think fixing these tariff issues and trade issues should be a good thing to do. That will get one major uncertainty behind us. We have the strongest economy in the world. It would be good not to add to the uncertainty out there,\" he said.\n\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\n\nBy clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time."
    }
}