{
    "question": "In what ways could DHS’s immediate social media screening for antisemitic activity shape immigration outcomes and the balance between security goals and free speech protections for visa and green card applicants?",
    "content": {
        "source_1": "Department of Homeland Security Secretary Kristi Noem's agency says the social media screenings will affect immigrants applying for permanent residence status, and foreigners affiliated with educational institutions.Rebecca Noble/AFP via Getty Imageshide caption\n\nU.S. Citizenship and Immigration Serviceshas announcedit will begin screening immigrants' social media for evidence of antisemitic activity as grounds for denying immigration benefit requests. The screenings will affect people applying for permanent residence status as well as foreigners affiliated with educational institutions. The policy will go into effect immediately.\n\nIn a statement issued Wednesday morning, the Department of Homeland Security said it will \"protect the homeland from extremists and terrorist aliens, including those who support antisemitic terrorism, violent antisemitic ideologies and antisemitic terrorist organizations such as Hamas, Palestinian Islamic Jihad, Hezbollah, or [the Houthis].\"\n\n\"There is no room in the United States for the rest of the world's terrorist sympathizers, and we are under no obligation to admit them or let them stay here,\" said DHS Assistant Secretary for Public Affairs Tricia McLaughlin.\n\nThe announcement comes following the highly publicized arrests and detentions of pro-Palestinian student activists such as Mahmoud Khalil and Rumeysa Ozturk, who the government alleges engaged in antisemitic activities. Their lawyers deny the allegations.\n\nIn a statement to NPR, Edward Ahmed Mitchell, the national deputy director of the Council on American-Islamic Relations, said: \"The spirit of Joseph McCarthy is alive and well in the Trump administration, which has spent months dishonestly mischaracterizing legitimate criticism of the Israeli government's war crimes in Gaza as antisemitic, pursuing witch hunts into American colleges, and threatening the free speech rights of immigrants.\"\n\nJ-Street, a Washington group which describes itself as pro-Israel, pro-peace and pro-democracy, was quick to disavow the new policy.\n\n\"The fight against antisemitism won't be advanced by attacks on 250-year-old cherished American rights like free speech,\" said the group's president Jeremy Ben-Ami.\n\n\"The Trump administration's own appointees have social media accounts riddled with antisemitism, demonstrating how insincere they are in claiming their totalitarian attacks on higher education and immigrants will make Jewish Americans safer and that they are motivated by genuine concern for our wellbeing.\"\n\nThe administration has doubled down on its enforcement in educational spaces in recent weeks.\"It is a privilege to be granted a visa to live & study in the United States of America,\" Homeland Security Secretary Kristi Noem posted on X last month. \"When you advocate for violence and terrorism that privilege should be revoked and you should not be in this country.\"",
        "source_2": "Gabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nAndrew Stanton is a Newsweek weekend reporter based in Maine. His role is reporting on U.S. politics and social issues. Andrew joined Newsweek in 2021 from The Boston Globe. He is a graduate of Emerson College. You can get in touch with Andrew by emailinga.stanton@newsweek.com. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nCitizenship and Immigration Services announced Wednesday it will begin screening immigrants' social media accounts for signs of antisemitic activity, which could be used as grounds to deny applications for immigration benefits.\n\nThe move was quickly met with criticism from free speech advocates, who argued the government should not be using its authority to chill the freedom of speech of its residents, including immigrants who are in the country on a visa or green card.\n\nThe newDepartment of Homeland Security(DHS) policy, which takes effect immediately, applies to individuals seeking permanent residency as well as foreign nationals connected to educational institutions.\n\nDHS wrote in a statement that USCIS will \"consider social media content that indicates an alien endorsing, espousing, promoting, or supporting antisemitic terrorism, antisemitic terrorist organizations, or other antisemitic activity\" as a \"negative factor\" when considering immigrant benefit requests.\n\n\"There is no room in the United States for the rest of the world's terrorist sympathizers, and we are under no obligation to admit them or let them stay here,\" said DHS Assistant Secretary for Public Affairs Tricia McLaughlin.\n\nShe added that Secretary of Homeland SecurityKristi Noemhas \"made it clear that anyone who thinks they can come to America and hide behind the First Amendment to advocate for anti-Semitic violence and terrorism – think again. You are not welcome here.\"\n\nIt comes after the Trump administration has moved to deport individuals likeMahmoud Khalil, a 30-year-old Palestinian graduate student at Columbia University, over alleged involvement in pro-Palestinian protests.\n\nThe Trump administration has argued that he can be deported using a provision that allows the secretary of state to deport noncitizens believed to pose \"potentially serious adverse foreign policy consequences for the United States.\"\n\nOfficials allege that Khalil's public role in the protests amounts to support forHamas, which the U.S. government designates as a terrorist organization. Critics, however, say the arrest is an attempt at chilling the free speech of migrants, as well as those who are critical of Israel's government.\n\nThe Foundation for Individual Rights and Expression in a statement sent toNewsweek:\"By surveilling visa and green card holders and targeting them based on nothing more than their protected expression, the administration trades America's commitment to free and open discourse for fear and silence. Unfortunately, that chill appears to be the administration's aim.\"\n\nJenin Younes, litigation counsel for the New Civil Liberties Alliance, in a post to X:\"Keep in mind that the Trump Admin has re-defined antisemitism to include criticism of Israel and Zionism, but anyway true antisemitic speech, just like racist, sexist, homophobic, transphobic & Islamophobic speech is 1A protected. The government should have no role in policing social media for such speech & punishing the speakers. This is not \"Restoring Free Speech and Ending Federal Censorship\" per EO 14149.\"\n\nChristopher Skelly, communications director for the Libertarian Party of New York, on X:\"The DHS will now be screening social media for \"antisemitic\" activity, in direct violation of the First Amendment. Freedom of Speech is not granted by government. It is an inherent right, not limited to one's citizenship status.\"\n\nThe policy went into effect immediately. Many of Trump's immigration policies have faced legal challenges, though it's unclear whether the new rule will be challenged at this point.\n\nUpdate 04/09/25 1:57 p.m. ET: This article has been updated with additional information.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nAndrew Stanton is a Newsweek weekend reporter based in Maine. His role is reporting on U.S. politics and social issues. Andrew joined Newsweek in 2021 from The Boston Globe. He is a graduate of Emerson College. You can get in touch with Andrew by emailinga.stanton@newsweek.com. Languages: English.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he                                    ...Read more",
        "source_3": "Education Secretary Linda McMahon joined 'America's Newsroom' to discuss Democrats' backlash over cuts at the civil rights office and her letter to California Gov. Gavin Newsom addressing the trans athlete debate.\n\nU.S. Citizenship andImmigrationServices will now start considering migrants’ antisemitic activity on social media as \"grounds for denying immigration benefit requests,\" with Homeland Security vowing there is \"no room in the United States for the rest of the world’s terrorist sympathizers.\"\n\nHomeland Securityannounced Wednesday that the change will \"immediately affect aliens applying for lawful permanent resident status, foreign students and aliens affiliated with educational institutions linked to antisemitic activity.\"\n\n\"Today U.S. Citizenship and Immigration Services (USCIS) will begin considering aliens’antisemitic activityon social media and the physical harassment of Jewish individuals as grounds for denying immigration benefit requests,\" it said.\n\n\"Consistent with President Trump’s executive orders on Combatting Anti-Semitism, Additional Measures to Combat Anti-Semitism and Protecting the United States from Foreign Terrorists and Other National Security and Public Safety Threats, DHS will enforce all relevant immigration laws to the maximum degree, to protect the homeland from extremists and terrorist aliens, including those who support antisemitic terrorism, violent antisemitic ideologies and antisemitic terrorist organizations such as Hamas, Palestinian Islamic Jihad, Hezbollah, or Ansar Allah aka: ‘the Houthis,’\" the agency added.\n\nFEDERAL GOVERNMENT QUESTIONED FORMER COLUMBIA UNIVERSITY PRESIDENT OVER ANTISEMITISM\n\nHomeland Security Secretary Kristi Noem is recognized as President Donald Trump speaks during an event in the Rose Garden at the White House on April 2.(AP/Mark Schiefelbein)\n\nThe development comes as the Trump administration is trying tocrack down on antisemitism– particularly on college campuses – that has been brewing since Hamas’ attack on Israel in October 2023.\n\n\"There is no room in the United States for the rest of the world’s terrorist sympathizers, and we are under no obligation to admit them or let them stay here,\" Tricia McLaughlin, Homeland Security assistant secretary for public affairs, said in a statement.\n\nPRINCETON EVENT WITH FORMER ISRAELI PRIME MINISTER DISRUPTED BY ANTI-ISRAEL AGITATORS\n\nThe Homeland Security flag on an Immigration and Customs Enforcement building in Washington, D.C., in January 2023.(Celal Gunes/Anadolu Agency via Getty Images)\n\n\"Sec. [Kristi] Noem has made it clear that anyone who thinks they can come to America and hide behind the First Amendment to advocate for antisemitic violence and terrorism – think again. You are not welcome here,\" she added.\n\nStudents attending a recent annual Israel block party at the University of Texas at Austin were met with disruptive anti-Israel protesters.(Fox News)\n\nUnder the new guidance, Homeland Security said USCIS will \"consider social media content that indicates an alien endorsing, espousing, promoting, or supporting antisemitic terrorism, antisemitic terrorist organizations, or other antisemitic activity as a negative factor in any USCIS discretionary analysis when adjudicating immigration benefit requests.\"\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox"
    }
}