{
    "question": "What are the potential legal, diplomatic, and security implications of the U.S. considering drone strikes on cartel targets in Mexico, particularly regarding coordination with Mexico and the possibility of unilateral action?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nA view from an U.S. Army Blackhawk helicopter as it flies along the US-Mexico border as part of Joint Task Force Southern Border Thursday, April 3, 2025, in Douglas, Ariz. (AP Photo/Ross D. Franklin)\n\nA U.S. Army Blackhawk helicopter transports members of the Joint Task Force Southern Border during a tour of the US-Mexico border , in Douglas, Ariz., Thursday, April 3, 2025. (AP Photo/Ross D. Franklin)\n\nWASHINGTON (AP) — A top Pentagon official said Tuesday that special operations forces do not have the authority to launch drone attacks at drug cartels in Mexico, even though President Donald Trump has designated themforeign terrorist organizations.\n\nColby Jenkins, who is currently working as the assistant defense secretary for special operations, told a Senate committee that Trump’s designation doesn’t automatically give the U.S. military the authority to take direct action against the cartels.\n\nUnder questioning from Sen. Elissa Slotkin, a Michigan Democrat, Jenkins said it “helps us unlock the doors” for a broader government approach to the drug problem.\n\nSlotkin noted that Elon Musk, a top adviser to Trump on overhauling the federal government, has said the foreign terrorist designation means the U.S. can conduct drone strikes against the cartels. Musk posted that on Feb. 19 on X.\n\nJenkins said it doesn’t, but that now the military can provide options and be ready if Trump needs more done to protect the border.\n\nU.S. Northern Command hasincreased manned surveillanceflights along the U.S.-Mexico border to monitor drug cartels and the movement of fentanyl and is increasing its intelligence sharing with Mexico from those flights, Gen. Gregory Guillot told senators in February.\n\nThere are alsounmanned U.S. drones conducting surveillanceover Mexico’s airspace, according toMexican President Claudia Sheinbaum.\n\nTrump designated many of the gangs and cartels moving those drugs into the U.S. as foreign terrorist organizations on Feb. 19, further increasing the pressure on their ability to move and providing law enforcement with what the State Department said are “additional tools to stop these groups.”\n\nGuillot, commander of U.S. Northern Command, also told senators that he would seek expanded authority from Congress to conduct “more advise-and-assist types of operations between our forces and the tier one Mexican forces,” which are that country’s special forces units.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Reporting by Raul Cortes, Ana Isabel Martinez and Laura Gottesdiener in Mexico City and Idrees Ali in Washington; Editing by Kylie Madry and Rosalba O'Brien\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab",
        "source_3": "The Trump administration is reportedly mulling drone strikes on drug cartels in Mexico to prevent the flow of fentanyl and other illicit drugs into the United States across the southern border.\n\nCurrent and former military, law enforcement, and intelligence officials toldNBC Newsthat the proposed strikes are aimed to decimating the cartels’ ability to continue their operations at the border.\n\nDiscussions among White House, Defense Department and intelligence officials, which are still at an early stage, have included possible drone strikes against cartel figures and their logistical networks in Mexico with the cooperation of Mexico’s government, the sources said.\n\nStill, the administration has made no final decision and reached no definitive agreement about countering the cartels. And unilateral covert action, without Mexico’s consent, has not been ruled out and could be an option of last resort, the sources said. It is unclear whether American officials have floated the possibility of drone strikes to the Mexican government.\n\nIf Mexico and the United States proceed together with drone strikes or other action, it would not be the first time they have launched a joint effort to take on the cartels, nor would it be the first time that American military and intelligence worked in concert with Mexico’s law enforcement and army.\n\nBut what the Trump administration is contemplating could be unprecedented both in the number of U.S. personnel involved and in the use of American unmanned aircraft to bomb cartel personnel and assets.\n\nOne of the sources told NBC News that the administration is “looking to build a target deck” which could include individual cartel operatives, vehicles, warehouses, and other components of the cartels’ infrastructure.\n\nDuring the 2024 presidential campaign, President Donald Trump publicly expressed support for using military force against the cartels. In one instance, hesaidhe would “makes appropriate use of Special Forces, cyber warfare and other overt and covert actions to inflict maximum damage on cartel leadership, infrastructure and operations.”\n\nWhile speaking to a joint session of Congress in March, Trumpsaid, “The cartels are waging war on America, and it’s time for America to wage war on the cartels.”\n\nTo stop the deadly drugs that are poisoning our people, I will deploy the U.S. Navy to impose a full fentanyl blockade on the waters of our region.…The drug cartels are waging war on America, and we will destroy those cartels!pic.twitter.com/A0ZgqJxvH1\n\nThe CIA has already been flying surveillance drones over Mexico with the permission of the nation’s government, TheLos Angeles Timesreported in February.\n\nNo administration in modern times has taken such a militaristic approach to Mexico, a U.S. ally that Trump blames for producing the fentanyl that has killed hundreds of thousands of Americans. His stance upends recent U.S. policy, which emphasized beefing up the rule of law in Mexico, and stands at odds with Mexico’s security strategy, which has veered away from the sort of fierce cartel confrontations that drove record levels of bloodshed.\n\nThis came just after Trumplabeled drug cartels as a terrorist group.\n\nMexican President Claudia Sheinbaum said Thursday that she will propose a constitutional reform aimed at protecting her nation’s sovereignty — a move that comes amid growing fears of a U.S. incursion that many believe would only spark more violence.\n\nSheinbaum stressed that “The Mexican people under no circumstances will accept interventions, meddling or whatever other act from abroad that would be harmful to the integrity, independence and sovereignty of the nation.”\n\nTodd Zimmerman, the Drug Enforcement Administration’s (DEA) special agent in Mexico City said during an interview that cartel members are “worried because they know the might and strength of the U.S. military.”\n\nThey know that at any time, they could be anywhere — if it comes to that, if it comes to that — they could be in a car, they could be in a house, and they could be vaporized. They’ve seen it in the Afghan and Iraq wars. So they know the potential that’s out there.\n\nZimmerman said the hope is that the cartels will “step back away from fentanyl, and they’ll just go back to what they’ve always done, which is cocaine and methamphetamine and a little bit of heroin.”\n\nHowever, not everyone is convinced that U.S. military action will stop the cartels from continuing to smuggle fentanyl over the southern border. Elisabeth Malkin, deputy program director for Latin America at the International Crisis Group, told The Times that “A whole constellation of actions are needed: to pursue proper investigations, to create cases that hold up in court, to dismantle whole networks rather than just going after the big drug kingpin, who is paraded before the cameras.”\n\nMike Vigil, former director of the DEA’s international operations, said the idea is “all for show” and that “It’s not going to have an impact.”"
    }
}