{
    "question": "How might Vogue’s decision to feature an AI-generated model influence beauty standards and the future roles of human creatives in the fashion industry?",
    "content": {
        "source_1": "Vogueand Guess are under fire for the label's use of an AI model in an advert within the magazine's latest issue.\n\nIn Vogue's latest issue, atwo-page Guess adfeatures a model sitting at a table while wearing a pale blue romper detailed with creme floral mesh appliqué, and the same model leaning against a wall in a black-and-white chevron-patterned maxi dress, with a coordinating handbag. In fine print in the corner of the ad reads: \"Produced by Seraphinne Vallora on AI.\"\n\nReactions to the use of an artificial intelligence-generated model has been swift. Social media commentary have been harsh, especially toward Vogue, with calls to discontinue support for the magazine.\n\n\"boycott Vogue NOW! they're pushing out models for AI, devaluing hard work and art of real people,\"one user wrote on X. \"Had to end the Vogue magazine subscription I've had for years because the latest magazine used AI models ??? In Vogue? AI models in Vogue?\"another person wrote.\n\nOthers shared disappointment that a real model was not used. \"so many models wanting to appear in vogue, only for them to end up using AI models,\"one person wrote.\n\n\"No actual human being has body proportions naturally like this with that symmetrical of a face and that airbrushed of of skin,\" YouTuber Isabel Brown said in areaction video. \"There already was major societal backlash to magazines trying to make women look completely unattainable and not realistic whatsoever.\"\n\nGuess has yet to post the advertisement on its social media pages. That has not stopped commenters from calling out the clothing companyon other posts.\n\nUSA TODAY has reached out to Vogue and Guess for comment.\n\nThe one company that has come out about the ad is its creator, Seraphinne Vallora. Described as an \"AI-driven\" marketing agency, the company's work has also been seen in Elle, Grazia, the Wall Street Journal, FT Magazine and Harper's Bazaar, according to thecompany's website.\n\n\"Why can't engineers, graphic designers, 3D artists, coders, architect -any kind of creative- build beauty too?\" the company said in a July 27Instagram post.\n\n\"And funnily enough, we actually hire photographers and models as part of our workflow,\" the company added, \"we understand people may think Al will be replacing jobs, but in reality, it's just like any other tool in the design industry and it CREATES jobs, because this images are Al-Driven but made by HUMANS, CREATIVES AND DESIGNERS.\"\n\nH&Mmade headlinesearlier this year when it announced it planned to make digital clones of its models, though it's \"exploring\" how to do so in \"a responsible way.\"",
        "source_2": "What happens when the world’s most respected, self-appointed fashion bible quietly takes a step outside of its traditional aesthetic? Nestled between Anne Hathaway’s immaculate image on the cover ofVogue’sAugust issue and editorials covering female leadership in fashion and the representation of women in sports lies an unassuming two‑page spread for Guess, labelled discreetly “Produced by Seraphinne Vallora on AI.” These six words have caused more upset in the fashion world than Anna Wintour’s recent title change.\n\nAt first glance, the campaign’s flawless, hyper‑symmetrical blond model, sitting with a cup of coffee in one image and leaning against a blue wall in another, looks like all of the other photoshopped ads in glossy publications, treading the line between photorealism and impossible beauty standards. But beneath these uber perfect images of an AI-generated model lies a tectonic shift: the dawn of fully synthetic imagery in the pages of fashion’s most esteemed publication.\n\nParis‑based creative house Seraphinne Vallora created the Guess ad using generative algorithms trained on runway looks, campaign shots and studio lighting setups. The company’s founders, Valentina Gonzalez and Andreea Petrescu, told theBBCthat they were asked to create the AI model for this campaign by Paul Marciano, co-founder of Guess, via a message on Instagram.\n\nBy producing the campaign using AI tools, there was no need for a casting director, green room or a retoucher. In a much shorter space of time than traditional shoots, the AI tools were still used to create a model whose every angle, expression and shadow conformed to an idealized beauty standard. Until recently, these images were only possible after human teams had crafted them over weeks of back‑and‑forth.\n\nVogue’s transparent labeling did little to dull the shockwaves caused by this alternative method of image creation and refinement. Industry insiders and loyal readers alike paused; if AI can manufacture a model this convincingly, what becomes of the humans whose careers, identities and artistry define fashion’s legacy?\n\nWithin hours of the issue’s release, social feeds lit up. Long‑time subscribers announced cancellations; digital forums teemed with the disbelief and outrage of readers who felt somehow duped by this method of image creation. Even die‑hard advocates of technological progress found themselves questioning the trade‑off between efficiency and authenticity.\n\nIn an industry that thrives on storytelling through faces, gestures and moments, however “curated” or manipulated,Vogue’s experiment posed a stark question: can perfectly rendered pixels ever replace the imperfect pulse of “real” life?\n\nThis, in turn, raises deeper questions about artistry, ethics and evolution that this unheralded Guess spread has ignited — questionsVogue’s glossy pages have never before had to answer so directly. Could this be another case of those in power usingAI to introduce automationwhere it is not wanted?\n\nAt its core, theVogue‑Guess spread forced a fundamental question: when a perfectly posed AI-generated model replaces a living, breathing model, what do we lose? On social media and industry forums, the reaction has been visceral. Models and their advocates have sounded the alarm about livelihoods hanging in the balance.\n\n“I can’t help but wonder who really benefits here,\" Dr. Jade McSorley, head of knowledge exchange at theCentre for Sustainable Fashion, said. \"Is this just another way for brands to sell more items? As someone who used to model for e-commerce companies, the personality you bring to images is suddenly diminished alongside the spontaneous, co-creative process we have with the whole creative team (all of whom will be impacted).\"\n\nThat tension between crafting flawless visuals and preserving human agency lies at the heart of the debate. Can an algorithm ever capture the lived stories, cultural nuances and subtle imperfections that give fashion its emotional resonance? Or are we hurtling toward a homogenized ideal that ultimately leaves readers cold?\n\nMatthew Drinkwater, head of innovation at theFashion Innovation Agencyat London College of Fashion, offers a different take: “The panic over AI-generated models says more about our fear of change than the technology itself. Fashion has never been about preserving the status quo. It thrives on disruption. To suggest that AI ‘steals jobs’ is as reductive as claiming digital photography killed fashion photography; it didn’t, it redefined it. AI models won’t erase human talent, they’ll challenge us to rethink what creativity, representation and beauty can look like in the 21st century.”\n\nThis contrast in views highlights that there is no clear “correct” answer to this issue; there are obvious merits to both approaches of image creation for fashion publications. The wider public appears to need some convincing, but things may possibly be a bit clearer for those sitting in the corner offices of fashion brands and industry publications.\n\nIn boardrooms and creative studios, the formula is simple: AI tools can cut campaign costs by upwards of 70% in some cases and shorten lead times from months to days. On one side of this precarious balance sit the CFOs, dazzled by the promise of infinite model permutations and instant asset generation. On the other sit the readers, especially discerning Gen Z audiences who crave analogue textures, real bodies and the subtle flaws that signal human artistry. Stitching those impulses into a coherent strategy is the industry’s great challenge.\n\nOne person with more than a little expertise on this balance isfashion-tech journalistMaghan McDowell. As a former innovation editor atVogue Business, she has the inside track on the perceptions of these new technologies and their capabilities, from both sides of the equation.\n\n“When I hear about controversies like this, my heart really sinks, because there’s always an inevitable conversation about how art that has any impact from AI is inherently bad — and I think that’s simply not true,\" McDowell told me. “But I do think there are bad ways to use it, especially when it’s so new.”\n\n\"In this situation, it looks very much like a traditional photo shoot, print ad, and I think the consumer is not there yet,\" McDowell added. \"Our eyes are not trained to accept that, our brains are not trained to accept that. I think, especially in these early days, any use of consumer-facing AI needs to be disclosed and transparent, not hidden, or not seeming like it’s hidden. Yes, there was an AI disclosure, which was very important, but I don't think that most people would would have seen it.”\n\nIt is also worth noting that this is notVogue’s first foray into AI-generated content. As McDowell explained, several Vogue publications have used AI-generated content in editorial photo shoots or projects. \"I’m thinking ofVogueSingapore,Vogue Italia,Vogue Portugal, who have done legitimate editorial photo shoots that use AI in a way that is more celebrated. And so what we hear about often is when something goes wrong or when something doesn’t land with the public. I think that’s unfortunate, because we don’t talk so much about the more successful uses.\"\n\n“It’s not lost on me that this was a print issue ofVogue, and it’s clear that people still very much do care about print magazines,\" McDowell added. \"It is creating influence, and the conversation is an important one, about the use of AI and creativity.”\n\nAI isn’t just a cost‑cutting measure; it can be a green tool. Fewer on‑site shoots mean less wardrobe waste, lower travel emissions and smaller production footprints. On the consumer side,virtual try‑on experiencespowered by AI avatars can reduce return rates; studies show as much as a 20% drop in e‑commerce returns when shoppers see garments on a model matching their exact measurements. That’s a win for wallets and the planet alike.\n\nVogue’s foray into AI-generated models is more than a provocative ad buy; it’s an inflection point for the entire industry. By confronting the humanity‑algorithm divide, exploring rigorous ethical guardrails and embracing a hybrid future, brands and media can ensure that technology serves creativity, and not the other way around. In that balance lies the next chapter of fashion storytelling.",
        "source_3": "‘This is the direction AI should not be going in,’ one person wrote\n\nI would like to be emailed about offers, events and updates from The Independent. Read ourPrivacy notice\n\nVoguereaders have been left disturbed by the use of an AI model in theprestigious fashion magazine’sAugust issue.\n\nThedouble-page advert, which features a blonde model wearing two different outfits across separate pages, was taken out by the label Guess and “produced” by AI marketing Seraphinne Vallora.\n\nIn one photo, the model sits with a cup of coffee in a light blue floral playsuit. In another, the AI figure leans against a blue wall in a black and white chevron print dress, clutching a matching Guess bag.\n\nReaders were alerted to the fact the model was AI generated through a fine print label that reads: “Seraphinne Vallora on AI”.\n\nSeraphinne Vallora is an agency that designs “editorial level AI-driven marketing campaigns and cinematic videos”. Its work has also been featured inHarper’s BazaarandElle.\n\n“That's disturbing. This is the direction AI should not be going in... wow,” one person wrote in response to the images of the AI model on X/Twitter.\n\n“Great. The new beauty standard will be, literally, unobtainable because it's not real,” another social media user remarked.\n\nOthers were more optimistic about the use of AI: “The future is here. Takes less time and much cheaper to make,” one supporter wrote.\n\nThe Independenthas contactedVogue, Guess and Seraphinne Vallora for comment.\n\nPlus size model Felicity Hayward, who has been in the fashion industry for over a decade, toldThe Independentshe’s concerned for the loss of jobs for creatives involved in model shoots, including makeup and hair artist, set designers, assistants and caterers.\n\nHayward said Vogue’s decision to include the advert was disheartening, adding she worried the practice could undermine years of work towards more diversity in the fashion industry.\n\nThe controversy comes afterOpenAIandVogue’s publisher Condé Nast announced a multi-year partnership that allows content from the magazine to appear in ChatGPT search results.\n\nCondé Nast’s CEO, Roger Lynch, said in an email reported by theNew York Timesthat it was “crucial” for the publisher to “meet audiences where they are and embrace new technologies”.\n\nJoin thought-provoking conversations, follow other Independent readers and see their replies"
    }
}