{
    "question": "How might the executive orders to boost coal—by loosening regulations, accelerating federal leases, and challenging state climate laws—affect U.S. power markets, climate litigation, and the balance of state and federal authority?",
    "content": {
        "source_1": "President orders justice department to stop enforcement of critical policies holding fossil fuel companies accountable\n\nDonald Trumpis taking aim and city- and state-ledfossil fuelaccountability efforts, which have beenhailedas a last source of hope for theclimateamid the president’s ferociously anti-environment agenda.\n\nIn a Tuesdayexecutive order, Trump instructed the Department of Justice to “stop the enforcement” of state climate laws, which his administration has suggested are unconstitutional or otherwise unenforceable.\n\nThe president called out New York andVermont, both of which have passed“climate superfund” lawsrequiring major fossil fuel companies to help pay for damages from extreme weather.\n\n“These State laws and policies are fundamentally irreconcilable with my Administration’s objective to unleash American energy,” the executive order says. “They should not stand.”\n\nHe also targeted the dozens of lawsuits brought by states, cities and counties against big oil in recent years, accusing the industry of intentionally covering up the climate risks of their products and seeking compensation for climate impacts.\n\n“This order is an illegal, disgusting attempt to force everyday people to pay for the rising toll of climate disasters, while shielding the richest people in the world from accountability,” said Aru Shiney-Ajay, the executive director of the youth-led environmental justice group the Sunrise Movement.\n\nThe new order came as Trump touted new moves to revive the coal, the dirtiest and most expensive fossil fuel.\n\nIt also followed a March meeting at the White House where fossil fuel executivesreportedlylobbied Trump to give them immunity from climate litigation. Days earlier, 200 environmental, consumer advocacy and social justice groups hadurged top congressional Democratsto block attempts from big oil to gain legal immunity, the Guardian reported.\n\nOil interests applauded the new move from the president. “Directing the Department of Justice to address this state overreach will help restore the rule of law and ensure activist-driven campaigns do not stand in the way of ensuring the nation has access to an affordable and reliable energy supply,” Ryan Meyers, the senior vice-president of top US fossil fuel lobby group American Petroleum Institute, said in astatement.\n\nBut advocates say the order is an an anti-democratic attack on municipalities’ climate action, which serve acrucial rolein counterbalancing Trump’s anti-environmental agenda.\n\n“Make no mistake: this executive order isn’t about energy independence or economic security – it’s about ensuring billionaire polluters never have to face a jury of ordinary Americans,” said Cassidy DiPaola, the communications director of Make Polluters Pay, which backs the climate superfund laws. “The American people deserve better than a government that protects polluters’ profits over people’s lives.”\n\nFossil fuel companiespoured $96minto Trump’s re-election campaign and affiliated political action committees, as he pledged to roll back environmental regulations and loosen regulations on the industry. This wasless than the $1bnTrump requested from the sector in an infamous meeting at his Mar-a-Lago club last spring, but still constituted record levels of spending.\n\nTrumppledgedto attack climate lawsuits, which he has called “frivolous”, on the campaign trail. And during his first term, his administration filed influential briefs in the casessupportingthe oil companies.\n\nBut environmental lawyers question the validity of the new executive order.\n\n“This illegal and unconstitutional order panders to the biggest polluters on the planet and shows Trump’s utter hypocrisy on states’ rights,” said Jason Rylander, the legal director of the climate law institute at the conservation organization Center for Biological Diversity. “Trying to sic the justice department on state officials who are protecting their people from pollution will fail because the US attorney general has no power to declare state laws illegal.”\n\nIn recent months, rightwing groups havelaunchedcampaignsattempting to shield oil companies from city and state climate accountability. Somehave tiesto Leonard Leo, who is known as a force behind the Federalist Society, which orchestrated the ultraconservative takeover of the American judiciary and helped select Trump’s supreme court justice picks.\n\nA truck parked outside a major fossil fuel conference last month in Houston warned that city and state policies and lawsuits “are threatening America’s pro-consumer energy dominance”, linking to anop-ed from a group with links to Leo. The new executive order echoes this sentiment, saying the litigation and laws “threaten American energy dominance and our economic and national security”.",
        "source_2": "Reporting by Jarrett Renshaw in Philadelphia and Timothy Gardner in Washington; Additional repoting by Susanna Twidale in London; Writing by Susan Heavey; Editing by David Goodman, Marguerita Choy, Barbara Lewis, Matthew Lewis and Stephen Coates\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nTimothy reports on energy and environment policy and is based in Washington, D.C. His coverage ranges from the latest in nuclear power, to environment regulations, to U.S. sanctions and geopolitics. He has been a member of three teams in the past two years that have won Reuters best journalism of the year awards.  As a cyclist he is happiest outside.",
        "source_3": "Trump's order comes as he seeks to boost American energy production and use tariffs as leverage to bring manufacturing and jobs to the United States.\n\nPresident Donald Trump took action on Tuesday to slash regulations and expedite leases for American coal mining, lending a hand to an industry that has been rocked by the push for so-called clean energy.\n\nAppearing at the White House in front of a group of American coal miners, Trump signed the Defense Production Act, vowing to “end the government bias against coal” and “turbo charge coal mining in America.” Trump’s order comes as he seeks to boost American energy production and use tariffs as leverage to bring manufacturing and jobs to the United States.\n\n“We’re slashing unnecessary regulations that targeted the beautiful clean coal,” Trump said. “We will rapidly expedite leases for coal mining in federal lands … and we’ll streamline permitting. We will end the government bias against coal, and we’re going to unlock the sweeping authorities of the Defense Production Act.”\n\n.@POTUS: \"We're slashing unnecessary regulations that targeted the beautiful clean coal. We will rapidly expedite leases for coal mining in federal lands… We'll streamline permitting, we will end the government bias against coal, and we're going to unlock the sweeping…pic.twitter.com/aQHiBZDYVX\n\n— Rapid Response 47 (@RapidResponse47)April 8, 2025\n\nTrump blasted leftist environmental policies accepted by the Biden administration that “killed jobs” and sent prices “soaring.” Last year, former President Joe Biden ended new leases for coal mining companies, arguing that coal leasing has major effects on human health and the climate, NPRreported.\n\n“The Biden energy policy was to put America last … not a good policy. Under my administration, we’re putting America first,” Trump said. “On my first day in office, I terminated the Green New Scam, I declared the National Energy Emergency and withdrew from the unfair, one-sided, and extremely costly to the United States only Paris Climate Accord.”\n\n.@POTUS: The Biden energy policy was to put America last… Under my administration, we're putting America FIRST. On my first day in office, I terminated the Green New Scam, I declared the National Energy Emergency and withdrew from the unfair, one-sided Paris Climate Accord.pic.twitter.com/CLSz9aChU8\n\n— Rapid Response 47 (@RapidResponse47)April 8, 2025\n\nTrump’s move was praised by the National Mining Association, which called it “a stark shift from the prior administration’s punitive regulatory agenda, hostile energy policies and unlawful land grabs.”\n\nThe Trump administration has already been setting the stage for a renewed coal mining push as the Environmental Protection Agency began removing emissions and pollution restrictions on coal plant last month. The Trump administration also approved an expansion of a coal mine in Montana, and the Bureau of Land Management is looking into an emergency lease for coal mining in North Dakota, The Washington Postreported.\n\nA core principle of Trump’s second-term agenda is expanding American energy production, a vision he regularly discussed on the campaign trail.\n\n“We’re going to put the miners back to work,” Trump added on Tuesday. “I’ve said I was going to do this, and I’ve said it loud and clear, and it’s time to do it.”\n\n.@POTUS: \"Today, we're taking historic action to help American workers, miners, families and consumers. We're ending Joe Biden's war on beautiful, clean coal once and for all… we're going to put the miners back to work.\"pic.twitter.com/XSpoHkT11X\n\n— Rapid Response 47 (@RapidResponse47)April 8, 2025\n\nAccording to the Energy Information Administration, U.S. coal output dropped 32% between 2017 and 2024, and only around 175 coal plants still generate a significant amount of electricity in the United States. Wyoming is by far theleadingproducer of coal in the United States, followed by West Virginia, Pennsylvania, Illinois, and Kentucky. The coal industry has also suffered as America has moved to more natural gas production.\n\nYour information could be the missing piece to an important story. Submit your tip today and make a difference."
    }
}