{
    "question": "In what ways could the NWS pause of multilingual weather translations due to the lapsed Lilt contract affect public safety, equity, and decision-making, and what interim solutions might communities and agencies pursue?",
    "content": {
        "source_1": "The National Weather Service is no longer providing language translations of its products, a change that experts say could put non-English speakers at risk of missing potentially life-saving warnings about extreme weather.\n\nThe weather service has “paused” the translations because its contract with the provider has lapsed, NWS spokesperson Michael Musher said. He declined further comment.\n\nLilt, an artificial intelligence company, began providing translations in late 2023, replacing manual translations that the weather service had said were labor-intensive and not sustainable. It eventually provided them in Spanish, Chinese, Vietnamese, French and Samoan. The contract lapse comes as President Donald Trump’s administration is seeking to slash spending in federal agencies, includingcuts within the National Oceanic and Atmospheric Administrationthat have led to high employee vacancy rates at NWS offices.\n\nNOAA referred questions about the contract to a message on its website announcing the contract had lapsed. Lilt did not respond to requests for comment.\n\nNearly 68 million people in the U.S. speak a language other than English at home, including 42 million Spanish speakers, according to 2019 Census data.\n\nNot being able to read urgent weather alerts could be a matter of life or death, said Joseph Trujillo-Falcón, a researcher at the University of Illinois Urbana-Champaign who has worked with NOAA researching how to translate weather and climate information to the public, including the use of artificial intelligence.\n\nHe said translated weather alerts saved lives during adeadly tornado outbreak in Kentucky in 2021.A Spanish-speaking family interviewed afterward said they got a tornado alert on their cellphone in English but ignored it because they didn’t understand it, he said. When the same alert came in Spanish, they quickly sought shelter, he said.\n\nTrujillo-Falcón said weather alerts used to be translated by forecasters that spoke more than one language, a task that could be “completely overwhelming” on top of their forecasting duties.\n\nThe translations are important for more than extreme weather events, said Andrew Kruczkiewicz, a senior researcher at the Columbia Climate School at Columbia University. General weather forecasts are essential for a number of sectors including tourism, transportation and energy. Families and businesses can make more informed decisions when they can get weather information that often includes actions that should be taken based on the forecast.\n\nNorma Mendoza-Denton, a professor of anthropology at the University of California, Los Angeles, said there are many people in the U.S. that function with limited English relevant to their daily routines. For example, a shopkeeper might be able to have short conversations with customers, but might not have the same understanding when it comes to reading weather or climate terminologies.\n\n“If they don’t have access to that National Weather Service information in the different languages, that could be the difference between life and death for somebody,” said Mendoza-Denton.",
        "source_2": "James Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics in Texas, as well as other general news across the United States. James joined Newsweek in July 2022 from LBC, and previously worked for the Daily Express. He is a graduate of Oxford University. Languages: English. Twitter: @JBickertonUK. You can get in touch with James by emailing j.bickerton@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nThe federal National Weather Service (NWS) has announced it has \"paused\" its automated language translation service \"due to a contract lapse\" with translation company LILT. The firm had been translating NWS forecasts, including storm warnings, into Spanish, simplified Chinese and three other languages.\n\nNewsweekcontacted LILT for comment via email on Wednesday outside of regular office hours.\n\nSince assuming office on January 20, the secondDonald Trumpadministration has sought to crack down on illegal immigration and prioritize the English language, with the presidentsigning an executive orderdeclaring English to be the official language of the United States for the first time.\n\nThe Department of Government Efficiency (DOGE) was created under the leadership of tech billionaireElon Muskwith the goal of slashing what they regard as wasteful federal government spending. It has overseen the mass firing of federal employees on their probational periods, though this isfacing legal challenge, and the gutting of the United States Agency for International Development (USAID) which Trump isseeking to close down altogether.\n\nIn an update published on Wednesday, the NWS said: \"Due to a contract lapse, NWS paused the automatic translation services for our products until further notice.\"\n\nThe contract with LILT ended at midnight on Tuesday after the NWS allowed it to expire, according toBloombergNews. Citing \"people familiar with the matter,\" who weren't authorized to speak publicly, the publication said the NWS does not plan to replace LILT with another translation service.\n\nA message on the NWS translation website, which still shows some updates, states: \"The translated text product functionality on this site may be interrupted after 3/31/2025. Further details will be provided when available.\"\n\nThe website initially provided translations into Spanish and simplified Chinese, using AI provided by LILT, and this was later extended to include Vietnamese, Samoan and French.\n\nThe NWS initially signed up for a $5.8 million contract lasting five years with an option to extend each spring. According to Bloomberg, in 2024 it paid just under $1.1 million for the product.\n\nLILT translations had been provided for around 30 cities and metropolitan areas, including Los Angeles and Miami, and covered daily updates as well as storm and flood alerts, hurricane advisories and red flag fire weather warnings.\n\nThe NWS has already reduced thenumber of weather balloon launchesit conducts in response to staff shortages, following a series of departmental cuts overseen by DOGE, sparking safety concerns.\n\nNWS spokesperson Marissa Anderson toldNewsweek: \"Due to the expiration of current contract funding, NWS paused the automated language translation services for our products until further notice. I have nothing further to offer at this time.\"\n\nIn a statement released in October 2023 after the contract was announced, LILT said: \"From day one, LILT has been on a mission to make the world's information available to everyone, irrespective of language. We believe that language should never be a barrier to survival. We could not be more proud and aligned with the National Weather Service to ensure that all people have access to lifesaving weather warnings and forecasts.\"\n\nAt the time, NWS director Ken Graham said:\"This language translation project will improve our service equity to traditionally underserved and vulnerable populations that have limited English proficiency.\n\n\"By providing weather forecasts and warnings in multiple languages, the NWS will improve community and individual readiness and resilience as climate change drives more extreme weather events.\"\n\nIt is unclear at this stage whether the LILT contract expiring is part of a deliberate move to stop translating NWS forecasts and warnings, or whether an alternative means of doing so will be found.\n\nUpdate 4/2/25, 10:37 a.m. ET: This story has been updated with comment from a NWS spokesperson.\n\nJames Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics in Texas, as well as other general news across the United States. James joined Newsweek in July 2022 from LBC, and previously worked for the Daily Express. He is a graduate of Oxford University. Languages: English. Twitter: @JBickertonUK. You can get in touch with James by emailing j.bickerton@newsweek.com\n\nJames Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics in Texas, as well as other general news across the United States. James joined Newsweek in July 2022 from LBC, and previously worked for the Daily Express. He is a graduate of Oxford University. Languages: English. Twitter: @JBickertonUK. You can get in touch with James by emailing j.bickerton@newsweek.com\n\nJames Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics                                    ...Read more",
        "source_3": "The National Weather Service has stopped providing language translations for its products — and experts warn that the change could put non-English speakers’ lives at risk when extreme weather strikes.\n\nThe weather service “paused” the translations because its contract with Lilt, an artificial intelligence company that provided the service, lapsed, NWS spokesperson Michael Musher said.\n\nThe AI company began providing translations in late 2023, replacing the manual interpretations at the NWS that the agency claimed were labor-intensive and not sustainable.\n\nThe company provided translations in Spanish, Chinese, Vietnamese, French and Samoan.\n\nNearly 68 million people in America speak a language other than English at home, including 42 million Spanish speakers, according to the US Census.\n\nJoseph Trujillo-Falcón, a researcher at the University of Illinois Urbana-Champaign, warned that ending translations in multiple languages could have deadly results.\n\nThe researcher, who has worked with the National Oceanic and Atmospheric Administration (NOAA) researching how to translate weather and climate information to the public, noted how the service savedlives in the deadly tornado outbreak in Kentucky in 2021.\n\nA Spanish-speaking family told reporters that they had initially ignored the English warnings on their phone because they couldn’t read them, with the family eventually taking shelter after the alerts came in Spanish.\n\n“If they don’t have access to that National Weather Service information in the different languages, that could be the difference between life and death for somebody,” warned Norma Mendoza-Denton, a professor of anthropology at the University of California, Los Angeles.\n\nAndrew Kruczkiewicz, a senior researcher at the Columbia Climate School at Columbia University, also warned that the lack of translations could have other effects outside of extreme weather events.\n\nUnreliable access to forecasts could alter how millions carry on in their daily lives, which inturn could impact the tourism, transportation, and energy sectors, he warned.\n\nThe contract lapse comes as the Trump administration continues to slash spending in federal agencies, including cuts within the NOAAthat have led to high employee vacancy rates at NWS offices.\n\nThe agency has warned that the overhaul would impact their ability to monitor and predict extreme weather in an age where climate-induced disasters have grown more common."
    }
}