{
    "question": "How could the focus on tailor-made deals and non-tariff barriers influence countries’ responses to the new U.S. tariffs and the broader trajectory of U.S. trade relations?",
    "content": {
        "source_1": "(CNN) –– President Donald Trump’s US Trade Representative Jamieson Greer on Tuesday defended the administration’sexpansive tariffs, saying that its concerns would not be resolved overnight, and in at least one case, the tariffs were about “running up the score.”\n\nGreer’s comments came during a routine hearing with the Senate Finance Committee, which happened in the wake of the stock market’s mass selloff triggered by Trump’s sweeping tariff plan. Starting Wednesday all countries’ goods will be subject to a minimum10% tariff, with rates much higher for 60 countries the administration deems the “worst offenders” in terms of trade barriers.\n\nGreer affirmed that those tariffs will go into effect on Wednesday and said that he’s not concerned with the stock market’s turmoil, which has amounted to trillions of dollars in market value wiped out in just a few days.\n\n“I know everyone’s concerned about Wall Street. I’m just concerned about Main Street,” he said.\n\n“Our large and persistent trade deficit has been over 30 years in the making, and it will not be resolved overnight,” Greer told the Senate Finance Committee during a routine hearing. “But all of this is in the right direction, particularly as we start to negotiate with these countries.”\n\nGreer said the president’s “strategy is already bearing fruit” and that nearly “50 countries have approached me to discuss the President’s new policy and explore how to achieve reciprocity.” He added that “many” of them have signaled that they don’t plan to retaliate against the United States.\n\nDuring the hearing Sen. Ron Wyden of Oregon, the Democratic ranking member of the committee, decried Trump’s sweeping tariffs and said he is introducing a new resolution “to end the latest crop of global tariffs that are clobbering American families and small businesses.”\n\n“The Trump aimless, chaotic tariff spree has proven beyond a doubt that Congress has given far too much of our constitutional power on international trade over to the executive branch,” Wyden said. “It is time to take that power back.”\n\nThroughout the hearing, Greer pointed to the prominent role that so-callednon-trade barriersare playing in Trump’s trade policy, one of them being foreign countries’ regulations that he said are rooted in “fake science.”\n\nGreer told the committee that India has stringent restrictions around imports, which he claimed are based on “fake science” and are being used “to block our imports.” He also pointed to Australia having “barriers to the export of beef from the United States.”\n\nAmerican beef is not officially banned in Australia, but the Australian Bureau of Statistics says that none has been imported into the country since 2005.\n\n“And it’s not just beef,” Greer said. “Australia also blocks on… fake science grounds the export of fresh and frozen US pork, so it’s incredible that they do this. We have zero exports of the fresh and frozen US pork to Australia.”\n\nThe US Department of Agriculturelast year saidthat “the US has reestablished itself as Australia’s primary source of pork imports in the first half of 2024.”\n\nIn a contentious exchange with Sen. Mark Warner of Virginia, Greer said that new tariffs on Australia are warranted despite the country having a $17.9 billion trade surplus with the US, as of 2024.\n\nHe said “that tariffs on Australia are necessary because “we’re addressing the $1.2 trillion deficit, the largest in human history that President Biden left us with, we should be running up the score in Australia.”\n\nAustralia and the US have a free trade agreement in place, but “despite the agreement, they ban our beef, they ban our pork,” Greer said.\n\nWarner said that “the lack of trust from friends and allies based upon this ridiculous policy that goes into full effect at midnight tonight is extraordinary.”\n\nMeanwhile, some Republicans, such as Sen. Marsha Blackburn of Tennessee, praised the administration’s focus on addressing non-tariff barriers.\n\nSeveral Democrats throughout the hearing mentioned the stock market’s decline after Trump announced his tariffs last week. Greer said he’s not concerned about that.\n\nStocks regained some ground Tuesday morning, after they plummeted in the prior three trading sessions. Those declines wiped out trillions in just a few days.",
        "source_2": "The White House is now negotiating trade deals with dozens of countries after President Donald Trump paused the worst of his sweeping tariffs for 90 days, with Vice President JD Vance visiting India this week to kick off negotiations, as foreign countries suggest the pause will give them breathing room to reach deals with the Trump administration.\n\nTrump has pared back his sweeping tariffs on foreign imports after they roiled the stock market and led to global economic chaos, issuing a 90-day pause on its highest tariff rates.\n\nThere is now a 10% baseline tariff rate on most imported goods—rather than the higher rates the Trump administration imposed for many countries’ goods—except for China, whose imports will face anadditional 125% tariff rateon top of existing tariffs (bringing the total rate to 145%), after the country imposed retaliatory tariffs against the U.S.\n\nMore than 75 countries have reached out to the White House to negotiate trade deals, Trump officials have previously said, and economic adviser Kevin Hassetttold“Fox and Friends” last week there are now “offers on the table” with 15 countries—though he declined to specify which—and negotiations are “moving fast.”\n\nJapan’s chief trade negotiator met with the Trump administration last week, with Trumpsayingon Truth Social Thursday they had a “very productive meeting,” as did Italian Prime Minister Giorgia Meloni—a right-wing Trump ally—whosaidat the White House she was “sure” the U.S. and European Union could reach an agreement.\n\nVance has traveled to India to meet with Prime Minister Narendra Modi and the two countries have reached terms of reference to guide their trade negotiations, with the vice presidentsayingin a speech Tuesday that while he thinks the two sides can reach a deal that’s “to the mutual benefit of both” countries, if the U.S. and India don’t “work together successfully, the 21st century could be a very dark time for all of humanity.”\n\nThe Trump administration is planning to prioritize trade deals with Japan and other countries surrounding China, NBC Newsreportedciting an anonymous White House source, also citing negotiations with South Korea and Vietnam as “key priorities.”\n\nBut while the administration has promised “90 deals in 90 days,” no final agreements have yet been reached, and other countries don’t seem to be giving in so easily to the Trump administration’s goal of putting “America first”: Japanese Prime Minister Shigeru IshibasaidMonday his government won’t just give in to what Trump wants—telling the country’s parliament, “If Japan concedes everything, we won’t be able to secure our national interest”—while U.K. Prime Minister Kier Starmer hassaidhe “will only strike a deal if it's in the national interest.”\n\nVance said in a speech from India on Tuesday that the Trump administration is trying to “rebalance global trade” with its tariff negotiations, claiming it “want[s] to partner with people and countries” to create “a system of global trade that is balanced, one that is open, and one that is stable and fair.” According to theGuardian, Vance added: “America’s partners need not look exactly like America, nor must our governments do everything exactly the same way, but we should have some common goals.”\n\nJapan:Trump asked his administration to start negotiations with the Japanese government even before the 90-day pause, and the country’s top trade negotiator visited the White House last week. Ishiba has said his country wouldn’t rush its negotiations, it’s also moving quickly, though trade negotiator Ryosei Akazawasaidlast week the Japanese government will seek to have the tariffs lifted “at the earliest date possible.” No deal was reached during its White House visit, the Japanese governmentsaid, though it plans to hold further talks later in April, and Ishiba said he plans to visit Washington D.C. to meet with Trump “at the most appropriate time.”\n\nIndia:ModisaidMonday about Vance’s visit that he and the vice president discussed the “fast-paced progress” made in India’s trade negotiations with the U.S. so far, adding the two sides are “committed to mutually beneficial cooperation, including in trade, technology, defence, energy and people-to-people exchanges.” The two sides also reached adealfor the terms of their negotiations, which will include negotiating to end various trade barriers—like India’s high tariffs on U.S. agricultural products—and advancing the Trump administration’s “America First trade policy.” VancesuggestedTuesday the U.S. could also start exporting more oil and natural gas to India.\n\nEuropean Union:The EU haspausedits planned retaliatory tariffs after Trump issued his 90-day tariff pause, butannouncedadditional goods Monday that could be taxed if a deal can’t be reached. “We want to give negotiations a chance,” European Commission President Ursula von der LeyensaidThursday, though BloombergreportedTuesday talks between the U.S. and EU have so far made little progress, with anonymous sources reporting European negotiators left a recent meeting “with little clarity” on the Trump administration’s goals for a deal. Europe hoped Meloni would have better luck getting through to the Trump administration than other European officials, whom The New York Timesreportshave had trouble being able to even schedule meeting with White House officials, and Trump said during his meeting with Meloni that “there will be a trade deal, 100%,” between the U.S. and EU.\n\nSouth Korea:Trumpsaidon Truth Social on April 8 he had reached “the confines and probability of a great DEAL for both countries” after having a “great call” with Acting President Han Duck-soo. Negotiations are set to kick off in earnest this week on Thursday,accordingto the South Korean government. Trade officials from the country have said that while Trump’s 90-day pause provides some breathing room, it’s still important for the country to engage in swift negotiations with the U.S., Reutersreports,addingtheir aim is to delay Trump’s tariffs from taking effect in South Korea for as long as possible.\n\nUnited Kingdom:British officials have already been in negotiations with the Trump administration and offered concessions in exchange for Trump lowering his 10% tariffs on the U.K., with Prime Minister Keir Starmer’s officesayingit will continue to “coolly and calmly” negotiate with the White House in light of Trump’s 90-day pause. The PM spoke with Trump on Friday and they discussed the “ongoing and productive” trade talks between the two nations,accordingto Starmer’s office, and Starmer emphasized “free and open trade and the importance of protecting the national interest.” Vice President JD VancetoldBritish website UnHerd last week he believes “there’s a good chance that, yes, we’ll come to a great agreement that’s in the best interest of both countries.”\n\nVietnam:The U.S. and Vietnam have agreed to begin trade negotiations, the country’s governmentsaidApril 10, after Vietnam’s Communist Party sent a letter to the White Houseofferingto remove all tariffs on U.S. goods in hopes of lowering the 46% tax Trump imposed for Vietnamese imports. Chinese President Xi JinpingvisitedVietnam last week and called for stronger ties between the neighboring nations, though ReutersreportsVietnam is largely trying to appease the U.S., including by cracking down on the use of Chinese goods being sent to the U.S. via Vietnam to avoid tariffs. Vietnam Prime Minister Pham Minh Chinh said Tuesday is prepared to have negotiations based on the U.S.’s objectives, Bloombergreports, and said the negotiations should aim to “prevent negative impacts on other markets.”\n\nTaiwan:The Taiwanese government said last week it is now negotiating with the Trump administration and the talks are going “smoothly.” Taiwan previously vowed to increase its investments in the U.S. rather than retaliating against the 32% tariffs Trump initially levied on the country, with foreign minister Lin Chia-lungsayingthe government hopes Trump’s 90-day pause will give some breathing room as Taiwan tries “to take advantage of the huge U.S. market” and “form a Taiwan-U.S. coalition.”\n\nArgentina:Argentine President Javier Milei is a Trump ally who received an award for his libertarian agenda at Mar-a-Lago after the tariffs were announced, the Associated Pressreports, though his government is negotiating the 10% tariffs Trump imposed on Argentine goods. Bessentmet withMilei last week and praised the leader for trying to reduce trade barriers with the U.S., though he did not commit to the U.S. lowering Argentina’s tariffs, tellingBloombergthe country should bring its “A-game” to negotiations.\n\nIsrael:Prime Minister Benjamin Netanyahu visited Trump at the White House prior to the 90-day pause, telling reporters Israel will eliminate its trade deficit with the U.S. “very quickly” and he wants his country to serve as a “model” for how to negotiate with the U.S. on trade. Trump had not announced any commitment to ease the 17% tariffs he levied on Israeli imports prior to Wednesday’s pause, however, though White House economic adviser Peter Navarrosaidthe Trump administration is in active negotiations with the country, and the governmentplansto send delegations to negotiate further.\n\nBangladesh:The Bangladeshi government has asked the Trump administration to pause its 37% tariffs on the country’s goods for three months, Bloombergreports, as the country pledged to “substantially increase” its imports of American products.\n\nCambodia:Cambodia’s commerce ministrysent a letterto the Trump administration pledging to cut tariffs on its U.S. imports from 35% to 5% after Trump levied 49% tariffs on the nation, and the ministrysaidit received a “positive response” from the White House. Trade negotiationsbeganon April 17, according to Cambodian news outlets, though the Cambodian government is alsoreportedlyalso seeking financial help from the Chinese government.\n\nIndonesia:Indonesia’s finance minister toldReutersthat Trump’s 90-day pause will give the country time to negotiate with the White House and come up with a “win-win” agreement for both countries, as the 32% tariff rate the president had initially imposed on Indonesia threatened to reduce their GDP by up to 0.5%. Negotiations began last week and are expected to continue for at least 60 days, the Indonesian governmentsaidApril 18.\n\nLesotho:Trump leviedcrippling50% tariffs on the tiny landlocked African country, whose textile industry provides denim to top American brands like Levi’s. Lesotho’s trade ministertoldBloomberg on April 17 that negotiations are “ongoing” and the country has requested a five-year grace period to adjust to the changes, adding the country “need[s] more time” and is “scrambling for a solution that can work quite quickly.”\n\nAustralia:Australian Prime Minister Anthony Albanese decried Trump’s 10% tariffs on the country as being unfair—given that Australia does not levy any tariffs on U.S. goods—but hassaidthe government would not impose any retaliatory tariffs in response. The governmentsaidit had also turned down an offer from China to “join hands” and fight Trump’s tariffs, preferring instead to “[diversify] our trade around the world.\"\n\nNew Zealand:The country’s government has previously said it will not retaliate against Trump’s 10% tariffs on its exports, with Finance Minister Nicola WillissayingNew Zealand “has enough resilience to withstand” the levy. Prime Minister Christopher Luxonsaidhe was glad to see the pause on Trump’s tariffs, but “it doesn’t change the fundamental premise that we want to advocate very strongly on the world stage for free trade.” New Zealand trade minister Todd McClay said Tuesday the country is not ruling out filing a lawsuit against the Trump administration over the tariffs, according tolocal media, but is not planning to bring litigation at this time.\n\nTrumpsaidon Truth Social on April 17 that “every nation, including China, wants to meet” about his tariffs, though there has been no indication the Trump administration and China have actually started negotiations to ease their trade war. China retaliated against Trump’s 145% tariffs on the country byimposing125% tariffs on imports of U.S. goods. Citing anonymous sources, BloombergreportedApril 16 that Chinese officials want the Trump administration to take “a number of steps” before they’re willing to come to the table. That includes “reining in” comments by Vance after hereferred totrade with China as the U.S. “borrow[ing] money from Chinese peasants to buy the things those Chinese peasants manufacture,” which the Chinese government has slammed as being “ignorant and disrespectful.” China also wants the Trump administration to have a “more consistent” trade position and to appoint a point person for the talks, according to Bloomberg, as well as for the Trump administration to address China’s concerns about the U.S.’ military assistance to Taiwan. The Chinese government also issued astatementMonday saying it could retaliate against any country that hurts China in order to appease Trump, with a spokesperson for the Chinese Commerce Ministry saying, “Appeasement cannot bring peace, and compromise cannot earn one respect.” Trump, for his part, has claimed he’s comfortable with the tariffs remaining where they are until China decides to negotiate, and LeavittsaidTuesday the “ball is in China's court,” claiming, “China needs to make a deal with us. We don't have to make a deal with them.”\n\nIt’s still unclear if Trump administration’s baseline 10% tariff rate on most foreign goods could be lifted, or if it’s is here to stay even as countries negotiate down the higher rates that were put on pause. Trump previously told reporters he thinks the 10% rate is “the floor,” though there could be limited exceptions, though Bessent wouldn’t commit Monday to saying either way whether any country’s tariff rates could go down to zero. “We’ll see. I don’t know what’s going to happen with the negotiations,” BessenttoldBloomberg TV, noting there’s “a whole box of things we’ve got to overcome: tariffs, non-tariff barriers, trade barriers, currency manipulation and subsidization of labor and facilities.”\n\nBessent has not given any specific indication of how long negotiations could take, or if there could be any further extension beyond the 90-day pause if the talks aren’t over by then. JPMorgan Chase chief Jamie Dimon speculated in an interview with Fox Business prior to Trump’s pause that trade deals will not be completed quickly, noting “trade deals are very large and very complex” and “can’t be done overnight.” Hassett suggested on “Fox and Friends” Thursday that the trade negotiations may go quicker than normal trade deals, however,sayinghe’s joked that during the 90-day pause, “We’re going to go around the world in 80 days and then have 10 days of rest.” “That’s the plan,” Hassett added.\n\nTrump levied tariffs on several uninhabited islands or places with only a few residents, such as the Heard and McDonald Islands, an Australian territory that’s primarily inhabited by penguins. It will likely be more difficult for those nations to reach any negotiations about lowering their tariffs down from the 10% blanket rate. Commerce Secretary Howard Lutnickdefendedthe tariffs on those countries Sunday, claiming to CBS News they were necessary or else other countries could try to use them to get around Trump’s tariffs.\n\nTrump’s pause on tariffs comes after his aides had previously claimed the president was not open to making deals, let alone pausing tariffs entirely. “He’s not going to back off,”  Lutnick told CNN after Trump’s tariffs were announced, then telling CBS News, “There’s no postponing [the tariffs taking effect], they’re definitely going to stay in place for days or weeks.” Trump trade adviser Peter Navarro had similarly suggested the tariffs are not up for discussion, writing in anop-edfor the Financial Times, “This is not a negotiation,” even as Trump himself suggested he was willing to make deals hours later. Once the administration changed its tune and began negotiating tariffs, White House press secretary Karoline Leavitt said prior to the tariff pause the president directed his trade team to “have tailor-made trade deals with each and every country that” reaches out to the U.S. to negotiate, while Bessent  said the Trump administration will make “bespoke” deals with each nation.\n\nTrump imposed sweeping tariffs on other countries Wednesday, fulfilling a longtime campaign promise to levy tariffs on foreign goods in an effort to return manufacturing to the U.S. The president’s plan has long been decried by economists, who have warned any tariffs would raise prices for consumers and harm the U.S. economy—a scenario that started playing out after Trump announced his tariffs, asstocks plungedand economistsforecasteda recession could now be on the way. Trump had continued to double down on his economic plan despite the chaos his tariffs have caused prior to issuing his pause, saying Wednesday morning on Truth Social, “BE COOL! Everything is going to work out well.” The president told reporters Monday that while other presidents would not be willing to cause such economic chaos by imposing them, “I don’t mind going through it, because I see a beautiful picture at the end.”",
        "source_3": "FOX Business host Charles Payne discusses how investors are reacting to President Donald Trump's tariffs on 'Kudlow.'\n\nIndonesia and other countries are lining up Tuesday at the negotiating table in hopes of striking deals with the Trump administration over the sweepingreciprocal tariffsannounced against them last week.\n\nThe developments come as European Commission President Ursula von der Leyen spoke with a top Chinese official to push for \"a negotiated resolution to the current situation, emphasizing the need to avoid further escalation.\" President Donald Trump warned yesterday that he would impose anadditional 50% tariff on Chinaif it did not withdraw the recent 34% retaliatory tariffs it announced against the U.S.\n\n\"What is happening now, the world is in turmoil due to the world’s strongest economy country making policies to increase tariffs so high for many countries,\" Indonesia’s President Prabowo Subianto said in Jakarta on Tuesday after his country was hit with a 32% tariff from the U.S., according to the Associated Press.\n\nIndonesia's Chief Economic Minister Airlangga Hartarto reportedly added that the country’s government would not take any retaliatory measures towards the U.S. and has reached out to begin negotiations on the reciprocal tariff policy.\n\nLIVE UPDATES: STOCKS VOLATILE AS TRUMP’S TARIFF NEGOTIATING BEGINS\n\nPresident Donald Trump displays a signed executive order imposing tariffs on imported goods during a \"Make America Wealthy Again\" trade announcement event in the Rose Garden at the White House on April 2.(Andrew Harnik/Getty Images / Getty Images)\n\n\"What America wants is a balancing of the trade balance,\" the AP quoted him as saying. \"We will increase our purchase of American products.\"\n\nMalaysian Prime Minister Anwar Ibrahim, speaking Tuesday at the Association of Southeast Asian Nations’ Investment Conference in Kuala Lumpur, announced his government and others in Southeast Asia will dispatch a delegation to Washington to discuss the tariffs, the AP reported.\n\n\"We do not believe in megaphone diplomacy,\" Anwar reportedly said. \"As part of our soft diplomacy of quiet engagement, we will be dispatching together with our colleagues in ASEAN our officials in Washington to begin the process of dialogue.\"\n\nCHINA REFUSES TO BACK DOWN ON TARIFFS AFTER TRUMP THREATENED TOUGHER MEASURES\n\nPresident Donald Trump holds up a chart of \"reciprocal tariffs\" while speaking at the White House on April 2.(Chip Somodevilla/Getty Images / Getty Images)\n\nThe news agency also reported that India’s foreign minister spoke with Secretary of State Marco Rubio late Monday in hopes of reaching an early conclusion in talks over a bilateral trade deal and that Japan’s prime minister is considering traveling to Washington for direct talks with Trump over the tariffs.\n\nTrump saidMonday in a post on Truth Social that he spoke with Japanese Prime Minister Shigeru Ishiba over the phone and that he is \"sending a top team to negotiate.\"\n\nThe office of European Commission President von der Leyen also said she held a phone call with Chinese Premier Li Qiang \"to discuss the state of EU-China relations, as 2025 marks the 50th anniversary of diplomatic ties.\"\n\nShigeru Ishiba, Japan's prime minister, speaks during a news conference in Tokyo, Japan, on Tuesday, April 1.(Nicolas Datiche/Sipa/Bloomberg via Getty Images / Getty Images)\n\n\"The President underscored the vital importance of stability and predictability for the global economy,\" it said, adding \"The President called for a negotiated resolution to the current situation, emphasizing the need to avoid further escalation.\"\n\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\n\nBy clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time."
    }
}