{
    "question": "How should society govern de-extinction projects like Colossal Biosciences’ dire wolf pups to balance conservation goals with ethical concerns, animal welfare, and potential ecosystem disruptions?",
    "content": {
        "source_1": "Romulus and Remus are doing what puppies do: chasing, tussling, nipping, nuzzling. But there’s something very un-puppylike about the snowy white 6-month olds—their size, for starters. At their young age they already measure nearly 4 ft. long, tip the scales at 80 lb., and could grow to 6 ft. and 150 lb. Then there’s their behavior: the angelic exuberance puppies exhibit in the presence of humans—trotting up for hugs, belly rubs, kisses—is completely absent. They keep their distance, retreating if a person approaches. Even one of the handlers who raised them from birth can get only so close before Romulus and Remus flinch and retreat. This isn’t domestic canine behavior, this is wild lupine behavior: the pups are wolves. Not only that, they’re dire wolves—which means they have cause to be lonely.\n\nThe dire wolf once roamed an American range that extended as far south as Venezuela and as far north as Canada, but not a single one has been seen in over 10,000 years, when the species went extinct. Plenty of dire wolf remains have been discovered across the Americas, however, and that presented an opportunity for a company namedColossal Biosciences.\n\nRelying on deft genetic engineering and ancient, preserved DNA,Colossal scientists deciphered the dire wolf genome, rewrote the genetic code of the common gray wolf to match it, and, using domestic dogs as surrogate mothers, brought Romulus, Remus, and their sister, 2-month-old Khaleesi, into the world during three separate births last fall and this winter—effectively for the first time de-extincting a line of beasts whose live gene pool long ago vanished. TIME met the males (Khaleesi was not present due to her young age) at a fenced field in a U.S. wildlife facility on March 24, on the condition that their location remain a secret to protect the animals from prying eyes.\n\nThe dire wolf isn’t the only animal that Colossal,which was founded in 2021andcurrently employs130 scientists, wants to bring back. Also on their de-extinction wish list is the woolly mammoth, the dodo, and thethylacine, or Tasmanian tiger. Already, in March, the company surprised the science community with the news that it had copied mammoth DNA to create awoolly mouse, a chimeric critter with the long, golden coat and the accelerated fat metabolism of the mammoth.\n\nIf all this seems to smack of P.T. Barnum, the company has a reply. Colossal claims that the same techniques it uses to summon back species from the dead could prevent existing but endangered animals from slipping into extinction themselves. What they learn restoring the mammoth, they say, could help them engineer more robust elephants that can better survive the climatic ravages of a warming world. Bring back the thylacine and you might help preserve the related marsupial known as thequoll. Techniques learned restoring the dire wolf can similarly be used to support the endangered red wolf.\n\n“We are an evolutionary force at this point,” says Beth Shapiro, Colossal’s chief science officer, speaking of humanity as a whole. “We are deciding what the future of these species will be.”The Center for Biological Diversitysuggests that 30% of the planet’s genetic diversity will be lost by 2050, and Shapiro and Colossal CEO Ben Lamm insist that genetic engineering is a vital tool to reverse this. Company executives often frame the technology not just as a moral good, but a moral imperative—a way for humans, who have driven so many species to the brink of extinction, to get square with nature. “If we want a future that is both bionumerous and filled with people,” Shapiro says, “we should be giving ourselves the opportunity to see what our big brains can do to reverse some of the bad things that we’ve done to the world already.”\n\nThe woolly mouse, to a minor extent, and the dire wolves, to ascientifically seismic one, are first steps in that direction. But not everyone agrees. Scientific history is rife with examples of newly introduced species becoming invasive species—the doctrine of unintended consequences biting humans when we played too cute with other animals. An exotic pet escapes and multiplies, decimating native species. A toad brought in to kill off beetles ends up killing off the marsupials that eat the toads. And genetic engineering is still a nascent field. Nearly 30 years afterDolly the sheepwas cloned, the technologystill produces problems in cloned animals, such as large birth size, organ defects, premature aging, and immune-system problems. What’s more, cloning can be hard on the surrogate mother that gestates the cloned embryo.\n\n“There’s a risk of death. There’s a risk of side effects that are severe,” says Robert Klitzman, professor of psychiatry and director of the bioethics master's program at Columbia University. “There’s a lot of suffering involved in that. There are going to be miscarriages.”\n\nStill, Colossal’s scientists believe they are on to something powerful. Matt James, the company’s chief animal officer—who once worked as senior director of animal care at the Dallas Zoo and Zoo Miami, where he managed the welfare of 7,000 animals representing 500 species—felt the significance of the science when Romulus and Remus were just 5 or 6 weeks old. The staff was weighing the little pups, and one of the veterinary techs began singing a song fromThe Little Mermaid.When she reached a point at which she vocalized first up, then down, Romulus and Remus turned her way and began howling in response.\n\n“For me,” James says, “it was sort of a shocking, chilling moment.” These pups were the first to produce a howl that hadn’t been heard on earth in over 10,000 years.\n\nIt takes surprisingly few genetic changesto spell the difference between a living species and an extinct one. Like other canids, a wolf has about19,000 genes. (Humans and mice haveabout 30,000.) Creating the dire wolves called for making just 20 edits in 14 genes in the common gray wolf, but those tweaks gave rise to a host of differences, including Romulus’ and Remus’ white coat, larger size, more powerful shoulders, wider head, larger teeth and jaws, more-muscular legs, and characteristic vocalizations, especially howling and whining.\n\nThe dire wolf genome analyzed to determine what those changes were was extracted from two ancient samples—one a 13,000-year-old tooth found in Sheridan Pit, Ohio, the other a 72,000-year-old ear bone unearthed in American Falls, Idaho. The samples were lent by the museums that house them. The lab work that happened next was painstaking.\n\nCloning typically requires snipping a tissue sample from a donor animal and then isolating a single cell. The nucleus of that cell—which contains all of the animal’s DNA—is then extracted and inserted into an ovum whose own nucleus has been removed. That ovum is allowed to develop into an embryo and then implanted in a surrogate mother’s womb. The baby that results from that is an exact genetic duplicate of the original donor animal. This is the way the first cloned animal, Dolly, was created in 1996.Since then, pigs, cats, deer, horses, mice, goats, gray wolves, and more than1,500 dogshave been cloned using the same technology.\n\nColossal’s dire wolf work took a less invasive approach, isolating cells not from a tissue sample of a donor gray wolf, but from its blood. The cells they selected are known as endothelial progenitor cells (EPCs), which form the lining of blood vessels. The scientists then rewrote the 14 key genes in the cell’s nucleus to match those of the dire wolf; no ancient dire wolf DNA was actually spliced into the gray wolf’s genome. The edited nucleus was then transferred into a denucleated ovum. The scientists produced 45 engineered ova, which were allowed to develop into embryos in the lab. Those embryos were inserted into the wombs of two surrogate hound mixes, chosen mostly for their overall health and, not insignificantly, their size, since they’d be giving birth to large pups. In each mother, one embryo took hold and proceeded to a full-term pregnancy. (No dogs experienced a miscarriage or stillbirth.) On Oct. 1, 2024, the surrogates birthed Romulus and Remus. A few months later, Colossal repeated the procedure with another clutch of embryos and another surrogate mother. On Jan. 30, 2025, that dog gave birth to Khaleesi.\n\nRead more:The Science Behind the Return of the Dire Wolf\n\nDuring their pregnancies, the mama hounds were kept at Colossal’s animal-care facility, where they were regularly monitored and given weekly ultrasounds by staff scientists and veterinarians. All three wolves were born by planned cesarean section to minimize the risk of birthing complications. A four-person team performed the surgery and lifted out the pups; four more attendants cleaned and swaddled the newborns while the surgical team looked after the mother as she emerged from anesthesia.\n\n“We elected to put both pups with the surrogate who was displaying the best maternal instincts,” says James. “That reintroduction occurred just about two or so hours after birth, and she immediately began caring for them and allowing them to nurse.”\n\nThe pups fed from the surrogate for just a few days, after which the Colossal team removed them and bottle-fed them because the surrogate was actually becoming too attentive—disrupting the pups’ regular sleeping and feeding schedules. They were weaned at eight weeks and have been living the lives of healthy young dire wolves since then.\n\n“The idea that we could just take a vial of blood, isolate EPCs, culture them, and clone from them, and they have a pretty high cloning efficiency, we think it’s a game changer,” says George Church, Colossal co-founder, and professor of genetics at both Harvard University and the Massachusetts Institute of Technology. The less invasive cell-sampling process will make the procedure easier on animals, and the fact that Colossal’s methods worked on this early go-round boosts company confidence that they are on track for much broader de-extinction and rewilding.\n\nSince their births, the dire wolves have lived on a 2,000-acre ecological preserve at a location in the U.S. that Colossal also keeps secret to protect the animals; the grounds are much larger than the relatively small enclosure TIME visited. The 2,000 acres are surrounded by a 10-ft. fence and include a smaller six-acre site with a veterinary clinic, an extreme-weather shelter, and natural dens where the wolves can satisfy their innate desire for a secure retreat. A staff of veterinarians looks out for the animals around the clock.\n\nThe wolves are fed a diet of beef, horse, and deer meat as well as liver and other offal, along with puppy chow to provide vital nutrients. When they were just weaned, the meat was served pureed, which is similar to the partially digested meat a mother will regurgitate to feed her young. Now the food is presented whole so the wolves can tear it apart as they would if they had hunted it down. So far they have not actually killed any small, live prey that may have ventured into their enclosure.\n\n“We have not seen them attempt to hunt any live prey, and we do not provide live prey,” says Paige McNickle, Colossal’s manager of animal husbandry. “But if I were a deer I would stay away from their preserve.”\n\n“I think they are the luckiest animals ever,” says Shapiro. “They will live their entire life on this protected ecological reserve, where they have all sorts of space. These animals were hand reared. They’re not capable of living in the wild, and we want to study them for their lives and understand how these edits might have modified things that we can’t predict. They’re not going to be able to get a splinter without us finding out.” So far nothing worrisome or unexpected has turned up in the wolves.\n\nThe effort to produce a woolly mammothis on something of a tight schedule. The woolly mice gestated fast, popping out into the world after a pregnancy of20 days. The wolf pupstook just 65 daysto bake. Asian elephants—the extinct woolly mammoth’s closest surviving kin—require 22 months, the longest gestation period of any mammal.\n\nAnd this genetic transformation will involve even more than the one that created the wolves. “We were originally talking about editing about 65 genes,” says Lamm. “We’re now talking about 85 different genes, and some of those will have multiple [functions] like cold tolerance—which includes additional subcutaneous fat layers and their shaggy coat.” As with the dire wolves, no ancient mammoth DNA will be spliced into the elephant’s genome; the elephant genes will simply be rewritten to match the mammoth’s. The company says it has so far edited 25 of those genes, and is “on track for our embryos to be ready for implantation by the end of 2026,” to meet its goal of a calf being born in 2028.\n\nNo matter how the resulting woolly baby might look, Colossal admits that in some respects it will be a mammoth in name only. “They’re elephant surrogates that have some mammoth DNA to make them re-create core characteristics belonging to mammoths,” says Shapiro.\n\nBut that might be a distinction without a difference. If it looks like a mammoth and behaves like a mammoth and, if given the opportunity to breed with another engineered elephant with mammoth-mimicking DNA, produces a baby mammoth, it’s hard to say that the species hasn’t been brought back from the dead. “Our mammoths and dire wolves are mammoths and dire wolves by that definition,” says Shapiro. “They have the key traits that make that lineage of organisms distinct.\"\n\nThe question then becomes what to do with the mammoth you’ve made once it’s at large in the world—a question that bedevils all of Colossal’s work. Shapiro might not be wrong when she says Romulus, Remus, and Khaleesi are lucky wolves, at least in terms of the round-the-clock care, feeding, and love they will receive throughout their lives, but those lives will also be limited.\n\nWolf packs can, on occasion, be as small as two members, but typicallyinclude 15 or more. What’s more, the animals’ hunting territory can range anywhere from50 to 1,000 sq. mi. Against that, Colossal’s three dire wolves spending their entire lives in a 2,000-acre preserve could be awfully lonely and claustrophobic—not at all the way wild dire wolves would live their lives.\n\nAlready, Romulus, Remus, and Khaleesi are exhibiting behaviors that would serve them well in the wild but do little for them in semicaptivity. They began howling when they were just 2 weeks old, and early on began stalking—hunting leaves or anything that moved. They also exhibited wolflike caution, running to hide in dark places if they were surprised or alarmed.\n\n“From day one they have always behaved like wolves and have rarely shown doglike behavior,” says McNickle. So far, the wolves have never menaced any humans, but a risk does exist. Colossal is thus being careful. “Our protocols ensure that people are never in a situation where the wolves might be frightened or become aggressive toward their caretakers,” she says.\n\nWhether later dire wolves Colossal might create can ever live beyond the preserve is open to question. Rick McIntyre, a retired wolf researcher with the U.S. National Park Service and a Colossal adviser, warns that dire wolves vanished in the first place because they were specialized hunters, preying on huge animals like the mammoth and the 3,500-lb.Ice Age bison. When those beasts died out, so did dire wolves.\n\n“My guess is that they specialized in dealing with the very large megafauna of the Ice Age, whereas I would say that gray wolves are a bit more of a generalist,” says McIntyre. “We see gray wolves catch voles, ground squirrels, marmots, all the way up to the 2,000-lb. bull bison. A general principle in wildlife is that it’s good to be flexible. The more that you specialize, that can hurt you in the long run.”\n\nThe mammoth creates even greater challenges. Elephants are exceedingly intelligent, exceedingly social creatures, gathering inherds of up to 25 individuals. Sometimes, those groups combine in much larger clans of up to 1,000 animals around a vital resource like a watering hole. In the wild, the animals will travel up to 40 miles a day in search of food and water—and that’s only average. Sometimes their daily wanderings may cover 125 miles. No one knows if mammoths would exhibit the same social and exploratory needs, but if they do, confining one or even a few individuals to an enclosure like the dire wolves’ would amount to a sort of near-solitary confinement.\n\n“I really feel that bringing back one or even five woolly mammoths is not a good idea,” says Stephen Latham, director of the Interdisciplinary Center for Bioethics at Yale University. “A single woolly mammoth is not a woolly mammoth leading a woolly mammoth life with a woolly mammoth herd.”\n\nJust as important as Colossal’s missionto restore extinct species is its efforts to stop endangered ones from winking out entirely. At the same time the company’s scientists are bringing back the dire wolf, for example, they are attempting to save the red wolf. Once common across the U.S. Southeast, red wolves began dying out because of habitat loss and predator-control programs that targeted the animal for elimination. In the 1960s, the U.S. Fish and Wildlife Service introduced a captive-breeding program to save the species and preservethe role it plays in the larger ecosystem: keeping populations of deer in check, which prevents them from overgrazing, as well as controlling populations of smaller prey like raccoons and opossums, which menace native birds. Ultimately, the program produced 250 individuals, released mainly in North Carolina, but today fewer than 20 survive, most of the others having been claimed by poaching and car strikes.\n\nColossal aims to turn that around. Along with its news about the dire wolves, the company also announced that it had cloned four red wolves—a small but important step in fortifying the species as a whole. With so few individuals remaining, the species suffers from what is known as a “genetic bottleneck,” a lack of diversity in the genome that can lead to infertility and inherited birth defects. What is needed is a way to refresh the gene line with new DNA, and science may have a way.\n\nIn the days before advanced genomics, conservationists identified all species—including the red wolf—principally by their phenotype, or appearance. Plenty of wolves that did not fit the right size or color for the red wolf might have been carrying what researchers refer to as “ghost alleles”—or red wolf gene variations that did not show up in the wolves’ color, size, or shape. Recently, Bridgett vonHoldt, a Colossal scientific adviser and an associate professor of ecology and evolutionary biology at Princeton University, and Kristin Brzeski, an associate professor of wildlife science and conservation at Michigan Tech, discovered populations of canids along the coasts of Louisiana and Texas whose DNA included both coyote genes and red wolf ghost alleles. The four red wolves the Colossal scientists created used that natural genetic reservoir to produce what they call the first Ghost Wolf, with an eye to eventually fortifying the red wolf species with more such young carrying a variety of genes.\n\nRead more:The Science Behind the Return of the Dire Wolf\n\nThe cloned red wolves now live in a separate fenced area within the same 2,000-acre preserve as the dire wolves. Like Romulus, Remus, and Khaleesi, they will spend their lives there and not be rewilded. But later red wolves might be, as Colossal learns more about the clones’ health and fitness. The company says it’s in advanced discussions with the state of North Carolina about “conservation tools that can be used to help rescue the red wolf and accelerate its recovery.”\n\n“It’s the lost genetics of the world’s most endangered wolf,” says James. “And we now have the opportunity to use our cloning and genetic-engineering tools to be able to confer that genetic diversity back into the recovery of the species.”\n\nSimilar science might work to save the northern quoll, a small, carnivorous marsupial native to Australia. Quolls are threatened by the cane toad,which was introduced to Australiain 1935 in an attempt to control beetle pests that were devouring sugarcane roots. The experiment failed, with the toads showing no particular appetite for the target insects, all the while doing a fine job of feasting on other insect prey, and becoming an invasive species themselves. Quolls, in turn, prey on the toads—but often lose their lives in the process because of a toxin that the toads carry on their skin, pushing the little marsupial to the edge of extinction. Through their work trying to bring back the extinct thylacine, or Tasmanian tiger, one member of the marsupial family that includes the quoll, Colossal scientists have identified a single change in a single nucleotide—a basic building block of DNA and RNA—that could confer a 5,000-fold resistance to the cane toad neurotoxin.\n\n“We as humanity introduced this cane toad species. We as humanity are now inadvertently killing off the quoll as well as other marsupials,” says Lamm. “This one change can make these super quolls that can love eating cane toads. Those are the types of wins that we can get using these genetic technologies.”\n\nSo far, Colossal has mostly successeson its tote board. No animals have yet been rewilded, but though the woolly mouse and dire wolves are the first edited animals that have come from the labs, both represent progress. Still, scientists not affiliated with the company stress that genetic engineering is head-crackingly complex, and all manner of unintended downstream consequences can occur when you start mucking around in the engine room of the cells.\n\n“There’s a phenomenon called pleiotropy in which one gene has an effect on more than one trait,” says Alison van Eenennaam, professor of animal biotechnology and genetics at the University of California, Davis. “That’s true for many, many, many genes. There could be some genes they’re targeting for specific traits that have effects that are not compatible with survival.”\n\nEven if Colossal gets the gene editing right, the business of gestating the desired young could present other obstacles. Cloning of livestock still results in more misses than hits. “You get high rates of perinatal and pregnancy loss,” says van Eenennaam.\n\nThen, too, there’s always the possibility that a precious handful of de-extincted animals could run riot in the modern world. The cane toad’s transition from pest eater to invasive species is a reminder of how quickly human intrusion into wild processes can spin out of control. Bioethicist Latham points to mosquito control as one more concerning example.\n\n“There are a number of efforts to genetically modify mosquitoes so that they will have mass die-outs or so that they won't be able to carry particular diseases like dengue or malaria,” he says. “I worry about our losing control of some of those efforts, because mosquitoes—even though they carry diseases that are bad for people—occupy a niche in ecology, in that they’re eaten by certain kinds of birds.”\n\nThere’s precedent for this kind of genetic hegemony beyond the cane toad.Asian carp, introduced into the U.S. in the 1970s by the aquaculture industry, are overwhelming the Great Lakes, crowding out other species.Burmese pythons, imported to the U.S. as exotic pets, have established a similar invasive niche in the Everglades, released there by owners who tired of caring for them.\n\nColossal scientists are pressing ahead nonetheless, and the company is already thriving in an adaptive niche of its own—not just as a scientific enterprise, but as a formidable business. It has reached decacorn status, currently valued at $10.2 billion, and while it may not be easy to monetize a mammoth or a dodo or a dire wolf pup, Lamm sees plenty of commercial potential in the technologies his scientific team is developing. Colossal has spun off two new companies so far. One, calledBreaking, uses engineered microbes and enzymes to break down plastic waste. The other,Form Bio, provides AI and computational biology platforms for drug development. And none of that touches Colossal’s core expertise in cellular and genetic engineering, which has uncounted applications in the biomed domain, including treating and preventing diseases. “Those genome-engineering technologies alone are worth tens of billions of dollars,” says Lamm.\n\nColossal does not have the field to itself—even if it is currently the most conspicuous player.Revive & Restore, a California-based conservation organization, provides funding for projects worldwide involvingde-extinction,increasing biodiversity, andsaving endangered species. Another group,Rewilding Europe, is providing support to scientists working to preserve and restore species across the European continent, including the bearded vulture, the Iberian lynx, the marbled polecat, the imperial eagle, and theauroch—the extinct ancestor of domestic cattle. But they are small compared with Colossal. In 2024, Rewilding Europe disbursed 20 million euros to support rewilding efforts across Europe. Revive & Restore, founded in 2012, hasso far raised $40 millionto support similar conservation efforts. Lamm sees both groups as partners rather than competitors in the shared goal of conservation.\n\nRomulus, Remus, and Khaleesi, of course, are going about their young lives unaware of the groundbreaking science behind their births and the promise they represent. During TIME’s visit, Romulus and Remus gamboled about their enclosure, gnawing on bark they had found on the ground while keeping a discreet distance from the gawking humans.\n\n“They have different personalities,” says McNickle. “Romulus was a very brave pup and the first to go exploring on his own even when he was just a few days old. Remus was much more reserved and would follow Romulus’ cues. As they are growing up, Remus has become the more confident of the two and the first to explore new things and new areas.”\n\nWhether the existing dire wolves or others Colossal might produce will be allowed to mate and spawn a next generation of wolves naturally is not yet known. Handlers can monitor the female estrous cycles and separate the animals at key times or employ contraceptive implants that keep the wolves from producing young until it is determined whether they have any abnormalities that could be passed on.The MHA Nationtribes (Mandan, Hidatsa, and Arikara) have expressed a desire to have dire wolves live on their lands in North Dakota, a possibility Colossal is studying.\n\nIf the company succeeds in its mission to save existing animals from extinction and restore ones that walked the world well before the rise of the humans, Romulus, Remus, and Khaleesi will be long remembered. One species, our own, is increasingly crowding out the millions of others that call the planet home, and Colossal is working to claim the power to reverse that—at least a little.\n\n“I think of that famous Teddy Roosevelt quote,” says James, paraphrasing the 26th President. “In the moment of any choice, the first thing to do is the right thing. The next thing to do is the wrong thing. The worst thing to do is nothing at all.”",
        "source_2": "Dire wolves wentextinctaround 12,000 years ago, at the end of the last ice age. Weighing around 150 pounds, they were about twice the size of today's gray wolves. Dire wolves roamed both North and South America, preying on ancient horses, camels, sloths, and bison.\n\nColossal Biosciences, the private company aiming to bring back from extinction thewoolly mammoth,announcedtoday that it had produced three dire wolf pups using genetic editing and cloning. The researchers at the company extracted andsequenced the genomesof dire wolves from a 13,000-year-old tooth from Ohio and a 72,000-year-old skull from Idaho. The researchers then made 15 key edits in gray wolf genomes to more closely match the genomes of dire wolves. The nuclei of the edited cells were then inserted into the enucleated dog eggs that were installed in the wombs of surrogate mother dogs. The result was the birth of four dire wolf pups (one died 10 days after birth).\n\nThe two six-month-old male pups are named Romulus and Remus, after the founders of Rome who were raised by wolves. The two-month-old female is Khaleesi, atitlefromGame of Thrones. The new dire wolves have thick white coat and are bigger than gray wolves, with more powerful shoulders, wider heads, larger teeth and jaws, and more muscular legs.\n\nCurrently, the wolves are living on a private 2,000-acre facility at an undisclosed location in the northern United States. Some native nations have expressed interest in eventually providing land where dire wolves can once again roam freely.\n\nColossal Biosciences continues its work to bring woolly mammoths, dodos, and the Tasmanian wolves back from extinction.\n\nStart your day withReason. Get a daily brief of the most important stories and trends every weekday morning when you subscribe toReason Roundup.\n\nNEXT:Trump’s Tariffs Violate the Constitutional Separation of Powers",
        "source_3": "Scientists are playing God once again, and although they may have recently achieved something admittedly cool, it’s all but doomed to backfire in the worst possible ways.\n\nBiotech company Colossal BiosciencesannouncedMonday that they have revived an extinct dire wolf species using “meticulously reconstructed” DNA from fossils that date back to 11,500 and 72,000 years. The company is calling the two wolves, aptly named Remus and Romulus in a nod to the myth of ancient Rome’s origins, the world’s first “de-extinct animals.”(Subscribe to MR. RIGHT, a weekly newsletter about modern masculinity)\n\nSOUND ON. You’re hearing the first howl of a dire wolf in over 10,000 years. Meet Romulus and Remus—the world’s first de-extinct animals, born on October 1, 2024.\n\nThe dire wolf has been extinct for over 10,000 years. These two wolves were brought back from extinction using…pic.twitter.com/wY4rdOVFRH\n\n“This moment marks not only a milestone for us as a company but also a leap forward for science, conservation, and humanity. From the beginning, our goal has been clear: ‘To revolutionize history and be the first company to use CRISPR technology successfully in the de-extinction of previously lost species,'” the companywroteon X. “By achieving this, we continue to push forward our broader mission on—accepting humanity’s duty to restore Earth to a healthier state. But this isn’t just our moment—it’s one for science, our planet, and humankind.”\n\nI have to admit that, on a superficial level, the idea of elusive dire wolves returning to Earth’s ecosystem is fascinating, But I have a deep mistrust of scientists who want to tinker or mess with complex systems like nature, just as I have a deep mistrust of government officials who think they can centrally plan a utopia economy.\n\nThe dire wolf experiment is probably going to backfire in ways that cannot be foreseen in the immediate moment. Just like researchersplaying around with virusesin Wuhan. You never know what sorts of complications might arise from introducing a new species, let alone if/when these genetic technologies are ever seriously applied to human beings.(RELATED: Virologists Who Downplayed ‘Lab Leak Theory’ Call Out Dangerous Research In Wuhan — Five Years Too Late)\n\nDo we really want to live in a world in which humans are genetically modified like grapes in a grocery store? Are we to sacrifice our natural humanity to maybe, just maybe, “fix” genetic flaws? I don’t think so.\n\nScientists have too much hubris. And yes, science may have led to life-saving technologies that have benefited mankind, but for every technology that has improved civilization, there is a technology like social media that stands to ruin it.\n\nSign up for John Loftus’s weekly newsletter here!Follow John Loftus on X:@JohnCFLoftus1"
    }
}