{
    "question": "What are the implications of the IDF’s fatal shooting of a 14-year-old Palestinian-American—whom it said was throwing rocks and endangering motorists—for rules of engagement, accountability, and the protection of minors in the West Bank?",
    "content": {
        "source_1": "The funeral of 14-year-old Palestinian-American Amir Mohammed Rabee was held Monday in the Israeli-occupied West Bank, one day after the dual national from New Jersey was shot and killed there.Two other teenage boys, one whose family told CBS News he is also a U.S. citizen, were shot but survived.\n\nRabee's father told CBS News on Monday that his son's siblings live in the U.S., but that Amir and his parents were living in Turmus Ayya, in the central West Bank, where the teenager was attending school.\n\nThe Israel Defense Forces said in a statement that IDF soldiers had \"identified three terrorists who hurled rocks toward the highway, thus endangering civilians driving. The soldiers opened fire towards the terrorists who were endangering civilians, eliminating one terrorist and hitting two additional terrorists.\"\n\nAlong with its statement, the IDF released a 10-second video clip that appears to show three people throwing items. The people are not identifiable in the grainy video.\n\nRabee's father said his son cannot be identified in the video, and he believes the three teenage boys were shot while throwing stones at an almond tree.\n\n\"The video they [IDF] published is not right, and no one can prove my son was there,\" Rabee's father told journalists on Monday. \"Unfortunately, the U.S. embassy believed the Israeli narrative based on unclear video, but the U.S. embassy turns a blind eye on videos filmed by people and journalists ofsettler violence— killing, burning and stealing, guarded by the IDF.\"\n\nCBS News asked the U.S. Embassy in Jerusalem about the incident and Rabee's father's claim that American officials had accepted the Israeli military's explanation of the shooting; the embassy said it had referred the query to the U.S. State Department. A State Department spokesperson offered condolences to the family and said the U.S. was aware of the IDF's statement, but said out of respect for the family's privacy would have no other comment at this time.\n\nRabee's father said it appeared his son had been shot with two different guns, and that two bullets had entered his heart, two had struck his head, two had hit his shoulders, and then five others had hit his body.\n\nAsad Ayub Ahed, the other 14-year-old U.S. national who was shot alongside Rabee and al-Rahman, was still in a hospital in serious condition on Monday.\n\nThe incident came as Israeli Prime Minister Benjamin Netanyahu traveled to Washington with plans tomeet at the White Houseon Monday with President Trump.\n\n\"We have to… send a message for President Trump to at least stop this situation,\" Rabee's father told CBS News. \"Stop sending weapons to kill.\"\n\nAnother American, U.S.-Turkish dual nationalAysenur Ezgi Eygi, was killedin the West Bank in September. Witnesses, her family, and the group Eygi had joined at a protest in the occupied Palestinian territorysaidshe was shot in the head by an Israeli sniper as she stood under a tree in the West Bank city of Nablus. The IDF said an initial inquiry into Eygi's death \"found that it is highly likely that she was hit indirectly and unintentionally by IDF fire which was not aimed at her.\"\n\nSaed Hawari and Omar Abdulkader contributed to this report.\n\nHaley Ott is the CBS News Digital international reporter, based in the CBS News London bureau.",
        "source_2": "Reporting by Ali Sawafta, writing by Hatem Maher; Editing by Chizu Nomiyama and Nick Zieminski\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nFugitive pro-Russian businessman Ilan Shor has offered Moldovans monthly payments of $3,000 to join anti-government protests, in a bid to undermine Moldova's pro-European government ahead of parliamentary elections next month.\n\nReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.\n\nAccess unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.\n\nBrowse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.\n\nScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.\n\nAll quotes delayed a minimum of 15 minutes.See here for a complete list of exchanges and delays.",
        "source_3": "An American teen who moved fromNew Jerseyto the West Bank was shot and killed by Israeli troops who said they were targeting “terrorists” throwing rocks at cars.\n\nAmer Mohammad Saada Rabee, a 14-year-old US citizen whose family moved from Saddle Brook when he was in elementary school, was shot along with two other teens in Turmus Ayya in the West Bank on Sunday, the Bergen Record reported.\n\nTheIsrael Defense Forces (IDF)said troops opened fire on “three terrorists who were throwing rocks at a highway with civilian vehicles.”\n\n“The soldiers opened fire toward the terrorists who were endangering civilians, eliminating one terrorist and hitting two additional terrorists,” the statement said.\n\nRabee was detained before he was declared dead, with relatives saying his body was returned to his parents with multiple bullet holes.\n\nMourners gathered Sunday at the Palestinian American Community Center in Clifton, where Rabee’s uncle, Saleh Rabee, is a board member.\n\nבמהלך פעילות מבצעית של לוחמים מיחידה 636 במרחב תורמוסעייא שבחטיבת שומרון, הכוח זיהה שלושה מחבלים אשר יידו סלעים לעבר כביש מהיר עם רכבים אזרחיים.הלוחמים ירו לעבר המחבלים שהיוו סכנה על האזרחים, חיסלו אחד מהם ופגעו בשני המחבלים הנוספים.כוחות צה״ל ימשיכו לפעול בהגנה ובהתקפה…pic.twitter.com/gqeasTE2HC\n\n“Amer was shot by Israeli military officers along with two other 15-year-olds from the village,” the center said in a statement.\n\n“Amer’s death was entirely preventable and horrifically unjust. He was a child, a 14-year-old boy, with an entire life ahead of him.”\n\nRabee moved from Saddle Brook to the West Bank when he was in elementary school, according to the Record.\n\nThe teen’s death comes as tensions remain high in the occupiedWest Bank, where violence has flourished ever since Hamas launched its attack on Israel on Oct. 7, 2023.\n\nThe Palestinian American Community Center also called on US officials to investigate Amer’s killing, saying the nation “has a duty to protect and bring justice to its citizens.”\n\n“We are united in grief,” the center wrote in a statement, “but also in our collective hope for a future where such atrocities no longer occur and where justice prevails for all.”"
    }
}