{
    "question": "How might the Supreme Court’s ruling—allowing temporary use of the Alien Enemies Act while requiring due-process hearings and Texas-based challenges—shape the administration’s deportation efforts and migrants’ ability to seek relief?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nVenezuelan migrants deported from the United States peer through their plane window as they arrive at Simon Bolivar International Airport in Maiquetia, Venezuela, Monday, March 24, 2025. (AP Photo/Ariana Cubillos)\n\nVenezuelan migrants deported from the United States peer through windows of an Eastern Airlines plane upon arriving at Simon Bolivar International Airport in Maiquetia, Venezuela, Sunday, March 30, 2025. (AP Photo/Cristian Hernandez)\n\nIn this photo provided by El Salvador’s presidential press office, prison guards transfer deportees from the U.S., alleged to be Venezuelan gang members, to the Terrorism Confinement Center in Tecoluca, El Salvador, Sunday, March 16, 2025. (El Salvador presidential press office via AP)\n\n▶ Follow live updates onPresident Donald Trump and his administration\n\nWASHINGTON (AP) — TheSupreme Courton Monday allowed the Trump administration to use an 18th centurywartime lawtodeport Venezuelan migrants, but said they must get a court hearing before they are taken from the United States.\n\nIn a bitterly divided decision, the court said the administration must give Venezuelans who it claims are gang members “reasonable time” to go to court.\n\nBut the conservative majority said the legal challenges must take place in Texas, instead of a Washington courtroom.\n\nThe court’s action appears to bar the administration from immediately resuming the flights that last month carried hundreds of migrants to a notorious prison in El Salvador. The flights came soon after President Donald Trump invoked the Alien Enemies Act for the first time since World War II to justify the deportations under a presidential proclamation calling theTren de Aragua gangan invading force.\n\nThe majority said nothing about those flights, which took off without providing the hearing the justices now say is necessary.\n\nIn dissent, the three liberal justices said the administration has sought to avoid judicial review in this case and the court “now rewards the government for its behavior.” Justice Amy Coney Barrett joined portions of the dissent.\n\nJustice Sonia Sotomayor said it would be harder for people to challenge deportations individually, wherever they are being held, and noted that the administration has also said in another case before the court that it’s unable to return people who have been deported to the El Salvador prison by mistake.\n\n“We, as a Nation and a court of law, should be better than this,” she wrote.\n\nThe justices acted on the administration’s emergency appeal after the federal appeals court in Washington left in place an order temporarily prohibiting deportations of the migrants accused of being gang members under the rarely used Alien Enemies Act.\n\n“For all the rhetoric of the dissents,” the court wrote in an unsigned opinion, the high court order confirms “that the detainees subject to removal orders under the AEA are entitled to notice and an opportunity to challenge their removal.”\n\nThe case has become aflashpointamid escalating tension between the White House and the federal courts. It’s the second time in less than a week that a majority of conservative justices has handed Trump at least a partial victory in an emergency appeal after lower courts had blocked parts of his agenda.\n\nSeveral other cases are pending, including over Trump’s plan to deny citizenship to U.S.-born children of parents who are in the country illegally.\n\n“The Supreme Court has upheld the Rule of Law in our Nation by allowing a President, whoever that may be, to be able to secure our Borders, and protect our families and our Country, itself. A GREAT DAY FOR JUSTICE IN AMERICA!” Trump wrote on his Truth Social site.\n\nThe original order blocking the deportations to El Salvador was issued by U.S. District JudgeJames E. Boasberg, the chief judge at the federal courthouse in Washington.\n\nAttorneys from the American Civil Liberties Union filed the lawsuit on behalf of five Venezuelan noncitizens who were being held in Texas, hours after the proclamation was made public and as immigration authorities were shepherding hundreds of migrants to waiting airplanes.\n\nACLU attorney Lee Gelernt said the “critical point” of the high court’s ruling was that people must be allowed due process to challenge their removal. “That is an important victory,” he said.\n\nBoasberg imposed a temporary halt on deportations and also ordered planeloads of Venezuelan immigrants to return to the U.S. That did not happen. The judge held ahearinglast week over whether the government defied his order to turn the planes around. The administration has invoked a “state secrets privilege” and refused to give Boasberg any additional information about the deportations.\n\nTrump and his allies have called for impeaching Boasberg. Ina rare statement, Chief Justice John Roberts said “impeachment is not an appropriate response to disagreement concerning a judicial decision.”\n\nAssociated Press writer Lindsay Whitehurst contributed to this report.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "The US Supreme Court has cleared the way for President Donald Trump to use a rarely-invoked wartime powers law to rapidly deport alleged gang members - for now.\n\nA lower court had temporarily blocked the deportation of alleged Venezuelan gang members to El Salvador on 15 March, ruling that the actions under the 1798 Alien Enemies Act needed further scrutiny.\n\nTrump has alleged that the migrants were members of the Tren de Aragua gang \"conducting irregular warfare\" against the US and could therefore be removed under the Act.\n\nWhile the administration is claiming the ruling as a win, the justices mandated that deportees must be given a chance to challenge their removal.\n\n\"The notice must be afforded within a reasonable time and in such a manner as will allow them to actually seek habeas relief in the proper venue before such removal occurs,\" the justices wrote in the unsigned decision on Monday.\n\n\"The only question is which court will resolve that challenge,\" they wrote.\n\nMonday's ruling said the challenge - brought by the American Civil Liberties Union (ACLU) on behalf of five migrants - was raised improperly in a Washington DC court and not in Texas, where the migrants are confined.\n\nConservative Justice Amy Coney Barrett joined the court's three liberal justices  in dissenting with the majority ruling.\n\nIn the dissent, they wrote that the administration's \"conduct in this litigation poses an extraordinary threat to the rule of law\".\n\nTrump called the ruling a \"great day for justice in America\".\n\n\"The Supreme Court has upheld the Rule of Law in our Nation by allowing a President, whoever that may be, to be able to secure our Borders, and protect our families and our Country, itself,\" he wrote on Truth Social.\n\nThe ACLU also claimed the rulingas \"a huge victory\".\n\n\"We are disappointed that we will need to start the court process over again in a different venue but the critical point is that the Supreme Court said individuals must be given due process to challenge their removal under the Alien Enemies Act,\" lead ACLU attorney Lee Gelernt said in a statement to US media.\n\nAt least 137 people have been deported by the Trump administration under the  Alien Enemies Act, a move widely condemned by rights groups.\n\nThe act, last used in World War Two, grants the US president sweeping powers to order the detention and deportation of natives or citizens of an \"enemy\" nation without following the usual processes.\n\nIt was passed as part of a series of laws in 1798 when the US believed it would enter a war with France.\n\nThe Trump administration says all the deportees are members of the Tren de Aragua gang. The powerful multi-national crime group, which Trump recently declared a foreign terrorist organisation, has been accused of sex trafficking, drug smuggling and murders both at home and in major US cities.\n\nUS immigration officials have said the detainees were \"carefully vetted\" and verified as gang members before being flown to El Salvador, under an agreement with that country.\n\nBut many of the deportees do not have US criminal records, a US Immigration and Customs Enforcement (ICE) official acknowledged in court documents.\n\nSome relatives of thedeported migrants have told the BBCthe men have been wrongly swept up in the immigration crackdown, and that they are innocent.\n\nSeveral other families have said they believe that deportees were mistakenly identified as gang members because of their tattoos.\n\nMonday's decision vacates an earlier ruling by federal judge James Boasberg, later upheld by a federal appeals court, which  had temporarily blocked the use of the law to carry out the deportations.\n\nBoasberg had dismissed the government's response to his order as \"woefully insufficient\". The White House had said the judge's order itself was not lawful and was issued after two flights carrying the men had already left the US.\n\nRights groups and some legal experts have called the invocation of the Act unprecedented, arguing it has only previously been used after the US officially declared a war, which under the US constitution only Congress can do.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "The Supreme Court on Monday granted PresidentDonald Trump’s request to vacate a lower court's ruling barring the administration from using a 1798 wartime immigration law to immediately deport Venezuelan nationals – including alleged members of the Tren de Aragua gang – from the U.S., marking a significant victory for the administration as it advances key immigration priorities.\n\nJustices on the high court ruled 5-4 to grant the administration's request to lift the stay, in a temporary victory for Trump and his allies.\n\nAt issue was the Alien Enemies Act, or the immigration law passed by Congress in 1789 to immediately remove certain migrants from U.S. soil.\n\nPrior to Trump's second White House term, it had been invoked just three times in U.S. history: During the War of 1812, during World War I, and most recently, World War II.\n\nJUDGE BOASBERG POISED TO HOLD TRUMP ADMIN IN CONTEMPT, TAKES DOWN NAMES OF DHS OFFICIALS: 'PRETTY SKETCHY'\n\nLawyers for the Trump administrationhad urged the court to vacate the lower court ruling, arguing in a Supreme Court filing that the lower court orders \"rebuffed\" their immigration agenda, including their ability \"to protect the Nation against foreign terrorist organizations and risk debilitating effects for delicate foreign negotiations.\"\n\nJustices posing for an official photo at the Supreme Court.(Olivier Douliery/AFP via Getty Images)\n\n\"Today's a bad day to be a terrorist in the United States of America,\" Homeland Security Secretary Kristi Noem said in a video posted to X, adding that Trump \"was correct in using his authority on using the Alien Enemies Act to deport terrorists out of this country.\"\n\nMeanwhile, Attorney GeneralPam Bondicalled the \"landmark\" decision a \"victory for the rule of law,\" adding that an \"activist judge\" in Washington, D.C., \"does not have the jurisdiction to seize control of President Trump’s authority to conduct foreign policy and keep the American people safe.\"\n\n\"The Department of Justice will continue fighting in court to make America safe again,\" Bondi concluded in her statement responding to the ruling.\n\nAPPEALS COURT BLOCKS TRUMP ADMIN'S DEPORTATION FLIGHTS IN ALIEN ENEMIES ACT IMMIGRATION SUIT\n\n\"This is a major loss for the lunatics and a major win for the American people,\" Vice PresidentJD Vanceresponded following the High Court's ruling. \"Onward!\"\n\nAttorney General Pam Bondi, Homeland Security Secretary Kristi Noem and Vice President JD Vance(Getty Images)\n\nThe Supreme Court's ruling follows a temporary order from U.S. District Judge James Boasberg last month blocking the administration’s use of the 1798 law for 14 days while he considered the case on its merits – a pause upheld by a federal appeals court in a 2–1 decision.\n\n\"Nazis got better treatment\" than some of the migrants deported under the law, Judge Patricia Millett, an Obama appointee, remarked during the appellate hearing.\n\nBoth Boasberg and the appellate panel sharply questioned the administration over Trump’s proclamation invoking the Alien Enemies Act to deport Venezuelan nationals – and over the three planes that removed hundreds of migrants to El Salvador the very next day.\n\nAt least 261 migrants were deported that day, including more than 100 Venezuelans removed \"solely on the basis\" of the 1798 statute.\n\nThe deportation flights reportedly landed around the same time Boasberg issued his temporary halt, raising questions about whether administration officials knowingly defied the order. Boasberg had issued a bench ruling requiring any flights that had already taken off to return \"immediately.\"\n\nJUDGE BOASBERG SHOULD ‘RECUSE’ HIMSELF FROM TRUMP DEPORTATION CASE, GOP LAWMAKER ARGUES\n\nTrump and Judge Boasberg are seen in this side-by-side split image.(Getty Images)\n\nBoasberg said on April 3 that he was weighing whether to hold certain Trump administration officials in contempt of court for refusing to provide information, even after the court issued repeated requests regarding the deportation flights and the number of individuals sent to El Salvador.\n\nGovernment lawyers cited national security concerns as the reason for refusing to comply with the court’s request for information.\n\nBut during the April 3 hearing, Deputy Assistant Attorney General Drew Ensign told Boasberg the flight information likely wasn’t classified — prompting the judge to question why the administration had declined to provide it on more than four occasions, including under a court-imposed deadline.\n\nWHO IS JAMES BOASBERG, THE US JUDGE AT THE CENTER OF TRUMP'S DEPORTATION EFFORTS?\n\nIn this handout photo provided by the Salvadoran government, guards escort the inmates allegedly linked to criminal organizations at CECOT on Mar.16, 2025 in Tecoluca, El Salvador.(Salvadoran Government via Getty Images)\n\nBoasberg also pressed the government to disclose the names, locations, and agencies of individuals involved in the removals, as well as any internal conversations with officials who may have been monitoring the court proceedings.\n\nThe hearing marked the latest in a flurry of legal battles over the Trump administration’s use of the Alien Enemies Act. It followed Boasberg’s order requiring officials to explain why they failed to comply with his directive to return the deportation flights – and whether they knowingly defied the court.\n\nThe Supreme Court ruling may not mark the end of Trump’s push to invoke the Alien Enemies Act.\n\nBoasberg is still weighing potential contempt charges against administration officials. As of this writing, a preliminary injunction hearing is set for April 8.\n\nPresident Trump took toTruth Socialto react to the decision in a post: \"The Supreme Court has upheld the Rule of Law in our Nation by allowing a President, whoever that may be, to be able to secure our Borders, and protect our families and our Country, itself. A GREAT DAY FOR JUSTICE IN AMERICA!\"\n\nFox News' Alec Schemmel contributed to this report.\n\nBreanne Deppisch is a national politics reporter for Fox News Digital covering the Trump administration, with a focus on the Justice Department, FBI, and other national news.\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox"
    }
}