{
    "question": "In what ways could the U.S. tariff hike to 104% on Chinese imports and China’s 84% retaliatory tariff—along with Beijing’s export controls and “unreliable entity” actions—reshape near-term negotiations, supply chains, and consumer prices?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nChina again vowed to “fight to the end” against Donald Trump’s tariffs on Wednesday, arguing that trade between the two countries is in balance as a 104% tax on the country’s exports to the U.S. came into effect.\n\nPedestrian and office buildings are reflected on a brokerage house’s window as an electronic board displays Shanghai shares trading index in the Central Business District, in Beijing, Wednesday, April 9, 2025. (AP Photo/Andy Wong)\n\nShoppers walk near a Nike store in Beijing, China, Tuesday, April 8, 2025. (AP Photo/Ng Han Guan)\n\nContainers ship Hornise sails across the Bosphorus strait, on his way from China’s Jingtang port to Russia’s Novorossiysk port, in Istanbul, Turkey, Tuesday, April 8, 2025. (AP Photo/Francisco Seco)\n\nA stock investor stands in front of the stock price indices at a brokerage house in Hangzhou in eastern China’s Zhejiang province, Monday, April 7, 2025. (Chinatopix Via AP)\n\nBoxes of party supplies imported from China are stacked outside a store in the Toy District of Los Angeles, Wednesday, April 9, 2025. (AP Photo/Jae C. Hong)\n\nNew Volvo vehicles waiting for shipment at the Yangtze port, in Nanjing city in east China’s Jiangsu province, Wednesday, April 9, 2025. (Chinatopix Via AP)\n\nChef and Food Stylist Miki Fujiwara, left, helps a fellow customer sort different variations of Chinese made soy sauce as she shops China’s Pearl River soy sauces at 99 Ranch Market, an Asian grocery store in Los Angeles Monday, April 7, 2025. (AP Photo/Damian Dovarganes)\n\nTrucks line up to depart from a container terminal in Nanjing in east China’s Jiangsu province on Tuesday, April 8, 2025. (Chinatopix Via AP)\n\nBANGKOK (AP) — President Donald Trumpraised the tariff on Chinese importsto 125% on Wednesday, hours after China boosted the duty on American goods to 84% in an escalating battle that threatens to disrupt trade between the world’s two largest economies.\n\nCiting a lack of respect, Trump set China apart from other countries. He said in a social media post that he is pausing his so-called “reciprocal tariffs” on many other trading partners because they had responded by reaching out for talks rather than retaliating.\n\nThe tit-for-tat hikes between the U.S. and China are the latest inan ongoing trade warthat threatens to raise prices for consumers in America and derail China’s attempts to reinvigorate its sluggish economy. The response from the Chinese government signals its determination not to bend to Trump’s pressure, despite the risks.\n\nShoppers walk near a Nike store in Beijing, China, Tuesday, April 8, 2025. (AP Photo/Ng Han Guan)\n\n“If the U.S. insists on further escalating its economic and trade restrictions, China has the firm will and abundant means to take necessary countermeasures and fight to the end,” China’s Ministry of Commerce said before announcing its latest tariff hike.\n\nIn Washington, White House press secretary Karoline Leavitt said: “When you punch at the United States of America, President Trump is going to punch back further.”\n\nThe United States sent a record $199 billion in exports to China last year, while China exported $463 billion in goods and services to the United States, third behind Mexico and Canada, according to the U.S. Commerce Department.\n\nTop U.S. exports to China in 2024 included soybeans, aircraft, pharmaceuticals and semiconductors. In the other direction, mobile phones, computers, toys and clothing were among major imports from China. The manufacturing giant was the top source of U.S. imports as recently as 2022 but it has lost ground to America’s neighbors amid heightened tensions with the United States.\n\nThe European Chamber of Commerce in China accused the U.S. of rolling back many of the principles that have underpinned its approach to trade and investment. It said that Trump’s tariffs would have a significant impact on European companies exporting from China to the U.S., forcing them to rethink their business models and supply chains.\n\n“This will lead to a substantial increase in operational costs and inefficiencies, and ultimately higher prices for consumers,” it said.\n\nContainers ship Hornise sails across the Bosphorus strait, on his way from China’s Jingtang port to Russia’s Novorossiysk port, in Istanbul, Turkey, Tuesday, April 8, 2025. (AP Photo/Francisco Seco)\n\nThough the U.S. and China may want to find a way back to the negotiating table, “this won’t be an easy path to navigate with both countries doubling down and bilateral engagement at a virtual standstill,’’ said former U.S. trade official Wendy Cutler, a vice president at the Asia Society Policy Institute.\n\nChina does not appear interested in bargaining, as some other countries have started doing.\n\n“If the U.S. truly wants to resolve issues through dialogue and negotiation, it should adopt an attitude of equality, respect and mutual benefit,” Foreign Ministry spokesperson Lin Jian said.\n\nThe Chinese Ministry of Culture and Tourism issued a travel advisory asking its citizens to evaluate the risks of visiting the U.S. as tourists and to exercise caution. The advisory, which came shortly after the announcement of China’s latest tariff hike, cited the deterioration in economic and trade relations as well as the “safety situation” in America.\n\nBoxes of party supplies imported from China are stacked outside a store in the Toy District of Los Angeles, Wednesday, April 9, 2025. (AP Photo/Jae C. Hong)\n\nTrump has now raised the tariff on Chinese goods five times since taking office in January. The first two hikes of 10% each were met with what analysts described as a measured response from China that left the door open for talks.\n\nBut after Trump announced an additional 34% duty on Chinese goods last week, along with tariffs on other countries inhis “Liberation Day,”China matched that witha 34% tariff on importsfrom the U.S.\n\nTrump then added a 50% tariff on goods from China, saying negotiations were terminated, and bringing the cumulative U.S. tariff to 104%. China responded by raising the tariff on American products by the same amount, bringing its total rate to 84%. Then Trump upped the American tariff to 125%.\n\nChina said it was also launching a new challenge to the U.S. tariffs at the World Trade Organization and adding 11 American companies to an “unreliable entities” list that bars Chinese companies from selling them goods that could have military uses. Among the companies are American Photonics, and SYNEXXUS, which both work with the American military.\n\nThe trade dispute has set back efforts to resolve a standoff over the TikTok short video app.\n\nTrumpsigned an orderlast week to keep TikTok running for another 75 days after a potential deal to sell the app to American owners was put on ice. Representatives from ByteDance, the Chinese company that owns the app, told the White House that Beijing would no longer approve a deal until there could be talks on trade.\n\n“History and facts have proven that the United States’ increase in tariffs will not solve its own problems,” the Commerce Ministry said Wednesday. “Instead, it will trigger sharp fluctuations in financial markets, push up U.S. inflation pressure, weaken the U.S. industrial base and increase the risk of a U.S. economic recession, which will ultimately only backfire on itself.”\n\nNew Volvo vehicles waiting for shipment at the Yangtze port, in Nanjing city in east China’s Jiangsu province, Wednesday, April 9, 2025. (Chinatopix Via AP)\n\nAssociated Press writers Didi Tang and Paul Wiseman in Washington and researcher Yu Bing and video producer Liu Zheng in Beijing contributed to this report.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Hannah Parry is a Newsweek Live Blog Editor based in New York. Her focus is reporting on U.S. politics and society. She has covered politics, tech and crime extensively.Hannah joined Newsweek in 2024 and previously worked as an assistant editor at The U.S. Sun and as a senior reporter and assistant news editor at The Daily Mail. She is a graduate of the University of Nottingham. You can get in touch with Hannah by emailing h.parry@newsweek.com. Languages: English.\n\nAmanda M. Castro is a Newsweek Live Blog Editor based in New York. Her focus is reporting on U.S. politics, breaking news, consumer topics, and entertainment. She specializes in delivering in-depth news and live blog reporting and has experience covering U.S. presidential debates, awards shows, and more. Amanda joined Newsweek in 2024 from the The U.S. Sun and is a graduate of the University of New Haven.\n\nYou can get in touch with Amanda by emailing a.castro@newsweek.com.\n\nContinuous updates; facts and sources are still being cross-checked.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nThe budget resolution vote in the House of Representatives has been postponed after GOP leaders were unable to win over enough holdouts on Wednesday evening.\n\nSpeaker Mike Johnson said he was still hopeful that the House could pass the budget blueprint this week, but \"if we have to come back next week, we will do that.\"\n\nJohnson added that he had spoken with President Donald Trump about the decision to delay the blueprint vote.\n\nLiz Cheney has accused President Donald Trump of a \"Stalinesque targeting of political adversaries\" after he signed two executive orders directing the Justice Department to investigate two former officials.\n\nTrump signed two executive orders Wednesday targeting former Homeland Security official Miles Taylor, who wrote a book and op-ed criticizing the president, and his first term election security director Chris Krebs, who could not find any evidence that the 2020 election was \"stolen.\"\n\nIn a post on X on Wednesday, Republican Cheney wrote, \"In a special mix of incompetence and evil, Trump has combined his disastrous implementation of 1930s tariff policies with Stalinesque targeting of political adversaries.\n\n\"The 2020 election wasn't stolen and speaking the truth is only a crime in countries ruled by tyrants,\" she added.\n\nIn a special mix of incompetence and evil, Trump has combined his disastrous implementation of 1930s tariff policies with Stalinesque targeting of political adversaries. The 2020 election wasn’t stolen and speaking the truth is only a crime in countries ruled by tyrants.https://t.co/JwcnsCvhBx\n\nDonald Trump's former White House Homeland Security and Counter Terrorism Advise, Olivia Troye, has called the president's orders for the Justice Department to investigate former officials he views as disloyal, as \"incredibly disturbing.\"\n\nTrump signed two executive orders Wednesday targeting former Homeland Security official Miles Taylor and his first term election security director Chris Krebs.\n\nTrump's order accuses Krebs of being part of a conspiracy to steal the 2020 election after the election security director said that he was unable to find any evidence of the widespread voter fraud Trump had alleged.\n\nTaylor was accused of being a \"bad-faith actor who weaponized and abused his government position,\" after he wrote an anonymousNew York Timesop-ed, and later a book, describing Trump's first term and the administration's alleged efforts to prevent the prevent the president was damaging the country.\n\nThe orders revoke their security clearances and call for the Department of Justice to investigate their actions in government.\n\nTroye wrote on X: \"This is incredibly disturbing. I warned Trump would do this & that he would falsely try & claim 'treason.' He's issuing Executive Orders targeting Chris Krebs and Miles Taylor—two Republican officials who served in his first admin. Ordering the DOJ to investigate them—for what? For telling the truth? This isn't justice. It's retribution. This is authoritarianism plain & simple.\"\n\nThis is incredibly disturbing. I warned Trump would do this & that he would falsely try & claim \"treason.\" He's issuing Executive Orders targeting Chris Krebs and Miles Taylor—two Republican officials who served in his first admin. Ordering the DOJ to investigate them—for what?…\n\nGermany's incoming chancellor Friedrich Merz said that he believes thatEurope's determination to fight back against Donald Trump's tariffs, were the reason he announced a 90-day pause on Wednesday.\n\n\"From my point of view, it's a reaction to the Europeans' resolve,\" Merz said on German TV channel RTL.\n\nHe cited E.U. official Ursula von der Leyen, who had pledged, \"We are determined to fight back.\"\n\nPresident Donald Trump is expected to hold a Cabinet meeting at 11 a.m. ET tomorrow, the White House said.\n\nDuring last month's cabinet meeting, Trump discussed his plans for the tariffs and several executive orders.\n\nTariffs are likely to loom large over Thursday's meeting too after Trump announced a90-day pause on his \"reciprocal\" tariffs.\n\nThe House of Representatives did not vote Wednesday night on the budget bill supported by PresidentDonald Trump, a fiscal plan that would effectively secure his agenda.\n\nEarly concern whether the Republican bill had enough GOP support prompted Trump to throw his political weight behind it on social media, calling it \"imperative\" forRepublicansto pass it.\n\nConservative Republican representatives likeChip Royof Texas andThomas Massieof Kentucky have been well-known hard-liners against passing larger budget bills.\n\nPassing the bill is critical for Trump's strategy, including tax cuts, to move forward and maintain a cohesive working relationship with House Republicans.\n\nThe House moved forward with a procedural vote of 216-215 earlier in the evening to allow a final vote of the bill. Three GOP lawmakers voted against the procedural rule.\n\nSpeaker Johnson said he was still hopeful that the House could pass the budget blueprint this week, but \"if we have to come back next week, we will do that.\"\n\nHe added that he would not keep members in session over the weekend however, due to the Jewish holiday of Passover on Saturday.\n\nPresidentDonald Trumpescalated his campaign of retribution on Wednesday, signing two memoranda directing the Justice Department to investigate two former officials from his first administration and stripping them of any security clearances they may still hold.\n\nThe move targets Miles Taylor, a formerDepartment of Homeland Securityofficial, and Chris Krebs, Trump's former top cybersecurity adviser.\n\nIn response to Trump's remarks, Taylor issued a statement on X: \"I said this would happen. Dissent isn't unlawful. It certainly isn't treasonous. America is headed down a dark path. Never has a man so inelegantly proved another man's point.\"\n\nThe move marks an intensification of Trump's efforts to use presidential power to punish critics and perceived enemies.\n\nHouse Speaker Mike Johnson said that he has spoken to President Donald Trump about the need to delay Wednesday's vote on the budget blueprint vote.\n\n\"He understands it,\" Johnson said, referring to Trump.\n\n\"He supports the process. He wants us to do this right and do it well, and sometimes it takes a little bit more time to do that,\" the speaker said.\n\nJohnson had pushed ahead with tonight's vote on the blueprint but came up against a group of House GOP conservatives who are demanding steep spending cuts.\n\nCanadian Prime Minister Mark Carney on Wednesday welcomed Donald Trump's 90-day pause on some tariffs charged on trading partners.\n\n\"The pause on reciprocal tariffs announced by President Trump is a welcome reprieve for the global economy,\" Carney said in a post on X.\n\nThe pause on reciprocal tariffs announced by President Trump is a welcome reprieve for the global economy.As President Trump and I have agreed, the U.S. President and the Canadian Prime Minister will commence negotiations on a new economic and security relationship immediately…\n\nThe White House has released a statement calling on Congress to immediately \"pass the one, big, beautiful bill.\"\n\nIt warned that if the budget resolution failed, Americans would \"be stuck with the largest tax hike in history.\"\n\nThe statement claimed that the average taxpayer will see a \"22% tax hike\" if not passed.\n\nPresident Donald Trump offered rare praise to Democrat Michigan Gov. Whitmer on Wednesday, as she appeared with him in Oval Office.\n\nTrump praised the second-term governor as a \"very good person\" who has done an \"excellent job,\" while Whitmer stood next to the president as he signed executive orders.\n\nWhitmer's office later said in a statement that she was \"surprised\" by the praise, and to be bought into the Oval Office. It also made clear that \"her presence is not an endorsement of the actions taken or statements made at that event.\"\n\nThe governor has been one of Trump's sharpest critics and even today, she delivered a speech that offered soft criticism of Trump, although emphasized their shared priorities.\n\nHowever,Whitmerhas now met with the president on several occasions, since he returned to office. Last month she said she was \"grateful\" to speak withTrumpfor a \"productive meeting\" that included discussions about jobs and tariffs.\n\nPresident Trump has signed two executive orders targeting former Homeland Security official Miles Taylor and his first term election security director Chris Krebs.\n\nThe orders revoke their security clearances and call for the Department of Justice to investigate their actions in government.\n\nTrump's order accuses Krebs of being part of a conspiracy to steal the 2020 election after the election security director said that he was unable to find any evidence of the widespread voter fraud Trump had alleged.\n\nIt states Krebs, \"falsely and baselessly denied that the 2020 election was rigged and stolen, including by inappropriately and categorically dismissing widespread election malfeasance and serious vulnerabilities with voting machines.\"\n\nTaylor, who served under multiple Republican administrations, wrote an anonymousNew York Timesop-ed, and later a book, describing Trump's first term and the administration's alleged efforts to prevent the prevent the president was damaging the country.\n\nIn a section called, 'eradicating government betrayal', the order against Taylor claims he is a \"bad-faith actor who weaponized and abused his government position.\"\n\nThe acting director of Immigration and Customs Enforcement (ICE), Todd Lyons, said that he wants to treat deporting immigrants like Amazon Prime deals with sending packages.\n\n\"We need to get better at treating this like a business,\" he said at the 2025 Border Security Expo, in Phoenix, according to theArizona Mirror.\n\nLyons added that he wanted the deportation process to run \"like [Amazon] Prime, but with human beings\".\n\nHe also said he hoped new technology, such as artificial intelligence, could speed up the deportation process to \"free up bed space\" and \"fill up airplanes.\"\n\nLyons explained that ICE had been working with Elon Musk's DOGE to access Social Security numbers to try and track down alleged voter fraud.\n\nPresident Donald Trump told reporters on Wednesday that he does not expect to have to raise the tariff on China again, after ratcheting up its levy to 125 percent.\n\nTrump was speaking after he announced a 90-day pause on the tariff for every country aside from China.\n\nInstead of pausing China's tariff, Trump announced he was raising it from 104 percent to 125 in the latest tit-for-tat trade war between the U.S. and the Asian nation. The move came after Beijing said it was raising its duty on American goods to 84%, following hikes from Trump.\n\nTrump said today will likely be his last hike on China as he believes that Chinese President Xi Jinping will reach out to negotiate a deal.\n\n\"I can't imagine it,\" Trump said of having to raise the tariffs on China again. \"I don't think we'll have to do it more. No, I don't see that.\"\n\nPresidentDonald Trump's former vice president,Mike Pence,reacted to news that Trump has temporarily reversed courseon initiating sweeping tariffs on numerous trading partners, calling the adjustment \"a win for the American people.\"\n\nIn Trump's initial tariff announcement, which he dubbed \"Liberation Day\" for the U.S., he singled out about 60 countries, including some of the U.S.'s top trading partners, for what he described as \"discounted reciprocal tariffs\" above 10 percent. The president said those countries would face higher tariffs because he believes they engage in unfair trade practices.\n\nHe reversed that on Wednesday but continued to target China, stating that he was increasing the import tariff rate to 125 percent.\n\nReacting to the moves on Wednesday, Pence posted on X, formerlyTwitter, saying, \"I am grateful that President Trump has committed to embracing a pause on many of the broad-based tariffs that were imposed on our trading partners around the world. When America trades with allies, it's a win for the American people.\"\n\nI am grateful that President Trump has committed to embracing a pause on many of the broad-based tariffs that were imposed on our trading partners around the world. When America trades with allies, it’s a win for the American people. Our goal should be free trade with free…\n\nRepublicans are responding to PresidentDonald Trump's sudden decision to pause most reciprocal tariffs just hours after they took effect Wednesday, marking the latest development in his ever-changing trade policy.\n\nA growing number of House andSenateRepublicanshave criticized President Donald Trump's trade policies and the unilateral manner in which they were enacted.Republicanlawmakers in both chambers have introduced legislation aimed at curbing the president's authority to impose tariffs.\n\nSince Trump announced a series of sweeping global tariffs in early April, including a baseline 10 percent on all imported goods and the widely anticipated \"reciprocal\" tariffs, the stock markets have experienced instability, with Wall Street posting its worst losses since 2020 and trillions of dollars in value erased.\n\nDozens of \"reciprocal\" tariffs took effect early Wednesday, but by the afternoon, President Donald Trump announced a pause on most of them. Since then, the stock market has surged.\n\nThe U.S. stock market has closed with a record-breaking bounce back after Trump announced he was pausing his retaliatory tariffs on almost every country.\n\nThe S&P 500′s 9.52% one-day gain is the third biggest since World War II, according toCNBC.\n\nDow Jones Industrial Average also had a huge, 7.87 percent jump, or 2,962.86 points - its biggest advance since March 2020.\n\nPresidentDonald Trumpsigned an executive order Wednesday to remove limitations on water pressure from shower heads and household appliances, an issue he frequently talked about on the campaign trail.\n\n\"@POTUS signs an Executive Order to end the Obama-Biden war on water pressure and Make America's Showers Great Again,\" a post from the Rapid Response 47 account posted on X, formerlyTwitter.\n\n🚨@POTUSsigns an Executive Order to end the Obama-Biden war on water pressure and Make America's Showers Great Againpic.twitter.com/NO4qaOj0xv\n\nPresident Trump posted on his social media platform Truth Social on Wednesday;\n\n\"Based on the lack of respect that China has shown to the World's Markets, I am hereby raising the Tariff charged to China by the United States of America to 125%, effective immediately.\n\nAt some point, hopefully in the near future, China will realize that the days of ripping off the U.S.A., and other Countries, is no longer sustainable or acceptable.\n\nConversely, and based on the fact that more than 75 Countries have called Representatives of the United States, including the Departments of Commerce, Treasury, and the USTR, to negotiate a solution to the subjects being discussed relative to Trade, Trade Barriers, Tariffs, Currency Manipulation, and Non Monetary Tariffs, and that these Countries have not, at my strong suggestion, retaliated in any way, shape, or form against the United States, I have authorized a 90 day PAUSE, and a substantially lowered Reciprocal Tariff during this period, of 10%, also effective immediately. Thank you for your attention to this matter!\"\n\nPresident Donald Trump said that he intends to make \"fair deals for everybody\" on tariffs after announcing a 90-day pause on the duties for everyone except for China.\n\nTrump told reporters on Wednesday that he \"just want[s] fair\" deals after he repeated his claims that United States were being \"ripped off\" by other countries.\n\n\"There will be fair deals. I just want fair,\" he said. \"They will be fair deals for everybody. But they weren't fair to the United States. They were sucking us dry.\n\n\"And people took advantage of our country, and they ripped us off ... for decades. I've been thinking about this for decades,\" he added.\n\nFBI Director Kash Patel was quietly replaced as acting head of the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) in late February, according to sources familiar with the matter. Army Secretary Daniel Driscoll has taken over the role, though the change was not publicly disclosed until recently. Patel, who had been sworn in as FBI director days before taking on the ATF role, still appears as the acting director on the ATF's website and in an April 7 press release.\n\nThe reasons for Patel's removal have not been made clear, and the change was only communicated to senior ATF officials on Wednesday. Driscoll, who will remain Army secretary, is also known for his brief tenure in the Army and his run in the 2020 Republican primary for a North Carolina congressional seat.\n\nThe Justice Department is considering a plan to merge the ATF and the Drug Enforcement Administration (DEA), both of which often collaborate but have distinct missions. The consolidation aims to improve efficiency and streamline operations between the two agencies.\n\nChief KPMG economist Diane Swonk shared her frustration over the rapidly changing tariffs and economic outlook after President Donald Trump announced a 90-day pause on the duties.\n\n\"This is nuts,\" Swonk told theNew York Timeson Wednesday shortly after the White House flip flop.\n\n\"Damage done. Market relief is a headfake, unless the administration makes a major course correction,\" she added.\n\nShe warned that even with relief of a tariffs pause, the rapid, chaotic changes to the tariffs were imposing harm on the markets on their own.\n\n\"Uncertainty is its own tax on the economy,\" she said.\n\nTrump commented on market conditions Wednesday, stating that the bond market was \"beautiful\" despite recent volatility. He acknowledged that recent market trends had been \"pretty glum\" and saw signs of concern, particularly in the bond market on Tuesday.\n\nTrump defended his decision to impose tariffs, saying that the trade situation with U.S. partners was unsustainable and that someone needed to act. \"I was willing to pull the trigger,\" he explained.\n\nWhile acknowledging the impact of the tariffs on certain companies, the president indicated he would consider exemptions for those particularly affected, relying on \"instinct\" rather than a structured process to determine who would be exempt.\n\nJust over an hour after Treasury Secretary Scott Bessent told reporters outside the White House that the decision to reverse the tariffs had been Donald Trump's strategy \"all along,\" the president himself has come out and said that he made the decision in reaction to the markets panic.\n\n\"Over the last few days, it looked pretty glum,\" Trump said referring to the spiraling global stock markets.\n\nHe added that people were also \"getting a little bit yippy.\"\n\n\"Well, I thought that people were jumping a little bit out of line,\" the president said when a reporter asked him to elaborate on his decision-making. \"They were getting yippy, you know, they were getting a little bit yippy, a little bit afraid ... because we have a big job to do.\"\n\nA federal appeals court ruled Wednesday, allowing Trump's administration to continue firing thousands of probationary federal workers. The decision overturned a lower court ruling that had required their reinstatement, supporting Trump's efforts to downsize the federal workforce.\n\nThe court's split panel, with Republican-appointed judges in favor, suggested that firings should be challenged through employment processes rather than federal court. This follows a similar ruling from the Supreme Court siding with the administration in a separate case.\n\nThe lawsuit, filed by 22 states, argues that the firings create financial burdens. Since Trump took office, about 24,000 probationary workers have been dismissed, though 15,000 have been reinstated or given paid leave. The states may seek further legal action as the case progresses.\n\nPresidentDonald Trumpexplained his decision to pause reciprocal tariffs for 90 days, telling reporters at the White House that people were \"getting a little bit yippy.\"\n\n\"Well, I thought that people were jumping a little bit out of line,\" the president said when a reporter asked him to elaborate on his decision-making. \"They were getting yippy, you know, they were getting a little bit yippy, a little bit afraid ... because we have a big job to do.\"\n\nTrump abruptly announced earlier in the afternoon that he would pause most reciprocal tariffs for 90 days and increase tariffs on China to 125 percent after Beijing announced its own retaliatory tariffs on U.S. exports.\n\nAn assistant professor at Cornell University specializing in applied economics and policy, Wendy Zhang, has cautioned that the 125% tariff on Chinese goods could have significant consequences for the U.S. economy.\n\nZhang pointed out, perThe New York Times,that a large percentage of key imports to the U.S. come from China, including 73% of smartphones, 78% of laptops, 87% of video game consoles, and 77% of toys. He also noted that a considerable amount of antibiotics used in U.S. livestock production are sourced from China. Zhang emphasized that while alternative suppliers could be found, the transition would take time and likely result in higher costs for U.S. consumers.\n\nPresidentDonald Trumpannounced a temporary90-day pause on his administration's broad tariff schemefor more than 75 countries — but excluding China, which he accused of showing \"disrespect\" to global markets.\n\nInstead, effective immediately, the president said tariffs on Chinese imports will rise to 125 percent, deepening the trade rift between the world's two largest economies.\n\nAmid a global market meltdown,Trump reversed courseby pausing most of his \"reciprocal\" tariffs on U.S. trade partners, while sharply increasing the tariff rate on Chinese imports to 125 percent.\n\nGlobal markets surged on the news, which was delivered via a Truth Social post around 1:30 p.m. ET.\n\nAsfinancial markets reel from a new round of tariffsand bond sell-offs, JPMorgan Chase CEO Jamie Dimon issued a stark warning thatcredit problemsare mounting andcorporate loan defaultsmay soon follow.\n\nIn an interview withFoxBusiness on Wednesday, Dimon said rising interest rates, sticky inflation, and widening credit spreads are setting the stage for a wave of financial strain among U.S. companies.\n\nDimon's warning coincides with major turbulence in global bond markets and intensified fears of recession.\n\nJPMorgan economists recently raised their forecast for a U.S. and global recession to 60 percent, up from 40 percent following PresidentDonald Trump's imposition of sweeping tariffs on dozens of countries, including 104 percent tariffs on Chinese imports.\n\nShares of General Motors, Ford, and Stellantis saw notable gains, with GM rising 5.7%, Ford up 5.6%, and Stellantis increasing by 11.9%. Despite the increase, all three companies are still down for the year as tariffs on imported goods continue to affect production costs and drive up consumer prices. These manufacturers, with supply chains and production facilities across North America, are facing higher costs as a result of the tariffs.\n\nTesla, which rose 14.1%, is less impacted by the tariffs due to its vehicles being assembled in the U.S. However, the company has faced scrutiny over CEO Elon Musk's collaboration with President Trump to reduce government spending, and Tesla's stock is down 40% since Trump's inauguration.\n\nTreasury Secretary Scott Bessent addressed concerns over recent market turmoil, attributing the volatility to a misunderstanding of President Donald Trump's tariff strategy. Speaking at the White House, Bessent explained that the high tariff levels were meant to serve as a starting point for negotiations, allowing countries to lower tariffs and trade barriers by engaging with the U.S.\n\nBessent emphasized that Trump's approach created maximum negotiating leverage, and he argued that China, in particular, had revealed itself as a problematic actor on the global stage. His remarks came as markets began to stabilize following initial uncertainty about the administration's trade tactics.\n\nThe Government Accountability Office (GAO) has launched an audit of Elon Musk's Department of Government Efficiency (DOGE) to investigate its handling of data at several federal agencies. The audit, which began in March, focuses on the Department of Labor, Education, Homeland Security, Health and Human Services, the Treasury, and the Social Security Administration, as well as the U.S. DOGE Service (USDS), according toWired.\n\nThe GAO has requested extensive records from these agencies, including documentation on potential misuse of agency systems and data, policies related to data protection, and audit logs for any access granted to DOGE operatives. Concerns have been raised about DOGE operatives, many with ties to Musk's companies, gaining access to sensitive government data without adequate oversight or experience.\n\nThe audit, initiated at the request of congressional leaders, will specifically examine whether DOGE adheres to privacy and data protection laws. The GAO's final report, expected by the end of spring, will include findings on DOGE's data handling practices. Some Democratic officials have raised alarms about the department's potential to compromise the privacy and security of American citizens' personal data.\n\nWhite House press secretary Karoline Leavitt addressed concerns surrounding Trump's decision to impose tariffs, calling them a strategic negotiation tool. During a briefing outside the White House with Treasury Secretary Scott Bessent, Leavitt remarked that many reporters failed to understand the logic behind Trump's approach, referencing his bookThe Art of the Deal.\n\nLeavitt also pushed back against the notion that the tariffs would push U.S. allies into China's sphere of influence. \"In fact, we've seen the opposite effect. The entire world is calling the United States of America, not China,\" she stated. \"They need our markets, they need our consumers, and they need this president in the Oval Office.\"\n\nShe further claimed that over 75 countries had contacted the U.S. to begin discussions. The retaliatory tariffs on goods from China and other countries came into effect just after midnight.\n\nTrump announced on Truth Social that the U.S. would raise tariffs on China to 125%, effective immediately.\n\nHe also authorized a 90-day pause in tariffs for more than 75 other countries, setting the rate at 10% during this period.\n\nDelta Air Lines withdrew its 2025 performance forecast on Wednesday, citing disruptions in global trade and rising uncertainty. The airline had expected a record financial year as recently as January.\n\nThe move marks a sharp reversal for the nation's most profitable airline. Delta also plans to scale back its flight schedule, anticipating a drop in spending from both businesses and consumers facing higher prices.\n\nShortly after Delta's announcement, Walmart also retracted its first-quarter profit guidance, pointing to tariff-related risks.\n\nHouse Democrats raised alarms Wednesday over the national security effects of President Trump's new tariffs, warning they may drive key Pacific allies closer to China.\n\nAt a House Armed Services Committee hearing, Rep. Joe Courtney pointed to a recent economic meeting between Japan, South Korea, and China as a sign of shifting alliances. \"This is driving our allies in the wrong direction,\" he said.\n\nDefense official John Noh declined to comment directly on the tariffs, prompting frustration from Democrats. Rep. Adam Smith said the U.S. had \"launched a trade war against every single one of our partners in the Asia region.\"\n\nShares of pharmaceutical companies dropped worldwide on Wednesday after President Trump repeated his intention to impose tariffs on imported medications. While most drug products were exempt from the latest round of tariffs that took effect the same day, Trump's continued push has raised industry concerns.\n\nThe president has argued that taxing foreign-made drugs will boost domestic production. However, experts warn the move could drive up prices and lead to shortages, especially for generic medications heavily reliant on overseas manufacturing.\n\nSocial media star MrBeast criticized Trump's tariff policy on Tuesday, saying it makes it more expensive to produce his chocolate bars in the United States. In a post on X, he said that due to the new tariffs, it's now \"way cheaper\" to make his globally sold products outside of America.\n\nIn a follow-up post, MrBeast warned that tariffs could be the \"nail in the coffin\" for small businesses, echoing concerns from other entrepreneurs facing rising costs tied to the ongoing trade war.\n\nIronically because of all the new tariffs it is now way cheaper to make our chocolate bars we sell globally NOT in America because other countries don’t have a 20%+ tariff on our cogs 😅\n\nBtw we pay our farmers a living income, use fair trade certified beans, etc. so I was already spending a lot on cocoa. A random price hike was pretty brutal ngl.We’ll figure it out. I feel for small businesses though. Could really be a nail in the coffin for them.\n\nEuropean companies are looking beyond the United States for trade opportunities as PresidentDonald Trump's aggressive new tariff regime sparks fresh uncertainty in global trade.\n\nThe shift by European companies away from U.S. markets could have far-reaching consequences for the American economy. As key foreign investors and trading partners reconsider their presence, the U.S. risks losing access to critical goods, capital, and innovation. This could slow job growth, disrupt supply chains, and increase prices for consumers—all while weakening the U.S.'s influence in global markets.\n\nOn April 2, the White House announced a 10 percent baseline tariff on all imports, with higher rates oncountries running trade surpluses—including 34 percent on China, 20 percent on theEU, 25 percent on South Korea, 24 percent on Japan and 32 percent on Taiwan. Mexico and Canada, which were exempt from the new tariffs, still face aprevious 25 percent levy.\n\nTrump's announcement immediately sent the markets into turmoil on April 3, with Wall Street recording itsworst day since 2020—when COVID-19 was in full swing. However, U.S. stocks ticked back up on Tuesday.\n\nAmid the uncertainty, European companies are eyeing an opportunity to pivot away from the U.S. market to avoid the effects of the tariffs.\n\nOn Thursday, during a meeting at the Elysée Palace with representatives of sectors affected by the tariffs, French PresidentEmmanuel Macronsaid he wanted EU businesses to stop investing in the U.S.\n\n\"It is important that future investments, the investments announced over the last few weeks, should be put on hold for some time until we have clarified things with the United States of America,\" Macron said.\n\nThe European Chamber of Commerce in China has stated that the latest U.S. tariffs will force many companies to rethink their business models and supply chains. The chamber predicts that these changes will lead to higher operational costs, inefficiencies, and ultimately, increased prices for consumers.\n\nCompanies that currently produce goods in China for export to the U.S. may need to explore alternative markets or even relocate production outside of China to maintain access to the U.S. market. The new tariffs and China's countermeasures will also negatively affect foreign-invested enterprises in China that rely on U.S. components for their production. If these companies cannot find alternative suppliers, they may be forced to move their production out of China altogether.\n\nAmazon.com Inc. has canceled orders for products made in China and other Asian countries, according to a document reviewed by Bloomberg and sources familiar with the situation. The cancellations, which affect items such as beach chairs, scooters, and air conditioners, appear to be a response to President Donald Trump's tariffs announced on April 2. These tariffs target goods from more than 180 countries and territories, including China, Vietnam, and Thailand.\n\nVendors impacted by the cancellations suspect the move was triggered by the trade dispute. One vendor, who has sold beach chairs to Amazon for over a decade, reported that a $500,000 order was canceled after the chairs were already produced, leaving the vendor with additional financial responsibility. An Amazon spokesperson declined to comment on the cancellations, but the company has noted in its annual report that international trade disputes, including tariffs, pose a risk to its business.\n\nThe precise extent of the cancellations and the specific products affected remain unclear. Amazon's move to cancel orders could shift tariff exposure back to the vendors, who may face higher costs if they import goods through other means. While Amazon directly imports about 40% of its products, the rest are sold by independent merchants on its platform.\n\nThis decision follows broader concerns over the economic impact of the trade war. As businesses face rising costs due to tariffs, analysts have warned of potential recession risks. In light of these developments, Robert W. Baird & Co. reduced its 2025 revenue forecast for Amazon, which has seen its stock drop 21% this year.\n\nU.S. Secretary of Defense Pete Hegseth reiterated concerns about China's increasing presence in the western hemisphere during a regional security conference in Panama City on Wednesday. Hegseth, who previously described China as a threat to the Panama Canal, emphasized that Chinese companies were controlling key infrastructure in the region, raising security concerns.\n\nHegseth pointed out that China's military has an extensive presence in the area, adding that Beijing's investments in the region are aimed at gaining military advantage and securing economic benefits. He urged governments in the Americas to collaborate on addressing these threats, alongside other issues such as transnational drug cartels and mass immigration.\n\nBeijing has issued a travel advisory urging its citizens to assess the risks of visiting the United States and to exercise caution while traveling, the Chinese Ministry of Culture and Tourism said.\n\nThis comes in the wake of China's decision to raise tariffs on U.S. goods to 84%, further escalating the ongoing trade war between the two nations.\n\nToday onCNN This Morning, Derek Thompson, staff writer atThe Atlanticand co-author ofAbundance, joined anchor Audie Cornish to discuss President Trump's new tariffs. Thompson expressed concern over the chaos caused by Trump's trade policies and suggested that the \"capital class\" should intervene to oppose them. He argued that the U.S. needs corporate leaders to speak out against Trump's tariff strategy, emphasizing that such policies would not effectively reindustrialize America. Instead, Thompson pointed to Joe Biden's successful Chips and Science Act, which helped stimulate semiconductor manufacturing in the U.S.\n\nThompson further criticized Trump's approach, noting that raising tariffs on materials like lumber and drywall would only drive up housing costs and exacerbate shortages, rather than solving the underlying issues. In contrast, hisAbundanceideology promotes reducing regulations and removing bottlenecks in housing construction. Thompson believes that certainty, not unpredictability, is key to fostering growth and manufacturing, a point that Trump's erratic tariff policies fail to provide.\n\nThompson also weighed in on Bernie Sanders' criticisms of the oligarchy, urging corporate leaders to step up against the president's chaotic economic policies to ensure stable growth.\n\nVietnam's Deputy Prime Minister Ho Duc Phoc is set to meet with U.S. Treasury Secretary Scott Bessent in Washington, DC, on Wednesday. The meeting comes as the Trump administration continues negotiations with several countries over the president's tariffs, CNN reported.\n\nBessent has also been engaged in talks with officials from Japan, South Korea, and other nations. Under the new tariff regime unveiled by the Trump administration last week, Vietnam faces some of the highest \"reciprocal\" tariff rates, with a 46% tariff taking effect today.\n\nThe United States has reinforced its air power in the Western Pacific Ocean with two groups of fighter jets arriving at Kadena Air Base in Japan, staging a show of force to China.\n\nNewsweekhas emailed both the Chinese defense and foreign ministries for comment.\n\nKadena is located on the Japanese island ofOkinawaand is theclosest American air basetoTaiwan, a U.S. security partner. CommunistChinahas long claimed the self-governed island as part of its territory and hasthreatened to use force, if necessary, to achieve unification.\n\nJapan is part of the First Island Chain, a U.S.maritime containment strategythat seeks to restrict the Chinese military's access to the WesternPacific Ocean.\n\nOn CNN'sEarly Start, Capital Economics' Group Chief Economist Neil Shearing shared his insights on the global economic impact of President Trump's tariffs, which have escalated tensions between the U.S. and its trading partners.\n\nShearing emphasized that there are no true winners in a tariff war, as higher prices harm consumers and disrupt global supply chains. He noted that U.S. consumers and Chinese producers are likely to bear the brunt of the damage, with tariffs on China expected to be steeper than those imposed on other countries. However, some countries may benefit by taking advantage of the shifting production, with companies like Apple potentially moving some production to India.\n\nShearing also addressed the U.S. Federal Reserve's role amid the economic uncertainty. He explained that while President Trump has called for interest rate cuts, the Fed faces a dilemma. The rising tariffs are likely to push inflation higher, making it difficult for the Fed to reduce rates without risking further inflationary pressures.\n\nIn conclusion, Shearing stated that the ongoing trade conflicts are tightening financial conditions, which could negatively affect consumers and businesses in the real economy.\n\nU.S. stock indexes are showing significant fluctuations in early trading. The S&P 500 inched slightly higher, while the Nasdaq composite index, which is heavily weighted with tech stocks, also saw a modest gain.\n\nHowever, the Russell 2000 index, which tracks smaller companies more sensitive to the economy's health, is down. This mixed performance reflects investor uncertainty amid ongoing economic concerns.\n\nWalmart is sticking to its full-year sales and operating income forecast, even as President Trump's trade wars with China and other trading partners intensify. The retailer, based in Bentonville, Arkansas, confirmed Wednesday that it expects first-quarter sales growth between 3% and 4%.\n\nHowever, it withdrew its previous guidance for first-quarter operating profit growth, citing the uncertainty surrounding tariffs. Walmart emphasized its need for flexibility to adjust pricing as tariffs are implemented. The company has mitigated some tariff risks by sourcing two-thirds of its merchandise domestically, with groceries accounting for 60% of its U.S. business.\n\nRepublican senators are voicing growing concerns about the economic fallout from =Trump's sweeping tariff policy, which took effect on Wednesday. Manufacturers are struggling with long-term planning, farmers are facing retaliation from Chinese buyers, and U.S. households are burdened with rising prices.\n\nDuring a Senate hearing and in interviews, GOP lawmakers expressed skepticism about the administration's approach, directing much of their concern at U.S. Trade Representative Jamieson Greer. This rare dissent comes as the stock market shows signs of volatility, and economists warn the tariffs could trigger a recession.\n\nEU Member States have voted in favor of the European Commission's proposal to implement trade countermeasures against the United States. This response comes after the U.S. imposed tariffs on steel and aluminum imports from the EU in March.\n\nThe EU views these tariffs as unjustified and harmful, affecting both economies and the global market. The Commission has emphasized its desire to reach a negotiated, balanced solution with the U.S. The countermeasures will come into effect on April 15, following the completion of the Commission's internal procedures.\n\nHowever, the EU has said that these measures can be suspended if the U.S. agrees to a fair negotiation.\n\nMichigan Governor Gretchen Whitmer is set to meet with Trump at the White House on Wednesday afternoon, following a speech she will give in Washington about the economy.\n\nAccording to a spokesperson, Whitmer's visit to the White House is part of her continued efforts to engage with the Trump administration despite policy differences,The Associated Pressreported.\n\nWhitmer, one of a few Democratic governors who has discussed the possibility of working with the Republican president, previously met with Trump last month.\n\nThe Department of Education has claimed immunity from a lawsuit taken by students trying to stop massive federal cuts.\n\nThe students are trying to stop the Department of Educationfrom sharing student loan informationwith the Department of Government Efficiency and its director,Elon Musk.\n\nIf the Department of Education succeeds in obtaining immunity from DOGE lawsuits, other Trump administration departments would likely claim the same immunity.\n\nMusk would then be able to continue with his plan to cut the federal budget by up to $2 trillion a year.\n\nNewsweeksought email comment from the Department of Education and the Department of Government Efficiency.\n\nRead the full story by Sean O'Driscoll on Newsweek.\n\nThe White House announced on Tuesday that more than $1 billion in federal funding for Cornell University and around $790 million for Northwestern University have been frozen as part of an ongoing investigation into alleged civil rights violations at the schools. This move is part of a broader push by the Trump administration to use government funding to enforce its political agenda in academic institutions.\n\nBoth universities have expressed concern over the funding freezes. Cornell revealed that it had received more than 75 stop work orders related to national defense and cybersecurity research but had not been formally notified about the $1 billion in frozen grants. Northwestern also stated that it had not received any official notice but warned that the funding cuts could disrupt crucial research, including projects focused on healthcare and technology.\n\nThe funding pauses come after the U.S. Department of Education warned universities, including Cornell and Northwestern, about potential enforcement actions related to antisemitism on campuses during protests last year. This is part of the administration's broader strategy to ensure universities comply with federal law regarding protections for Jewish students.\n\nThe funding freezes have raised concerns about the impact on vital research at these universities, with critics arguing that the administration's approach could harm scientific progress without addressing the core issue of campus antisemitism.\n\nIn a recent interview, Fox Business host Maria Bartiromo asked Treasury Secretary Scott Bessent how far the U.S. is willing to go in its ongoing trade tensions with China, particularly regarding Chinese stocks on U.S. exchanges.\n\nBessent responded, \"I think everything's on the table.\"\n\nBartiromo: \"How far are you willing to take this?...Are you willing to go that far to remove Chinese stocks from U.S. exchanges?\"Bessent: \"I think everything's on the table.\"pic.twitter.com/JmGAlsYEZn\n\nTrump confirmed Tuesday that the U.S. will soon impose new tariffs on pharmaceutical imports, although he did not specify a timeline.\n\nSpeaking at the National Republican Congressional Committee dinner, Trump expressed frustration over the high cost of pharmaceuticals in the U.S., citing that they can be \"10 times more\" expensive than in other countries.\n\n\"We're going to do something that we have to do — we're going to tariff our pharmaceuticals,\" Trump said, adding that the move would lead to pharmaceuticals \"rushing back into our country.\"\n\nHe promised that details of the new tariff announcement would come \"very shortly.\"\n\nU.S. Treasury Secretary Scott Bessent indicated that the U.S. has no plans to back down after China retaliated once again against President Trump's tariffs. In an appearance on Fox Business, Bessent pointed out China's significant trade surplus, stating, \"Their exports to the U.S. are five times our exports to China. So, they can raise their tariff, but so what?\"\n\nWhile reaffirming the U.S. stance, Bessent also suggested a potential diplomatic path forward, proposing that China could help mitigate tensions by acknowledging its role in the fentanyl trade. \"What would be a very good step with the Chinese would be acknowledging that the precursor chemicals for fentanyl come from China,\" he said. \"They make their way into North America, and then are sold into the U.S.\"\n\nPakistan's Prime Minister Shehbaz Sharif announced Wednesday that he is sending a delegation to the United States to hold talks with the Trump administration regarding the 29% tariffs imposed on Pakistani imports,The Associated Pressreported.\n\nThe delegation, which will include prominent business leaders and key exporters, is tasked with discussing ways to enhance exports and addressing the impact of the tariffs on Pakistan's economy. The decision came after a high-level meeting in Islamabad, where Sharif and officials reviewed the potential economic repercussions of the U.S. tariffs.\n\nWith Pakistan's economy heavily dependent on foreign loans, a decline in exports could exacerbate its already fragile financial situation.\n\nThe Trump administration has reversed many of its recent emergency food aid cuts after backlash from humanitarian groups and lawmakers—but funding remains frozen in Afghanistan and Yemen, two of the world's most vulnerable countries. Officials confirmed Wednesday that the administration walked back some of the terminations after the World Food Program and others raised alarms about the impact on millions of lives.\n\nUSAID, which had initially slashed funding to 14 countries, notified WFP on Tuesday of the partial reversal. The shift comes after reports that the cuts were ordered by Jeremy Lewin, a close ally of Elon Musk, who now oversees USAID under Musk's Department of Government Efficiency.\n\nThe situation remains especially dire in Afghanistan and Yemen. In Afghanistan, where over 23 million people rely on aid, the cuts will end food support for millions, halt care for malnourished children, and disrupt maternal health services. In Yemen, 2.4 million people will lose access to food aid, with additional programs for displaced and disabled individuals at risk.\n\nThe U.S. had been the top donor to the World Food Program, giving nearly half of its $9.8 billion in funding last year. But the Trump administration has repeatedly criticized foreign aid as wasteful and accused agencies like USAID of pursuing political agendas.\n\nIt remains unclear how many of the original 14 country programs will see funding restored, but officials say behind-the-scenes lobbying by U.N. representatives played a key role in reversing some of the decisions.\n\nChina said it will hike its tariff on U.S. imports to 84 percent after PresidentDonald Trumpincreased tariffs again on Chinese goods, in a trade war that continues to escalate.\n\nThis is an additional 50 percent to the current rate. It follows Trump's raising of the tariff onChinese goods to 104 percent as of Wednesday.\n\n\"The US escalation of tariffs on China is a mistake on top of a mistake, which seriously infringes on China's legitimate rights and interests and seriously undermines the rules-based multilateral trading system,\" China's finance ministry said in a statement.\n\nTrump had warned China on Monday to withdraw its retaliatory tariff of 34 percent by Tuesday or face an additional 50 percent U.S. tariff on Wednesday.\n\nThe deadline passed and the new U.S. tariff rate for Chinese imports came into effect.\n\nRead the full breaking story by Shane Croucher on Newsweek.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nTo read how Newsweek uses AI as a newsroom tool,Click here.",
        "source_3": "Chinaannounced an 84% tariff against the United States after President Donald Trump raisedtariffsagainst Beijing to 104% on Wednesday.\n\n“The U.S. escalation of tariffs on China is a mistake on top of a mistake, severely infringing upon China’s legitimate rights and interests, and seriously damaging the multilateral trading system based on rules,” China’s State Council Tariff Commission said ina statementannouncing the latest levy, which brings China’s total tariffs on all U.S. imports up to 118%.\n\nChina’s Commerce Ministry also imposedexport controlson a dozen U.S. companies andaddedsix U.S. firms to its “unreliable entity list,” banning them from trading or making new investments in China,according to CNN.\n\nThe news came after Chinese officialssaid Wednesdaythat Trump made a “mistake” in placing steep tariffs on China. They accused the president of trying to exercise “blackmail” and vowed to fight the U.S. “to the end” as tensions over Beijing’s handling of the fentanyl crisis turn into a global war over trade.\n\nIn retaliation, Beijing announced 10%-15% tariffs on U.S. agricultural and energy products, followed by an additional 34% tariff on all U.S. imports last Friday.\n\nThe trade disputes began over two months ago when Trump slapped 10% tariffs on China to incentivize Beijing to take more aggressive action to end the fentanyl crisis. That number has increased since February, with the White Houseannouncing Wednesday night an increasefrom 34% additional tariffs to 84%.\n\nTRUMP WON’T PAUSE RECIPROCAL TARIFFS TO ALLOW FOR NEGOTIATIONS\n\nDuring an interview Wednesday morning on Fox Business Network, Treasury Secretary Scott Bessentweighed inon the tariff war, arguing the escalation was a “loser” for Beijing and saying, “It’s unfortunate that the Chinese actually don’t want to come and negotiate because they are the worst offenders in the international trading system.”\n\n“They have the most imbalanced economy in the history of the modern world,” he continued. “And I can tell you that this escalation is a loser for them, that they have some very smart — the economists, the academicians, technocrats within their bureaucracy — and they would be telling the leadership that we do not have the edge here. They are the surplus country, and their exports to the U.S. are five times our exports to China, so they can raise their tariffs, but so what?”"
    }
}