{
    "question": "In what ways could the 75-day extension of TikTok’s sale deadline reshape the path to a sale while balancing national security concerns with the interests of its 170 million U.S. users?",
    "content": {
        "source_1": "Photo illustration: Sarah Grillo/Axios. Photo: Joe Raedle/Getty Images\n\nPresident Trump on Friday announced that he again would delay the ban onTikTok, scheduled for tomorrow, despite not havingmade a dealwith the app's Chinese owner, ByteDance.\n\nWhy it matters:TikTok is used by millions of Americans, for both entertainment and livelihoods.\n\nThe big picture:Trump successfully brushed off a law passed by Congress, which had required the ban to take effect months earlier, despite bipartisan consensus about national security risks caused by the app's ties to China.\n\nWhat they're saying: \"The Deal requires more work to ensure all necessary approvals are signed, which is why I am signing an Executive Order to keep TikTok up and running for an additional 75 days,\" Trump said in Truth Socialpost.\n\nZoom in:Trump would have legal authority to extend the ban if there was a divestiture agreement, even in principle, between ByteDance and U.S. buyers. But that does not yet seem to exist, despite anarray of suitors.",
        "source_2": "Reporting by Ismail Shakill; writing by Susan Heavey; editing by Costas Pitas\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nDutch technology investor Prosus gained European Union antitrust approval on Monday for its 4.1 billion euro ($4.76 billion) bid for Just Eat Takeaway , after agreeing to sell down its stake in Delivery Hero .\n\nReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.\n\nAccess unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.\n\nBrowse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.\n\nScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.\n\nAll quotes delayed a minimum of 15 minutes.See here for a complete list of exchanges and delays.",
        "source_3": "Billionaire entrepreneur Frank McCourt Jr. unpacks the bid for the social media company on 'The Claman Countdown.'\n\nPresidentDonald Trumpon Friday extended a deadline for TikTok's Chinese owner to sell the app to an American buyer or have the platform shut down in the U.S.\n\n\"My Administration has been working very hard on a Deal to SAVE TIKTOK, and we have made tremendous progress. The Deal requires more work to ensure all necessary approvals are signed, which is why I am signing an Executive Order to keep TikTok up and running for an additional 75 days,\" Trump wrote on Truth Social.\n\n\"We hope to continue working in Good Faith with China, who I understand are not very happy about our Reciprocal Tariffs (Necessary for Fair and Balanced Trade between China and the U.S.A.!). This proves that Tariffs are the most powerful Economic tool, and very important to our National Security!\" Trump added. \"We do not want TikTok to ‘go dark.’ We look forward to working withTikTokand China to close the Deal. Thank you for your attention to this matter!\"\n\nShortly after taking office, Trump signed an executive order giving ByteDance an April 5 deadline to divest TikTok to an American buyer or shut down the platform.\n\nFLASHBACK: TRUMP SAYS HE MAY LOWER CHINA TARIFFS ON CERTAIN CONDITION\n\nPresident Donald Trump delivers remarks during a Cabinet meeting at the White House in Washington, D.C., on March 24.(Win McNamee/Getty Images / Getty Images)\n\nIn April 2024, Congress passed the Protecting Americans from Foreign Adversary Controlled Applications Act, which gave TikTok nine months to either divest from itsChinese parent company,ByteDance, or be removed from U.S.-based app stores and hosting services.\n\nThe app — which the Trump administration says is used by 170 million Americans — was temporarily removed in January, as no deal was reached.\n\nTrump, on his first day in office, then issued an executive order granting TikTok more time to operate and work toward compliance with the law, pushing the deadline to this Saturday, April 5.\n\nTRUMP TO CONSIDER FINAL PROPOSAL FOR TIKTOK AS DEADLINE LOOMS\n\nTikTok was temporarily removed from U.S. app stores in January this year.(Jonathan Raa/NurPhoto via Getty Images / Getty Images)\n\nTrump said in late March that the deadline could be extended if a deal isn’t finished by then.\n\n\"We will have a form of a deal. TikTok is very popular, very successful, very good. We're going to have a form of a deal. But if it's not finished, it's not a big deal. We'll just extend it. I have the right to have the deal and to extend it. If I want. So, we'll see whether or not we have a deal. We have a lot of interest in TikTok,\" the president said.\n\nHis administration is reportedly finalizing plans for potential investors that could include Blackstone and Oracle, as well as a long list of other investors that will likely involve blue-chip private equity firms, venture capital firms, and major investors in the technology industry, as first reported by CBS News.\n\nThe ByteDance logo is seen at the company's headquarters in Shanghai.(VCG/VCG via Getty Images / Getty Images)\n\nDuring the presidential campaign, Trump said he would \"never ban TikTok\" after joining the platform, but during his first term in office, he advocated for the action, citing national security concerns.\n\nFOX Business' Alexandra Koch and Patrick Ward contributed to this report.\n\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\n\nBy clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time."
    }
}