{
    "question": "In what ways could the fatal stabbing at the Frisco track meet inform how schools, families, and local media address safety, accountability, and uncertainty when violence occurs at student events?",
    "content": {
        "source_1": "Austin Metcalf, 17, was stabbed by another student, police said.\n\nThe family of a 17-year-old boy who wasstabbed to deathat a Texas track meet said they are heartbroken over what they called the \"senseless\" act of violence.\n\nAustin Metcalf, an 11th grader at Frisco Memorial High School, died Wednesday after police said another student stabbed him during an altercation at a track meet in Frisco.\n\nThe victim's twin brother, Hunter Metcalf, was also at the meet and tried to save him, their mother told Dallas ABC affiliateWFAA.\n\n\"I got a phone call from Hunter, he was screaming that Austin had been stabbed,\" their mother, Meghan Metcalf, told the station.\n\n\"He was holding the wound. He was trying to save his brother,\" she said.\n\nAustin Metcalf was transported to a hospital, where he died despite lifesaving measures by first responders, police said.\n\n\"I tried to help him,\" his brother, Hunter Metcalf, told WFAA.\n\nHe said he wasn't allowed in the ambulance to go to the hospital.\n\n\"They had to yank me off him,\" he told the station.\n\nFrisco police said the suspect in the deadly stabbing -- 17-year-old Karmelo Anthony, a student at Frisco Centennial High School -- has been charged with first-degree murder.\n\nAn \"altercation between two students resulted in one stabbing the other,\" the Frisco Police Department said in a news release, though they did not provide additional details on the incident.\n\nHunter Metcalf said the stabbing occurred after his brother asked the suspect to leave their school's tent at the meet.\n\n\"I tried to whip around as fast as I could, but I didn't see the stab,\" he told WFAA. \"It was really senseless. I don't know why a person would do that to someone, just over that little argument.\"\n\nHunter Metcalf said he had never met the suspect before.\n\n\"Just doesn't make any sense,\" their mother told WFAA, getting emotional. \"Just because the kid was mad, my son is not here anymore, and I don't understand it.\"\n\nThe suspect in the stabbing is in custody and no bond has been set yet, police said.\n\nAnthony's father told ABC News on Thursday that they do not have a statement to make at this time, but will in the coming days. They are working to get an attorney, he said.\n\nThe Frisco Independent School District called the incident an \"unprecedented situation\" in an email sent to the high schools that attended the track meet.\n\n\"Frisco ISD shares in the grief of everyone impacted by this heartbreaking loss, and we extend our deepest sympathies to the victim's family, students, staff, and our community during this difficult time,\" the district said.\n\nMeghan Metcalf remembered her son as the \"most amazing kid.\"\n\n\"So smart. He had college football guys looking at him to play in college. His goal was to play in college,\" she told WFAA.\n\n\"He just had such ambitions and a drive that it's hard to find in a kid,\" she told the station. \"Such a good spirit and so many kids love him.\"\n\nHunter Metcalf said he did everything with his twin, his best friend.\n\n\"I had a blast my whole life playing sports with him,\" he told WFAA. \"It's just really heartbreaking not to see him next year on the field.\"",
        "source_2": "AGoFundMewas launched for the 17-year-old suspect who fatally stabbed Austin Metcalf, 16, at a high school track meet in Frisco, Texas on Wednesday. The fundraiser, set up by a LaDarren Dewayne, claimed that Karmelo Anthony is a ‘well-mannered man’ and acted in self-defense.\n\nThis comes days after Metcalf was stabbed in the chest as he attended a track and field championship at Kuykendall Stadium in Frisco following a disagreement over seating. The 16-year-old football player died in his twin brother's arms. The victim's parents and twin brother told reporters that he was ‘the most amazing kid’. He was an 11th grader at Frisco Memorial High School.\n\nRead More:Austin Metcalf: GoFundMe launched to support family of Frisco stabbing victim\n\nA GoFundMe page was launched to support Metcalf's family. It was created by his father, Jeff Metcalf, and describes the 16-year-old as a ‘leader of men’.\n\nThe fundraiser for the stabbing suspect was set to ‘set the record straight’. “Enough with the misinformation. Let’s talk about facts,” organizer Dewayne stated on the page, which says that it is ‘normal for students from different schools to gather under another school’s tent. Karmelo had friends there—he wasn’t trespassing or looking for trouble'.\n\nRead More:Why was Austin Metcalf stabbed? His brother recalls what happened at the Frisco track meet\n\nThe GoFundMe dismisses the police report, saying the Metcalf twins knew the suspect from before. It further says that Austin asked Anthony to leave the tent and ‘tried to jump him’.\n\n“Before attacking him, they tried to take his belongings, broke his phone, and stomped on it. The twins are known bullies.”\n\nThe page states that Anthony is well-mannered, a 4.0 student with multiple college offers and zero criminal history. We cannot verify these claims at this time. The Frisco Police Department is yet to issue a statement about the new GoFundMe page, which is titled: 'Justice for Karmelo: A 4.0 Student's Fight'.",
        "source_3": "A Texas high school football starwas stabbed in the heartand died in the arms of his twin brother after a fight over a seat at a track meet, his heartbroken family says.\n\nAustin Metcalf was attending a track and field championship between other area schools at Kuykendall Stadium in Frisco, Texas, when the fatal attack happened on April 2.\n\nMetcalf, a junior at Memorial High School outside Dallas, was in his team’s tent when a fight broke out between the teen and 17-year-old Karmelo Anthony, cops say.\n\nAnthony, a 17-year-old senior at Centennial High School just five miles away, was allegedly told he was sitting in the wrong seat. He then allegedly drew a knife and pierced Metcalf through the heart, the dead teen’s father Jeff Metcalf toldNBC Dallas-Fort Worth.\n\nHunter, who was born 2 minutes after Austin, rushed to aid his brother but couldn’t save him.\n\n“I tried to whip around as fast as I could,” an emotionalHunter Metcalf told WFAA.“I looked at my brother and I’m not going to talk about the rest. I tried to help him.”\n\nThe heartbroken brother said that neither of the siblings had ever met Anthony prior to Wednesday’s meet, with the whole fight taking just seconds.\n\n“It really was under 30 seconds, this altercation,” Hunter said. “I never met this kid in my life.\n\n“We asked him to move. He started getting aggressive and talking reckless,” Hunter recalled.\n\n“And my brother stepped in and said, ‘You need to move,’” Hunter added, “And [Anthony’s] like, ‘Make me move.’\n\n“All of the sudden, he grabbed his backpack,” the brother said.\n\nJust seconds into the tussle, Hunter said Anthony pulled out a knife and stabbed his brother in the chest.\n\n“They were twins, identical twins, and his brother was holding on to him, trying to make it stop bleeding, and he died in his brother’s arms,” Jeff Metcalf recalled.\n\nHunter Metcalf called his parents to tell them about the stabbing, with their father rushing to find Austin on a gurney not breathing.\n\n“I could see all the blood, and I saw where the wound was, and I was very concerned, so I had to find his brother, and we rushed to the hospital. And we prayed, and it’s God’s plan, I don’t understand it, but they weren’t able to save him. This is murder,” Jeff Metcalf said.\n\n“Despite lifesaving measures by police and fire personnel, including CPR and the administration of blood, the (17)-year-old died,” Frisco police said.\n\nAnthony was arrested and charged with first-degree murder.\n\nHe is being held at Collin County Jail, with bail set at $1 million.\n\nThe grieving father questioned Anthony’s upbringing and parents as he forgave his son’s alleged killer.\n\n“I’m not trying to judge, but what kind of parents did this child have? What was he taught? He brought a knife to a track meet and he murdered my son by stabbing him in the heart. The guy was in the wrong place and they asked him to move and he bowed up [became angry and aggressive]. This is murder,” Jeff Metcalf said.\n\n“You know what, I already forgive this person. Already. God takes care of things. God is going to take care of me. God is going to take care of my family,” he added.\n\nAnthony, a 5-foot-10 free safety, revealed on social media he had received offers from several colleges, mostly Division III schools.\n\nHis father told the Post his son was a “good kid” and maintains that he did not start the fight that broke out between the two boys.\n\n“[Karmelo] was not the aggressor. He was not the one who started it,” he said. “He works two jobs. He’s an A student, has a 3.7 GPA”\n\n“Everyone has already made their assumptions about my son, but he’s not what they’re making him out to be,” he added.\n\n“I feel bad for the other parents and family, and words can’t explain how both people [families] have been affected by this tragedy.”\n\nAustin Metcalf was remembered as a star linebacker who had garnered attention from schools as he dreamed of playing football in college.\n\nHe was recently voted his team’s Most Valuable Player and held a 4.0 GPA, according to a GoFundMe organized by his father, which has raised nearly $100,000 as of Thursday afternoon.\n\n“He was a bright young man with a great future ahead of him,” Jeff Metcalf said. “He was a leader of men. His smile would light up the room. His passion for football was unbelievable.\n\n“We will all remember him for the way he impacted others’ lives.”"
    }
}