{
    "question": "How might President Trump’s dismissal of several National Security Council officials, coming after his meeting with Laura Loomer and amid scrutiny over the Signal chat leak, influence the administration’s vetting practices, operational security, and public trust in its national security leadership?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nPresident Donald Trump said Thursday that he’s fired “some” White House National Security Council officials, a day after far-right activist Laura Loomer raised concerns directly to him about staff loyalty. Trump downplayed Loomer’s influence on the firings.\n\nPresident Donald Trump speaks during an event to announce new tariffs in the Rose Garden at the White House, Wednesday, April 2, 2025, in Washington. (AP Photo/Mark Schiefelbein)\n\nRight-wing activist Laura Loomer speaks in front of the courthouse where the hush-money trial of Donald Trump is underway, April 15, 2024, in New York. (AP Photo/Ted Shaffrey, File)\n\n▶ Follow live updates onPresident Donald Trump and his administration\n\nWASHINGTON (AP) — PresidentDonald Trumpsaid Thursday that he’s fired “some” White HouseNational Security Councilofficials, a move that comes a day after far-right activistLaura Loomerraised concerns directly to him about staff loyalty.\n\nTrump downplayed Loomer’s influence on the firings. But Loomer during her Oval Office conversation with Trump urged the president to purge staffers she deemed insufficiently loyal to his “Make America Great Again” agenda, according to several people familiar with the matter. They all spoke on the condition of anonymity to discuss the sensitive personnel manner.\n\nRight-wing activist Laura Loomer speaks in front of the courthouse where the hush-money trial of Donald Trump is underway, April 15, 2024, in New York. (AP Photo/Ted Shaffrey, File)\n\n“Always we’re letting go of people,” Trump told reporters aboard Air Force One as he made his way to Miami on Thursday afternoon. “People that we don’t like or people that we don’t think can do the job or people that may have loyalties to somebody else.”\n\nLoomer appeared to take credit for the firings in a post late Thursday on X, writing, “You know how you know the NSC officials I reported to President Trump are disloyal people who have played a role in sabotaging Donald Trump?” She then noted that “the fired officials” were being defended by Trump critics on CNN and MSNBC.\n\nRight-wing activist Laura Loomer speaks in front of the courthouse where the hush-money trial of Donald Trump is underway, April 15, 2024, in New York. (AP Photo/Ted Shaffrey, File)\n\nThe firings by Trump of NSC staff come at a tumultuous moment for Trump and his national security team. His national security adviser Mike Waltz, continues to fight backcalls for his ousterafter using the publicly available encryptedSignalapp to discuss planning for the sensitive March 15 military operation targeting Houthi militants in Yemen.\n\nTrump has said he stands by Waltz, who traveled to Florida with the president on Thursday for a dinner event ahead of the LIV Golf tournament in Miami.\n\nMeanwhile, The Pentagon’s acting inspector generalannounced Thursday that he would review Defense Secretary Pete Hegseth’s use of Signal to convey plans on the Houthi operations. The review will also look at other defense officials’ use of the publicly available encrypted app.\n\n“You’re bringing that up again,” Trump scoffed at a reporter. “Don’t bring that up again. Your editor’s probably—that’s such a wasted story.”\n\nVice President JD Vance, chief of staff Susie Wiles, Waltz and Sergio Gor, director of the Presidential Personnel Office, also took part in the meeting with Loomer, the people said.\n\nThe Presidential Personnel Office has fired at least three senior NSC officials and multiple lower-ranking aides since Wednesday’s meeting with Loomer, according to the people familiar with the situation.\n\nThe NSC officials fired include Brian Walsh, a director for intelligence; Thomas Boodry, a senior director for legislative affairs; and David Feith, a senior director for technology and national security, according two people familiar with the matter.\n\n“Laura Loomer is a very good patriot. She is a very strong person,” said Trump, who described his talks with the far-right activist as “constructive.”\n\nTrump acknowledged that Loomer “recommended certain people for jobs.”\n\n“Sometimes I listen to those recommendations like I do with everybody,” Trump said. “I listen to everybody than I make a decision.”\n\nLoomer, who has promoted 9/11 conspiracy theories, was a frequent presence on the campaign trail during Trump’s 2024 successful White House run. More recently, she’s been speaking out on social media about members of Trump’s national security team that she insists can’t be trusted.\n\n“It was an honor to meet with President Trump and present him with my research findings,” Loomer said in a Thursday posting on X. “I will continue working hard to support his agenda, and I will continue reiterating the importance of, and the necessity of STRONG VETTING, for the sake of protecting the President of the United States of America, and our national security.”\n\nTrump has a long history of elevating and associating with people who trade in falsehoods and conspiracy theories, and he regularly amplifies posts on his social media site shared by those like Loomer, who promotes QAnon, an apocalyptic and convoluted conspiracy theory centered on the belief that Trump is fighting the “deep state.”\n\nTrump’s national security team has been through a difficult stretch as officials struggle to answer questions about why they were using the Signal app to discuss planning for an operation targeting Houthi militants instead of using far more secure communication means.\n\nThe use of Signal for operation planning came to light because a journalist, The Atlantic magazine’s Jeffrey Goldberg, was mistakenlyadded to the chainand revealed that Trump’s team used it to discuss precise timing of the operation, aircraft used to carry out the strikes and more.\n\nWaltz has taken responsibility for building the text chain but has said he does not know how Goldberg ended up being included.\n\nThe Pentagon’s acting inspector generalannounced Thursday that he would review Defense Secretary Pete Hegseth’s use of Signal to convey plans on the Houthi operations. The review will also look at other defense officials’ use of the publicly available encrypted app.\n\nLoomer, in the leadup to Wednesday’s meeting with Trump, had complained to sympathetic administration officials that she had been excluded from the NSC vetting process as Waltz built his staff, according to one person familiar with the matter. She believes Waltz was too reliant in the process on “neocons” — shorthand for the more hawkish neoconservatives within the Republican Party — as well as what she perceived as “not-MAGA-enough” types, the person said.\n\nSen. Mike Rounds, a Republican who sits on Senate committees overseeing the military and national intelligence, said it “raises eyebrows” when “there is a firing of people on the National Security Council or their staff, particularly people that we have respect for, who were part of the Intel community to begin with here in the Senate.”\n\nWaltz, in the first days of Trump’s return to Washington, sent about160 nonpolitical detaileesassigned to the NSC back to their home agencies to ensure those at the White House were committed to implementing Trump’s America First agenda.\n\nThe move sidelined nonpolitical experts on topics that range from counterterrorism to global climate policy at a time when the United States is dealing with a disparate set of complicated foreign policy matters, including conflicts inUkraineand theMiddle East.\n\nLast week, Adam Schleifer, an assistant U.S. attorney in Los Angeles,was fired without explanationin a terse email from the White House personnel office shortly after Loomer posted about him on social media, according to a person familiar with the matter.\n\nThis story has been corrected to show the surname of The Atlantic journalist is Goldberg, not Rosenberg.\n\nLee reported from Brussels. Associated Press writer Stephen Groves contributed reporting.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "The Trump administration has fired the head of both the National Security Agency and US Cyber Command, the BBC's US partner CBS has reported.\n\nThe removal of General Timothy Haugh comes amid what appears to be a wider purge of top security officials at the agency and at the White House.\n\nDemocrats have said they are \"deeply disturbed\" by the move and say it jeopardises  national security.\n\nIt is not clear why Gen Haugh was removed, but it comes after a meeting between President Donald Trump and far-right activist Laura Loomer on Wednesday.\n\nMs Loomer reportedly urged Trump to fire specific employees whom she suspected lacked support for his agenda.\n\nShe posted on X that Gen Haugh and his deputy Wendy Noble, who US media reported was also sacked, \"have been disloyal to President Trump. That is why they have been fired.\"\n\nTrump, meanwhile, has denied that Ms Loomer played a role in the firings.\n\nBefore the firings were reported, Trump told reporters he would get rid of any staff deemed to be disloyal.\n\n\"We're always going to let go of people – people we don't like or people that take advantage of, or people that may have loyalties to someone else,\" he told reporters aboard Air Force One.\n\nWhen asked whether Ms Loomer played a role, he said: \"No, not at all.\"\n\nTrump made the comments as reports emerged of the firings of at least three other officials at the White House National Security Council (NSC), following the reported meeting with Ms Loomer. The president did not confirm names.\n\nThe National Security Agency (NSA) referred the BBC to the Office of the Secretary of Defense Public Affairs for comment, which said on Friday it had seen the reports but had nothing to offer at this time, and would provide more information when it became available.\n\nThe White House previously told the BBC that the NSC \"won't comment on personnel\" matters.\n\nThe top Democrats on the House and Senate intelligence committees - Representative Jim Himes of Connecticut, ranking member of the House Intelligence Committee, and Senator Mark Warner of Virginia, vice chair of the Senate Select Committee on Intelligence - disclosed Gen Haugh's firing to CBS.\n\nHimes said in a statement that he was \"deeply disturbed\" by the decision, CBS reported.\n\n\"I have known General Haugh to be an honest and forthright leader who followed the law and put national security first — I fear those are precisely the qualities that could lead to his firing in this Administration,\" Himes said.\n\nThose fired from the NSC on Thursday included Brian Walsh, a director for intelligence; Thomas Boodry, a senior director for legislative affairs; and David Feith, a senior director overseeing technology and national security, CBS reported.\n\nIt was not clear if Gen Haugh and Ms Noble's removals were connected to those at the NSC.\n\nThe firings follow a major controversy involving the NSC last month when senior officials inadvertently added a journalist to a Signal messaging thread about military strikes in Yemen.\n\nGen Haugh, who was not on the Signal chat, testified on Capitol Hill last week about the leak.\n\nThe extent to which that controversy played a role in the firings is unclear.\n\nTrump has so far stood by top officials involved in the incident, including National Security Adviser Mike Waltz, who took responsibility for the Atlantic magazine reporter being added to the Signal chat, and said it was an accident.\n\nAccording to CBS, a source familiar with the situation said the Signal incident \"opened the door\" to looking into staff members believed not to be sufficiently aligned with Trump, while Ms Loomer's visit sealed the fate for those who were terminated.\n\nThe administration has been looking at outside meetings held by national security staff, reprimanding some for meeting people not believed to be aligned with the president, according to the source.\n\nAboard Air Force One en route to Miami, Florida, on Thursday, Trump praised Ms Loomer and confirmed he had met with her, calling her a \"great patriot\" and a \"very strong person\".\n\n\"She makes recommendations… sometimes I listen to those recommendations,\" he said. \"I listen to everybody and then I make a decision.\"\n\nIn a phone call with the BBC, Ms Loomer said it would be \"inappropriate\" to divulge details of her meeting with Trump on Wednesday.\n\n\"It was a confidential meeting,\" she said. \"It's a shame that there are still leakers at the White House who leaked this information.\"\n\nShe texted a statement that said: \"It was an honor to meet with President Trump and present him with my research findings.\n\n\"I will continue working hard to support his agenda, and I will continue reiterating the importance of STRONG VETTING, for the sake of protecting the President of the United States of America and our national security.\"\n\nDefence Secretary Pete Hegseth, who posted information in the chat, is now the subject of an internal review into his use of Signal and whether he complied with his department's policies, the Pentagon's office of the acting inspector general said on Thursday.\n\nInspector general offices routinely conduct independent investigations and audits of federal agencies, and look into possible security breaches.\n\nUpon returning to the White House in January, Trump removed many of the government's inspectors general and has installed acting heads of the watchdogs at the defence, commerce, labour and health departments.\n\nOn Friday, Attorney General Pam Bondi was asked at an event in Florida whether she would also investigate the incident. She said she had not discussed the matter with the president and the incident was being reviewed internally.\n\n\"Nothing has been referred to us,\" she said. \"These are intelligence agencies, and they are reviewing it internally.\"\n\nFollow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weekly US Politics Unspun newsletter. Readers in the UK cansign up here.Those outside the UK cansign up here.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nScientists who analysed fragments that crashed into a roof in Georgia, US, say it likely formed 4.56 billion years ago.\n\nTariffs, oversupply and teetotaling Gen-Zs have all contributed to the downfall of one of America's most iconic liquors.\n\nJen Pawol donated her hat to a baseball museum after her history-making game on Saturday.",
        "source_3": "PresidentDonald Trumpreportedly fired multiple officials on hisNational Security Councilshortly after he met withLaura Loomerin the Oval Office.\n\nThe president met with Loomer, a self-described “investigative journalist,” on Wednesday. Loomer has publicly accused Trump administration staffers ofdisloyaltyand said there have beenvetting failuresat theNSCandelsewherethrough variouspostson X.\n\nTheNew York TimesreportedLoomer discussed NSC staffers she said were disloyal. National security adviser Mike Waltz was present at the meeting.\n\nAboard Air Force One Thursday afternoon, Trump called Loomer “a great patriot” and said she had “recommended some people for jobs.”\n\n“She makes recommendations and people, and sometimes I listen to those recommendations,” Trump told reporters. “I listen to everybody, and then I make a decision.”\n\nWhen asked if she had anything to do with the NSC firings, Trump responded, “No, not at all.”\n\nThree senior NSC officials were fired after the Loomer meeting at the White House,accordingtoAxios. The firings came a week after the Signal group chat leak, in which theAtlantic‘s editor-in-chief was inadvertently added to a group chat with Waltz and other national security officials.\n\nLoomer began posting about alleged “vetting failure[s]” after the Signal group chat leak and offered to vet staffers for the Trump administration.\n\nWhen asked about the reported firings, NSC Spokesman Brian Hughes told theWashington Examinerin a statement, “NSC doesn’t comment on personnel matters.”\n\nLoomer confirmed she met with Trump at the White House in aposton X on Thursday. While she declined to say what she discussed with Trump, Loomer emphasized “the necessity of STRONG VETTING” for the administration.\n\n“I woke up this morning to learn that there are still people in and around the West Wing who are LEAKING to the hostile, left-wing media about President Trump’s *confidential* and *private* meetings in the Oval Office. I want to reiterate how important it is that people who gain access to the White House or the administration respect the privacy of their conversations with President Trump and his senior staff,” Loomer said.\n\nSENATE ARMED SERVICES LEADERS ASK PENTAGON IG TO INVESTIGATE SIGNAL SCANDAL\n\nThe president’s association with Loomer on the campaign trail last year sparked controversy, specifically after she accompanied Trump during his visits to Sept. 11 memorial services in New York and Pennsylvania.\n\n“She is a strong person. She has strong opinions, and I don’t know what she said, but that’s not up to me,” Trumpsaid in Septemberin response to a question about Loomer’s past controversial statements."
    }
}