{
    "question": "How might the Pentagon inspector general’s review of Defense Secretary Pete Hegseth’s use of Signal to discuss Yemen strike plans influence future DoD practices on encrypted apps, classification handling, and records retention?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nU.S. Secretary of Defense Pete Hegseth attends a joint news conference with Japan’s Defense Minister Gen Nakatani at the Ministry of Defense in Tokyo Sunday, March 30, 2025. (Kiyoshi Ota/Pool Photo via AP)\n\n▶ Follow live updates onPresident Donald Trump and his administration\n\nWASHINGTON (AP) — The Pentagon’s acting inspector general announced Thursday that he would review Defense Secretary Pete Hegseth’suse of the Signal messaging appto convey plans for a military strike against Houthi militants in Yemen.\n\nThe review will also look at other defense officials’ use of the publicly available encrypted app, which is not able to handleclassified materialand is not part of the Defense Department’s secure communications network.\n\nHegseth’s use of the app came to light when a journalist, Jeffrey Goldberg of The Atlantic, was inadvertently added to a Signal text chain by national security adviser Mike Waltz. The chain included Hegseth, Vice President JD Vance, Secretary of State Marco Rubio, Director of National Intelligence Tulsi Gabbard and others, brought together to discuss March 15 military operations against the Iran-backed Houthis.\n\n“The objective of this evaluation is to determine the extent to which the Secretary of Defense and other DoD personnel complied with DoD policies and procedures for the use of a commercial messaging application for official business,” the acting inspector general, Steven Stebbins, saidin a notification letterto Hegseth.\n\nThe letter also said his office “will review compliance with classification and records retention requirements.”\n\nAP Washington correspondent Sagar Meghani reports on a Pentagon watchdog’s review of Defense chief Pete Hegseth using Signal to convey Yemen strike plans.\n\nHegseth and other members of the Trump administration are required by law to archive their official conversations, and it is not clear if copies of the discussions were forwarded to an official email so they could be permanently captured for federal records keeping.\n\nThe Pentagon referred all questions to the inspector general’s office, citing the ongoing investigation.\n\nPresident Donald Trump grew frustrated when asked about the review.\n\n“You’re bringing that up again,” Trump scoffed at a reporter. “Don’t bring that up again. Your editors probably — that’s such a wasted story.”\n\nIn the chain, Hegseth provided the exact timings of warplane launches and when bombs would drop — before the men and women carrying out those attacks on behalf of the United States were airborne.\n\nThe review was launchedat the requestof Sen. Roger Wicker, R-Miss., chairman of the Senate Armed Services Committee, and Rhode Island Sen. Jack Reed, the committee’s top Democrat.\n\nIn congressional hearings, Democratic lawmakers have expressed concern about the use of Signal and pressed military officers on whether they would find it appropriate to use the commercial app to discuss military operations.\n\nBoth current and former military officials have said the level of detail Hegseth shared on Signal most likely would have been classified. The Trump administration has insisted no classified information was shared.\n\nWaltz is fighting back againstcalls for his ousterand, so far, Trump has said he stands by his national security adviser.\n\nOn Thursday, Trumpfired several membersof Waltz’s staff after far-right activistLaura Loomerurged the president to purge staffers she deemed insufficiently loyal to his “Make America Great Again” agenda, several people familiar with the matter said.\n\nIn his Senate confirmation hearing Tuesday, Trump’s nominee for chairman of the Joint Chiefs of Staff, Lt. Gen. Dan Caine, would not say whether the officials should have used a more secure communications system to discuss the attack plans.\n\n“What I will say is we should always preserve the element of surprise,” Caine told senators.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Reporting by Phil Stewart and Idrees Ali; Editing by Diane Craft and Jamie Freed\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nPhil Stewart has reported from more than 60 countries, including Afghanistan, Ukraine, Syria, Iraq, Pakistan, Russia, Saudi Arabia, China and South Sudan. An award-winning Washington-based national security reporter, Phil has appeared on NPR, PBS NewsHour, Fox News and other programs and moderated national security events, including at the Reagan National Defense Forum and the German Marshall Fund. He is a recipient of the Edwin M. Hood Award for Diplomatic Correspondence and the Joe Galloway Award.\n\nNational security correspondent focusing on the Pentagon in Washington D.C. Reports on U.S. military activity and operations throughout the world and the impact that they have. Has reported from over two dozen countries to include Iraq, Afghanistan, and much of the Middle East, Asia and Europe. From Karachi, Pakistan.",
        "source_3": "Soldiers given false arrest records have been stuck in bureaucratic limbo for years. President Trump or Defense Secretary Hegseth could fix it, lawyers say.\n\nThe Pentagon’s inspector general has launched an investigation into whether Defense SecretaryPete Hegsethviolated department policy by discussing military attack plans in a private Signal chat, following a report by The Atlantic.\n\nThe probe will examine whether Hegseth improperly discussed operational plans for a U.S. offensive against the Houthis in Yemen and will also review \"compliance with classification and records retention requirements,\" according to a memo from Inspector General Steven Stebbins.\n\nThe investigation was launched after the top Republican and Democrat on the Senate’sArmed ServicesCommittee requested it last week.\n\n\"This chat was alleged to have included classified information pertaining to sensitive military discussions in Yemen,\" Chairman Roger Wicker, R-Miss., and ranking member Jack Reed, D-R.I., wrotein aletterto Stebbins. \"If true, this reporting raises questions as to the use of unclassified networks to discuss classified and sensitive information.\"\n\nTRUMP TEAM'S SIGNAL SNAFU SPARKS DEBATE OVER SECURE COMMS: 'RUSSIA AND CHINA ARE LISTENING'\n\nSecretary of Defense Pete Hegseth slammed The Atlantic's report on the Signal chat leak.(Omar Marques/Getty Images)\n\nA memorandum addressed to Hegseth asked him to designate two points of contact for the investigation and said it would take place in Washington, D.C., and U.S. Central Command headquarters in Tampa, Florida.\n\nHegseth sentdetails related to an offensive campaignagainst Yemen's Houthi rebels last month to principal advisers of the president via a Signal app chat national security adviser Michael Waltz had started. The chat unintentionally included Atlantic editor-in-chief Jeffrey Goldberg.\n\nStebbins is the acting Pentagon watchdog after President Donald Trumpfired 17 inspectors general, including the Defense Department’s IG, shortly after taking office.\n\nHegseth's Signal messages revealed F-18, Navy fighter aircraft, MQ-9s, drones and Tomahawks cruise missiles would be used in the strike on the Houthis.\n\nTRUMP OFFICIALS ACCIDENTALLY TEXT ATLANTIC JOURNALIST ABOUT MILITARY STRIKES IN APPARENT SECURITY BREACH\n\nTrump's closest advisors discussed a planned strike on the Houthis on Signal.(Jaap Arriens/NurPhoto via Getty Images))\n\n\"1215et: F-18s LAUNCH (1st strike package),\" Hegseth said in one message notifying the chat of high-level administration officials that the attack was about to kick off.\n\n\"1345: ‘Trigger Based’ F-18 1st Strike Window Starts (Target Terrorist is @ his Known Location so SHOULD BE ON TIME – also, Strike Drones Launch (MQ-9s)\" he added, according to the report.\n\n\"1415: Strike Drones on Target (THIS IS WHEN THE FIRST BOMBS WILL DEFINITELY DROP, pending earlier ‘Trigger Based’ targets)\"\n\n\"1536 F-18 2nd Strike Starts – also, first sea-based Tomahawks launched.\"\n\n\"We are currently clean on OPSEC\" – that is, operational security.\n\nWaltz later wrote that the mission had been successful. \"The first target—their top missile guy—was positively ID’d walking into his girlfriend's building. It’s now collapsed.\"\n\nTrump administration officials have insisted that nothing classified was shared over the chat.\n\n\"No locations. No sources & methods. NO WAR PLANS,\" Waltz wrote on X last week.\n\nHegseth's office told Fox News Digital it does not comment on ongoing investigations and referred to the inspector general's office.\n\nGovernment officials frequently use Signal to communicate, even for sensitive information, as they don't always have access to a sensitive compartmented information facility (SCIF).\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}