{
    "question": "In what ways could Hungary’s decision to begin withdrawing from the ICC, announced during Netanyahu’s four-day visit under an ICC warrant, influence perceptions of the court’s authority and other states’ cooperation with it?",
    "content": {
        "source_1": "Israeli PM, who is wanted by the court, hails Viktor Orbán’s ‘bold and principled’ decision to leave the ‘corrupt’ body\n\nHungary will leave the international criminal court because it has become “political”, the country’s prime minister,Viktor Orbán, said as he welcomed his Israeli counterpart, Benjamin Netanhayu – the subject of an ICC arrest warrant – to Budapest for an official visit.\n\nStanding beside Netanyahu at the start of the four-day visit, Orbàn saidHungarywas convinced the “otherwise very important court” had “diminished into a political forum”.\n\nNetanyahu hailed “a bold and principled” decision. “I thank you, Viktor … It’s important for all democracies,” the Israeli prime minister said. “It’s important to stand up to this corrupt organisation.” Netanyahu has been underan international arrest warrantsince November over allegations of war crimes in Gaza.\n\nHe also said he believedIsraeland Hungary, both of which are led by rightwing nationalist governments, were “fighting a similar battle for the future of our common civilisation, our Judeo-Christian civilisation”.\n\nOrbán’s chief of staff, Gergely Gulyás, announced shortly after Netanyahu landed at Budapest airport that the government would “initiate the withdrawal procedure on Thursday in accordance with the constitutional and international legal framework”.\n\nLeaving the court, to which all 27 EU members belong, would entail first passing a bill through parliament, dominated by Orbán’s Fidesz party, then formally notifying the UN secretary general’s office. Withdrawal would come into effect one year later.\n\nIsrael’s foreign minister, Gideon Saar, welcomed what he termed an “important decision”, adding that the “so-called international criminal court” had “lost its moral authority after trampling the fundamental principles of international law in its zest for harming Israel’s right to self-defence”.\n\nThe Dutch foreign minister, Caspar Veldkamp, however, told reporters on the sidelines of a Nato meeting in Brussels that as long as Hungary remained officially a member of the ICC, it should “fulfil all its obligations to the court”.\n\nThe ICC’s governing body voiced concern over Hungary’s decision, saying any departure “clouds our shared quest for justice and weakens our resolve to fight impunity”. It said the court was “at the centre of the global commitment to accountability” and the international community should “support it without reservation”.\n\nNetanyahu was welcomed in Budapest in an official ceremony, standing alongside Orbán as a military band played and cavalry carrying swords and bayonets passed by. He is expected to tour Budapest’s Holocaust Museum and hold a number of political meetings before leaving on Sunday.\n\nOrbán invited his Israeli counterpart to visit in November, the day after the ICC, which is based in the Hague and is the world’s only permanent global tribunal for war crimes and genocide,issued the warrant. The ICC’s move was described by Israel as politically motivated and fuelled by antisemitism.\n\nNetanyahu’s government has repeatedly said the court has lost its legitimacy by issuing a warrant against a democratically elected leader exercising his country’s right to self-defence after the October 2023 attack by Hamas-led fighters on southern Israel.\n\nLiz Evenson, the international justice director at Human Rights Watch, said Hungary’s withdrawal would “demonstrate how far Orbán’s government is willing to go to diminish protection of human rights globally and respect for the rule of law for people including in Hungary”.\n\nThe country’s ICC obligations “remain intact”, Evenson said. In principle, Hungary, a founding member of the ICC treaty, should be required to detain and extradite anyone subject to a warrant from the court.\n\nBudapest, however, argues it never promulgated the law, so ICC measures cannot legally be carried out within Hungary. Many legal experts say that as a signatory and ratified state party, Hungary is nonetheless obliged to uphold the ICC’s Rome statute.\n\nOrbán, in any case, has said he would not respect the court’s Israel ruling, which he has previously described as “brazen, cynical and completely unacceptable”.\n\nThe Hungarian prime minister has strongly supported Netanyahu for many years, embracing him as an ally who shares the same conservative, sovereignist and authoritarian views. Hungary has frequently blocked EU statements or sanctions against Israel.\n\nThe visit marks Netanyahu’s second trip abroad since ICC warrants were announced against him and his former defence chief Yoav Gallant, as well as for the Hamas leaderMohammed Deif. In February, hetravelled to the US, which – like Israel, Russia and China – is not a member of the ICC.\n\nFor the Israeli prime minister, the visit is a chance to show – at a time of mounting criticism of his leadership and a lengthening list of domestic scandals – that despite widespread international opposition to Israel’s conduct of the war he remains a leader on the world stage. For Orbán, it is another act of attention-grabbing defiance.\n\nICC judges said when they issued the warrant that there were reasonable grounds to believe Netanyahu and Gallant were criminally responsible for acts including murder, persecution and starvation as a weapon of war.\n\nEU members are divided over whether to enforce the warrants, with some, such as Spain, the Netherlands and Finland, saying they would enforce them and others, including Germany and Poland, suggesting they could find a way for Netanyahu to visit without being arrested. France has said Netanyahu should be immune from the warrant since Israel is not an ICC member.\n\nThe court, whose 124 members also include the UK, Canada, Australia, Brazil, Japan and many African, Latin American and Asia-Pacific countries, aims to pursue people responsible for grave crimes when countries cannot or will not do so themselves.\n\nIt has opened more than 30 cases for alleged war crimes, crimes against humanity, genocide and offences against the administration of justice, but is hampered by a lack of recognition and enforcement. Only Burundi and the Philippines have so far left the ICC.",
        "source_2": "This is Radio Schuman, your new go-to podcast to spice up your weekday mornings with relevant news, insights, and behind-the-scenes from Brussels and beyond.\n\nFrom the economy to the climate and the EU's role in world affairs, this talk show sheds light on European affairs and the issues that impact on our daily lives as Europeans. Tune in to understand the ins and outs of European politics.\n\nNo agenda, no argument, no bias, No Comment. Get the story without commentary.\n\nDare to imagine the future with business and tech visionaries\n\nEuronews Tech Talks goes beyond discussions to explore the impact of new technologies on our lives. With explanations, engaging Q&As, and lively conversations, the podcast provides valuable insights into the intersection of technology and society.\n\nEurope's water is under increasing pressure. Pollution, droughts, floods are taking their toll on our drinking water, lakes, rivers and coastlines. Join us on a journey around Europe to see why protecting ecosystems matters, how our wastewater can be better managed, and to discover some of the best water solutions.   Video reports, an animated explainer series and live debate - find out why Water Matters, from Euronews.\n\nWe give you the latest climate facts from the world’s leading source, analyse the trends and explain how our planet is changing. We meet the experts on the front line of climate change who explore new strategies to mitigate and adapt.\n\nThis is Radio Schuman, your new go-to podcast to spice up your weekday mornings with relevant news, insights, and behind-the-scenes from Brussels and beyond.\n\nFrom the economy to the climate and the EU's role in world affairs, this talk show sheds light on European affairs and the issues that impact on our daily lives as Europeans. Tune in to understand the ins and outs of European politics.\n\nNo agenda, no argument, no bias, No Comment. Get the story without commentary.\n\nDare to imagine the future with business and tech visionaries\n\nEuronews Tech Talks goes beyond discussions to explore the impact of new technologies on our lives. With explanations, engaging Q&As, and lively conversations, the podcast provides valuable insights into the intersection of technology and society.\n\nEurope's water is under increasing pressure. Pollution, droughts, floods are taking their toll on our drinking water, lakes, rivers and coastlines. Join us on a journey around Europe to see why protecting ecosystems matters, how our wastewater can be better managed, and to discover some of the best water solutions.   Video reports, an animated explainer series and live debate - find out why Water Matters, from Euronews.\n\nWe give you the latest climate facts from the world’s leading source, analyse the trends and explain how our planet is changing. We meet the experts on the front line of climate change who explore new strategies to mitigate and adapt.\n\nHungary has decided that the country will withdraw from the International Criminal Court (ICC), the government said on Thursday, shortly after Israeli Prime Minister Benjamin Netanyahu arrived in the country for a state visit.\n\n\"The government will initiate the withdrawal procedure on Thursday, in accordance with the constitutional and international legal framework,\" said Gergely Gulyás, chief of staff for Hungarian Prime Minister Viktor Orbán.\n\nThe ICC has faced increasing controversy in recent years, in particular because of the arrest warrants issued against Russian President Vladimir Putin and Netanyahu.\n\nIsrael's PM arrived in the Hungarian capital, Budapest, on Wednesday despite an ICC warrant against him over his conduct of the war in the Gaza Strip.\n\nGulyás criticised the ICC for supposedly deviating from its original purpose and becoming a \"political body\", citing the arrest warrant against Netanyahu.\n\nHe argued that since Hungary has never enshrined the ICC's founding 1998 Rome Statute in domestic law, the court's arrest warrants cannot be executed in the country.\n\nGulyás referred to the fact that the world's major military powers have never been members of the ICC, and that the US has imposed sanctions on the organisation.\n\nGulyás also pointed to Poland, where Prime Minister Donald Tusk said in January that Netanyahu would not be arrested if he visited a Auschwitz memorial event, despite the ICC warrant against him.\n\nIssued in November, the ICC warrant said there was reason to believe Netanyahu and former Israeli Defence Minister Yoav Gallant used \"starvation as a method of warfare\" by restricting humanitarian aid to the Gaza Strip, and intentionally targeted civilians in Israel’s campaign against Hamas — charges that Israeli officials deny.\n\nIn response to the warrant, Orbán invited Netanyahu for a state visit and accused the ICC of \"interfering in an ongoing conflict for political purposes,\" saying the move undermined international law and escalated tensions.\n\nThe first country to leave the ICC was Burundi, in 2017. South Africa and the Gambia have both threatened to leave, but have reversed or halted their decisions to do so. All three states claim the court is biased against African countries.\n\nThe Philippines left the court in 2019, but its former president, Rodrigo Duterte is under arrest and currently facing prosecution on murder charges stemming from his infamous \"war on drugs\".",
        "source_3": "Hungary iswithdrawing from the International Criminal Court(ICC), the head of the Prime Minister’s Office announced on Thursday. The announcement coincided with the arrival of Israeli Prime Minister Benjamin Netanyahu in Budapest, where he is set to meet with Hungarian Prime Minister Viktor Orbán.\n\nUnder the Rome Statute, which established the ICC in 2002, Netanyahu would technically be subject to arrest by Hungarian authorities, as an international warrant has been in force against him since November 2024. However, Hungary stated at the time that it would not comply with the warrant. In line with that position, Orbáninvited Netanyahu to visit the country, calling the decision of the Hague-based court ‘absurd and shameful’. He has now become the first leader of an ICC member state to host the Israeli prime minister since the warrant was issued.\n\nMinister Gergely Gulyás confirmed that Hungary will initiate the formal termination procedure on Thursday, in line with constitutional and international legal obligations.\n\nAs previously reported byHungarian Conservative, Orbán allegedly instructed three of his ministers in May 2024 to examine thepotential consequences of Hungary leaving the ICC’s jurisdiction. At the time speculation was already circulating regarding a possible warrant against Netanyahu.\n\nThe ICC currently has 124 member states, including every European country except Türkiye, Belarus, Monaco, and the Vatican. However, several major global players—including the United States, Russia, China, Ukraine, and Israel—are not members.\n\nThe decision aligns with Hungary’s long-standing scepticism toward the court. In March 2023, when the ICC issued a warrant for Russian President Vladimir Putin, Gulyás stated that Hungary would not arrest him if he entered the country.\n\nFollowing former US President DonaldTrump’s move to withdrawthe United States from the World Health Organization and his imposition of sanctions on ICC prosecutor Karim Khan and other court officials, Hungary also hinted at a possible exit. At the time, Orbán posted on X: ‘It’s time for Hungary to review what we’re doing in an international organization that is under US sanctions!’\n\nNetanyahu is scheduled to meet Orbán on Thursday afternoon and is expected to hold several diplomatic meetings during his stay in Hungary, which will last until Sunday.\n\nHungarian Conservative is a quarterly magazine on contemporary political, philosophical and cultural issues from a conservative perspective."
    }
}