{
    "question": "How does this case reflect the application of Georgia’s fetal personhood law to miscarriages, and what practical steps could policymakers, clinicians, and law enforcement take to provide clear, compassionate guidance on handling fetal remains?",
    "content": {
        "source_1": "In late March 2025, rumors spread online about a Georgia woman being arrested after she had a miscarriage.\n\nSomesocial mediausersclaimed the woman was arrested specifically for having a miscarriage, whileotherssaidshe wasn't arrested for having a miscarriage but for putting a fetus' remains in a dumpster. Other versions of the claim appeared onFacebookandBluesky. Numerous newsmediaoutletsreported on the story, including women-focused publicationJezebel, of which the outlet'sheadlineread: \"Georgia Police Jailed Woman for Miscarriage and Performed Autopsy on Her Miscarried Fetus.\"\n\nBREAKING: a 24 year old woman in Georgia has been arrested for having a miscarriage. A MISCARRIAGE. Police are saying she \"concealed the remains of a dead body\" because she didn't call them \"fast enough.\"This is the future republicans want for America\n\nSnopes readers also wrote in to ask whether a Georgia woman was either arrested for a miscarriage or arrested for \"disposing of the fetus in a dumpster.\" Some readers asked for confirmation that the fetus underwent an autopsy.\n\nIt istruethat police in Tifton, Georgia, arrested 24-year-old Selena Maria Chandler-Scott after she had a miscarriage and that a witness reported Chandler-Scott put the bagged remains of the fetus in a dumpster. Officials charged Chandler-Scott with counts related to concealing a death and throwing away or abandoning a dead body, according to anews releasefrom the Tifton Police Department. In Georgia, a fetus has legal personhood, meaning fetuses receive the same legal protections that people do.\n\nChandler-Scott was not charged for the act of having a miscarriage but for her alleged actions afterward — although it is worth noting that it iscommonto dispose of miscarried remains in varying ways.\n\nHospitalsandmiscarriagedoulas—support providerswho are not medically trained but help and support women during and after pregnancy —note that people often flush the remains down the toilet. In fact, several media outlets, such asGlamour UKandCafeMom, have published pieces confronting this practice.\n\nPoliceacknowledgedthat emergency medical services determined she miscarried; still, officials sent the fetus for an autopsy \"to determine cause of death\" before charging Chandler-Scott. As of this writing, it has not yet been determined whether the area's prosecutor will take up this case or if the charges will be dismissed.\n\nOn March 20, 2025, Tifton policesaidthat \"at approximately 6:00 AM\" on that day, emergency medical services responded to a call about an \"unconscious female who was bleeding.\" Here is the rest of the news release (emphasis ours):\n\nUpon arrival,EMS determined that the woman had suffered a miscarriage earlier.She was immediately transported to Tift Regional Medical Center for treatment.\n\nDuring the response, awitness reported that the mother had earlier placed the fetus in a bag and placed that bag in a dumpster outside.Tifton Police responded to the scene and recovered the deceased fetus.The remains were sent for an autopsy to determine the cause of death.\n\nAt this time, no charges have been filed as the investigation is active and ongoing. Authorities are awaiting autopsy results and conducting further interviews to determine the appropriate course of action.\n\nOn March 21, the police departmentpublishedanother news release announcing \"the arrest and charges\" of Chandler-Scott:\n\n•One count of concealing the death of another person\n\n•One count of throwing away or abandonment of a dead body prohibited\n\nTift County deputy coroner Blair Veazey said that an autopsy determined the fetus was at a gestational age of 19 weeks — a fact first reported by Georgia television stationWALB. Veazeydeclinedto share any more details about the case with Snopes, but he reportedly told WALB News on March 25 that the fetus showed no signs of injury or trauma and that it never took a breath.\n\n\"It was determined that the mom just had a natural miscarriage,\" the WALB News story read. For context,in 2021, the Guinness Book of World Records named a baby born at a gestational age of21 weeks and one daythe most premature baby to ever survive. That baby, born in July 2020,still holdsthe record as of this writing.\n\nTifton policehad notreleased any other updates to the case as of this publication and did not immediately respond to a request for any updated information regarding the case. WALB Newsreportedthat Chandler-Scott's family put together aGoFundMefor financial support. The GoFundMe description said Chandler-Scott \"recently had a miscarriage which led to a series of unfortunate events.\"\n\n\"In these sensitive moments of her life, it has caused not only her but her family emotional, financial, and mental stress,\" the description continued.\n\nPolice appear to be charging Chandler-Scott under Georgia's Living Infants Fairness and Equality (LIFE) Act, whichpassedin 2019 but was foundunenforceablein 2020 by afederal court. After the U.S. Supreme Courtstruck downthe federal right to an abortion under Roe v. Wade in 2022, court battles over the LIFE Act ensued, and the Georgia Supreme Court eventually reinstated the law inOctober 2024.\n\nTheLIFE Actis best known as Georgia's six-week abortion ban — but it also legally defines a fetus as a person (seeline 63, page 19, in which the law defines a \"natural person\" as any human being \"including an unborn child\"). On lines 72 and 73, the law defines \"unborn child\" as \"a member of the species Homo sapiens at any stage of development who is carried in the womb.\"AccordingtoPregnancy Justice, a nonprofit organization advocating for the rights of pregnant people, at least11 states(see page 6) have broad so-called \"fetal personhood\" laws.\n\nDue to this language, the LIFE Act's provisions make any laws that are applicable to a person equally applicable to a fetus — for example,the state determinedthat, per the LIFE Act, the Department of Revenue \"will recognize any unborn child with a detectable human heartbeat ...as eligible for the Georgia individual income tax dependent exemption\"under dependent status because the child is legally a person. In Chandler-Scott's case,police appear to be charging herusing the LIFE Act's definition of personhood under laws that govern thetreatmentandnotificationof a person's dead body.\n\nThe firstlawChandler-Scott allegedly violated explicitly refers to \"concealing the death of any other person.\" The punishment for concealing a death of a person is one to 10 years in prison or a fine between $1,000 and $5,000 — or both. The secondlawshe was accused of violating states \"any person who throws away or abandons any dead human body or portion of such dead body\" will be subject to one to three years in prison. Notably, this law does not refer to a human body as a \"person.\"\n\nIn fact, on March 31, Tift County district attorney Patrick Warren reportedlytoldWALB News that he could not comment on the case but did provide this statement (emphasis ours):\n\nThere isno specific Georgia statute or case law that addresses an individual's choice to dispose of a naturally miscarried, non-viable fetusas it is generally deemed a medical condition andprosecution is not warranted.Georgia courts have held that once a baby is 'born alive and has had an independent and separate existence from its mother' then what happens to the child (injury or death) can be subject to criminal prosecution.\n\nGeorgia does havea lawon the proper disposal of aborted fetal remains, but that law does not mention fetal remains due to miscarriage. Similarly,a lawon registering fetal deaths only governs what the relevant authority or physician should do, not the person who was pregnant. WALB Newsreportedthat Warren's office is waiting to receive the \"completed case file\" and will \"determine whether to proceed, and, if so, for what charges.\" It wasnot possibleto reach Warren to independently verify his comments. We will update this article if that changes.\n\nChandler-Scott is reportedly not the first person in the U.S. to be charged in relation to a miscarriage after the fall of Roe v. Wade. On page two of a September 2024reportby Pregnancy Justice, the organization said that at least 210 people have faced criminal charges related to pregnancy, pregnancy loss and birth, and that 22 of those cases involved \"a fetal or infant demise and allegations regarding conduct concerning pregnancy, pregnancy loss, or birth.\"\n\n\"After a Miscarriage.\"The Miscarriage Association, www.miscarriageassociation.org.uk/information/miscarriage/after-a-miscarriage/. Accessed 31 Mar. 2025.\n\nAllen, Lenah. \"Autopsy Reveals New Details Related to Fetus Found in Tifton Dumpster.\"Https://Www.walb.com, WALB, 25 Mar. 2025, www.walb.com/2025/03/25/autopsy-reveals-new-details-related-fetus-found-tifton-dumpster/. Accessed 31 Mar. 2025.\n\nGeorgia General Assembly. Code of Georgia. Accessed 31 Mar. 2025. https://advance.lexis.com/container/?pdmfid=1000516&crid=1f0301ab-da08-4414-a8e3-7dfc27badf1f&config=00JAAzZDgzNzU2ZC05MDA0LTRmMDItYjkzMS0xOGY3MjE3OWNlODIKAFBvZENhdGFsb2fcIFfJnJ2IC8XZi1AYM4Ne&ecomp=hh6ck&prid=b317e51d-d147-4d0b-87c8-e3723fd80943\n\n---. \"Tift Co. District Attorney Weighs in on Pending Fetus Case.\"Https://Www.walb.com, WALB, 31 Mar. 2025, www.walb.com/2025/03/31/tift-co-district-attorney-weighs-pending-fetus-case/. Accessed 31 Mar. 2025.\n\nAmy, Jeff. \"Federal Judge Voids Georgia 'Heartbeat' Abortion Restriction.\"AP News, 13 July 2020, apnews.com/article/6bdf1fc85ade3abaf1ac10eb94d60c29. Accessed 31 Mar. 2025.\n\nBach, Wendy, and Madalyn Wasilczuk. \"Pregnancy as a Crime: A Preliminary Report on the First Year after Dobbs.\"Pregnancy Justice, Sept. 2024, www.pregnancyjusticeus.org/wp-content/uploads/2024/09/Pregnancy-as-a-Crime.pdf.\n\n\"Donate to Selena's Family Is Grateful for Your Understanding Prayers, Organized by Selena Chandler-Scott GoFundMe.\"Gofundme.com, 2025, www.gofundme.com/f/selenas-family-is-grateful-for-your-understanding-prayers?lang=en_US. Accessed 31 Mar. 2025.\n\n\"Georgia General Assembly.\"Www.legis.ga.gov, 2019, www.legis.ga.gov/legislation/55445. Accessed 31 Mar. 2025.\n\n\"Guidance Related to House Bill 481, Living Infants and Fairness Equality (LIFE) Act.\"Georgia Department of Revenue, 1 Aug. 2022, dor.georgia.gov/press-releases/2022-08-01/guidance-related-house-bill-481-living-infants-and-fairness-equality-life. Accessed 31 Mar. 2025.\n\nJones, Steve C.SISTERSONG WOMEN of COLOR REPRODUCTIVE JUSTICE COLLECTIVE, on Behalf of Itself and Its Members, et Al., v. BRIAN KEMP, Governor of the State of Georgia, in His Official Capacity, et Al.13 July 2020, storage.courtlistener.com/recap/gov.uscourts.gand.265756/gov.uscourts.gand.265756.149.0_1.pdf. Accessed 31 Mar. 2025.\n\n\"Managing Miscarriage Remains.\"Uwhealth.org, patient.uwhealth.org/healthfacts/8296. Accessed 31 Mar. 2025.\n\nMillward, Adam. \"World's Most Premature Baby Defies Sub-1% Survival Odds to Break Record.\"Guinness World Records, 10 Nov. 2021, www.guinnessworldrecords.com/news/2021/11/worlds-most-premature-baby-defies-sub-1-survival-odds-to-break-record-681851. Accessed 31 Mar. 2025.\n\n\"Most Premature Baby.\"Guinness World Records, 4 July 2020, www.guinnessworldrecords.com/world-records/67461-most-premature-baby. Accessed 31 Mar. 2025.\n\nSetzler, Ed, et al. \"House Bill 481 .\"Ga.gov, 2019, www.legis.ga.gov/api/legislation/document/20192020/187013. Accessed 31 Mar. 2025.\n\n\"Stay Order in State of Georgia v. SisterSong Women of Color Reproductive Justice Collective Et. Al | American Civil Liberties Union.\"American Civil Liberties Union, 7 Oct. 2024, www.aclu.org/documents/stay-order-in-state-of-georgia-v-sistersong-women-of-color-reproductive-justice-collective-et-al. Accessed 31 Mar. 2025.\n\n\"The Legal Assault on Pregnant People's Personhood.\"Pregnancy Justice, Sept. 2024, www.pregnancyjusticeus.org/wp-content/uploads/2024/09/Fetal-personhood.pdf. Accessed 31 Mar. 2025.\n\n\"UPDATES INCLUDED: Tifton Police Recover Deceased Fetus at Local Apartment Complex Thursday.\"Tifton, GA, 21 Mar. 2025, www.tifton.net/CivicAlerts.aspx?AID=151. Accessed 31 Mar. 2025.\n\nGrace Deng specializes in government/politics and is based in Tacoma, Wash.",
        "source_2": "Update:All charges have been dropped. Read all about it here.\n\nA 24-year-old Tifton woman faces criminal charges after experiencing a miscarriage, raising concerns about the application of Georgia’s strict abortion legislation.\n\nWhat We Know:Selena Maria Chandler-Scott was arrested and charged with concealing the death of another person and abandonment of a dead body following a medical emergency on March 20. According to police reports, emergency services responded to Brookfield Mews Apartments around 6 a.m. Thursday after receiving a call about an unconscious woman who was bleeding. Medical personnel determined she had suffered a miscarriage and transported her to Tift Regional Medical Center for treatment.\n\nPolice claim a witness reported that Chandler-Scott had placed the fetal remains in a bag and disposed of it in a dumpster outside the apartment complex. Officers later recovered these remains, which were sent for autopsy.\n\nThe Autopsy:According to the autopsy, the fetus was 19 weeks old at the time of the miscarriage. There were no signs of trauma and the fetus did not take a breath. The coroner’s office ruled it to be a naturally occurring miscarriage. At 19 weeks, a fetus is about the size of a mango and lungs are just beginning to develop but are not fully developed yet.\n\nIn Context:Georgia’s “heartbeat law,” officially the Living Infants Fairness and Equality (LIFE) Act, bans most abortions after about six weeks of pregnancy. The law also grants personhood status to embryos and fetuses, potentially exposing women who miscarry to criminal charges if authorities believe they contributed to the pregnancy loss or improperly handled fetal remains.\n\nReproductive rights advocates have warned that such laws could criminalize women experiencing pregnancy complications or miscarriages. According to the American College of Obstetricians and Gynecologists, miscarriages occur in about 10-20% of known pregnancies, with most happening in the first trimester.\n\nWhat Should Women Who Miscarry Do?:We asked several Tifton Police Department and Tift County officials what women who miscarry should do with the remains of the fetus. So far, only Tift District Attorney Patrick Warren has answered and said typically miscarriages are not handled in this manner.\n\n“There is no applicable case law on this issue as it is generally deemed a medical condition and prosecution is not warranted. Georgia courts have held that once a baby is ‘born alive and has had an independent and separate existence from its mother’ then what happens to the child (injury or death) will be subject to criminal prosecution,” Warren said.\n\nWarren also clarified that his office did not participate in the warrant process in this case.\n\nChange Log:Updated March 28 at 12:53 p.m. to add information from the District Attorney’s office.\n\nB.T. Clark is an award-winning journalist and the Publisher of The Georgia Sun. He has 25 years of experience in journalism and served as Managing Editor of Neighbor Newspapers in metro Atlanta for 15 years and Digital Director at Times-Journal Inc. for 8 years. His work has appeared in several newspapers throughout the state including Neighbor Newspapers, The Cherokee Tribune and The Marietta Daily Journal. He is a Georgia native and a fifth-generation Georgian.",
        "source_3": "Update 4/6/2025: Charges have been dropped against a woman who was arrested last month after she put her miscarried baby’s remains in a dumpster in Georgia.\n\nSelena Chandler-Scott, 24, was charged with concealing the death of another person and abandoning a dead body after she had a miscarriage in March. Her baby was 19 weeks gestation and the state medical examiner ruled that he or she had not taken a breath and had died in the womb.\n\nA review of the case “indicated no signs of life or independent respiration occurred, and no evidence of trauma or foul play was present,” said District Attorney Patrick Warren.\n\nAccording to Warren, Georgia law states that in order for someone to be charged with these crimes, the other person must have been “born and existed separate and independent of its mother.” That did not happen in this case.\n\n3/30/2025: A woman in Georgia wasarrestedthis week after allegedly putting the body of her miscarried baby into a dumpster. She is charged with concealing the death of another person and one count of throwing away or abandoning a dead body.\n\nSelena Maria Chandler-Scott was found unconscious and bleeding by EMS. On the tip of a witness, police located the remains of her19-weekpreborn baby in a bag in a dumpster nearby. According to apress releasefrom the Tifton, Georgia police department, Chandler-Scott suffered a miscarriage. She was brought to a hospital for treatment and was not immediately charged.\n\nThe baby showed no signs of injury or trauma and was found to have never taken a breath.\n\nPreviable Baby Olivia at 18 weeks after fertilization (20 weeks LMP) (Image credit Live Action)\n\nAlthough media outlets are blaming the state’s pro-life law, that law was not the reason the woman was arrested.\n\nIn Georgia,concealing the death of a personis a felony, punishable by up to 10 years in prison and a fine of up to $5,000 if the concealment prevents authorities from learning if the person was killed unlawfully. Georgia code also prohibits a person fromthrowing awayor abandoning a dead human body, which is also a felony punishable by up to three years in prison.\n\nThe story is similar to that ofBrittany Watts, an Ohio woman who was arrested in 2023 after she attempted to flush the body of her second-trimester miscarried child down the toilet. She was charged with abuse of a corpse but a grand jury refused to indict her.\n\nA post shared by Secular Pro-Life (@secularprolife)\n\nIn response to the Chandler-Scott’s arrest, women toldSecular Pro-lifeof their own experiences with miscarriage and how there is no guidance provided on what to do with the baby’s body. Many hospitals dispose of the babies in medical waste or the garbage.\n\n“I was made fun of on the internet for wanting to keep our babies we lost so they wouldn’t be thrown away at the hospital,” said one woman. “I got the remains of our son who we lost through miscarriage at 14 weeks I had a d&c and the ob made an exception to have them give us. his remains after the lab processed them for 3 weeks. I walked out of the hospital with a biohazard bag that held the shredded remains of our baby… When we lost our twins…at 13 weeks the hospital refused to let us have their remains. … Our daughter… we lost at 15 weeks. She was born at home. I hemorrhaged and lost consciousness and was taken by ambulance to the hospital. I wouldn’t let them take her. We were able to take her home at discharge. … Because we were before 20 weeks the hospitals had no set protocol on how to deal with our losses.”\n\nAnother woman wrote, “I miscarried my son at 19w… I was induced because we weren’t sure how long ago he had passed …. I’d given birth 6 times before and i was still unprepared to deliver my small son’s body. The Dr said I should push because my contractions had already gotten him down low. I pushed and was absolutely shocked how fast it all happened. I started screaming and crying. They were trying to not let me look at him because I had expressed fears on what his body would look like. I then pleaded they let me look. They picked him up and put him in a receiving blanket dusted with baby powder so his skin wouldn’t stick to the fibers. I have no idea what I would have done if I had been alone at home….” She ultimately buried her son under her window with his own memorial statue and garden.\n\n“Miscarriage is hard and even if you feel like you have a plan, the shock of delivering your small dead child overrides your higher brain for a while,” she added.\n\nEditor’s Note 4/3/2025: This article was updated with quotes from women who have experienced miscarriage."
    }
}