{
    "question": "In what ways could Rep. Anna Paulina Luna’s resignation over her proxy voting proposal for new parents influence the House Freedom Caucus’s internal cohesion and the broader House debate on family-friendly voting policies?",
    "content": {
        "source_1": "Updated on:  April 1, 2025 / 10:43 AM EDT/ CBS News\n\nWashington— Republican Rep. Anna Paulina Luna of Florida withdrew her membership from the conservative House Freedom Caucus on Monday amid a divide over whether the lower chamber should allow new parents in Congress to vote remotely around the birth of their child.\n\n\"With a heavy heart, I am resigning from the Freedom Caucus,\" she wrote to her colleagues in a letter obtained by CBS News.\n\nLuna's discharge petition — a maneuver that allows members to circumvent House leadership — won enough support earlier this month to force a vote on a measure that would allow new parents to designate a colleague to vote for them for 12 weeks after they or their spouse gives birth. The bill would also allow that period to begin earlier if the lawmaker has a serious medical condition or isn't able to travel safely.\n\nBut House Speaker Mike Johnson, a Louisiana Republican, opposes proxy voting, calling it unconstitutional. Heconfirmedlast week discussions were taking place about how to block the measure.\n\nIn her letter, Luna accused House Freedom Caucus members of threatening Johnson with halting floor proceedings indefinitely unless he changed the rules governing House votes to block her effort.\n\n\"This tactic was not just a betrayal of trust; it was a descent into the very behavior we have long condemned — a practice that we, as a group, have repeatedly criticized leadership for allowing,\" she wrote, adding that her respect for those colleagues had been \"shattered.\"\n\nLuna said last week that Republicans who backed her effort were being pressured to drop their support. The members were told that their bills would not be brought up for floor votes and that the party would not help with fundraising, according to Luna.\n\nOn Tuesday, Republicans moved to quash it through the House Rules Committee by inserting language that would effectively kill the discharge petition into a rule on unrelated legislation. Lawmakers could still defeat the rule in a floor vote later Tuesday.\n\nRep. Chip Roy, a Texas Republican, argued during the meeting that the measure allowing new parents to vote remotely opens the door for members to abuse the practice.\n\n\"We're not talking about blanket proxy voting,\" Rep. Jim McGovern of Massachusetts, the top Democrat on the House Rules Committee, fired back. \"We're talking about proxy voting for new parents.\"\n\nDemocrats institutedproxy votingduring thepandemic, but thepracticewas ended by Republicans when they took control of the House in 2023.\n\nCaitlin Yilek is a politics reporter at CBSNews.com, based in Washington, D.C. She previously worked for the Washington Examiner and The Hill, and was a member of the 2022 Paul Miller Washington Reporting Fellowship with the National Press Foundation.",
        "source_2": "Gabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nAdeola Adeosun is the Newsweek Weekend Night Editor based in Atlanta, Georgia. Her focus is reporting on U.S. national news, politics and trends. Adeola joined Newsweek in 2024 and has previously worked for CNN, Bossip, and The Messenger. You can get in touch with Adeola by emailing a.adeosun@newsweek.com. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nRepublican RepresentativeAnna Paulina Lunaof Florida announced Monday that she has resigned from theHouse Freedom Caucusafter the group moved to block a vote on her proposal that would allow new parents inCongressto vote by proxy instead of traveling with newborns.\n\nNewsweekreached out to Luna via email on Monday for comment.\n\nLuna's resignation marks the fourth member the Freedom Caucus has lost or ejected in the past two years, highlighting growing internal divisions within the influential conservative bloc. The conflict centers on a family-friendly policy proposal that has become unexpectedly contentious withinRepublicanranks.\n\nThe ongoing tension highlights challenges for Republican leadership in balancing traditional positions with family-friendly workplace policies.\n\nIt may also further fracture the House Freedom Caucus, which previously ejected RepresentativeMarjorie Taylor Greeneover her support for then-SpeakerKevin McCarthyand RepresentativeWarren Davidsonfor endorsing a primary challenger to then-Freedom Caucus chair Bob Good, which prompted Representative Troy Nehls to resign in protest.\n\nLuna initiated a discharge petition to force a floor vote on her proxy voting measure for new parents. In response, some Freedom Caucus members reportedly threatened to halt floor proceedings indefinitely unless House SpeakerMike Johnsonaltered the rules to block her petition.\n\nThe conflict escalated when Freedom Caucus members on the House Rules Committee attempted to tie Luna's petition to a rule that would kill it by attaching it to the SAVE Act. Luna characterized this as an attempt to misrepresent her and other supporters of the proposal as \"obstructing the President and opposing election integrity.\"\n\nThe lawmaker noted that fewer than 14 mothers have served in Congress throughout U.S. history, framing her proposal as a \"modest, family-centered\" initiative. Luna also pointed out that while she has never voted by proxy herself, one Freedom Caucus member on the Rules Committee who opposes her proposal has voted by proxy over 30 times.\n\nRepresentative Anna Paulina Luna, in a statement:\"With a heavy heart, I am resigning from the Freedom Caucus. I cannot remain part of a caucus where a select few operate outside its guidelines, misuse its name, broker backroom deals that undermine its core values...\"\n\nLuna on Freedom Caucus leadership:\"Chairman Harris, I appreciate your willingness to discuss this with me... Your gentlemanly approach throughout this process has been a model of integrity.\"\n\nLuna on Congressional Duty:\"The Constitution entrusts us with a sacred duty to serve, not to manipulate rules for power or to silence dissent. When we abandon that duty, we erode the very foundation we claim to defend.\"\n\nMelik Abdul, political strategist and commentator, on X, formerly Twitter:\"Despite employing the practice, the Right objected to a 3mo proposal allowing new moms/dads to vote by proxy. Rep. Luna resigned from the Freedom Caucus because of it. This is the consequence of political orthodoxy.\"\n\nThe IndependentDC Bureau Chief Eric Michael Garcia, on X:\"The Freedom Caucus started because conservatives objected to the fact that legislation that had majority support would not get a vote on the floor. Now, the Freedom Caucus is blocking legislation that has majority support.\"\n\nLuna's resignation comes as Johnson reportedly attempts to add a provision to a broader Republican procedural measure that would effectively kill her proposed rule change. The discharge petition Luna initiated would force a vote if it receives signatures from 218 House members.\n\nUpdate 3/31/25, 6:07 p.m. ET: This article was updated with additional information.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nAdeola Adeosun is the Newsweek Weekend Night Editor based in Atlanta, Georgia. Her focus is reporting on U.S. national news, politics and trends. Adeola joined Newsweek in 2024 and has previously worked for CNN, Bossip, and The Messenger. You can get in touch with Adeola by emailing a.adeosun@newsweek.com. Languages: English.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he                                    ...Read more",
        "source_3": "Fox News senior congressional correspondent Chad Pergram explains a proposal to allow proxy voting for new parents in Congress on ‘Fox News Live.’\n\nRep.Anna Paulina Luna, R-Fla., is resigning from the House Freedom Caucus, she announced in a letter to fellow conservatives on Monday.\n\nIt's the latest escalation in her fight against House GOP leaders and a small group of members on the right flank of their conference over the issue of proxy voting. Luna has teamed up with Democrats and several other Republicans on a mechanism aimed at forcing consideration of legislation that allows new parents in the House to vote remotely for 12 weeks around their baby's birth.\n\n\"I have consistently supported each of you, even in moments of disagreement, honoring the mutual respect that has guided our caucus,\" Luna wrote. \"That respect, however, was shattered last week.\"\n\nEXPERT TURNS TABLES ON DEM CRITICS AFTER MUSK ACCUSES SOCIAL SECURITY OF BEING ‘PONZI SCHEME’\n\nRep. Anna Paulina Luna, R-Fla., resigned from the House Freedom Caucus(Getty Images)\n\nThe focus of her anger is a brief incident from earlier this month when a group of House conservatives held up a chamber-wide vote on unrelated legislation to pressGOP leadersto kill Luna's measure – known as a \"discharge petition.\"\n\nA discharge petition allows lawmakers to force a bill onto the House floor, despite objections from leadership, provided the mechanism gets signatures from a majority of the chamber.\n\n\"Acting within the House conference rules – rules we all agreed to – I sought to bring a vote to the floor on a measure that would allow new mothers in Congress (fewer than 14 in our nation's history) and fathers, if they choose, to vote by proxy,\" Luna continued.\n\n\"This was a modest, family-centered proposal. Yet, a small group among us threatened the Speaker, vowing to halt floor proceedings indefinitely – regardless of the legislation at stake, including President Trump's agenda – unless he altered the rules to block my discharge petition.\"\n\nShe praised House Freedom Caucus chair Andy Harris' conduct(Getty Images)\n\nShe shared praise for House Freedom Caucus Chairman Andy Harris, R-Md., whose conduct she called \"gentlemanly,\" but added, \"With a heavy heart, I am resigning from the Freedom Caucus.\"\n\n\"I cannot remain part of a caucus where a select few operate outside its guidelines, misuse its name, broker backroom deals that undermine its core values and where the lines of compromise and transaction are blurred, disparage me to the press, and encourage misrepresentation of me to the American people,\" Luna wrote.\n\nShe will be the first House Freedom Caucus member to leave the group, which does not advertise its membership, in the 119th Congress.\n\nThe most recent departures before Luna include Reps. Warren Davidson, R-Ohio, and Randy Weber, R-Texas, who were both pushed out, and Rep. Troy Nehls, R-Texas, who left during the shakeup.\n\nAPPEALS COURT RULES DOGE CAN CONTINUE OPERATING AT USAID IN ANOTHER WIN FOR TRUMP ADMINISTRATION\n\nSpeaker Mike Johnson, R-La., said he believed proxy voting was \"unconstitutional\" in remarks afterHouse Republicans'weekly closed-door meeting on Tuesday.\n\n\"We addressed this in conference this morning. A couple of our, a handful of our colleagues, have gotten behind the effort, and, look, I'm a father. I'm pro-family,\" the speaker said. \"Here's the problem. If you create a proxy vote opportunity just for young parents, mothers and, the fathers in those situations, then where is the limiting principle?\"\n\nRep. Chip Roy, R-Texas, one of Luna's now-former House Freedom Caucus colleagues, wrote on X of the issue, \"Respectfully to my friend – this (unconstitutional) rule would ultimately NOT be limited to moms. Cancer patients, dads, & worst of all, people who lazily abuse it (eg, voting from boats). She leaves out her discharge allows no amendments! We should show up to work/vote.\"\n\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\n\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}