{
    "question": "In what ways could President Trump’s executive order to eliminate “improper, divisive, or anti-American ideology” across the Smithsonian influence how museums curate exhibits on contested histories and decide which narratives to highlight?",
    "content": {
        "source_1": "The entry to the Smithsonian Institution's Smithsonian Castle in Washington, D.C.Manuel Balce Ceneta/APhide caption\n\nPresident Trump signed an executive order on Thursday directing Vice President Vance to eliminate \"divisive race-centered ideology\" from Smithsonian museums, educational and research centers, and the National Zoo.\n\nTitled \"Restoring Truth and Sanity to American History,\" the order states, \"Once widely respected as a symbol of American excellence and a global icon of cultural achievement, the Smithsonian Institution has, in recent years, come under the influence of a divisive, race-centered ideology. This shift has promoted narratives that portray American and Western values as inherently harmful and oppressive.\" It goes on to say: \"Museums in our Nation's capital should be places where individuals go to learn — not to be subjected to ideological indoctrination or divisive narratives that distort our shared history.\"\n\nThe order calls for Vance, along with Vince Haley, the assistant to the president for domestic policy, and Lindsey Halligan, the special assistant to the president and senior associate staff secretary, to work with Congress to prohibit the Smithsonian from receiving appropriations for exhibitions and programs that \"degrade shared American values, divide Americans based on race, or promote programs or ideologies inconsistent with Federal law and policy.\" It also requests that future appropriations \"celebrate the achievements of women in the American Women's History Museum and do not recognize men as women in any respect in the Museum.\"\n\nNPR reached out to the Smithsonian for comment but hasn't heard back.\n\nThe executive order further calls for the appointment of citizen members to the Smithsonian Board of Regents committed to advancing the policy of the order.\n\nThis is the latest in a series of executive orders issued by the president since he took office in January aimed at rolling back diversity, equity and inclusion (DEI) efforts previously promoted by federal agencies — among them the National Endowment for the Arts'Challenge America program. It primarily supported small nonprofits reaching \"historically underserved communities that have limited access to the arts relative to geography, ethnicity, economics, and/or disability.\"\n\nThis latest order blames the Biden administration for advancing a \"corrosive ideology\" that, it states, sought to revise historical truth. \"Over the past decade, Americans have witnessed a concerted and widespread effort to rewrite our Nation's history, replacing objective facts with a distorted narrative driven by ideology rather than truth,\" the order states. \"Under this historical revision, our Nation's unparalleled legacy of advancing liberty, individual rights, and human happiness is reconstructed as inherently racist, sexist, oppressive, or otherwise irredeemably flawed.\"\n\nThe order includes additional provisions seeking to reinstate public monuments, memorials and statues that were \"removed or changed to perpetuate a false reconstruction of American history, inappropriately minimize the value of certain historical events or figures, or include any other improper partisan ideology,\" as well as improve the infrastructure of Independence National Historical Park in time for the 250th anniversary of the signing of the Declaration of Independence in 2026.\n\nMembers of the academic and cultural communities responded to NPR's requests for comment about the new order.\n\nChandra Manning, a history professor at Georgetown University, said the executive order is rooted in, \"the unfounded fear that Americans cannot handle the full story of our nation's past.\"\n\n\"The exhibits at the Smithsonian sometimes challenge us to face the contradictions between our highest ideals and actual events and facts,\" said Carol Quillen, president and CEO of the National Trust for Historic Preservation. \"Americans welcome this challenge precisely because we strive to realize the promise of this country's founding.\"\n\nPerformer and cultural strategist, Marc Bamuthi Joseph, former head of Social Impact at the John F. Kennedy Center for the Performing Arts in Washington DC,said the wording of the executive order is ill-informed.\n\n\" To say the Smithsonian Institution has an anti-American agenda is to reveal a complete misunderstanding of what America's supposed to be,\" Joseph said.\n\nJoseph and six other members of his team werelaid offearlier this week as part of the Trump administration's overhaul of the cultural center.",
        "source_2": "Marni Rose McFall is a Newsweek reporter based in London, U.K. Her focus is on internet trends, U.S. politics and popular culture. She has covered fashion, culture, art and music extensively. Marni joined Newsweek in 2024 from Frasers Group and had previously written for Cosmopolitan, Schon, The Fall and Voir Fashion. She is a graduate of The University of Edinburgh. You can get in touch with Marni by emailing m.mcfall@newsweek.com.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nPresidentDonald Trump's most recent executive order targets multiple museums, including the National Museum of African American History and Culture (NMAAHC), which former PresidentBarack Obamaopened during his second term.\n\nThe order, Restoring Truth and Sanity to American History, is part of the administration's effort to eliminate what it describes as \"improper ideology\" across all branches of the Smithsonian Institution. The move has sparked significant backlash online, including from volunteers at the museum.\n\nNewsweekhas contacted the NMAAHC for comment via an online contact form.\n\nThe NMAAHC is a Smithsonian museum located on the National Mall in Washington, D.C. In 2016, Obama opened the museum, which is dedicated to the documentation of the African American experience, at its permanent location. The NMAAHC houses more than 40,000 cultural and historical artifacts, including items related to slavery, segregation and the civil rights movement.\n\nSocial media users have criticized Trump's order as an attempt toerase African American history.\n\nIn his executive order, Trump said, \"Over the past decade, Americans have witnessed a concerted and widespread effort to rewrite our Nation's history, replacing objective facts with a distorted narrative driven by ideology rather than truth.\"\n\nThe order calls out the NMAAHC for promoting what it describes as \"divisive narratives.\" It also highlights the Women's History Museum, which is in development.\n\nBacklash to the order has been pronounced online, with volunteers at the museum sharing their concerns.\n\nHenry M. Rosenberg wrote on X, formerlyTwitter, \"I volunteer at the @NMAAHC in the Family History Center where we help people trace their genealogy back to slavery. The rest of the museum talks about the slave trade, slavery & Civil Rights. Let that f****** piece of s*** try to change that.\"\n\nAnother user said on the platform, \"I've worked for the Smithsonian and visited many of the museums in D.C. including the NMAAHC. It was such a phenomenal feeling being there. Sometimes history is hard and painful, but needs to be seen and heard so it's not repeated and that is not anti-American as he claims.\"\n\nOne commenter described the order as \"a direct attack,\" while another said, \"The irony is that the 'Restoring Truth and Sanity to American History' order to attack the Smithsonian will do the exact opposite. Their primary target will be the @NMAAHC in attempt to erase the truth.\"\n\nSince returning to office in January, the president has made changes to several cultural institutions. Last month,Trump installed himself as the chairof the John F. Kennedy Center for the Performing Arts. He indicated that he would bein charge of programmingat the institution and would end events featuring drag performers.\n\nThe administration also recentlyissued an ultimatum to Columbia University, and the Ivy League school made policy changes to avoid losing funding.\n\nThe National Museum of African American History and Culture said in the mission statement on its website: \"[The museum] shares the unvarnished truth of African American history and culture. We connect stories, scholarship, art, and artifacts from the past and present to illuminate the contributions, struggles, and triumphs that have shaped our nation. We forge new and compelling avenues for audiences to experience the arc of living history.\"\n\nPresident Donald Trump said in the executive order issued on Thursday: \"Museums in our Nation's capital should be places where individuals go to learn—not to be subjected to ideological indoctrination or divisive narratives that distort our shared history. To advance this policy, we will restore the Smithsonian Institution to its rightful place as a symbol of inspiration and American greatness.\"\n\nThe order directs Vice PresidentJD Vanceand Secretary of InteriorDoug Burgumto restore federal parks, monuments, memorials and statues \"that have been improperly removed or changed in the last five years to perpetuate a false revision of history or improperly minimize or disparage certain historical figures or events.\"\n\nIt also requires agencies to complete restorations and upgrades to Independence Hall ahead of the United States' 250th anniversary in 2026.\n\nDo you have a storyNewsweekshould be covering? Do you have any questions about this story? ContactLiveNews@newsweek.com.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nMarni Rose McFall is a Newsweek reporter based in London, U.K. Her focus is on internet trends, U.S. politics and popular culture. She has covered fashion, culture, art and music extensively. Marni joined Newsweek in 2024 from Frasers Group and had previously written for Cosmopolitan, Schon, The Fall and Voir Fashion. She is a graduate of The University of Edinburgh. You can get in touch with Marni by emailing m.mcfall@newsweek.com.\n\nMarni Rose McFall is a Newsweek reporter based in London, U.K. Her focus is on internet trends, U.S. politics and popular culture. She has covered fashion, culture, art and music extensively. Marni joined Newsweek in 2024 from Frasers Group and had previously written for Cosmopolitan, Schon, The Fall and Voir Fashion. She is a graduate of The University of Edinburgh. You can get in touch with Marni by emailing m.mcfall@newsweek.com.\n\nMarni Rose McFall is a Newsweek reporter based in London, U.K. Her focus is on internet trends, U.S. politics and                                    ...Read more",
        "source_3": "President Donald Trump signed an executive order on March 27 directing the removal of what he deemed “improper, divisive, or anti-American ideology” from facilities operated by the Smithsonian Institution."
    }
}