{
    "question": "In what ways could Homeland Security Secretary Kristi Noem’s visit to the El Salvador mega-prison holding deported Venezuelans shape U.S. immigration enforcement priorities, regional cooperation, and public perceptions of deportation practices?",
    "content": {
        "source_1": "US Homeland Security Secretary Kristi Noem on Wednesday visited the high-securityEl Salvador prisonwhere Venezuelans who the Trump administration alleges are gang members have been held since their removal from the United States. The tour included two crowded cell blocks, the armory and an isolation unit.\n\nNoem’s trip to the prison — where inmates are packed into cells and never allowed outside — comes as the Trump administration seeks to show it is deporting people it describes as the “worst of the worst.”\n\nThe Trump administration is arguing in federal court that it was justified in sending the Venezuelans to El Salvador, while human rights activists say officials have sent them to a prison rife with human rights abuses.\n\nAt the prison, Noem toured an area holding some of the Venezuelans accused of being gang members. In the sweltering building, the men in white T-shirts and shorts stared silently from their cell without making a sound.\n\nWhen Noem exited the building, the men could be heard shouting an indiscernible chant.\n\nIn a cell block holding Salvadoran prisoners, about a dozen were lined up by guards near the front of their cell and told to remove their T-shirts and face masks. The men were heavily tattooed, some bearing the letters MS, for the Mara Salvatrucha gang, on their chests.\n\nAfter listening to Salvadoran officials, Noem turned her back to the cell and recorded a video message.\n\nIf an immigrant commits a crime, “this is one of the consequences you could face,” Noem said. “First of all, do not come to our country illegally. You will be removed and you will be prosecuted. But know that this facility is one of the tools in our toolkit that we will use if you commit crimes against the American people.”\n\nAs Homeland Security Secretary Kristi Noem tours El Salvador’s Cecot prison, CNN’s David Culver takes you inside - offering a rare look at the controversial mega-prison where some alleged gang members deported from the US are now ending up.\n\nRelated videoDeported to a fortress: Go inside El Salvador’s Cecot prison\n\nIn a post on X Wednesday, Homeland Security indicated it would continue working with El Salvador, saying that Noem was slated to discuss how the US can “increase the number of deportation flights and removals of violent criminals from the US” during her visit with President Nayib Bukele.\n\nSince taking office, Noem has frequently been front and center in efforts to highlight the immigration crackdown. She took part in immigration enforcement operations, rode horses with Border Patrol agents and was the face of a television campaign warning people in the country illegally to self-deport.\n\nNoem’s Wednesday visit is part of a three-day trip. She’ll also travel to Colombia and Mexico.\n\nThe Venezuelans were removed from the US this month after Trump invoked the Alien Enemies Act of 1798 and said the US was being invaded by the Tren de Aragua gang. The Alien Enemies Act gives the president wartime powers and allows noncitizens to be deported without the opportunity to go before an immigration or federal court judge.\n\nIn a setback for the administration, an appeals court Wednesday kept in place an order barring the administration from deporting more Venezuelan immigrants to El Salvador under the Alien Enemies Act.\n\nA central outstanding question about the deportees’ status is when and how they could ever be released from the prison, called theTerrorism Confinement Center,as they are not serving sentences. They no longer appear in US Immigration and Customs Enforcement’s online detainee locator and have not appeared before a judge in El Salvador.\n\nThe Trump administration refers to them as the “worst of the worst” but hasn’t identified who was deported or provided evidence that they’re gang members.\n\nRelatives of some of the deportees have categorically denied any gang affiliation. The Venezuelan government and a group called the Families of Immigrants Committee in Venezuela hired a lawyer to help free those held in El Salvador. A lawyer for the firm, which currently represents about 30 Venezuelans, said they aren’t gang members and have no criminal records.\n\nThe US government has acknowledged that many do not have such records.\n\nFlights were in the air March 15 when a federal judge issued a verbal order temporarily barring the deportations and ordered planes to return to the US.\n\nThe Trump administration has argued that the judge’s verbal directions did not count, that only his written order needed to be followed and that it couldn’t apply to flights that had already left the US.\n\nWhite House press secretary Karoline Leavitt told reporters that about 261 people were deported on the flights, including 137 under the Alien Enemies Act.\n\nRelated article‘Historical loss’: Alleged gang leader evades US justice with deportation to El Salvador\n\nBukele opened the prison in 2023 as he made the Central American country’s stark, harsh prisons a trademark of his fight against crime. The facility has eight sprawling pavilions and can hold up to 40,000 inmates. Each cell can fit 65 to 70 prisoners.\n\nPrisoners can’t have visitors. There are no workshops or educational programs.\n\nEl Salvador hasn’t had diplomatic relations with Venezuela since 2019, so the Venezuelans imprisoned there do not have consular support from their government.\n\nVideo released by El Salvador’s government after the deportees’ arrival showed men exiting airplanes onto an airport tarmac lined by officers in riot gear. The men, who had their hands and ankles shackled, struggled to walk as officers pushed their heads down.\n\nThey were later shown at the prison kneeling on the ground as their heads were shaved before they changed into the prison’s all-white uniform – knee-length shorts, T-shirt, socks and rubber clogs – and placed in cells.\n\nFor three years, El Salvador has been operating under a state of emergency that suspends fundamental rights as Bukele wages an all-out assault on the country’s powerful street gangs. During that time, some 84,000 people have been arrested, accused of gang ties and jailed, often without due process.\n\nBukele offered to hold US deportees in the prison when US Secretary of State Marco Rubio visited in February.\n\nAt the prison Wednesday, El Salvador Justice Minister Gustavo Villatoro showed Noem a cell holding Salvadorans he said had been there since the prison opened. “No one expects that these people can go back to society and behave,” he said.",
        "source_2": "US Homeland Security Secretary Kristi Noem has released a social media video filmed inside a controversial mega-prison in El Salvador, thanking the country and its president for \"bringing our terrorists here and incarcerating them\".\n\nSecretary Noem was in the country to tour the facility, where US officials recently sent 238 Venezuelans.\n\nIn a cell behind her as she spoke were dozens of bare-chested and tattooed Salvadorean members from the MS-13 and the 18th Street gangs.\n\nThe trip suggests President Trump does not intend to back down from his immigration policy in the face of an injunction, upheld by an appeals court, on removing the Venezuelans from US soil under the1798 Alien Enemies Act.\n\nSecretary Noem described the prison as \"one of the tools in our toolbox\" and warned people that \"if you come to our country illegally, this is one of the consequences you could face\".\n\nAs part of her visit, she is due to meet Salvadorean President Nayib Bukele, an ally of US President Donald Trump, who had the Terrorism Confinement Centre (Cecot) facility built as part of his own crackdown on gang crime in El Salvador.\n\nPresident Bukele made the offer to incarcerate deportees and prisoners from the US at the Cecot during a recent visit to the Central American nation by Secretary of State Marco Rubio.\n\nThe move has prompted an outcry in the US and Venezuela, with several family members of the deportees insisting their relatives do not belong to any gang.\n\nAs Secretary Noem was being shown around the notorious facility on Wednesday, the Trump Administration received another setback in its effort to send foreign nationals there.\n\nAn appeals court in Washington DC upheld a decision by a lower court to put a temporary injunction on the deportation of Venezuelan immigrants under the 1798 act, which allows for the expulsion of foreign citizens with little due process.\n\nThe use of the act has drawn an outcry from immigration lawyers and activists who argue that some men accused of being gang members have been sent to El Salvador and locked up in the mega-prison on the basis of little evidence, including simply having tattoos.\n\nHuman rights groups have warned that the jail, in which inmates are held in windowless cells and sleep on bare metal bunks, is a \"concrete and steel pit\".\n\nThe White House continues to insist that all those they rounded up are dangerous gang members and were carefully vetted.\n\nHowever, several of their family members in Venezuela say their loved oneshad no prior convictions.\n\nThe deportation of 238 Venezuelans to the Cecot earlier this month has also put the Trump Administration into open conflict with a federal judge, James Boasberg, over the use of the centuries-old law to justify their quick deportation.\n\nJudge Boasberg has since imposed an injunction on further deportations under the law, which was last invoked during World War Two.\n\nThe fate of the Venezuelans has also come under severe criticism by a Washington Court of Appeals judge who said that even\"Nazis got better treatmentunder the Alien Enemies Act\".\n\nThe comparison prompted a furious reaction from senior officials in the Trump Administration.\n\nMeanwhile, lawyers in El Salvador, apparently acting in coordination with the Venezuelan government, have lodged a petition with the Salvadorean Supreme Court to try to secure the immediate release of the men.\n\nThe deportations to El Salvador under Trump's second term are part of the president's long-running campaign against illegal immigration in the US.\n\nHe won over voters on the campaign trail, in part, by promising to enact the largest deportation operation in US history.\n\nIn January, Trump signed an executive order declaring Tren de Aragua and MS-13 foreign terrorist organisations.\n\nWhile irregular border crossings have plummeted to the lowest number in decades since Trump took office, the Republican president has reportedly been frustrated by the relatively slow pace of deportations so far.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "DHS Secretary Kristi Noem was given a tour of the terrorist confinement center in El Salvador, where she came face-to-face with alleged Tren de Aragua gang members.\n\nHomeland Security Secretary Kristi Noem toured El Salvador's notorious Terrorism Confinement Center on Wednesday, where hundreds of alleged criminal illegal aliens are being held after theTrump administrationdeported them earlier this month.\n\nNoem toured the prisonwith the Salvadoran Minister of Justice, Héctor Gustavo Villatoro, before meeting with El Salvadoran President Nayib Bukele. Noem’s visit is part of a three-day trip that will also see her travel to Colombia and Mexico.\n\nVideo of the tour showed Noem coming face to face with alleged members of Tren de Aragua, all of whom were shirtless and had shaved heads, while also donning white prison pants.\n\nHIGH-RANKING TREN DE ARAGUA GANGSTER MURDERED TWO AMERICAN WOMEN, CAPTURED ACROSS COUNTRY: FEDS\n\nShe also sent a message to illegal aliens who are still in the U.S. or plan to visit anytime soon.\n\nAs prisoners stand looking out from a cell, Homeland Security Secretary Kristi Noem speaks during a tour of the Terrorist Confinement Center in Tecoluca, El Salvador, Wednesday, March 26, 2025.(AP Photo/Alex Brandon)\n\n\"First of all, do not come to our country illegally: You will be removed, and you will be prosecuted,\" she said while standing with her back to the inmates. \"But know that this facility is one of the tools in our toolkit that we will use if you commit crimes against the American people.\"\n\nNoem shared the video on X, saying, \"President Trump and I have a clear message to criminal illegal aliens: LEAVE NOW. If you do not leave, we will hunt you down, arrest you, and you could end up in this El Salvadorian prison.\"\n\nBukele opened the prison in 2023 as El Salvador wages a crackdown on powerful street gangs causing mayhem in the country. The facility has eight sprawling pavilions and can hold up to 40,000 inmates. As many as 65 to 70 prisoners are packed into each cell.\n\nPrisoners are never allowed outside and can't have visitors. There are no workshops or educational programs.\n\nIn this photo provided by El Salvador's presidential press office, prison guards transfer deportees from the U.S. alleged to be Venezuelan gang members to the Terrorism Confinement Center in Tecoluca, El Salvador, on Sunday, March 16.(El Salvador presidential press office via AP)\n\nA senior Trump administration official confirmed to Fox News this month that a total of 261 illegal aliens were deported to El Salvador on March 15. The majority of them were deported via theAlien Enemies Act of 1798,which allows for the expulsion of an enemy nation's natives and citizens without a hearing.\n\nMore than 100 of the migrants were Venezuelans removed via Title 8, while 21 others were Salvadoran MS-13 gang members, the official added. Two were MS-13 ringleaders and \"special cases\" for El Salvador.\n\nVideo released by El Salvador’s government after the deportees' arrival showed men, shackled at their hands and ankles, exiting airplanes onto an airport tarmac lined by heavily armed officers in riot gear.\n\nEXCLUSIVE: GOP MOVES TO AUTHORIZE TRUMP TO WAGE WAR ON CARTELS THROUGH MILITARY FORCE\n\nThe men were later shown at the prison kneeling on the ground as their heads were shaved before they changed into the prison’s all-white uniform — knee-length shorts, T-shirt, socks and rubber clogs — and placed in cells.\n\nA prison guard transfers deportees from the U.S. to the Terrorism Confinement Center in Tecoluca, El Salvador, on Sunday, March 16.(El Salvador presidential press office via AP)\n\nEl Salvadorhas been operating under a state of emergency that suspends fundamental rights for nearly three years as Bukele deals with the street gangs. Some 84,000 people have been arrested so far, accused of gang ties and jailed, often without due process according to the Associated Press.\n\nBukele offered to hold U.S. deportees in the prison when U.S.Secretary of State Marco Rubiovisited in February.\n\nIn a March 16 post on Truth Social, President Donald Trump wrote that the U.S. \"will not forget\" Bukele's partnership, andthanked the leaderfor his \"understanding of this horrible situation, which was allowed to happen to the United States because of incompetent Democrat leadership.\"\n\nFox News Digital’s Adrea Margolis and Emma Colton, along with The Associated Press, contributed to this report.\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox"
    }
}