{
    "question": "What implications does the reported deportation of Venezuelan asylum seeker Andrys Cedeno-Gil to an El Salvador prison based on suspected tattoo-linked gang ties have for due process and U.S. asylum policy?",
    "content": {
        "source_1": "A 23-year-old makeup artist with no known gang affiliation was among the hundreds of Venezuelan men deported to El Salvador’s infamous CECOT prison without due process last week.\n\nLindsay Toczylowski, co-founder and president of the Immigrant Defenders Law Center, painted a harrowing picture while recounting how her client was “disappeared” during an appearance on “The Rachel Maddow Show” on Thursday.\n\nAndrys, who is gay and whose last name is being withheld due to concerns over his safety, initially arrived in the U.S. seeking asylum but was detained after immigration officials decided his tattoos could be a sign of gang affiliation.\n\nHis attorney firmly denied the accusation, telling Maddow, “These are not the tattoos of somebody who is involved with gangs. These are normal tattoos that you would see on anybody at a coffee shop anywhere in the United States or Venezuela.”\n\nThough Andrys was scheduled to appear in U.S. immigration court last week, he was forcibly removed from the country last weekenddespite a judge’s orderto keep him and over 250 other men on U.S. soil until further legal review.\n\nThe last time he spoke to his family, they believed he would deported to Venezuela, according to an interview with his mother and the Venezuelan news outlet Crónica Unodetailed by The Advocate.\n\nInstead, he was sent to El Salvador’s Terrorism Confinement Center, known as CECOT, where he has yet to speak to his family or his attorneys.\n\nIn her communications with U.S. Immigration and Customs Enforcement, Toczylowski was told the agency would not help her make contact with Andrys.\n\n“They will not facilitate communication with our client, because he has, in their words, been removed,” she told Maddow.\n\nToczylowski said she has grave concerns about Andrys’ safety at CECOT, a 40,000-capacity prison complex where people are often held without a trial or release date and kept in brutally spartan living conditions.\n\nTelling Maddow her team is “pursuing all avenues” to seek Andrys’ release, she added, “Because our client’s life is at risk. We’re concerned for his safety. And the fact that he was forcibly taken from the United States with no due process ... it’s something that really shocks the conscience in a way that we haven’t seen since family separation happened in 2018.”\n\nLast Sunday, El Salvador’s President Nayib Bukeleappeared to celebratethe arrival of the deportees as he posted a video of shackled men being ushered off a plane and processed for detention to his social media.\n\nFor two decades, HuffPost has been fearless, unflinching, and relentless in pursuit of the truth. Support our mission to keep us around for the next 20 — we can't do this without you.\n\nWe remain committed to providing you with the unflinching, fact-based journalism everyone deserves.\n\nThank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever.We hope you will join us once again.\n\nWe remain committed to providing you with the unflinching, fact-based journalism everyone deserves.\n\nThank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever.We hope you will join us once again.\n\nRemarking on U.S. District Judge James E. Boasberg’s unheeded order blocking the deportations, Bukele’s caption read, “Oopsie… Too late.”\n\nThe staunch Trump ally, who has called himself the “world’s coolest dictator,” agreed to take in the U.S.’s deported migrants earlier this month in exchange for $6 million a year, paid for by American tax dollars.\n\nBy entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to ourTerms of ServiceandPrivacy Policy.",
        "source_2": "Immigration attorneys say a gay Venezuelan makeup artist seeking asylum in the U.S. was wrongly identified as a gang member and deported to El Salvador—a case becoming a flashpoint in the debate over the Trump administration’s deportation of hundreds of migrants to a notoriously inhumane El Salvador megaprison.\n\nLindsay Toczylowski, founder of the Immigrant Defenders Law Center,saidshe lost contact with her client, identified as a 31-year-old gay man from Venezuela, Andry (Toczylowski has withheld his full name due to safety precautions) who had no criminal history, when the Trump administration deported more than 230 migrants it claimed were members of the Venezuelan gang Tren de Aragua to El Salvador on March 15.\n\nToczylowski said Andrydisappearedfrom detention records the same day, and his name later appeared on an internal government list obtained byCBSof migrants deported to El Salvador’s Terrorism Confinement Center, a mega-prison known for human rights violations.\n\nICE wrongly detained Andry last year, when he sought asylum over persecution for being gay and his opposition to Venezuelan President Nicolás Maduro, because immigration officials thought his tattoos linked him to Tren de Aragua, according totweetsandmedia appearancesby Toczylowski.\n\nAndry is among multiple migrants deported to El Salvador whose attorneys and family membershave saidhave no gang affiliation or even criminal records, and took the appropriate legal steps to seek asylum in the U.S.\n\nThe Trump administration claims it had the authority to deport the migrants it suspected of gang affiliation without court hearings under the Alien Enemies Act of 1798—a decision blocked by District Court Judge James Boasberg, who says it’s not a valid claim.\n\nBoasbergruled Mondaythe migrants were “entitled to individualized hearings to determine whether the Act applies to them at all.”\n\n“You are telling me this man is Tren De Aragua? He was so dangerous we had to send him to a foreign prison camp to be beaten with no due process? Do you have any soul left @marcorubio?” host of The Bulwark podcast, Tim Miller,tweeted, referencing Andry, along with photos his lawyers have shared of him posing with makeup brushes.\n\nA barber from Venezuela, Franco José Caraballo Tiapa, 26, is among those included in a list obtained byCBSof Venezuelans deported to El Salvador. He was detained by ICE in February and accused by the Department of Homeland Security of being a member of Tren de Aragua, though he has no criminal history in the U.S. and Venezuelan officials say he has no record there either, according to CBS, which reported the DHS record notes his tattoos but does not say they were linked to gang affiliation. His wife told CBS she lost contact with him March 15. A Venezuelan professional soccer player, Jerce Reyes Barrios, 36, was also deported to El Salvador after U.S. immigration officials alleged last year his tattoos were linked to gang affiliation, USA Todayreported, citing his attorney, Linette Tobin, who said the tattoo DHS cited was of a soccer ball and rosary. Barrios was seeking asylum in the U.S. after he was arrested and tortured in Venezuela for protesting Maduro, Tobin told theNew York Post. DHS spokesperson Tricia McLaughlin said officials are “confident” in Barrios’ gang affiliation in a statement to the New York Post in response to claims he was wrongly deported.\n\nPhilip Holsinger, a photojournalist who documented the migrants’ intake into the El Salvador prison, wrote forTimemagazine that “one young man sobbed when a guard pushed him to the floor” and said “I’m not a gang member. I’m gay. I’m a barber.” Holsinger wrote that he believed him, because the man “didn’t look like what [he] expected—he wasn’t a tattooed monster.”\n\nInmates at El Salvador’s Terrorism Confinement Center, known as Cecot, are kept in cells equipped with metal bunks and crowded with dozens of inmates for 23 ½ hours a day, according toCNN. The cells have no sheets, pillows or mattresses, inmates are not allowed books and meals are served through the cell bars, CNN reported. The State Department also documented credible reports of “harsh and life-threatening prison conditions,” including incidents it described as “torture,” such as beatings by guards and the use of electric shocks in a 2023report.The facility was opened two years ago amid El Salvador’s crime crackdown and houses as many as 20,000 prisoners, many of whom are accused murderers or drug dealers.\n\nThe Trump administration repeatedly resisted requests from Boasberg last week for more information about when and why the migrants were flown to El Salvador as he seeks to determine whether it violated his order to turn around flights carrying migrants deported under the Alien Enemies Act. The Trump administration has claimed the flights took off before Boasberg issued his ruling on March 15, hours after Trump invoked the wartime authority, and has argued Boasberg’s written order did not include the instructions he gave verbally less than an hour earlier to turn the flights around. The Trump administration has also challenged Boasberg’s authority over restricting his use of the Alien Enemies Act.\n\nJudge Boasberg Rejects Trump Request For Deportation Flights Under Alien Enemies Act—Again(Forbes)\n\nTrump Administration Says It’s Considering State-Secrets Privilege To Shield El Salvador Flight Details From Judge(Forbes)\n\nTrump Administration Wants Judge Removed After Allegations It Ignored His Court Order(Forbes)",
        "source_3": "Published:21:32 BST, 24 March 2025|Updated:02:40 BST, 28 March 2025\n\nA makeup artist seeking asylum in the US after fleeing Venezuela claims he was wrongly identified as a gang member and sent to a hellhole prison in El Salvador.\n\nAndrys Hernandez, 31, crossed the border intoCaliforniafrom Tijuana last year to escape persecution for his homosexuality, his lawyers said.\n\nHe waited months in detention for an immigration court hearing on March 13, but instead was put one of three planes with 237 other migrants and deported.\n\nBut Hernandez was not sent back to Venezuela. Instead he was flown to El Salvador and detained at the notoriousTerrorism Confinement Center (CECOT).\n\nHe and the others on board are accused by the Trump Administration of being members of Tren de Aragua, a fearsome Venezuelan gang active in the US.\n\nHowever, 137 of them were deported without due process under an obscure 1798 law not used sinceWorld War II, and many of their families claim they are not gang members.\n\nWhite House Press SecretaryKaroline Leavittsaid the Trump Administration was 'not going to reveal operational details about a counterterrorism operation' when asked about the evidence that detainees were actually gang members.\n\nLindsay Toczylowski, a lawyer with the Immigrant Defenders Law Center, said Hernandez was one of many falsely accused because of his tattoos.\n\nAndrys Hernandez, 31, a makeup artist seeking asylum in the US after fleeing Venezuela, was wrongly identified as a gang member and sent to a hellhole prison in El Salvador\n\nHernandez crossed the border into California from Tijuana last year to escape persecution for his homosexuality, his lawyers said\n\n'His tattoos are benign. But Immigration and Customs Enforcement submitted photos of his tattoos as evidence he is Tren de Aragua,' she said.\n\n'His attorney planned to present evidence he is not. But never got the chance because our client has been disappeared.'\n\nPhotos of Hernandez showed he has a tattoo of a snake wrapped around his left forearm and what appears to be a floral design around his elbow.\n\nHis lawyers called them tattoos that you might see on any arts student at a café in New York or Los Angeles.\n\nLawyers for another migrant shipped off to El Salvador said his tattoo that ICE claimed was Tren de Araguawas actually the Real Madrid soccer team logo.\n\nThe Department of Homeland Security in that case alleged other evidence confirmed his membership of the gang.\n\nICE and DHS did not immediately respond to DailyMail.com requests for comment on Hernandez's case.\n\nToczylowski said Hernandez entered the US legally as an asylum-seeker, with an appointment to seek protection in the US from persecution.\n\n'He has a strong claim. He was detained at entry because ICE alleged his tattoos are gang related. They are absolutely not,' she said.\n\n'He is a makeup artist who loves theater. He is a gay man. He is close to his family.'\n\nHernandez waited months in detention for an immigration court hearing on March 13, but instead was put one of three planes with 237 other migrants and deported\n\nLindsay Toczylowski, a lawyer with the Immigrant Defenders Law Center, said Hernandez was one of many falsely accused\n\nBukele, in a meeting last month with US Secretary of State Marco Rubio , offered to house prisoners from the United States in his country\n\nToczylowski said he passed a credible fear interview, which immigration officers use to determine if asylum-seekers have reasonable grounds for their claim.\n\nWhether he was detained or not, he would then go before an immigration court to determine if he was a genuine refugee - but he never got the chance.\n\nHernadez's lawyers said the last they heard from him was hours before an immigration court hearing on March 13, where they planned to present evidence that he was an innocent makeup artist, not a gangster.\n\nBut when the hearing began, ICE did not produce him, and the government lawyer didn't know why, or where he was.\n\nThe judge put off the hearing until March 17 while Hernandez's lawyers frantically searched for him at the detention facility in Texas, but were told he had been moved.\n\nBy March 15 he had disappeared from the ICE online detainee locator system and his lawyers began to fear the worst.\n\nICE again failed to produce Hernandez at the March 17 hearing, but this time confirmed he had been deported to El Salvador.\n\nThe cells, each designed to hold 65 to 70 prisoners, are stark and devoid of basic comforts\n\nAlleged Tren de Aragua gang tattoos (pictured above) were part of a Department of Homeland Security bulletin that was shared with federal agents\n\nToczylowski said the Judge asked 'how has he been removed if there is no removal order?' and the ICE attorney replied that they didn't know.\n\n'Our client was falsely accused of gang affiliation, was given no chance to refute it, then was disappeared by ICE and sent to a prison in El Salvador,' she said.\n\n'Before seeking asylum, he’d never even been incarcerated or arrested. And now he sits in a prison notorious for human rights abuses.'\n\nToczylowski said another hearing was set for two weeks later, but they have no way of contacting Hernandez in El Salvador.\n\n'ICE told us they won’t facilitate our communication with him or make him available for his next hearing,' she said.\n\nTime photojournalist Philip Holsinger, who has spent months in El Salvador investigating the country's transformation under stongman president Nayib Bukele,happened to be at the airstripwhere theplanes landed.\n\nHe described how some of the detainees allegedly tried to take over one of the planes, so security at the tarmac was tight and treatment particularly brutal.\n\nThey were herded onto buses and driven 25 miles to the prison, where they were physically abused as a show of dominance.\n\nThe migrants were brought to the Terrorism Confinement Center under an agreement between Salvadoran President Nayib Bukele and Secretary of State Marco Rubio\n\nSalvadoran police officers escort alleged members of the Venezuelan gang Tren de Aragua recently deported by the U.S. government to be imprisoned in the Terrorism Confinement Center\n\nHolsinger described the beating of a gay barber whom many believe could be Hernandez, as he was prepared for detention.\n\n'The intake began with slaps. One young man sobbed when a guard pushed him to the floor. He said, \"I'm not a gang member. I'm gay. I'm a barber\",' he wrote.\n\n'I believed him. But maybe it’s only because he didn’t look like what I had expected - he wasn’t a tattooed monster.\n\n'The guards grabbed necks and pushed bodies into the sides of the buses as they forced the detainees forward. There was no blood, but the violence had rhythm, like a theater of fear.'\n\nHolsinger continued to follow the man who may be Hernandez through the brutal intake process.\n\n'Inside the intake room, a sea of trustees descended on the men with electric shavers, stripping heads of hair with haste,' he wrote.\n\n'The guy who claimed to be a barber began to whimper, folding his hands in prayer as his hair fell. He was slapped.\n\n'The man asked for his mother, then buried his face in his chained hands and cried as he was slapped again.'\n\nThe vivid account detailed how detainees were then stripped naked and their possessions put in black garbage bags to be thrown away along with their hair.\n\nSalvadoran police officers cut the hair of alleged members of the Venezuelan gang Tren de Aragua\n\nThe arrival of alleged members of the Venezuelan criminal organization Tren de Aragua at the Terrorism Confinement Center (CECOT) in the city of Tecoluca\n\nToczylowski said there was no way to be certain the gay barber Holsinger described was Hernandez, as there was no way to contact inmates, but it 'could be' him.\n\nCECOT is a notorious prison where inmates are subjected to extremely harsh treatment and live in overcrowded cells without basic essentials.\n\nInmates are herded into cold, sparse cells with 80 men crammed into each, with no sheets, pillows or even mattresses - just hard steel bedframes.\n\nThey have nothing to occupy them, such as TV or books, and aren't even allowed to speak to each other. There are only two toilets, and lights are on around the clock.\n\nEvery pavilion also has its own windowless cell where unruly prisoners are sent.\n\nThe same meal is served every day, and has to be eaten by hand as utensils aren't allowed. Phone calls and visitors, even family and lawyers, are banned.\n\nInmates spend 23 and a half hours locked in their overcrowded cells, with just 30 minutes to stretch - chained in the middle of the hallway.\n\nWithin the cells, the temperature can reach a staggering 95 degree during the day, and there is no other source of ventilation.\n\nStunning images taken from within the complex usually show inmates shirtless in white shorts as they attempt to keep cool.\n\nThe president of El Salvador posted video of alleged members of a Venezuelan gang being processed after being deported from the U.S.\n\nPresident Donald Trump mused about 'sick terrorist thugs' being sent to an El Salvadoran prison for 'what they are doing to Tesla and Elon Musk\n\nCECOT has been called a 'black hole of human rights,' with 'horrific overcrowding, disease, systematic denial of food, clothing medicine, and basic hygiene'.\n\nThe $100 million penitentiary, the largest in Latin America, was constructed over a span of seven months in 2022 as part of Bukele's plan to reign in street gangs after more than 60 people were murdered on March 26, 2022.\n\nThe jail is on 410 acres of land, including 57 that were set aside to build eight pavilions surrounded by a 36-foot-tall and 1.3-mile-long wall.\n\nIt houses at least 13,000 inmates, with a capacity for 40,000, eclipsing the Marmara Penitentiaries Campus in Istanbul, Turkey.\n\nThe mega-prison is equipped with a system that blocks inmates from contacting the outside world with cellphones.\n\nTo enter the jail, staffers, guards and prisoners have to go through a complex registration system before they travel through three sections safeguarded by gates.\n\nTren de Aragua was linked to kidnapping, extortion, organizedcrimeand contract killings in the United States.\n\nIt became a household name after video of themstorming an apartment near Denversurfaced in August.\n\nEl Salvador's leader, in a meeting last month with US Secretary of State Marco Rubio, offered to house prisoners from the United States in his country\n\nGang members are pictured being taken to their cells on Sunday\n\nTheWhite Househas slapped down questions about the people who got deported, saying those asking about it are in favor of violent gang attacks on Americans.\n\nTrump made the deportations undertheAlienEnemies Act of 1798, which he claimed allowed him to ignore due process.\n\nIts most recent application was during World War II, when it was used for the internment of Germans, Italians, and about 120,000 Japanese and Japanese-American civilians.\n\nThe law was also used during World War I and the War of 1812.\n\nTrump declared the US wasfacing an 'invasion' from a criminal organizationthat has been linked to kidnapping, extortion, organized crime, and contract killings.\n\nHe claimed that he was justified in invoking the act to deport Tren de Aragua members because he claims the gang has ties to the regime of Venezuelan President Nicolas Maduro.\n\nUnder his order, all Venezuelan citizens 14 years of age or older who are determined to be members of the gang, are within the US and are not naturalized or lawful permanent residents of the country are 'liable to be apprehended, restrained, secured, and removed as Alien Enemies'.\n\nJudge Hames Boasberg blocked the use of the wartime law, but was only able to do so when the deportees were already in international airspace.\n\nHe had ordered the planes to return to the US, but because he never included it in his written order the Trump administration was able toclaim it did not disobey the order.\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nBy posting your comment you agree to ourhouse rules.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with ourPrivacy Policy."
    }
}