{
    "question": "In what ways could Commerce Secretary Howard Lutnick’s televised recommendation to “buy Tesla” shape ethics oversight, investor behavior, and public trust in government, and what standards should guide any response?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nPresident Donald Trump listens as Elon Musk speaks in the Oval Office at the White House, Feb. 11, 2025, in Washington. (AP Photo/Alex Brandon, File)\n\nCommerce Secretary Howard Lutnick speaks with reporters at the White House, Thursday, March 13, 2025, in Washington. (AP Photo/Alex Brandon)\n\nProtesters outside a Tesla Service Center on Tchoupitoulas Street in New Orleans express their issues with Elon Musk and President Donald Trump on Friday, March 14, 2025. (Chris Granger/The Times-Picayune/The New Orleans Advocate via AP)\n\nA Tesla vechile is seen near a charging station, Wednesday, March 19, 2025, in Woodstock, Ga. (AP Photo/Mike Stewart)\n\nTesla and SpaceX CEO Elon Musk listens as Republican presidential nominee former President Donald Trump speaks at a campaign event at the Butler Farm Show, Oct. 5, 2024, in Butler, Pa. (AP Photo/Alex Brandon, File)\n\nNEW YORK (AP) — When a White House adviser in the first Trump administration told TV viewers to “Go buy Ivanka stuff,” top government lawyers sprang into action, telling her she had violated ethics rules and warning her not to do it again.\n\nGovernment ethics experts have varying opinions on whether the 2017 criticism of Kellyanne Conway went far enough, but many agree such violations now might not even draw an official rebuke.\n\nA week after President Donald Trump turned the White House lawn intoa Tesla infomercial for Elon Musk’s cars, a second sales pitch by a U.S. official occurred, this time for Tesla stock.\n\n“It will never be this cheap,” U.S. Commerce Secretary Howard Lutnick said Wednesday. “Buy Tesla.”\n\nCommerce Secretary Howard Lutnick speaks with reporters at the White House, Thursday, March 13, 2025, in Washington. (AP Photo/Alex Brandon)\n\nGovernment ethics experts say Lutnick broke a 1989 law prohibiting federal employees from using “public office for private gain,” later detailed to include a ban on ”endorsements.” Although presidents are generally exempt from government ethics rules, most federal employees are not and are often punished for violations, including rebukes like the oneConway got.\n\nAs of Friday, no public action had been taken against Lutnick and it was unclear whether he would suffer a similar fate.\n\n“They’re not even thinking of ethics,” said Trump critic and former Republican White House ethics czar Richard Painter of administration officials.\n\nPainter has equally low expectations of that other possible brake to future violations — public opinion: ”I don’t know if people care.”\n\nIn his first term, Trumpopened his hotelnear the Oval Office to foreign ambassadors and lobbyists in what many legal scholars argued was a violation of a constitutional ban against presidents receiving payments or gifts that could distort public policy for private gain. His company launched a new hotel chain called “America Idea” in hopes of cashing in on his celebrity. Trump even once proposedholding a G-7 meetingof world leaders at his then-struggling Doral golf resort.\n\nA Tesla vechile is seen near a charging station, Wednesday, March 19, 2025, in Woodstock, Ga. (AP Photo/Mike Stewart)\n\nBut the reaction to Conway’s “Ivanka stuff” comment suggested certain lines couldn’t be crossed.\n\nWithin days of Conway’s TV comments, the head of the federal ethics agency, the Office of Government Ethics, wrote a letter to the White House saying Trump’s adviser may have broken the law and urging a probe. A White House lawyer then met with Conway to remind her of the law and reported to the ethics office that she had assured him she would abide by it in future.\n\nBut this time, there is no head of the Office of Government Ethics. He was fired by Trump. Ditto for the inspector generals of various agencies who would head any investigation.\n\n“What is likely to happen now? I really don’t know,” said Kedric Payne, chief lawyer at the Campaign Legal Center, a non-profit watchdog that sent a letter to the government ethics office on Friday calling for an investigation. “We no longer have the head of the Office of Government Ethics to push the Commerce Department to make sure the secretary acknowledges the law.”\n\nPayne said Lutnick’s comment on TV may seem like a small transgression but it could snowball into a bigger problem if not punished.\n\n“It starts with one TV appearance, but can develop into multiple officials asking people to support companies and products,” Payne said. “If there are no consequences, you get into a danger zone of a corruption.”\n\nTrump critics point to other signs that Trump is careless with the law and ethical norms, citing his pardons forJan. 6 Capitol rioters, a decision to allow his Trump Organization to strikebusiness deals abroadand his attack on theForeign Corrupt Practices Actbanning U.S. company bribes abroad to win business.\n\nProtesters outside a Tesla Service Center on Tchoupitoulas Street in New Orleans express their issues with Elon Musk and President Donald Trump on Friday, March 14, 2025. (Chris Granger/The Times-Picayune/The New Orleans Advocate via AP)\n\nWhen it comes endorsing products, presidents used to be far more circumspect.\n\nTheir comments were mostly quick asides expressing opinions of taste, such as when Harry Truman called Pillsbury flour the “finest” or John F. Kennedy said United Airlines was “reliable.”\n\nRonald Reagan famously enthused about his jelly beans habit, remarking that they were the “perfect snack.”\n\nTrump had five Teslas lined up in the White House driveway last week as hepraised Musk’s company. Then he slipped into a red Model S he had targeted for personal purchase, exclaiming, “Wow. That’s beautiful.”\n\n“Presidents are allowed to have personal opinions on products they like and dislike,” said ethics lawyer Kathleen Clark, referring to the Truman through Reagan examples. ”But what Trump did was transform the White House into a set for advertising the products of a private company.”\n\n“It’s the difference between holding an extravaganza and holding an opinion.”\n\nTesla and SpaceX CEO Elon Musk listens as Republican presidential nominee former President Donald Trump speaks at a campaign event at the Butler Farm Show, Oct. 5, 2024, in Butler, Pa. (AP Photo/Alex Brandon, File)\n\nIn the aftermath of the Tesla White House event, Massachusetts Sen. Elizabeth Warren and three other senators wrote a letter to the Office of Government Ethics saying that, while presidents are exempt from ethics law banning endorsements, Elon Musk isn’t and calling for an investigation.\n\nA spokeswoman from Warren’s office said the government ethics office had not yet responded about what it planned to do about the White House Tesla endorsement. The Office of Government Ethics itself said it would not comment on either the Warren letter or Lutnick’s TV appearance.\n\nThe Commerce Department did not respond to Associated Press requests for comment.\n\nAsked whether Lutnick would be reprimanded or an investigation opened, White House spokesman Kush Desai defended Lutnick, lauding “his immensely successful private sector career” and his “critical role on President Trump’s trade and economic team.”\n\nFormer White House ethics chief Painter says Democrats have also played loose with the ethics law.\n\nHe is harshly critical of the Clinton charity, the Clinton Foundation, which was taking donations from foreign governments when Hillary Clinton was the country’s chief diplomat as secretary of state. Painter also blasts former President Joe Biden for not removing his name from a University of Pennsylvaniaresearch institutewhen he was in office even though it appeared to be helping draw donations overseas.\n\nBut Painter says the slide from caring about ethics laws and norms to defiance has hit a new low.\n\n“There’s been a deterioration in ethics,” he said. “What Biden did wasn’t good, but this is worse.”\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Stocks have never been so political as Howard Lutnick says buy Tesla and Tim Walz says sell\n\nThe nation’s political battleground shifted to the stock market this week, as Commerce Secretary Howard Lutnick urged people to buy shares of Tesla Inc. and Minnesota Gov. Tim Walz mocked the electric-vehicle giant’s share-price drop.\n\n“Buy Tesla — it’s unbelievable that this guy’s stock is this cheap. It’ll never be this cheap again,” Lutnicksaidon Jesse Watters’s show on Fox News late Wednesday.\n\nJames Rogers is a Financial Columnist for MarketWatch.\n\nCopyright ©2025MarketWatch, Inc. All rights reserved.",
        "source_3": "Retired FBI agent Mike Harrigan joins LiveNOW's Josh Breslow to discuss Attorney General Pam Bondi charging three people with federal charges related to alleged Tesla arson attacks.\n\nLOS ANGELES-A Trump administration official’s televised plug for Tesla stock has sparked fresh concerns about ethical violations inside the federal government—and raised the question: Did he break the law?\n\nDuring a recent TV appearance, U.S. Commerce Secretary Howard Lutnick said, \"It will never be this cheap. Buy Tesla,\" shortly after former President Donald Trump turned the White House lawn into a showcase for Tesla vehicles. Ethics experts say Lutnick’s comment appears to violate a longstanding law barring federal employees from using their position to promote private interests.\n\nBut unlike previous administrations, legal action—or even a public rebuke—may not come.\n\nSince 1989, U.S. law has prohibited federal employees from using public office \"for private gain.\" This includes endorsing products, services, or companies—especially when the official's position could add weight to the recommendation.\n\nWhile presidents are generally exempt from federal ethics laws, most other federal employees—including cabinet officials like Lutnick—are not.\n\nLegal experts say Lutnick’s on-air comments likely crossed that legal line. \"Buy Tesla\" is considered an endorsement, and under government ethics rules, that’s forbidden.\n\nWhile ethics experts widely agree that Lutnick’s comment likely violated federal rules, it remains unclear whether any formal investigation will be launched.\n\nU.S. President Donald Trump and White House Senior Advisor, Tesla and SpaceX CEO Elon Musk sit in a Tesla Model S on the South Lawn of the White House on March 11, 2025 in Washington, DC.(Photo by Andrew Harnik/Getty Images)\n\nThe Office of Government Ethics has not publicly responded, and the current lack of leadership within key oversight agencies—many of which saw leadership turnover during the Trump administration—adds uncertainty.\n\nIt’s also unknown whether any internal review is underway at the Commerce Department, or if Congress will push for further accountability. Until there's an official response or disciplinary action, the legal and political consequences remain unresolved.\n\nIn 2017, White House adviser Kellyanne Conway was formally rebuked after telling viewers to \"go buy Ivanka stuff\" during a TV interview. The Office of Government Ethics (OGE) quickly responded, asking the White House to investigate and confirm she would comply with the law going forward.\n\nBut today’s landscape is different. The head of the OGE was fired by Trump, and several agency inspectors general—who typically lead investigations—are no longer in place.\n\n\"There’s been a deterioration in ethics,\" former White House ethics chief Richard Painter told the Associated Press. \"What Biden did wasn’t good, but this is worse.\"\n\nEthics experts are largely in agreement that Lutnick’s comment violated federal ethics law—but some believe it may go unpunished.\n\n\"They’re not even thinking of ethics,\" Painter said of Trump administration officials, speaking to the Associated Press.\n\nKedric Payne, chief counsel at the nonpartisan Campaign Legal Center, said the infraction may seem small, but it's potentially serious.\n\n\"It starts with one TV appearance,\" Payne said. \"But if there are no consequences, you get into a danger zone of corruption.\"\n\nAs of Friday, there had been no public action taken against Lutnick.\n\nThe Campaign Legal Center sent a letter calling for an investigation, but the Office of Government Ethics has yet to respond. The Commerce Department also declined to comment.\n\nMeanwhile, Sen. Elizabeth Warren and three other Democratic senators have called for an investigation into Elon Musk’s involvement in the White House Tesla showcase, arguing that even if presidents are exempt from ethics laws, private business leaders are not.\n\nStill, without top ethics officials in place and with enforcement mechanisms weakened, watchdog groups are doubtful that any consequences will come from the incident.\n\nThe Source:This article is based on reporting from the Associated Press, including interviews with legal ethics experts, records of past government violations, and statements from watchdog groups and public officials. Additional context was drawn from the 1989 ethics law and recent executive actions affecting federal employee conduct."
    }
}