{
    "question": "In what ways could the broad criticism and weak early box office for Disney’s Snow White remake influence how studios balance nostalgia, thematic updates, casting choices, and CGI in future adaptations?",
    "content": {
        "source_1": "Find this story in your account’s‘Saved for Later’section.\n\nI don’t actually know how to judge these live-action Disney remakes on any relative scale of quality. The bar issolow, and what people seem to want from them — a tickle of nostalgia, the familiar rendered new on a technicality, 109 minutes of child-friendly distraction — feels so different from the usual standards. So:Snow Whiteis not as bad as it could be, while not being anywhere near good? It’s better than, say, 2019’sAladdin, which was awful but nevertheless made a literal billion dollars. It’s garishly ugly and padded out with new tunes from Pasek and Paul that are as smooth and unremarkable as river rocks, all of which may or may not matter to its target audience, who could just be basing their decision about whether to see the movie on how unacceptably woke social media has informed them it is. But while the movie itself is devoid of delight, there is something delightful about getting to actually see the thing after the years ofculture-war skirmishesthat have preceded its release like a wrathful red carpet and discovering it’s about lefty infighting.\n\nThe shortcomings ofSnow White— which was directed byThe Amazing Spider-Man’s Marc Webb and written byThe Girl on the Train’s Erin Cressida Wilson — aren’t on star Rachel Zegler, who, despite being set up as a fall gal by the studio, gives excellent princess face while communing with CGI animals and belting out the chorus of the remake’s newly added “I Wish” song, whose role in the film you will not miss, given that it’s called “Waiting on a Wish.” But the funny thing about her take on the storybook standard is that, in the context of the movie, the character is effectively a normie lib dithering about how to fight back against the fascist takeover of her kingdom by her stepmother, the Evil Queen, played by Gal Gadot in a glittery wimple and a performance so incredibly stilted it almost swings around to being good-bad. Snow White’s father is gone, his fate uncertain, and she dithers about the castle in a demoted role, fretting about how her people are suffering outside. Snow White is an institutionalist, which I suppose is a given for a princess, pining for the idealized era of Obama’s/her father’s leadership, when her family would make apple pies so the working folks could have a small taste of luxury, and unable to conceive of a way to fight the Queen, who may be pretty flashy but who also came into power via the standard methods (marriage and magic).\n\nSnow White eschews violence and gets awfully sniffy about property for someone who’ll later let herself into the Seven Dwarfs’ home, scolding her future love interest, Jonathan (Andrew Burnap), when she discovers him stealing food from the royal kitchen. In this revamped take, Jonathan is not a prince but a rebel leading a group of bandits who hide out, Merry Men style, in the forest. Thanks to these plot changes,Snow Whitedoesn’t include one of the animated original’s most famous songs, “Someday My Prince Will Come,” instead opting for a new number where Jonathan taunts Snow White about her “princess problems.” It’s a tale as old as time — a sheltered Ivy League girl meets a rakish dirtbag leftist who lives with a bunch of roommates and who radicalizes her by negging her about her privilege. What’s left for a girl to do but attempt some coalition building among a ragtag crew that includes her septuple hosts, who I will not try to fit into this larger political allegory on account of their being abominations who can only be described as garden gnomes who’ve come to life while retaining their shellacked sheen. As Snow White pleads to her bickering would-be allies, all the Evil Queen wants is for them to fight among themselves while she sits on her throne room, eating caviar and, no doubt, getting fillers and Botox from her in-castle aesthetician off-screen.\n\nWhen Disney releasedSnow White and the Seven Dwarfsin 1937, it was history-making — the first U.S. feature animation and a hit that proved that audiences wouldn’t just turn up for full-length animated films but embrace them.Snow White and the Seven Dwarfswould cement fairy tales as an inextricable part of the Disney brand, in rides and merchandise and Broadway musicals, to the point where 88 years later, Disney is still in this game, albeit in an eating-its-own-tail fashion where the media giant is no longer just iterating on a well-known story but on its own previous take.Snow White and the Seven Dwarfswas born out of the landscape of early animation, owing as much to the era’s high jinks–centric shorts as to the Brothers Grimm.Snow Whiteis, for better and (mostly) worse, a product of a corporation that has for years been lumbering after its idea of the Zeitgeist with all the agility of an aging colossus. (The recentdeletion of a trans story linefrom a Pixar series is a reminder that the company is just as willing to make a clumsy heel turn out of the same impulse.) That, in chasing something vaguely progressive and YA-inspired withSnow White, Disney has turned out a film with some hilariously timely choices is a great joke, though I wouldn’t call it an intentional one. The most pragmatic aspect ofSnow Whiteis that with its plasticky set design and gift-shop-tacky costuming, it already looks like it takes place in a theme park — no adaptations necessary.",
        "source_2": "This time around, Snow White isn't dreaming of true love. Disney.\n\nThis time around, Snow White isn't dreaming of true love. Disney.\n\nAt the 11th Academy Awards in 1939, Shirley Temple presented Walt Disney with an honorary Oscar — a statuette accompanied by seven miniatures. It was, of course, a nod to his animationSnow White, which the Soviet director Sergei Eisenstein had called “the greatest film ever made”.\n\nAs with all of his adaptations, Disney had reworked the original Brothers Grimm fairytale to remove its more gruesome and confusing elements. Intricate subplots involving not one but three deceptions by the jealous queen — a corset, a comb and then the apple — were whittled down; Snow White is revived not by the dropping of her glass coffin, dislodging said poisonedpommefrom her throat, but by “true love’s kiss”. Most significantly, in the Disney version, the queen — a vain stepmother threatened by Snow White’s pubescent “fairness” — falls off a cliff. The original is more Grimm indeed: she is made to wear red-hot shoes of iron and dance until she dies, a morbid mockery of her desire for admiration.\n\nMuch effort was made to force the original tale into the contemporary moral mould of antebellum America. Now, as Disney braces for the release of its new live-action adaptation on Friday, a similar process is underway. This time, the sanitising is motivated by its star, Rachel Zegler, who has navigated the press junket sodisastrouslythat studio bosses relocated a London premiere to aremote Spanish castlefor fear of “anti-woke backlash”. All this was set in motion by Zegler’s comments in 2022, that the original film had followed Snow White’s “love story with a guy who literally stalks her. Weird.” Taking a further chomp at the hand which was so generously feeding her, she added: “I think I watched it once and never picked it up again.” This time around, Zegler promised, Snow White would not be dreaming “about true love”, but “about becoming the leader she knows she can be”, a phrase which single-handedly tanked the$270-million film’spredicted box-office performance. Shoehorning modern manners into this unruly fairy tale appears to have backfired. Why?\n\nDisney’s dalliances with “wokeness” are well documented, and tiresome. In 2023, its casting of the black actress Halle Bailey as Ariel inThe Little Mermaidsparked outrage, much of itracist. Its megabucks Marvel franchise has attractedsimilar opprobrium. The conversation aroundSnow White, however, is summarised by outrage from the warriors ofMumsnet, who insist “there’s nothing wrong with dreaming of marriage”, and “I don’t understand why a man loving a woman is bad at all!” The lens of criticism is so relentlessly trained on the film’s feminism or lack of it that the underlying assumption is taken for granted: that mass-market cinema must contain amessage, and that its plots can be used as a weathervane for contemporary sexual or racial politics.\n\nThere will always be an effort to ground adaptations in recognisable sensibilities — this explains the success and longevity of the Walt Disney original — but when this aim supersedes the desire to tell a story well, it dooms the project. And when, as has happened here, the sensibilities are not those held by the actual audience, but by an idealised progressive one, the project becomes a condescending exercise in wish-fulfillment. It seems to say, this is the audience weshouldhave, and you should be ashamed for yearning for a version of the story which is backwards. Ramming an anti-romance message down the throats of little girls and their mothers will only have the effect of making love, marriage and the family seem under siege. In reality, of course, no serious feminists are questioning any of those things. But the upshot of Disney’s bungled reworking ofSnow Whitemeans that fewer people will watch the film.\n\nPerhaps more than in any other mode of storytelling, we look for moral significance in fairy tales. This is why, mishandled, they are so risky. Twisting tales which are so deeply rooted within the cultural unconscious is a dangerous game, not because doing so undermines our hopes and dreams, as those Mumsnetters suggested, but because it obscures a primordial truth. Fairy tales matter, and persist, because they are functional: they warn children about the cruelty of the world — and tell them to get ready. They carry echoes from the preliterate childhoods of medieval Bavaria, the maritime legends of Scandinavia, and the paranoid folklore of woodside hamlets where the young were warned that “tame wolves are the most dangerous of them all”. Scores of girls — little mermaids, little red riding hoods, sleeping beauties — totter towards the jaws of death in oral tales captured by the Grimms, Hans Christian Andersen and Charles Perrault; they mostly get gobbled up, their stories cautionary rather than aspirational.\n\nLike much folklore, fairy tales have a didactic role: the child reared on such stories learns not simply to wait for a prince but to avoid the forest, be wary of adults and fear ferocious animals. Many of the children survive through ingenious deception, trickery and bravery — think of Hansel and Gretel shoving the witch into the oven. Modern children for whom unhappiness is so often pathologised rather than accepted as an unavoidable part of adolescence would do well to read these centuries-old stories of resilience.\n\nNo one understood this better than the Austrian psychologist Bruno Bettelheim, whose 1976 analysisThe Uses of Enchantmentwas heavily consulted by Stanley Kubrick during the production ofThe Shining. That film’s mostly latent horror, its masterfullayering of symbolism, is traceable in Bettelheim’s accounts of fairy tales. The “use” of enchantment, he argues, is “overt and covert meanings” which “make some coherent sense out of the turmoil” of children’s feelings. Instead of distracting girls and boys from their “formless, nameless anxieties”, fairy tales help them understand them, delivering truths about the dangerous world of adulthood which are just abstracted enough not to frighten them. The archetypal fairy tale confronts children squarely with death, rape, abduction, exploitation — all at one remove. They are steeped in classical myth, Christian allegory and the golden suns and silver moons of pagan symbolism. For this reason they are mysterious and beautiful; for this reason they are long-lasting.\n\nBettelheim, a die-hard Freudian, discussesSnow Whitespecifically as a warning to girls about the dangers of premature sexuality. For him the dwarfs are symbols of pre-oedipal childhood: they have no desires, and no identities (naming them and giving them distinct personalities is a Disney thing), but instead live in a “never-changing circle of work in the womb of the earth [they are miners], as the planets circle endlessly in a never-changing path in the sky”. Snow White must graduate from their company into mature sexual life, one which at first thwarts her (her desire for beautification via the corset and comb temporarily put her out of action before the final apple, Edenic totem of sexual knowledge) but which, after a long period of immobility, ultimately saves her via rescue by the prince.\n\nThe “deep sleep”, Bettelheim suggests, has a further allegorical meaning: that a healthy adolescence involves “time of rest and concentration” for deeper self-knowledge to develop. Fairy tales are not all swashbuckling and action; they are also repose, boredom, frustration. The story in general confronts children with an unwelcome but necessary fact: that they too will one day be forced to grow up, will leave the secure world of the dwarfs and be “expelled eventually from the original paradise of infancy” to be faced with dangerous people and their frightening desires. Sometimes, the story tells us, it is our own family that forces us into jeopardy — similar tales of absent, weak or dead fathers or jealous, vengeful mothers occur everywhere, as inHansel and Gretel,Cinderella,andBeauty and the Beast. The lesson here is not to fear your mother and father — they, after all, are probably the ones telling you the story — but to accept your own conflicted feelings about them, and so mature out of their care.\n\nAnd so the functional role of fairy tales is revealed. More than simple amusements — and quite aside from dictums on sexual politics — these are strange glimpses into adulthoods that await the infant listener. When they tell a story about the greater vulnerability of girls, they are telling the truth — describing not the world we hope for but the one we are in. This is why the new film remake is so hideous: it wrenches apart the original and supplants it in a fantasy sanitised of the oppressive realities of girlhood.\n\nThe reason thetrendof live-action adaptationsfeelsdissatisfying is because it so often glosses over what is truly wonderful about the dark, cruel tales exchanged by our ancestors and hinted at in the Disney originals: that these are generous and sophisticated allegories with lessons important enough to have been carried in the protective shell of fantasy over many centuries. In modern childhoods beset with distractions and medicalised labels, coping with grand existential messages should be a priority; bedtime stories are best not when scolding us into correct opinions but confronting us with truths, their horrors just hidden enough that we might sleep.\n\nWe welcome applications to contribute to UnHerd – please fill out the form below including examples of your previously published work.Pleaseclick hereto submit your pitch.\n\nPleaseclick hereto view our media pack for more information on advertising and partnership opportunities with UnHerd.",
        "source_3": "Disneyhad a Hollywood “premiere” for its new live-action “Snow White” that did not have the usual excitement — no guests were on hand; onlyDisney’semployees were present. The red carpet remained rolled up.\n\nThe House of Mouse took the charming 1937 classic “Snow Whiteand the Seven Dwarfs” — beloved by millions — and turned it into a feminist rant.\n\nIts star,Rachel Zegler, spouts the most awful drivel.\n\nMs.Zeglerslammed the original version, saying Prince Charming “literally stalks” Snow White.\n\nHer princess is “not going to be saved by the prince, and she’s not going to be dreaming about true love,” Ms.Zeglerdeclared. Instead, Snow Woke will be the Betty Friedan she always knew she could be — “fearless, fair, brave and true.”\n\nAll that’s missing is a couple of transgendered dwarfs. Naturally, Ms.Zegleralso hates President Trump (“a man who threatens our democracy”) and supports the Palestinian cause.\n\nThe queen, played by Gal Gadot, provides a vivid contrast. The Israeli actress is the mother of four, served in the Israel Defense Forces and champions the Jewish State.\n\nUnsurprisingly, showings of “Snow White” — which opened nationally on March 21 — aren’t exactly sold out. Why should moviegoers pay $12 for indoctrination when they can get the same thing for free on CNN?\n\nSnow Woke is symptomatic of the feminism that infests every aspect of the culture — anti-man, anti-woman and anti-family. The ideology has had the same effect on our society as Dylan Mulvaney on Bud Light sales.\n\nFeminists told us that women don’t need men, marriage is obsolete, and children are a threat to the planet. Far too many swallowed the toxic dogma, especially the young.\n\nNow, by embracing transgenderism, feminists are at the forefront of the movement to abolish women. They want to see males who think they’re females invading women’s sports and private spaces.\n\nIn 1970, married couples were 71% of all U.S. households. Today, they’re less than half. In 1962, 90% of 30-year-olds were married. By 2019, the figure had fallen to 51%. Two in five young adults say marriage is an outdated institution.\n\nThis seismic shift has led to isolation, plummeting birth rates, and children set adrift. Gallup says over one-third of women and 20% of men report having been diagnosed with depression at some point in their lives.\n\nOne in four children (17.6 million) grow up in homes without their biological fathers. Soaring rates of juvenile crime, addiction and homelessness are a result.\n\nThe total fertility rate, the number of children the average woman will have in her lifetime, fell from 2.54 in 1970 to 1.66 today, well below the replacement rate of 2.1.\n\nOur population will begin to decline sometime in the next decade, with a devastating impact on the economy and society. Elon Musk warns, “Population collapse due to low birth rates is a much bigger threat to civilization than global warming.”\n\nThe Democratic governor of Oregon, Tina Kotek, designated March 10 as Abortion Provider Appreciation Day. What’s next, Poison Apple Provider Appreciation Day?\n\nDuring the Golden Age of Hollywood, we had uplifting dramas (like “Mr. Smith Goes to Washington” and “MeetJohnDoe”) and movies that extolled true love, home and family. Recall the last line of “The Wizard of Oz,” which was released two years after “SnowWhiteand the Seven Dwarfs” — “Oh, Auntie Em, there’s no place like home.”\n\nToday, we have movies dripping with nihilism, cynicism and despair — films with all the charm of an open sewer on a humid day.\n\nWhat would you expect? Back in the day, movies were made by giants like Frank Capra,John FordandWalt Disneyand starredJohnWayne, Henry Fonda and Gary Cooper.\n\nNow, Hollywood is dominated by directors like Quentin Tarantino, Martin Scorsese and James Cameron and talents like Robert De Niro, Nicole Kidman and Leonardo DiCaprio. And they’re at the top of the food chain. At the bottom are the maniacs with cameras who make horror movies and action flicks.\n\nLittle wonder that theDisney Corporationcould take a jewel like the original Snow White and turn it into dross.\n\nNext, Ms.Zeglerwill play “Evita” on the London stage. She’ll make a much better fascist floozy than a fairy-tale princess.\n\n• Don Feder is a columnist with The Washington Times.\n\nCopyright © 2025 The Washington Times, LLC.Click\n                            here for reprint permission.\n\nPope Leo should tell Catholics: Marry young, have many children\n\nTrump’s TikTok delays undermine his China hawks while Intel controversy grows"
    }
}