{
    "question": "How might terminating CHNV parole—and the associated work permits and deportation protections—for more than 500,000 Cuban, Haitian, Nicaraguan, and Venezuelan migrants affect humanitarian outcomes, local economies, and immigration enforcement in the coming months?",
    "content": {
        "source_1": "Updated on:  March 23, 2025 / 4:24 PM EDT/ CBS News\n\nThe Trump administration will be revoking the legal status of hundreds of thousands of Latin American and Haitian migrants welcomed into the U.S. under a Biden-era sponsorship process, urging them to self-deport or face arrest and removal by deportation agents.\n\nThe termination of their work permits and deportation protections under an immigration authority known as parole will take effect in late April, 30 days after March 25,according to a noticeposted by the federal government.\n\nThe move will affect immigrants from Cuba, Haiti, Nicaragua and Venezuela who flew to the U.S. under a Biden administration program,known as CHNV, that was designed to reduce illegal immigration at the U.S.-Mexico border by giving would-be migrants legal migration avenues.\n\nA total of 532,000 migrants entered the U.S. under that policy, which was paused soon after President Trump took office, though it's unclear how many have been able to secure another status that will allow them to stay in the country legally.\n\nCBS Newsfirst reportedin early February that the Trump administration was planning to revoke the legal status of individuals who entered the U.S. under the CHNV process.\n\nThe Department of Homeland Security said it will seek the arrest and deportation of those subject to the policy change if they fail to depart the U.S. in the next 30 days. Officials are urging migrants to use the newly repurposed CBP Home smartphone app to register for self-deportation.\n\nBut DHS said it retains the authority to target migrants who arrived under this program before the 30-day period lapses. Officials say those prioritized for arrest will include migrants who have failed to apply for another immigration benefit like asylum or a green card.\n\nIn a statement, DHS spokeswoman Tricia McLaughlin said the migrants allowed into the U.S. under the CHNV process were \"loosely vetted,\" and argued the program undercut American workers.\n\n\"The termination of the CHNV parole programs, and the termination of parole for those who exploited it, is a return to common-sense policies, a return to public safety, and a return to America First,\" McLaughlin added.\n\nFriday's announcement is the latest effort by the Trump administration to discontinue humanitarian-based immigration programs that allow migrants to enter or stay in the country with the government's permission.\n\nThe CHNV program in question was hailed by the Biden administration as a successful policy that reduced illegal border crossings by migrants from Cuba, Haiti, Nicaragua and, to a lesser extent, Venezuela. But Republicans denounced it as an effort to circumvent the limits Congress placed on legal immigration, and noted that the program had some recordedinstances of fraud.\n\nThe Biden administrationlast fallmade a decision not to allow CHNV beneficiaries to renew their two-year work permits under the program, saying they could apply for other benefits, like asylum and Temporary Protected Status. That prospect, however,changed dramaticallywhen Mr. Trump took office.\n\nHis administration has already announced plans to phase out the TPS programs for Haitians and Venezuelans. It also suspended all pending immigration benefit applications filed by those who arrived under CHNV, citingconcerns about fraud and vetting.\n\nCamilo Montoya-Galvez is the immigration reporter at CBS News. Based in Washington, he covers immigration policy and politics.",
        "source_2": "Anna Commander is a Newsweek Editor and writer based in Florida. Her focus is reporting on crime, weather and breaking news. She has covered weather, and major breaking news events in South Florida. Anna joined Newsweek in 2022 from The National Desk in Washington, D.C. and had previously worked at CBS12 News in West Palm Beach. She is a graduate of Florida Atlantic University. You can get in touch with Anna by emailinga.commander@newsweek.com.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nTheDepartment of Homeland Securityannounced a new action on Friday, revoking a Biden administration age parole program for Cubans, Haitians, Nicaraguans and Venezuelans.\n\nSince his January 20 inauguration, PresidentDonald Trumphas implemented sweeping change, mainly through executive orders, and prioritized immigration.\n\nOver the weekend, Trump implemented the Alien Enemies Act of 1798, a wartime law that grants the commander-in-chief the authority to detain or deport non-citizens. The implementation was blocked in federal court and has sparked a contentious legal back and forth this week.\n\nIn a noticeposted to the Federal Registrar on Friday, Secretary of Homeland SecurityKristi Noemannounced the termination of the Cuba, Haiti, Nicaragua, and Venezuela (CHNV) parole program.\n\nThe notice says that the parole program period is 30 days after the date of publication. \"Parolees without a lawful basis to remain in the United States following this termination of the CHNV parole programs must depart the United States before their parole termination date,\" the notice says.\n\nIn an email toNewsweekFriday evening, a DHS official said: \"The previous administration lied to America. They allowed more than half a million loosely vetted aliens from Cuba, Haiti, Nicaragua, and Venezuela and their immediate family members to enter the United States through these disastrous parole programs; granted them opportunities to compete for American jobs and undercut American workers; forced career civil servants to promote the programs even when fraud was identified; and then blamedRepublicansinCongressfor the chaos that ensued and the crime that followed.\"\n\nThe statement continued, \"The termination of the CHNV parole programs, and the termination of parole for those who exploited it, is a return to common-sense policies, a return to public safety, and a return to America First.\"\n\nThe humanitarian program waspreviously pausedlast August under former PresidentJoe Bidenout of \"an abundance of caution\" to look into allegations of fraudulent applications.\n\nApproximately 532,000 individuals who benefited from this program will lose their legal status on April 24, 2025, which is 30 days after the notice's publication in the Federal Register, according to the Associated Press.\n\nThe decision to revoke the program has been met with legal opposition. A group comprising American citizens and immigrants has filed a lawsuit challenging the termination, seeking to reinstate the humanitarian parole provisions.\n\nProject for Immigration Reform, whose policy positions on immigration align with conservative values, posted on X in response to Fox News' Bill Melugin's posting of the parole program's revocation:\"This is great! The CBP One App parole program was illegal.\"\n\nThe Federation for American Immigration Reform, which says they fight for \"a stronger America with controlled borders, reduced immigration and better enforcement\" but has been subject of controversy, said on X:\"Abuse of the CBP One app and the unlawful CHNV mass parole program have been disasters for America.\n\n\"Those programs need to be shut down and Remain in Mexico must come back.\n\n\"Kristi Noem says she and President Trump will do just that.\"\n\nMichael Bustamante, associate professor at the University of Miami and Emilio Bacardí Moreau Chair in Cuban and Cuban-American Studies, said on X:\"Wow.\n\n\"So not only did they end the new issuance of parole under the CNHV program on day 1. Looks like they're pulling the status from those who have it, adding to ranks of those with undocumented status and putting targets on their backs.\n\nGibson, Dunn & Crutcher LLP, commonly known as Gibson Dunn, is a prominent international law firm headquartered in Los Angeles, California, and established in 1890, wrote on its website:\"Individuals affected by this policy change should consult with immigration attorneys or accredited representatives to assess their eligibility for alternative immigration benefits. It's crucial to act promptly, as certain applications have strict deadlines and processing times.\"\n\nLegal challenges to the revocation of the CHNV parole program are expected as immigration advocates and affected communities push back against the policy change. Meanwhile, individuals impacted by the decision are being urged to explore alternative legal pathways, such as Temporary Protected Status (TPS) or asylum applications, to maintain their residency.\n\nUpdate 03/21/25 7:59 p.m. ET: This article has been updated with additional information.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nAnna Commander is a Newsweek Editor and writer based in Florida. Her focus is reporting on crime, weather and breaking news. She has covered weather, and major breaking news events in South Florida. Anna joined Newsweek in 2022 from The National Desk in Washington, D.C. and had previously worked at CBS12 News in West Palm Beach. She is a graduate of Florida Atlantic University. You can get in touch with Anna by emailinga.commander@newsweek.com.\n\nAnna Commander is a Newsweek Editor and writer based in Florida. Her focus is reporting on crime, weather and breaking news. She has covered weather, and major breaking news events in South Florida. Anna joined Newsweek in 2022 from The National Desk in Washington, D.C. and had previously worked at CBS12 News in West Palm Beach. She is a graduate of Florida Atlantic University. You can get in touch with Anna by emailinga.commander@newsweek.com.\n\nAnna Commander is a Newsweek Editor and writer based in Florida. Her focus is reporting on crime, weather and breaking                                    ...Read more",
        "source_3": "The Trump administration is revoking the legal status of more than 500,000 migrants who entered the United States through a Biden administration parole program.\n\nCBS Newsreportedthat 532,000 migrants from countries such as Cuba, Haiti, Nicaragua, and Venezuela, who entered the country through a program called CHNV, will have their “work permits and deportation protections” terminated in April.\n\nThe move will affect immigrants from Cuba, Haiti, Nicaragua and Venezuela who flew to the U.S. under a Biden administration program, known as CHNV, that was designed to reduce illegal immigration at the U.S.-Mexico border by giving would-be migrants legal migration avenues.\n\nA total of 532,000 migrants entered the U.S. under that policy, which was paused soon after President Trump took office, though it’s unclear how many have been able to secure another status that will allow them to stay in the country legally.\n\nIn a notice, it wasrevealedthat the Department of Homeland Security (DHS) would be “terminating the categorical parole programs for inadmissible aliens from Cuba, Haiti, Nicaragua, and Venezuela and their immediate family members”:\n\nThe Department of Homeland Security (“DHS”) is terminating the categorical parole programs for inadmissible aliens from Cuba, Haiti, Nicaragua, and Venezuela and their immediate family members (hereinafter referred to as “CHNV parole programs”) that DHS announced in 2022 and 2023. This Federal Register notice is intended to provide context and guidance to the public regarding the termination of the CHNV parole programs and related employment authorization.\n\nBreitbart News’s Hannah Knudsenreportedin February that CBS News learned through “internal government documents reviewed,” that the Trump administration was planning to revoke the legal status for thousands of migrants admitted into the country under the Biden administration.\n\nA reportreleasedby the House Judiciary Committee in early March showed that former President Joe Biden expanded the Temporary Protected Status (TPS) program, as well as the CHNV Parole Program. Through his expansion of the programs, millions of illegal aliens were allowed to enter the U.S. “with little to no vetting.”\n\nIn August 2024, Fox Newsreportedthat DHS under the Biden administration had decided to halt the “issuing of advance travel authorization” for the CHNV Parole Program, “out of an abundance of caution.”\n\nThe freeze of the program at the time came “after an internal report” found there were “large amounts of fraud in applications for” people wanting to sponsor migrants in the program, according to the outlet."
    }
}