{
    "question": "How might requiring in-person identity checks for people who cannot verify online impact both fraud prevention and beneficiaries’ access to services when the change takes effect on March 31?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nTo limit fraudulent Social Security claims, the Trump administration is stopping identity verifications over the phone, instead forcing millions of new applicants and existing recipients to verify online or in person at a field office. (AP Video: Nathan Ellgren)\n\nDemonstrators gather outside of the Edward A. Garmatz United States District Courthouse in Baltimore, on Friday, March 14, 2025, before a hearing regarding the Department of Government Efficiency’s access to Social Security data. (AP Photo/Stephanie Scarbrough)\n\nDemonstrators gather outside of the Edward A. Garmatz United States District Courthouse in Baltimore, on Friday, March 14, 2025, before a hearing regarding the Department of Government Efficiency’s access to Social Security data. (AP Photo/Stephanie Scarbrough)\n\nDemonstrators gather outside of the Edward A. Garmatz United States District Courthouse in Baltimore, on Friday, March 14, 2025, before a hearing regarding the Department of Government Efficiency’s access to Social Security data. (AP Photo/Stephanie Scarbrough)\n\n▶ Follow live updates onPresident Donald Trump and his administration\n\nWASHINGTON (AP) — In an effort to limit fraudulent claims,the Social Security Administrationwill impose tighter identity-proofing measures — which will require millions of recipients and applicants to visit agency field offices rather than interact with the agency over the phone.\n\nBeginning March 31st, people will no longer be able to verify their identity to the SSA over the phone and those who cannot properly verify their identity over the agency’s “my Social Security” online service, will be required to visit an agency field office in person to complete the verification process, agency leadership told reporters Tuesday.\n\nThe change will apply to new Social Security applicants and existing recipients who want to change their direct deposit information.\n\nRetiree advocates warn that the change will negatively impact older Americans in rural areas, including those with disabilities, mobility limitations, those who live far from SSA offices and have limited internet access.\n\nThe plan also comes as the agency plans toshutterdozens of Social Security offices throughout the country and has already laid out plans to lay offthousands of workers.\n\nIn addition to the identity verification change, the agency announced that it plans to expedite processing of recipients’ direct deposit change requests – both in person and online – to one business day. Previously, online direct deposit changes were held for 30 days.\n\n“The Social Security Administration is losing over $100 million a year in direct deposit fraud,” Leland Dudek, the agency’s acting commissioner, said on a Tuesday evening call with reporters — his first call with the media. “Social Security can better protect Americans while expediting service.”\n\nHe said a problem with eliminating fraudulent claims is that “the information that we use through knowledge-based authentication is already in the public domain.”\n\nMore than 72.5 million people, including retirees and children, receive retirement and disability benefits through the Social Security Administration.\n\nConnecticut Rep. John Larson, the top Democrat on the House Ways and Means Social Security Subcommittee, said in a statement that “by requiring seniors and disabled Americans to enroll online or in person at the same field offices they are trying to close, rather than over the phone, Trump and Musk are trying to create chaos and inefficiencies at SSA so they can privatize the system.”\n\nThe DOGE website says thatleases for 47 Social Security field officesacross the country, including in Arkansas, Texas, Louisiana, Florida, Kentucky and North Carolina, have been or will be ended. However, Dudek downplayed the impact of its offices shuttering, saying many were small remote hearing sites that served few members of the public.\n\nMany Americans have been concerned that SSAoffice closuresand massive layoffs of federal workers — part of an effort by PresidentDonald TrumpandElon Musk’sDepartment of Government Efficiency to shrink the size of the federal government — will make getting benefits even more difficult.\n\nMusk has pushed debunked theories about Social Security and described the federal benefit programs as rife with fraud, and called it a “Ponzi scheme” suggesting the program will be a primary target in his crusade to reduce government spending.\n\nVoters have flooded town halls across the country to question Republican lawmakers about the Trump administration’s cuts, including its plans for the old-age benefits program.\n\nIn addition a group of labor unions last week sued and asked afederal courtfor an emergency order to stop DOGE from accessing the sensitive Social Security data of millions of Americans.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Aliss Higham is a Newsweek reporter based in Glasgow, Scotland. Her focus is reporting on Social Security, other government benefits and personal finance. She has previously extensively covered U.S. and European politics, Russia's invasion of Ukraine and the British Royal Family. Aliss joined Newsweek full time in January 2024 after a year of freelance reporting and has previously worked at digital Reach titles The Express and The Mirror. She is a graduate in English and Creative Writing from Goldsmiths, University of London. You can get in touch with Aliss by emailinga.higham@newsweek.com. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nThe Social Security Administration (SSA) has confirmed that it is \"implementing stronger identity verification procedures\" to prevent fraud after a leaked memo earlier this week detailed the plans.\n\nNewsweekhas contacted the SSA for comment via email.\n\nThe SSA distributesbillions of dollars in benefits every monthto almost 70 million recipients, and it is a vital source of income for Americans across the country. However, recent changes at the federal agency, including staffing cuts and office closures, have caused concerns that customer services and benefits may be affected.\n\nBeginning on March 31, benefit claimants will no longer be able to verify their identity with the SSA over the phone. Those who cannot properly verify their identity using the agency's online service will be required to visit an agency field office in person to complete the verification process.\n\n\"Over the next two weeks, SSA will carefully transition to stronger identity proofing procedures for both benefit claims and direct deposit changes,\" the agency said in a press release issued on March 18. \"Individuals seeking these services who cannot use their personal 'my Social Security' account, which requires online identity proofing, will then need to visit a local Social Security office to prove their identity in person.\"\n\nThe change is set to apply to new Social Security applicants and existing recipients who want to change their direct deposit information. The agency also announced plans to speed up processing for recipients' direct deposit change requests—both online and in person—to one business day. Previously, online direct deposit changes required a 30-day holding period.\n\nWhile new benefit claims can be started using the SSA's phone service, those who cannot use online services will need to visit a field office.\n\nEarlier this week, the Substack Popular Informationpublished a leaked memothat detailed the plans and potential negative effects it could have on Social Security claimants who may struggle with reaching an SSA office.\n\nThe changes come at a time when some Social Security offices are being closed aspart of cost-saving measuresimplemented by the Department of Government Efficiency (DOGE). The agency has also confirmed plans to terminate 7,000 jobs.\n\nThe memo outlined that there could be longer wait and processing times due to an estimated additional 75,000 to 85,000 people needing to visit field offices every week to have their information checked and processed if they cannot do it online.\n\nHowever, the SSA said in its statement that all frontline staff had been brought back into the office five days a week, which would ensure \"maximum staffing is available to support the stronger in-person identity proofing requirement.\"\n\nAccording to Axios, in an earlier version of the memo—obtained by the outlet but not seen byNewsweek—Doris Diaz, the acting deputy commissioner of operations, said, \"The consequence of reduced service channels could be significant.\"\n\n\"For example, an individual who closes a bank account could have benefits suspended if unable to access in-person service,\" she continued, adding that \"an individual plainly entitled to benefits\" could be \"prevented from applying.\"\n\nLee Dudek, the acting commissioner of the SSA, said in the news release: \"Americans deserve to have their Social Security records protected with the utmost integrity and vigilance. For far too long, the agency has used antiquated methods for proving identity. Social Security can better protect Americans while expediting service.\"\n\nDudek said in a call with reporters on Tuesday, according to the Associated Press: \"The Social Security Administration is losing over $100 million a year in direct deposit fraud. Social Security can better protect Americans while expediting service.\"\n\nRepresentative John B. Larson, aDemocrat from Connecticut,said in a statement on Monday: \"Their memo confirms they are out to gut Social Security to pay for $2 trillion in new tax breaks for the wealthiest one percent. By requiring seniors and disabled Americans to enroll online or in person at the same field offices they are trying to close, rather than over the phone, Trump and Musk are trying to create chaos and inefficiencies at SSA so they can privatize the system.\"\n\nMax Richtman, the president and CEO of the National Committee to Preserve Social Security and Medicare, toldNewsweekin a statement on Tuesday: \"These latest developments are part of a clear pattern:Elon Musk, DOGE, and their acolytes at SSA are engaged in an intentional campaign to make it harder for Americans to collect their hard-earned Social Security benefits.\n\n\"Intentionally constructing obstacles for the people who've earned these benefits (and who pay for SSA operations with every paycheck) betrays at the least an indifference—and more likely, an outright hostility—to the elderly, people with disabilities, their families and survivors who rely on Social Security.\"\n\nThe agency has begun a two-week transition period to help train employees and monitor policy compliance before March 31.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nAliss Higham is a Newsweek reporter based in Glasgow, Scotland. Her focus is reporting on Social Security, other government benefits and personal finance. She has previously extensively covered U.S. and European politics, Russia's invasion of Ukraine and the British Royal Family. Aliss joined Newsweek full time in January 2024 after a year of freelance reporting and has previously worked at digital Reach titles The Express and The Mirror. She is a graduate in English and Creative Writing from Goldsmiths, University of London. You can get in touch with Aliss by emailinga.higham@newsweek.com. Languages: English.\n\nAliss Higham is a Newsweek reporter based in Glasgow, Scotland. Her focus is reporting on Social Security, other government benefits and personal finance. She has previously extensively covered U.S. and European politics, Russia's invasion of Ukraine and the British Royal Family. Aliss joined Newsweek full time in January 2024 after a year of freelance reporting and has previously worked at digital Reach titles The Express and The Mirror. She is a graduate in English and Creative Writing from Goldsmiths, University of London. You can get in touch with Aliss by emailinga.higham@newsweek.com. Languages: English.\n\nAliss Higham is a Newsweek reporter based in Glasgow, Scotland. Her focus is reporting on Social Security, other government benefits                                    ...Read more",
        "source_3": "Those who cannot use an online identity-proving tool will soon need to visit a local Social Security office in person to prove their identity, the Social Security Administration (SSA) said on Tuesday.\n\n\"Over the next two weeks, SSA will carefully transition to stronger identity proofing procedures for both benefit claims and direct deposit changes,\" a statement said.\n\n\"Individuals seeking these services who cannot use their personal ‘my Social Security’ account, which requires online identity proofing, will then need to visit a local Social Security office to prove their identity in person,\" it continued.\n\nThe changes are meant to \"safeguard Social Security records and benefits against fraudulent activity,\" the agency said, and are set to take effect March 31.\n\nTwo people enter a Social Security Administration office in suburban Detroit.(Jim West/UCG/Universal Images Group / Getty Images)\n\nPeople who do not or cannot use the agency's online \"my Social Security\" services may stillstart a benefits claimover the phone, but the claim will not be completed until identity is verified in person.\n\nTo avoid long lines atSocial Security officesacross the country, the agency recommends people call to request an in-person appointment \"to begin and complete the claim in one interaction.\"\n\nDEMS ZERO IN ON MUSK WANTING TO CUT SOCIAL SECURITY, MEDICARE WASTE, WHITE HOUSE RESPONDS\n\nPeople wait in line at a Social Security office before it opens in Houston on July 13, 2022.(Mark Felix for The Washington Post / Getty Images)\n\nPeople who do not already have a \"my Social Security\" account cancreate one here.\n\nThe agency announced it will also be expediting the process time for all direct deposit change requests to one business day. Previously, changes were held for 30 days.\n\nA woman walks into a Social Security office in Houston on July 13, 2022.(Mark Felix for The Washington Post / Getty Images)\n\nLast month, theU.S. government agencythat provides benefits to tens of millions of older Americans said it plans to cut 7,000 workers as part of the Trump administration's plan to slash the size of the federal workforce.\n\nThe SSA sends checks to 73 million retired and disabled Americans each month, according to Reuters.\n\n\"Americans deserve to have their Social Security records protected with the utmost integrity and vigilance,\" Lee Dudek, Acting Commissioner of Social Security, said in a statement. For far too long, the agency has used antiquated methods for proving identity. Social Security can better protect Americans while expediting service.\"\n\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\n\nBy clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time."
    }
}