{
    "question": "In what ways should the newly released JFK documents—particularly Sergyj Czornonoh’s letters claiming a Soviet Embassy warning about Oswald—inform interpretations of Oswald’s Soviet ties and of how U.S. and U.K. officials handled potential threats before the assassination?",
    "content": {
        "source_1": "New details aboutLee Harvey Oswald’s connections to the Soviet Union were revealed in a tranche ofdeclassified documentsreleased by the Trump administration concerning the1963 assassinationof former President John F. Kennedy.\n\nAbout 2,200 files – consisting of approximately 63,000 pages – were posted in two batches by the U.S. National Archives and Records Administration on Tuesday evening. It came afterPresident Donald Trumpteased the release on Monday while visiting the John F. Kennedy Center for the Performing Arts and asserted that the government would not redact “anything” – stating about 80,000 pages would be made public.\n\nA 1991 CIA memo revealed that Oswald,JFK’s assassin, was watched “closely and constantly” by the KGB after defecting to the Soviet Union in 1959. Despite determining Oswald was not a member of the now-defunct Soviet secret police, one agent noted that he was a “poor shot.”\n\nEager historians and researchers trawled through the trove of files – many of which blurry and poorly organized – seeking any sign of new or shocking. However, many of the records had already in the public domain.\n\nTrump releases 63,000 pages of JFK assassination files\n\nLee Harvey Oswald was a 'poor shot,' KGB agent says\n\nFiles shine a light on John F. Kennedy assassin's connection to Soviet Union\n\nTrump praised for ushering in 'new era of maximum transparency'\n\nTimeline: All the JFK documents released since 1992\n\nTim Naftali, a Nixon historian and research scholar at Columbia University, toldThe New York Timesthat it wasn’t damaging information in the JFK assassination files that meant they had been kept secret for decades.\n\nIt was, according to Naftali, to protect classified details about CIA intelligence-gathering – including their methods and sources.\n\nNaftali said he found details in the newly released documents that had previously been omitted.\n\nIt includes details about the U.S. intercepting communications in Egypt, an ally.\n\nAs the Trump administration pushes out controversial policy changes, thousands of declassified files concerning the 1963 assassination of former President John F. Kennedy have been released.\n\nWhile historians, journalists and amateur sleuths pour over the files looking for a scrap of anything new, many have speculated that their release is a “distraction” tactic by the administration.\n\nThe 2,200 files containing approximately 63,000 pages were posted by the U.S. National Archives and Records Administration Tuesday evening after President Donald Trump ordered their release.\n\nTrump boasted of the reams of paper that would be there for all to read; the internet largely reacted with anger.\n\nPeople think Trump’s release of the JFK files is a ‘distraction’\n\nJack Schlossberg, the grandson of John F. Kennedy, said that second-cousin Robert F Kennedy Jr and Donald Trump only care about the assassinated former president’s “carcass”.\n\nSchlossberg, 32, took to X on Wednesday to draw a stark comparison between his grandfather and the incumbent president.\n\n“President Trump is obsessed with my grandfather — but not in his life or what he achieved in it. No, just like @robertfkennedyjr @realdonaldtrump is only interested in JFK’s carcass,” he wrote at the beginning of his thread.\n\nHe later wrote: “JFK fought fascism and Communism. Trump is selling us out to tech warlords, at home and abroad. JFK stood behind unions and labor, demanding healthcare, higher pay. Trump is stripping working families from lifesaving care, financial support.”\n\nMany of the documents released on Tuesday were hand-written, or blurred scans making them difficult to read.\n\nSome were typed more than half a century ago and others had portions of scratched-out information.\n\nThe documents were largely not categorized in an organized way – potentially extending the time to analyze the files by days.\n\nPresident Donald Trump’s administration has released what are believed to be all the U.S. government's remaining classified files on the assassination of President John F Kennedy in 1963.\n\nFor the first time, thousands of previously unseen pages of government documents are now available regarding the former president's violent, untimely death in Dallas' Dealey Plaza. The document dump also includes details relating to the assassinations of Senator Robert F Kennedy and civil rights leader Reverend Martin Luther King Jr.\n\nTrump releases massive number of new documents on JFK assassination\n\nTwo-thirds of the promised filed concerning the John F. Kennedy’s assassination have not been released, an expert on the incident claims.\n\nOn Monday, President Donald Trump promised the government would not redact “anything.” The National Archives wrote on its website that “all records previously withheld for classification” would be released.\n\nJefferson Morley, vice president of the Mary Ferrell Foundation, a nonprofit that operates a database of government records on the event, contested on Tuesday evening that only “two thirds” of the promised documents had been made public.\n\nThe ex-Washington Postreporter added that the release also didn’t include any of the recently discovered FBI files – after the bureau said it had discovered 2,400 new records related to the assassination last month – nor any of the 500-plus Internal Revenue Service records.\n\n“Nonetheless, this is most positive news on the declassification of JFK files since the 1990s,” he added in his statement.\n\nAn unredacted CIA memo from June 1961, which was sent to JFK by aide Arthur Schlesinger Jr, contained harsh criticism of the agency months after its backing of Cuban exiles in the failed Bay of Pigs invasion in an attempt to overthrow Fidel Castro’s government.\n\nAnother document dated January 1962 reveals details of “Operation Mongoose,” a top-secret CIA-led campaign authorized by JFK following the Bay of Pigs to again destabilize and thwart Castro’s Communist government.\n\nIn a letter penned to the British Embassy in 1978, Sergyj Czornonoh said that he warned authorities of Lee Harvey Oswald's plan to assassinate John F. Kennedy months before the president was killed.\n\nCzornonoh, who claimed he was detained in London on July 18, 1963, said he told authorities – and warned U.S. Vice Consul Tom Blackshear – of Oswald’s assassination plot.\n\nThe man claimed he was provided the details by “Mr. Wasilev,” who was working at the Soviet Embassy in Bulgaria.\n\nCzornonoh allegedly warned State Department officials on August 19, 1963, that Oswald possessed a weapon.\n\nDespite being mentioned previously in books, one CIA memo from July 1967 released on Tuesday cited an article from the magazineRampartsabout John Garrett Underhill Jr – believed to be CIA operative, Gary Underhill.\n\nIt states the day after JFK was gunned down, Underhill quickly left Washington, DC before he arrived at a friend’s house in New Jersey.\n\n“He was very agitated. A small clique within the CIA was responsible for the assassination, he confided, and he was afraid for his life and probably would have to leave the country,” the memo read.\n\nUnderhill told his friends that JFK “got wind” of the attempt on his life but was “killed before he could ‘blow the whistle on it.’”\n\nOn May 8, 1964, Underhill was found dead in his Washington apartment, which the coroner ruled as suicide.\n\nAccording to the memo, Underhill’s friends said before his death that he was “sober but badly shook” by the president’s assassination.\n\nAnother CIA memo describes Lee Harvey Oswald phoning the Soviet Embassy asking for a visa while in Mexico City in late September and early October 1963.\n\nOswald also visited the Cuban Consulate in Mexico City seeking a travel visa so he could wait there for a Soviet visa, per the memo.\n\nMore than a month before John F Kennedy’s assassination on October 3, 1963, Oswald drove back to the U.S. through a crossing point at the Texas border.\n\nPer the 1991 CIA memo, released on Tuesday, Nikonov also commented that Lee Harvey Oswald had “a stormy relationship with his Soviet wife, who rode him incessantly.”\n\nThe President's Commission of the Assassination of President John F. Kennedy in September 1964 also commented on the couple’s tumultuous relationship.\n\nHowever, it reported: “The commission does not believe that the relations between Oswald and his wife caused him to assassinate the President.”\n\nAccording to an archivedNew York Timesarticle from the time, it said the commission concluded that the instability “was probably a function of the personalities of both people.”\n\nA 1991 CIA memo cites a former KGB agent named Nikonov, who was tasked to determine whether Lee Harvey Oswald was a member of the Soviet Union’s secret police.\n\nAfter trawling through five thick files on the assassin, Nikonov cast doubt that Oswald was a KGB recruit.\n\nNikonov said he “doubted that anyone could control Oswald” but noted that the KGB “watched him closely and constantly while he was in the USSR.”\n\nOswald defected to the Soviet Union in 1959 and lived in Minsk before returning to the U.S. with a wife and baby in 1962.\n\nOne of the files included a memo from the CIA’s St Petersburg station dated November 20, 1991, which said the KGB, the former security agency for the Soviet Union, watched JFK assassin Lee Harvey Oswald closely.\n\nThe report cites a KGB official named Nikonov who had reviewed five thick files about Oswald to determine was part of the now-defunct Soviet secret police. Nikonov determined he was not.\n\nHe did, however, comment on Oswald’s marksmanship and said he was a “poor shot when he tried target firing in the USSR.”\n\nAbout 2,200 files – consisting of approximately 63,000 pages – were posted by the U.S. National Archives and Records Administration on Tuesday evening.\n\nIt came after President Donald Trump teased the release on Monday while visiting the John F. Kennedy Center for the Performing Arts and asserted that the government would not redact “anything.”\n\nThough Trump previously stated about 80,000 pages would be made public.\n\nResearchers, both professional and amateur, will need time to pore over the recently released JFK assassination documents, but as it stands, it’s doubtful that anything truly revelatory will be found in Tuesday’s trove.\n\nNews outlets spoke to numerous authors and historians who all agreed they’d encountered little new information and noted that many of the documents had been released during previous disclosures.\n\nOn social media things weren’t much different; every time someone thought they’d found something interesting, someone else pointed out the information had been released years — sometimes decades — prior.\n\nIt’s not a surprising development; in 2023, the National Archives estimated that 99 percent of the government’s documents related to JFK’s assassination had been made public at that time.\n\nLarry Sabato, a political scientist at the University of Virginia and the author of “The Kennedy Half-Century: The Presidency, Assassination, and Lasting Legacy of John F. Kennedy,” toldCNNthat he believed people looking for a smoking gun that solves the Kennedy assassination in Donald Trump’s document release are going to be let down.\n\n“I’m just telling you that we will learn things,” Sabato told the broadcaster. “But it may not be about the Kennedy assassination and people who are expecting, you know, to crack the case after 61 years, are going to be bitterly disappointed.”\n\nMany of the documents released on Tuesday had already been made public. In 2023, the National Archives estimated that 99 percent of the government’s documents related to JFK’s assassination had been made public at that point.\n\nDirector of National Intelligence Tulsi Gabbard heaped praise onto her boss, Donald Trump, following Tuesday’s JFK document dump.\n\nShe noted that Trump had kept his promise to release the documents — which he did — though it’s still unclear if there is anything significant in the documents that hadn’t already been revealed in previous records releases.\n\nBack in 2021, Donald Trump tossed around the idea of releasing the remaining JFK assassination files. During an interview with theNew York Timesat the time, Trump seemed fine accepting the general consensus that JFK was killed by Lee Harvey Oswald.\n\n“The reason I did that was because I thought it was appropriate,” Trump told the paper at the time, referencing his desire to release the documents. “When you have something that’s so sacredly secret, it really makes it sound very bad. I think they maybe got it right, probably got it right. Let people examine it.”\n\nTrump has not given any indication that the contents of the records released on Tuesday have shifted his perspective.\n\nDavid J Garrow, a historian with an expertise in US intelligence agencies, toldThe New York Timesthat the trove of documents related to JFK that were released on Tuesday were “profoundly more impenetrable” than previous mass document releases.\n\nThis is, in part, because thousands of documents lack any kind of annotation; its unclear which agencies produced them and many lack identifying information like file numbers.\n\nTrump releases huge number of unseen documents on JFK assassination\n\nDespite the president’s promise earlier today, further information about the assassination of President John F. Kennedy have not yet been released.\n\nHowever, newly released records will be accessible on the President John F. Kennedy Assassination Records Collection web page.\n\nYou can check back for updates here:https://www.archives.gov/research/jfk\n\nAs America braces itself for thousands of declassified CIA documents, former intelligence officerJohn Kiriakouexplains why there isn’t much light left to shed on the presidential assassination – but we should expect intriguing detail about the ‘second gunman’ theory in the killing of his brother, Robert.\n\nIn the JFK files, there’ll be no smoking gun – only bombshells\n\nIf you’re wondering why not all of the the JFK Assassination records are not yet available online – it’s a question of priority.\n\nThe records collection consists of millions of pages, photographs, electronic items, and artifacts, most of which are available for public access at the National Archives at College Park, in Maryland.\n\nThe National Archives is currently prioritizing the digitization of these records to make them more widely accessible online,” according to the institution.\n\nSince January 2024, over 700,000 pages have been digitized and made available through the National Archives Catalog.\n\nOnce the files are declassified and the White House gives the National Archives the OK to release them, they can be viewed onthis webpage.\n\nMost of the files related to Kennedy’s assassination are already public. They are accessible on theNational Archives website.\n\nMost of the government’s records on the inquiry into Kennedy’s assassination have been released to the public and the information supports the conclusion that 24-year-old Lee Harvey Oswald acted alone in assassinating Kennedy.\n\nThe documents released over the years have provided more details about Oswald and pointed to his possible motivations in carrying out the shooting. However, the information has never supported a conspiracy theory – though that has not stopped people from suggesting alternative scenarios.\n\nA Republican-led task force in the House intends to investigate and release formerly classified information related to several major events that have spurred conspiracy theories that have lingered across the U.S. such as the assassination of former president John F. Kennedy Jr., the September 11 terrorist attacks and the prosecution of Jeffrey Epstein.\n\nWhile the unreleased Kennedy assassination records may fuel conspiracy theories of a government coverup or something even more sinister, one expert believes that information in the withheld documents could be “embarrassing” to the CIA who “dropped the ball” on preventing the former president from being assassinated.\n\nSteve Gillon, a senior faculty fellow at the University of Virginia’s Miller Center of Public Affairs,toldUVA Todayin 2023 that he believes the remaining classified documents will show that the CIA failed to prevent Lee Harvey Oswald from assassinating Kennedy.\n\n“I think that they had warnings that Oswald had threatened to assassinate the president; perhaps even possessed recordings of Oswald making these threats in front of KGB agents when he was in Mexico City,” Gillon said at the time.\n\n“But that information was never effectively relayed back to the FBI, so they’re very casual in their efforts to contact Oswald when he returned to Dallas. I think there was a breakdown in the communication between the CIA and the FBI, and as a result Oswald slipped through the fingers of American intelligence.”\n\nGillon hypothesized that some materials may remain classified because they contain information about the methods the U.S. used to obtain intelligence – which may be methods they still use today.\n\nAs America braces itself for thousands of declassified CIA documents, former intelligence officerJohn Kiriakouexplains why there isn’t much light left to shed on the presidential assassination – but we should expect intriguing detail about the ‘second gunman’ theory in the killing of his brother, Robert.\n\nIn the JFK files, there’ll be no smoking gun – only bombshells\n\nCongress passed a law requiring documents containing information about John F. Kennedy’s assassination in 1992 – in part due to the rise of conspiracy theories that alleged government agents and officials were involved in the assassination.\n\nHoping to increase government transparency, Congress passed the Kennedy Assassination Act which required assassination records to be publicly disclosed in full no later than 25 years after it was enacted (October 26, 2017).\n\nThose records included any government records related to the federal investigation into the 1963 assassination of Kennedy, including interview transcripts, allegations, articles, letters and more.\n\nHowever, Congress included an exemption that allowed the sitting president at the time, Donald Trump, to postpone the release of others if it contained information that was harmful to national security.\n\nThough tens of thousands of documents were released under Trump’s first administration, as well as Biden’s administration, a small portion of records have been withheld seemingly for national security reasons.\n\nHowever, Trump said on Monday he directed his administration to release all the records without redactions.\n\nThe FBI said it found 2,400 new pages of documents about the assassination of John F. Kennedy following President Donald Trump’s decision to release the highly classified files.\n\nIn a statement in February, theFBIsaid due to “technologic advances” in the bureau’s record-keeping processes, a new search carried out in January this year following Trump’s executive order unearthed new records relating to Kennedy’s assassination.\n\n“The FBI conducted a new records search pursuant to President Trump's Executive Order issued on January 23, 2025, regarding the declassification of the assassination files of JFK, RFK, and MLK,” the bureau said. “The search resulted in approximately 2400 newly inventoried and digitized records that were previously unrecognized as related to the JFK assassination case file.”\n\nThe bureau did not specify what the records contain but said it was working to transfer the documents to the National Archives and Records Administration to be included in the declassification process.\n\nFlorida Rep. Anna Paulina Luna, a member of the far-right House Freedom Caucus who was elected to the House in 2022, has repeatedly pushed for “transparency” in the federal government — specifically, to dive into conspiracy theories surrounding unidentified flying objects, the origins of COVID-19, and the September 11 attacks, all of which will be at the center of her task force.\n\n“The federal government has been hiding information from Americans for decades,” she said in astatementon February 11.\n\nMeet Anna Paulina Luna, the GOP lawmaker revisiting JFK files and Epstein’s list\n\nWhite House Deputy Press Secretary Harrison Fields told NewsNation on Tuesday that Americans “are truly going to be shocked” and what they see from the JFK assassination files release.\n\nFields declined to tease what information could be unveiled in the document release but said “There will be a story to tell” once the remaining documents become public.\n\nHistorians have disputed predictions that the thousands of remaining documents will unveil bombshell information regarding the assassination of the former president.\n\nAs Donald Trump signs an executive order to declassify and release all remaining records relating to the assassination of President John F Kennedy, ‘The Rest is History’ podcaster and historian,Dominic Sandbrook, examines the conspiracies that still persist today – and why.\n\nIt was Russia, CIA, the FBI: 10 JFK assassination conspiracies that refuse to die\n\nThe remaining documents related to the assassination of John F. Kennedy can beseen on a National Archives webpageonce the White House releases them.\n\nRepresentative Anna Paulina Luna, who is leading the congressional task force to oversee the declassification of documents,saidshe received confirmation from the National Archives about where to view the documents.\n\nThe White House has not provided an exact time they anticipate the documents to be released but Justice Department lawyers were given until noon on Tuesday to review materials, according to reports.\n\nConspiracy theories about the assassination of President John F Kennedy on that fateful day on November 22, 1963, have swirled for decades. But experts agree that the imminent release of the long-awaited JFK files, along with unreleased documents about the killings of Robert F Kennedy and civil rights icon Martin Luther King Jr, is unlikely to quell the paranoia surrounding any of their murders.\n\nFor decades, conspiracy theories have swirled surrounding the assassination of John F. Kennedy – but historians have largely agreed that the release of the remaining documents is unlikely to upend the narrative that Lee Harvey Oswald fired fatal shots at Kennedy on November 22, 1963.\n\nMost of the records related to the assassination have been released, according to the National Archives. Only a few thousand remain.\n\nKevin Boyle, a professor at Northwestern Universitytold NPRin January that the remainder were “not going to reveal something new” about Kennedy’s assassination.\n\nFredrik Logevall, a JFK biographer, similarly said the documents were not going to “dramatically overturn” history’s understanding of the assassination but that there could be useful information in the materials.\n\n1992: The federal government mandates all assassination-related documents be housed in the NARA and most be released by 2017, barring any exemptions by the president.\n\nJuly 2017:NARA releases 3,810 documents and 17 audio filesrelated to the Kennedy assassination.\n\nOctober 2017: NARAreleases 2,891 recordsrelated to the Kennedy assassination. Trump ordered the release of additional records by April 18, 2018 but withholds some due to national security concerns.\n\nNovember 2017: NARA releases11,420 recordsrelated to the Kennedy assassination. Of those, around 2,400 contain redactions\n\nDecember 2017:NARA releases 3,539 documentsrelated to the Kennedy assassination\n\nApril 2018: NARA releases 19,045 records related to the Kennedy assassination\n\nOctober 2021: Former president Joe Bidenorders for records containing national security information to be withheld while allowing other documents to be released\n\nDecember 2021:NARA releases 18,870 records per Biden’s order\n\nDecember 2022:NARA releases 13,173 records related to the Kennedy assassination\n\nAugust 2023:NARA releases 2,693 recordsbetween April and August 2023\n\nJanuary 2025: Trump signs executive order directing the government to declassify documents related to the Kennedy assassination.\n\nThe Justice Department ordered some of its lawyers to “urgently” review records from the assassination of former president John F. Kennedy that the president ordered to be released on Tuesday,Reuters reported.\n\nIn an email sent to attorneys working in the Operations Section of the Office of Intelligence, by Christopher Robinson, a National Security Division official, on Monday evening, lawyers were told to review between 400 and 500 documents each.\n\nLawyers were given until noon on Tuesday to complete the review which includes records related to the assassination of John F. Kennedy as well as his brother Robert F. Kennedy and civil rights activist Martin Luther King Jr.\n\nPresident Donald Trump has ordered the declassification of all files related to the 1963 assassination of then-president John F. Kennedy - and FBI officials say they have found thousands more pages of docs ready for the public.\n\nEverything we know about the JFK files set to be declassified under Trump\n\nThe president said he would release approximately 80,000 documents related to the assassination today. He did not clarify what new information may be included in that.",
        "source_2": "EAGLE-eyed sleuths have spotted a file missing from the declassified docs about JFK's assassination released by Donald Trump on Tuesday.\n\nTrump released more than 2,000 PDF files in a bid to shed light on the 1963 assassination of formerPresident John F. Kennedy.\n\nHowever, hours after 2,182 files were uploaded to the National Archives and Records Administration, people noticed one might have vanished from the list of files.\n\nResearcher John Greenewald Jr. pointed out the reported discrepancy in aposton X but said he luckily saved an archive of the reportedly deleted page.\n\nIt's unclear if the file was actually removed as chaos is swirling around the documents - and dozens of fake pages are already doing the rounds on social media.\n\nTrump fulfilled his long-standing promise to make all remaining records, a total of 63,400 pages, about JFK's assassination public on Tuesday evening.\n\nExperts sifting through the mountain of files have warned they do not expect ground-breaking revelations to be uncovered.\n\nThe vast majority of the National Archives' collection of over six million pages of records, photographs, motion pictures, sound recordings, and artifacts have previously been released.\n\nJFK was shot to death byLee Harvey Oswald, 24, while traveling in an open-top car parade in Dallas, Texas on November 22, 1963.\n\nOver the years, conspiracy theories have multiplied, implicating various parties including the CIA, the mafia, and even elements of the U.S. government.\n\nHistorian Alice George said more documents investigating John F. Kennedy's assassination might be exposed.\n\n\"I think there may continue to be more record releases,\" George toldReuters.\n\nShe said it's difficult for investigators to analyze cases after so many decades.\n\n\"It's much harder to find the truth when most of the people involved are dead,\" she added.\n\nThe National Archives' website suggests more files might be coming.\n\n\"As the records continue to be digitized, they will be posted to this page,\" the website says.\n\nOn March 18, 2025, Donald Trump's administration released thousands of documents about John F. Kennedy's assassination.\n\nYou can now find the files on the National Archives'website.\n\nMost of the documents are scans of memos and letters, with some being too difficult to read after being kept for so many years.\n\nCzornonoh wrote letters to the Russian Embassy and British Embassy about what he heard.\n\nThe newly released files reveal a man named Sergyj Czornonoh wrote a letter claiming that three months before the assassination, a Russian consul warned him about Lee Harvey Oswald's plans.\n\nOne declassified document revealed that JFK authorized the CIA to launch a secret covert mission called Operation Mongoose, which aimed to overthrow the communist leader Fidel Castro’s Government in Cuba during the Cold War.\n\nJFK's shooting has long been the subject of multiple conspiracies as questions have been raised over the years about the mob's role as well as speculation over the CIA's involvement in JFK's death.\n\nDespite the official conclusion that Lee Harvey Oswald acted alone in shooting the president, numerous questions and conspiracy theories have persisted for over six decades, casting a shadow of mystery over his death.\n\nOne theory about the 1963 assassination was that Lee Harvey Oswald acted on behalf of the Soviets who planned to kill JFK.\n\nBut a now declassified memo filed from the CIA’s St Petersburg station in 1991 says that authorities were \"confident that Oswald was at no time an agent controlled by the KGB.\"\n\nIt added that he was a “poor shot” when he practiced target firing in the Soviet Union.\n\nExperts who believe Oswald had an accomplice or was innocent often focus on the fact that even great shooters face some difficulties firing three shots on a moving target in a small bracket of time.\n\nCops are nowrushing to CIA headquartersin Washington DC after reports of a man with a gun.\n\nA threat was reportedly made just hours after the John F. Kennedy files were released.\n\nCops swarming at the CIA headquarters in Washington DC\n\nA CIA memo released on Tuesday reveals what Lee Harvey Oswald was up to in the weeks before he assassinated President John F. Kennedy.\n\nIn September and October 1963, Oswald called the Soviet Embassy and asked for a visa while he was in Mexico City.\n\nWhile he visited Mexico City, he also went to the Cuban Consulate there and asked for a travel visa, the memo said.\n\nOn October 3, 1963, Oswald drove back into the US through the Mexico-Texas border.\n\nIn a CIA memo from July 1967 released on Tuesday, reports revealed agent Gary Underhill blamed a \"small clique\" for President John F. Kennedy's assassination.\n\nThe memo says the day after JFK was shot, Underhill was \"agitated\" at his friend's house in New Jersey.\n\n\"A small clique within the CIA was responsible for the assassination, he confided, and he was afraid for his life and probably would have to leave the country,” the memo said.\n\nHe reportedly told his friends JFK \"got wind\" of the assassination plans but was killed before he could act on it.\n\nUnderhill was found dead by suicide at his home in Washington DC on May 8, 1964.\n\nJack Schlossberg, the only grandson of John F. Kennedy, shared a post onXsaying his family wasn't told about the release of the files before it was announced to the public.\n\n\"No — The Trump administration did not give anyone in President Kennedy's family 'a heads up' about the release,' Schlossbergwroteon X in all capital letters.\n\nHowever, Schlossberg said Robert F. Kennedy Jr. \"definitely knew.\"\n\nExperts anticipate reviewing the released files will take longer than expected.\n\n“We have a lot of work to do for a long time to come,\" Larry Sabato, director of the University of Virginia Center for Politics, told theAssociated Press.\n\nOne of the unsealed documents revealed that a man called Sergyj Czornonoh claimed to have warned the American vice-consul in Sofia, Bulgaria, about Oswald’s plan to assassinate JFK.\n\nCzornonoh allegedly told a US State Department official that Oswald had a weapon, but claims that authorities shrugged off the warning.\n\nHe wrote in a letter: \"Director told me you too can have a weapon — so what ifOswaldgot a weapon.\"\n\nJFK was shot to death by Lee Harvey Oswald, a former Marine who defected to the Soviet Union before returning home to Texas.\n\nHe was married to a Russian woman and because of his close ties with the Soviets, one theory was that he acted on behalf of KGB who planned to kill JFK.\n\nBut a now declassified memo has addressed this theory.\n\nThe memo, filed from the CIA’s St Petersburg station and addressed to \"Moscow info director\", contains an interview of a US professor who met with the deputy director of KGB Slava Nikonov.\n\nIt stated that Nikonov, who claimed to have checked a \"thick volume of files\" on the case said Oswald was never a part of the KGB.\n\nThe memo reads: \"Nikonov is now confident thatOswaldwas at no time an agent controlled by the KGB.\n\n\"From the description in the files, he doubted anyone could controlOswald, but noted that the KGB watched him closely and constantly while he was in the USSR.\"\n\nIt added that he was a \"poor shot\" when he practised target firing in the Soviet Union.\n\nExperts who believe Oswald had an accomplice or was innocent often focus on the fact that even great shooters face some difficulties firing three shots on a moving target in a small bracket of time.\n\nA detail released in the documents shows a letter sent by a man called Sergyj Czornonoh to the US British Ambassador in 1978.\n\nHe claimed he had warned intelligence services about Lee Harvey Oswald's intentions two months before the assassination.\n\nCzornonohsaid he was given information about Oswald byWasilev Consul, who worked in the Soviet embassy in Bulgaria.\n\nHe claimed Consul's girlfriend \"came into my room\" and repeated that Oswald was an \"assassin\", adding: \"He will kill PresidentKennedy.\"\n\nCzornonoh said he told a State Department official on August 19, 1963, that Oswald had a weapon.\n\nIn his 1978 letter Czornonoh recounted: \"Director told me you too can have a weapon — so what if Oswald got a weapon.\"\n\nOne of the documents shows a memo on a passage from left wing political magazine Ramports from June 1967.\n\nThe passage was about intelligence agent, CIA informant and former US Army Captain John Garrett Underhill Jr.\n\nIt reads: \"he day after the assassination, Gary Underhill left Washington in a hurry.\n\n\"Late in the evening he showed up at the home of a friend in New Jersey He was very agitated.\n\n\"A small clique within the CIA was responsible for the assassination, he confided, and he was afraid for his life and probably would have to leave the country.\n\n\"Less than six months later Underhill was found shot to death in his Washington apartment. The coroner ruled it a suicide.\"\n\nThe passage has been widely shared since the latest document drop, but sleuths say it has been publicly available for decades.\n\nJefferson Morley, vice president of the Mary Ferrell Foundation, a repository for files related to the assassination, the release was an \"encourage start\".\n\nBut Morley said what was released Tuesday did not include two-thirds of the promised files, any of the recently discovered FBI files or 500 Internal Revenue Service records.\n\nHe added: \"Nonetheless, this is the most positive news on the release of JFK files since the 1990s.\"\n\nMorley said much of the \"rampant over-classification of trivial information has been eliminated\" from the documents.\n\nExperts have warned it could take some time to scour through more than 60,000 pages declassified by Trump.\n\nHistorian David J Garrow told theNew York Timesit could take months to get through every page.\n\nMany of the documents have previously been released in partially redacted form, experts say.\n\nTrump told reporters on Monday evening: \"You got a lot of reading. I don't believe we're going to redact anything.\"\n\nNewly-released pages detail how the CIA tapped telephones in Mexico City between December 1962 and January 1963.\n\nCommunications of the Soviets and Cubans at their diplomatic facilities were monitored, which Lee Harvey Oswald visited in the months before JFK was killed.\n\nPages spell out instructions for CIA agents on how to wiretap.\n\nThis included using certain chemicals to create markings on telephone devices that could only be seen by other spies under UV light.\n\nOne file has the heading \"secret\" and is a typed account with handwritten notes of an interview by a Warren Commission researcher in 1964.\n\nThe researcher interviewed CIA employee Lee Wigren about inconsistencies in material provided to the commission by the State Department and CIA about marriages between Soviet women and American men.\n\nLee Harvey Oswald, who authorities determined shot JFK, was born in Louisiana, and he was married to a Soviet woman, Marina Oswald, at the time of the assassination.\n\nA document shared following the release focuses on JFK's assassin, Lee Harvey Oswald.\n\nAuthorities determined Oswald shot the president on November 22, 1963, in Dallas, Texas.\n\nOswald, 24, had positioned himself from a sniper's perch on the sixth floor of the Texas School Book Depository building.\n\nThe file states the KGB had watched Oswald closely while he was in the USSR.\n\nThe KGB paper \"also reflected that Oswald was a poor shot when he tried target firing in the USSR\", the file said.\n\nDespite an early pledge to release all JFK records, Trump delayed full disclosure in 2017, citing concerns over national security.\n\nWhile some documents were released under President Joe Biden, others remained heavily redacted or classified — until now.\n\nLarry Sabato, an expert on Kennedy’s assassination, noted that some of the most sensitive files involve CIA activity, Oswald’s links to Cuba, and Cold War-era intelligence operations.\n\nWith this latest release, investigators hope to finally uncover what has been hidden for decades — but whether any of it changes history is still uncertain.\n\nNewly released Department of Defense documents from 1963 shed light on Cold War tensions, particularly regarding Fidel Castro and his involvement in Latin America.\n\nOne report suggests that while Castro was unlikely to provoke a direct war with the U.S., he \"might intensify his support of subversive forces in Latin America.\"\n\nThe files also touch on the U.S. efforts to counter Cuba’s influence, reflecting the global power struggle between Washington and Havana at the height of the Cold War.\n\nOne lingering question surrounding JFK’s assassination has been what the CIA knew about Lee Harvey Oswald before the killing — and the newly released documents may provide answers.\n\nThe files reference Oswald’s visits to Mexico City just six weeks before Kennedy’s murder, including a trip to the Soviet embassy.\n\nWhile the CIA has denied involvement, Robert F. Kennedy Jr., Trump’s Health and Human Services Secretary, has long claimed that the agency was connected to his uncle’s death — an allegation the CIA has called baseless.\n\nArrest card of Lee Harvey Oswald on November 23, 1963, the day after he assassinated United States President John F. Kennedy",
        "source_3": "The Trump administration Tuesday posted online thousands of previously classified documents related to the 1963 assassination of PresidentKennedy, fulfilling a top promise to let the public see the long-hidden material.\n\nThe National Archives and Records Administration began posting 80,000 pages of material on its website shortly after 7 p.m. None of the material is hidden under redactions.\n\nThe documents include information about Kennedy assassinLee Harvey Oswald’sties to the Soviet Union and at least one letter in which a person claimed to have tried to warn federal agents in July 1963 thatOswaldplanned to assassinateKennedy.\n\nMr. Trump ordered the documents to be fully released in an executive order signed shortly after he took office, calling the continued withholding of the material, “not consistent with the public interest.”\n\nTulsi Gabbard, the director of national intelligence, said additional documents withheld from public access under court seal or grand jury secrecy and those subject to IRS privacy laws “must be unsealed before release,” and the National Archives is working to expedite the unsealing of those records.\n\n“President Trump is ushering in a new era of maximum transparency,” Ms. Gabbard said. “Today, per his direction, previously redacted JFK Assassination Files are being released to the public with no redactions. Promises made, promises kept.”\n\nThe documents are largely an assortment of government memos and correspondence about the investigation into theKennedyassassination in Dallas on Nov. 22, 1963.\n\nOswaldwas arrested as the assassination suspect. The government determined that he fired two lethal shots at the president as his open motorcade passed by a book depository whereOswaldwas employed and in which he had stationed himself with a rifle. A third shot missed the president.\n\nLater, the Warren Commission concluded thatOswaldacted alone, but many Americans believe the president’s murder was part of a larger conspiracy. Although many of the documents related to Kennedy’s assassination have been made public, the withheld material fed conspiracy theories that the government has been hiding something.\n\nParsing through all the documents could take weeks, but the material includes an array of information about those connected toOswaldor who may be concealing ties toOswald.\n\nOne declassified document from the CIA includes information about how the agency works with the Secret Service to protect the president.\n\nAnother is a 1968 CIA memo recommending against the declassification of an Australian investigation into “anonymous telephone calls to the Canberra Embassy before and after the assassination of PresidentKennedy.”\n\nAnother previously secret government memo addresses the theory thatOswald, who had visited the Soviet Union and married a Russian woman, was acting on behalf of the Soviets when he killedKennedy.\n\nThe memo, addressed to “Moscow info director,” outlines a 1991 interview with a U.S. professor who met in Moscow with Slava Nikonov, who had served as deputy director of Soviet Union’s KGB and was the grandson of former Soviet Foreign Minister Vyacheslav Molotov.\n\nAccording to the memo, Nikonov personally reviewed the KGB files to determine whetherOswaldhad acted as a KGB agent when he killedKennedy.\n\n“Nikonov is now confident thatOswaldwas at no time an agent controlled by the KGB,” the memo reported. “From the description in the files, he doubted anyone could controlOswald, but noted that the KGB watched him closely and constantly while he was in the USSR.”\n\nNikonov noted thatOswald“had a stormy relationship with his Soviet wife, who rode him incessantly.”\n\nIn one eyebrow-raising detail, the KGB file reported that Oswald “was a poor shot when he tried target firing in the USSR.”\n\nPeople who believeOswaldhad an accomplice, or perhaps was innocent, often zero in on the difficulty even a good marksman will have getting the rifle in question to fire three shots on a moving target in the required time.\n\nAmong the unsealed documents is correspondence from Sergyj Czornonoh, who claims that in August 1963 he warned the American vice consul in Sofia, Bulgaria, about Oswald’s plan to assassinateKennedy.\n\nCzornonoh said he was given information aboutOswaldby Wasilev Consul, who worked in the Soviet embassy in Bulgaria. He said Consul’s girlfriend “came to my room and repeated that Mr.Lee Harvey Oswaldis [sic] assassin. He will kill PresidentKennedy.”\n\nCzornonoh said he told a U.S. State Department official on Aug. 19, 1963, thatOswaldhad a weapon and to go see him. The officials shrugged off the warning, he claims.\n\n“Director told me you too can have a weapon — so what ifOswaldgot a weapon,” Czornonoh recounted in a letter to the House Select Committee on Assassinations in 1978.\n\nSome of the released documents pre-date the assassination but are related to foreign intrigue, including Kennedy’s most significant foreign policy failure as president.\n\nA 1959 memo recounts a tape-recorded conversation with William D. Pawley, a former U.S. ambassador to Brazil who met with two Cubans in Miami who wanted U.S. support to overthrow the communist regime of Fidel Castro.\n\n“The Cuban said his group needed two things — moral backing and money. He pointed out that Cubans in Cuba are afraid to start an underground movement and there was no way to raise funds, etc.” Pawley is cited as saying.\n\nMr.Kennedy, less than two years later, tried to help anti-Castro Cubans overthrow the government in the failed Bay of Pigs invasion.\n\n• Susan Ferrechio can be reached atsferrechio@washingtontimes.com.\n\nCopyright © 2025 The Washington Times, LLC.Click\n                            here for reprint permission.\n\nPope Leo should tell Catholics: Marry young, have many children\n\nTrump’s TikTok delays undermine his China hawks while Intel controversy grows"
    }
}