{
    "question": "How might removing past National Climate Assessments from government websites for review, alongside releasing a new DOE climate report, affect public trust, transparency, and the use of climate science in policy decisions?",
    "content": {
        "source_1": "Dozens of veteran climate scientists are launching a coordinated response to aTrump administration reportthat casts doubt on the severity of climate change. The report, released last week alongside proposals to deregulate some polluting sectors, was authored by five researcherswell-known for sowing doubtover the impacts Americans are feeling from the climate crisis.\n\nThe scientists, responsible for authoring or contributing research to hundreds of peer-reviewed studies, want to counter what they interpret as the Trump administration’s attempts to wipe credible, widely accepted climate science off the record.\n\nIn addition to the report, which the Department of Energy and Environmental Protection Agency are using as evidence to weaken pollution rules, the administration has removed all congressionally mandated climate assessments from federal websites. Energy Sec. Chris Wright said the administration is changing those previously published assessments before they put them back on the web,CNN reported.\n\nThe scientists are planning to author a public comment on the Energy Department’s report released last week, according to Andy Dessler, director of the Texas Center for Extreme Weather at Texas A&M University, who is organizing the response.\n\n“We want to get all the science into the public record, so that any debate over this will have access to solid science,” Dessler told CNN.\n\nEnergy chief suggests Trump administration is altering previously published climate reports\n\nIn addition to the self-organized efforts by mainstream climate scientists, the National Academy of Sciences announced Thursday it is launching a comprehensive review of climate science findings since 2009 — the year the endangerment finding was issued, which concluded climate pollution was endangering public health and welfare. The fast-track review, which the academy says will be self-funded, is set to be completed by September.\n\n“Decades of climate research and data have yielded expanded understanding of how greenhouse gases affect the climate,” NAS president Marcia McNutt said in astatement. “We are undertaking this fresh examination of the latest climate science in order to provide the most up-to-date assessment to policymakers and the public.”\n\nIn stark contrast to the National Climate Assessments, which take years to research with multiple rounds of peer review, the five-person Trump report took just two months to research and write, with no peer review. Several climate scientists whose research was cited in the Trump report said it misused or misrepresented their work.\n\nDessler said scientists are going through the report “section by section” to address all “the mistakes (and) the things they left out.”\n\n“There are a lot of things in there that fall into both those categories,” he added. “It is not a valid representation of the science of climate change, and we want to make that clear.”\n\nOne federal climate scientist, who requested anonymity because they are not authorized to talk to the media, told CNN the notion that the DOE report is an assessment or comprehensive review of climate science is “nonsensical on its face.” The scientist pointed to the lack of peer review, paucity of the report’s authors and rushed timeframe, among other reasons.\n\n“It’s just garbage,” the scientist said, referring to the reigniting of the “false debate” over whether climate change is caused by humans and threatens lives and livelihoods. “It’s like somebody took all the bullshit from 10 years ago, didn’t refrigerate it and has now regurgitated it.”\n\nKim Cobb, who directs the Institute at Brown University for Environment and Society and is part of the group working to respond to the DOE report, told CNN it’s significant that the Trump administration is deep-sixing the climate assessments at the same time it’s releasing a misleading new report.\n\n“The fact that this administration has buried the gold standard for climate science — the National Climate Assessments — while lifting up a report filled with misrepresentations and half-truths is a grim historical marker,” she said in an email. “It’s giving me flashbacks to 2005, when such false debates raged.”\n\nRapidly spreading brush fire prompts an evacuation order for thousands north of Los Angeles\n\nCobb said she hopes to help “set the record straight” on climate science in their response to the DOE report. She intends to speak at the public hearing on the repeal of the endangerment finding, a 2009 scientific finding that human-caused climate change endangers human health and safety, which has underpinned many of the federal government’s biggest pollution regulations.\n\nWright told CNN he hand-picked the four researchers and one economist who authored the Trump administration report: John Christy and Roy Spencer, both research scientists at the University of Alabama at Huntsville, Steven E. Koonin of Stanford University’s Hoover Institution, Georgia Tech professor emeritus Judith Curry and Canadian economist Ross McKitrick.\n\n“I just made a list of who do I think are the true, honest scientists,” Wright said. “I made a list of about a dozen of them that I thought were very senior and very well respected. I called the top five, and everyone said yes.”\n\nZeke Hausfather is one of the scientists whose work was misrepresented in the DOE report and is the climate research lead at financial services company Stripe. Hausfather also helped author the Fifth National Climate Assessment.\n\nTurbulence is getting worse. Here are the planet’s bumpiest flight routes\n\nHausfather told CNN he “wasn’t that surprised” that his research was included, because it has focused on how climate modeling can be improved.\n\n“The problem with the way both the EPA and DOE report used my findings is they left out the context of how the community has adapted and evolved” on modeling, Hausfather said.\n\nIn arguing for the endangerment finding to be overturned, the Trump EPA highlighted how the direst climate scenarios are getting less likely; therefore, the US government doesn’t need continue to adhere to the endangerment finding — a bit of circular reasoning these scientists are particularly frustrated about.\n\nIt’s as if the Trump administration is saying, “We’re heading towards a slightly less dire future in terms of emissions, so we can roll back existing climate policy,” Hausfather said.\n\nThe worst-case scenarios, like the planet warming to 4 degrees Celsius by the end of the century, are looking less likely precisely because nations are cutting their planet-warming fossil fuel emissions and moving to clean tech like wind, solar, batteries and electric vehicles.\n\n“A 3-degree world by 2100 is going to be a world with huge climate damages,” Hausfather said.\n\nWright called the critiques about the DOE report misusing others’ research an “unfair assessment.”\n\n“I don’t know that particular author, but if some data set is taken from some author and his conclusions are different from the data set, well, that’s the process of science,” Wright said. “It’ll be improved as we get feedback and comments from others, and we’ll continue to elaborate on it.”\n\nDessler, the climate scientist leading the response to the DOE report, said the science community is angry about their work being deleted and twisted to fit the Trump administration’s narratives promoting fossil fuels and downplaying the severity of climate change.\n\n“People are really mad,” Dessler said. “We’ve devoted our lives to doing good science, and bad science is offensive. They’re not raising interesting questions and they’re not identifying things that scientists have overlooked; much of it is already debunked.”",
        "source_2": "Energy Secretary Chris Wright indicated this week that the Trump administration is reviewing and could seek to change pastclimate reports.\n\nWright, in a Tuesday evening appearance on CNN’s “The Source,” was asked why the administration removed past versions of theNational Climate Assessmentfrom government websites.\n\n“Because we’re reviewing them,” he replied, “and we will come out with updated reports on those and with comments on those.”\n\nWhen reached for comment, the Energy Department declined to provide more information on the review efforts. Instead, spokesperson Andrea Woods referred The Hill to remarks from Wright during the same interview.\n\n“I don’t know why they’re taken down,” Wright told host Kaitlan Collins. “They’re easy to find anywhere. If anybody can’t find the National Climate Assessment report, they just got to Google a little better.”\n\nWoodstold CNNthat Wright “was not suggesting he personally would be altering past reports.”\n\nThe 1990 Global Change Research Act requires the federal government to produce a report aboutclimate changeevery four years.\n\nEarlier this year, the administrationscrubbed the websitethat was hosting past iterations of the national climate assessment. President Trump also dismissed the scientists that were working on the next version.\n\nLast month, the Energy Departmentreleased a reportclaiming that “CO2-induced warming might be less damaging economically than commonly believed.”\n\nThere is a scientific consensus that climate change isexacerbating extreme weather.\n\nWright, a former fracking executive, has ahistory of downplaying the effectsof global warming.",
        "source_3": "“The ceaseless repeating from the media, politicians and activists claiming that climate change is making weather more dangerous and severe is just nonsense. That is just NOT true,”postedSecretary of Energy Chris Wright on X August 4.\n\nBravo to Wright. It takes courage to speak the truth, especially when it comes to climate change.\n\nFor decades, Americans have been indoctrinated by the government, academia, influential institutions, Hollywood, the mainstream media, corporate America, and social media into wrongfully believing that climate change is causing more extreme, dangerous weather events.\n\nThink about it, after nearly every wildfire, tornado, hurricane, flood, heat wave, or cold spell over the past 30 years or so, climate alarmists immediately cite climate change as the primary cause. Without evidence, and often in conflict with available data, they’ve endlessly repeated the lie that so-called climate change is bringing deadly and catastrophic weather all over the world, including every square inch of the United States.\n\nFor a long time, the lie has worked. I remember most people in my immediate orbit typically associating extreme weather events with climate change in casual conversations.\n\nBut, over the past few years, I’ve noticed a slight shift. To my welcome surprise, I have heard more skepticism when it comes to climate change/alarmism. From subtle jokes to sighs and eyerolls, I see more people questioning the religious zealotry of climate alarmism.\n\nI can’t help but wonder if the truth has finally won out. Some say that lies take elevators while the truth takes the stairs. Maybe they are right, like Wright.\n\nAs Wright points out, the truth is simple: climate change is not causing more severe or dangerous weather events.\n\nConsider these undisputable facts from my colleagues atClimate at a Glance:\n\n“Objective data show global warming has not caused an increase in the frequency or severity of cold weather events.”\n\n“The U.N. Intergovernmental Panel on Climate Change (IPCC) reports it has ‘low confidence’ climate change is impacting flooding.”\n\n“The number of tornadoes and strong and violent tornadoes, rated EF3 or higher, have been dramatically declining for decades.”\n\n“Existing data show many extreme weather events have declined significantly during the recent period of modest warming, and deaths from extreme weather events have declined dramatically.”\n\n“There has been no increase in the number or intensity of tropical cyclones since at least 1972 as the planet has modestly warmed, and some data suggests tropical cyclone frequency has actually declined over the past century.”\n\n“Research shows that deaths associated with extreme temperatures have declined significantly during the recent period of modest warming.”\n\n“The United States set records in 2017 and 2019 for having its smallest percentage of land area experiencing drought conditions.”\n\n“Recently, the United States went through its longest period in recorded history without a major hurricane strike, also experiencing its fewest total hurricanes in any eight-year period.”\n\n“In recent decades in the United States, data indicate heat waves have been far less frequent and severe than they were in the 1930s.”\n\nAll these statements are supported by data, much of it provided by the United Nations and others with a proclivity towards climate alarmism. In other words, these are not cherry-picked “gotcha” stats. This is the real deal, from the very organizations that would rather keep this information hidden from the public because it undermines the climate industrial complex.\n\nI’ve written previously about the climate industrial complex. At one point, it seemed unstoppable. Today, it seems like it is crumbling before our very eyes.\n\nThe Trump administration has put climate alarmism in its crosshairs. Unlike President Biden, who was an avowed climate alarmist and subsidized the stupid green transition, Trump is a climate realist who advocates for American energy dominance.\n\nOn the campaign trail, Trump decried the Green New Scam and the federal government’s climate change propaganda.\n\nIn a little more than six months, the Trump administration has made great progress in advancing climate realism. His commonsense energy policies will make the grid stable and life more affordable.\n\nFinally, Americans are waking up. Climate change is not an existential crisis. It is a manufactured crisis to give the left more power and control. And if there is one thing we know, it’s that the left never let a crisis go to waste.\n\nAs Rahm Emanuel said during the 2008 economic emergency, a crisis “is an opportunity to do things that you think you could not do before.”\n\nThe perpetual climate change crisis is a total fraud, more fake than a $3 bill. Spread the word near and far!\n\nChris Talgo (ctalgo@heartland.org) is editorial director at The Heartland Institute.\n\nEditor's Note:The mainstream media continues to deflect, gaslight, spin, and lie about President Trump, his administration, and conservatives.\n\nHelp us continue to expose their left-wing bias by reading news you can trust. JoinTownhallVIP and use promo codeFIGHTto get 60% off your membership."
    }
}