{
    "question": "How should the design, disclosure, and repeatability of Mark Rober’s “Wile E. Coyote wall” test inform public interpretation of the safety and sensor choices in modern driver-assistance systems?",
    "content": {
        "source_1": "A YouTuber's homemadeTeslatest looks like something straight out of a children's cartoon.\n\nCrunchLabs founder and former NASA engineer Mark Rober put Tesla's Autopilot through its paces to see if it could detect the same road obstacles as a vehicle that uses LiDAR — a system that Elon Musk has previously called a\"fool's errand.\"\n\nIn thevideo, the Tesla Model Y on Autopilot successfully detected a child mannequin in front of the car, one that appeared with less than a second of braking time, and another standing in front of the vehicle amid bright lights to simulate sunset conditions.\n\nHowever, it failed to avoid hitting the mannequin when obscured by intense fog, heavy rain, and a Wile E. Coyote-style Roadrunner-painted wall.\n\nThe alternative car, a Lexus with LiDAR in its self-driving system, passed every test in Rober's video.\n\nMost cars with self-driving technology use LiDAR to map roadways, other cars, and possible obstructions around the vehicle. LiDAR stands forLight Detection and Rangingand is similar to radio detection and ranging, but uses laser lights invisible to the human eye instead of radio waves.\n\nMusk said in the company's last earnings call in January that \"obviously, humans drive without shooting lasers out of their eyes.\" The Tesla CEO said that humans rely on their eyes and biological neural networks to navigate while driving, and the digital counterpart to that is cameras and digital neural nets, or AI.\n\nThe Tesla CEO said that \"the entire road system was designed for passive optical neural nets.\"\n\n\"Look, we even have a radar in the car and we turned it off,\" Musk said.\n\nRober said the last test, in which he drove the Tesla through the fake road wall at 40 miles per hour, was the \"only one that matters.\"\n\n\"While that looks sort of convincing, the image processing in our brain is advanced enough that we pick up on minor visual inconsistencies, and we wouldn't hit it,\" Rober said about the wall.\n\nTesla did not immediately respond to a request for comment from Business Insider.\n\nWhile the fake-wall test highlighted that Tesla's Autopilot cameras and AI system still have a ways to go in some scenarios, it's also highly unlikely that a human would ever face such an illusion in real life.\n\nThe weather tests, which were closer to reality, also created smoke and rain conditions so dense that a human wouldn't be able to see through it. However, the goal of self-driving systems is to create technology so advanced that it detects potential incidents faster than a human driver, increasing road safety.\n\nIn response to the YouTuber's test, some Tesla fans and others on social media criticized the video and Rober's decision to use Autopilot instead of the more advanced Full-Self-Driving beta software, which is a paid upgrade.\n\nRober responded to some of the criticism by sharing what he described as theraw footageof the test.\n\nMusk has previously said that a Tesla on Autopilot is almost10 times less likely to crashthan the average car, a claim that some experts have said is misleading.",
        "source_2": "Theo Burman is a Newsweek Live News Reporter based in London, U.K. He writes about U.S. politics and international news, with a focus on infrastructure and technology. He has covered technological and cultural issues extensively in the U.S. and the U.K., such as the rise of Elon Musk and other tech figures within the conservative movement, and the development of high-profile international construction projects. Theo joined Newsweek in 2024 and has previously written for Dexerto, PinkNews, and News UK. He is a graduate of Durham University and News Associates. You can get in touch with Theo by emailingt.burman@newsweek.com. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nThe automatic driving featuresof aTeslacar have been put to the test with a fake \"Wile E. Coyote wall\" by an engineering YouTuber, and it didn't go as Tesla CEO Elon Musk might have hoped.\n\nMark Rober, who has over 65 million subscribers on YouTube, tested the vehicle's autonomous cameras by driving at a screen with an exact replica of the road behind it, in the style of a Looney Tunes sketch. The car was unable to detect the wall, crashing directly through it.\n\nTesla has been supplying \"Autopilot\" as a feature on its vehicles since 2015, with a number of technologies that have been expanded and refined over the last seven years.\n\nThe basic Autopilot software enables certain driving functions to be executed by Tesla software in place of the driver, though Tesla says that the features require active driver supervision and do not make the car autonomous.\n\nIn a new YouTube videopublished on March 15, Rober tested the capabilities of the cameras that guide Tesla's Autopilot features in a variety of ways, including concealing a pedestrian in fine water vapor mist.\n\nThe \"cartoon physics test\" pitted Tesla's camera technology against another Autopilot feature that uses LIDAR, a laser technology that determines how far physical objects are from the vehicle rather than relying on visuals.Newsweekwas unable to independently verify the test's validity.\n\nThis meant that the Tesla failed three out of the five tests when compared to the car using LIDAR, which resulted in the Tesla crashing into a giant wall covered with the exact image of the road behind it because it was unable to tell the image was not a physical object.\n\nNewsweekwas unable to independently verify the tests, and has contacted Rober via his company Crunchlabs for comment, via email.\n\nTesla has faced increasing scrutiny from audiences in recent months followingMusk's involvement in the Trump administration at the head of the advisory Department of Government Efficiency (DOGE).\n\nTesla vehicles have become a target for vandalism from protesters opposed to Musk's political moves. On January 29,ColoradoPolice arrested a woman for causing around $20,000 in damage to a Tesla dealership, while also spray-painting \"Nazi\" under the dealership's entrance sign.\n\nLater on March 3, a large protest gathered outside a Maryland Tesla site, with anti-Musk graffiti also appearing on the building. His critics have associated him with Nazi imagery since his gesture during Trump's inauguration,which resembled a Nazi, or \"Roman\" salute.\n\nIn his video, Mark Rober said: \"I can definitively say for the first time in the history of the world, Tesla's optical camera system would absolutely smash through a fake wall without even a slight tap on the brakes. Turns out my Tesla is more Wile E Coyote and less Roadrunner.\"\n\nTesla stock appears to be continuing to decline, through a combination of stock market insecurity and changing attitudes to Elon Musk.\n\nDo you have a story we should be covering? Do you have any questions about this article? ContactLiveNews@newsweek.com.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nTheo Burman is a Newsweek Live News Reporter based in London, U.K. He writes about U.S. politics and international news, with a focus on infrastructure and technology. He has covered technological and cultural issues extensively in the U.S. and the U.K., such as the rise of Elon Musk and other tech figures within the conservative movement, and the development of high-profile international construction projects. Theo joined Newsweek in 2024 and has previously written for Dexerto, PinkNews, and News UK. He is a graduate of Durham University and News Associates. You can get in touch with Theo by emailingt.burman@newsweek.com. Languages: English.\n\nTheo Burman is a Newsweek Live News Reporter based in London, U.K. He writes about U.S. politics and international news, with a focus on infrastructure and technology. He has covered technological and cultural issues extensively in the U.S. and the U.K., such as the rise of Elon Musk and other tech figures within the conservative movement, and the development of high-profile international construction projects. Theo joined Newsweek in 2024 and has previously written for Dexerto, PinkNews, and News UK. He is a graduate of Durham University and News Associates. You can get in touch with Theo by emailingt.burman@newsweek.com. Languages: English.\n\nTheo Burman is a Newsweek Live News Reporter based in London, U.K. He writes about U.S. politics and international news,                                    ...Read more",
        "source_3": "YouTuber Mark Rober is facing backlash over a recent video that depicted a spectacular “crash test” of Tesla’s Autopilot feature — with critics claiming it was a hoax orchestrated to hurt Elon Musk’s automaker.\n\nIn avideo posted to his YouTube channelover the weekend, Rober’s Tesla Model Y seemingly failed to detect a Wile E. Coyote-style wall painted to look like a road – crashing through and demolishing a mannequin designed to look like a child.\n\nBut a LiDAR-equipped vehicle featured in the same video appeared to pass the test with flying colors. Rober praised LiDAR tech company Luminar so often throughout the segment that viewers questioned whether the footage was tampered with as part of an elaborate advertisement.\n\n“Tesla needs to pull the data from the car itself and show us exactly what happened,” one user wrote ina post on X.\n\n“I know what the data will show, that this was a huge case of fraud. But I doubt Mark wants us to see all that,” the user continued, adding that Musk and Tesla “should sue the pants off this guy.”\n\nRepresentatives for Rober’s company did not immediately respond to a request for comment.\n\nIn the video, Rober said he was aiming the Tesla at the wall on Autopilot going 40 miles per hour “to see if Tesla’s Autopilot can be tricked because it famously only relies on simple cameras to navigate the world as opposed to much more expensive tech.”\n\nThroughout the test, theformer NASA engineer and Apple product designerpraised “fancy cars that use more advanced technology,” like vehicles powered by Luminar’s vision-based LiDAR technology. The video also included Luminar employees and merchandise.\n\nFueling theories that the video was secretly sponsored, Luminar highlighted the video on its corporate website – later deleting it when backlash unfolded,according to Drive Tesla Canada, a news site about Musk’s automaker.\n\n“Thanks to Luminar for allowing us to test their LiDAR-equipped car,” Rober said in the caption under the YouTube video. “They provided the vehicle for testing purposes, but no compensation was given, and this is not a paid promotion.”\n\nCritics also took issue with the title of the video: “Can you fool a self-driving car?” Rober claimed he engaged Tesla’s Autopilot feature, which is technically a driver-assistance feature – meaning the driver should pay attention and be ready to take over – not a self-driving mode.\n\nSocial media users also tried to poke holes in Rober’s supposed use of the Autopilot feature.\n\nSome argued the feature did not appear to be engaged at the time of the crash, since images of the central display do not show the telltale blue lines and rainbow road that indicate Autopilot is on.\n\nRober responded by posting “raw footage” from the crash to dispel rumors, writingin a post on Xthat he’s unsure “why it disengages 17 frames before hitting the wall but my feet weren’t touching the brake or gas.”\n\nBut the raw footage stoked even more scrutiny from Tesla fanatics who pointed out that the original footage showed Autopilot engaged at 39 miles per hour – and the new clip showed the system activated at 42 miles per hour, indicating there were multiple takes of the test.\n\nSocial media users speculated that the video was set up to further damage Tesla’s image as Musk’s close ties to the White House through the Department of Government Efficiency spook investors.\n\nViewers also took note of inconsistencies with a Google Pixel smartphone used throughout the test.\n\nRober supposedly uses the phone to film some of the footage inside the cars. But social media users questioned why the “G” logo on the back of the phone remains vertical even when the gadget is horizontal.\n\nThe bizarre detail led to speculation that Rober used an iPhone or other smartphone and simply photoshopped the “G” on top. The reason for this is unclear, since there’s no mention of Google as a sponsor in the video or caption.\n\nThe carmaker has facedprotests and vandals at dealershipsacross the country and suffered a hit to its stock, which has slumped about 40% so far this year."
    }
}