{
    "question": "What are the legal and practical implications of Judge James Boasberg’s temporary orders halting deportations of alleged Tren de Aragua members under the Alien Enemies Act, particularly for flights that were already in the air when the orders were issued?",
    "content": {
        "source_1": "The question of what happens if the Trump administration openly defies a federal court order hashung over the United States sincePresident Donald Trump’s second term began. If that happens, it willtrigger a constitutional crisis. Now, that long-awaited crisis may be upon us.\n\nOn Saturday, Trump issued aproclamationclaiming the authority to deport Venezuelan nationals that, he claims, are members of a criminal gang known asTren de Aragua. Trump alleges that these foreign nationals may be swiftly removed under the Alien Enemies Act of 1798, a law that hasonly been invoked three times in American history— the last time in World War II.\n\nGet the latest developments on the US Supreme Court from senior correspondent Ian Millhiser.\n\nTrump’s claim is highly dubious. TheAlien Enemies Actpermits the president to order the removal of all citizens of a foreign nation when there is a “declared war” with that nation, or when “invasion or predatory incursion is perpetrated, attempted, or threatened against the territory of the United States by any foreign nation or government.”\n\nThe United States is not at war with Venezuela. Nor has the Venezuelan government invaded or even threatened to invade the United States.\n\nNot long after Trump issued his proclamation, on the same Saturday evening, federal Judge James Boasberg issued two orders that temporarily halted it. The first is atemporary restraining orderseeking to prevent any deportations from taking place under Trump’s proclamation until Boasberg has time to hold a full hearing and determine how to proceed in this case.\n\nThe second order certifies this case, known asJ.G.G. v. Trump, as a class action lawsuit concerning “all noncitizens in U.S. custody” who are subject to Trump’s Saturday proclamation. That order forbids the government from “removing members of such class (not otherwise subject to removal) pursuant to the Proclamation for 14 days or until further Order of the Court.”\n\nWhich brings us to the potential constitutional crisis. At a Saturday hearing on this case, lawyers for the plaintiffs told Boasberg that two planes containing Venezuelans who were deported under the proclamation were “in the air.” During that hearing, Boasberg ordered that “those people need to be returned to the United States.” He also acknowledged, however, that once the planes land and their occupants deplane, he no longer has jurisdiction to order their return.\n\nIn adocument filed Monday morning, the plaintiffs’ attorneys cite publicly available flight data as well as news reports, which suggest that the Trump administration allowed these planes to land and discharge their passengers after Boasberg issued his order. If that is true, then the Trump administration defied the order and can potentially be held in contempt of court.\n\nMeanwhile, in a second case known asChehab v. Noem, the federal government may have removed Dr. Rasha Alawieh, a Lebanese national and professor at Brown University’s medical school, in violation of a court order requiring the government to give the court 48 hours notice before she is removed. The facts in this case are rapidly evolving, however, and two of her lawyers recently withdrew from the case.\n\nThe Justice Department, for what it is worth, claims that Alawieh was deported after federal authorities found “sympathetic photos and videos”regarding the terrorist organization Hezbollahon her phone.\n\nThere is also some uncertainty about the timing of the flights in each of the cases. In the case of the Venezuelan deportations, the document plaintiffs filed Monday primarily asks Boasberg to seek clarification from the government about whether these flights landed and discharged their passengers after the judge’s order. It’s also possible that these passengers were deported pursuant to some authority other than the Saturday proclamation, in which case Boasberg’s order would not apply to them.\n\nYet, even if it turns out that no one was deported illegally, the government still must comply with court orders against it, including temporary orders issued while a judge was trying to determine if the government acted illegally.\n\nThe Trump administrationclaims that Boasberg exceeded his authoritywhen he issued his orders, and it points to the alleged Hezbollah connection to justify its actions in Dr. Alawieh’s case. It’s far from clear, however, whether the ultimate merits of either case are relevant at this very early stage of this litigation. If a litigant disagrees with a temporary restraining order, the proper course of action is typically to wait until the judge holds a full hearing on the case and to argue that the order should not be extended. If the judge disagrees,that decision can be appealed to a higher court.\n\nBut a litigant cannot simply defy a court order because they think it is wrong.\n\nIndeed, under normal circumstances, a party that defies a court order can be held in contempt of court and be subject to fines, imprisonment, or other sanctions. But it’s far from clear whether such a contempt order could be enforced if Trump is determined to give the middle finger to the judiciary.\n\nAs Alexander Hamilton wrote in the Federalist Papers, the courts “may truly be said to have neither FORCE nor WILL, but merely judgment; andmust ultimately depend upon the aid of the executive arm even for the efficacy of its judgments.” Federal court orders, including contempt of court orders, are enforced by the US Marshals Service, alaw enforcement agency housed in the executive branch of government. So Trump could potentially order the Marshals to not enforce any court order against his administration.\n\nIf that happens, there are few legal mechanisms remaining to make Trump obey the law. The obvious remedy for a president who commits serious legal violations and refuses to comply with court orders against him isimpeachment. But, even if a Republican US House would agree to impeach Trump — a highly unlikely proposition — it takes 67 votes in the Senate to remove a president. And the Senatecouldn’t even find 67 votes to declare Trump ineligible for the presidencyafter he incited a mob to attack the US Capitol in 2021.\n\nFor now, at least, theJ.G.G.case appears to be moving very quickly. And it remains to be seen whether the Trump administration can plausibly argue that its behavior is legal. If it turns out that the administration is determined to violate court orders it does not like, however, then it is likely that the legal system has run out of tools to check Donald Trump.\n\nCorrection, April 23, 4:30 pm:This story originally misstated the year of the January 6 Capitol attack; it was in 2021.\n\nUnderstand the world with a daily explainer, plus the most compelling stories of the day.",
        "source_2": "Luis Alberto Castillo tried to do it the right way. According to anaffidavitfiled by the U.S. Department of Homeland Security, Castillo, a 29-year-old Venezuelan citizen who had been living in Colombia, arrived at the Paso del Norte Port of Entry in El Paso, Texas, on Jan. 19. He had made an appointment to apply for asylum on CBP One, an official U.S. government app, Castillo’s ownaffidavitsaid.\n\nBoth U.S. and international law enshrine a right to asylum. But Castillo ran into two hitches. The first was that, asreportedby theNew York Times, the border agent thought a tattoo on his neck looked suspicious and ordered him temporarily detained. The second was that this happened the day before Donald Trump was inaugurated for his second term as U.S. president—and quicklysuspendedaccess to asylum.\n\nLuis Alberto Castillo tried to do it the right way. According to anaffidavitfiled by the U.S. Department of Homeland Security, Castillo, a 29-year-old Venezuelan citizen who had been living in Colombia, arrived at the Paso del Norte Port of Entry in El Paso, Texas, on Jan. 19. He had made an appointment to apply for asylum on CBP One, an official U.S. government app, Castillo’s ownaffidavitsaid.\n\nBoth U.S. and international law enshrine a right to asylum. But Castillo ran into two hitches. The first was that, asreportedby theNew York Times, the border agent thought a tattoo on his neck looked suspicious and ordered him temporarily detained. The second was that this happened the day before Donald Trump was inaugurated for his second term as U.S. president—and quicklysuspendedaccess to asylum.\n\nCastillo spent two weeks in custody in El Paso. ATimesinvestigation would later find that he had no criminal convictions in Colombia; his family told the newspaper’s reporters that his neck tattoo was a tribute to Michael Jordan. Nonetheless, Castillo found himself shackled and loaded onto a military cargo plane with several other migrants born in Venezuela. Their destination: the prison camp at Guantánamo Bay.\n\nTrump’s signature election promise was to carry out what he calls a “mass deportation” of as many as20 million people—a plan that will by its nature almost certainly run afoul ofinternational law. Collective expulsions violate a host of protections, including the right to individual assessment of risks and bans against forcing individuals to go back to countries where they face grave human rights abuses.\n\nOn the campaign trail, Trump advisor Stephen Miller outlined what these expulsions would look like: roundups of immigrants by the military and federal law enforcement officers, mass detentions, and deportations of immigrant families with U.S. citizen children.\n\nMiller is now Trump’s deputy chief of staff for policy, and some of those plans are taking shape. Trump officials have indicated that some federal personnel, includingInternal Revenue Serviceworkers and staff ofU.S. Citizenship and Immigration Services, have been reassigned from their jobs or asked to volunteer to bolster immigration investigations. Trump has also issued executive orders challengingbirthright citizenship—a right enshrined in the plain text of the 14th Amendment—andallowingimmigration-related arrests inside hospitals, schools, and places of worship, which were long considered places of sanctuary.\n\nIn recent days, the Trump administration hasignoredcourt orders to halt deportation flights under the Alien Enemies Act of 1798, an archaic authority meant to be used only in wartime. The White House also rebuffed a court order thatblocked the expulsionof a Brown University medical professor. The president himself has announced his intention to “find, apprehend, and deport” more pro-Palestine student protesters in the wake of thedetentionsof two Columbia students and the “self-deportation” of a third. The administration has, without evidence, claimed that bothVenezuelanand pro-Palestiniandetainees are linked to terrorism.\n\nBut the full machinery to conduct mass deportations is not yet in place. On Feb. 12, the Department of Homeland Securityissued a requestfor “immediate assistance” from the Pentagon for the “detention and secure transfer of aliens within the Continental United States,” including the use of El Paso’s Fort Bliss as a staging ground for 10,000 immigrants. This month, theGuardianreportedthat the base is also “being considered for large-scale detention.”\n\nDozens of other installations could follow suit, including New Jersey’s Joint Base McGuire-Dix-Lakehurst; Hill Air Force Base near Salt Lake City; Homestead Air Reserve Base outside Miami; and Kirtland Air Force Base in Albuquerque, the government memo said.\n\nAs the Trump administrationbuilds its deportation machine at home, it is also making use of alliances and client states to do so throughout the Americas—fruits ofthe same imperial interventionsthat helped trigger the last century of northward migrations. In addition to Guantánamo Bay, these facilities range from hotels in thePanamanian jungletoairstrips in Honduras.\n\nOne of the most troubling partnerships is with El Salvador, whose president, Nayib Bukele, calls himself the “world’s coolest dictator.” In 2022, Bukeledeclareda “state of exception” in his country, allowing the military and police to arrest people on suspicion of gang affiliation—including allegedly suspicious tattoos—without due process. El Salvador quickly achieved thehighest incarceration ratein the world.\n\nOn a visit to El Salvador’s capital last month, U.S. Secretary of State Marco Rubio told reporters that Bukele hasofferedto house in his prisons immigrants deported from the United States and “dangerous American criminals in custody in our country, including those of U.S. citizenship and legal residents.”\n\nMany are expected to be stuffed into Bukele’s newTerrorism Confinement Center, a prison built to hold 40,000 people. Inmates there are shaved, stripped naked, and given just a pair of thin white boxer shorts to wear. Aninvestigationby the Salvadoran human rights organization Cristosal found that in the prison’s first year, “dozens of inmates died as a result of torture, beatings, mechanical suffocation via strangulation or wounds or were left to die because of lack of medical attention,” according toEl País.\n\nTies between Trump’s circle and Bukele run deep. Donald Trump Jr. and his then-partner, former Fox News host Kimberly Guilfoyle,attendedBukele’s second,unconstitutionalinauguration last June. Former Florida Rep. Matt Gaetz was there, too, along with former Fox News host Tucker Carlson. “We have the whole team here. We are now in El Salvador. … We are here just promoting those who support freedom around the world,” Donald Trump Jr.saidin a video he posted to TikTok.\n\nA few months later, Elon Musk hosted the Salvadoran dictator in Texas to discuss “the future of humanity.” Their relationship blossomed on Musk’s social media hub, X, with the tech moguldeclaringin January that Bukele’s “state of exception” model “needs to happen and will happen in America.”\n\nLast month, as federal judges tried to put limits on Musk’s purge of the federal government, the billionaire retweeted a statement from Bukele: “If you don’t impeach the corrupt judges, you CANNOT fix the country.” Muskrepliedin a quote tweet: “Unfortunately, as President Bukele eloquently articulates, there is no other option. We must impeach to save democracy.”\n\nThe constitutional violations inherent in all of this—imprisoning people who haven’t even been accused of a crime, deporting U.S. citizens to serve sentences in foreign prisons—are too many to detail. TheFourth,Fifth,Sixth,Eighth, and the equal protection and due process clauses of the 14th Amendment of the U.S. Constitution spring to mind.\n\nAsylum applications in Mexico are up, and northbound crossings in Panama are down.\n\nThe economic costs of such a campaign may be bigger than the president-elect has bargained for.\n\nBut the Trump administration has already shown a willingness to blow through legal and social red lines, as vividly illustrated by its use of Guantánamo, for the first time, to detain people deported from U.S. territory.\n\nThe naval station has long been a symbol of American exception. U.S. Marines, with Cuban help, seized Guantánamo while intervening in the island’s 1898 independence war against Spain; Washington extorted a lease after the conflict in exchange for withdrawing troops from the rest of the island. The land has remained in U.S. hands ever since, even as Fidel Castro’s guerrillas overthrew Cuba’s U.S.-backed dictator in 1959. That strange arrangement—a U.S. base on hostile territory—created a legal gray area where presidents have argued that neither U.S. nor Cuban law applies.\n\nThe Clinton administration used Guantánamo to temporarily house tens of thousands of mainly Cuban and Haitian migrants interdicted at sea in the 1990s. In 2002, the Bush administration began using the base to indefinitely house detainees captured on the battlefields of Afghanistan and Pakistan, pledging to the American people that the prisoners held on the island would be the “worst of the worst.” This was always false: The Bush-era detainees were mainly what the Defense Department admitted were “low-value” enemy combatants; only seven of the 780 prisoners were ever convicted of terror-related offenses, most in pre-trial settlements.\n\nThe Trump administration has seized on past injustices and made them worse. As immigrant-rights advocates and lawyers for the American Civil Liberties Union said in afederal lawsuitfiled this month: “Never before has the federal government moved noncitizens apprehended and detained in the United States on civil immigration charges to Guantánamo. Nor is there any legitimate reason to do so now.”\n\nAs they were flying Castillo, the Venezuelan migrant, and other men to Cuba, the Trump administration again slapped on the Bush-era label, calling them—without evidence—the “worst of the worst.” Lawyers for the men said the government denied the detainees access to their attorneys and kept them in the dark about their location.\n\n“Each of us are in a small cell with a thin mattress,” Castillo said in his federal affidavit. “We only get one hour a day outside of the cell. That is the only time we can see the sun, and even then, we are in a small cage in the yard. We are searched every time we use the bathroom. The food is not enough and not edible. I do not understand why we are being treated this way.”\n\nThe migrants held afive-day hunger strike. At least one told NPR that he tried to commit suicide. Their families were told nothing. U.S. Immigration and Customs Enforcement’s online “detainee locator” falsely claimed at least some of the men were being held in a small field office in the evocatively named locale of Plantation, Florida.\n\nIt was not until Castillo’s family recognized him in an official photo released by the Trump administration—a shot of him being ushered, head bowed, by a masked and gloved soldier; a smidge of tattoo sticking over the collar of his sweatshirt—that Castillo got representation and learned where he was being held. Organizations led by the Las Americas Immigrant Advocacy Center quicklyfiled suitagainst the departments of homeland security, state, and defense on behalf of Castillo and two other inmates, seeking a court order to allow attorneys to access them and other future detainees at the base in eastern Cuba.\n\nThen, on Feb. 20, without warning, the Trump administration cleared the camp, sending all but one of the inmates to an airstrip in Honduras, where they were to be transferred to another plane taking them to Venezuela. Three days later, another planeload of migrantsarrivedat Guantánamo Bay. This second cohort wastransferredto U.S. facilities shortly thereafter.\n\nMeanwhile, over the weekend, the first planeloads of Venezuelan deportees were flown from the United States to El Salvadorunder the 1798 act. The flights were carried out in apparent defiance of an order to halt the flight by U.S. District Judge James Boasberg, whoarguedthat the act “cannot be used here against nationals of a country—Venezuela—with whom the United States is not at war.” Heordered“any plane containing these folks … to be returned to the United States.”\n\nWhite House press secretary Karoline Leavitt said the judge’s order was issued after the flights had already left U.S. territory and thus had “no lawful basis.” But Boasberg had said that his order also applied to flights that were already “in the air.”\n\n“Oopsie… Too late,” Bukeletweeted, punctuating his post with a laugh-cry emoji. It wasretweetedby Rubio.\n\nThis post is part of FP’s ongoing coverage of the Trump administration.Follow alonghere.\n\nJonathan M. Katzis a journalist. He is the author ofThe Big Truck That Went By: How the World Came to Save Haiti and Left Behind a DisasterandGangsters of Capitalism: Smedley Butler, the Marines, and the Making and Breaking of America’s Empire. His newsletter,The Racket, can be found at https://theracket.news/.\n\nCommenting is a benefit of aForeign Policysubscription.\n\nJoin the conversation on this and other recentForeign Policyarticles when you subscribe now.\n\nPlease follow ourcomment guidelines, stay on topic, and be civil, courteous, and respectful of others’ beliefs.\n\nI agree to abide by FP’scomment guidelines. (Required)\n\nThe default username below has been generated using the first name and last initial on your FP subscriber account. Usernames may be updated at any time and must not contain inappropriate or offensive language.\n\nI agree to abide by FP’scomment guidelines. (Required)\n\nAsylum applications in Mexico are up, and northbound crossings in Panama are down.\n\nThe economic costs of such a campaign may be bigger than the president-elect has bargained for.",
        "source_3": "Elon Musk is way out of his lane in cheering a bid to impeach federal Judge James Boasberg, who’s put atemporary hold on deportation flights of illegal migrant gangbangers.\n\nWe like theideaof the flights: The brutes of Tren de Aragua and MS-13 have had it too easy for far too long, and current efforts to get tough are a necessary correction to Biden-era denial.\n\nPresident Trump’s executive orders declaring multiple gangs to be terrorist outfits are rooted in the gangs’ tactics and goals: They’re utterly vicious in their attempts to take turf inside our country, from Long Island to Colorado and beyond.\n\nSimply deporting them hasn’t proved enough — multiple members have slipped back in multiple times, and while Trump has stopped themassillegal border-jumping of the Biden years, the gangs have the resources and sophistication to keep getting their people through.\n\nAnd, once here, they can not only hide among the 10 million illegal migrants admitted these last four years; they’re shielded by the left’s “sanctuary” laws and immigration advocacy networks.\n\nBut the rule of law must hold: As legal authority for its actions,Team Trump is citing the 18th-century Alien Enemies Act, a law written to cover wartime situations that in the past has only been invoked during wars declared by Congress.\n\nThe “war” here is simply Trump’s presidential declaration that TdA is invading the country; challenging that in court is perfectly kosher, as is the judge ordering a pause on new flights until he can hear arguments in the case.\n\nNote that the administration didnotdefy Boasberg by letting the first two flights land in Honduras and El Salvador: While the judge made comments in court about calling the planes back, his final written order left that out.\n\nAnd however Boasberg ultimately rules, the case seems destined to go all the way to the Supreme Court. Can the feds simply declareanyonea TdA member before putting them on a plane off to an El Salvadoran prison?\n\nWhich makes it just plain silly forMusk to tweet “necessary” of a Texas rep’s plan to file to impeachthe judge: It’s nothing of the kind, and cheering it only makes Musk look reckless — a reputation he doesn’t need when many DOGE actions also face court challenge.\n\nLook: The Biden crew took years to get the nation fully into this mess (and built on Obama-era and earlier mistakes, too); the Trump team can’t possibly fix everything overnight.\n\nThe country needs the courts to sort out a host of legal questions about everything from what advocates insist are illegal migrants’ rights to local obligations to cooperate with federal law enforcement.\n\nTrump stopped the bleeding at the border in his first weeks in office; undoingallthe Biden-era damage will take a lot longer.\n\nAnd doing it with full regard for the rule of law trulyisnecessary."
    }
}