{
    "question": "What steps should communities and authorities prioritize—both immediately and over the long term—to support recovery and strengthen resilience after the multi-state storms and tornadoes that left at least 42 people dead?",
    "content": {
        "source_1": "The National Guard is being deployed as residents across the U.S. began to assess the fallout from dozens oftornadoes, wildfires, and dust storms that left at least 42 people deadand hundreds of decimated buildings in their wake over the weekend.\n\nField crews from weather service offices across the central and eastern U.S. began surveying the damage Sunday after deaths were reported in Kansas, Mississippi, Arkansas, Texas, Alabama, Missouri, and Oklahoma, where almost300 houses and structures were destroyed by wildfires. As clean-up begins for some, parts of the Central and Southern High Plainswill be at risk for extreme or critical fire weather Monday,the National Weather Service said.\n\nNationwide, there were over 130,000 power outages Monday morning, according toUSA TODAY's outage tracker,including over 25,000 outages in Missouri, where at least a dozen people were killed and anEF-3 tornadowith peak winds of 140 mph was reported Saturday.\n\nPresidentDonald Trumpsaid in a statement that his office was monitoring the deadly bout of severe weather that struck the region and deploying the National Guard to Arkansas, where three people died. Dozens more were injured after an EF-3 tornado with 165 mph winds ripped through Cave City on Friday.\n\n\"My administration is ready to assist state and local officials, as they help their communities to try and recover from the damage,\" Trump said. \"Please join Melania and me in praying for everyone impacted by these terrible storms!”\n\nMissouri saw the highest initial death toll as state officials confirmed adozen people were killed. In Kansas,eight people died when high windsand a dust storm caused a massive collision on Interstate 70 involving at least 71 vehicles, said Kansas Highway Patrol Trooper Tod Hileman.\n\nMississippi Gov. Tate Reeves announced that six people died and at least 27 people were injured statewide during a news conference Sunday. Three people who had been reported missing on Saturday have also since been found alive, according to Reeves. Hundreds more were displaced by the storms.\n\nThe chief medical examiner's office in Oklahoma confirmed four fatalities occurred as a result of the fires or high winds.KFOR-TVreported that a father was killed and his son was severely burned on Friday.\n\nAnother four deaths were reported in two Texas counties after blowing dirt and wildfire smoke caused multiple car crashes Friday, Texas Department of Public Safety spokesperson Cindy Barkley told USA TODAY. Nearly 40 vehicles were involved in another crash in Randall County, Barkley said, though no life-threatening injuries were reported. \"We had so many crashes that day, I can't even keep up,\" she said.\n\nThree people also died in Independence County, Arkansas, according to the state division of emergency management and 32 people were injured across eight counties. At least three people were killed in central Alabama and damage was reported in 52 of the state's 67 counties, Gov. Kay Iveyconfirmed.\n\nSevere weather also caused a tree to fall on a trailer in Brevard, North Carolina, killing two boys, ages 11 and 13,fire officials saidSunday.A tornado watchissued across a large swath of North Carolina and Virginia expired early Monday morning, though the National Weather Service in Wilmington reported thechance of showers and stormswould continue.\n\nThe storm brought 60 to 70 mph winds to Oklahoma on Friday and the sustained gusts knocked down power lines, ripped off shingles from houses, broke tree limbs, felled street signs, caused road closures and filled the sky with dust. More than 130 fires were reported in 44 counties, the Oklahoma Department of Emergency Management said Friday night.\n\nOklahoma Gov. Kevin Stitt said about 170,000 acres in Oklahoma burned and promised a \"post-mortem look\" on the causes of the wildfires beyond the high winds and low humidity. \"We think some of the power lines contributed to this,\" he said.\n\nThe National Weather Service issued aFire Weather Watchfrom 11 a.m. to 10 p.m. Monday in several areas as southwest winds withgusts up to 35 to 45 mph are expected to hitmuch of central and southwest Oklahoma and meteorologists forecast conditions to be worse on Tuesday, posing higher risks for fires.\n\nThe fires in Oklahoma destroyed hundreds of homes, including Stitt's farmhouse north of Luther. When Jeremy Cook returned to his neighborhood in Stillwater on Saturday morning, he found his home burned to the foundation.\n\nHe and his children left for safety Friday, loading up three cars full of wedding photos, pets, personal books, and family paintings. Cook saidhe had prepared as best he could, mowing and cutting any dead trees on his property, \"but when that wind shifted, and that fire started coming, well my brick house burned down.\"\n\nCook said he’s had college friends drop everything to help, strangers dropping off food and water, and fellow churchgoers bringing clothes.\n\n“It doesn't get better than Oklahomans; It really doesn't. They’re always there and there is nobody better than Okies,” Cook toldThe Oklahoman,which part of the USA TODAY Network.\n\nMeanwhile in Mississippi, Tyrene Power and her familyfound themselves buried under rubble after a tornado struck their home.\n\nPower told theMississippi Clarion Ledger,also part of the USA TODAY Network, that sheet rock fell on her, which probably protected her from flying glass, but she doesn't remember much of the event including the roof being torn off. Power wasn't injured, but said a friend who was staying with her had to be taken to the hospital.\n\nWhat Power endured on Saturday was so disorienting, she said she didn't know what day it was. She did know that the tornado that struck her home came sometime the previous afternoon. She said she knew the weather was bad, but didn't recognize anything that indicated a tornado.\n\n\"You know, they say you hear a train,\" Power said as she sat in a vehicle Sunday morning to stay warm outside of the remains of her destroyed home. \"We heard no train. It was just the wind and then it was there.\"\n\nRed flag warningswill also go into effect Monday in parts of Oklahoma, Texas, Colorado, Wyoming, South Dakota, Iowa, Nebraska, Missouri, Illinois, Arkansas, Kansas, New Mexico and Florida as high winds and low humidity raise the risk of wildfires, the National Weather Service said. Extremely critical fire weather conditions are also expected on Tuesday across southeast New Mexico, northwest Texas and the Texas Panhandle, an area home to more than 1.2 million people, the National Weather Servicewarned.\n\n\"A Red Flag Warning means that extreme fire weather conditions are either occurring now, or will shortly. A combination of strong winds, low relative humidity, and dry vegetation can contribute to extreme fire behavior,\" the weather service in Fort Worth, Texas said. \"Avoid all outside burning and welding today. Do not toss lit cigarette butts outside.\"\n\nAdditionally, the weather service said a front is expected to bring rain from the Northeast to the southern mid-Atlantic Coast by Monday evening, and the Northeast by Tuesday evening.\n\nLight snow is also expected to fall over the Lower Great Lakes and Central Appalachians through late Monday afternoon, with light snow also developing over parts of northern New England from Monday evening into Tuesday morning.\n\nLight to moderate snow is also expected to develop over parts of the Northern Rockies, Northern Plains, and Upper Mississippi Valley on Monday before moving into the North and Central High Plains by Tuesday evening, the weather service said.\n\nThunderstorms brought rain and the threat of strong gusts, hail, and a brief tornado to Floridaover the weekend, according to theNational Weather Service in Melbourne.\n\nThe severe weather caused a temporary ground stop at Orland International Airport on Sunday, Federal Aviation Administration spokesperson Chris Mulloolytold USA TODAY. More than 120 flights into or out of Orlando International Airport were also canceled and hundreds more were delayed Sunday, according to flight tracking websiteFlightAwareasthunderstorms struck the areaduring what officialscalledthe busiest weekend of the spring break travel period.\n\nContributing: Gabe Hauari, USA TODAY;Rebecca Heliot,Nolan Clayand Josh Kelly, The Oklahoman;Brian Broom, Mississippi Clarion Ledger",
        "source_2": "At least 40 people have died after tornadoes ripped through a swathe of the US Midwest and South.\n\nMissouri bore the brunt of the twisters, which began to spawn on Friday. At least 12 people have died in that state.\n\nPowerful winds in Texas and Kansas whipped up dust storms that resulted in vehicle pile-ups and a dozen deaths.\n\nThe extreme weather, covering an area of the country that is home to more than 100 million people, fanned nearly 150 deadly wildfires in Oklahoma. Fatalities were also recorded in Arkansas, Alabama and Mississippi.\n\nParts of Texas, Louisiana, Alabama, Arkansas, Tennessee, Mississippi, Georgia, Kentucky and North Carolina were under flood advisories.\n\nMore than 320,000 people across the region were without power on Sunday evening, according to tracker PowerOutageUS.\n\nTens of thousands of people were still without power on Monday morning, including more than 57,000 in Pennsylvania and 25,000 in Missouri.\n\nStates of emergency have been declared in Arkansas, Georgia and Oklahoma.\n\nIn Missouri, Governor Mike Kehoe said \"the scale of devastation across our state is staggering\".\n\n\"Hundreds of homes, schools, and businesses have been either destroyed or severely damaged,\" his statement added.\n\nA tornado killed the occupant of one residence in Butler County in the Midwestern state, leaving it \"unrecognisable as a home\", according to local coroner Jim Akers.\n\n\"Just a debris field,\" he added. \"The floor was upside down. We were walking on walls.\"\n\nIn Oklahoma, nearly 150 wildfires driven by winds that hit 83mph (133km/h) toppled several articulated lorries.\n\nThe state's chief medical examiner said at least four people had died there as a result of fires or high winds.\n\nThe blazes burnt 170,000 acres and destroyed nearly 300 structures, including a farmhouse owned by the state's Governor Kevin Stitt.\n\nIn Kansas, at least eight people died after more than 55 vehicles crashed due to a dust storm.\n\nIn Texas, another dust storm caused a pile-up of about 38 cars, leaving at least four people dead.\n\nSix people died in Mississippi as tornadoes swept through that state and twisters killed another three in Alabama, including an 82-year-old woman.\n\nIn Arkansas, officials reported three deaths and 29 people injured.\n\nUS President Donald Trump said the National Guard had been deployed to Arkansas to help with the storm response.\n\n\"Please join Melania and me in praying for everyone impacted by these terrible storms!\" he posted on his Truth social platform.\n\nPlease get in touch but only if it is safe to do so.\n\nPlease read our terms & conditions and privacy policy\n\nIn some cases a selection of your comments and questions will be published, displaying your name and location as you provide it unless you state otherwise. Your contact details will never be published.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "Fox News correspondent Brooke Taylor reports on the busy holiday travel season on ‘Special Report.’\n\nPresident Donald Trump on Sundaysent the National Guardto tornado-struck Arkansas after tornadoes and heavy winds ripped through multiple states over the weekend, leaving at least 37 dead.\n\nHeavy winds tore through the Heartland on Saturday, threateningMissouri, Mississippi, Kansas, Arkansas,Texas and Oklahoma with tornadoes, damaging buildings and homes. Northern states, including South Dakota and Minnesota, faced blizzard warnings.\n\n\"We are actively monitoring the severe tornadoes and storms that have impacted many States across the South and Midwest — 36 innocent lives have been lost, and many more devastated,\" Trump said in a Sunday post on X.\n\n\"The National Guard have been deployed to Arkansas, and my Administration is ready to assist State and Local Officials, as they help their communities to try and recover from the damage. Please join Melania and me in praying for everyone impacted by these terrible storms!\" the president wrote.\n\nTORNADO THREAT MOVES SOUTH AFTER CENTRAL STATES HIT BY MASSIVE STORM\n\nPresident Donald Trump has activated the National Guard in Arkansas after deadly tornadoes ripped through multiple states.(National Guard)\n\nThe National Guard tweeted that its Arkansas officers will \"support civilian authorities providing security and humanitarian assistance in communities affected by tornadoes in central and eastern Arkansas.\"\n\nArkansas Gov. Sarah Huckabee Sanderssaid there were about 50 National Guardsmen and 40 state police on the ground in Arkansas on Sunday.\n\n\"As you drive through this community, you see so many neighbors coming out, taking care of each other,\" she said in a video posted to X. \"One of the things that will make you so proud as a governor is to see neighbors helping neighbors, and never is that more true than right here in this community today. We've got about 40 state police on the ground in the county, about 50 National Guard.\"\n\nTRUMP'S FEMA FACES RECKONING AS MORE STAFF FIRED IN 'POLITICAL BIAS' SCANDAL: GOP LAWMAKER\n\nAt least 37 people have died after tornadoes ripped through multiple states over the weekend.(National Guard)\n\nIn a post on X, Sanders said she spoke with Trump on the phone, who \"said to tell the people of Arkansas he loves them and he and his administration are here to help with whatever we need following last night’s tornadoes.\"\n\nMissouri resident Dakota Henderson told The Associated Press that he and some others helped rescue neighbors trapped beneath rubble on Friday evening and found five bodies in the process.\n\nLA MAYOR KAREN BASS ACCUSED OF DELETING TEXTS IN WAKE OF WILDFIRE DISASTER\n\nArkansas Gov. Sarah Huckabee Sanders said she spoke on the phone with President Donald Trump following deadly tornadoes that tore through the state Saturday.(National Guard)\n\n\"It’s really disturbing for what happened to the people, the casualties last night,\" Henderson told AP on Saturday.\n\nEvacuations were ordered Friday for some areas in Texas, Oklahoma, Kansas, Missouri and New Mexico.\n\nStrong winds caused wildfires in the Southern Plains, and severe storms and tornadoes were also possible across eastern Louisiana, western Georgia, central Tennessee, western North Carolina and South Carolina, and the western Florida Panhandle.\n\nAudrey Conklin is a digital reporter for Fox News Digital and FOX Business. Email tips to audrey.conklin@fox.com or on Twitter at @audpants.\n\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}