{
    "question": "What are the potential legal, civil liberties, and public safety implications of President Trump invoking the Alien Enemies Act of 1798 to deport alleged Tren de Aragua members among unauthorized migrants?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nRepublican presidential nominee former President Donald Trump speaks along the southern border with Mexico, on Aug. 22, 2024, in Sierra Vista, Ariz. (AP Photo/Evan Vucci, File)\n\nTheSupreme Courthas allowed the Trump administration to use a 1798 wartime law, the Alien Enemies Act, todeport Venezuelan migrantsit accuses of being gang members, ending the temporary halt on deportations ordered by a federal district judge.\n\nBut the court also ruled that the administration must give Venezuelans it claims are gang members the chance to legally fight any deportation orders. The ruling did not address the constitutionality of the act.\n\nThe Monday ruling came after the wartime law was used last month to fly more than 130 men accused of being members of the gangTren de Araguato El Salvador, where the U.S. has paid to have the men held in anotorious prison. The Trump administration argues that the gang has become an invading force.\n\nThe Venezuelans deported under the act did not get a chance to challenge the orders, and attorneys for many of the men say there’s no evidence they are gang members. It remains unclear how the ruling will affect those men.\n\nAmerican Civil Liberties Union attorney Lee Gelernt said it was an “important victory” that people must now be given the right to challenge their removal orders.\n\nThe Trump administration welcomed the ruling, withAttorney General Pam Bondisaying an “activist judge in Washington, DC does not have the jurisdiction to seize control of President Trump’s authority to conduct foreign policy.”\n\nMeanwhile, the administration is also looking to invoke the Alien Enemies Act to deport alleged members of the Salvadoran gang MS-13, Todd Lyons, acting Immigration and Customs Enforcement director, told reporters Tuesday during Border Security Expo, a trade show in Phoenix.\n\nOn Wednesday, federal judges in New York and Texas took legal action to block the government from deporting five Venezuelans under the act until they have the chance to challenge their removals. The government says the men are Tren de Aragua members. Their lawyers dispute that.\n\nIn 1798, with the U.S. preparing for what it believed would be a war with France, Congress passed a series of laws that increased the federal government’s reach. The Alien Enemies Act was created to give the president wide powers to imprison and deport noncitizens in time of war.\n\nSince then, the act has been used just three times: during the War of 1812 and the two world wars.\n\nIt was part of the World War II legal rationale for mass internments in the U.S. of people of German, Italian and especially Japanese ancestry. An estimated 120,000 people with Japanese heritage,including those with U.S. citizenship, were incarcerated.\n\nFor years, Trump and his allies have argued that the U.S. is facing an “invasion” of people arriving in the country illegally.\n\nArrests on the U.S. border with Mexicotopped 2 million a yearfor two straight years for the first time under President Joe Biden, with many released into the U.S. to pursue asylum. After hitting an all-time monthly high of 250,000 in December 2023, they dropped sharply in 2024 and dramatically more after Trump took office.\n\nThe Trump administration has increasingly described the migrant issue as a war, most notably by designatingeight Latin American criminal groups,including Tren de Aragua and MS-13, as “foreign terrorist organizations.”\n\nTrump’s invocation of the act, which was publicly announced March 15, the same day as the deportations, said Tren de Aragua was attempting “an invasion or predatory incursion” of the United States.\n\nAdministration officials now regularly use military terminology to describe the situation, with Trump telling reporters last month that “this is a time of war.”\n\nTrump’s critics insist he is wrongly invoking an act designed for use during declared wars.\n\n“Trump’s attempt to twist a centuries-old wartime law to sidestep immigration protections is an outrageous and unlawful power grab—and it threatens the core civil liberties of everyone,” Scott Michelman, legal director of the ACLU of the District of Columbia, said in a statement after the Monday ruling.\n\nThe ACLU and Democracy Forward preemptively sued Trump hours before the March 15 deportations began, saying five Venezuelan men held at a Texas immigration detention center were at “imminent risk of removal” under the Alien Enemies Act. U.S. District Judge James E. Boasberg blocked their deportation, prompting an immediate Justice Department appeal.\n\nLater that day, Boasberg issued a new order to stop the deportations being carried out under the centuries-old law, and said any planes in the air needed to turn around. By then, though, two ICE Air planes were heading across the Gulf of Mexico and toward Central America. Neither came back.\n\nElliot Spagat in Phoenix and Valerie Gonzalez in McAllen Texas contributed to this report.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "At core of US President Donald Trump's hardline immigration policy is his use of a 1798 wartime authority allowing presidents to detain or deport the natives and citizens of an enemy country.\n\nWhile the Alien Enemies Act was enacted to prevent foreign espionage, the Trump administration has invoked it as the legal basis for the deportation of hundreds of alleged gang members.\n\nIn March, the US deported 261 alleged Venezuelan gang members to a notorious jail in El Salvador. Of those,137 were removed under the act, the White House said.\n\nTrump has alleged that the migrants were members of the Tren de Aragua (TdA) gang \"conducting irregular warfare\" against the US. However some civil rights groups say the Trump's use of the act is illegal and discriminates against immigrants based on their ancestry.\n\nThe Alien Enemies Act grants the president of the United States sweeping powers to order the detention and deportation of foreign enemies.\n\nIt was passed in 1798 when the US believed it would enter a war with France.\n\nThe act states that \"whenever there shall be a declared war [...] or any invasion or predatory incursion shall be perpetrated, attempted, or threatened\" against the US, all \"subjects of the hostile nation or government\" could be \"apprehended, restrained, secured and removed, as alien enemies\".\n\nThe act has only been previously used three times - all during times of conflict involving the US.\n\nIt was last invoked in World War Two, when people of Japanese descent - reportedly numbering about 120,000 - were imprisoned without trial. Thousands were sent to internment camps.\n\nPeople of German and Italian ancestry were also interned during that time.\n\nBefore that, the act was used during the War of 1812 and World War One.\n\nJudges in New York, Colorado and Texas have ruled against Trump's use of the law to deport Venezuelans.\n\nThe Supreme Court ruled on 7 April that Trump could use the Alien Enemies Act to deport alleged gang members, but deportees must be given a chance to challenge their removal.\n\nThat prompted civil rights groups to file lawsuits seeking to protect Venezuelans who may be targeted by the act. Several lower courts imposed temporary orders blocking deportations.\n\nWeeks later, the Supreme Court was again asked to intervene to stop deportations under the act. On 19 April, itordered the Trump administrationto pause the deportation of a group of Venezuelans detained in north Texas after their lawyers argued they had not been told about their right to contest the decision in court.\n\nOn 1 May, Trump-appointed federal judge Fernando Rodriguezruled that the US president cannot use the Alien Enemies Act to deport Venezuelan migrants.This was the first time a federal judge had ruled the use of the act was \"unlawful\".\n\nBut on 13 May, a federal judge in Pennsylvania, Stephanie Haines, said Trump could use the Alien Enemies Act to remove accused gang members from the state. She also ruled they must be given at least 21 days notice and an opportunity to challenge their deportations.\n\nAt his inaugural address in January, he said he would invoke the act to \"eliminate the presence of all foreign gangs and criminal networks bringing devastating crime to US soil\".\n\nIn his proclamation on 15 March, Trump invoked the wording of the act by accusing TdA of threatening an \"invasion\" against the US. He declared its members \"liable to be apprehended, restrained, secured, and removed as alien enemies\".\n\nTrump has repeatedly attacked judges who have issued rulings critical of his use of the act.\n\nIn March, federal judge James Boasberg attempted tostop the use of the law to carry out the deportations, but the White House said this had \"no lawful basis\", and that the removals had already taken place.\n\nThis led to a back-and-forth between the judge, located in Washington DC, and the government. Boasberg dismissed the government's response to his order as \"woefully insufficient\", and warned of consequences if the Trump administration had violated his ruling.\n\nDonald Trump hit back on social media, saying Boasberg should be impeached and calling him a  \"grandstander\".\n\nOne of the president's top aides, Stephen Miller, recently said the administration was\"actively looking at\" suspending habeas corpus.\n\nThe legal principle - which literally means \"you should have the body\" - allows for a person to be brought before a judge so the legality of their detention can be decided by a judge.\n\nTrump's decision has been criticised by rights groups. The American Civil Liberties Union (ACLU) sued to stop the removals on the grounds that the US was not at war.\n\nSpeaking to BBC News, Lee Gelernt, a lawyer with the ACLU, said: \"There's no question in our mind that the law is being violated.\"\n\nElora Mukherjee, director of the Immigrants' Rights Clinic at Columbia Law School, said the administration was \"pushing the bounds of executive authority, especially on immigration issues\".\n\n\"When the executive branch wilfully disregards clear and specific court orders, as the administration did with the [Venezuelan] deportation flights, the checks-and-balances system established by the U.S. Constitution is at risk, and our constitutional democracy is threatened,\" she said.\n\nKatherine Yon Ebright, counsel at the Brennan Center for Justice, said that Trump's use of the Alien Enemies Act was illegal.\n\n\"The only reason to invoke such a power is to try to enable sweeping detentions and deportations of Venezuelans based on their ancestry, not on any gang activity that could be proved in immigration proceedings\", she added.\n\nVenezuela criticised Trump's use of the act, saying it \"unjustly criminalises Venezuelan migration\" and \"evokes the darkest episodes in the history of humanity, from slavery to the horror of the Nazi concentration camps\".\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "Fox News correspondent Brooke Taylor has the latest on efforts to secure the southern border from migrant crime by targeting TDA on 'America Reports.'\n\nHours after PresidentDonald Trumpinvoked a wartime law to target terrorist organization Tren de Aragua (TdA) Saturday, a federal judge ruled the law could not be used to deport five Venezuelans and ordered the plane they were believed to be on to return to the U.S.\n\nThe Alien Enemies Act of 1798, which allows deportation of natives and citizens of an enemy nation without a hearing, has been invoked three times, during the War of 1812, World War I andWorld War II.\n\nAll Venezuelan citizens 14 years or older who are members of TdA, are withinthe U.S.and are not naturalized or lawful permanent residents of the U.S. may be apprehended, restrained, secured and removed as \"alien enemies,\" according to Trump's proclamation.\n\nAlleged members of the Tren de Aragua gang have overtaken an apartment building in Aurora, Colorado, charging rent in exchange for \"protection,\" previous reports say.(Edward Romero)\n\n'WEAPONIZED MIGRATION': US FACES DEADLY CONSEQUENCES WITH MADURO IN POWER, VENEZUELAN OPPOSITION WARNS\n\nHours before the proclamation was signed, a lawsuit was filed by the American Civil Liberties Union, Democracy Forward and the ACLU of the District of Columbia, claiming it could be used to deport any Venezuelan in the country, regardless of whether they are a member of TdA.\n\nAt a hearing Saturday afternoon, Chief U.S. District Judge James Boasberg of theD.C. Circuitgranted a temporary restraining order preventing the deportation of the five Venezuelans, who had already been in federal custody for two weeks.\n\nTwo planes that may have been en route to deport illegal immigrants were ordered returned by the judge. However, it is unclear as of Saturday night if they have done so.\n\n\"Tonight, a DC trial judge supported Tren de Aragua terrorists over the safety of Americans. TdA is represented by the ACLU,\" U.S. Attorney General Pam Bondi said in a statement. \"This order disregards well-established authority regarding President Trump’s power, and it puts the public and law enforcement at risk. The Department of Justice is undeterred in its efforts to work with the White House, the Department of Homeland Security, and all of our partners to stop this invasion and Make America Safe Again.\"\n\nThe Trump administration appealed the restraining order, alleging it is improper to delay a presidential act before it is announced, affiliateFOX 32 Chicagoreported.\n\nPeruvian police transfer several members of the Tren de Aragua criminal organization in Lima Oct. 5, 2023.(Cris Bouroncle/AFP via Getty Images)\n\n\"The United States is not at war, nor has it been invaded. The president’s anticipated invocation of wartime authority — which is not needed to conduct lawful immigration enforcement operations — is the latest step in an accelerating authoritarian playbook,\" Skye Perryman, president and CEO of Democracy Forward, wrote in a statement.\n\n\"From improperly apprehending American citizens to violating the ability of communities to peacefully worship to now improperly trying to invoke a law that is responsible for some of our nation’s most shameful actions, this administration’s immigration agenda is as lawless as it is harmful.\"\n\nAn in-person hearing on the lawsuit's merits is scheduled for D.C. Monday.\n\nPolice officers search for evidence in apartment buildings at 12th and Dallas in Aurora, Colo., Dec. 17, 2024.(Fox News Digital)\n\nThe move fulfills a campaign promise made during an October rally, when Trump announced he would use the law to combat Tren de Aragua (TdA) members in the U.S.\n\nTren de Aragua (TdA), designated a foreign terrorist organization Feb. 20 by theDepartment of State,has thousands of members, many of whom the White House says have unlawfully infiltrated the United States and are \"conducting irregular warfare and undertaking hostile actions against the United States.\"\n\nColorado officials confirmed TdA occupied entire apartment complexes in Aurora, noting a special task force had to be established to combat its activity.\n\nTRUMP TO INVOKE WARTIME ALIEN ENEMIES ACT OF 1798 TO FAST-TRACK DEPORTATIONS OF ILLEGAL IMMIGRANTS\n\nAs of Sept. 11, 2024, the Aurora Police Department linked the gang to nearly a dozen people, resulting in eight arrests.\n\n\"Two of the eight individuals who were taken into custody were involved in a July shooting at one of the specific properties in the city that have experienced issues with TdA activity,\" according toa statement.\"In line with these arrests, we can also now confirm that criminal activity, including TdA issues, had significantly affected those properties.\"\n\nVenezuelan socialist dictator Nicolás Maduro, right(Fox Nation)\n\nThe White House said the gang has continued to engage in mass illegal migration to the U.S. to \"further its objectives of harming United States citizens,\" undermining public safety.\n\nTdA operates in conjunction with Cártel de los Soles, the Nicolás Maduro regime-sponsored narco-terrorism enterprise based in Venezuela, and commits brutal crimes, including murders, kidnappings, extortion and human, drug, and weapons trafficking, according to the White House.\n\nIt grew significantly while Tareck El Aissami served as governor of Aragua between 2012 and 2017. In 2017, El Aissami was appointed vice president of Venezuela.\n\nSoon after, the Treasury Department designated El Aissami a specially designated narcotics trafficker under the Foreign Narcotics Kingpin Designation Act, and he remains a U.S. fugitive.\n\nIn 2020, Maduro and other regime members were charged with narcoterrorism and other crimes in an alleged plot against America.\n\nFox News Digital's Louis Casiano and Bradford Betz contributed to this report.\n\nAlexandra Koch is a Fox News Digital journalist who covers breaking news, with a focus on high-impact events that shape national conversation and influence government response.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}