{
    "question": "In what ways could President Trump’s order to eliminate the U.S. Agency for Global Media, place most Voice of America staff on leave, and terminate funding for RFE/RL and Radio Free Asia affect U.S. public diplomacy and the availability of independent news to audiences abroad?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nThe Voice of America building, Monday, June 15, 2020, in Washington. (AP Photo/Andrew Harnik, File)\n\nPresident Donald Trump’s administration on Saturday began making deep cuts toVoice of Americaand other government-run, pro-democracy programming, with the organization’s director saying all VOA employees have been put on leave.\n\nOn Friday night, shortly after Congress passed itslatest funding bill, Trump directed his administration to reduce the functions of several agencies to the minimum required by law. That included the U.S. Agency for Global Media, which houses Voice of America, Radio Free Europe and Asia and Radio Marti, which beams Spanish-language news into Cuba.\n\nOn Saturday morning, Kari Lake, the failed Arizona gubernatorial and U.S. Senate candidate whom Trump named a senior adviser to the agency, posted on X that employees should check their email. That coincided with notices going out placing Voice of America staff on paid administrative leave.\n\n“For the first time in 83 years, the storied Voice of America is being silenced,” Michael Abramowitz, the organization’s director, said in a statement. He added that “virtually” the entire 1300-person staff was placed on leave.\n\n“VOA promotes freedom and democracy around the world by telling America’s story and by providing objective and balanced news and information, especially for those living under tyranny,” Abramowitz said.\n\nOne reporter, who spoke under the condition of anonymity because they were not authorized to speak to the press, said: “We expected something like this to happen, and it just happened to be today.”\n\nThe press advocacy group Reporters Without Borders said it “condemns this decision as a departure from the U.S.’s historic role as a defender of free information and calls on the U.S. government to restore VOA and urges Congress and the international community to take action against this unprecedented move.”\n\nThe Agency for Global Media also sent notices terminating grants to Radio Free Asia and other programming run by the agency. Voice of America transmits United States domestic news into other countries, often translated into local languages. Radio Free Asia, Europe and Marti beam news into countries with authoritarian regimes in those regions like China, North Korea and Russia.\n\n“The cancellation of Radio Free Europe/Radio Liberty’s grant agreement would be a massive gift to America’s enemies,” said the network’s President and CEO, Stephen Capus, in a statement.\n\nCombined, the networks reach an estimated 427 million people. They date back to the Cold War and are part of a network of government-funded organizations trying to extend U.S. influence and combat authoritarianism that includes USAID, another agency targeted by Trump.\n\nThe reduction is a dramatic blow at a staple of post-Cold War order that has long had bipartisan support. Voice of America’s directors have included Dick Carlson, the father of conservative commentator Tucker Carlson.\n\nThomas Kent, former president and CEO of Radio Free Europe/Radio Liberty, said that Trump’s intentions for the agencies are still foggy. Without these news sources, it will be that much harder for the country to get its messages to the world, he said.\n\n“Without the international broadcasting, the image of the United States and the Trump administration will be in the hands of others, including the administration’s opponents, (and) countries and people who consider the United States an enemy,” said Kent, an international consultant on media ethics.\n\nA video posted on X by Lake on Saturday talked about cost-cutting measures, not mentioning the employees and the mission of Voice of America. Her video was made at a building leased by VOA that Lake described as a waste of money. She said she would try to break the agency’s 15-year lease on the building.\n\n“We’re doing everything we can to cancel contracts that can be cancelled, save more, downsize and make sure there’s no misuse of your dollars,” she said.\n\nThe letter places employees on administrative leave and says staff would continue to receive pay and benefits “until otherwise notified.” It ordered employees not to use Agency for Global Media facilities and return equipment like phones and computers.\n\nThe Trump administration has alreadymade other steps to assert its authorityover Voice of America, and this week canceledcontractsthat allowed VOA to use material from independent news organizations, such as The Associated Press.\n\nThe administration has also banned the AP from press pools that cover the president and moved to take charge of what news organizations are members of the pools, and the FCC is investigating news organizations like CBS.\n\nTrump’s order requiring reductions also includes several other, lesser-known government agencies such as the Woodrow Wilson International Center for Scholars, a nonpartisan think tank, the United States Interagency Council on Homelessness and the Community Development Financial Institutions Fund.\n\nAssociated Press writer Matthew Lee in Washington contributed to this report.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Reporting by Nathan Layne in West Palm Beach, Florida and James Oliphant in Washington; Additional reporting by Jason Hovet in Prague and Josh Smith in Seoul; Editing by Michelle Nichols, Mark Potter, Diane Craft, Rod Nickel, Deepa Babington and Lincoln Feast.\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab",
        "source_3": "PresidentTrumpsigned an executive order directing the elimination of seven additional federal agencies responsible for jobs such as labor mediation, preventing homelessness, funding state museums and libraries and overseeing government funding of news outlets around the world.\n\nThe order, issued just before midnight Friday, directs the agencies to “be eliminated to the maximum extent consistent with applicable law.”\n\nIt also orders the agency heads to “reduce the performance of their statutory functions and associated personnel.” Leaders of each entity must submit a report to the Office of Management and Budget confirming full compliance within seven days.\n\n“This order continues the reduction in the elements of the federal bureaucracy that the president has determined are unnecessary,” the order states.\n\n• The U.S. Agency for Global Media, which is the parent company ofVoice of America, which funds international media.\n\n• The Woodrow Wilson International Center for Scholars in the Smithsonian Institution, a government-funded think tank.\n\n• The Institute of Museum and Library Services, which supports libraries, archives and museums in every state.\n\n• The United States Interagency Council on Homelessness, which aims to prevent and end homelessness.\n\n• The Federal Mediation and Conciliation Service, which resolves work stoppages and labor disputes.\n\n• The Community Development Financial Institutions Fund, which works to expand economic development for underserved communities.\n\n• The Minority Business Development Agency, which aims to grow minority-owned businesses.\n\nMr.Trumpis once again testing the bounds of presidential authority as he works to reduce the size of the federal government. The U.S. Agency for Global Media is congressionally chartered as an independent agency, and, in 2020, Congress passed a law to limit the power of the agency’s chief executive, a presidentially appointed position.\n\nThe U.S. Agency for Global Media funds Radio Free Europe/Radio Liberty and Radio Free Asia. It has a budget of roughly $270 million and more than 2,000 employees, broadcasts in 49 languages and has a weekly estimated audience of more than 361 million people.\n\nIts goal is to provide unbiased news and culture to audiences across the globe, but Mr.Trumpheavily criticized the news outlet for its editorial decisions since his first term. Since returning to the White House, Mr.Trumpnamed Kari Lake to serve as a special adviser atVoice of America. She is a fierce Trump loyalist who lost bids for governor and Senate in Arizona.\n\nMs. Lake said last month at the Conservative Political Action Conference thatVoice of Americawon’t be “Trump TV” on her watch.\n\nMr.Trumphas also nominated conservative activist L. Brent Bozell III to head the U.S. Agency for Global Media. He has yet to be confirmed by the Senate.\n\nSince taking office, Mr.Trumpand billionaire Elon Musk and the Department of Government Efficiency have sought to drastically reshape the federal government by cutting staff and programs. On Tuesday, the Education Department announced it was laying off more than 1,300 workers and hundreds more had accepted separation packages, nearly halving the agency’s staff.\n\nMr.Trumpand Mr. Musk have promoted the cuts as a way to save billions in tax dollars, but several of their moves have been halted by federal judges. On Thursday, two federal judges ordered the Trump administration to reinstate thousands of federal employees who were fired last month because they had probationary status.\n\n• Jeff Mordock can be reached atjmordock@washingtontimes.com.\n\nCopyright © 2025 The Washington Times, LLC.Click\n                            here for reprint permission.\n\nPope Leo should tell Catholics: Marry young, have many children\n\nTrump’s TikTok delays undermine his China hawks while Intel controversy grows"
    }
}