{
    "question": "What are the potential legal, operational, and workforce implications of the judge’s order requiring six federal agencies to reinstate thousands of probationary employees laid off last month?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nDemonstrators rally in support of federal workers outside of the Department of Health and Human Services, Feb. 14, 2025, in Washington. (AP Photo/Mark Schiefelbein, File)\n\nA federal employee, who asked not to use their name for fears over losing their job, protests with a sign saying “Federal Employees Don’t Work for Kings” during the “No Kings Day” protest on Presidents Day in Washington, in support of federal workers and against recent actions by President Donald Trump and Elon Musk, Feb. 17, 2025, by the Capitol in Washington. (AP Photo/Jacquelyn Martin, File)\n\nPresident Donald Trump speaks during an event with Ireland’s Prime Minister Micheál Martin in the East Room of the White House in Washington, Wednesday, March 12, 2025. (AP Photo/Alex Brandon)\n\n▶ Follow live updates onPresident Donald Trump and his administration\n\nSAN FRANCISCO (AP) — Two federal judges handed down orders requiring President Donald Trump’s administration to rehire thousands, if not tens of thousands, of probationary workers let go inmass firingsacross multiple agencies Thursday, slowing down for now the president’s dramatic downsizing of the federal government.\n\nBoth judges separately found legal problems with the way the mass terminations were carried out and ordered the employees at least temporarily brought back on the job.\n\nThe Trump administration has already appealed the first ruling. White House press secretary Karoline Leavitt cast it as an attempt to encroach on the president’s power to hire and fire employees. “The Trump Administration will immediately fight back against this absurd and unconstitutional order,” she said in a statement.\n\nIn San Francisco, U.S. District Judge William Alsup found Thursday morning that terminations across six agencies were directed by the Office of Personnel Management and an acting director, Charles Ezell, who lacked the authority to do so.\n\nIn Baltimore, U.S. District Judge James Bredar found that the administration did not follow laws set out for large-scale layoffs, including 60 days’ advance notice. Bredar, who was appointed by President Barack Obama, ordered the firings temporarily halted and the workforce returned to the status quo before the layoffs began.\n\nHe sided with nearly two dozen states that filed a lawsuit alleging the mass firings are illegal and already having an impact on state governments as they try to help the suddenly jobless.\n\nAt least 24,000 probationary employees have been terminated since Trump took office, the lawsuit alleges, though the government has not confirmed that number. including advance notice required for affected states.\n\nThe Trump administration argues that the states have no right to try and influence the federal government’s relationship with its own workers. Justice Department attorneys argued the firings were for performance issues, not large-scale layoffs subject to specific regulations.\n\nThe White House did not immediately return an email seeking comment on Bredar’s ruling.\n\nProbationary workers have been targeted for layoffs across the federal government because they’re usually new to the job and lack full civil service protection. Multiple lawsuits have been filed over the mass firings.\n\nAlsup’s order tells the departments of Veterans Affairs, Agriculture, Defense, Energy, the Interior and the Treasury to immediately offer job reinstatement to employees terminated on or about Feb. 13 and 14. He also directed the departments to report back within seven days with a list of probationary employees and an explanation of how the agencies complied with his order as to each person.\n\nThe temporary restraining order came in a lawsuit filed by a coalition of labor unions and organizations as the Republican administration moves to reducethe federal workforce.\n\n“These mass-firings of federal workers were not just an attack on government agencies and their ability to function, they were also a direct assault on public lands, wildlife, and the rule of law,” said Erik Molvar, executive director of Western Watersheds Project, one of the plaintiffs.\n\nAlsup expressed frustration with what he called the government’s attempt to sidestep laws and regulations governing a reduction in its workforce — which it is allowed to do — by firing probationary workers who lack protections and cannot appeal.\n\nHe was appalled that employees were told they were being fired for poor performance despite receiving glowing evaluations just months earlier.\n\n“It is sad, a sad day, when our government would fire some good employee and say it was based on performance when they know good and well that’s a lie,” he said. “That should not have been done in our country.”\n\nLawyers for the government maintain the mass firings were lawful because individual agencies reviewed and determined whether employees on probation were fit for continued employment.\n\nBut Alsup, who was appointed by President Bill Clinton, a Democrat, has found that difficult to believe. He planned to hold an evidentiary hearing Thursday, but Ezell, the OPM acting director, did not appear to testify in court or even sit for a deposition, and the government retracted his written testimony.\n\n“I know how we get at the truth, and you’re not helping me get at the truth,” Alsup said to Kelsey Helland, an assistant U.S. attorney.\n\nThere are an estimated 200,000 probationary workers across federal agencies. They include entry-level employees but also workers who recently received a promotion.\n\nAbout 15,000 are employed in California, providing services ranging from fire prevention to veterans’ care, according to the lawsuit filed by the coalition of labor unions and nonprofit organizations that represent parks, veterans and small businesses.\n\nThe plaintiffs said in their complaint that numerous agencies informed workers that the personnel office had ordered the terminations, with an order to use a template email informing workers their firing was for performance reasons.\n\nWitte reported from Annapolis, Maryland. Whitehurst reported from Washington.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Two US judges have ordered several federal government agencies to reinstate the jobs of probationary employees fired en masse by the Trump administration last month.\n\nIn California, District Judge William Alsup called the sacking of these employees part of a \"sham\" strategy that aimed to circumvent proper procedures for reducing the federal workforce.\n\nHis order - which was followed by another from Maryland - applies to thousands of probationary workers who were fired at a range of departments, including defence, energy, treasury, and veterans affairs.\n\nThe Department of Justice says the firings were done based on guidance - rather than a directive - from the Office of Personnel Management (OPM).\n\nOPM, a once-obscure agency that manages the federal government's civil service, has been thrust into the spotlight amid President Donald Trump's moves to slash the size of the federal workforce.\n\nIn Thursday's hearing in San Francisco, California, Judge Alsup countered the DOJ lawyer's arguments from the bench, citing evidence including termination letters that stated the firings were carried out on OPM's instructions.\n\n\"That should not have been done in our country,\" Judge Alsup said. \"It was a sham in order to avoid statutory requirements.\"\n\nDanielle Leonard, a lawyer representing a coalition of government employee unions, said probationary employees were targeted because they lacked the right to appeal.\n\nDuring the hearing, Judge Alsup also lamented the firing of a government worker in Albuquerque, New Mexico who had been given top marks for performance but was then issued a pink slip citing performance as the cause of their termination.\n\n\"I just want to say it is a sad day when our government would fire a good employee and say it's for performance when they know good and well that's a lie,\" Judge Alsup said.\n\nJudge Alsup's order was followed by a similar ruling from Baltimore, Maryland, by District Judge James Bredar, who agreed that Trump's team had broken regulations and cast doubt on the idea that the workers had been individually sacked for unsatisfactory performances.\n\nResponding to the first ruling, White House press secretary Karoline Leavitt accused Judge Alsup of singlehandedly \"attempting to unconstitutionally seize the power of hiring and firing from the executive branch\".\n\nShe said that power rested with the president and \"singular district court judges cannot abuse the power of the entire judiciary to thwart the president's agenda\".\n\n\"The Trump administration will immediately fight back against this absurd and unconstitutional order,\" she added.\n\nElon Musk's name was not mentioned during the California hearing, but he has been tasked by President Trump with downsizing the federal workforce through the ad hoc Department of Government Efficiency - or Doge.\n\n\"He was on everybody's mind,\" said Luz Fuller, president of a local Sacramento branch of the American Federation of Government Employees, which represents more than 4,500 employees in Northern California.\n\nThe White House hasdeniedthat Musk is the agency's leader, although Trump labelled him as such during his Congressional address last week.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "A U.S. federal judge on Thursday ordered six federal agencies to rehire thousands of probationary workers fired as part of Donald Trump’s push to slash the size and scope of government.\n\nThe ruling is the latest judicial setback for the administration, coming on the heels of a string of legal defeats that nevertheless seem not to have slowed the pace of change.\n\nJudge William Alsup said the justification of “poor performance” for mass lay-offs last month was “a sham in order to try to avoid statutory requirements,” theNew York Timesreported.\n\nRuling on a lawsuit brought by employee unions, Alsup ordered the departments of the Treasury, Veterans Affairs, Agriculture, Defense, Energy and Interior to reinstate anyone on probation who was improperly fired.\n\n“It is a sad day when our government would fire some good employee and say it was based on performance when they know good and well that’s a lie,” said Alsup at a hearing at the US District Court in San Francisco.\n\nSince returning to the White House in January, Trump has cut federal government spending programs and firing tens of thousands of the more-than two million employees on the federal payroll.\n\nHis actions have faced pushback from the courts, with several judges issuing injunctions intended to halt them.\n\nLast month Alsup ordered the federal government to rescind directives that resulted in thousands of staff being let go.\n\nOn Thursday, he said the government was within its rights to downsize staffing, but that it had to be done properly and with justification — he cited “reduction in force” orders issued by several agencies as legal routes.\n\n“If it’s done right, there can be a reduction in force within an agency, that has to be true,” he said.\n\n“Congress itself has said you can have an agency do a reduction in force, if it’s done correctly under the law.”\n\nBut that was not the case with the orders issued by the Office of Personnel Management (OPM) — the government’s human resources body — whose actions amounted to overreach.\n\nAttorneys from the Justice Department, representing the Trump administration, had insisted that OPM never issued any orders, only guidance, the Washington Post reported.\n\nBut, the paper said, court records showed officials from agencies including the IRS, the Department of Defense, and Veterans Affairs, had disputed this, claiming the order to cut probationary workers came directly from the OPM.\n\nTrump — supported by a chainsaw-wielding Elon Musk — has set about fundamentally reshaping the US government in a way that he says will make it leaner and more efficient, but which opponents say amounts to a bid to undermine its very purpose.\n\nThat effort found its latest expression this week when the Education Department said it was halving the number of staff, in what the Secretary of Education described as the first step to shutting it down.\n\nDespite the high stakes, Trump faces few obstacles from the Washington political establishment.\n\nThe Democratic Party are still in disarray after their electoral drubbing and his Republican Party appears largely content to cede Congressional power to the executive."
    }
}