{
    "question": "What factors will determine whether Israel’s 10-hour daily humanitarian pauses and designated aid routes meaningfully improve aid access and public health in Gaza, including efforts to restore power to a key water treatment plant?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nIsraeli Prime Minister Benjamin Netanyahu on Sunday accused the U.N. of “making excuses and lies about the State of Israel,” as concerns over hunger in the Gaza Strip mount.\n\nA plane was seen dropping aid over the Gaza Strip on Sunday, as Israel launched a series of steps to alleviate the humanitarian crisis there. The drop came hours after Israel carried dropped packages of aid with flour, sugar and canned food into the Palestinian territory. (AP video by Mohammad Jahjouh)\n\nHundreds of weary Palestinians carried sacks of flour on their shoulders after they managed to fetch them from a truck envoy that entered Gaza. While some of them managed to get bags of flour, others returned empty-handed, and some died on the attempt. (AP Video/Abdel Kareem Hana)\n\nDozens of Palestinians, mostly women and children, gathered around a charity kitchen in Gaza City, carrying their pots hoping to get food for themselves and their families. (AP video by Abdel Kareem Hana & Production by Wafaa Shurafa)\n\nDozens of trucks carrying humanitarian aid in Egypt’s Sinai Peninsula started to move towards the Kerem Shalom crossing for inspections on Sunday before being allowed into Gaza Strip, according to Egypt’s state-run Al-Qahera News TV.\n\nHumanitarian aid is airdropped to Palestinians over northern Gaza Strip, Sunday, July 27, 2025. (AP Photo/Abdel Kareem Hana)\n\nHumanitarian aid is airdropped to Palestinians over Gaza City, Gaza Strip, Sunday, July 27, 2025. (AP Photo/Jehad Alshrafi)\n\nPalestinians carry sacks of flour unloaded from a humanitarian aid convoy that reached Gaza City from the northern Gaza Strip, Sunday, July 27, 2025. (AP Photo/Jehad Alshrafi)\n\nPalestinians carry sacks of flour unloaded from a humanitarian aid convoy that reached Gaza City from the northern Gaza Strip, Sunday, July 27, 2025. (AP Photo/Abdel Kareem Hana)\n\nRelatives of Druze Israeli captain Amir Saad, who was killed in a battle in the Gaza Strip, mourn during his funeral in the village of Yanuh Jat, northern Israel, Sunday, July 27, 2025. (AP Photo/Ariel Schalit)\n\nDEIR AL-BALAH, Gaza Strip (AP) — The Israeli military Sunday began limited pauses in fighting in three populated areas ofGazafor 10 hours a day, part ofmeasuresincluding airdrops as concerns grow oversurging hungerand as Israel faces criticism over its conduct in the 21-month war.\n\nThe military said the “tactical pause” from 10 a.m. to 8 p.m. in Gaza City, Deir al-Balah and Muwasi, all with large populations, would increase humanitarian aid entering the territory.\n\nUnited Nations humanitarian chief Tom Fletcher welcomed Israel’s decision to support a “one-week scale-up of aid” and said “some movement restrictions appear to have been eased.” But he said action needs to be sustained, vast and fast.\n\nPalestinians struggle to get donated food at a community kitchen, in Gaza City, northern Gaza Strip, Saturday, July 26, 2025. (AP Photo/Abdel Kareem Hana)\n\nPalestinians carry sacks of flour unloaded from a humanitarian aid convoy that reached Gaza City from the northern Gaza Strip, Saturday, July 26, 2025. (AP Photo/Jehad Alshrafi)\n\n“Whichever path we choose, we will have to continue to allow the entry of minimal humanitarian supplies,” IsraeliPrime Minister Benjamin Netanyahusaid.\n\nImages of emaciated children have fanned criticism of Israel,including by allieswho call for the war’s end. Israel has restricted aid to Gaza’s population of over 2 million because it says Hamas siphons it off to bolster its rule, without providing evidence. Much of the population, squeezed into ever-smaller patches of land, now relies on aid.\n\nAs the military had warned, combat operations continued otherwise. Health officials in Gaza said Israeli strikes killed at least 41 Palestinians from late Saturday into Sunday, including 26 seeking aid.\n\n“I came to get flour for my children because they have not tasted flour for more than a week, and thank God, God provided me with a kilo of rice with difficulty,” said Sabreen Hassona, as other Palestinians trudged along a dusty road carrying sacks of food from the Zikim crossing.\n\nBut aid came slowly for others, if at all. “We saw the planes, but we didn’t see what they dropped,” Samira Yahya said in Zawaida in central Gaza. “They said trucks would pass, but we didn’t see the trucks.”\n\nSome people feared going out and having a box of aid fall on their children, Ahmed al-Sumairi said.\n\nIsrael’s military said 28 aid packages containing food were airdropped, and said it would put in place secure routes for aid delivery. It said the steps were made in coordination with the U.N. and other humanitarian groups.\n\nThe U.N. World Food Program said it had enough food in, or on its way, to feed all of Gaza for nearly three months. It has said nearly half a million people were enduring famine-like conditions.\n\nAntoine Renard, WFP’s country director for the occupied Palestinian territories, said around 80 WFP trucks entered Gaza, while another over 130 trucks arrived via Jordan, Ashdod and Egypt. He said other aid was moving through the Kerem Shalom and Zikim crossings.\n\nHe stressed it was not enough to counter the “current starvation.”\n\nGaza saw 63 malnutrition-related deaths in July, including 24 children underage 5, the World Health Organization said.\n\nDr. Muneer al-Boursh, Gaza Health Ministry’s director-general, called for a flood of medical supplies to treat child malnutrition.\n\nPalestinians carry sacks of flour unloaded from a humanitarian aid convoy that reached Gaza City from the northern Gaza Strip, Saturday, July 26, 2025. (AP Photo/Jehad Alshrafi)\n\n“This (humanitarian) truce will mean nothing if it doesn’t turn into a real opportunity to save lives,” he said. “Every delay is measured by another funeral.”\n\nCeasefire effortsappeared to be in doubt. Israel and the U.S. recalled negotiating teams from Qatar on Thursday, blaming Hamas, and Israel said it was considering “alternative options” to talks.\n\nIsrael says it is prepared to end the war if Hamas surrenders, disarms and goes into exile, something the group has refused. Khalil al-Hayya, head of Hamas’ negotiating delegation, said the group had displayed “maximum flexibility.”\n\nSenior Hamas official Mahmoud Merdawi said Israel’s change of approach on the humanitarian crisis amounted to an acknowledgment of Palestinians starving in Gaza, and asserted that it was meant to improve Israel’s international standing and not save lives.\n\nAfter ending the latest ceasefire in March, Israel cut off the entry of food, medicine, fuel and other supplies to Gaza for 2 ½ months, saying it aimed to pressure Hamas to release hostages. Fifty of them remain in Gaza, over half of them believed to be dead.\n\nUnder international pressure, Israel slightly eased the blockade in May. Since then, the average of 69 trucks a day has been far below the 500 to 600 trucks the U.N. says are needed. The U.N. says it has been unable to distribute much aid because hungry crowds and gangs take most of it from trucks.\n\nIn an attempt to divert aid delivery from U.N. control, Israel has backed theU.S.-registered Gaza Humanitarian Foundation, which in May opened four distribution centers.More than 1,000 Palestinians have been killedby Israeli forces since May while trying to get food, mostly near those sites, the U.N. human rights office says.\n\nTrucks carrying humanitarian aids enter the Rafah crossing between Egypt and the Gaza Strip, Sunday, July 27, 2025. (AP Photo/Mohamed Arafat)\n\nIsrael asserts the U.N. system allows Hamas to steal aid. The U.N. denies it.\n\n“Gaza is not a remote island. The infrastructure and resources exist to prevent starvation; we just need safe, sustained access,” Mercy Corps’ vice president of global policy and advocacy, Kate Phillips-Barrasso, said in a statement.\n\nAwda Hospital in Nuseirat said Israeli forces killed at least 13 people, including four children and a woman, and wounded 101 as they headed toward a GHF aid distribution site in central Gaza.\n\nSmoke rises from an explosion in the northern Gaza Strip, as seen from southern Israel Sunday, July 27, 2025. (AP Photo/Ohad Zwigenberg)\n\nIsrael’s military said it fired warning shots to prevent a “gathering of suspects” from approaching, hundreds of meters from the site before opening hours. GHF said there were no incidents at or near its sites.\n\nThirteen others were killed seeking aid elsewhere, including northwestern Gaza City, where over 50 people were wounded, and near the Zikim crossing where over 90 were wounded, hospital officials and medics said.\n\nIsrael’s military said two soldiers were killed in Gaza, bringing the total to 898 since the Oct. 7, 2023, Hamas attack that sparked the war. Hamas killed 1,200 people, mostly civilians, in that attack, and took 251 hostages.\n\nIsrael’s retaliatory offensive has killed more than 59,700 Palestinians, according to Gaza’s Health Ministry. Its count doesn’t distinguish between militants and civilians, but the ministry says over half of the dead are women and children. The ministry operates under the Hamas government. The U.N. and other international organizations see it as the most reliable source of data on casualties.\n\nU.S. President Donald Trump on Sunday called the images of emaciated and malnourished children in Gaza “terrible.”\n\nGoldenberg reported from Tel Aviv, Israel, and Magdy from Cairo. Associated Press writer Seung Min Kim in Cincinnati, Ohio, contributed.\n\nFollow AP’s war coverage athttps://apnews.com/hub/israel-hamas-war\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Reporting by Nidal al-Mughrabi, Charlotte Greenfield, Dawoud Abu Alkas, Jaidaa Taha and Mayaan Lubell;\nEditing by Kate Mayberry, William Mallard, Helen Popper, Alexandra Hudson, Giles Elgood and Leslie Adler\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nA senior correspondent with nearly 25 years’ experience covering the Palestinian-Israeli conflict including several wars and the signing of the first historic peace accord between the two sides.",
        "source_3": "The Israeli military on July 26 announced new actions to expand humanitarian assistance to the embattled Gaza Strip, amid concerns of a growing famine.\n\nThe Israel Defense Forces (IDF) announced that, beginning on Saturday night, they would resume airdrops of humanitarian supplies to the territory, in hopes of expanding aid delivery channels."
    }
}