{
    "question": "How might the Trump Tower protest in support of Mahmoud Khalil influence public debate and policy scrutiny around free speech and immigration enforcement, given that he is a permanent resident who has not been charged with a crime?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nProtesters flood Trump Tower’s lobby to demand the Columbia University activist’s release\n\nProtesters flood Trump Tower’s lobby to demand the Columbia University activist’s release\n\nNew York Police officers arrest a demonstrator from the group, Jewish Voice for Peace, who protested inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nNew York Police officers arrest a demonstrator from the group, Jewish Voice for Peace, who protested inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nDemonstrators with the group, Jewish Voice for Peace, protest inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nNew York Police officers arrest a demonstrator from the group, Jewish Voice for Peace, who protested inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nNew York Police officers arrest a demonstrator from the group, Jewish Voice for Peace, who protested inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nDemonstrators from the group, Jewish Voice for Peace, protest inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nDemonstrators from the group, Jewish Voice for Peace, protest inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nNew York Police officers arrest a demonstrator from the group, Jewish Voice for Peace, who protested inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nDemonstrators from the group, Jewish Voice for Peace, protest inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nSecurity personnel with Trump Tower confront a demonstrator from the group, Jewish Voice for Peace, as they protest inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nDemonstrators from the group, Jewish Voice for Peace, protest inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nDemonstrators from the group, Jewish Voice for Peace, protest inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nNew York Police officers arrest a demonstrator from the group, Jewish Voice for Peace, who protested inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nDemonstrators from the group, Jewish Voice for Peace, protest inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nDemonstrators from the group, Jewish Voice for Peace, protest inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nA demonstrator from the group, Jewish Voice for Peace, who protested inside Trump Tower in support of Columbia graduate student Mahmoud Khalil is escorted out by New York Police officers after being arrested, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nDemonstrators from the group, Jewish Voice for Peace, protest inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nDemonstrators from the group, Jewish Voice for Peace, who were arrested while protesting inside Trump Tower, wait to board a bus escorted by New York Police officers, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nDemonstrators from the group, Jewish Voice for Peace, are escorted out after they were arrested while protesting inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nNew York Police officers gather to arrest demonstrators from the group, Jewish Voice for Peace, who protested inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nDemonstrators from the group, Jewish Voice for Peace, protest inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nDemonstrators from the group, Jewish Voice for Peace, who were arrested while protesting inside Trump Tower, wait to board a bus escorted by New York Police officers, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nNEW YORK (AP) — Demonstrators from a Jewish group filled the lobby of Trump Tower on Thursday to denounce the immigration arrest of Mahmoud Khalil,a pro-Palestinian activistwho helped lead protests against Israel at Columbia University.\n\nThe demonstrators from Jewish Voice for Peace wore red shirts reading “Jews say stop arming Israel” and held up banners as they chanted “Bring Mahmoud home now!” on the lower level of the Fifth Avenue building’s public atrium.\n\nAfter warning the protesters to leave, police said they arrested 98 people who stayed on various charges, including trespassing, obstruction and resisting arrest.\n\nKhalil, a 30-year-old permanent U.S. resident who is married to an American citizen and who has not been charged with breaking any laws, was arrested outside his New York City apartment Saturdayand faces deportation. He is being held at an immigration detention center in Louisiana.\n\nPresident Donald Trump has said Khalil’s arrest was the first “of many to come” and vowed on social media to deport students who he said engage in “pro-terrorist, anti-Semitic, anti-American activity.” The White House did not immediately respond to a message seeking comment about the Trump Tower demonstration.\n\nAmong those who took part in Thursday’s protest was actor Debra Winger, who was not arrested. She accused the Trump administration of having “no interest in Jewish safety” and “co-opting antisemitism.”\n\n▶ Stay up to date with the latest U.S. news by signing up to our WhatsApp channel.\n\n“I’m just standing up for my rights, and I’m standing up for Mahmoud Khalil, who has been abducted illegally and taken to an undisclosed location,” Winger told The Associated Press, referring to how Khalil’s attorney didn’t know his whereabouts immediately following his arrest. “Does that sound like America to you?”\n\nFounded in 1996, Jewish Voice for Peace describes itself as a grassroots movement of American Jews seeking to “end U.S. support for Israel’s oppression of Palestinians.” It is one ofa number of Jewish groupsaround the world advocating for the rights of Palestinians.\n\nProtester Sophie Edelhart, a Barnard graduate who studies Yiddish as part of a PhD program in Canada, said the building — with its golden escalatorthat Trump rodebefore announcing his 2016 presidential run — was a symbolic target.\n\nNew York Police officers arrest a demonstrator from the group, Jewish Voice for Peace, who protested inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura)\n\nTrump Tower serves as headquarters for the Trump Organization and is where the president stays when he is in New York. The skyscraper often attracts demonstrations, both against and in support of its namesake, though protests inside are less common. The multi-story atrium is accessible to the public and connects visitors to eateries including the Trump Grill.\n\nKhalil’s supporters say his arrest is an attack on free speech and have staged protests elsewhere in the city and around the country, including outside a Manhattan courthouseduring a brief hearing on his caseWednesday.\n\nColumbia University was a focal point of the pro-Palestinianprotest movementthat swept across U.S. college campuses last year and led to more than 2,000 arrests.\n\nOn Thursday the school announced that itexpelled or suspendedsome students who took over a campus building during pro-Palestinian protests last spring. The Trump administration has said it is revoking at least $400 million in funding from programs affiliated with Columbia, including medical research grants, as punishment for not doing enough to curtail protest activity that the president considers antisemitic.\n\nAlso Thursday, lawyers for Khalil and other students identified by pseudonyms filed a lawsuit seeking to block a congressional committee from obtaining the disciplinary records of students at Columbia and Barnard College, a women’s institution affiliated with Columbia.\n\nKhalil, whose wife is pregnant with their first child, finished his requirements for a Columbia master’s degree in December.\n\nAssociated Press reporters Michael Hill in Albany and Michelle L. Price, Michael R. Sisak and Joseph B. Frederick contributed.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Reporting by Jasper Ward; Editing by Frank McGurty and Leslie Adler\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nJasper Ward is a breaking news reporter in Washington. She primarily covers national affairs and U.S. politics. Jasper was previously based in The Bahamas where she covered the collapse of FTX and the subsequent arrest of its founder Sam Bankman-Fried. She was a part of the Reuters team that won the Gerald Loeb Award for breaking news for its FTX coverage.",
        "source_3": "Protesters occupied the lobby of Trump Tower in Manhattan on Thursday, March 13, 2025, chanting in support of Mahmoud Khalil, the anti-Israel activist detained by ICE. (Credit: FNTV)\n\nAbout 150 protesters supporting Mahmoud Khalil occupied the lobby area ofTrump Toweron Manhattan's Fifth Avenue on Thursday, calling for the release of the anti-Israel activist who was detained over the weekend.\n\nThe protesters, many dressed in red, held signs reading \"Free Mahmoud, Free Palestine\" and \"Fight Nazis Not Students.\" The protesters were also chanting the common \"Free, free Palestine\" slogan.\n\nAfter occupying the lobby area – the same area where President Donald Trump launched his 2016 presidential campaign – the NYPD began detaining several of them and hauledmultiple demonstratorsout of the building in zip ties.\n\nDemonstrators from the group, Jewish Voice for Peace, protest inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, on Thursday, March 13, in New York City.(AP/Yuki Iwamura)\n\nCOLUMBIA ANTI-ISRAEL PROTEST RINGLEADER MAHMOUD KHALIL TO REMAIN DETAINED IN LOUISIANA\n\nNYPD Chief of Department John Chell said there were 98 people arrested in two hours with no issues. All of the protesters have since been removed.\n\nPolice were seen loading arrested protesters into a big NYPD van while the remaining detained protesters were put in an MTA bus outside Trump Tower.\n\nThere were no injuries, no incidents and no damage to property damage, Chell said. The protesters are charged with trespassing, obstructing governmental administration and resisting arrest.\n\nChell said they entered Trump Tower in regular clothing with protest gear underneath shortly after noon.\n\nThe Jewish Voice for Peace said it helped organize the protest. The group’s X account says its aim is to organize Jews \"toward Palestinian liberation and Judaism beyond Zionism.\"\n\nTRUMP ‘HOPES’ PUTIN AGREES TO CEASFIRE AS MOSCOW SIGNALS NO TRUCE YET\n\n\"As Jews, we are taking over the Trump Tower to register our mass refusal,\" the group wrote.\n\n\"We will not stand by as this fascist regime attempts to criminalize Palestinians and all those calling for an end to theIsraeli government’sUS-funded genocide of the Palestinian people. And we will never stop fighting for a free Palestine. If you come for one, you face us all. Free Mahmoud, free Palestine!\"\n\nRep. Marjorie Taylor Greene, R-Ga., took to X to share a concerning update: \"Protesters have OCCUPIED Trump TOWER in NYC chanting 'Free Mahmoud, Free them All!' I know the owner of that building and he will definitely be pressing charges. FAFO.\"\n\nNew York Police officers arrest a demonstrator from the group, Jewish Voice for Peace, who protested inside Trump Tower in support of Columbia graduate student Mahmoud Khalil on Thursday.(AP Photo/Yuki Iwamura))\n\nRep. Wesley Hunt, R-Texas, said \"the owner should press charges. We all know who that is!\"\n\nBarron Trump, the president's youngest son, lives in Trump Tower but it was unclear if he was in the building at the time of the protest.\n\nAmong the protesters was actor Debra Winger, who has discussed her Jewish faith and upbringing over the years,Fox 5 reported.\n\nWinger accused the Trump administration of having \"no interest in Jewish safety\" and \"co-opting antisemitism.\"\n\nA protestor from the group, Jewish Voice for Peace, who protested inside Trump Tower in support of Columbia graduate student Mahmoud Khalil is escorted out by New York Police officers after being arrested.(AP Photo/Yuki Iwamura)\n\n\"I’m just standing up for my rights, and I’m standing up for Mahmoud Khalil, who has been abducted illegally and taken to an undisclosed location,\" she told The Associated Press. \"Does that sound like America to you?\"\n\nICE agents arrested Khalil – one of the ringleaders ofanti-Israelprotests at Columbia University last year – at his university-owned apartment on the city’s Upper West Side on Saturday. Agents told him they were revoking his green card and student visa, according to Khalil's attorneys.\n\nDemonstrators from the group Jewish Voice for Peace are seen inside Trump Tower on Thursday, March 13.(AP/Yuki Iwamura)\n\nNEW YORK ASSEMBLYMAN TRIES TO CONFRONT TOM HOMAN OVER ARREST OF COLUMBIA UNIVERSITY ANTI-ISRAEL ACTIVIST\n\nProtests have erupted all week in Manhattan following Khalil's detainment. He is being held in Louisiana while a federal judge blocked the Trump administration's efforts to deport him before his case is heard.\n\nHis supporters say he is being held for exercising his free speech and for supporting Palestine, while the Trump White House says he is a U.S. national security risk and distributed pro-Hamas propaganda fliers on campus.\n\nKhalil, who is a Palestinian raised in Syria and apermanent U.S. resident, is married to an American citizen who is currently eight months pregnant.\n\nMain entrance to the Trump Tower building in Manhattan. (Photo by Erik McGregor/LightRocket via Getty Images)(Getty Images)\n\nThe protest on Thursday broke out at one of President Trump's signature buildings. Trump developed the 58-story skyscraper in the early 1980s and serves as the headquarters for the Trump Organization.\n\nIt houses several luxury residential condominiums, office spaces and retail establishments, as well as a penthouse residence belonging to the president.\n\nMichael Dorgan is a writer for Fox News Digital and Fox Business.\n\nYou can send tips to michael.dorgan@fox.com and follow him on Twitter @M_Dorgan.\n\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}