{
    "question": "How might adding a “self-deport” option to the rebranded CBP Home app affect migrants’ decision-making, government resource allocation, and the broader goals of U.S. immigration policy?",
    "content": {
        "source_1": "Kristi Noem, the DHS secretary, announced the new version, raising privacy concerns for those using CBP One\n\nOn day one of his presidency,Donald Trumpissued a directive abruptlyending the government’s use of CBP One– an online application that had served as the primary means for people at the southern border to apply for asylum in the US. On Monday, theadministrationannounced it has reimagined the app as a platform for “self-deportation”.\n\nKristi Noem, the secretary of Homeland Security, announced that the app had been rebranded as “CBP Home” and that anyone with the old CBP One app would be redirected to the new version.\n\n“The CBP Home app gives aliens the option to leave now and self-deport, so they may still have the opportunity to return legally in the future and live the American dream,” Noem said. “If they don’t, we will find them, we will deport them, and they will never return.”\n\nThe Department of Homeland Security (DHS) said that the app’s “self-deportation functionality is part of a larger $200m domestic and internationalad campaign” which they said it a way to encourage undocumented immigrants to ‘Stay Out and Leave Now’.”\n\nIt’s unclear who would actually use the new CBP Home app to “self-deport”. The phrase has long been used to describe the idea that life in the US can be made so unbearable for immigrants that they will choose to leave voluntarily.\n\n“Immigrant community members should be wary of any promises made by those encouraging them to ‘self-deport’ and instead carefully examine their legal options with trusted advisers,” said Laura Rivera, a senior staff attorney at Just Futures Law. “This move reflects Trump’s cynical strategy to flood the zone with messaging that creates fear among immigrant communities while currying favor with his base.”\n\nThe app’s relaunch also raises privacy concerns, Rivera said. Experts had long warned that the original CBP One app, which collected biometric data and photos, had allowed for a massive expansion of government databases of noncitizens’ photos and other biographic information.\n\nThe rebranding of the app “is also a chilling example of how easily tools like CBP One, which collected photos and other sensitive personal information, can be weaponized to surveil and punish”, Rivera said.\n\nIllegal aliens can self-deport the easy way.Or they can get deported the hard way.The good news is that the re-branded CPB Home app makes self-deporting simpler than ever. 👇pic.twitter.com/QN11ikB7Ck\n\nTrump had built his presidential campaign on a promise of “mass deportations” of undocumented immigrants. His administration has already moved to cancel several legal pathways for immigrants to enter the US, categorically banning asylum at the US borders, terminating private sponsorship programs that allowed Americans to financially support certain people seeking to immigrate and suspending the US’s refugee resettlement program.\n\nWhen the administration cancelled the CBP One app, about30,000 peoplewaiting in Mexico with scheduled appointments with US immigration officials lost them, and were left in limbo. The app wasinitiallylaunched by the Trump administration during Trump’s first term, as a way to arrange a number of immigration services.\n\nIn 2023, Joe Biden’s administration expanded the app’s use. Seeking to limit the arrival of asylum seekers at the border, Biden made it all but mandatory to use the app to schedule appointments to make a claim for asylum – and allowed just 1,450 appointments a day, even though thousands more were arriving at the border daily.\n\nHuman rights groups and immigration lawyers had criticized the app, pointing to glitches, language issues and racial biases in itsfacial recognitionfeatures. Forcing migrants to use the app and wait in Mexico for appointments with immigration officials had the effect of stranding vulnerable groups in Mexico and enriching organized crime groups, areport from Human Rights Watch(HRW) found. But Trump and his allies had characterized the app as too permissive, conversely – and falsely – claiming it fast-tracked entry into the US, and promised to end the system.",
        "source_2": "Dan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nThe Trump administration has relaunched theUnited States Border Patrol's app, now offering illegal immigrants the chance to notify the government they areself-deporting.\n\nPreviously known as CBP One underformer President Joe Biden, CBP Home is being touted by the administration as the safest way for those without legal status to leave the country.\n\nPresidentDonald Trumpreturned to the White House witha promise of deporting millions of illegal immigrants, following a spike in southwest border crossings over the past four years. Just six weeks into his second term, the President has reportedly been puttingincreasing pressure on authoritiesto ramp up deportations, hindered by a lack of resources and detention capacity.\n\nThe new CBP Home app replaced the former CBP One app on app stores Monday, just weeks after Trump pulled the original app after it had been used by migrants to schedule appointments with border agents along the U.S.-Mexico border under Biden.\n\nThose in the country illegally, or who have hadtheir parole revokedfollowing theending of certain protections, are being given the chance to tell theDepartment of Homeland Security(DHS) that they are self-deporting. DHS said this was a way immigrants could avoid \"harsher consequences,\" such as detention or expedited removal.\n\nA section of CBP Home reviewed byNewsweekshows options to submit an intent to depart, along with additional options for those who have lost parole to verify their departure and track their status with the U.S. government.\n\nSecretary of Homeland SecurityKristi Noemsaid those who voluntarily left the country could be given the chance to return legally later and \"live the American dream\". Currently, that would be difficult under U.S. immigration law, which can bar those who entered the country illegally from re-entry for anywhere from three years to life.\n\nThose who were in the U.S. on parole programs, such as Haitians and Venezuelans about those lost their protections, could return to their home countries and apply for a different visa — with no guarantee they will be approved. Approximately half a million people could see their legal status lapse in the coming weeks and months.\n\nDHS is also trying totrack all those in the U.S. without legal status, asking them to register with the U.S. Citizenship and Immigration Service (USCIS) to let authorities know they are in the country.\n\nWhile deportation numbers have been hard to come by since the start of the Trump administration, there have been multiple reports that the president has become frustrated at the pace of removals. His initial acting head of Immigration and Customs Enforcement (ICE), the agency responsible for deportations, was moved elsewhere last week, with new leadership announced over the weekend.\n\nPete Flores, Acting Commissioner, U.S Customs and Border Protection, in a press release:\"CBP Home App strengthens our mission to secure the U.S. border by ensuring lawful entry for travelers and supporting effective enforcement. The app provides illegal aliens in the United States with a straightforward way to declare their intent to voluntarily depart, offering them the chance to leave before facing harsher consequences. This reinforces our commitment to enforcing U.S. laws and safeguarding national security.\"\n\nSecretary of Homeland Security, Kristi Noem, in a press release: \"The Biden Administration exploited the CBP One app to allow more than 1 million aliens to illegally enter the United States. With the launching of the CBP Home app, we are restoring integrity to our immigration system. The CBP Home app gives aliens the option to leave now and self-deport, so they may still have the opportunity to return legally in the future and live the American dream. If they don't, we will find them, we will deport them, and they will never return.\"\n\nThe old CBP One app will update to become CBP Home, DHS said. It is not clear how those who did not have parole will be tracked at this time.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security.                                    ...Read more",
        "source_3": "The Trump administration has unveiled a new initiative to streamline the voluntary deportation process with the relaunch of the Biden-era CBP Home app. This digital tool will now allow illegal immigrants to initiate their deportation process voluntarily. The app is designed to simplify the procedure and provide illegal aliens with a more efficient, self-directed way to leave the United States without facing enforcement actions.\n\nOn Monday, the Trump administration announced it would replace the former CBP One app, which allowed undocumented immigrants to schedule asylum appointments at ports of entry. However, the repurposed app will now include an “Intent to Depart” feature. This will enable individuals to notify the government of their decision to leave the U.S. Undocumented immigrants will provide their biographical information, including their country of citizenship, the country they plan to return to, their alien registration number, and their contact information. They will also be required to upload photos of themselves to verify their identity.\n\nOn his first day in office, President Donald Trump shut down the CBP One app and canceled all pending appointments.\n\nDepartment of Homeland Security Kristi Noem said the option to self-deport gives illegal immigrants to one day return to the U.S. and live the American Dreamlegally.\n\n“If they don’t, we will find them, we will deport them, and they will never return,” Noem said. “The Biden administration exploited the CBP One app to allow more than one million aliens to enter the United States. With the launching of the CBP Home app, we are restoring integrity to our immigration system.”\n\nIt is also more cost-effective for the United States when illegal immigrants voluntarily depart, allowing Immigration and Customs Enforcement (ICE) to allocate resources to other priorities.\n\nNoem previously halted the use of CBP One for allowing illegal immigrants to board domestic flights, except when it's being used for self-deportation. Additionally, undocumented individuals from certain countries are no longer permitted to apply for extensions of Temporary Protected Status."
    }
}