{
    "question": "What does the rapid escalation and subsequent suspension of Ontario’s 25% electricity export surcharge, alongside the U.S. backing off higher metal tariffs, suggest about the effectiveness and potential consequences of using targeted tariffs as leverage between the two sides?",
    "content": {
        "source_1": "The state’s biggest utilities and the regional grid operator say they use very little power from Ontario, which imposed the charge in response to President Donald Trump’s trade war.\n\nOntario’ssharp new tax on electricity exported to the U.S.is expected to have little to no impact on Minnesota or the bills of its electric customers.\n\nIt has been widely reported that the large Canadian province provides electricity to Minnesota, along with Michigan and New York.\n\nBut Minnesota’s biggest utilities and officials for the regional electric grid operator say they use very little power from Ontario, which imposed the 25% charge on Monday in response to President Donald Trump’s escalating trade war.\n\nMinnesota Gov. Tim Walz on Monday shared a story about the Ontario charge in posts on social media, saying that “Minnesotans struggling to pay their skyrocketing electric bill” would be “the first victims of Trump’s trade war.”\n\nMinnesota’s power companies do not predict major bill impacts from the Ontario tariff, however.\n\nMinnesota’s largest electric utility, Minneapolis-based Xcel Energy, said it does not import electricity or natural gas directly from Ontario. The company does source some electricity from nearby Manitoba and gas from Alberta.\n\nGreat River Energy, a nonprofit that supplies electricity to rural electric cooperatives throughout the state, says it has no contracts to buy electricity from Ontario. The same is true for Fergus Falls-based Otter Tail Power.\n\n“Based on what we know today, the tariffs will not have a direct impact on Otter Tail Power’s electric customers,” said spokeswoman Stephanie Hoff.\n\nDuluth-based Minnesota Power is connected to the Ontario grid by a transmission line into Canada, spokeswoman Amy Rutledge said. The utility buys only a sliver of its power from Ontario.\n\nThe company purchased about $310,000 worth of electricity from Ontario’s grid in 2024, according to filings with state regulators. By comparison, Minnesota Power spent around $108 million to buy electricity from Manitoba Hydro last year.\n\nWhat remains unclear — and could have a bigger impact — is how a 10% U.S. tariff imposed by Trump on Canadian energy will affect Minnesota.\n\nIt’s unknown if U.S. import tariffs actually apply to electricity, however, said officials with the 15-state regional grid that includes Minnesota, known as the Midcontinent Independent System Operator (MISO). Three oil refineries that provide much of Minnesota’s gasolineget most of their crude from Canada, and the state also imports natural gas from Canada.\n\n“The Ontario thing is a symptom, not the broader disease,” said Pete Wyckoff, a deputy commissioner for Walz’s Department of Commerce who oversees energy issues. “In a broader trade war with Canada that includes energy, Minnesota would be a huge loser because of our dependencies.”\n\nWalz also told reporters on Monday that he was worried about the impact on Minnesota if Manitoba followed suit, but that Ontario tariffs hitting even a small amount of power “was totally unnecessary” and caused by Trump’s trade war.\n\n“It doesn’t impact Donald Trump one bit, it impacts ratepayers in Minnesota,” Walz said. “For what? These are our friends.”\n\nMinnesota Power has a lengthy contract with Manitoba Hydro, which supplies about 11% of the Duluth utility’s electricity. Minnesota Power and Manitoba Hydro built a $700 million, 224-mile power line that was energized in 2020.\n\n“We definitely are monitoring this, we definitely are keeping a close eye on it,” Rutledge said. “But we do want our customers to be assured that we don’t expect this to impact our ability to provide reliable service and, the Ontario surcharge, we expect that to be a negligible impact.”\n\nLess than 1% of MISO’s total energy in 2024 came from Canada. MISO spokesman Brandon Morris said less than half of that came from Ontario, which is not a member of the regional grid but sends power to it.\n\nHe compared it to the output of one power plant, and said the grid manages the temporary loss of power plants every day while maintaining a reliable system.\n\nOn Monday, Morris said MISO is still reviewing Ontario’s export tax on electricity, but said it would be collected on the Canadian side of the border.\n\nIf there are any increases on customer bills as a result of the Ontario action, it would likely take time to sort out in front of state regulators.\n\nElectric rates are complicated and depend on many factors, including the price of fuel. A five-member commission appointed by Walz oversees rates for customers of Minnesota’s three investor-owned utilities: Otter Tail, Minnesota Power and Xcel.\n\nXcel hasasked the Public Utilities Commission to approve a 9.6% increase in 2025 and another 3.6% jump in 2026. The company says average monthly bills for residential customers are below national and state averages.\n\nKristoffer Tigue of the Minnesota Star Tribune contributed to this story.\n\nWalker Orensteincovers energy, natural resources and sustainability for the Star Tribune. Before that, he was a reporter at MinnPost and at news outlets in Washington state.\n\nRepublican lawmakers criticize Canada’s forest management. Manitoba premier calls it a “timber tantrum.”\n\nA four-hour wait to shut off power to a burning utility pole was one of the last straws for Slayton.\n\nCuts to staffing and programs nationwide mean volunteers are needed more than ever.\n\nRepublican lawmakers criticize Canada’s forest management. Manitoba premier calls it a “timber tantrum.”",
        "source_2": "Shane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nU.S. PresidentDonald Trumpretaliated against Canada over its tariff on American electricity imports and said he would put an additional 25 percent tariff on steel and aluminum, taking it up to 50 percent, as a result.\n\nIn a post on his Truth Social platform, Trump said he had instructed Secretary of Commerce Howard Lutnick to implement the new steel and aluminum tariffs on Canada effective March 12.\n\nThe tariffs are part of an escalating trade war between the U.S. and Canada.\n\nThe president started the latest conflict over what his administration perceives as a lack of sufficient action to stop the flow of illicit drugs such as fentanyl across America's borders, fueling an opioid epidemic that has cost thousands of lives through overdoses.\n\nTrump has also put new tariffs on Mexico and China for the same reason, and his administration says it will introduce reciprocal tariffs—these aimed at creating what it sees as fairness in all its trading relationships—across the world on April 2.\n\nThis burgeoning trade war is unsettling markets, which fear that a North American recession is looming as a result.\n\nBut Trump sees tariffs as a powerful tool to either protect the domestic economy from unfair global competition, or to force much better trading terms for the U.S. from those who, in his view, are taking advantage at the expense of American firms and consumers.\n\nOn Monday, Ontario Premier DougFordannounced the 25 percent surchargeon electricity sales to Michigan, Minnesota and New York in response to Trump's new tariffs on Canadian goods.\n\nFord estimatedthat his new surcharge would cost \"families and businesses in these states up to $400,000 each and every single day.\"\n\nAccording to the Narwhal, a nonprofit Canadian media outlet, Ontario sells about $700 million in electricity to the United States each year, which provides power for 1.5 million homes.\n\nIn his Truth Social post, Trump told Canada to \"immediately drop their Anti-American Farmer Tariff of 250% to 390% on various U.S. dairy products, which has long been considered outrageous.\"\n\nThe president said he would declare a national emergency on electricity in the area affected by Canada's tariff, describing it as an \"abusive threat.\"\n\nHe said more tariffs would come for Canada unless they dropped their own against America.\n\n\"If other egregious, long time Tariffs are not likewise dropped by Canada, I will substantially increase, on April 2nd, the Tariffs on Cars coming into the U.S. which will, essentially, permanently shut down the automobile manufacturing business in Canada,\" Trump wrote. \"Those cars can easily be made in the USA!\"\n\nTrump said the U.S. was \"subsidizing\" Canada to the tune of $200 billion a year and said the only thing that made sense was for it to become America's \"cherished\" fifty-first state.\n\nIt's a suggestion he has made several times in recent months to both the amusement and frustration of Canadians.\n\n\"The artificial line of separation drawn many years ago will finally disappear, and we will have the safest and most beautiful Nation anywhere in the World — And your brilliant anthem, 'O Canada,' will continue to play, but now representing a GREAT and POWERFUL STATE within the greatest Nation that the World has ever seen!\" Trump wrote on Truth Social.\n\nOntario Premier Doug Ford told reporters on Monday: \"We will apply maximum pressure to maximize our leverage ... Let me be clear: I will not hesitate to increase this charge if necessary. If the United States escalates, I will not hesitate to shut the electricity off completely. Believe me when I say I do not want to do this. I feel terrible for the American people because it's not the American people who started this trade war. It's one person who is responsible, that's President Trump.\"\n\nGerard Lyons, chief economic strategist at Netwealth, said of the recent market turmoil:\"When Trump was elected it was clear that his economic policies contained the good, the bad and the uncertain. The markets initially focused on the good—in terms of his tax and regulatory changes for the US economy. Now the focus is on the bad—namely tariffs. The uncertainty around the execution of these adds to the uncertainty. Tariffs can have a triple whammy, adding to worries about inflation, growth and denting confidence.\"\n\nThe latest tariff hike on Canadian steel and aluminum starts March 12. Canada's Ford has said he would respond again to any escalation, so watch this space. Then, coming April 2, we have the big one—America's reciprocal tariffs all around the world.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check                                    ...Read more",
        "source_3": "The leader of Canada’s most populous province hasfollowed through on a pledgeto hike electricity prices for Americans in response to President Trump’s tariffs as residents of US border states New York, Minnesota and Michigan can expect to pay more for power.\n\nThe Canadian province of Ontarioraised electricity export prices by 25%for the three American states on Monday — marking a direct response to theescalating trade dispute between the two countries.\n\nOntario Premier Doug Ford ordered the Independent Electricity System Operator, which oversees the province’s electricity market, to implement a $7-per-megawatt-per-hour fee on all power exports to the three states,Bloomberg News reported.\n\nThe decision follows through on a promise Ford made last week when the US tariffs on Canadian goods went into effect.\n\n“Believe me when I say I don’t want to do this. I feel terrible for the American people,” Ford said.\n\n“It’s one person who is responsible. That’sPresident Donald Trump.”\n\nThe White House recently agreed to exempt cars and select goods from the tariffs under existing trade agreements, but Ontario proceeded with the price increase as planned.\n\nFord’s government emphasized that revenue generated from the surcharge — potentially as much as $276,000 per day — would be reinvested to support workers, families and businesses within the province.\n\nCanada’s foreign affairs minister, Melanie Joly, welcomed the move as a strategic use of provincial resources.\n\n“If the premiers use levers that are to our advantage, good news,” she told reporters on Monday.\n\nDespite the aggressive stance, the actual impact on US consumers may be minimal.\n\nElectricity prices on US spot markets, where power is bought and sold in real-time, fluctuate based on supply and demand.\n\nWith multiple sources available, American buyers are not obligated to purchase from Ontario, meaning they may be able to source cheaper electricity from alternative suppliers.\n\nNew York imported about 4.4% of its total electricity from Canada in 2023, according to Bloomberg calculations using data from the state’s grid operator.\n\nMinnesota and Michigan relied on Canadian imports even less, according to the Midcontinent Independent System Operator (MISO), which manages the power grid across much of the Midwest.\n\n“In 2024, less than 1% of MISO’s total energy was supplied via Canadian imports and less than half of that came from Ontario,” MISO spokesperson Brandon Morris said in an email to Bloomberg News.\n\n“For context, that amount is equivalent to approximately one power plant. MISO manages the loss of power plants like this every day to ensure reliability across our footprint.”\n\nOntario has several key transmission links to the United States, including seven connections with New York, four with Michigan and one with Minnesota.\n\nHowever, the modest scale of Canadian imports in the three states means that while the price increase sends a political message, its practical impact on electricity consumers in the US may be limited.\n\nThe retaliatory move underscores the broader tensions between Canada and the United States as Trump’s tariff policies continue to reshape trade relations.\n\nThe Post has sought comment from the White House and the New York Power Authority."
    }
}