{
    "question": "What are the potential national security, legal, and political implications of DNI Tulsi Gabbard revoking security clearances for multiple Biden-era officials and intelligence workers?",
    "content": {
        "source_1": "Director of National Intelligence Tulsi Gabbard announced Monday a security clearance review that resulted in the revocations of security clearances for dozens of current and former officials.\n\nGabbard said in a social media post that the security clearance purge targeted top aides to former President Joe Biden, former intelligence personnel who called a 2020 effort to expose information from Hunter Biden's laptop \"disinformation,\" and some who were involved in legal cases against President Trump.\n\n\"I have revoked security clearances and barred access to classified information for Antony Blinken, Jake Sullivan, Lisa Monaco, Mark Zaid, Norman Eisen, Letitia James, Alvin Bragg, and Andrew Weissman, along with the 51 signers of the Hunter Biden 'disinformation' letter,\" Gabbard wrote. \"The President's Daily Brief is no longer being provided to former President Biden.\"\n\nThe revocations are the latest in a campaign that began shortly after Mr. Trump's Jan. 20 inauguration to punish and cut off access to a broad swath of people who the president alleges \"weaponized\" the nation's court systems against him.\n\nThis effort has included revocations of security clearance for staff at law firms that contracted with former special counsel Jack Smith and others who advocated for cases against Mr. Trump, such as attorneyAndrew Weissmann— who was part of the team led by Robert Mueller that investigated alleged Russian interference in the 2016 election — and Mark Zaid, an attorney who previously represented a whistleblower connected to Mr. Trump's first impeachment.\n\nZaid directed a social media post at Gabbard after her announcement.\n\n\"Hmmm, so where are my due process protections? You are familiar with Executive Order 12,968, are you not? Still in effect!\" Zaid said, referring to a 1995 presidential order establishing a security program for federal employees who work with classified information.\n\nA spokesperson for New York Attorney General Letitia James pointed to CBS News to a statement released more than a month ago, when Mr. Trump first announced his plans to claw back security clearances.\n\n\"What security clearance?\" the spokesperson asked. \"Anyway, this is just another attempt to distract from the real work the Attorney General is doing to defend the rights of New Yorkers and all Americans.\"\n\nJames's office took Mr. Trump to court in 2023, securing a civil judgment that found him liable for fraud and required him to pay nearly half a billion to New York State. Mr. Trump has appealed the judgment.\n\nIn the weeks since Mr. Trump's return to office, James and other Democratic state attorneys general have filed a steady stream of lawsuits challenging a litany of Mr. Trump's executive orders and policies.\n\nGraham Kates is an investigative reporter covering criminal justice, privacy issues and information security for CBS News Digital. Contact Graham at KatesG@cbsnews.com or grahamkates@protonmail.com",
        "source_2": "Gabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nDirector of National IntelligenceTulsi Gabbardannounced on Monday that her office has revoted revoked security clearances and barred access to classified information for Manhattan District AttorneyAlvin Braggand New York Attorney General Letitia James, among others.\n\nGabbard said in a post on X, formerlyTwitter, \"Per@POTUSdirective, I have revoked security clearances and barred access to classified information forAntony Blinken,Jake Sullivan, Lisa Monaco, Mark Zaid, Norman Eisen, Letitia James, Alvin Bragg, and Andrew Weissman, along with the 51 signers of theHunter Biden'disinformation' letter. The President's Daily Brief is no longer being provided to former President Biden.\"\n\n​Since resuming office on January 20, 2025, PresidentDonald Trumphas undertaken a series of actions to revoke security clearances from individuals he perceives as political adversaries. Notably, on January 21, he rescinded clearances for 50 former intelligence officials who had previously suggested that reports about Hunter Biden's laptop bore \"the classic earmarks of a Russian information operation.\" This group included former National Security AdvisorJohn Bolton, ex-Director of National Intelligence James Clapper, and formerCIADirectors John Brennan and Leon Panetta.\n\nBothDemocrats, Bragg and James, serving as Manhattan District Attorney and New York Attorney General, respectively, have pursued investigations and charges against Trump and his business entities.​\n\nBragg assumed office as Manhattan District Attorney on January 1, 2022. His tenure has included the prosecution of high-profile cases, notably involving figures associated with Trump. For instance, in September 2022, Bragg's office indicted Trump allySteve Bannonon charges related to defrauding donors in a border wall fundraising campaign, a case previously addressed at the federal level.\n\nIn May 2024, in a case prosecuted by Bragg, a New York jury found Trump,guilty on 34 counts of falsifying business recordsrelated to hush money paid to adult film actressStormy Danielsshortly before his first presidential election in 2016. Daniels alleges she had a sexual encounter with Trump in 2006, which he denies.\n\nJames, elected as New York Attorney General in 2018, has been a prominent figure in legal actions against Trump.\n\n​In February 2024, James secured a significant legal victory against Trump and his company. JudgeArthur Engoronruled that Trump and his organization had committed financial fraud by inflating asset values to secure favorable loans and insurance terms. Consequently, Trump was ordered to pay a $355 million penalty and was barred from operating any business in New York for three years. His sons, Donald Jr. andEric Trump, were fined $4 million each and prohibited from serving as officers or directors of any New York firm for two years. ​\n\nIn March 2024, the bond was reducedfrom $464 million to $175 million and stayed the bans imposed by Judge Engoron. Trump posted the bond in early April 2024, effectively delaying the enforcement of the penalties pending the outcome of his appeal.\n\nIn addition, James joined a lawsuitlast month that led to a preliminary injunction preventing members ofElon Musk's Department of Government Efficiency (DOGE) from accessing the Treasury Department's central payment system.\n\nIn response to these legal challenges, Trump has characterized the actions of Bragg and James as politically motivated.\n\nNewsweekhas reached out to the offices of Bragg and James via email on Monday afternoon for comment.\n\nReacting to last month's DOGE ruling on X, Jameswrote: \"We just won a court order stopping DOGE and unauthorized, unelected, and unvetted individuals like Elon Musk from accessing people's private data and blocking federal funds. We will keep fighting to protect all Americans from this administration's destruction.\"\n\nChris Coffey, CEO of political strategy firm Tusk Strategies, told Politico in an article published January 14,\"I'm sure there are plenty of Upper West Siders who cheer [Bragg] on for maintaining the rule of law,\" referring to Trump's hush money conviction.\n\n\"I think there are other folks who would say: Hey, shouldn't our focus be making sure the city is safe? During times when folks feel public safety is the No. 1 concern, I think you see elected officials become more moderate,\" he added.\n\nLess than two weeks before his January inauguration, the judge presiding over the case,Juan Merchangave him an unconditional discharge, meaning that he would not be punished with prison time, fines or community service.\n\nJames has joined a lawsuitto stop the Trump administration fromfiring thousands of probationary federal workers.\n\nThis is a developing news story and will be updated as more information is available.\n\nUpdate: 3/10/25, 6:26 p.m. ET: This article has been updated with additional information.\n\nUpdate: 3/10/25, 7:52 p.m. ET: This article has been updated with additional information.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he                                    ...Read more",
        "source_3": "By signing up to our newsletters you agree to the Just the NewsTerms of ServiceandPrivacy Policy\n\n\"I have revoked security clearances and barred access to classified information for ... Blinken, Jake Sullivan ... along with the 51 signers of the Hunter Biden 'disinformation' letter,\" Gabbard posted on X.\n\nDirector of National Intelligence Tulsi Gabbard on Monday announced that she revoked security clearances for several prominent members of former President Joe Biden's administration, including former Secretary of State Antony Blinken.\n\nGabbard cited a directive from President Donald Trump, which also included people who helped target him through criminal cases such as Manhattan District Attorney Alvin Bragg, and New York Attorney General Letitia James. Bragg led the hush money case.\n\n\"I have revoked security clearances and barred access to classified information for ... Blinken, Jake Sullivan, Lisa Monaco, Mark Zaid, Norman Eisen, James, Bragg, and Andrew Weissman, along with the 51 signers of the Hunter Biden 'disinformation' letter,\" Gabbardposted on X. \"The President's Daily Brief is no longer being provided to former President Biden.\"\n\nMisty Severi is a news reporter for Just The News. You canfollow her on Xfor more coverage."
    }
}