{
    "question": "In what ways could Manus AI’s claimed full autonomy shape labor markets, privacy norms, and AI governance, and what evidence should observers prioritize to judge the reality of its capabilities?",
    "content": {
        "source_1": "Chinese AI researchers say they've created the world's first fully autonomous AI agent — but others aren't convinced that its capabilities make it another \"DeepSeek moment.\"\n\nThe agent, called Manus, launched last week and quickly became a hot topic in AI circles.\n\nIts viral launch demo sparked a wave of online discussion, with some praising its capabilities and others pointing out its flaws, along with raising concerns about privacy.\n\nManus was built by the Chinese startup Monica, according to multiple reports, which appears to be a subsidiary of Butterfly Effect. Manus' privacy policy states that Butterfly Effect is a Singapore-registered entity.\n\nUnlike most traditional chatbots, which can require multiple human commands to complete tasks, Monica claims Manus can handle complex tasks independently from start to finish with just an initial user prompt.\n\nIts launch video appears to show Manus AI sorting résumés, ranking candidates, and formatting data into spreadsheets in seconds.\n\n\"This isn't just another chatbot or workflow tool,\" Yichao 'Peak' Ji, the cofounder of Manus, said in the Wednesday video. \"It's a completely autonomous agent that bridges the gap between conception and execution.\"\n\nThe company says Manus can analyze stock trends, scrape data from the web, and even generate interactive websites from scratch. It runs in the cloud, meaning it keeps working even when users log out.\n\nAccording to Manus' website, it outperforms OpenAI's Deep Research model on the GAIA benchmark, a tool for comparing models.\n\nFor now, access to Manus is limited, requiring an invite to test.\n\nFollowing its launch, some early users suggested Manus wasn't built from scratch and that it's more of an AI wrapper running on other models like Anthropic's Claude 3.5 Sonnet.\n\nPierre-Carl Langlais, the cofounder of AI startup Pleias and early Manus user, said in a Sunday LinkedIn post that Manus used token conventions that are \"completely specific to Anthropic and not used by any other\" large language models, or LLMs.\n\nWhile the launch video hinted at multiple distinct models powering Manus, Ji later clarified that it currently uses Claude 3.5 Sonnet v1 and fine-tuned Alibaba's Qwen models.\n\n\"We use Claude and different Qwen-finetunes,\" Ji posted onXMonday. \"Back when we started building Manus, we only got Claude 3.5 Sonnet v1 (not long-CoT, aka reasoning tokens), so we need a lot of auxiliary models. Now Claude 3.7 looks really promising, we are testing internally, will post updates!\"\n\nSome have drawn comparisons between Manus andDeepSeek, the Chinese startup that in January unveiled an AI model with capabilities rivalling Western competitors despite appearing to be built at a fraction of the cost.\n\nThe launch spooked investors, triggering a $600 billion sell-off in Nvidia stock.\n\nIt also showed that China was capable of building leading AI models despite US export controls limiting its access to advanced chips, causing some to call it China's \"Sputnik moment.\"\n\nNow, Manus is stepping into the spotlight with claims of full autonomy — adding to the narrative that China is closing the gap with the US in the AI race.\n\nDean Ball, an AI policy researcher, said in a Sunday X post that it's \"wrong to call Manus a 'DeepSeek moment'\" — because it goes even further.\n\n\"DeepSeek was about replicating capabilities already achieved by American firms,\" Ball said. \"Manus is actually advancing the frontier. The most sophisticated computer using AI now comes from a Chinese startup, full stop.\"\n\nAI researchers and founders are split about Manus' capabilities and what it means for the industry.\n\nHugging Face'shead of product, Victor Mustar, called Manus \"the most impressive AI tool I've ever tried,\" adding that its agentic capabilities \"redefine what's possible.\" In a post on X, he suggested the tool could eliminate the need for coding as we know it. \"This could killvibe coding... It's more like ideas vibing or name it however you want.\"\n\nNot everyone is convinced. TechCrunch's Kyle Wiggers and Pleias cofounder Alexander Doria said they found Manus prone to factual errors, execution failures, and endless loops during tests.Langlais had mixed reactions after testing it. \"Overall, the product itself is not bad, especially on the UI side, giving the possibility to go back and forth checking whatever Manus is doing,\" he wrote onLinkedIn.\n\nBut he called out the \"deceptive communication\" around Manus and what he described as \"hunger marketing\" tactics — manufacturing hype by limiting access to select influencers.\n\n\"What the AI market really needs now is better standards of openness and transparency. At every level: model, data, business,\" Langlais said.\n\nOne thing that Manus does share in common with DeepSeek is concerns aboutdata privacy.\n\nAI researcher Luiza Jarovsky raised concerns about where Manus stores its data and whether Chinese authorities have access — something that's being fuelled by Manus' opaque ownership.\n\n\"Where are the servers located? Is user data transferred to China?\" Jarovsky asked in a Substack post.Mel Morris, CEO ofCorpora.ai, sees promise in Manus but isn't convinced it's a major breakthrough — and points to data privacy concerns due to its ties to China.\n\n\"These factors will only intensify the ongoing debate over AI security and governance.\"\n\nA spokesperson for Manus did not immediately respond to a Business Insider request for comment.",
        "source_2": "One recent evening in Shenzhen, a group of software engineers gathered in a dimly lit co-working space, furiously typing as they monitored the performance of a new AI system. The air was electric, thick with the hum of servers and the glow of high-resolution monitors. They were testingManus, a revolutionary AI agent capable of independent thought and action. Within hours, its March 6 launch would send shockwaves through the global AI community, reigniting a debate that had simmered for decades: What happens when artificial intelligence stops asking for permission and starts making its own decisions?\n\nManus is not just another chatbot, nor is it merely an improved search engine dressed in futuristic branding. It is the world’s first fully autonomous AI agent, a system that doesn’t just assist humans — it replaces them. From analyzing financial transactions to screening job candidates, Manus navigates the digital world without oversight, making decisions with a speed and precision that even the most seasoned professionals struggle to match. In essence, it is a digital polymath trained to manage tasks across industries without the inefficiencies of human hesitation.\n\nBut how did China, often perceived as trailing the U.S. in foundational AI research, produce something that Silicon Valley had only theorized about? And more importantly, what does it mean for the balance of power in artificial intelligence?\n\nIn late 2024, the release of DeepSeek V3, a Chinese AI model designed to rival OpenAI’s GPT-4, stunned those paying attention. But it was the January release of its R1 reasoning model, which bested OpenAI’s reasoning models GPT-o1 and GPT-o3, that was described as China’s “Sputnik moment” for AI. It was the first tangible sign that the country’s researchers were closing the gap in large language model capabilities.\n\nBut Manus represents something entirely different — it is not just another model. It is anautonomousagent, an AI system that thinks, plans and executes tasks independently, capable of navigating the real world as seamlessly as a human intern with an unlimited attention span.\n\nManus is unique in its ability to deliver end-to-end results across diverse domains without human prompts. While most other AI systems still require some level of human input or operate within narrower scopes, Manus acts independently, offering a seamless, self-directed experience.\n\nAutonomous agents already exist in narrow domains - think trading bots - but Manus’ multi-agent architecture enhances its ability to manage complex workflows by deploying specialized sub-agents for various tasks—a feature not yet standard in most autonomous AI systems. Moreover, unlike other agents that focus on niche industries such as trading or logistics, Manus demonstrates true general-purpose versatility, effortlessly generating research papers, designing marketing campaigns, or even building entire websites from scratch.\n\nManus uses a multi-agent architecture where a central “executor” agent coordinates with specialized sub-agents—such as planners and knowledge agents—to break down and complete complex tasks. It’s not a model, but an assemblage of models currently built on top of Anthropic’s Claude 3.5 Sonnet model and refined versions of Alibaba’s Qwen models. It integrates with 29 tools and open-source software, enabling it to browse the web, interact with APIs, run scripts, and even develop software independently. Of course agents like OpenAI’s Operator can take actions, but they work through the user’s browser. Manus works in a virtual compute environment in the cloud, so users can shut down their computer after giving it a goal while it continues working in the background, notifying them upon completion.\n\nThis is what sets Manus apart from its Western counterparts. While ChatGPT-4 and Google’s Gemini rely on human prompts to guide them, Manus doesn’t wait for instructions. Instead, it is designed to initiate tasks on its own, assess new information and dynamically adjust its approach. It is, in many ways, the first true general AI agent.\n\nFor instance, given a zip file of resumes, Manus doesn’t just rank candidates; it reads through each one, extracts relevant skills, cross-references them with job market trends and presents a fully optimized hiring decision — complete with an Excel sheet it generated on its own. When given a vague command like “find me an apartment in San Francisco,” it goes beyond listing search results — it considers crime statistics, rental trends, even weather patterns and delivers a shortlist of properties tailored to the user’s unstated preferences.\n\nManus is currently available to testers by invitation only. Some early users have reported issues suggesting that the product needs some refinement. But Manus will undoubtedly improve the system before general availabiltiy.\n\nTo understand Manus, imagine an invisible assistant who can use a computer just like you do — opening browser tabs, filling out forms, writing emails, coding software and making real-time decisions. Except unlike you, it never gets tired.\n\nThe key to its power lies in itsmulti-agent architecture.Rather than relying on a single neural network, Manus operates like an executive overseeing a team of specialized sub-agents. When assigned a complex task, it divides the problem into manageable components, assigns them to the appropriate agents and monitors their progress. This structure enables it to tackle multi-step workflows that previously required multiple AI tools stitched together manually.\n\nItscloud-based asynchronous operationis another game-changer. Traditional AI assistants need a user’s active engagement — Manus does not. It runs its tasks in the background, pinging users only when results are ready, much like a hyper-efficient employee who never requires micromanagement.\n\nAt first, the implications seem thrilling. The automation of repetitive work has long been heralded as a net positive. But Manus signals something new — a transition from AI as an assistant to AI as an independent actor.\n\nConsiderRowan Cheung, a tech writer who tested Manus by asking it to write a biography of himself and build a personal website. Within minutes, the agent had scraped social media, extracted professional highlights, generated a neatly formatted biography, coded a functional website and deployed it online. It even troubleshot hosting issues — without ever asking for additional input.\n\nFor AI developers, this is the Holy Grail — a system that doesn’t just generate information, but applies it, fixes its mistakes and refines its output. For professionals who rely on tasks Manus can perform, it is an existential threat.\n\nFor years, the dominant AI narrative has centered around large U.S. tech firms — OpenAI, Google, Meta — developing more powerful versions of their language models. The assumption was that whoever built the most sophisticated chatbot would control the future of AI. Manus disrupts that assumption.\n\nIt is not just an improvement on existing AI — it is a new category of intelligence, shifting the focus from passive assistance to self-directed action. And it is entirely Chinese-built.\n\nThis has triggered a wave of unease in Silicon Valley, where AI leaders have quietly acknowledged that China’s aggressive push into autonomous systems could give it a first-mover advantage in critical sectors. The fear is that Manus represents the industrialization of intelligence — a system so efficient that companies will soon find themselves forced to replace human labor with AI not out of preference, but necessity.\n\nYet Manus also raises profound ethical and regulatory questions. What happens when an AI agent makes a financial decision that costs a company millions? Or when it executes a command incorrectly, leading to real-world consequences? Who is responsible when an autonomous system, trained to act without oversight, makes the wrong call?\n\nChinese regulators, historically more willing to experiment with AI deployment, have yet to outline clear guardrails for AI autonomy. Meanwhile, Western regulators face an even greater challenge: their framework assumes AI requires human supervision. Manus breaks that assumption.\n\nFor now, the biggest question isn’t whether Manus is real — the evidence is overwhelming. The question is how quickly the rest of the world will catch up. The era of autonomous AI agents has begun, and China is leading the charge. The rest of us may need to rethink what it means to work, create and compete in a world where intelligence is no longer a uniquely human asset.",
        "source_3": "In the wake of Deepseek, another Chinese disruptor emerges\n\nA version of this story appeared in the dailyThreat Statusnewsletter from The Washington Times.Click hereto receive Threat Status delivered directly to your inbox each weekday.\n\nManus, the new artificial intelligence tool from China, is disrupting the global tech race with a new AI agent that some analysts believe is far more powerful than the competition.\n\nManus AI cofounder Yichao “Peak” Ji said in a video preview of his team’s new tool that it is the “first general AI agent.”\n\nHe said Manus gives a window into artificial general intelligence, AGI, the term tech researchers use to describe a theoretical artificially intelligent system that can outperform human capabilities.\n\n“This isn’t just another chatbot or workflow, it’s a truly autonomous agent that bridges the gap between conception and execution,” he said in the video. “Where other AI stops at generating ideas, Manus delivers results. We see it as the next paradigm of human-machine collaboration and potentially a glimpse into AGI.”\n\nAs interest has swelled since Manus shared its work last week, the company said its servers are overwhelmed and it is working to expand its computational resources.\n\nThe global interest has extended to the West. Former National Security Commission on Artificial Intelligence contributor Craig Smith said the tiny team from Shenzhen seems to be assembling a “new category of intelligence.”\n\nMr. Smith wrote in Forbes that he knows Silicon Valley is panicking.\n\n“The fear is that Manus represents the industrialization of intelligence — a system so efficient that companies will soon find themselves forced to replace human labor with AI not out of preference, but necessity,” Mr. Smith wrote.\n\nMr. Smith said Manus is evidence China is leading the world toward autonomous AI agents, which can code software, complete clerical tasks, and make decisions like humans without ever getting tired.\n\nOther AI teams are hard at work building authentic AI. OpenAI CEO Sam Altman said in January that hebelievedAI agents would “join the workforce” in 2025 and his team was confident it knew how to make AGI.\n\nAmerican firm Scale AIisworkingwith the Pentagon on a new program for military operations that brings the company’s “agentic applications” together with Anduril’s software and Microsoft’s large language models.\n\nSome tech leaders are concerned about the rush to develop and deploy AI agents. Meredith Whittaker, president of encrypted communication platform Signal, is warning that AI agents endanger people’s privacy and security.\n\nMs. Whittaker said at the SXSW conference last week that her team is closely tracking the development of AI agents on devices because of how much control people are turning over to various systems.\n\n“There’s a profound issue with security and privacy that is haunting this sort of hype around agents and it is ultimately threatening to break the blood-brain barrier between the application layer and the [operating system] layer by conjoining all of these separate services, muddying their data, and doing things like undermining the privacy of your Signal messages,” she said at SXSW.\n\n• Ryan Lovelace can be reached atrlovelace@washingtontimes.com.\n\nCopyright © 2025 The Washington Times, LLC.Click\n                            here for reprint permission.\n\nPope Leo should tell Catholics: Marry young, have many children\n\nTrump’s TikTok delays undermine his China hawks while Intel controversy grows"
    }
}