{
    "question": "How might DHS’s expanded use of employee polygraph tests, alongside its leadership reshuffling at ICE, influence the effectiveness of immigration enforcement operations and the agency’s internal culture and trust?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nHomeland Security Secretary Kristi Noem speaks with reporters at the White House, Wednesday, Jan. 29, 2025, in Washington. (AP Photo/Alex Brandon, File)\n\nLa secretaria de Seguridad Nacional Kristi Noem se dirige a los empleados del Departamento de Seguridad Nacional, el martes 28 de enero de 2025, en Washington. (AP Foto/Manuel Balce Ceneta)\n\nHomeland Security Secretary Kristi Noem on Sunday announced new leadership at the agency tasked with immigration enforcement as she also pledged to step up lie detector tests on employees to identify those who may be leaking information about operations to the media.\n\n“The authorities that I have under the Department of Homeland Security are broad and extensive and I plan to use every single one of them to make sure that we’re following the law, that we are following the procedures in place to keep people safe and that we’re making sure we’re following through on whatPresident Trumphas promised,” Noem told CBS’ “Face the Nation.”\n\nWhile these polygraph exams are typically not admissible in court proceedings, they are frequently used by federal law enforcement agencies and for national security clearances.\n\n“The Department of Homeland Security is a national security agency,” DHS spokesperson Tricia McLaughlin said in a statement. “We can, should, and will polygraph personnel.”\n\nWhite House officials have previously expressed frustration with the pace of deportations,blaming itin part onrecent leaksrevealing cities where authorities planned to conduct operations.\n\nAP correspondent Julie Walker reports on lie detector tests for government employees and new ICE leadership.\n\nNoem announcement of two new leadership appointments within the U.S. Immigration and Customs Enforcement comes less than two months into the Trump administration and demonstrates the importance that the administration places on carrying out the president’s deportation agenda.\n\nTodd Lyons, the former assistant director of field operations for the agency’s enforcement arm, will serve as acting ICE director. Madison Sheahan, secretary of the Louisiana Department of Wildlife and Fisheries and Noem’s former aide when she was governor of South Dakota, has been tapped to be the agency’s deputy director.\n\nThe leadership changes come after ICE’s acting director wasreassigned on Feb. 21. Two other topimmigration enforcementofficials were reassigned Feb. 11. Those staffing changes came amid frustrations in the Trump administration about the pace ofimmigration arrests.\n\nNoem alsoannounced on Fridaythat the agency has identified and planned to prosecute two “leakers of information.”\n\nOn Sunday, she said these two people “were leaking our enforcement operations that we had planned and were going to conduct in several cities and exposed vulnerabilities.” She said they could face up to 10 years in federal prison.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "The U.S. Department of Homeland Security (DHS)will see changes in two of its top leadership positions.The news follows reports that the White House is frustrated with the pace of deportation efforts, as well as leaks about immigration enforcement operations coming from within the federal government.\n\nThe new leadership includes Todd Lyons, who formerly served as the assistant director of field operations for DHS’ enforcement division, stepping into the role of acting director for U.S. Immigration and Customs Enforcement (ICE).\n\nLyons’ predecessor, Caleb Vitello, was reassigned Feb. 21, shortly after two other top immigration enforcement officials were reassigned.\n\nFormer secretary of the Louisiana Department of Wildlife and Fisheries, and a former aide to Kristi Noem during her tenure as South Dakota governor, Madison Sheahan, will be named DHS’ deputy director.\n\nDownload the SAN app today to stay up-to-date with Unbiased. Straight Facts™.\n\nNoem, who now serves as Trump’s homeland security secretary, appeared on CBS’ “Face the Nation” Sunday, March 9, to announce the leadership changes. She also detailed a plan to expand the use of lie detector tests on DHS employees to root out anyone who is leaking information about ICE operations to the media.\n\nIn a statement, DHS spokesperson Tricia McLaughlin said, “The Department of Homeland Security is a national security agency. We can, should, and will polygraph personnel.”\n\nThe use of lie detector tests among federal law enforcement agencies and those applying for national security clearances is not uncommon. However, results of the tests are also not typically admissible in court,the Associated Press notes.\n\nSuch a significant shakeup just two months into Trump’s administration suggests the White House is sharpening its focus on immigration enforcement, a key tenant of the twice-elected president’s 2024 campaign.\n\nThere have been reports that Trump and others in his orbit, including “border czar” Tom Homan,are frustrated by what they consider to be lackluster deportation numbers.They also blameleaks from within DHSandFBI that are reportedly hampering ICE operations.\n\nKristi Noem Tells Agency To Use Polygraph Tests To Find Leakers\n\nHomeland Security performing staff lie detector tests over immigration raid ‘leaks’\n\nTrump admin uses lie-detector tests on employees to track immigration raid leaks: Report\n\nDHS administering lie detector tests to employees in effort to find leakers\n\nDHS has begun performing polygraph tests on employees to find leakers\n\nNoem taps new immigration enforcement leaders and moves to identify leakers\n\nHomeland Security performing staff lie detector tests over immigration raid ‘leaks’\n\nHomeland Security asks employees to take polygraph tests after media leaks\n\nNo summary available because of a lack of coverage.\n\nUS security chief Noem taps ICE leaders, pledges lie detector tests over leaks\n\nDHS administering lie detector tests to employees in effort to find leakers\n\nUS: Trump Team Is Polygraphing Employees To Find Immigration Raid Leaks\n\nSearch for leaks: U.S. government quotes workers for lie detector test\n\nDHS has begun performing polygraph tests on employees to find leakers\n\nDHS begins performing polygraph tests on employees to snuff out leakers\n\nNoem taps new immigration enforcement leaders and moves to identify leakers\n\nEU subjects employees to polygraph to combat migrant raid leaks\n\nUS: Department of Homeland Security took the lie detector to find the leaks\n\nDHS using polygraph test to find leakers during immigration crackdown\n\nDHS will use lie detectors to find those who leak data about immigrant raids – La Opinión\n\nThe (DHS) has begun performing polygraph tests on employees\n\nTrump -Team is polygraaf employees to find immigration -in -handles\n\nDHS has begun performing polygraph tests on employees to find leakers US Politics",
        "source_3": "The Department of Homeland Security has started giving employeeslie detector teststo find out who is leaking details about upcoming immigration raids.\n\nThe polygraph tests have been taking place for about three weeks,a DHS spokesperson confirmed to CBS News. It wasn’t immediately clear how many employees had already undergone a polygraph.\n\nPresident Trump’s DHS Secretary Kristi Noem issued an internal directive Feb. 18 ordering staffers to submit to polygraph tests to crack down on those trying to hamper Immigration and Customs Enforcement (ICE) deportation operations, the outlet reported, citing sources.\n\n“The Department of Homeland Security is a national security agency. We can, should, and will polygraph personnel,” a DHS spokesperson said.\n\nDHS has used polygraph testing in the past to screen new hires, but staffers are now specifically being questioned about classified documents and sensitive law enforcement information under Noem’s new directive, the sources said.\n\nIt comes just days after the DHS boss revealed that two individuals accused of leaking details about the raids had been identified and were being referred to the Justice Department for “felony prosecutions.”\n\n“We have identified two leakers of information here at the Department of Homeland Security who have been telling individuals about our operations and putting law enforcement lives in jeopardy,” Noem said in a videoposted on Xon Friday.\n\n“We plan to prosecute these two individuals and hold them accountable for what they’ve done,” she added. “And we’re going to continue to do all that we can to keep America safe.”\n\nIt wasn’t clear if the two alleged leakers were identified using the lie detector machines.\n\nNoem andborder czar Tom Homanhave both previously blamed lower-than-expected ICE arrest numbers on apparent leaks identifying what cities will be targeted next in the nationwide raids.\n\n“Some of the information we are receiving tends to lead toward the FBI,” Homan toldFox News host Sean Hannitylast month February.\n\nThe border czar said leaked information had tipped off members of the Venezuelan prison gang Tren de Aragua — allowing them to flee before a large operation in Aurora, Colorado, last month.\n\n“We are sending a strong message — [the leaks are] just giving the bad guys a heads-up so they can escape apprehension,” Homan said. “You’re putting officers’ lives at risk.\n\n“It’s only a matter of time before we walk into a place where there’s going to be a bad guy who doesn’t care. He’s going to be sitting and waiting for the officers to show up and ambush them. This is not a game.”\n\nThe Post reached out to DHS but didn’t hear back immediately."
    }
}