{
    "question": "What are the most significant implications of canceling 83% of USAID programs and moving the remaining contracts under the State Department for U.S. strategic interests and for communities that have relied on these initiatives?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nUSAID workers, some in tears, carted away belongings from a final visit to their now-closed headquarters Thursday as the Trump administration’s rapid-fire dismantling of the congressionally authorized agency moved into its final stages.\n\nLane Pollack, center, of Rockville, Md., a senior learning advisor at USAID for 14 years, is consoled by a co-worker after having 15 minutes to clear out her belongings from the USAID headquarters, Friday, Feb. 28, 2025, in Washington. (AP Photo/Jacquelyn Martin)\n\nU.S. Secretary of State Marco Rubio visits the Abrahamic Family House in Abu Dhabi, United Arab Emirates, Feb. 19, 2025. (Evelyn Hockstein/Pool Photo via AP, File)\n\nElon Musk leaves after meeting with Senate Republicans, at the Capitol in Washington, Wednesday, March 5, 2025. (AP Photo/Ben Curtis)\n\nPresident Donald Trump waves to the media as he walks on South Lawn of the White House, in Washington, Sunday, March 9, 2025. (AP Photo/Jose Luis Magana)\n\nA United States Agency for International Development (USAID) worker holds a bouquet of flowers given to her after retrieving her personal belongings from USAID’s headquarters in Washington, Thursday, Feb. 27, 2025. (AP Photo/Manuel Balce Ceneta)\n\n▶ Follow live updates onPresident Donald Trump and his administration\n\nWASHINGTON (AP) — Secretary of StateMarco Rubiosaid Monday the Trump administration had finished its six-week purge of programs of the six-decade-oldU.S. Agency for International Development, cutting 83% of them, and said he would move the remaining aid programs under the State Department.\n\nHours later, a federal judge said President DonaldTrumphad overstepped his authority in shutting down most foreign assistance, saying the administration could no longer simply sit on the billions of dollars that Congress had provided for foreign aid. But Judge Amir H. Ali stopped short of ordering Trump officials to use the money to revive the thousands of terminated program contracts.\n\nRubio made his announcement Monday in a post on X, in one of his few public comments on what has been a historic shift away from U.S. foreign aid and development, executed by Trump political appointees at State and Elon Musk’s Department of Government Efficiency teams.\n\nRubio in the post thanked DOGE and “our hardworking staff who worked very long hours to achieve this overdue and historic reform” in foreign aid.\n\nElon Musk leaves after meeting with Senate Republicans, at the Capitol in Washington, Wednesday, March 5, 2025. (AP Photo/Ben Curtis)\n\nTrumpon Jan. 20 issued an executive order directing a freeze of foreign assistance funding and a review of allU.S. aid and development work abroad. Trump charged that much of foreign assistance was wasteful and advanced a liberal agenda.\n\nRubio’s social media post Monday said that review was now “officially ending,” with some 5,200 of USAID’s 6,200 programs eliminated. Those programs “spent tens of billions of dollars in ways that did not serve, (and in some cases even harmed), the core national interests of the United States,” Rubio wrote.\n\nHe said about 1,000 remaining contracts would now be administered by the State Department.\n\nLane Pollack, center, of Rockville, Md., a senior learning advisor at USAID for 14 years, is consoled by a co-worker after having 15 minutes to clear out her belongings from the USAID headquarters, Friday, Feb. 28, 2025, in Washington. (AP Photo/Jacquelyn Martin)\n\nDemocratic lawmakers and others call the shutdown of congressionally funded programs illegal, saying such a move requires Congress’ approval.\n\nIn his preliminary injunction Monday, Ali said Trump could not simply ignore most of what is roughly $60 billion in foreign assistance funding that was given to USAID and State by Congress, which under the U.S. Constitution has authority to spend money.\n\n“The constitutional power over whether to spend foreign aid is not the President’s own — and it is Congress’s own,” Ali wrote.\n\nBut Ali declined the request from nonprofit groups and businesses to revive the canceled contracts for foreign assistance work around the world, saying it was up to the administration to make decisions on specific contracts.\n\nAli also ordered Trump officials to keep paying all of the billions of dollars it owed to aid groups and businesses up to mid-February, and ordered them to do it at a pace of at least 300 back payments a day.\n\nAli’s ruling came after the Supreme Court had rejected the Trump administration’s appeal in the case.\n\nUSAID supporters said the sweep of the cuts made it difficult to tell what U.S. efforts abroad the Trump administration actually supports.\n\n“The patterns that are emerging is the administration does not support democracy programs, they don’t support civil society ... they don’t support NGO programs,” or health or emergency response, said Andrew Natsios, the USAID administrator for Republican former President George W. Bush.\n\nThe Trump administration gave almost no details on which aid and development efforts abroad it spared as it mass-emailed contract terminations to aid groups and other USAID partners by the thousands within days earlier this month. The rapid pace, and the steps skipped in ending contracts, left USAID supporters challenging whether any actual program-by-program reviews had taken place.\n\nAid groups say even some life-saving programs that Rubio and others had promised to spare are in limbo or terminated, such as those providing emergency nutritional support for starving children and drinking water for sprawling camps for families uprooted by war in Sudan.\n\nRepublicans broadly have made clear they want foreign assistance that would promote a far narrower interpretation of U.S. national interests going forward.\n\nThe State Department in one of multiple lawsuits it is battling over its rapid shutdown of USAID had said earlier this month it was killingmore than 90% of USAID programs. Rubio gave no explanation for why his number was lower.\n\nPresident Donald Trump waves to the media as he walks on South Lawn of the White House, in Washington, Sunday, March 9, 2025. (AP Photo/Jose Luis Magana)\n\nThe dismantling of USAID that followed Trump’s order upended decades of policy that humanitarian and development aid abroad advanced U.S. national security by stabilizing regions and economies, strengthening alliances and building goodwill.\n\nIn the weeks after Trump’s order, one of his appointees and transition team members, Pete Marocco, and Musk pulled USAID staff around the world off the job through forced leaves and firings, shut down USAID payments overnight and terminated aid and development contracts by the thousands.\n\nA United States Agency for International Development (USAID) worker holds a bouquet of flowers given to her after retrieving her personal belongings from USAID’s headquarters in Washington, Thursday, Feb. 27, 2025. (AP Photo/Manuel Balce Ceneta)\n\nContractors and staffers running efforts ranging from epidemic control to famine prevention to job and democracy training stopped work. Aid groups and other USAID partners laid off tens of thousands of their workers in the U.S. and abroad.\n\nThe shutdown has left many USAID staffers and contractors and their families still overseas, many of them awaiting back payments and travel expenses to return home.\n\nThe Trump administration on Monday gave USAID staffers abroad until April 6 to move back to the United States if they want to do so on the government’s tab, according to a USAID email sent to staffers and seen by The Associated Press. Staffers say the deadline gives them scant time to pull children from school, sell homes or break leases, and, for many, find somewhere to live after years away from the United States.\n\nIn Washington, the sometimes contradictory orders issued by the three men — Rubio, Musk and Marocco — overseeing the USAID cuts have left many uncertain who was calling the shots, and fueled talk of power struggles.\n\nMusk and Rubio on Monday, as Trump had last week, insisted relations between the two of them were smooth.\n\n“Good working with you,” Musk tweeted in response to Rubio’s announcement.\n\n“Tough, but necessary,” Musk wrote of Rubio’s announcement on the cuts.\n\nAssociate Press writer Lindsay Whitehurst contributed.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "The U.S. has officially canceled 83% of U.S. Agency for International Development (USAID) programs, with the roughly 1,000 remaining contracts to be administered by the State Department, Secretary of State Marco Rubio said on March 10.\n\nThe decision to cancel 5,200USAID contractscomes after a six-week review of the U.S.'s top foreign aid agency, which the Trump administration accused of waste, fraud, and pushing a \"liberal agenda.\"\n\nSince Russia launched its full-scale invasion of Ukraine,USAIDhasprovided$2.6 billion in humanitarian aid, $5 billion in development assistance, and more than $30 billion in direct budget support to Kyiv.\n\nThe agency has funded school reconstruction, bombshelters, critical energy repairs, and civil society initiatives.\n\nElon Musk, U.S. President Donald Trump's ally whosupposedlyoversees the new Department of Government Efficiency (DOGE), has led the charge against USAID, laying off staff and attacking the agency in public, often makingbaseless or false claimsabout its work.\n\nRubiothanked DOGE for \"this overdue and historic reform,\" claiming that the aborted contracts have \"spent tens of billions of dollars in ways that did not serve, (and in some cases even harmed), the core national interests of the United States.\" He did not provide any examples of how USAID programs endangered U.S. interests.\n\nThe cuts are nevertheless smaller than indicated by a statement from the Trump administration last month, which talked about slashing90% of all contracts.\n\nUSAID cuts mark a significant realignment of U.S. foreign policy, which saw the Trump administration adopt increasingly hostile rhetoric toward Ukraine and other partners while seeking to renew ties with Moscow.\n\nThe mass cancelation of USAID contracts also threatens various Ukrainian organizations and projects across multiple sectors, including energy, education, media, and humanitarian support.",
        "source_3": "Eighty-three percent of the programs directly funded and administered by the U.S. Agency for International Development (USAID) were canceled Monday by Secretary of State Marco Rubio.\n\nRubio took to social media toannouncethe latest step in the Trump administration’s efforts to cleanse the deep state from government institutions.\n\nThe decision came after a six week review of the programs, Rubio set out, citing their funding as antithetical to the core interests of the United States:\n\nAfter a 6 week review we are officially cancelling 83% of the programs at USAID.\n\nThe 5200 contracts that are now cancelled spent tens of billions of dollars in ways that did not serve, (and in some cases even harmed), the core national interests of the United States.\n\nIn consultation with Congress, we intend for the remaining 18% of programs we are keeping (approximately 1000) to now be administered more effectively under the State Department.\n\nThank you to DOGE and our hardworking staff who worked very long hours to achieve this overdue and historic reform.\n\nThe Trump administration last month placed USAID direct-hire staffers around the world on leave except those deemed essential while others were fired or placed on “administrative leave,” as Breitbart Newsreported.\n\nEmployees were also notified that USAID “was beginning a reduction in force that would eliminate 2,000 U.S.-based jobs,” however this was later changed in another notice to 1,600 employees reportedly having their jobs affected.\n\nNow the results of that review have been delivered.\n\nRFK Jr. — USAID Has Been Captured by the Military Industrial Complex\n\nThe layoffs of thousands of employees from USAID come after a Trump-appointed judge ruled that if the Trump administration “deems it necessary to place thousands of workers on leave in order to review U.S.-backed foreign assistance,” they areallowedto do that.\n\nIn fiscal year 2023, USAID disbursed $72bn of aid worldwide courtesy of funds provided by U.S. taxpayers oneverythingfrom  “gender-affirming health care in Guatemala, teaching people in Kazakhstan to fight back against Internet trolls, voluntary male circumcisions in Mozambique, and creating work opportunities for young LGBTQI+ people in Serbia” to name just a few.\n\nUnited States taxpayers have also sent more than $3 billion to Mexico since 2008 to combat the drug cartels that have mercilessly flooded illicit narcotics, including fentanyl, into the country.\n\nDespite the infusion of U.S. tax dollars funneled to Mexico through USAID, the cartels have become stronger rather than weaker, as Breitbart Newsreported."
    }
}