{
    "question": "In what ways might the Treasury’s decision to accept Venmo and other digital payments for voluntary contributions to the national debt shape public engagement and perceptions of how the debt should be addressed?",
    "content": {
        "source_1": "Posts from this topic will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nThe US national debt currently exceeds $36 trillion, but you can help chip away at that with a Venmo payment.\n\nThe US national debt currently exceeds $36 trillion, but you can help chip away at that with a Venmo payment.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nUS national debt currentlyexceeds $36 trillion, but if you want to toss a few extra dollars of your own money to try and help bring that down, you can now do so from a Venmo account, as spottedby NPR’s Jack Corbett.\n\nYou can see the Venmo payment option on the Treasury Department’s “Gifts to Reduce the Public Debt”website. There are also options to pay from a bank account, a PayPal account, or with a debit or credit card.\n\nBased onWayback Machine archives, it appears that Venmo was added as a payment method sometimeafter February 22nd. (At that time, an Amazon account was a payment option, which isn’t currently available on the site.)\n\nDonors have contributed more than $67 million to this program since September 1998,per Treasury Department data. But when the debt grows at “just under $55,000 a second,”according toAxios, it might take more than Venmo donations to make a significant dent. And after the passage of Trump’s Big Beautiful Bill, the debt is likely going to geteven higher.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.",
        "source_2": "Theo Burman is a Newsweek Live News Reporter based in London, U.K. He writes about U.S. politics and international news, with a focus on infrastructure and technology. He has covered technological and cultural issues extensively in the U.S. and the U.K., such as the rise of Elon Musk and other tech figures within the conservative movement, and the development of high-profile international construction projects. Theo joined Newsweek in 2024 and has previously written for Dexerto, PinkNews, and News UK. He is a graduate of Durham University and News Associates. You can get in touch with Theo by emailingt.burman@newsweek.com. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nThe federal government will acceptVenmopayments from citizens who want to help pay off the national debt.\n\nThe Treasury has begun accepting Venmo transactions as contributions toward the national debt, which currently stands at $36 trillion.\n\nNewsweekcontacted the Treasury for more information on the decision via email.\n\nThe United States national debtsurpassed $34 trillion in 2024, raising ongoing questions about deficit spending and fiscal policy. Amid these concerns, the U.S. Treasury has expanded citizens' options for making voluntary payments to reduce the public debt—including digital payment methods such as Venmo.\n\nThis adaptation signals a shift toward digital-first government services and highlights efforts to engage younger, tech-savvy Americans in public finance, a group that the second Trump administration is keen to appeal to.\n\nThe Bureau of the Fiscal Service, part of the U.S. Department of the Treasury, allows individuals to make voluntary contributions to help reduce the public debt.\n\nGifts can be made via U.S. government platforms such as Pay.gov, with payments accepted in the form of money, outstanding government obligations, or other intangible personal property, according to TreasuryDirect.gov.\n\nyou can venmo the United States to help pay off the national debtpic.twitter.com/UBfSvbAIx0\n\nAfter discussions in May, citizens can also now use modern digital payment tools including PayPal and Venmo to facilitate these transactions alongside more traditional methods such as credit cards or direct transfers.\n\nTo contribute, individuals can visit thePay.gov portaland select their payment method. On Pay.gov, users can fill out the required forms and submit donations using Venmo, enabling real-time payments from their mobile devices.\n\nThe Treasury's monthly reports indicate that such gifts remain modest in scale; in fiscal year 2022, Americans contributed a total of $180,310.32 in voluntary donations toward reducing the national debt.\n\nThe Venmo Help Center's policy page on government payment reads: \"Your Venmo Direct Deposit account can be used to receive Direct Deposit funds from many sources, including the government.\n\n\"You can provide your Venmo Direct Deposit account number to the government for unemployment payments, tax refunds, Social Security payments, and more. Venmo's Direct Deposit feature allows for recurring payments, such as unemployment funds, or one-time payments, such as tax returns.\n\n\"When providing your Direct Deposit details to an employer or other issuer, please be sure to confirm your account and routing numbers as they appear in your Venmo app.\"\n\nRabin Sawh, Regional Vice President of Catalis Payments, said in May:\"Offering Venmo as a payment option indicates that governments understand and respect these preferences, making it easier for constituents to interact with civic systems online.\"\n\nThe growing adoption of mobile payment methods by public agencies may pave the way for further digitization of government services and increased transparency in public finance.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nTheo Burman is a Newsweek Live News Reporter based in London, U.K. He writes about U.S. politics and international news, with a focus on infrastructure and technology. He has covered technological and cultural issues extensively in the U.S. and the U.K., such as the rise of Elon Musk and other tech figures within the conservative movement, and the development of high-profile international construction projects. Theo joined Newsweek in 2024 and has previously written for Dexerto, PinkNews, and News UK. He is a graduate of Durham University and News Associates. You can get in touch with Theo by emailingt.burman@newsweek.com. Languages: English.\n\nTheo Burman is a Newsweek Live News Reporter based in London, U.K. He writes about U.S. politics and international news, with a focus on infrastructure and technology. He has covered technological and cultural issues extensively in the U.S. and the U.K., such as the rise of Elon Musk and other tech figures within the conservative movement, and the development of high-profile international construction projects. Theo joined Newsweek in 2024 and has previously written for Dexerto, PinkNews, and News UK. He is a graduate of Durham University and News Associates. You can get in touch with Theo by emailingt.burman@newsweek.com. Languages: English.\n\nTheo Burman is a Newsweek Live News Reporter based in London, U.K. He writes about U.S. politics and international news,                                    ...Read more",
        "source_3": "The US Treasury Department is now accepting Venmo and PayPal payments from those who want to donate money to reduce the nation’s ballooning $36.7 trillion debt.\n\nThe digital payment platforms can be used after accessing the “Gifts to Reduce the Public Debt” page on Pay.gov,NPR’s Jack Corbett noted.\n\nTheexpansion of payment options comes amid growing public concernover the debt, which has surged from $19.59 trillion in 2010 to its current level, an increase of 87%, according to the Treasury Department.\n\nThe donation program has existed since 1996, with a total of $67.3 million contributed — an amount that remains negligible compared to the federal debt.\n\nCritics have questioned the value of individual donations toward the national debt.\n\nSamson Mow, CEO of Bitcoin technology firm JAN3,compared the effortto “sending Bitcoin to a burn address.”\n\nPresident Donald Trump’s recently enacted “Big, Beautiful Bill” isprojected to add an additional $3.4 trillionto the debt over the next decade, according to the non-partisan Congressional Budget Office.\n\nThe legislation prompted a public dispute between Trump and Tesla CEO Elon Musk,who criticized the bill for raising the debtceiling by $5 trillion.\n\nDespite the Treasury’s new push for public donations, the scale of the debt continues to raise questions about the sustainability of US fiscal policy and the effectiveness of such symbolic gestures.\n\nMeanwhile, Bridgewater Associates founder Ray Dalio is sounding the alarm,warning that the country is at growing riskof a fiscal crisis unless urgent policy changes are made.\n\nDalio hasrepeatedly likened the mounting debtto “plaque in arteries,” cautioning that the cost of servicing the debt is “severely diminishing purchasing power.”\n\n“We are spending 40% more than our income,” he said, adding that “we’re approaching the point where we may need to borrow just to pay the interest on our existing debt — this is the classic debt death spiral.”\n\nAccording to Dalio, the US is approaching an inflection point where debt and interest obligations could crowd out essential government spending.\n\nHe has called on lawmakers to reduce the budget deficit from approximately 7% of GDP to 3%, a move he believes could be achieved with a mix of spending cuts and tax increases.\n\nDalio expressed concern over weakening investor confidence, citing falling bond sales, a weaker dollar, and rising gold and equity prices.\n\n“Unless the budget deficit is cut to about 3% of GDP, the supply of debt will be much greater than the demand,” he warned, adding that debt service costs will “severely squeeze out the government’s ability to spend.”\n\nWhile he sees a low risk of an immediate crisis, Dalio estimates that the chance of a financial “trauma” caused by a sudden loss of confidence now exceeds 50% if no action is taken.\n\nHe has urged bipartisan cooperation, stating that early intervention is “much cheaper and less painful than waiting for a tipping point.”\n\nDalio continues to call for “bipartisan practicality and collective sacrifice” to stabilize the fiscal trajectory before it becomes unmanageable.\n\nA Treasury Department spokesperson referred The Post to commentsmade by Treasury Sec. Scott Bessent during his testimonybefore Congress last month.\n\nBessent, told lawmakers that the administration’s tax and trade policies are projected to lower the federal deficit over the next decade, despite skepticism from congressional analysts.\n\n“There’s ‘varying scoring’ of the tax bill,” Bessent said during a Senate Finance Committee hearing. “It is my view that over the 10-year window, it will decrease.”\n\nWhile noting his disagreement with the Congressional Budget Office’s (CBO) methodology, Bessent cited two separate estimates from the agency: one on the impact of tax cuts and the other on the effects of the president’s tariffs. He said the data shows that import duties are expected to generate $2.8 trillion in revenue over 10 years.\n\n“Even in Washington DC math, that is a $400 billion surplus,” Bessent said.\n\n“You can’t take one without the other,” he told Sen. Elizabeth Warren (D-Mass.), emphasizing that the CBO analyses must be considered together.\n\nIn an interview last week with Fox Business anchor Maria Bartiromo, Bessent added that the administration had already collected nearly $100 billion in tariff revenue so far this year and is “on track for $300B this year.”\n\nBessent also pointed to recent fiscal trends as a sign of improvement.\n\n“June delivered a budget surplus with higher revenue and lower spending,” he said.\n\n“This is how we clean up the fiscal mess we inherited,” Bessent asserted."
    }
}