{
    "question": "How might President Trump’s claim to have “brought back free speech” be understood in light of his executive order and subsequent actions involving lawsuits against media, social media monitoring of visa holders, and funding and policy responses to campus protests?",
    "content": {
        "source_1": "In President Donald Trump’saddressto a joint session of Congress on Tuesday, March 4, he bragged about restoring “free speech” to the United States. “I’ve stopped all government censorship and brought back free speech in America,” Trump said. “It’s back.”\n\nBut this claim couldn’t be further from the truth. Trump has consistently rewarded speech he likes while punishing speech he doesn’t. That kind of “viewpoint discrimination” is exactly what the First Amendment seeks to prevent. In fact, Trump’s actions run counter to the spirit—if not the text—of the First Amendment.\n\nWhile colloquial talk about “censorship” abounds in contemporary discourse around the internet and how private companies host speech, theFirst Amendment’sprotections guard against the overreach by the U.S. government against its citizens and even its companies when they engage in free expression. And since taking office on Jan. 20, Trump has operationalized his long-held animosity for the tenets of the First Amendment, attacking the independent press, free speech, and peaceful protest.\n\nRead More:Trump Uses Big Speech to Spin Alternate Reality of ‘Astronomical Achievements’\n\nFirst is Trump’s fight with the Associated Press (AP), the country’s preeminent news service and grammatical standard-setter. On Inauguration Day, Trump issued anexecutive order“restoring names that honor American greatness.” He renamed the Gulf of Mexico the “Gulf of America,” and Denali’s name to Mount McKinley after the Obama administrationchanged the nameof the Alaskan peak to its Athabascan name in 2015. While the AP decided to honor the McKinley name change since the mountain lies specifically within U.S. borders, it detracted from the administration on the Gulf of Mexico decision due to the body of water’s nature as an “international body.”\n\n“As a global news agency that disseminates news around the world, the AP must ensure that place names and geography are easily recognizable to all audiences,” Amanda Barrett, the AP’s vice president of standards and inclusionwroteon Jan. 23. She noted that theAP Stylebook, which many news organizations follow for guidance on such decisions, would make these changes.\n\nThe White House retaliated against the AP,kickingits reportersout of presidential briefings in the Oval Office and aboard Air Force One. On Feb. 21, the news organization sued three White House officials over the blocked access, saying the decision would infringe on its First Amendment right to freedom of the press as well as its Fifth Amendment right to due process. A Trump-appointed federal district judge in Washington, D.C. declined to immediately grant an injunction ending the policy. “It might be a good idea for the White House to think about whether what they’re doing is really appropriate given the case law,” Judge Trevor N. McFaddensaidin court.\n\nAmong the case law is a suit from former CNN reporter Jim Acosta, whosuccessfully suedto get his White House press credentials restored in 2018 after he was unceremoniously booted from the premises after repeated clashes with Trump. (The judge—another Trump appointee—only ruled that Acosta’s due process rights were violated, declining to weigh in First Amendment questions.)\n\nAdditionally, Trump moved to further cement his control of the White House press corps on Feb. 25 when the White House announced it would decide who covers Trump day in and day out in the rotating press pool, the small group of reporters on duty totrack and report on the presidenteach day wherever he may be. “This move from the White House threatens the independence of a free press in the United States. It suggests the government will choose the journalists who cover the president,” said Eugene Daniels, president of the White House Correspondents Association, which has independently controlled the press pool for decades.\n\nThe White House insistence to control the press might not create legal problems for the government, but it demonstrates that the administration is unwilling to cede control of its image to the reporters it has contempt for. Moreover, it’s willing to dangle the promise and threat of access over reporters’ heads in seeking compliance and lenience.\n\nTrump’s animosity toward the First Amendment also extended to its guarantee of peaceable assembly. “All Federal Funding will STOP for any College, School, or University that allows illegal protests,” Trump wrote onTruth Socialon Tuesday, hours before his speech. “Agitators will be imprisoned/or permanently sent back to the country from which they came. American students will be permanently expelled or, depending on on[sic]the crime, arrested. NO MASKS! Thank you for your attention to this matter.”\n\nTrump has repeatedly criticizedprotestson college campuses, particularly those taking issue with Israel’s war in Gaza. “Trump’s latest coercion campaign, attempting to turn university administrators against their own students and faculty, harkens back to the McCarthy era and is at odds with American constitutional values and the basic mission of universities,” wrote Cecillia Wang, legal director of the American Civil Liberties Union, in astatement.\n\nThe First Amendment is meant to protect people from the government telling them what speech and ideas are acceptable. Our freedoms are robust, but Trump is seemingly chipping away at them in whatever way he can. At minimum, he’s a thorn in the side of Americans’ civil liberties. And at worst, he’s seeking an Orwellian level of control over what Americans say and write in public.",
        "source_2": "Pro-Palestinian student protesters demonstrate outside Barnard College in New York last week. Credit: Getty\n\nSince the October 7 attacks in 2023, protests on American campuses have too often descended into lawlessness and often antisemitic discrimination. Just last week, keffiyeh-wearing studentsoccupieda building at Barnard College in New York and allegedly assaulted an employee.\n\nYesterday, President Donald Trump took to Truth Social toaddressincidents like these across American campuses. He announced harsh punishments for student “agitators”, and threatened to revoke federal funding from universities which fail to sufficiently clamp down on “illegal protests”.\n\nUnfortunately, though, his proposed solutions only deepen the free speech crisis on campus by triggering serious constitutional concerns. In fact, nearly everything in Trump’s post is either confusing, a chill on free speech, or both.\n\nLet’s start by underlining the uncontroversial part: revoking the student visas of foreign nationals if they engage in criminal activity and arresting American students who do the same. Few would disagree with such a move. Unless these were federal crimes, the federal government likely would not even have to be involved.\n\nElsewhere, however, Trump proposes actions that go well beyond federal powers, let alone presidential powers. And schools that attempt to comply are likely to crack down on both protected and unprotected speech. This is exactly what happened when the Obama and Biden administrations revised federal Title IX guidance, which is intended to prohibit sex-based discrimination in higher education programmes but has also been used to justify restraints on expression.\n\nIn his post, Trump also adds the adjective “illegal” before “protests”, which makes the first sentence about cutting federal funding to colleges that “allow illegal protests” sound reasonable. Things which are illegal are already beyond the protection of law — that’s how they came  to be illegal, after all. If we said the government should stop illegal dancing, or illegal poetry, or illegal journalism, it would sound quite a bit less unconstitutional than if we’d said the government should stop dancing, poetry, or journalism, naked of adjectives.\n\nBut protests, in and of themselves, aren’t illegal. Sometimes illegal things happen at protests, but that’s when the protest ends and a crime or offence begins. For example, if a protest devolves into violence and property destruction, you don’t have an “illegal protest”: you have a riot. We could charitably read Trump’s formulation as shorthand for a character-limited social media format, but when talking about arresting people for their expression, a little precision is in order.\n\nThe statement that American students could be “permanently expelled” is perplexing, because there is no such federal power. The federal government cannot expel people from anywhere but a few federally operated colleges and universities, such as service academies like West Point. Private universities mostly govern themselves, and public schools are generally run by states.\n\nFinally, the President says, “NO MASKS!” — probably because the Barnard students wore masks when they occupied Milbank Hall last week. There are a number of competing interests at stake here: simple masks to protect someone’s anonymity are generally protected, but masks used during the commission of a crime are not. It’s also worth mentioning that the desire of lawful protesters to wear masks is easy to understand when the president of the United States makes statements suggesting an intent to retaliate for their presence at protests.\n\nIn January, when Trump was sworn in, FIREwrote the President a letteroutlining a path forward to combat antisemitism in higher education. In short, that path is to add religion as a protected class under Title VI (which presently prohibits discrimination on the basis of race, colour, and national origin in programmes receiving federal assistance), and to codify existing Department of Education policies on racial and ethnic stereotyping as well as theSupreme Court’s testfor peer-on-peer harassment. This way, everyone has a bright line for what conduct is acceptable.\n\nFocusing on the protests, however, is a mistake. What got colleges into this situation was a concentrated indifference to the hostile climate (and often harassment) faced by Jewish students — even as those same colleges built multi-level censorship bureaucracies around their fascination with microaggressions directed at every other intersectional category then known or later invented. Much of this bureaucracy, including the DEI offices that Trump wants to dismantle, was justified by schools as necessary to comply with vague directives under Title IX. If a new, vague rule to stop protests is put in place, colleges will over-comply with that, too.\n\nWhether it was the intended message or not, higher education has inculcated in some portion of its community the understanding that some people don’t deserve equal protection under the schools’ rules or to be fully included in campus life. And we can reverse this trend by respecting everyone’s rights — including the right to be free from discriminatory harassment and the right to say things that may hurt someone’s feelings.\n\nHowever long it took to get there, Barnard’s decision to enforce its rules is a step in the right direction. The government can encourage more colleges to do the same with bright-line federal policies which treat everyone equally, giving everyone the same protection under law while ensuring everyone has the same right to freedom of expression.\n\nPresident Trump should address campus unrest by encouraging campuses to model the freedoms America promises to protect. He can do that by pushing schools to enshrine and enforce protections for freedom of speech and academic freedom, while stressing that misconduct and criminal behaviour must be punished. What he shouldn’t do is create new excuses for campuses to undermine those promises.\n\nGreg Lukianoffis the president and CEO of the Foundation for Individual Rights and Expression (FIRE), and co-author ofThe Canceling of the American Mind.Adam Goldsteinis the vice president of strategic initiatives at the Foundation for Individual Rights and Expression (FIRE).\n\nWe welcome applications to contribute to UnHerd – please fill out the form below including examples of your previously published work.Pleaseclick hereto submit your pitch.\n\nPleaseclick hereto view our media pack for more information on advertising and partnership opportunities with UnHerd.",
        "source_3": "Free speech is noisy, messy, and open for even bad or offensive ideas and questionable positions allowed to compete in the world of public discourse. You can say almost anything as long as you’re willing to accept the consequences such comments create. People will disagree. They may hate you, defriend you, or even attack you personally. But in America, thanks to Trump, you’re once again free to express your views.\n\nWikipedia provides a helpful perspective on freedom, “Freedom of speech is the political right to communicate one's opinions and ideas. The term freedom of expression is sometimes used synonymously, but includes any act of seeking, receiving and imparting information or ideas, regardless of the medium used.”\n\nGovernment does have limits. It restricts certain speech, such as libel, slander, sedition, copyright violations, and hate speech, justified under the “harm principle”—when one’s expression adversely “harms” another party. Being offended is not “harm;” it’s but an emotional reaction that all at times experience. “Harm” is certainly easily asserted, but it is often exaggerated.\n\nIn fact, I’m offended by people who are easily offended. President Donald Trump and Elon Musk are now accustomed to being hated for their positions and actions, but they are strong and confident enough to handle it. Such attacks go with the territory for an effective political leader who truly values open communication. Only when you can handle attacks will you be able to actually surface messages you may need to hear. Silencing strong criticism is not embraced by good leaders. They make those who confront them safe from consequences. They want to hear all voices. Why? Sometimes those who disagree with you are right.\n\nI remember my great uncle on the farms of Illinois who loved to say, “When one person calls you a horse’s ass, don’t worry. When three people do, go out and buy a saddle.” As a president, you multiply that number by millions. Politics invites disagreement. Good politicians can handle it and still function with the focus required to deliver on your campaign promises.\n\nThere remains a strong division in America today, and, at times, it spills over into a barrage of hateful comments. But to embrace freedom of speech, we must accept the harsh reality that discord, divisiveness, and hate will always be with us. Today, it may even be increased by the immediacy of our communication on social media. There is no delay. If you don’t like a statement, emotion is unleashed and hateful comments abound. In most cases, that just intensifies the division, distance, and counter attacks.\n\nThankfully, the First Amendment ensures that much of this offensive speech is not restrained, punished or otherwise censored by the government. We have freedom to confront and disagree, even when done poorly. This is not to say that such emotional statements are wise. The most influential people know the importance of waiting for emotion to give way to thoughtful discourse. But even when we do it poorly, we must continue to affirm the importance of freedom of speech.\n\nEvelyn Beatrice Hall was the first to coin the phrase: \"I disapprove of what you say, but I will defend to the death your right to say it.\" Let’s learn to disagree without being quite so disagreeable, but let’s never let verbal attacks silence us. We have been blessed to live in a country where we have the right to disagree. Exercise and defend that right. The appropriate response to hate speech is more speech, not forced silence.\n\nIn his book,The Case for Democracy, Natan Sharansky writes: “If a person cannot walk into the middle of the town square and express his or her views without fear of arrest, imprisonment, or physical harm, then that person is living in a fear society, not a free society. We cannot rest until every person living in a ‘fear society’ has finally won their freedom.”\n\nAllowing the free flow of ideas and criticism is a cherished gift of liberty. America still passes the “Public Square Test.” A citizen can criticize a President, Christians, gay marriage, abortion, Sharia Law, and op-ed columnists and not be put to death by tyrannical authorities. May it always be so.\n\nPresident Trump is no shrinking violet. He can give strong criticism and handle receiving it. Trump’s America passes the “public square test.” Democrats will not be kicked off social media for attacking Trump, Musk, or any of his administrative team.\n\nUnlike Biden, Trump has the confidence that can handle such attacks. That means, go ahead and express your views on X and Facebook. Compete in the arena of ideas. A vibrant and free America can handle such discourse. Free speech is invaluable, and, under Trump, it is back! So, the answer to any hate speech you hear is not forced silence for opponents; the answer is in encouraging more speech. In fact, as a free American, participate yourself by responding honestly to this column. May it be so.\n\nTerry Paulson is PhD psychologist, professional speaker, and author ofThe Optimism Advantageand his new political novel,The Summit. Contact him atterry@terrypaulson.com."
    }
}