{
    "question": "In what ways could the strong post-speech approval among viewers shape public perceptions of Trump’s agenda and its momentum in the weeks ahead?",
    "content": {
        "source_1": "The Republican-heavy audience that tuned in to hear President Donald Trump’s speech on Tuesday greeted it with tempered positivity, according toa CNN pollconducted by SSRS.\n\nSpeech-watchers broadly said Trump’s policies would take the country in the right direction, with majorities saying the same across five issue areas that were the focus of the president’s speech. But fewer expressed strong confidence in Trump to help people like them, use his presidential power responsibly or provide the nation with real leadership.\n\nRoughly 7 in 10 speech-watchers said they had at least a somewhat positive reaction to Trump’s speech tonight, with a smaller 44% offering a very positive response. That’s lower than the 57% of viewers who rated Trump’s initial address to Congress very positively eight years ago, or the 51% who said the same of President Joe Biden’s initial address in 2021. It also comes just below the 48% “very positive” rating Trump saw for his 2018 State of the Union.\n\nGood marks from speech-watchers are typical for presidential addresses to Congress, which tend to attract generally friendly audiences that disproportionately hail from presidents’ own parties. In CNN’s speech reaction polls, which have been conducted most years dating back to the Clinton era, audience reactions have always been positive.\n\nThe pool of people who watched Trump speak on Tuesday was about 14 percentage points more Republican than the general public.\n\nThe Trump-friendly audience reacted negatively to a protest effort from a Democratic member of Congress. Eight in 10 Americans who watched the speech said they saw Rep. Al Green’s interruption of Trump’s speech as inappropriate, with just 20% saying the representative from Texas acted appropriately. Green was ejected from the House chamber after continuing to protest following a warning from House Speaker Mike Johnson.\n\nRoughly 6 in 10 viewers said in a poll conducted before the speech that they approved of Trump’s handling of the presidency overall. By contrast, Trump’s approval rating is underwater with the American public as a whole, a CNN poll released Sunday found, with 48% of U.S. adults approving of his performance as president and 52% disapproving.\n\nTrump’s speech on Tuesday did little to further improve the already-positive perspectives of his audience. In a survey conducted prior to the speech, 61% said they believed his policies would move the country in the right direction; afterward, 66% of the same people said his policies would take the country down the right path. The share who believed Trump has had the right priorities so far stood at 56% prior to the speech and 59% immediately following its conclusion.\n\nHalf of speech-watchers said they held a lot of confidence in Trump to provide real leadership, while 45% said they had a lot of confidence in him to use his presidential power responsibly, and just 4 in 10 expressed high confidence in his ability to help people like them. Majorities of 65% or more said they had at least some confidence in him across each metric.\n\nTrump scored his highest marks of the night for his policies on immigration: 76% of speech-watchers said his proposed policies on that issue would take America in the right direction, compared with closer to 6 in 10 who said the same of his proposals to change how the government works (63%), or his proposed policies on the economy (62%) or tariffs (56%). That’s a shift from CNN’s polling on his first term speeches, when he consistently rated higher on economic issues than on those related to immigration.\n\nMost who tuned in said they thought his proposed policies on foreign affairs would move the country in the right direction (61%). Speech-watchers are also largely aligned with Trump’s approach to Ukraine and Russia. Majorities said that based on what they heard in the speech, the president’s policies toward Ukraine (63%) and Russia (58%) offered the right amount of support for each country. Sizable minorities, though, see Trump as too supportive of Russia (37%) and not supportive enough of Ukraine (33%).\n\nAnnual presidential addresses rarely lead to significant shifts in presidential approval among the broader American public, particularly in recent years. Historically, first-year addresses to Congress have tended to be better rated than later State of the Union speeches and more likely than others to result in an approval rating bounce. But Trump, the first president in the era of modern presidential polling to serve nonconsecutive terms, isn’t new to the office — and current levels of polarization may also curtail his speech’s potential to affect public opinion.\n\nThe CNN poll was conducted by text message with 431 US adults who said they watched the presidential address on Tuesday, and are representative of the views of speech-watchers only. Respondents were recruited to participate before the speech, and were selected by a survey of members of the SSRS Opinion Panel, a nationally representative panel recruited using probability-based sampling techniques. Results for the full sample of speech-watchers have a margin of sampling error of plus or minus 5.3 percentage points.",
        "source_2": "Ewan Palmer is a Newsweek News Reporter based in London, U.K. His focus is reporting on US politics, and Florida news. He joined Newsweek in February 2018 after spending several years working at the International Business Times U.K., where he predominantly reported on crime, politics and current affairs. Prior to this, he worked as a freelance copywriter after graduating from the University of Sunderland in 2010. Languages: English. Email: e.palmer@newsweek.com.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nA large majority of people who watched PresidentDonald Trump's joint address toCongressapproved of the speech, according to a poll.\n\nNewsweekhas contacted the White House for comment via email.\n\nTrump's speechin front of lawmakers Tuesday nightwas a chance for the president to discuss the sweeping changes he has brought in during the first six weeks of his second term.\n\nACBSNews/YouGov poll surveyed people who planned to watch Trump's Congress address and then sought their view of the speech immediately after it concluded.\n\nThe poll found 76 percent said they \"approve\" of Trump's address, with 23 percent saying they disapprove.\n\nA majority of the people who chose to watch Trump's speech wereRepublicans(51 percent), with 27 percent saying they were independents and 20 percentDemocrats.\n\nThe CBS News survey is based on 1,207 interviews of adults who watched the address. The results have a margin of error of plus or minus 3.4 percentage points.\n\nDuring his speech, Trump discussed the topics that have dominated discussions during his second term, such as his immigration proposals,the Russia-Ukraine warand the new tariffs on imports from Canada, Mexico and China.\n\nThe poll showed nearly two-thirds (63 percent) of people who watched the speech believed Trump spent \"a lot\" of time speaking about issues they cared about.\n\nSome 68 percent said the speech made them feel \"hopeful\" and 54 percent who said it made them feel \"proud.\" More than a quarter (27 percent) said Trump's address made them feel \"worried,\" while 16 percent said the speech left them \"angry.\"\n\nTrump was also praised for his performance Tuesday night, with 74 percent saying he was \"presidential\" and \"entertaining\" while delivering his address. Trump was also described as \"inspiring\" by 71 percent of those who watched his address.\n\nMoreover, 62 percent who watched the speech—during which Trump often criticized former PresidentJoe Biden, mentioning him at least 16 times—said they found it \"unifying,\" compared to 46 percent who said it was \"divisive.\"\n\nThe poll found a significant majority of people who watched the speech said they liked Trump's plans for reducing federal spending and waste (77 percent), immigration (77 percent), ending the Russia-Ukraine war (73 percent) and imposing tariffs (65 percent).\n\nDuring his speech, Trump said there would be a \"little disturbance\" to the economy due to theimplementation of tariffsagainst Canada, Mexico, and China, but that they would ultimately make the U.S. \"rich again.\"\n\nTrump also said he had received a letter from Ukrainian PresidentVolodymyr Zelenskyon Tuesday, which he said signaled a willingness to discuss a peace deal. Headdedhe had been in \"serious discussions with Russia\" and had \"received strong signals that they are ready for peace,\" without specifying further.\n\nThe president alsopraised tech billionaire Elon Muskfor his work at the Department of Government Efficiency (DOGE), which has overseen the gutting of several federal agencies and mass layoffs of thousands of federal workers over the past six weeks.\n\nDemocrats held signs reading \"Musk Steals\" and \"Save Medicaid\" during the speech.\n\nTexas Democratic RepresentativeAl Green was removed from the chamberafter repeatedly heckling Trump as the president delivered his address. The CBS News poll found that 76 percent of those who watched the speech approved of Green being removed.\n\nPresident Donald Trump during Tuesday's address:\"Six weeks ago, I stood beneath the dome of this Capitol and proclaimed the dawn of the Golden Age of America. From that moment on, it has been nothing but swift and unrelenting action to usher in the greatest and most successful era in the history of our country. We have accomplished more in 43 days than most administrations accomplish in four years or eight years—and we are just getting started.\"\n\nHouse Speaker Mike Johnson in aTuesday statement:\"Tonight, President Trump made his triumphant return to Congress to share his bold, optimistic vision for renewing the American Dream. He showcased the historic, record-setting achievements of his first weeks in office and the immediate, real-life, positive impacts of the America First agenda. After four years of President Biden's disastrous policies, President Trump has seized the moment and moved rapidly to deliver on the promise of restoring American greatness.\"\n\nDemocratic National Committee Chair Ken Martin said in a statement:\"Tonight, everyRepublicangot out of their seats and gave a standing ovation for skyrocketing costs, economic freefall, and the next American recession—brought to you by Donald Trump. I dare every single one of these Republicans who blindly applauded for Trump to go home and meet their voters face-to-face. But they won't, because they know that the Republican tax scam to take money out of the pockets of working people to give trillions in handouts to the rich will cost them their jobs.\"\n\nDemocratic New Hampshire Senator Jeanne Shaheen, ranking member of the Senate Foreign Relations Committee, said:\"President Trump's address this evening laid bare a cynical and profoundly dangerous approach to America's global leadership. His 25 percent tariffs on Mexico and Canada—our closest trading partners—threaten to unravel decades of economic cooperation and will inevitably result in economic consequences for American workers and businesses. Our allies are watching, and the message is clear: This administration is willing to compromise long-standing strategic partnerships for short-sighted political gains.\"\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nEwan Palmer is a Newsweek News Reporter based in London, U.K. His focus is reporting on US politics, and Florida news. He joined Newsweek in February 2018 after spending several years working at the International Business Times U.K., where he predominantly reported on crime, politics and current affairs. Prior to this, he worked as a freelance copywriter after graduating from the University of Sunderland in 2010. Languages: English. Email: e.palmer@newsweek.com.\n\nEwan Palmer is a Newsweek News Reporter based in London, U.K. His focus is reporting on US politics, and Florida news. He joined Newsweek in February 2018 after spending several years working at the International Business Times U.K., where he predominantly reported on crime, politics and current affairs. Prior to this, he worked as a freelance copywriter after graduating from the University of Sunderland in 2010. Languages: English. Email: e.palmer@newsweek.com.\n\nEwan Palmer is a Newsweek News Reporter based in London, U.K. His focus is reporting on US politics, and Florida                                    ...Read more",
        "source_3": "Published:07:48 BST, 5 March 2025|Updated:11:34 BST, 6 March 2025\n\nPresidentDonald Trump's 99-minute victory lap in front of Congress on Tuesday night was a hit with the watching American public, according to an exclusive snap poll for DailyMail.com.\n\nTrump may have included taunts and boasts but some 57 percent of respondents gave the speech a thumbs up.\n\nOnly 32 percent said they disapproved, according to an online survey of 774 viewers conducted by J.L. Partners.\n\nAnd some 58 percent said they thought it struck a generally optimistic tone, after Trump announced that the 'American Dream is surging bigger and better than ever before.'\n\n'This was a knockout speech for Trump,' said pollster James Johnson. 'Viewers felt he was confident, optimistic, and strong – and they left feeling more positive about the future of America than when they left.'\n\nTrump used the address to take a victory lap six weeks after taking office, laying out a string of achievements and listing objectives for the next four years.\n\n'It has been nothing but swift and unrelenting action,' he said. 'The people elected me to do the job, and I am doing it.'\n\nThe prime-time speech was his first toCongresssince returning to power. And it highlighted another extraordinary facet of Trump's political comeback in Washington, where his allies hold the House andSenate, allowing him almost unfettered power.\n\nU.S. President Donald Trump addresses a joint session of Congress at the U.S. Capitol on March 04, 2025 in Washington\n\nThe night bore all the hallmarks of a Trump rally, with bold exaggerations, multiple attacks on his predecessor, protests and walkouts, plus a string of made-for-television moments.\n\nAt 99 minutes, it was the longest presidential address to Congress in history.\n\nTo test reactions, J.L. Partners ran an online poll of viewers.\n\nAnd the overwhelming reaction was that they got what they expected.\n\nThree quarters said the speech showed the Trump they knew, compared with 20 percent who said it showed another side of Trump.\n\nSome 62 percent said it was a 'strong' speech. But at the same time 53 percent said it was 'caring' (only 38 percent said it was uncaring), packed as it was with shout-outs to families in the audience who had been victims to violent crime or other hardships.\n\nAnd there was good news for a president who has set out to entertain his public.\n\nAlmost two thirds (65 percent) said the speech was interesting while 27 percent said it was boring.\n\nVice President J.D. Vance and House Speaker Mike Johnson looked on as Trump spoke\n\nViewers were asked to sum up how listening to Trump made them feel, and the results were more positive than negative\n\nElon Musk saluted the president after being introduced by Trump on Tuesday night\n\nDemocrats protested and Republicans applauded during the speech\n\nHe ran into opposition even as he entered the hall. One congresswoman held up a sign saying: 'This is not normal.'\n\nAnd moments into his address, Rep. Al Green was ordered out after he refused to sit down.\n\nSeveral more Democrats walked out but Trump shrugged off their concerns.\n\n'I look at the Democrats in front of me, and I realize there is absolutely nothing I can say to make them happy or to make them stand or smile or applaud, nothing I can do,' he said.\n\n'These people sitting right here will not clap, will not stand, and certainly will not cheer for these astronomical achievements.'\n\nIn fact he leant into some of his most polarizing culture war crusades, as well as talking up tariffs, andannouncing the capture of the terrorist behind the 2021 Abbey Gate bombing at Kabul airport.\n\nOne of the biggest cheers came when he introduced Elon Musk.\n\n'To further combatinflation, we will not only be reducing the cost of energy, but will be ending the flagrant waste of taxpayer dollars,' he said.\n\nRep. Al Green (D-TX) is removed from the chamber after protesting\n\nThe protests began as Trump entered the chamber with Rep. Melanie Stansbury (D-NM)\n\nDemocratic women wore pink and held up signs through the speech\n\n'And to that end, I have created the brand new Department of Government Efficiency, DOGE ... perhaps you've heard of it ... which is headed byElon Musk, who is in the gallery tonight.'\n\nMusk saluted the president, who then went on to claim that it had rooted out hundreds of billions of dollars of waste—numbers that are not borne out by evidence.\n\nTrump used the occasion to attack opponents, referring to Joe Biden or the Biden administration 13 times.\n\nJohnson, cofounder of J.L. Partners, which conducted the poll, said the results came with some caveats.\n\n'The viewership was more likely to be Republican than Democrat: A reflection of Trump's base being more eager to tune in,' he said.\n\n'And the public did not feel it was a unifying speech: they called it divisive, and felt that Trump was more incendiary than the protesting Democrats on the House floor.\n\n'But they know the Trump they were going to get, and – as at the election – put more stock on Trump's policy positions and strength than his style.\n\n'There was one unusual finding for a Trump speech: people felt it was \"caring\", with Trump’s big emphasis of people in the gallery clearly a savvy move.'\n\nJared Kushner and Trump's daughter Ivanka were in the audience\n\nMelania Trump received a standing ovation as she arrived\n\nSome of the biggest applause came during made-for-television moments.\n\nTrump highlighted the story of 13-year-old DJ Daniel who had dreamed of becoming a police officer despite being struck by brain cancer, before directing Sean Curran, director of the United States Secret Service, to make him an honorary Secret Service agent.\n\nAnd moments later he introduced high school senior Jason Hartley who wants to follow in his father’s legacy of service by attending the US Military Academy at West Point.\n\n'That's a very big deal getting in,' said the president. 'That's a hard one to get into, but I'm pleased to inform you that your application has been accepted.'\n\nHe touted moves to rename the Gulf of Mexico and a mountain in Alaska, making English the official language of the country, ending diversity programs and preventing transgender girls and women from playing in female sports teams.\n\nAnd he promised plenty more action, expanding production of critical minerals and rare earths, establishing an office of shipbuilding, and planting 'the American flag on the planet Mars.'\n\n'My administration will reclaim power from this unaccountable bureaucracy, and we will restore true democracy to America again any federal bureaucrat who resists this change will be removed from office immediately, because we are draining the swamp,' he said.\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nBy posting your comment you agree to ourhouse rules.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with ourPrivacy Policy."
    }
}