{
    "question": "What are the potential long-term economic and security implications of TSMC’s $100 billion Arizona expansion—three fabs, two packaging facilities, and an R&D center—for U.S. job creation, global chip supply chains, and future trade policy?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nPresident Donald Trump walks before talking with reporters before boarding Marine One on the South Lawn of the White House in Washington, Friday, Feb. 28, 2025. (AP Photo/Ben Curtis)\n\nWASHINGTON (AP) — Chip giant Taiwan Semiconductor Manufacturing Co. plans to invest $100 billion in the United States, PresidentDonald Trumpsaid Monday, on top of $65 billion in investments the company had previously announced.\n\nTSMC, the world’s biggest semiconductor manufacturer, produces chips for companies including Apple, Intel and Nvidia. The company had already begun constructing three plants in Arizona after the Biden administration offered billions in subsidies. Its first factory in Arizona has started mass production of its 4-nanometer chips.\n\nTrump, who appeared with TSMC’s chief executive officer C. C. Wei at the White House, called it a “tremendous move” and “a matter of economic security.”\n\n“Semiconductors are the backbone of the 21st century economy. And really, without the semiconductors, there is no economy,” the president said. “Powering everything from AI to automobiles to advanced manufacturing, we must be able to build the chips and semiconductors that we need right here in American factories with Americans skill and American labor.”\n\nWei said the investment will be for three more chip manufacturing plants, along with two packaging facilities, in Arizona.\n\nThe $165 billion investment “is going to create thousands of high-paying jobs,” Wei said.\n\nFormer President Joe Biden in 2022 signed a sweeping $280 billion law, theCHIPS and Science Act, to try to reinvigorate chip manufacturing in the U.S., especially after the COVID-19 pandemic.\n\nDuring the pandemic, chip factories, especially those overseas making the majority of processors, shut down. It had a ripple effect that led to wider problems, such as automobile factory assembly lines shutting down and fueled inflation.\n\nTrump has criticized the law and taken a different approach, instead threatening to impose high tariffs on imported chips to bring chip manufacturing back to the U.S.\n\nTrump also has said companies like TSMC do not need federal tax incentives.\n\nAt the Commerce Department, 40 people who worked on the implementation of the Chips Act were fired Monday as part of the Trump administration’s sweeping moves to cut the size of the federal workforce, according to a person familiar with the move who was not authorized to speak publicly.\n\nWhen asked if the new investment could minimize impact on the U.S. should China either isolate or seize Taiwan, Trump said he couldn’t say “minimize” because “that would be a catastrophic event obviously.”\n\nTaiwan is an island that broke away from mainland China in 1949 following a civil war. Beijing claims sovereignty over the island and has ratcheted up military and diplomatic pressure on its leaders.\n\n“It will at least give us a position where we have, in this very, very important business, we would have a very big part of it in the United States,” Trump said of the chip manufacturing.\n\nHe did not say if the investment would provide security for the self-governed island that Beijing considers to be part of Chinese territory.\n\nTaipei Economic and Cultural Representative Office, the island’s de-facto embassy in the United States, said investments by Taiwanese businesses in the U.S. have exceeded 40% of the island’s total foreign investments and that the Taiwanese government is “glad” to see Taiwanese businesses to expand investments in the U.S. and to deep cooperation on supply chain between the two sides.\n\n“It also brings the economic and trade relations closer,” the office said.\n\nBonnie Glaser, managing director of the Indo-Pacific program at German Marshall Fund of the U.S., said Taipei is hoping the increased investment pledge will help keep the U.S.-Taiwan relationship strong. “Taiwan is evidently stepping up in a way that supports and advanced President Trump’s priorities,” she said. “The US will benefit greatly from TSMC’s investment.”\n\nTrump has yet to indicate his stance on U.S. support for Taiwan’s security since he took office, and he has said Taiwan should pay the U.S. for its military defense.\n\nTrump has hosted multiple business leaders at the White House since he took office in January to tout a series of investments that aim to demonstrate his leadership is a boon for the U.S. economy. He’s also pointed to the tariff threats as prodding the investments.\n\n“It’s the incentive we’ve created. Or the negative incentive,” Trump said.\n\nIn January, he appeared with the heads of OpenAI, Oracle and SoftBank at the White House as they announced plans for a new partnership to invest up to $500 billion for infrastructure tied to artificial intelligence. He also announced in January a $20 billion investment by DAMAC Properties in the United Arab Emirates to build data centers tied to AI.\n\nLast week, after Apple CEO Tim Cook met with Trump at the White House, the company announced plans to invest more than $500 billion in the U.S. over the next four years, including plans for a new server factory in Texas. Trump said after their meeting that Cook promised him Apple’s manufacturing would shift from Mexico to the U.S.\n\n“I don’t have time to do all of these announcements,” Trump joked Monday as he listed some of the other investments.\n\nThe Wall Street Journal first reported the planned announcement Monday.\n\nAssociated Press writers Josh Boak and Chris Megerian contributed to this report. Price reported from New York.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "TSMC, LG and Samsung are among those intending to bring some operations to the US in the face of Trump’s trade threats\n\nUS President Donald Trump on Monday announced the TSMC investment in three new chip-fabrication plants, two packaging facilities, and a research and development centre, potentially adding 20,000 to 25,000 jobs in the US state of Arizona.\n\nThe president, who advocates more onshoring of industry to stimulate the US economy, said that without TSMC’s commitment, tariffs on its chip imports might otherwise reach an eventual 25-50 per cent.\n\nOther major East Asian chipmakers will probably move production to the US, too, as “the Trump administration’s threat of tariffs on imported semiconductors poses a serious challenge for the region’s tech-heavy economies”, said Jeemin Bang, a Taiwan analyst for Moody’s Analytics.\n\nSouth Korean electronics giants LG and Samsung, for example, were considering moving plants to the US, Korean media outlets reported in January. Both companies develop chips.\n\nThe White House statement said Trump had “secured” nearly US$2 trillion in US-based investment and that “the best is yet to come”.",
        "source_3": "TSMC opened operations in the U.S. in 2020 during Trump's first term in office.\n\nTaiwan Semiconductor Manufacturing Co. (TSMC) CEO C.C. Wei announced at the White House on Monday that his company will further invest at least $100 billion in chip-manufacturing plants in the United States over the next several years.\n\nPresident Donald Trump, who attended the event where the announcement was made, noted that had TSMC manufactured the chips in Taiwan and shipped them to the United States, they would have been subjected to 25%-50% tariffs.\n\n“By doing it here, there’s no tariffs,” Trump said.\n\nTrump said that the deal was critical to United States national security as Taiwan faces the threat of invasion by communist China.\n\n“Without the chips and semiconductors, nothing runs today,” Trump said. “You can’t buy a car without them, you can’t — a radio, a television, you can’t get anything.”\n\n“We thought it was very important, obviously business-wise, but we thought even in terms of national security, to have this large percentage of the chips, semiconductors, and other things” made in the United States, Trump added.\n\nTSMC will invest the money in Arizona to expand the manufacturing plant that it has in Phoenix, where it employs 3,000 people, and will construct three new chip plants, two chip-packaging plants and a research and development center, Wei said at the White House.\n\nTSMC came to the United States during Trump’s first term in office when it announced a $12 billion investment in Arizona, The Wall Street Journal reported.\n\nThe company has since expanded in the state, bringing its total investment up to $65 billion. The new announcement brings the company’s total investment to $165 billion.\n\nYour information could be the missing piece to an important story. Submit your tip today and make a difference."
    }
}