{
    "question": "What factors might be driving the preliminary report of decades-low unauthorized U.S.-Mexico border crossings in February, and what are the potential policy and humanitarian consequences if this trend holds?",
    "content": {
        "source_1": "Updated on:  March 3, 2025 / 12:45 PM EST/ CBS News\n\nWashington— The number of migrants crossing the U.S. southern border illegally in President Trump's first full month in office plunged to a level not seen in at least 25 years, according to preliminary government data obtained by CBS News.\n\nLast month, Border Patrol recorded about 8,450 apprehensions of migrants who crossed into the country unlawfully between official entry points along the U.S.-Mexico border, the statistics show.\n\nOn some days during a record spike in illegal crossings under the Biden administration, Border Patrol recorded more than 8,000 apprehensions in a single day.\n\nFebruary's total, which could be adjusted when the government officially publishes the statistics, would be the lowest monthly apprehensions tally recorded by Border Patrol since at least fiscal year 2000, the last period withpublic monthly data. The final tallies usually don't deviate much from the preliminary figures.\n\nOver the past 25 years, the only time monthly apprehensions came close to the level recorded in February was in April 2017, when Border Patrol apprehended 11,000 migrants at the southwest border, agency data show.\n\nWhile monthly data before fiscal year 2000 is not publicly available, the last time Border Patrol averaged roughly 8,000 apprehensions per month over a year was in fiscal year 1968, according tohistorical statistics.\n\nIllegal crossings along the U.S. southern border have been trending downward over the past year, including under the Biden administration, after spiking to an all-time high in late 2023.\n\nThey first dropped in early 2024 after Mexican officials expanded efforts to stop migrants from reaching the U.S. border and then fell further in the summer following former President Biden's move to sharply restrict access to the asylum system.\n\nBut the reduction in illegal immigration has been precipitous since Mr. Trump's inauguration.\n\nIn January, Border Patrol agents at the Mexican border recorded 29,000 apprehensions, down 38% from 47,000 in December. The drop from January to February was even more pronounced, amounting to a roughly 70% decrease.\n\nTrump administration officials have credited their sweeping, government-wide immigration crackdown for the dramatic decrease in unlawful crossings.\n\nAt the U.S.-Mexico border, the Trump administration has empowered federal officials to swiftly deport migrants without hearing their asylum claims, under the premise that the country is facing an \"invasion.\"\n\nU.S. law says migrants on American soil generally have the right to claim asylum to delay or halt their deportation. Trump administration officials have argued the system has been systematically abused by smugglers and economic migrants, who don't qualify for asylum.\n\nMr. Trump has also directed the American military to help with immigration enforcement, deploying thousands of additional troops to the southern border and tasking military planes with deporting migrants.\n\nWhile Biden also moved to curtail asylum during his last year in office, Mr. Trump's unprecedented actions are far more restrictive.\n\nUnlike the Biden administration, for example, the Trump administration is not processing, in any significant capacity, asylum-seekers at official border entry points. In fact, a Biden-era system that facilitated that processing through a government app was quickly terminated.\n\nThe Trump administration is also considering adding another layer to its restrictions at the border, making plans to invoke a public health law known as Title 42 to summarily expel migrants on the grounds that they could spread diseases like tuberculosis.\n\nWhether migrant flows continue dropping, plateau or increase in the coming weeks and months remains unclear. Historically, migrant arrivals at the southern border have increased in the springtime.\n\nWhile its border strategy has yielded quick results, the Trump administration's efforts in the U.S. interior, where the president has promised to conduct the largest deportation operation in American history, have encountered significant obstacles.\n\nTop Immigration and Customs Enforcement officials have been reassigned in recent weeks amid frustrations that the agency is not carrying out sufficient arrests and deportations.\n\nICE's detention capacity has also been stretched thin. As of Friday, ICE detention centers were at 117% capacity, with the agency detaining more than 45,000 migrants, 20,000 of whom were first apprehended at the southern border, according to internal government data.\n\nCamilo Montoya-Galvez is the immigration reporter at CBS News. Based in Washington, he covers immigration policy and politics.",
        "source_2": "Dan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nPresidentDonald Trumpclaimed Saturday that arrests along the United States' border with Mexico hit a record low of just over 8,300 in February, but official data is yet to be released.\n\nIn the post on Truth Social, Trump said that \"the invasion of our country is over\", aftermonthly illegal crossings peakedat around 300,000 in December 2023 under former PresidentJoe Biden.\n\n\"Thanks to the Trump administration policies, the Border is CLOSED to all illegal immigrants,\" the President posted. \"Anyone who tries to illegally enter the U.S.A. will face significant criminal penalties and immediate deportation.\"\n\nNewsweekreached out to theDepartment of Homeland Security(DHS) and the Border Patrol via email Monday afternoon asking for more on the data.\n\nPresident Trump was elected off the back of an election campaign which focused heavily on illegal immigration, especially the surge in crossings at the southwest border during Biden's term in the White House. On January 20, following his inauguration,Trump signed multiple executive ordersaimed at curtailing illegal entry andending the previous administration's policies.\n\nIf confirmed by the Department of Homeland Security (DHS) and its agency on the border – U.S. Customs and Border Protection (CBP) – then the 8,326 figure given by Trump would make February 2025 the lowest monthly figure since CBP records began in 2000.\n\nBy comparison, February 2024 saw 140,641 arrests between official ports of entry. The last time February saw a dip below 20,000 was in 2017, just after Trump entered the White House the first time. Two months later, arrests hit a low of 11,127.\n\nBorder crossings have been steadily trending downward since December 2023, with a noticeable shift in June 2024 when Biden implemented a near-total ban on asylum. In the last full month of his term, illegal crossings were at 47,316. In January, that number had fallen by around 18,000.\n\nNumbers will matterfor the White House if it wants to be seen as delivering on Trump's promises of increased border security, as well as the removal of millions of illegal immigrants.\n\nDeportation numbers since January 20 are still not entirely clear. While DHS put out a figure of around 5,700 for the first two weeks of the Trump administration, there have been few updates since. Official DHS data has not been updated since mid-January and only runs to November 2024.\n\nAs for border crossings, these have been heavily restricted by the Border Patrol with the help of members of the U.S. Military. The President's executive orders also sought toscrap asylum entriesand appointments under the old CBP One app, while there have also been reports of immigrants turning around and heading south through Mexico.\n\nOfficial numbers from CBP are not usually made public at the start of each month, however. Figures for the previous month tend to come midway through the current one, meaning February's update should be two weeks away.\n\nTrump has reportedly been frustrated at the pace of his immigration agenda, leading to the reallocation of his initial acting head of Immigration and Customs Enforcement (ICE) Caleb Vitello just over a week ago.\n\nMore military personnel have also been sent to the border in recent days, while DHS has drafted more agents from across the federal government to help with raids across the country.\n\nSecretary of Homeland Security Kristi Noem, on X:\"February was the lowest month in recorded history for encounters at our border. The world is hearing our message: do not come to our country illegally. If you do, we will find you, arrest you, and send you back. Thank you President [Trump] for your strong leadership and to our brave CBP officers and agents for keeping America safe.\"\n\nAaron Reichlin-Melnick, an immigration policy analyst, on X:\"The claim of 'lowest month in recorded history' is an outright lie. The records go back to the establishment of the Border Patrol a century ago and there are multiple years where monthly encounters were significantly lower.\n\n\"We are undoubtedly in a period of low crossings right now, and Trump's actions are definitely responsible for some of that. But one way that Trump has done that is by flagrantly breaking the law, including a wild claim that he has inherent authority to ignore immigration law.\"\n\nTrump's 2017 policies also saw a noticeable dip in border crossings, but the numbers soon began climbing again. The next few months will be crucial in showing whether the President's 2025 policies have a more long-lasting impact.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security.                                    ...Read more",
        "source_3": "By signing up to our newsletters you agree to the Just the NewsTerms of ServiceandPrivacy Policy\n\nFebruary saw only 8,326 apprehensions of illegal aliens at southern U.S. border.\n\nPresident Donald Trump declared Saturday that the “invasion of our country is over\" as illegal crossings at the southern U.S. border plummeted to a record low.\n\nThe February apprehension numbers released by U.S. Customs and Border Protection confirmed the 47th president had quickly delivered on one of his signature promises.\n\n“The month of February, my first full month in Office, had the LOWEST number of Illegal Immigrants trying to enter our Country in History – BY FAR! There were only 8,326 apprehensions of Illegals by Border Patrol at the U.S. - Mexico Border,” Trump wrote on his Truth Social account.\n\n“This means that very few people came – The Invasion of our Country is OVER,” he added."
    }
}