{
    "question": "How might the AI Action Plan’s push to expand infrastructure, roll back regulations (including loosening copyright rules), and restrict federal procurement of AI deemed ideologically biased shape U.S. competitiveness, governance, and the balance between rapid innovation and accountability?",
    "content": {
        "source_1": "The president seemed to riff since his 28-page AI Action Plan did not wade into copyright and administration officials told reporters the issue should be left up to the courts.\n\nPresident Donald Trump gestures after signing executive orders after speaking during an AI summit at the Andrew W. Mellon Auditorium on July 23, 2025, in Washington. | Julia Demaree Nikhinson/AP\n\nPresident Donald Trump criticized copyright enforcement efforts and state-level AI regulations Wednesday as he launched the White House’s AI Action Plan on a mission to dominate the industry.\n\nIn remarks delivered at a “Winning the AI Race” summit hosted by the All-In Podcast and the Hill and Valley Forum in Washington, Trump said stringent copyright enforcement was unrealistic for the AI industry and would kneecap U.S. companies trying to compete globally, particularly against China.\n\n“You can’t be expected to have a successful AI program when every single article, book or anything else that you’ve read or studied, you’re supposed to pay for,” he said. “You just can’t do it because it’s not doable. ... China’s not doing it.”\n\nTrump’scomments were a riffas his 28-page AI Action Plan did not wade into copyright and administration officials told reporters the issue should be left to the courts to decide.\n\nTrump also signed three executive orders. One will fast track federal permitting, streamline reviews and “do everything possible to expedite construction of all major AI infrastructure projects,” Trump said. Another expands American exports of AI hardware and software. A third order bans the federal government from procuring AI technology “that has been infused with partisan bias or ideological agendas,” as Trump put it.\n\nLuminaries of the AI industry attended Trump’s speech, including Nvidia CEO Jensen Huang, Advanced Micro Devices CEO Lisa Su and Palantir CTO Shyam Sankar.\n\nTrump echoed tech companies’ complaints about state AI laws creating a patchwork of regulation. “You can’t have one state holding you up,” he said. “We need one common sense federal standard that supersedes all states, supersedes everybody.”\n\nHis Action Plan includes directions to the Office of Management and Budget to limit AI-related funding to states with regulation that might hinder the funding’s “effectiveness.” It also directs the Federal Communications Commission to check whether state AI regulations interfere with the agency’s ability to carry out its duties under the Communications Act of 1934.\n\nCivil rights advocates and tech critics raised alarms over the plan’s approach to federal permitting and oversight rollbacks, and its close alignment with the tech industry.",
        "source_2": "The Trump administration has unveiled a sweeping roadmap to develop artificial intelligence, pledging to boost US innovation while stripping away what it calls \"bureaucratic red tape\" and \"ideological bias\".\n\nThe 28-page AI Action Plan outlines more than 90 policy actions for the rapidly developing technology that administration officials say can be implemented over the next year.\n\n\"We believe we're in an AI race, and we want the United States to win that race,\" Trump administration crypto czar David Sacks told reporters.\n\nThe AI plan promises to build data centre infrastructure, and promote American   technology - but was panned by critics who consider it an ideological flex by the White House.\n\nThe plan also calls for federal agencies to review and repeal policies that stand in the way of AI development, and encourage AI in both government and the private sector.\n\nPresident Donald Trump is expected to sign three related executive orders on Wednesday. One order will promote the international export of US-developed AI technologies, while another aims to root out what the administration describes as \"woke\" or ideologically biased AI systems.\n\n\"American development of AI systems must be free from ideological bias or engineered social agendas,\" the White House said. \"With the right government policies, the United States can solidify its position as the leader in AI and secure a brighter future for all Americans.\"\n\nCrypto czar Sacks added that the plan is partially focused on preventing AI technology from being \"misused or stolen by malicious actors\" and will \"monitor for emerging and unforeseen risks from AI\".\n\nThe Trump administration has positioned the expansion of AI infrastructure and investments in the United States as a way to stay ahead of China.\n\n\"AI is a revolutionary technology that's going to have profound ramifications for both the economy and national security,\" Sacks said. \"It's just very important that America continues to be the dominant power in AI.\"\n\nBut critics argued that the plan was a giveaway to Big Tech.\n\n\"The White House AI Action plan was written by and for tech billionaires, and will not serve the interests of the broader public,\" said Sarah Myers West, co-executive director of the AI Now Institute.\n\n\"[T]he administration's stance prioritizes corporate interests over the needs of everyday people who are all already being affected by AI,\" West added.\n\nIn 2023, Trump's predecessor, Joe Biden, signed an executive order that called for safety and security standards governing the use of AI in the federal government - an order that was rescinded by Trump on the first day he took office in January.\n\nDays later, Trump signed an executive order that called for an accelerated AI development, the removal of ideological bias and today's AI action plan, for which it sought public comment.\n\nOfficials say the plan unveiled Wednesday was shaped by more than 10,000 public comments.\n\nA former Biden administration official told the BBC that Trump's plan abandoned safeguards that helped protect American national security and public trust.\n\n\"Accelerating innovation is essential, but dismantling responsible guardrails risks turning America's AI revolution into a reckless gamble,\" said Jim Secreto, former Deputy Chief of Staff to Biden's Commerce Secretary Gina Raimondo.\n\n\"Promoting aggressive AI exports without reasonable controls strengthens China's hand,\" Secreto added.\n\nLast month, TrumpallowedUS technology giant Nvidia to resume sales of its high-end artificial intelligence (AI) chips to China, reversing his administration's prior ban on sales of Nvidia's H20 chips to Beijing.\n\nAI regulation was also a major sticking point in recent negotiations about Trump's massive budget bill passed by Congress earlier this month.\n\nThe bill originally included a ten-year moratorium barring states from regulating artificial intelligence.\n\nLawmakers ultimately stripped that language from the bill.\n\nSign up for our Tech Decoded newsletterto follow the world's top tech stories and trends.Outside the UK? Sign up here.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "Meta Chief Global Affairs Officer Joel Kaplan discusses President Donald Trump’s new initiative with AI and more on ‘Fox & Friends.’\n\nPresident Donald Trump is going all in on artificial intelligence, with a top Meta executive voicing strong support for his bold strategy. Speaking at atech summit in Washington, Trump outlined his vision for a future driven by American innovation and secured by globalartificial intelligenceleadership.\n\n\"America is the country that started the AI race,\" saidPresident Trumpon Wednesday. \"And as President of the United States, I'm here today to declare that America is going to win it.\"\n\nMeta’s Chief Global Affairs Officer Joel Kaplan praised the plan on \"Fox & Friends\" Thursday, calling the announcement \"incredibly important.\"\n\nOPENAI CEO SAM ALTMAN WARNS OF AI FRAUD CRISIS 'VERY SOON'\n\n\"This is about putting our country first, creating good jobs, strengthening our economy, and safeguarding our national security,\" Kaplan said.\n\nRep. French Hill, R-Ark., discusses President Donald Trump's new A.I. executive order and what the GENIUS Act means for stablecoins on 'Mornings with Maria.'\n\nThe summit came just as a 180-day deadline passed for the administration’s executive order directing federal agencies to develop a comprehensive AI strategy.\n\nThe newly released plan outlines efforts to supercharge innovation, invest in U.S. infrastructure, and lead international standards for AI development and security.\n\nAccording to administration officials, including White House Science and Tech Policy Director Michael Kratsios and AI adviser David Sacks, the framework is broken into three pillars: accelerating innovation, building infrastructure, and leading international AI diplomacy and security.\n\nFEDERAL JUDGE RULES AGAINST TRUMP ADMIN IN LAWSUIT AGAINST GOVERNMENT LABOR UNIONS\n\nThe written plan seeks to integrate AI into different sectors, such as healthcare, energy, agriculture, and national defense. The document emphasizes that AI should support, not replace, American workers. It also includes retraining programs for those displaced by automation.\n\nWASHINGTON, DC - JULY 23: U.S. President Donald Trump speaks during the \"Winning the AI Race\" summit hosted by All‑In Podcast and Hill & Valley Forum at the Andrew W. Mellon Auditorium on July 23, 2025 in Washington, DC. Trump signed executive or(Getty Images/Chip Somodevilla / Getty Images)\n\nThe plan also took aim at the Biden administration, accusing it of stifling innovation and creating a \"regulatory regime.\"\n\nTrump reversed a Biden-era executive order on AI within hours of returning to office in January. That order placed restrictions on powerful AI technologies and required companies to notify the federal government before releasing advanced models.\n\nLINDA MCMAHON SECURES 'MONUMENTAL VICTORY' AGAINST COLUMBIA UNIVERSITY IN ANTISEMITISM CRACKDOWN\n\nCritics say removing those safeguards raises concerns over AI safety, transparency, and user privacy. But Trump’s team has insisted that innovation is \"too important to smother in bureaucracy at this early stage.\"\n\nKaplan pointed to China as America’s top AI rival, and said plans such as this are vital to staying ahead.\n\nFOX Business correspondent Madison Alworth explains the three parts of President Donald Trump’s artificial intelligence action plan on ‘The Big Money Show.’\n\n\"We’ve got this very fierce competition going with China,\" he said. \"The Chinese government is all in, in terms of supporting its AI companies, removing obstacles, building massive amounts of energy to power the data centers necessary to build AI.\n\n\"If we want to stay ahead, and we want to make sure that the global standards for this technology are set and are based on American values, we're going to have to win the race,\" he added.\n\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\n\nBy clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time."
    }
}