{
    "question": "How might declaring English the official language, while letting agencies decide whether to offer materials in other languages, affect access to government services and civic participation across the United States?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nSigns in Spanish and English are displayed the Brooklyn borough of New York, Friday, Feb. 28, 2025. (AP Photo/Seth Wenig)\n\nSigns in Chinese and English are displayed the Brooklyn borough of New York, Friday, Feb. 28, 2025. (AP Photo/Seth Wenig)\n\nSigns in Spanish and English are displayed the Brooklyn borough of New York, Friday, Feb. 28, 2025. (AP Photo/Seth Wenig)\n\nAs President Donald Trump is expected to sign an executive order designatingEnglish as the official languageof the United States, activists and advocacy groups are alarmed by what that will mean for non-English speakers when it comes to immigration, voter access and other issues.\n\nThe order, which was announced Friday, will allow government agencies and organizations that receive federal funding to choose whether to continue to offer documents and services in languages other than English, according to a fact sheet. The move rescinds a mandate from former PresidentBill Clintonthat required the government and organizations that received federal funding to provide language assistance to non-English speakers.\n\nDesignating English as the national language “promotes unity, establishes efficiency in government operations, and creates a pathway for civic engagement,” according to the White House. But some activists and organizations think the move is just another way for the president to stoke division and fear.\n\n“This isn’t just an offensive gesture that sticks a thumb in the eye of millions of U.S. citizens who speak other languages, but also will directly harm those who have previously relied on language assistance for vital information,” Vanessa Cárdenas, executive director of America’s Voice, an advocacy group for immigration reform, said in an email.\n\nAccording to the International Institute for Democracy and Electoral Assistance, an official language is what is used by the government to conduct official, day-to-day business. Having one or more official languages can help define a nation’s character and the cultural identity of those who live in it.\n\nPrioritizing one language may place certain people in position of power and exclude others whose language is not recognized, according to the institute.\n\nU.S. English, a group that advocates for making English the official language in the United States, believes having an official language provides a common means of communication, encourages immigrants to learn English to use government services and “defines a much-needed common sense language policy.”\n\nCurrently there are more than 350 languages spoken in the United States, according to U.S. Census Bureau data. The most widely spoken languages other than English are Spanish, Chinese, Tagalog, Vietnamese and Arabic.\n\nPeople in the U.S. also speak Native North American languages such as Navajo, Yupik, Dakota, Apache, Keres and Cherokee, among others.\n\nAnabel Mendoza, the communications director for United We Dream, a nonprofit immigrant advocacy organization, said limiting the language of federal communication will make it harder for people to become citizens if they are denied the ability to speak their native tongue throughout the process. Currently, people of certain age and residency requirements can qualify for a waiver to do the citizenship test and interview in their native language.\n\n“Trump is trying to send the message that if you’re not white, rich and speak English you don’t belong here,” Mendoza said. “Let me be clear: Immigrants are here to stay. No matter how hard Trump tries, he can’t erase us.”\n\nThe Congressional Hispanic Caucus announced Friday that New York Rep. Adriano Espaillat, caucus chair, will deliver, on behalf of Democrats, the official Spanish-language response to Trump’s upcoming joint address to Congress.\n\nGeorge Carrillo, co-founder & CEO of the Hispanic Construction Council, said it seems like a step backwards in a country that has championed its diversity. He is also concerned how limiting governmental communication might affect U.S. territories such as Puerto Rico where the predominant language is Spanish.\n\n“This executive order, while framed as promoting unity, risks dismantling critical supports like ESL programs and multilingual resources that help immigrants adapt and contribute,” Carrillo said. “Imagine families navigating healthcare or legal systems without materials in a language they understand, it’s a barrier, not a bridge.”\n\nAPIAVote, a nonpartisan nonprofit focused on registering Asian American and Pacific Islander voters, also expressed worry this could mean barriers for millions of voters such as naturalized citizens or elderly residents who aren’t English-proficient.\n\n“It will make it harder for them to participate civically and vote, as well as access critical healthcare, economic and education resources,” the group said in a statement.\n\nFurthermore, the organization says this action could make anyone who speaks another language a target.\n\n“The exclusionary nature of this policy will only fuel xenophobia and discrimination at a time when anti-Asian hate and hate against other minority and immigrant groups are rising.”\n\nMore than 30 states, from California to New Hampshire, as well as the U.S. Virgin Islands have already passed laws designating English as their official language, according to U.S. English. Hawaii is the only state to declare two official languages, English and Hawaiian.\n\nFor decades, lawmakers in Congress have introduced legislation to designate English as the official language, but those efforts failed. The most recent effort was in 2023, when Sens. Kevin Cramer, R-N.D., and JD Vance, R-Ohio, introduced the English Language Unity Act. Vance is now vice president.\n\nIt is estimated that over 170 countries have an official language, with some having more than one language.\n\nMexico does not have an official language. In Canada the official languages are English and French. According to Canada’s Official Languages Act of 1969, the purpose of designating two languages ensures “the equality of status” and protecting linguistic minorities “while taking into account the fact that they have different needs.”\n\nFigueroa reported from Austin, Texas. Associated Press writers Michelle L. Price in New York and Terry Tang in Phoenix contributed to this report.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Donald Trump will sign an executive order on Friday making English the official language of the United States, according to White House officials.\n\nThe US president is also expected to scrap requirements that federal agencies provide language services to non-English speakers.\n\nThe US has never had an official language in the nearly 250 years since the country was founded.\n\nThe order is intended to improve government efficiency and promote national unity, according to White House officials.\n\nNearly 68 million of the country's 340 million residents speak a language other than English, according to the US Census Bureau, which includes more than 160 Native American tongues.\n\nFriday's executive order will roll back a policy from 2000 signed by former President Bill Clinton requiring government agencies and federal funding recipients to \"ensure that their programs and activities normally provided in English are accessible to LEP (low-English proficiency) persons\".\n\nAgencies will still be allowed to provide that language access to non-English speakers, according to White House officials.\n\nRepublicans have led efforts in the past to label English as the country's official language, with members of the House as recently as 2021 introducing legislation on it that failed.\n\nThose who opposed those efforts say that the country does not need an official language, pointing to the high numbers of people who speak it and to the country never having one, while also saying establishing one could promote discrimination against non-English speakers.\n\nDuring his presidential campaign last year, Trump included non-English languages in his statements calling for stricter immigration policies.\n\n\"We have languages coming into our country. We don't have one instructor in our entire nation that can speak that language,\" he told a crowd of supporters in February 2024.\n\n\"It's the craziest thing - they have languages that nobody in this country has ever heard of. It's a very horrible thing,\" he said.\n\nAnd during the 2016 campaign he said, \"This is a country where we speak English. It's English. You have to speak English!\"\n\nWhen the US was founded, most residents spoke English and those writing the country's constitution did not feel it was necessary to enshrine it as the official language and also did not want to alienate fellow new citizens who spoke German or other languages, according to most scholars.\n\nThe languages currently spoken the most in the US after English are Spanish, various Chinese languages, Tagolog, Vietnamese and Arabic, according to the Census Bureau.\n\nA further approximately one million people use American Sign Language, according to experts.\n\nApproximately 180 countries around the world designate official national languages, and most countries recognise multiple official languages.\n\nHowever, several countries besides the US do not have an official language, including the United Kingdom.\n\nThere are more than 30 US states which have designated English as the official language, while Alaska and Hawaii have also bestowed official status on several native languages.\n\n©2025 BBC. The BBC is not responsible for the content of external sites.Read about our approach to external linking.",
        "source_3": "WASHINGTON — President Trump is expected to sign an executive order making English the official language of the US for the first time in the country’s 250-year history, The Post has confirmed.\n\nThe mandate would mark the first time the US has had an official language at the federal level — and would negate a rule issued by former President Bill Clinton that required federal agencies to have language materials for non-English speakers.\n\nThe executive action will now require the agencies or groups that receive government funding to no longer provide assistance in languages other than English.\n\nThe Wall Street Journal,which first reported the incoming order, reported the text outlines a need for unity, efficiency and civic engagement.\n\nTrump has long spoken about the rise ofillegal immigration through the southern border— and the need for English to be the primary language spoken in the country.\n\n“This is a country where we speak English, not Spanish,” Trump said in a presidential debate in 2015.\n\nHe repeated a similar sentiment during his 2024 campaign, saying, “We have languages coming into our country. We don’t have one instructor in our entire nation that can speak that language.”\n\n“These are languages — it’s the craziest thing — they have languages that nobody in this country has ever heard of. It’s a very horrible thing,” the president has said.\n\nEnglish is the most widely-spoken language in the US, and 32 states have declared it as the official language.\n\nUS lawmakers have also introduced legislation for decades to the same effect — but it has never reached the president’s desk.\n\nMost recently, Sen. Bernie Moreno (R-Ohio), who emigrated from Colombia and became an American citizen at the age of 18, floated a bill to make English the official language of the US.\n\nThat legislation goes further than the executive order and would have forced all US government functions to be conducted in English — while also mandating applicants for citizenship to demonstrate proficiency in the language."
    }
}