{
    "question": "What might the apparent leveling off of both Christian identification and religious non-affiliation, alongside rising self-reported spirituality, suggest about how Americans are redefining religious life and how institutions—from churches to community groups—should respond?",
    "content": {
        "source_1": "A majornew studyon religious views in the United States finds – as Americans’ connection to organized religion continues to fade – there are deep divides over the appropriate role for religion in American public life, with sizable shares in favor of a more formalized role.\n\nLess than half of all adults now say religion is very important in their lives, down from majorities who felt that way in earlier studies. Just 44% in the new poll say they pray daily, also down from majorities in prior polls. And while the vast majority continue to say they believe in a God or universal spirit, the share who say they are absolutely certain one exists has dropped from 71% in 2007 to 54% now.\n\nRelated articleSupreme Court flooded with prayers for relief from groups eager to promote religion\n\nThose findings come from the Pew Research Center’s Religious Landscape Study, which aims to provide a comprehensive measurement of Americans’ religious beliefs and practices. The survey suggests, though, the decline in Christian affiliation and corresponding growth in the share who lack a religious affiliation that had been persistent over the past few decades appears to have plateaued.\n\nA majority of Americans identify as Christian (62%, including 40% who are Protestant, 19% Catholic and 3% with another Christian affiliation), with 29% religiously unaffiliated and 7% saying they belong to religions other than Christianity, such as Judaism (2%), Islam (1%), Buddhism (1%) or Hinduism (1%).\n\nWithin these broad categories, the study finds shifts between sects of Christianity.\n\nSince 2007, Pew finds that all major subsets of Protestantism have shrunk: Evangelical Protestants represent 23% of US adults, down from 26%, Mainline Protestants now make up 11% of adults, down from 18%, and members of historically Black Protestant churches are 5% of all adults, down from 7%.\n\nAt the same time, the share of nondenominational Protestants remains small (7% in the new study) but is on the rise (up from roughly 5% in 2007).\n\nRelated articleThe politics of religion as Trump sells Bibles and Biden is criticized over Easter eggs\n\nStill, when coupled with other recent Pew surveys, the findings suggest that shifts in religious affiliations overall have stabilized in recent years. The share identifying as Christian and the share who say they are religiously unaffiliated has held roughly steady since 2020, and that’s true even within most birth cohorts, or groups of people born in the same decade.\n\nThere isno official, current government estimateof the religious beliefs and practices of the American public. The US Census Bureau is barred from measuring religious affiliation in mandatory data collection such as the decennial census. The Pew study is one of the most significant such private efforts, drawing on a very large, representative sample to generate estimates of the public’s religious affiliations and religiosity.\n\nResearchers collected data in the new release from 36,908 adults nationwide between July 2023 and March 2024. Pew previously conducted two similar studies in 2007 and 2014 using a different methodology than the current study; some measures in the poll are not comparable to previous studies.\n\nAmid religion’s shifting place in Americans’ personal lives, a sizable group are at least somewhat supportive of a more prominent role for religion in public life: 47% in the survey say that the federal government ought to declare the US a Christian nation, about half (52%) favor allowing teacher-led prayer that refers to Jesus in public schools with more (57%) in favor of prayer that references God but not a specific religion, and 53% are at least somewhat in favor of allowing cities and towns to display religious symbols on public property.\n\nSmaller shares are strongly in support of each of these measures (21% strongly favor declaring the US a Christian nation, 27% strongly favor teacher-led Christian prayers in public schools and 20% strongly favor allowing religious displays on public property), and support overall is concentrated among Christians (broad majorities of those who affiliate with non-Christian religions or who are religiously unaffiliated oppose each of these actions, while at least 6 in 10 Christians support each of them).\n\nAmericans’ overall perceptions of religion tilt positive, according to the survey, but appear to have cooled since 2014.\n\nOverall, 51% express mostly positive views of religious institutions across six questions on its role in society, with 21% expressing mixed views and 29% mostly negative.In 2014, 63% held mostly positive views with 18% negative across the same six questions. Americans are also more apt to say that religion does more good than harm (44%), outpacing the 19% who feel the opposite, but with roughly a third (35%) saying religion does equal amounts of good and harm.\n\nThe survey’s findings among younger Americans point to a possible continued decline in religious affiliation and practice, as younger people with religious upbringings appear less likely than older ones to carry those behaviors into adulthood.\n\nRelated articleSupreme Court to weigh constitutionality of nation’s first religious charter school\n\nFewer young adults who had a highly religious upbringing remain so as adults when compared with older adults, while those younger people with a non-religious upbringing are more likely to hold on to that view as adults.\n\nComparing the youngest and oldest groups in the poll, 51% of those born in the 1940s or earlier who, as children, attended religious services weekly and considered religion very important have the same degree of attachment to their religion now.\n\nAmong those born in the 1980s or later and who had a similarly religious upbringing, only about 3 in 10 have retained that same degree of religious involvement as adults (31% among those born in the ‘80s, 29% for those born in the ‘90s and 28% for those born between 2000 and 2006).\n\nOn the flipside, while older adults who were raised with a non-religious upbringing are about as likely as their highly religious counterparts to say they’ve retained those traits (50% for those born in the 1940s or earlier), younger Americans raised in non-religious households are even more likely than their more religious peers to continue that way in adulthood (69% among those born in the ‘80s, 72% for those born in the ‘90s and 76% for those born between 2000 and 2006).\n\nWhile the overall change in religious views over time has happened in similar ways across key demographic groups, there are differences in how it’s playing out by political ideology.\n\nRelated articleHarris visits Black churches in Georgia in ‘souls to the polls’ early voting push\n\nAmong people who call themselves liberals, just 37% now identify as Christian, down from 62% in 2007, and liberals are now more likely to say they have no religion (51%, up 24 points since 2007) than to consider themselves Christian. Among conservatives, by contrast, the share who are Christian has declined just 7 points to 82%.\n\nAmericans’ degree of religious engagement is also closely tied to their partisanship. The most religiously engaged people are most likely to consider themselves Republicans or Republican-leaning independents, while those with little engagement are broadly likely to be Democrats or Democratic-leaning.\n\nThis is especially true among White Americans, with smaller gaps by religiosity among Hispanic and Asian adults. Black Americans tend to be Democratic aligned regardless of their degree of religiousness.",
        "source_2": "Pew Research Center conducts the Religious Landscape Study (RLS) to provide authoritative estimates of the U.S. population’s religious composition, beliefs and practices.\n\nThe new RLS was conducted in English and Spanish from July 17, 2023, to March 4, 2024, among a nationally representative sample of 36,908 respondents.\n\nOur two previous Religious Landscape Studies, conducted in 2007 and 2014, were administered entirely by telephone. Because response rates to telephone surveys have dropped sharply over the past decade, we changed the design of the RLS in 2023-24.\n\nTo recruit people to take the survey, we used a method known as address-based sampling (ABS). This involved mailing invitation letters to randomly sampled addresses from the United States Postal Service’s Computerized Delivery Sequence File. This approach gave nearly all U.S. adults a chance of being selected to participate in the survey.\n\nPeople who received our invitation had the option of completing the survey online, on paper, or by calling a toll-free number and completing the survey by telephone with an interviewer. In total, 25,250 respondents participated online, 10,733 completed the survey on paper, and 925 participated by phone.\n\nThe survey is designed to be representative ofall 50 states and the District of Columbia. The study’s large size also makes it possible to describe the religious characteristics of 34 large metro areas\n\nThe data is weighted (using benchmarks from the U.S. Census Bureau and other sources) to be representative of the adult population of each state (and D.C.) and the overall U.S. adult population by gender, age, race, ethnicity, education and other categories. The survey’s margin of error for results based on the full sample is plus or minus 0.8 percentage points. The response rate is 20%.\n\nPrevious research has shown that people mayanswer some questions differentlywhen completing a survey online or on paper than they do when speaking to a live interviewer over the phone. This means that when we compare data from the three landscape studies to see how Americans’ religious beliefs and practices have changed over time, we must consider the possible effects of changing the primary mode of interviewing from telephone (in 2007 and 2014) to online and on paper (in 2023-24). These “mode effects” can be quite large on some survey questions but small or nonexistent on others.\n\nTo help determine whether the results of particular questions in the new RLS are – or are not – directly comparable with our previous landscape studies, we conducted a nationwide telephone survey alongside the RLS. It included all the questions in the 2023-24 RLS that previously appeared in the 2007 and 2014 surveys. We used the findings of this experimental “bridge study” to inform the discussion of long-term trends throughout this report. For more details, go toAppendix A.\n\nThis report was made possible by The Pew Charitable Trusts, which received support from the Lilly Endowment Inc., Templeton Religion Trust, The Arthur Vining Davis Foundations and the M.J. Murdock Charitable Trust.\n\nAfter many years of steady decline, the share of Americans who identify as Christians shows signs of leveling off – at least temporarily – at slightly above six-in-ten, according to a massive new Pew Research Center survey of 36,908 U.S. adults.\n\nThe Religious Landscape Study (RLS) is the largest single survey the Center conducts, aiming to provide authoritative figures on the size of U.S. religious groups because the U.S. census does not collect that information.\n\nWe have conducted three of these landscape surveys over the past 17 years, with more than 35,000 randomly sampled respondents each time. That’s enough to paint a statistical portrait of religion not only nationally, but also inall 50 states and the District of Columbia, as well as in 34 large metro areas.\n\nThis introductory essay walks through the big-picture trends: evidence both of a long-term decline in American religion and of relative stability in the last few years, since 2020 or so.\n\nThe first RLS, fielded in 2007, found that 78% of U.S. adults identified as Christians of one sort or another. That number ticked steadily downward in our smaller surveys each year and was pegged at 71% in the second RLS, conducted in 2014.\n\nThe latest RLS, fielded over seven months in 2023-24, finds that 62% of U.S. adults identify as Christians. That is a decline of 9 percentage points since 2014 and a 16-point drop since 2007.\n\nBut for the last five years, between 2019 and 2024, the Christian share of the adult population has been relatively stable, hovering between 60% and 64%. The 62% figure in the new Religious Landscape Study is smack in the middle of that recent range.\n\nThe largest subgroups of Christians in the United States are Protestants – now 40% of U.S. adults – and Catholics, now 19%. People who identify with all other Christian groups (including the Greek and Russian Orthodox Churches, the Church of Jesus Christ of Latter-day Saints, Jehovah’s Witnesses and many others) total about 3% of U.S. adults.\n\nBoth Protestant and Catholic numbers are down significantly since 2007, though the Protestant share of the population has remained fairly level since 2019 and the Catholic share has been stable since 2014, with only small fluctuations in our annual surveys.\n\nMeanwhile, the share of Americans who identify with a religion other than Christianity has been trending upward, though it is still in single digits.\n\nToday, 1.7% of U.S. adults say they are Jewish when asked about their religion, while 1.2% of respondents in the new survey are Muslim, 1.1% are Buddhist, and 0.9% are Hindu.\n\nReligiously unaffiliated adults – those who identify as atheists, agnostics or as “nothing in particular” when asked about their religion – account for 29% of the population in the new RLS. The size of the religiously unaffiliated population, which we sometimes call religious “nones,” has plateaued in recent years after a long period of sustained growth.\n\nOther standard survey measures contribute to this emerging picture of stability:\n\nMoreover, the survey shows that large majorities of Americans have a spiritual or supernatural outlook on the world.\n\nBut, despite these signs of recent stabilization and abiding spirituality, other indicators suggest we may see further declines in the American religious landscape in future years.\n\nNamely, younger Americans remain far less religious than older adults.\n\nFor example, the youngest adults in the survey (ages 18 to 24) areless likelythan today’s oldest adults (ages 74 and older) to:\n\nAnd the youngest adults aremore likelythan the oldest Americans to be religiously unaffiliated (43% vs. 13%).\n\nAlso, younger Americans are less likely than older adults to say they were raised in religious households.1And, compared with older adults, fewer young people who were raised in religious households haveremainedreligious after reaching adulthood.\n\nThese are among the key findings of Pew Research Center’s 2023-24 Religious Landscape Study. Like the previous studies, the new survey offers a great deal of information on what Americans believe and how they practice a wide variety of religions.\n\nThe RLS and other recent Pew Research Center surveys suggest that two things are happening simultaneously in American religion:\n\nOne driver of the long-term trend is “generational replacement.” Older, highly religious, heavily Christian generations are passing away. The younger generations succeeding them are much less religious, with smaller percentages of Christians and more “nones.”2\n\nIn addition, the landscape surveys show that between 2007 and 2023-24, each birth cohort has become less religious, by several measures, as it has aged.\n\nThroughout this report, we use “birth cohort” to refer to a group of people who were born in the same years. We categorize U.S. adults into seven cohorts: people born in the 1940s (or earlier) and those born in the 1950s, the 1960s, the 1970s, the 1980s, the 1990s, and from 2000 through 2006.\n\nOne advantage of analyzing these cohorts rather than conventional “generations” (like the Silent Generation, Baby Boomers, Gen X, Millennials and Gen Z) is that most of the cohorts are of equal length (a decade long).\n\nAnother advantage is that the decade-long cohorts may not carry as manyassumptions– or stereotypes – as the familiar generations do.\n\nFor example, people within the oldest and youngest cohorts, as well as those in between, have become less likely to say they pray daily, less likely to identify with a religion (including Christianity), and less likely to believe in God or a universal spirit with absolute certainty.\n\nSince 2020, however, our surveys indicate that the religiousness of most birth cohorts has remained relatively stable. For instance, people born in the 1950s are about as likely to report praying daily in the 2023-24 RLS (53%) and the 2024 National Public Opinion Reference Survey, or NPORS (57%), as they were in the 2020 NPORS (55%).\n\nAdditionally, the new RLS finds that the youngest cohort of adults is no less religious than the second-youngest cohort in a variety of ways.3Americans born in 2000 through 2006 (those ages 18 to 24 in the 2023-24 RLS) are just as likely as those born in the 1990s (now ages 24 to 34) to identify as Christians, to say religion is very important in their lives, and to report that they attend religious services at least monthly.4\n\nTime will tell whether the recent stability in measures of religious commitment is the beginning of a lasting shift in America’s religious trajectory. But it is inevitable that older generations will decline in size as their members gradually die. We also know that the younger cohorts succeeding them are much less religious.\n\nThis means that, for lastingstabilityto take hold in the U.S. religious landscape, something would need tochange.For example, today’s young adults would have to become more religious as they age, or new generations of adults who are more religious than their parents would have to emerge.\n\nThe dynamics of religion and spirituality among young people are key to understanding the country’s recent religious trajectory. The large size of the new survey makes it possible to paint a religious and spiritual profile of the nation’s youngest adults with unique precision.\n\nBy a number of traditional measures, today’s young adults exhibit far lower levels of religiousness than older adults. For example, 27% of adults between the approximate ages of 18 and 24 in the new survey say they pray daily, as do 31% of those ages 24 to 34. But among adults ages 54 and older, half or more say they pray daily.\n\nYoung adults also report attending religious services less often than older adults do, and they express lower levels of belief in God or a universal spirit. Compared with older adults, fewer young people identify as Christians, and more say they don’t identify with any religion.\n\nOn the survey’s questions touching on matters of spirituality, however, the age gaps are smaller.\n\nFor example, eight-in-ten or more adults in all age categories say they believe people have a soul or spirit in addition to their physical bodies.\n\nAnd about seven-in-ten adults ages 18 to 24 and 75% of those ages 24 to 34 believe there is something spiritual beyond the natural world, only modestly below the 81% of the oldest adults (ages 74 and older) who say this.\n\nIn the rest of this Overview, we explore these and other key topics in detail:\n\nIn the new Religious Landscape Study, 62% of U.S. adults describe themselves as Christians. The Christian share of the population is now 9 points lower than when the landscape study was last conducted in 2014, and 16 points lower than in 2007.\n\nThe share of Americans who say they have no religion – identifying, instead, as atheist, agnostic or as “nothing in particular” – stands at 29% in the new RLS, up from 23% in 2014 and 16% in 2007.\n\nThe long-term decline in the Christian share of the population and growth of religious “nones” is demographically broad-based. There are fewer Christians and more “nones” among men and women; people in every racial and ethnic category; college graduates and those with less education; and residents of all major regions of the country.\n\nBut the changes are much more pronounced among ideological liberals than conservatives. Today, 37% of self-described liberals identify with Christianity, down from 62% in 2007, a 25-point decline. Meanwhile, 51% of liberals now say they havenoreligion, up from 27% in 2007, a 24-pointincrease. There are now more religious “nones” than Christians among liberals, a reversal since 2007.5\n\nThere also are fewer Christians and more “nones” among conservatives. But the changes in the religious composition of conservatives have been much less pronounced than among liberals, and a large majority of conservatives continue to identify with Christianity.6\n\nThese changes within ideological categories resemble long-term trends within political parties. Aprior Pew Research Center analysisshows that both Republicans and Democrats include fewer Christians and more religious “nones” today than they did a decade or more ago. But the decline of Christianity and rise of religious “nones” has been much more pronounced among Democrats than Republicans.7\n\nFor a detailed discussion of trends in the religious composition of demographic groups, refer toChapter 1.\n\nIn the 2023-24 RLS, about four-in-ten U.S. adults identify as Protestants. That is 11 points lower than in the 2007 RLS.\n\nAll three major Protestant traditions have seen their population shares tick downward at least slightly over that period:\n\nLike the overall Christian share of the population, however, the total Protestant share of the population has been quite stable in recent years, hovering between 40% and 42% since 2019.\n\nThe Catholic share of the population has been steady over an even longer period. In 11 Pew Research Center surveys conducted since 2014, all but one have found between 19% and 21% of respondents identifying as Catholic.\n\nMembers of the Church of Jesus Christ of Latter-day Saints (widely known as Mormons) account for 2% of respondents in the new RLS, which is virtually unchanged from both the 2007 and 2014 landscape surveys. Orthodox Christians make up 1% of the U.S. population. Jehovah’s Witnesses and other, smaller Christian groups round out the country’s Christian population.\n\nMany Protestant denominational families are slightly smaller today than they were in 2014 – at least nominally, even if some of the changes are too small to be statistically significant.\n\nOne exception to this pattern is nondenominational Protestantism. The share of Americans identifying with this group is slightly higher today than it was in 2014 (7.1% vs. 6.2%).8\n\nBaptists continue to be the single largest Protestant denominational family in America. Today, 12% of U.S. adults are Baptists, down from 15% in 2014 and 17% in 2007.\n\nMembers of Pentecostal churches account for 4% of the U.S. adult population.\n\nMethodists and Lutherans each make up 3% of the population, while 2% of U.S. adults identify as Presbyterians.\n\nDetailed information about Protestant denominations is not available from Pew Research Center’s annual NPORS, making it difficult to know whether the size of denominations has stabilized in recent years.\n\nOne unique feature of the Religious Landscape Study (RLS) is its detailed questions about religious affiliation. All respondents are asked an initial question about their religious identity (“Are you Protestant, Catholic … Jewish, Muslim, etc.?”).\n\nThen, Protestants are asked a second question to get more information about what type of church they identify with (“Are you Baptist, Methodist, Lutheran, etc.?”).\n\nFinally, depending on how they answer that second question, Protestants are asked a third question to try to determine which denomination they identify with. (Complete details on how these branching questions work and the exact wording of these questions are available in the questionnaires. Refer to theEnglish paper questionnaire;Spanish paper questionnaire; andcombined English/Spanish questionnaire for the web/phone administration.)\n\nPew Research Center researchers then take the most specific information respondents provide about their denominational identity and use it to group Protestants into one of three major traditions –the evangelical Protestant tradition, mainline Protestant tradition, or the historically Black Protestant tradition.These divisions within Protestantism are important, because each tradition has its own, distinctive set of beliefs, practices and histories.\n\nFor example, churches in the evangelical tradition tend to share the conviction that personal acceptance of Jesus is the only way to salvation; to emphasize bringing other people to the faith; and to have originated in separatist movements against established religious institutions. Churches in the mainline tradition, by comparison, tend to take a less exclusive view of salvation and to place more emphasis on social reform. Churches in the historically Black Protestant tradition have been shaped uniquely by the experiences of slavery and segregation, which put their religious beliefs and practices in a special context.\n\nIt’s important to note that not all Protestant respondents identify with a specific denomination. Many Protestants identify as “just Baptist” or “just Methodist,” say they don’t identify with any particular denomination, or describe themselves as “just Christian.” In these cases, respondents are categorized into one of the three Protestant traditions based on their answers to a question asking whether they think of themselves as born-again or evangelical Christians, and/or a question asking about their race. Protestants whodoidentify with a specific denomination are grouped into one of the three Protestant traditions basedexclusivelyon their denominational affiliation.\n\nFor example, all Southern Baptists are coded as evangelical Protestants regardless of their race, and all United Methodists are coded as mainline Protestants regardless of their answer to the question about whether they think of themselves as a born-again or evangelical Christian. Complete details on the categorization of Protestantism are available inAppendix B.\n\nThe Southern Baptist Convention (SBC) – which Pew Research Center categorizes as part of theevangelical Protestant tradition– remains the nation’s single largest Protestant denomination. Today, 4.4% of U.S. adults say they identify with the SBC, down from 5.3% in 2014 and 6.7% in 2007.\n\nSome of the other large evangelical denominational groupings include:\n\nThe United Methodist Church – amainline Protestant denominationin the Center’s coding – makes up 2.7% of the U.S. population, compared with 3.6% in 2014 and 5.1% in 2007. The United Methodist Church has splintered in recent years, and many of its former churches have “joined the more conservative Global Methodist Church,” according toThe Associated Press.10\n\nThe National Baptist Convention, USA – a denomination in thehistorically Black Protestant tradition– was named by 1.0% of survey respondents. Other large historically Black Protestant denominations in the survey include:\n\nThe share of Americans who identify with a religion other than Christianity has been trending upward, from 4.7% in 2007 to 7.1% today.\n\nOverall, 1.7% of adults identify as Jewish when asked about their religion – on par with results from the previous landscape studies and Pew Research Center’s2020 survey of Jewish Americans.\n\nMuslims, Buddhists and Hindus each account for roughly 1% of the U.S. adult population. All three of these groups are larger today than they were in 2007.\n\nAn additional 0.3% of respondents identify with other world religions (including Bahai’ism, Daoism, Rastafarianism, Sikhism and traditional African religions).\n\nAnd 1.9% of U.S. adults identify religiously as something else, including 1.1% of respondents who identify with Unitarianism or other liberal faiths, and 0.7% who identify with New Age groups.11\n\nAbout 14% of U.S. adults who were born outside the country identify with religions other than Christianity, including 4% of U.S. immigrants who are Muslim, 4% who are Hindu, and 3% who are Buddhists.12\n\nMost immigrants to the U.S. who were born in other parts ofthe Americasare Christian (72%), including 45% who are Catholic. Among immigrants fromEurope, 57% are Christian, 8% identify with other religions, and 34% are religiously unaffiliated.\n\nImmigrants born inthe Asia-Pacificregion are divided about evenly between Christians, adherents of non-Christian religions (including 14% who are Hindu, 11% who are Buddhist and 7% who are Muslim), and the religiously unaffiliated.13\n\nThe survey did not include enough respondents born in the Middle East-North Africa or sub-Saharan Africa regions to be able to report on them separately.\n\nAmong respondents who were born in the U.S. but had at leastone parentborn outside the U.S. (i.e.,second-generationAmericans), 10% identify with religions other than Christianity.\n\nBy comparison, among people born in the U.S. to parentsbothof whom also were born in the U.S. (i.e.,at least third-generationAmericans), 5% identify with non-Christian religions.\n\nMore broadly, the survey finds that the long-term decline in Christianity and growth of the religiously unaffiliated population is evident among immigrants, second-generation respondents (people who were born in the U.S. but had at least one parent born elsewhere), and people whose families have been in the U.S. for three generations or more.\n\nFor example, among respondents born outside the U.S., the Christian share of the population declined from 75% to 58% between 2007 and 2023-24. Over the same period, the religiously unaffiliated share of this group (immigrants to the U.S.) grew from 16% to 26%, and the share identifying with religions other than Christianity grew from 8% to 14%.\n\nFor more details on trends in the religious composition of U.S. adults, refer toChapter 1.\n\nLike theU.S. public as a whole, both Christians and religious “nones” have experienced a decline in the shares who are White.\n\nAmong Christians in the new survey, 61% are White (and non-Hispanic), 18% are Hispanic, 13% are non-Hispanic Black, 4% describe themselves as multiracial or in another way, and 3% are non-Hispanic Asian.\n\nIn 2007, by comparison, 70% of Christians said they were White, 13% were Hispanic, 12% were Black, 3% identified as multiracial or in another way, and 1% were Asian.\n\nIn the new survey, 92% of respondents in the historically Black Protestant tradition are Black themselves, while 4% are Hispanic and 3% are White.\n\nIn most other Christian traditions large enough to be analyzed in the survey, seven-in-ten or more adherents are White. Catholics are an exception: 54% in the new survey are White, while 36% are Hispanic, 4% are Asian, and 2% are Black.\n\nNine-in-ten Jewish respondents in the new survey are White. Among Hindu respondents, 84% are Asian, as are 56% of Buddhists in the survey.\n\nMuslim respondents in the new study include 30% who are White, 30% who are Asian, 20% who are Black and 11% who are Hispanic.\n\nRoughly three-quarters of atheists (75%) and agnostics (74%) in the new survey are White; fewer people who describe their religion as “nothing in particular” are White (57%).\n\n(For a detailed discussion of the racial and ethnic composition of religious groups, refer toChapter 24.)\n\nThe survey asked people who attend religious services at least a few times a year about the racial and ethnic makeup of the congregation they attend. And it asked a similar question about the racial and ethnic composition of the congregation that respondents attended as children.\n\nAmong people who attend religious services, roughly one-third currently attend a congregation where they, themselves, arenotpart of a racial or ethnic majority.This includes 11% who say that most of their fellow worshippers have a different race or ethnicity than they do and 21% who say that no one racial or ethnic group makes up a majority.\n\nFewer people (roughly one-fifth of respondents) say theygrew upattending a congregation where they, themselves, weren’t in a racial or ethnic majority.This includes 10% who grew up going to religious services at least a few times a year at a house of worship where most people belonged to a different race or ethnicity than they did, and an additional 10% who say that no single racial or ethnic group predominated at those services.\n\nFor more on race in religious congregations, refer toChapter 9.\n\nRecentnews accountssuggest that among the youngest Americans, men are more religious than women. This would be a major reversal from the past. Historically, U.S. women consistently have exhibited higher levels of religiousness (on average) than men.14\n\nIn the new RLS, women continue to report higher levels of religious affiliation, belief and practice than men do. At the same time, therearesigns that the gender gap in religion is narrowing, as it is smaller among younger people than among older Americans.\n\nFor example, in 2007, the share of women who said they pray every day exceeded the share of men who did so by 17 percentage points. In the new survey, women still report praying at higher rates than men. But the difference is slightly narrower, at 13 points.\n\nAmong the oldest adults in the new survey (ages 74 and older), the share of women who say they pray every day is 20 points higher than among men. By contrast, among the youngest adults (ages 18 to 24), the share of women who say they pray daily (30%) is similar to the share of men who say they do the same (26%); the 4-point gap is not statistically significant.\n\nWhile the gender gap in American religion appears to be narrowing,there are still no birth cohorts in which men are significantly more religious than women.In every age group, women are at least as religious as men, and in many birth cohorts, women are significantlymorereligious than men.\n\nThe survey shows that Americans’ current religious identities, beliefs and practices are strongly linked with their upbringing. People who say they were raised in religious homes are much more likely to be religious as adults.\n\nMore than half of people who say religion was very important in their families while they were growing up also say religion is very important to them today. By contrast, among people who say religion was not too important or not at all important to their families during childhood, just 17% say religion is very important to them today.\n\nThe survey finds a similar pattern on questions about religious attendance. People who grew up attending religious services regularly (at least once a month) are more than twice as likely as those whodidn’tgrow up attending services regularly to say they now attend religious services at least monthly.\n\nAnd among all respondents who were raised in a religion (i.e., among those raised Protestant, Catholic, Jewish, Muslim, or as adherents of another religious tradition), those who were raised in highly religious homes are much more likely to have retained their childhood religious identity.\n\nIndeed, 74% of people who were raised in a religion and grew up attending weekly religious services in a family in which religion was very important still identify with their childhood religion today; 15% of respondents who grew up in this kind of environment now say they have no religion, and 10% identify with a religion different from the one in which they were raised. (Refer to thesection on religious switchingfor details about retaining or leaving one’s childhood religion in adulthood.)\n\nBy contrast, among people who were raised in a religion but grew up seldom or never attending religious services – and in a family in which religion was not too important or not at all important – fewer than half still identify with their childhood religion. Instead, most now say they have no religion (40%) or identify with a religion different from the one in which they were raised (16%).\n\nIn short, for many people, a religious upbringing leads to a religious adulthood.15But the survey also indicates that raising children in a religious environment is no guarantee that those children will grow up to be religious as adults.\n\nIndeed,40% of U.S. adults say they attend religious serviceslessoften today than they did as children.Just 5% say they attend religious servicesmoreoften today than they did as kids.\n\nAnd 32% of U.S. adults say religion is less important to them today than it was to their families when they were growing up.By contrast, 18% say religion is more important to them today than it was to their families when they were children.\n\nCompared with their elders, today’s youngest adults are less likely, by a variety of measures, to say they had a religious upbringing. For example, more than nine-in-ten adults ages 74 and older say they were raised in a religion, including 89% who were raised Christian. Among U.S. adults who were roughly between 18 and 24 when the survey was conducted, 75% were raised in a religion, including 67% who were raised Christian.\n\nTwo-thirds of the oldest Americans say they grew up going to religious services at least once a week. Only about half of the youngest adults say the same.\n\nAnd while half of the oldest adults say that as children they received a lot of formal religious education (i.e., seven or more years), just 19% of today’s youngest adults say the same.People in the youngest age group are about twice as likely as those in the oldest age group to say they received no formal religious education at all (42% vs. 20%).\n\nThere is one exception to this pattern: Young adults arenotless likely than older Americans to say religion was very important to their families when they were children. Among adults who were roughly between the ages of 18 to 24 when the new survey was conducted, 47% say religion was very important to their families when they were growing up. Among adults ages 74 and older, 44% say the same.\n\nMoreover, the persistence of a high level of religiousness from childhood into adulthood – the “stickiness” of a religious upbringing – appears to be declining, while the stickiness of a nonreligious upbringing seems to be increasing.\n\nIn the oldest cohort of U.S. adults (ages 74 and older), 51% of those who say they grew up attending religious services weekly in families for whom religion was very important arestillhighly religious in these ways (i.e., they still go to services weekly and still say religion is very important in their lives).\n\nAnd among people in this oldest cohort, 50% of those who say they grew up seldom or never attending religious services in families in which religion was not too important or not at all importantstilldescribe themselves as nonreligious in these ways (i.e., they still rarely or never go to services, and still say religion is not important in their lives).\n\nIn other words,a highly religious upbringing has proved to be just as “sticky” as a nonreligious upbringing over the lifetimes of the oldest Americans(now 74 and older).\n\nBy contrast, among the youngest U.S. adults in the survey (now ages 18 to 24), just 28% of those raised in highly religious homes are, today, highly religious themselves. Meanwhile, 76% of young adults who grew up rarely or never attending services, in families in which religion was unimportant, still say theydon’tattend religious services and that religion isnotimportant to them. In other words, a highly religious upbringing has been much less persistent (or “sticky”) than a nonreligious upbringing so far in the lifetimes of the youngest U.S. adults.\n\nOf course, it’s possible that the effect of a highly religious upbringing just needs time to develop. Maybe the people in the youngest cohort will grow more religious as they age, and if they are surveyed again in 20 or 30 years, a highly religious upbringing will appear stickier than it does now. However, there is no evidence in the three Religious Landscape Studies conducted since 2007 that any birth cohorts have grown more religious over the long term, as discussed below in thesection on how religious beliefs change as people age.\n\nFor more information on Americans’ religious upbringing, refer toChapter 4.\n\nAmong parents of minor children – i.e., people currently raising children under 18 in their homes – 40% say they send their child or children to some kind of religious education or private religious school.\n\nBy comparison, 51% of parents say they, themselves, received a fair amount or a lot of religious education as children, while 16% received a little, and 33% had none.\n\nHowever, these questions about the respondent’s own religious education and the religious education of their kids are not exactly parallel. The survey asked respondents to report how many years of religious education they received as children, whereas parents were asked whether their minor children arecurrentlyenrolled in a religious private school or other religious education programs. Some parents may not have children enrolled right now but may enroll them later or may have enrolled them in the past.\n\nAmong parents living with minor children in their homes, 42% say they read scripture or pray with their children.The survey did not ask respondents whether (or how often) they used to read scripture with their parents or prayed with their parents when they were children themselves.\n\nOverall, 26% of people who are currently raising children say they go to religious services at least weekly, and an additional 9% say they go to religious services once or twice a month. The survey did not ask current parents whether they take their children with them when they go to religious services. But, even if all 35%dotake their children with them to services, this still would be a much smaller percentage than the roughly two-thirds of parents who say they went to services at least monthly when they were growing up.16\n\nFor more on how parents in different religious traditions are raising their children, refer toChapter 6.\n\nIn the new survey, 26% of married adults say their spouse has a religious identity different from their own. That’s virtually identical to what we found in the 2014 RLS (25%).\n\nOne-quarter of married Catholics in the new survey say they are married to a non-Catholic spouse, including 14% who are married to a spouse from another Christian tradition and 9% who are married to a spouse with no religion.\n\nAbout one-in-five married Protestants say they have a non-Protestant spouse, including 8% who have a spouse who identifies with another Christian faith and 10% whose spouse has no religion.\n\nRoughly one-third of married “nones” say their spouse identifies with some religion, in most cases a branch of Christianity.\n\nProtestants, Catholics and Jews who are in religiously mixed marriages are far less religiously active, on average, than those with spouses who share their religion.\n\nFor example, 68% of Protestants married to other Protestants say religion is very important in their lives, compared with 38% of Protestants married to non-Protestants who say this. And 49% of Catholics married to fellow Catholics say they go to church at least once or twice a month, compared with 28% of Catholics married to non-Catholics who say they attend this often.\n\nThese differences carry over into child-rearing. Among parents of minor children, Protestants married to fellow Protestants are significantly more likely than Protestants married to non-Protestants to say they pray or read scripture with their kids and send their children to religious education. For the most part, a similar pattern holds for Catholics.\n\nThese patterns raise an interesting question: Does being in a religiously mixed marriage make people less religious, or are nonreligious people more likely to enter religiously mixed marriages? The survey cannot answer this question; it’s possible that both things are at play.\n\nMeanwhile, religiouslyunaffiliatedpeople married to spouses who identify with a religion tend to be a little more religiously active, on average, than religiously unaffiliated people married to spouses who are also unaffiliated.\n\nFor instance, 12% of married “nones” whose spouses identify with a religion say they pray daily, compared with 9% of married “nones” who have a fellow “none” as a spouse. And 13% of religious “nones” who are currently parenting a minor child and who are married to a religiously affiliated spouse say they send at least one of their children to religious education, compared with 5% of religious “nones” who are married to a religiously unaffiliated spouse.17The differences are quite small, though, as are the overall shares of “nones” who say they are religiously active in these ways – regardless of whether they are married to a fellow “none,” or not.\n\nFor more on religious intermarriage, refer toChapter 4.\n\nOverall, 35% of U.S. adults have switched religions between childhood and adulthood. That is, they say they currently identify with a religion (or with no religion) that is different from the religion in which they were raised.\n\nThis figure includes people who switched from one Christian religious tradition to another (e.g., those who say they were raised Protestant but now identify as Catholic or vice versa), as well as people who switched from one non-Christian religion to another (e.g., those who say they were raised Hindu and now identify as Buddhist or vice versa).18It also includes people who switch from identifying with a religion to describing themselves as religiously unaffiliated (or vice versa).\n\nThe share of people in the new survey who say they switched religions is on par with the share who said this in 2014.\n\nWhen we divide the data into just three categories – Christianity, other religions and no religion – it shows very clearly that Christianity loses far more people than it gains through religious switching. Fully 80% of U.S. adults say they were raised Christian, but upward of a quarter of them (22% of all U.S. adults) no longer identify as Christians.\n\nWe use the phrase “religious switching” rather than more familiar terms like “conversion” because changes in religious identity occur in all directions, including from having a religion to having no religion. Also, these changes can take place without any formal ritual or declaration.\n\nWe measure religious switching with two survey questions. The first asks, “What is your present religion, if any?” The second asks, “Thinking about when you were a child, in what religion were you raised, if any?” By comparing each respondent’s answers to these questions, we can see whether they still have the same religion in which they were raised or whether they have switched.\n\nHowever, these questions may not capture all the switching that takes place. For instance, they would not reveal whether a person has switched multiple times, or whether a person left their childhood religion and later returned to it. Our analysis of religious switching focuses on the difference (if any) between a respondent’s religious identity at the time of the survey and during childhood, not the steps that may have occurred in between.\n\nBy contrast, religious “nones” gain far more people than they lose through religious switching. Overall, 13% of U.S. adults say they were raised in no religion. But fully 20% of U.S. adults now say they are religiously unaffiliated after having been raised in a religion, including 19% who were raised Christian and 1% who were raised in other religions.\n\nExpressed as a ratio, these figures mean thatthere are six former Christians for every convert to Christianity in the United States.The balance is especially lopsided for Catholicism (which loses 8.4 people through religious switching for every convert to the religion). But Protestants also lose more people than they gain through switching, by a ratio of 1.8 to one.\n\nIn stark contrast,the religiously unaffiliated gain nearly six people for every person they lose through religious switching.That is, there are about six times as many Americans who say they were raised in a religion and no longer identify with a religion than there are who say they were raised in no religion but now identify with one.\n\nIn the aggregate,religions other than Christianity gain about as many people as they lose through religious switching.Overall, 3% of the public identifies with a religion other than Christianity after having been raised Christian or with no religion (or they did not answer the question about their childhood religion). And 2% of U.S. adults say they were raised in a religion other than Christianity but no longer identify with it.\n\nThe survey shows big differences in religious switching patterns across age groups, which helps explain the long-term declines in religious affiliation, especially for Christianity. Vast majorities of older adults (89% of those born in the 1950s or earlier) say they were raised Christian, and most of them are still Christian today. Relatively few older adults say either that they were raised in no religion or that they have become religiously unaffiliated after having been raised as Christians.\n\nSmaller majorities of young adults were raised as Christians, and fewer of them have retained their Christian identity in adulthood. Young people are more likely than older adults to have been raised in no religion and, also, more likely to have become religiously unaffiliated after having been raised as Christians.\n\nInterestingly, among the youngest adults – those born between 2000 and 2006, who were ages 18 to 24 when the survey was conducted – the share who were raised Christian and are still Christian is about as high as among those born in the 1990s, who were 24 to 34 when the survey was conducted (41% vs. 42%). And the youngest cohort is slightlylesslikely than the second-youngest cohort to have left Christianity.\n\nJump toChapter 2to see the retention rates of different religious groups (i.e., what percentage of all the people raised in each group still identify with that group today).\n\nWhen asked how their levels of spirituality may have changed over the course of their lifetimes, Americans who say they have becomemorespiritual outnumber those who say they have becomelessspiritual by a roughly four-to-one margin (43% vs. 11%).\n\nMoreover, the survey finds thatAmericans of all ages are more likely to say their spirituality has grown stronger than to say it has weakened.19\n\nLarge majorities of the U.S. public believe that people have a soul or spirit in addition to their physical bodies, that there is something spiritual beyond the natural world, and that there is an afterlife.\n\nAnd although younger Americans are lesstraditionallyreligiousthan older adults (as measured by rates of prayer, identifying with a religious group, attending religious services, and some other beliefs and practices), the age gaps are much smaller on several of the survey’s questions aboutspirituality.20\n\nFor instance, 82% of adults who were roughly between the ages of 18 and 24 when the survey was conducted say they believe people have a soul or spirit in addition to their physical body – only slightly lower than the share of today’s oldest adults who affirm the same belief.\n\nAnd 63% of today’s youngest adults say they feel a deep sense of wonder about the universe at least monthly, which is somewhat higher than the share of today’s oldest adults who say the same.\n\nThe survey finds that Americans who say their spirituality has increased are more likely than other adults (especially those who say their spirituality has declined) to say they regularly feel awe at nature’s beauty, feel a sense of spiritual peace, and experience the presence of something from beyond this world.\n\nAmericans who say their spirituality has grown also are more inclined than others to say they believe in God or a universal spirit, and to say they pray daily.\n\nThese results suggest that spirituality and religion are not necessarily in tension with each other. We know from previous research that many people viewspirituality and religion as complementary; some see no difference between them.\n\nIndeed, the new survey finds that people who identify with a religion aremorelikely than religiously unaffiliated Americans to say they have grown increasingly spiritual during their lives.\n\nReligiously affiliated people also are more inclined than religious “nones” to believe in God or a universal spirit, to pray daily, and to report that they experience a variety of spiritual sensations, such as “the presence of something from beyond this world.”\n\nAmong the “nones,” those who say they’ve grownmore spiritualduring their lives are more likely than other religiously unaffiliated people to say that people have souls or spirits in addition to their physical bodies, that there is something spiritual beyond the natural world, and that they regularly feel a sense of awe at the beauty of nature.\n\nThe 2023-24 RLS finds a substantial age gap in attendance at religious services. Most young adults say they go to religious services no more than a few times a year. Indeed, among people born since the 1980s, about half or more say theyseldomorneverattend religious services.\n\nBy comparison, older adults report attending religious services at far higher rates. Furthermore, 57% of people in the oldest cohort say they are members of a religious congregation, compared with 27% of the youngest adults.\n\nDoes this mean that attendance at religious services is declining? Not necessarily. The age gap, by itself, is notproofthat fewer people are attending services, because it is theoretically possible that people participate in religious services at higher rates as they get older. Perhaps today’s young adults will go to a church, synagogue, mosque or other house of worship more often when they reach middle age or retirement age than they do today.\n\nMoreover, we do not have a clear, long-term trend line for attendance at religious services because the new survey’s findings about rates of religious attendance cannot be directly compared with the previous landscape studies.\n\nThe earlier studies in 2007 and 2014 were conducted by telephone, while the new survey was conducted mainly online or on paper.Previous researchshows that these different ways (or “modes”) of conducting surveys produce significantly different results on the question “How often do you attend religious services?” This makes it hard to determine, over the long term, how much religious attendance has changed.\n\nHowever, the Center’s telephone surveys were showing a decline in religious attendance in the years before we switched to online/paper surveys. The share of Americans who reported attending religious services at least monthly dropped from 54% in 2007 to 50% in the 2014 Religious Landscape Study and had fallen to 45% by2018-19(which is when the Center last regularly conducted telephone surveys that asked about religious attendance).\n\nBut theshort-termtrend line for the share of Americans who attend religious services at least monthly is pretty flat.In Pew Research Center’s 2020 NPORS, 33% of U.S. adults reported attending religious services at least once or twice a month. That’s identical to what we found in the 2023-24 RLS and very similar to the 32% measured in the 2024 NPORS.\n\nWhen asked to describe how their own religiousness has changed over their lifetimes, the most common response people give is that there has been no clear change in either direction – up or down – over the course of their lives (44% of U.S. adults say this). This includes people who say they have sometimes grown more religious and other times less religious; people who say their level of religiousness has not changed very much; and people who don’t answer the question. This is the most common kind of response among respondents in every age category.\n\nAmong people who say their religiousnesshaschanged over the course of their lives, about equal shares say they have become less religious (29%) and more religious (28%).\n\nThe new RLS also finds that moreyoungadults say their religiousness hasdecreasedthan say it has increased. By contrast,olderU.S. adults are more likely to say their religiousness hasincreasedthan that it has decreased.21\n\nHowever, on the questions in the new survey thatcanbe directly compared with the previous studies,there is no evidence that people in older birth cohorts have grown more religious between 2007 and today.\n\nIn the three Religious Landscape Studies conducted over the past 17 years, there are no birth cohorts – neither the oldest Americans, nor the youngest, nor any cohort in between – that have grown more prayerful, more certain in their belief in God, more likely to believe in an afterlife (heaven, hell or both), or more likely to identify with a religion, including Christianity.\n\nThis may seem at odds with the retrospective answers that survey respondents give to questions about how their own religiousness and spirituality have changed.As previously noted, about four times as many U.S. adults say they have becomemorespiritual (43%) as say they have becomelessspiritual (11%) over their lifetimes, while nearly equal shares say they have becomemorereligious (28%) andlessreligious (29%).\n\nBut substantial numbers of Americans say they haven’t really changed spiritually (46%) or religiously (44%). And the answers people give to these questions may be shaped by many factors, such as how desirable they feel it is to be spiritual and/or religious, and how they understand the meaning of those terms.\n\nAnother limitation in understanding how religiousness tends to change as people age is that Pew Research Center’s data on many questions about religion goes back no further than the first Religious Landscape Study in 2007. That 17-year span may not be long enough to capture all the change that has occurred in older birth cohorts. For a longer perspective, we turned to the General Social Survey (GSS), a national survey that has been conducted every year or two since 1972.\n\nThe GSS shows that peopledotend to become more prayerful as they get older. For example, when people born in the 1960s were just entering adulthood in the early 1980s, 36% said in the GSS that they prayed on a daily basis. By the late 2010s, when people in this birth cohort were in their late 40s and 50s, 64% said they prayed daily. The GSS also reports that people born in the 1950s and 1970s exhibited similar long-term increases in rates of daily prayer.\n\nBut the GSS suggests that people do not become more likely to identify with a religion as they get older. There is also little evidence in the GSS that as Americans get older, they tend to become more likely to believe in God or to attend religious services regularly.\n\nFor more analysis of GSS data on how the religiousness of people in different birth cohorts has changed or stayed the same over time, refer toAppendix C.22\n\nAs the Christian share of the U.S. adult population has declined in recent decades and the public has come to look less religious on a variety of measures, the question arises whether these changes are evidence of religious decline across the board or, instead, a hollowing out of the “religious middle.”\n\nThat is, are religious beliefs and practices declining all across the religious spectrum? Or is there a decline only in the share of the population with medium levels of religiousness, accompanied by stability or even growth at both ends of the spectrum of religiousness – resulting in more highly secular people, more highly religious people, and fewer people who are just moderately religious?\n\nThe new RLS indicates that the long-term changes in American religion are broad-based andnota hollowing out of the religious middle.\n\nPerhaps the easiest way to illustrate this is by looking at trends in prayer frequency over time. This is the new study’s best indicator of religiousness that can safely and directly be compared with previous RLS results.23The share of Americans who say they pray daily is clearly down. And the share of Americans who say they seldom or never pray is clearly up. Meanwhile, the share of Americans who say they occasionally pray (on a weekly or monthly basis) is relatively stable. There is no indication of a hollowing out of the “religious middle” on this key indicator.\n\nThe survey finds a similar pattern in questions about belief in God. The share of Americans who say they believe in God or a universal spirit with absolute certainty has clearly declined, while nonbelief is trending upward. And the share of Americans occupying the middle ground on this question – saying they believe in God but with less than absolute certainty – shows no signs of hollowing out, but rather is rising. The share of adults in the new survey who believe in God but with less than absolute certainty is higher than it has ever been in an RLS survey.24\n\nAnother way to assess the evidence for a hollowing out of the religious middle is to look at differences across age groups within the new survey. This allows us to examine additional indicators of religiousness, because looking just at the results of thenewsurvey sidesteps the difficulties posed by the change of survey modes between the previous two Religious Landscape Studies (conducted by telephone) and the new one (conducted mainly online and on paper).\n\nFor this analysis, we used four key questions: prayer frequency, belief in God and/or a universal spirit, religion’s importance, and religious service attendance. Responses to each question were assigned numbers from 0 (low) to 2 (high) as follows:\n\nWe then added these indicators together to form a scale ranging from 0 (for people who scored 0 on all four measures) to 8 (for respondents who scored 2 on all four measures).25And we subdivided the scale roughly into quartiles, as follows:\n\nHere again, there is no evidence that religious changes underway in America reflect a shrinking of the “religious middle.” The religious middle is not smaller among the younger cohorts than among the older cohorts, which is what one might expect if a hollowing out of the religious middle were occurring.\n\nRather, compared with older adults, younger Americans include far more people at the low end of the religiousness spectrum and far fewer people at the high end. The size of the middle categories of religiousness is in the same ballpark across most age groups. This is exactly the pattern that would be expected if broad-based religious decline (which some social scientists call a process of secularization) were underway.\n\nWe have already seen that over the long term (since 2007), the Religious Landscape Studies show a substantial rise in the percentage of U.S. adults who are religiously unaffiliated (sometimes called “nones”) and a substantial decline in the percentage who describe themselves as Christians – including declines inall three major Protestant traditions(evangelical, mainline and historically Black Protestant churches).\n\nThis raises the question:As the Christian share of the population has shrunk, have Christians become more religious, on average?One might expect that as some Americans leave Christianity and join the ranks of the unaffiliated, those who stay behind and remain Christian would become a smaller but more committed group, with rising average levels of religious belief and practice. Has this happened?\n\nThe new RLS offers a mixed answer, with a couple of indicators of religiousness holding steady or rising slightly among U.S. Christians, while two other indicators clearly have declined.\n\nThe four questions in the 2023-24 RLS about religious practice and belief that can most readily be compared with the prior studies ask about prayer frequency, belief in God or a universal spirit, belief in heaven and, separately, belief in hell.26\n\nThe new survey shows that among Christians, belief in heaven and hell is on par with or slightly higher than in 2007. Belief in heaven now stands at 85% among Christians, compared with 83% in 2007. Meanwhile, 72% of Christians now say they believe in hell, up slightly from 68% in 2007.\n\nBut there is no indication that Christians are any more prayerful today than they were in 2007. Indeed, the share of Christians who say they pray every day is markedly lower now (44%) than it was in 2007 (58%).\n\nThe share of Christians who say they believe in God with absolute certainty also is lower today than it was in 2007. In the new survey, 73% of Christians say they are absolutely certain God or a universal spirit exists, down from 80% in 2007.\n\nThe U.S. ispolitically polarized, and religion is closely associated with the country’s political divisions. But the new Religious Landscape Study – which was conducted mostly in 2023 and the early part of 2024,beforethe 2024 presidential election – also finds that the connections between religion and political partisanship vary a lot by race and ethnicity, as described below.\n\nIn general, highly religious Americans tend to identify with or lean toward the Republican Party and express conservative views on a variety of social, political and economic questions at much higher rates than do the least religious Americans. Meanwhile, Americans with lower levels of religious engagement tend to identify with or lean toward the Democratic Party and express liberal views on the same gamut of social, political and economic issues.27\n\nFor example, a majority of people in the most highly religious quartile of the U.S. adult population (61%) say they identify with or lean toward the Republican Party. By contrast, in the least religious quartile of the population, just 27% say they identify with or lean toward the GOP.28\n\nHighly religious U.S. adults also are far more likely than the least religious U.S. adults to say that abortion should be illegal, that homosexuality should be discouraged, and that children are better off if their mother doesn’t work and stays home to raise them instead.\n\nThere also are religious differences on questions that aren’t directly about sexuality or gender roles. Highly religious people are more inclined than the least religious people to say that environmental regulations cost too many jobs and hurt the economy, as well as to say that too much openness to people from other countries is a threat to America’s identity.\n\nNone of the foregoing discussion is meant to suggest that religiousness (or lack thereof) is the primary factor driving Americans’ political opinions. Numerous other factors can help shape political views, including age, gender, education, geography and socioeconomic status. And political partisanship is itself an important factor in people’s views about a host of issues.29\n\nMoreover, the new RLS shows that the links between religion and politics vary quite a bit across racial and ethnic categories. The political differences between Americans with different levels of religiousness are especially large among White respondents. For example, compared with the least religious White Americans, the most highly religious White Americans are:\n\nIn other racial and ethnic groups, there also is a relationship between religiousness and political views, with more highly religious people generally expressing more conservative views. However, the differences in political views between people with different levels of religiousness tend to be smaller in other racial and ethnic groups, and they are not seen on every issue.\n\nFor example, Black respondents who are highly religious arenotmore likely than the least religious Black respondents to identify with or lean toward the Republican Party; if anything,highly religiousBlack adults are somewhatlessRepublicanthan Black adults with the lowest levels of religious engagement.\n\nHighly religious Hispanic respondents are, on average, more likely than the least religious Hispanics surveyed to identify with the Republican Party. But the gap in Republicanism among highly religious Hispanic adults and Hispanic adults in the lowest religiousness category is 22 points, much smaller than the 49-point gap among White adults.\n\n901 E St. NW, Suite 300Washington, DC 20004USA(+1) 202-419-4300 | Main(+1) 202-857-8562 | Fax(+1) 202-419-4372 |Media Inquiries\n\nABOUT PEW RESEARCH CENTERPew Research Center is a nonpartisan, nonadvocacy fact tank that informs the public about the issues, attitudes and trends shaping the world. It does not take policy positions. The Center conducts public opinion polling, demographic research, computational social science research and other data-driven research. Pew Research Center is a subsidiary ofThe Pew Charitable Trusts, its primary funder.",
        "source_3": "Despite a consistent decline in the share of adults in the United States who identified as Christians over the last 17 years, the trend appears to have slowed in the last five years of a long-term Pew Research study.\n\nThe slowdown may not last, however, as other data from Pew's thirdReligious Landscape Studyshows America's youngest adults are significantly more likely to be unaffiliated with religion than their older counterparts, suggesting potential future declines in the \"American religious landscape.\"\n\nWith more than 36,000 respondents in the 2023-24 edition, the Religious Landscape Study is the largest single survey Pew Research Center conducts. It paints a religious portrait of the United States, highlighting the religious identities, beliefs and practices of U.S. adults in every state, the District of Columbia and 34 large metro areas.\n\nThe survey was previously conducted in 2007, when 78% of U.S. adults identified as Christian, and in 2014, when that share dropped to 71%.\n\nData from the latest study shows that between 2019 and 2024, the share of U.S. adults who identified as Christian hovered between 60% and 64%, with a current reading of 62%.\n\nThe largest share of American Christians identified as Protestants (40%) followed by Catholics (19%).\n\nAbout 3% of Americans identified with other groups, such as the Greek and Russian Orthodox Churches, the Church of Jesus Christ of Latter-day Saints and Jehovah's Witnesses, which are categorized as Christian subgroups by Pew.\n\nAdults who said they are unaffiliated with any religious group and identified as atheists, agnostics or \"nothing in particular\" constitute some 29% of the population, according to the latest data.\n\nWhile this group had been growing in recent years, the group of religiously unaffiliated, also known as the \"nones,\" has also \"plateaued,\" researchers said.\n\nThe rates at which Americans pray and attend church have stabilized in the recent study despite being lower than the rates for 2007. About 44% of Americans say they pray at least once daily, while 33% say they attend religious services at least once monthly.\n\nOther findings in the study show that significant majorities of Americans believe people have a soul of spirit (86%), believe in God or a universal spirit (83%), believe there is something spiritual beyond the natural world, even if we can't see it (79%); and believe in an afterlife (70%).\n\nAnd while 83% of Americans say they believe in God or a universal spirit, chances are many do not believe in God as described in the Bible.\n\nIn 2018, a Pewstudyfound that 80% of Americans said they believed in God but only a slim majority said they believed in God as described in the Bible. Among respondents younger than 50, belief in the God of the Bible was lower than 50%.\n\nIn the latest Pew study, compared to America's oldest adults (those 74 and older), America's youngest adults between the ages of 18-24 are much less religious or Christian.\n\nOnly 46% of the youngest adult Americans identify as Christian, just 27% pray daily and only 25% say they attend religious services monthly. At 43%, the share of America's youngest adults who identify as religiously unaffiliated is almost equal to the share who identify as Christian.\n\n\"Younger Americans are less likely than older adults to say they were raised in religious households,\" researchers noted. \"And, compared with older adults, fewer young people who were raised in religious households have remained religious after reaching adulthood.\"\n\nPew's data suggests that the religiousness of most birth demographics has \"remained relatively stable\" since 2000. The study found that the youngest cohort of adults is \"no less religious than the second-youngest cohort in a variety of ways.\"\n\n\"Americans born in 2000 through 2006 (those ages 18 to 24 in the 2023-24 RLS) are just as likely as those born in the 1990s (now ages 24 to 34) to identify as Christians, to say religion is very important in their lives, and to report that they attend religious services at least monthly,\" the Pew analysis reads.\n\n\"Time will tell whether the recent stability in measures of religious commitment is the beginning of a lasting shift in America's religious trajectory. But it is inevitable that older generations will decline in size as their members gradually die. We also know that the younger cohorts succeeding them are much less religious. This means that, for lasting stability to take hold in the U.S. religious landscape, something would need to change. For example, today's young adults would have to become more religious as they age, or new generations of adults who are more religious than their parents would have to emerge.\"\n\nContact:leonardo.blair@christianpost.comFollow Leonardo Blair on Twitter:@leoblairFollow Leonardo Blair on Facebook:LeoBlairChristianPost"
    }
}