{
    "question": "How might LA County’s approval of higher landfill dumping limits for wildfire debris, amid resident opposition and the fire chief’s appeal, influence public trust, environmental protections, and the pace of economic recovery?",
    "content": {
        "source_1": "Updated on:  February 25, 2025 / 10:03 PM PST/ KCAL News\n\nThe Los Angeles County Board of Supervisors on Tuesday unanimously approved a controversial plan that will increase daily dumping limits at three county landfills as crews continue to process debris from the Palisades and Eaton Fire burn zones.\n\nThe decision comes despitedays worth of protestfrom residents across the county, especially those living near the Calabasas Landfill, which had dumping restrictions removed by board members on Tuesday. The daily allowance of dumping will also be increased at the Lancaster Landfill and the Sunshine Canyon Landfill in Granada Hills as well.\n\nTypically the Calabasas Landfill only accepts waste from the surrounding areas, including Hidden Hills, Agoura Hills, Malibu, Westlake Village and Thousand Oaks. Now, the landfill will accept material from outside of that specific area for at least six months.\n\nBoth the Sunshine Canyon and Lancaster landfills have already been operating as wildfire debris dumping sites, but Tuesday's resolution will increase the daily tonnage limit from 12,000 to 15,000 at the Granada Hills-based landfill, and from 3,000 tons to 7,000 tons in Lancaster.\n\nThe Lancaster Landfill was already operating on a temporary waiver to accept up to 5,000 tons a day as it was drawing debris from the Bridge Fire, which burned in 2024 in the Angeles National Forest.\n\nPrior to Tuesday's vote, the supervisors were met with the displeasure of hundreds of residents denouncing the plan. They voiced a myriad of concerns but focused mainly on the potential toxicity that could spread from the ongoing disposal of waste from the fires.\n\nAmong those were Calabasas Mayor Peter Kraut and Mayor pro tem James Bozajian, who have vocally expressed their opposition to the local landfill's use for fire debris.\n\n\"We have little reason to believe hazardous and non-hazardous materials can be separated,\" Bozajian said at the meeting.\n\nThe city previously filed a temporary restraining order that prevented typical intakes at the landfill, but a LA County Superior Court judge ruled against it.\n\nBoth county and federal officials who also joined Tuesday's meeting said that hazardous wastes removed from the fire zones by the United States Environmental Protection Agency were not being taken to any of the landfills. They said they were instead being taken to other dumps that were capable of handling such debris.\n\nOn top of that, they contended that debris like ash and wood being removed from fire zones by Army Corp of Engineers is being packaged, delivered and stored at dumps in a way that won't present any danger to the community.\n\nTheir arguments were not met with satisfaction from residents.\n\n\"The health and well-being of our residents should not be jeopardized in the name of expedience,\" said Randi Feilich, the vice chair of the Calabasas Environmental Commission. \"It is necessary that the county take every measure necessary to ensure full remediation of any harmful toxins.\"\n\n\"Chemicals from the TVs, the iPads, the laptops. All of that that was in these homes is in this ash and it can't be separated,\" said Kelly Martino, a Calabasas resident speaking with KCAL News.\n\nPhase 1 of hazardous material removal is expected to be fully completed by the end of the week, with Phase 2 already underway in some areas.\n\nNicole Comstock is an Emmy-nominated reporter at KCAL9 and CBS2 News. She joined the team in June 2018, and covers breaking news at night in the Inland Empire, where she was raised.",
        "source_2": "Property damage from the January wildfires in Los Angeles County, including the Eaton and Palisades fires, is estimated at between $28 billion to $53.8 billion, according to a report published Thursday.\n\nThereportcommissioned by the Southern California Leadership Council and the LA County Economic Development Corporation studies a broad range of economic impacts oftwo of the most destructive wildfireson record in California. The report examines destruction and economic loss caused by the fires and offers data-driven recommendations to guide recovery efforts.\n\nStream Los Angeles News for free, 24/7, wherever you are.\n\nGet top local stories in Southern California delivered to you every morning with NBC LA's News Headlines newsletter.\n\nThe report takes into account the economic damage and personal toll of the fires and explores investments in prevention and recovery, former California Gov. Gray Davis, SCLC co-chair, said during an online news conference.\n\n\"Speed matters in the recovery process… particularly from an economic perspective,\" Davis said. \"Job No. 1 is to help people rebuild and get back to their new homes.\n\n\"We have to learn the lessons of this fire and previous fires. We have to build homes better… so we don't repeat this terrible tragedy. Let's learn the lessons.\"\n\nThe study examined how the fires are projected to impact key industries. Retail trade, health care, professional services, construction, and educational services were among the hardest hit, according to the study.\n\nDisruptions to supply chains and workforce displacement could compound the region's economic challenges, the report said.\n\nStephen Cheung, president and chief executive of LAEDC, said a best-case scenario would be recovery by 2029, but the process could take many more years. The impact of the fires would grow with the length of the recovery period, he added.\n\nSteps towards recovery, according to the report, include fast-tracking rebuilding efforts through coordinated permitting processes and financial incentives can reduce recovery timelines by up to 50%, strengthening fire-prone communities with improved emergency response systems, microgrids and fire-resistant construction materials and methods, as required in California's current building codes.\n\nAlso, implementing alternative insurance models, such as parametric insurance, can ensure faster financial relief for affected businesses and homeowners. Parametric insurance pays a set amount based on the magnitude of the event, rather than the magnitude of the losses in a traditional indemnity policy.\n\nResearchers further suggest direct support be provided to impacted businesses and displaced workers through grants, training programs, and small business recovery initiatives to prevent long-term economic decline, the report says.\n\nAccording to the report, establishing multi-agency wildfire task forces with clear recovery roadmaps can also cut response times and improve post-disaster efficiency.",
        "source_3": "President of United Firefighters of Los Angeles City Freddy Escobar joins ‘Fox & Friends Weekend’ to break down Los Angeles Mayor Karen Bass' firing of Los Angeles Fire Department Chief Kristin Crowley.\n\nFormer Los Angeles Fire Chief Kristin Crowley has started the appeal process following Mayor Karen Bass’ decision to fire her a week ago.\n\nHer decision to appeal comes after Bass’ decision has spun up criticism from City Councilmembers and the public for what they say is \"misrepresenting the facts.\"\n\nCrowley announced the appeal to City Council members on Thursday.\n\n\"I choose to proceed with the Council appeal provided for inLos AngelesCharter, Article V, Section 5.08(e), due to Mayor Bass’s removal of me, on February 21, 2025, from the position of Fire Chief of the Los Angeles City Fire Department,\" read Crowley’s note. \"I look forward to hearing from you about next steps, if any.\"\n\nLOS ANGELES MAYOR KAREN BASS SACKS FIRE CHIEF WHO SAID CITY FAILED RESIDENTS IN WILDFIRES\n\nLos Angeles Fire Department Chief Kristin Crowley talks during a news conference at Harbor–UCLA Medical Center in the West Carson area of Los Angeles on Thursday, Feb. 15, 2024.(Richard Vogel/AP)\n\nBass announced that she was firing Crowley after last month's devastating Palisades Fire and appointing former Chief Deputy Ronnie Villanueva, a 41-yearLAFD veteran, as interim fire chief. She said it was in the best interest of Los Angeles.\n\n\"Acting in the best interests of Los Angeles’ public safety, and for the operations of the Los Angeles Fire Department, I have removed Kristin Crowley as Fire Chief. We know that 1,000 firefighters that could have been on duty on the morning the fires broke out were instead sent home on Chief Crowley’s watch. Furthermore, a necessary step to an investigation was the President of the Fire Commission telling Chief Crowley to do an after action report on the fires. The Chief refused. These require her removal. The heroism of our firefighters – during thePalisades fireand every single day – is without question. Bringing new leadership to the fire department is what our city needs.\"\n\nCouncil President Marqueece Harris-Dawson added the appeal on the agenda hours after Crowley’s announcement to be discussed at a special council meeting Friday at 5 p.m.\n\nHer decision to appeal comes after Bass’ decision has spun up criticism from City Councilmembers and the public for what they say is \"misrepresenting the facts.\"(United Firefighters of Los Angeles City, IAFF Local 112)\n\nLA FIRE SOUNDED ALARM ON BUDGET CUTS IMPACTING WILDFIRE RESPONSE: MEMO\n\nUnited Firefighters of Los Angeles City Local 112, the union that represents city firefighters and are supporters of Crowley, said in a post to Facebook it was outrageous to schedule, with only 24-hour notice, a \"Special Meeting\" to hear Chief Crowley’s appeal.\n\n\"This is an example of why the public doesn’t trust City Hall and the constant missteps that we have seen our city leaders make since the fires broke out on January 7th. This is not transparent, fair, or just. It’s yet another public blunder coming out of City Hall that makes the people of Los Angeles continue to question the motives and trustworthiness of our city’s leaders,\" the post said.\n\nThe union went on to say that they believe the reasons she was terminated were manufactured and, in reality, Crowley was fired for telling the truth.\n\n\"Our rank-and-file firefighters on the ground strongly support Chief Crowley. They know the truth, we have her back, and we will fight for her right to set the record straight,\" they said.\n\n\"This is the first City Council meeting that we are aware of, perhaps ever, that has been scheduled on 24-hour notice for a Friday at 5:00 pm. It’s obvious that some on the City Council are attempting to bury this issue when nobody is watching and holding them accountable. City Council Members will have to ask themselves if this is the way they want to decide the fate of our Fire Chief. What’s happening is wrong, and everyone knows it.\"\n\nFrom right, Mayor Karen Bass and Chief Recovery Officer Steve Soboroff discuss recovery efforts during a press conference in Pacific Palisades on Monday, January 27, 2025.(Drew A. Kelley/MediaNews Group/Long Beach Press-Telegram via Getty Images)\n\nCrowley’s appeal will require a vote of at least 10 of 15 members in her favor. It remains unclear how the vote will go as four council members stood behind Bass during the press conference as she announced the decision to remove Crowley.\n\nCouncilmember Bob Blumenfield believes it is in the mayor’s right to hire and fire whom she wishes.\n\n\"She needs to have the full confidence of her general managers and her chiefs. If she has lost that confidence, she has every right to change out the head of a department\" or fire chief, he said earlier this week.\n\nThe Los AngelesCityCharterallows the mayor the ability to remove most department heads, including the fire chief, without council approval.\n\nThe charter also gives the fired employee the right to appeal the decision to the council with the possibility of reinstatement.\n\nThe City Council has 10 meeting days to act on Crowley's filing, per the charter.\n\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}