{
    "question": "In what ways could the jump in initial unemployment claims to 242,000 and February’s steep drop in consumer confidence—amid snowstorms, reported efficiency-driven layoffs, and looming tariffs—shape near-term labor market conditions and consumer spending?",
    "content": {
        "source_1": "Unemployment is low, but workers aren’t quitting and businesses aren’t hiring. What’s going on?\n\nThis is Work in Progress, a newsletter about work, technology, and how to solve some of America’s biggest problems.Sign up here.\n\nSix months. Five-hundred-seventy-six applications. Twenty-nine responses. Four interviews. And still, no job. When my younger brother rattled off these numbers to me in the fall of 2023, I was dismissive. He had recently graduated with honors from one of the top private universities in the country into a historically strong labor market. I assured him that his struggle must be some kind of fluke. If he just kept at it, things would turn around.\n\nOnly they didn’t. More weeks and months went by, and the responses from employers became even sparser. I began to wonder whether my brother had written his resume in Comic Sans or was wearing a fedora to interviews. And then I started to hear similar stories from friends, neighbors, and former colleagues. I discovered entire Subreddits and TikTok hashtags and news articles full of job-market tales almost identical to my brother’s. “It feels like I am screaming into the void with each application I am filling out,” one recent graduatetoldtheNew York Timescolumnist Peter Coy last May.\n\nAs someone who writes about the economy for a living, I was baffled. The unemployment rate was hovering near a 50-year low, which is historically a very good thing for people seeking work. How could finding a job be so hard?\n\nThe answer is that two seemingly incompatible things are happening in the job market at the same time. Even as the unemployment rate has hovered around 4 percent for more than three years, the pace ofhiringhasslowedto levels last seen shortly after the Great Recession, when the unemployment rate was nearly twice as high. The percentage of workers voluntarily quitting their jobs to find new ones, a signal of worker power and confidence, hasfallenby a third from its peak in 2021 and 2022 to nearly its lowest level in a decade. The labor market is seemingly locked in place: Employees are staying put, and employers aren’t searching for new ones. And the dynamic appears to be affecting white-collar professions the most. “I don’t want to say this kind of thing hasneverhappened,” Guy Berger, the director of economic research at the Burning Glass Institute, told me. “But I’ve certainly never seen anything like it in my career as an economist.” Call it the Big Freeze.\n\nThe most obvious victims of a frozen labor market are frustrated job seekers like my brother. But the indirect consequences of the Big Freeze could be even more serious. Lurking beneath the positive big-picture employment numbers is a troubling dynamic that threatens not only the job prospects of young college graduates but the long-term health of the U.S. economy itself.\n\nThe period from the spring of 2021 through early 2023, when employeeswereswitching jobs like never before, was a great time to be an American worker. (Remember all those stories about the Great Resignation?) It was also a stressful time to be an employer. Businesses struggled to fill open positions, and when they finally did, their newly trained employees might quit within weeks. “It’s hard to overstate the impact this period had on the psyche of American companies,” Matt Plummer, a senior vice president at ZipRecruiter who advises dozens of companies on their hiring strategies, told me. “No one wanted to go through anything like it again.” Scarred by the chaos of the Great Resignation, Plummer and others told me, many employers grew far less willing to either let go of their existing workers or try to hire new ones.\n\nEven as they were still shaken by the recent past, employers were also growing warier about America’s economic future. In March 2022, the Federal Reserve began raising interest rates to tame inflation, and the business world adopted the nearly unanimous consensus that a recession was around the corner. Many companies therefore decided to pause plans to open new locations, build new factories, or launch new products—all of which meant less of a need to hire new employees.\n\nOnce it became clear that a recession had been avoided, a new source of uncertainty emerged: politics. Recognizing that the outcome of the 2024 presidential election could result in two radically different policy environments, many companies decided to keep hiring plans on hold until after November. “The most common thing I hear from employers is ‘We can’t move forward if we don’t know where the world is going to be in six months,’” Kyle M. K., a talent-strategy adviser at Indeed, told me. “Survive Until ’25” became an unofficial rallying cry for businesses across the country.\n\nBy the end of 2024, the pace of new hiring had fallen to where it had been in the early 2010s, when unemployment was more than 7 percent, as Bergerobservedin January. For most of last year, the overall hiring rate was closer to what it was at the bottom of the Great Recession than it was at the peak of the Great Resignation. But because the economy remained strong and consumers kept spending money, layoffs remained near historic lows, too, which explains why the unemployment rate hardly budged.\n\nLook beyond the aggregate figures, and the hiring picture becomes even more disconcerting. As theWashington Postcolumnist Heather Long recentlypointed out, more than half of the total job gains last year came from just two sectors: health care and state and local government, which surged as the pandemic-era exodus to the suburbs and the Sunbelt generated demand for teachers, firefighters, nurses, and the like. According to an analysis from Julia Pollak, the chief economist at ZipRecruiter, hiring in basically every other sector, including construction, retail, and leisure and hospitality, is down significantly relative to pre-pandemic levels. Among the hardest-hit professions have been the white-collar jobs that have been historically insulated from downturns. The “professional and business services” sector, which includes architects, accountants, lawyers, and consultants, among other professions, actuallylostjobs over the past two years, something that last happened during the recession years of 2008, 2009, and 2020. The tech and finance sectors have fared only slightly better. (The rise of generative AI might be one reason the hiring slowdown has been even worse in these fields, but the data so far are equivocal.)\n\nA job market with few hiring opportunities is especially punishing for young people entering the workforce or trying to advance up the career ladder, including those with a college degree. According to a recentanalysisby ADP Research, the hiring rate for young college graduates has declined the most of any education level in recent years. Since 2022, this group has experienced a higher unemploymentratethan the overall workforce for the first sustained period since at least 1990. That doesn’t change thefactthat college graduates have significantly better employment prospects and higher earnings over their lifetime. It does, however, mean that young college graduates are struggling much more than the headline economic indicators would suggest.\n\nFor job seekers, a frozen labor market is still preferable to a recessionary one. My brother, for example, eventually found a job. But the Big Freeze is not a problem only for the currently unemployed. Switching from one job to another is the main way in which American workers increase their earnings, advance in their careers, and find jobs that make them happy. And indeed, over the past few years, wage growth has slowed, job satisfaction hasdeclined, and workers’ confidence in finding a new job hasplummeted. According toa recent pollfrom Glassdoor, two-thirds of workers report feeling “stuck” in their current roles. That fact, along with asimilar dynamic in the housing market—the percentage of people who move in a given year hasfallento its lowest point since data were first collected in the 1940s—might help explain why so many Americans remain so unhappy about an economy that is strong along so many other dimensions.\n\nThis is a warning sign. The historical recordshowsthatwhen people are hesitant to move or change jobs, productivity falls, innovation declines, living standards stagnate, inequality rises, and social mobility craters. “This is what worries me more than anything else about this moment,” Pollak told me. “A stagnant economy, where everyone is cautious and conservative, has all kinds of negative downstream effects.”\n\nAccording to economists and executives, the labor market won’t thaw until employers feel confident enough about the future to begin hiring at a more normal pace. Six months ago, businesses hoped that such a moment would arrive in early 2025, with inflation defeated and the election decided. Instead, the early weeks of Donald Trump’s presidency have featured the looming threat of tariffs and trade wars, higher-than-expected inflation, rising bond yields, and a chaotic assault on federal programs. Corporate America is less sure about the future than ever, and the economy is still frozen in place.\n\nSupport for this project was provided by the William and Flora Hewlett Foundation.",
        "source_2": "Reporting by Lucia Mutikani; Editing by Chizu Nomiyama and Paul Simao\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nFrom our On the Money newsletter: Many younger adults in the United States are frugal daters as they contend with higher living costs, a survey shows.\n\nReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.\n\nAccess unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.\n\nBrowse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.\n\nScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.\n\nAll quotes delayed a minimum of 15 minutes.See here for a complete list of exchanges and delays.",
        "source_3": "‘Barron’s Roundtable’ panelists Jacob Sonenshine, Andrew Bary and Teresa Rivas break down three topics investors should know about this week.\n\nU.S.consumer confidenceplunged sharply in February by more than expected, according to a report released Tuesday.\n\nThe Conference Board released its Consumer Confidence Index on Tuesday declined to 98.3 in February, the lowest level since June. That's well below the LSEG poll's estimate of 102.5 for February and the prior reading of 104.1 in January.\n\n\"In February, consumer confidence registered the largest monthly decline since August 2021,\" said Stephanie Guichard, senior economist, global indicators, at The Conference Board. \"This is the third consecutive month-on-month decline, bringing the index to the bottom of the range that has prevailed since 2022.\"\n\nOne of the components of the Conference Board's report is the Present Situation Index, which is based on consumers' assessments of currentbusiness and labor market conditionsand fell by 3.4 points to 136.5. The Expectations Index – which is based on consumers' short-term outlook for income, business and labor market conditions – dropped 9.3 points to 72.9 and was below the threshold of 80 that usually signals a recession ahead for the first time since June 2024.\n\nUS CONSUMER SENTIMENT PLUNGES ON WORRIES OVER PRICES FROM INFLATION AND TARIFFS\n\nConsumer confidence declined in February by more than economists expected.(Gabby Jones/Bloomberg via Getty Images / Getty Images)\n\n\"Of the five components of the Index, only consumers' assessment of present business conditions improved, albeit slightly. Views of current labor market conditions weakened. Consumers became pessimistic about future business conditions and less optimistic about future income. Pessimism about futureemployment prospectsworsened and reached a ten-month high,\" Guichard wrote.\n\nThe decline in confidence was shared across all age groups but was the deepest for consumers between the ages of 35 and 55. It was also broad-based among income groups, with the only exceptions being those earning less than $15,000 a year and between $100,000 and $125,000.\n\nFED OFFICIALS FLAG RISING INFLATION RISKS AMID UNCERTAINTY OVER TRUMP POLICIES, TARIFFS\n\nConsumers expect inflation to accelerate over the next 12 months, the Conference Board found.(FREDERIC J. BROWN/AFP via Getty Images / Getty Images)\n\nAverage 12-monthinflation expectationssurged in the report from 5.2% to 6% in February. Guichard said that the \"increase likely reflected a mix of factors, including sticky inflation but also the recent jump in prices of key household staples like eggs and the expected impact of tariffs.\"\n\nGuichard noted that inflation and prices continue to rank high in respondents' write-in responses, but there was a sharp uptick in mentions of trade and tariffs to a level unseen since 2019. She added that \"comments on thecurrent Administrationand its policies dominated the responses.\"\n\nFederal Reserve Chair Jerome Powell has signaled the central bank is prepared to wait on further interest rate cuts based on economic conditions.(Photo by Liu Jie/Xinhua via Getty Images / Getty Images)\n\nLPL Financial chief economist Jeffrey Roach noted that there could be some behavioral shifts among consumers based on the sentiment expressed by the report's findings and added that theFederal Reserve'srate-cutting pause is unlikely to be changed by it in the near-term.\n\n\"Consumers are increasingly nervous about the unknown impacts frompotential tariffsand could pull forward consumer demand as they anticipate higher prices for imports in the near future,\" Roach explained. \"One note of caution: consumer surveys are much more volatile than the hard data of retail sales so the Fed will not likely change their stance on monetary policy at the next couple of meetings.\"\n\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\n\nBy clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time."
    }
}