{
    "question": "How might officials’ messaging about the Texas measles outbreak influence vaccination uptake, public trust, and containment efforts following the first U.S. measles death since 2015?",
    "content": {
        "source_1": "Health and Human Services Secretary Robert F. Kennedy Jr. on Wednesday appeared to downplay the seriousness of theWest Texas measles outbreakthat has killed a school-age child.\n\nThe child’s death, the first from the disease in a decade in the United States, was confirmed by Katherine Wells, director of public health at the health department in Lubbock, Texas. The child had not been vaccinated against the measles.\n\nThe outbreak has so far infected at least 124 people — mostly children — in rural West Texas.\n\n“We are following the measles epidemic every day,” Kennedy said during a meeting with President Donald Trump’s cabinet at the White House. “Incidentally, there have been four measles outbreaks this year. In this country last year there were 16. So, it’s not unusual. We have measles outbreaks every year.”\n\nKennedy also said that two people had died in the outbreak and that the people hospitalized were done so “mainly for quarantine.”\n\nWells, of the Lubbock health department, and another spokesperson for the city said that there has been just one measles death in Texas so far. They said they confirmed it with state health authorities after Kennedy’s comments on Wednesday.\n\nIf a second death did exist, the city’s spokesperson said, “we’d know about it.”\n\nAndrew Nixon, a spokesperson for HHS spokesperson, did not directly dispute the secretary’s comments but said in an email that the CDC was aware of the death of one child.\n\nDr. Lara Johnson, a pediatrician and the chief medical officer at Covenant Children’s Hospital in Lubbock, said during a news conference Wednesday afternoon that the patients who were hospitalized were admitted because they were having trouble breathing and needed supportive care such as supplemental oxygen.\n\n\"We don’t hospitalize patients for for quarantine purposes,\" Johnson said.\n\nShe added that her team has cared for “around 20” kids with measles so far. Several of those patients required intensive care. None of the hospitalized had been vaccinated against measles.\n\nTheTexas Department of State Health Serviceshas reported 18 hospitalizations so far, but number appears to be lagging, she said.\n\nThe outbreak has been limited to parts of Texas bordering New Mexico, which has reportedninemeasles cases. Health officials in Texas are working to see if the cases are connected.\n\nThe Centers for Disease Control and Prevention and the Texas Department of State Health Services told NBC News that genotype testing had linked the outbreak to a strain of the measles virus called D8 currently circulating in Europe and the World Health Organization's Eastern Mediterranean region, which includes countries in North Africa, the Middle East and Southwest Asia.\n\nThe death in Texas is the first measles death to be reported in the U.S. since 2015, when aWashington woman diedafter an exposure at a health clinic. Thelast time a child died of measlesin the U.S. was 22 years ago, in 2003, according to the CDC.\n\nMeasles was considered eliminated in the U.S. in 2000, the CDC said, because of widespread use of the measles-mumps-rubella vaccine (MMR).\n\nTwo doses of the shot are 97% effective in preventing the disease, and the vast majority of U.S. kids get them as the CDC recommends: one dose around age 1, and another around age 5.\n\nBut asvaccine hesitancy has increased over time, fewer kids are getting their shots. The number of children withvaccine exemptions reached an all-time highin 2023, the CDC said, of 3% of children entering kindergarten.\n\nIn Gaines County, Texas, the epicenter of the current outbreak, the vaccine exemption rate was nearly 18% for the 2023-2024 school year, according tohealth department data.\n\nErika Edwards is a health and medical news writer and reporter for NBC News and \"TODAY.\"",
        "source_2": "Jordan King is a Newsweek reporter based in London, U.K. Her current focus is on religion, health, food safety and population. She has covered the persecution of religions in the global south, fertility and birth rate issues around the world, multiple disease outbreaks in the U.S. and ongoing vaccination discourse. Jordan joined Newsweek in 2024 from The Evening Standard and had previously worked at Metro.co.uk, she has background in international human-interest stories and is a graduate of Kingston University, in London. You can get in touch with Jordan by emailingj.king@newsweek.com. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nA doctor has accusedRobert F. Kennedy Jr., the secretary of the Department of Health and Human Services, of downplaying a measles outbreak in Texas by saying outbreaks are \"not unusual\" in the United States.\n\nOn Tuesday, anunvaccinated child diedfrom measles in Texas, state officials announced, marking the first fatality from the disease in the U.S. since 2015.\n\nKennedy, who wasconfirmed as health secretaryon February 13, previously faced criticism over hiscomments about vaccines. Last week, he vowed toinvestigate the childhood vaccine schedule, which includes the measles and polio vaccines. He is now facing additional criticism over his response to the Texas outbreak.\n\nWest Texas is experiencing its largest measles outbreak in 30 years. Since January, 124 cases have been reported across nine counties, according to the Texas Department of State Health Services.\n\nDuring a Wednesday meeting of PresidentDonald Trump's Cabinet members, Kennedy said the Health Department was following the outbreak. He added that the situation was \"not unusual\" as the U.S. had \"measles outbreaks every year.\"\n\nCommenting on Kennedy's remarks, Dr. Neil Stone, an infectious diseases specialist, wrote on X, formerly Twitter: \"He downplayed it and didn't even mention vaccines. He's complicit. Shame.\"\n\nKennedy also said on Wednesday, \"There are about 20 people hospitalized, mainly for quarantine.\" However, Dr. Lara Johnson at Covenant Children's Hospital in Lubbock, where the child who died was being treated, said, \"We don't hospitalize patients for quarantine purposes.\"\n\nThe health secretary appeared to misspeak when he told reporters two people had died from the outbreak. Andrew Nixon, a spokesperson for the Health Department, later confirmed to the Associated Press that the Centers for Disease Control and Prevention had identified only one death.\n\nMeasles was officially declared eliminated from the U.S. in 2000, meaning the disease was not spreading within the country. The only cases were found in people who had contracted measles abroad and brought it into the U.S.\n\nHowever, outbreaks have since begun again, which health officials attribute to the U.S.'s declining vaccination rates. Most states are below the 95 percent vaccination threshold for kindergartners, the level needed to protect against outbreaks, according to theCDC.\n\nThe agency said there had been three outbreaks in 2025, with 95 percent of the cases involving an unvaccinated person or someone with an unknown vaccination status.\n\nLast year, there were 16 outbreaks, with a total of 285 cases—89 percent of which involved an unvaccinated person or someone with an unknown vaccination status.\n\nIn 2023, there were 59 measles cases in the U.S., which followed 121 cases in 2022, 49 cases in 2021 and 13 cases in 2020.\n\nIn 2019, there were 1,274 cases, the greatest number of cases reported in the United States since 1992.\n\nDr. Amy Thompson, a pediatrician and the chief executive officer of Covenant Health said at a news conference on Wednesday: \"This is a big deal. We have known that we have measles in our community, and we are now seeing a very serious consequence.\"\n\nHealth Secretary Robert F. Kennedy Jr. told reporters on Wednesday: \"We are following the measles epidemic every day. I think there's 124 people who have contracted measles at this point, mainly in Gaines County, Texas—mainly, we're told, in the Mennonite community. There are two people who have died.\n\n\"But we're watching it, and there are about 20 people hospitalized, mainly for quarantine. We're watching it. We put out a post on it yesterday, and we're going to continue to follow it.\n\n\"Incidentally, there have been four measles outbreaks this year. In this country last year, that were 16. So it's not unusual. We have measles outbreaks every year.\"\n\nThe Texas Department of State Health Services said it was working with local health departments in West Texas to investigate cases, provide immunizations where needed and keep the public informed. The CDC has urged the public to make sure their vaccinations are up to date.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nJordan King is a Newsweek reporter based in London, U.K. Her current focus is on religion, health, food safety and population. She has covered the persecution of religions in the global south, fertility and birth rate issues around the world, multiple disease outbreaks in the U.S. and ongoing vaccination discourse. Jordan joined Newsweek in 2024 from The Evening Standard and had previously worked at Metro.co.uk, she has background in international human-interest stories and is a graduate of Kingston University, in London. You can get in touch with Jordan by emailingj.king@newsweek.com. Languages: English.\n\nJordan King is a Newsweek reporter based in London, U.K. Her current focus is on religion, health, food safety and population. She has covered the persecution of religions in the global south, fertility and birth rate issues around the world, multiple disease outbreaks in the U.S. and ongoing vaccination discourse. Jordan joined Newsweek in 2024 from The Evening Standard and had previously worked at Metro.co.uk, she has background in international human-interest stories and is a graduate of Kingston University, in London. You can get in touch with Jordan by emailingj.king@newsweek.com. Languages: English.\n\nJordan King is a Newsweek reporter based in London, U.K. Her current focus is on religion, health, food safety and                                    ...Read more",
        "source_3": "Fox News senior medical analyst Dr. Marc Siegel gives insight into the rise of measles cases across Texas and New Mexico on ‘America’s Newsroom.’\n\nThe first measles death has been reported in West Texasamid the outbreakthat has infected more than 100 people, the Associated Press reported on Wednesday morning.\n\nMelissa Whitfield, a spokesperson for Texas Tech University Health Sciences Center, confirmed the death to AP.\n\nWATCH FULL INTERVIEW WITH DR. MARC SIEGEL AND RFK JR. ON FOX NATION\n\nCovenant Children’s Hospital in Lubbock did not immediately respond to a request for comment from AP.\n\nAs of Tuesday, the Texas outbreak had affected 124 people across nine counties, according to a statement from the Texas Department of State Health Services.(iStock)\n\nAs of Tuesday, theTexas outbreakhad affected 124 people across nine counties, according to a statement from the Texas Department of State Health Services (DSHS).\n\nCases have also been spreading to New Mexico, with a total of nine confirmed in that state so far.\n\nThe agency added that the best way to prevent sickness is to receive twodoses of the vaccineagainst measles, \"primarily administered\" as the combination measles, mumps and rubella (MMR) immunization.\n\nA vial containing the measles, mumps and rubella (MMR) vaccine is sitting on top of an ice pack.(Subaas Shrestha/NurPhoto via Getty Images)\n\nFox News' senior medical analyst Dr. Marc Siegel weighed in on the first measles death, citing vaccination non-compliance as the likely reason that the disease is spreading through Texas and now into New Mexico.\n\nSiegel suggested that high exemption rates forchildhood vaccines, which are now under 85% compliance, are to blame. The majority of cases have occurred in unvaccinated individuals, mostly school-aged children.\n\nFor more Health articles, visitwww.foxnews.com/health\n\n\"Keep in mind that for herd immunity (where those who cannot be vaccinated because they are pregnant or immunocompromised and can't take a live vaccine are protected), we need a vaccination rate of around 95%,\" he told Fox News Digital.\n\n\"In Texas, it is currently at 91%, and more bills for further exemptions are before the state legislature.\"\n\nMeasles is \"wildly contagious among unvaccinated individuals,\" a doctor cautioned.(iStock)\n\nThe doctor stressed that measles is \"wildly contagious among unvaccinated individuals\" and that the hospitalization rate is one in five, according to CDC data.\n\nAspneumonia can occurin one out of every 20 measles cases, Siegel said this could explain the recent measles death.\n\n\"Of the 124 patients so far, there are 18 hospitalizations, probably most from pneumonia,\" he shared. \"There are likely hundreds more cases that are not being reported.\"\n\nMelissa Rudy is senior health editor and a member of the lifestyle team at Fox News Digital. Story tips can be sent to melissa.rudy@fox.com.\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox"
    }
}