{
    "question": "How might Chief Justice John Roberts’ decision to pause the lower court’s order requiring the Trump administration to pay $2 billion in foreign aid by Wednesday affect contractors awaiting payment and the next steps in the legal process?",
    "content": {
        "source_1": "Updated on:  February 27, 2025 / 9:56 AM EST/ CBS News\n\nWashington— Chief Justice John Roberts late Wednesday granted the Trump administration's request to put on hold a lower court orderthat required it to pay an estimated $2 billionin foreign assistance funds for State Department and U.S. Agency for International Development projects by the end of Wednesday.\n\nRoberts, who oversees requests for emergency relief arising from cases in the District of Columbia,acted alonein halting the decision from a federal district judge issued Tuesday. The judge, U.S. District Judge Amir Ali, gave the State Department and USAID until 11:59 p.m. Wednesday to pay its bills to contractors for work that had been completed before Feb. 13. The Trump administration had earlier in the night asked the Supreme Court to intervene in the dispute involving frozen foreign assistance funds.\n\nRoberts gave the State Department and USAID contractors until noon Friday to respond to the Trump administration's request.\n\nSeparately, the State Department cut more than 9,100 foreign assistance grants and contracts, totaling roughly $58.4 billion, a State Department spokesperson confirmed to CBS News. Thecuts at USAIDamount to a 92% decrease in grants and awards.\n\nIn the bid for emergency relief from the Supreme Court, acting Solicitor General Sarah Harris said Ali's order covers an estimated $2 billion and said his Wednesday night deadline \"moved the goalposts.\"\n\n\"It is not tailored to any actual payment deadlines associated with respondents' invoices or drawn-down requests, or anyone else's. And it has thrown what should be an orderly review by the government into chaos,\" she wrote.\n\nHarris said that officials at the \"highest levels of government\" are involved in the matter and told the Supreme Court that the Trump administration is \"undertaking substantial efforts to review payment requests and release payments.\"\n\n\"The Executive Branch takes seriously its constitutional duty to comply with the orders of Article III courts,\" she wrote.\n\nBut she warned that the district court's deadline \"makes full compliance impossible,\" in part because restarting funding related to canceled or suspended agreements requires multiple steps, multiple agencies and documentary evidence.\n\nThe acting solicitor general requested an administrative stay, which would maintain the status quo, \"to ensure that the agencies are not placed in the position of violating a federal court order requiring payments on thousands of requests within a 30-some-hour deadline, despite their efforts, while this court reviews the merits of their challenge.\"\n\nThe Trump administration had already appealed the district judge's order to the U.S. Court of Appeals for the District of Columbia Circuit and asked it to pause the lower court's decision. But the D.C. Circuit had yet to act by Wednesday evening. Harris said the administration was seeking the Supreme Court's intervention \"in light of that extraordinary circumstance.\"\n\nBut shortly after the Trump administration formally asked the high court for emergency relief, the appeals court declined the Trump administration's request to pause the district court's decision. The three-judge panel on the D.C. Circuit said Ali's orders could not be appealed.\n\nAli, who was appointed by former President Joe Biden in 2024, is overseeing the case brought by a group of companies, nonprofits and other organizations that receive money from the State Department and the USAID. Heissued a temporary restraining orderearlier this month that prevented the Trump administration from freezing foreign aid funds for contracts and other awards while proceedings continued.\n\nBut the contractors told Ali earlier this week that foreign aid funding was still not flowing despite his order, and sought prompt payment for work they completed weeks ago. The international development groups said they were owed millions of dollars for invoices and reimbursements, and warned the Trump administration's failure to reinstate the funding forced them to furlough workers and end critical programs overseas.\n\nAli granted their motion to enforce his earlier order and gave the State Department and USAID 36 hours to pay the bills related to foreign aid contracts and grants.\n\nJustice Department lawyers said in a separate filing that they estimated the payments covered by Ali's order approached $2 billion, and for the challengers alone, the amount at issue was at least $250 million.\n\n\"This new order requiring payment of enormous sums in less than 36 hours intrudes deeply into the prerogatives of the Executive Branch and the president's obligation under Article II to take care that the laws are faithfully executed,\" they wrote in afilingto the D.C. Circuit.\n\nPeter Marocco, director of foreign assistance at the State Department, said in adeclarationthat the administration is undertaking an \"individualized review\" of contracts and grants, and warned determining the course of those awards is a \"cumbersome, multi-step process.\"\n\nHe said that it would take the federal government \"multiple weeks\" to make the payments required by the district court judge.\n\n\"Restarting funding related to terminated or suspended agreements is not as simple as turning on a switch or faucet,\" Morocco wrote in his declaration, adding that USAID and State Department payment systems are \"complicated\" and involve disbursements by numerous other agencies.\n\nMelissa Quinn is a politics reporter for CBSNews.com. She has written for outlets including the Washington Examiner, Daily Signal and Alexandria Times. Melissa covers U.S. politics, with a focus on the Supreme Court and federal courts.",
        "source_2": "The top judge in the United States has given temporary backing to the Trump administration's freeze on foreign aid payments.\n\nSupreme Court Chief Justice John Roberts' intervention came as the administration faced a midnight deadline (05:00 GMT on Thursday) to pay contractors.\n\nOfficials had argued that they could not process the payments within the timeframe set by a lower court judge.\n\nSince coming to power in January, US President Donald Trump has taken quick action to end many aid programmes, largely run by the US Agency for International Development, USAID, and placed most of its staff on administrative leave or sacked them.\n\nThe Trump administration is seeking to shrink the federal workforce and cut costs in a drive led by Elon Musk.\n\nThe billionaire Trump adviser asked millions of bureaucrats over the weekend to list their accomplishments from the past week - sparking fury amongst the workforce and disagreement with officials leading the departments.\n\nUS District Judge Amir Ali had ordered the US State Department and USAID to pay about $2bn-worth of bills (£1.6bn) to contractors by midnight on Wednesday.\n\nIt is one of many interventions by judges trying to stop or pause a wave of Trump administration orders.\n\nAs the deadline approached, the Trump administration went to the Supreme Court, arguing it was impossible to process claims in an orderly fashion in such a short period of time.\n\nThe US federal government freeze comes as the administration carries out a review of foreign aid funding.\n\nActing Solicitor General Sarah Harris said Judge Ali's order \"has thrown what should be an orderly review by the government into chaos\".\n\nThe cutbacks to USAID have already upended the global aid system.\n\nHundreds of programmes have been frozen in countries around the world since the president announced his intentions in January.\n\nThe US is by far the biggest single provider of humanitarian aid around the world.\n\nIt has bases in more than 60 countries and works in dozens of others, with much of its work carried out by its contractors.\n\nAccording to the Associated Press news agency, the Trump administration wants to eliminate more than 90% of the USAID's foreign aid contracts - and $60bn of US  overseas aid.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "Former USAID chief operating officer Max Primorac and former Massachusetts Sen. Scott Brown outline USAID's 'counter-American' spending on 'Hannity.'\n\nU.S.Supreme CourtJustice John Roberts on Wednesday paused a federal judge’s order that required the Trump administration to pay around $2 billion in foreign aid funds to contractors by midnight.\n\nThe ruling comes after theTrump administrationasked the Supreme Court for an emergency order to block the release of U.S. Agency for International Development (USAID) funding, which the federal judge had required by midnight. Officials had said they would not be able to comply with the judge’s order.\n\nThe Trump administration said U.S. District Judge Amir H. Ali's order had created \"an untenable payment plan at odds with the President’s obligations under Article II to protect the integrity of the federal fisc and make appropriate judgements(sic) about foreign aid – clear forms of irreparable harm.\"\n\nAny response from the groups that are fighting the Trump administration is due before Friday at 12 p.m., meaning the pause could potentially be relatively short-lived.\n\nUSAID INSTRUCTIONS FOR FIRED EMPLOYEES GIVES THEM 15 MINUTES TO GATHER BELONGINGS FROM SHUTTERED DC BUILDING\n\nAn American flag and USAID flag fly outside the USAID building in Washington, D.C., Feb. 1, 2025.(Reuters/Annabelle Gordon)\n\nThe Trump administration said it was eliminating more than 90% of USAID's foreign aid contracts and $60 billion in overall U.S. assistance around the world, putting numbers on its plans to eliminate the majority of U.S. development and humanitarian help abroad.\n\nThe cuts detailed by the administration would leave few surviving USAID projects for advocates to try to save in what are ongoing court battles with the administration.\n\nFlowers and a sign are placed outside the headquarters of the U.S. Agency for International Development, Feb. 7, 2025, in Washington.(AP Photo/Jose Luis Magana)\n\nWednesday's disclosures also give an idea of the scale of the administration's retreat from U.S. aid and development assistance overseas, and from decades of policy that foreign aid helps American interests by stabilizing other countries and economies and building alliances.\n\nTRUMP ADMIN TO SLASH 1,600 USAID POSITIONS JUST BEFORE MIDNIGHT\n\nThe memo said officials were \"clearing significant waste stemming from decades of institutional drift.\" More changes are planned in how USAID and the State Department deliver foreign assistance, it said, \"to use taxpayer dollars wisely to advance American interests.\"\n\nPresident-elect Donald Trump and Elon Musk attend the UFC 309 event at Madison Square Garden on Nov. 16, 2024, in New York City.(Jeff Bottari/Zuffa LLC)\n\nPresident Donald Trump and ally Elon Musk have hit foreign aid harder and faster than almost any other target in their push to cut the size of the federal government. Both men say USAID projects advance a liberal agenda and are a waste of money.\n\nThe administration has filed an emergency appeal to the Supreme Court in one other case so far, arguing that a lower court was wrong to reinstate the head of a federal watchdog agency after Trump fired him.\n\nFox News' Bill Mears and Shannon Bream contributed to this report.\n\nBradford Betz is a Fox News Digital breaking reporter covering crime,political issues,and much more.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}