{
    "question": "In what ways could the DOGE resignations, conflicting agency guidance on the OPM email, and the lawsuit contesting firings for nonresponse affect the legality, implementation, and public trust of the administration’s effort to cut federal staff?",
    "content": {
        "source_1": "The federal agency that sent out an email over the weekend asking workers what they accomplished last week can't fire those workers for not responding, claims anamended lawsuitfiled Monday on behalf of federal employees.\n\nWhy it matters:It's the latest potential legal stumbling block for DOGE and Elon Musk's slash-and-burn workforce strategy.\n\nCatch up fast:Over the weekend, at President Trump's prodding to be more aggressive, Musk announced that workers would get an email asking what they'd done in the past week. \"Failure to respond will be taken as a resignation,\" he said.\n\nWhere it stands:On Monday afternoon, President Trump appeared to back Musk's threat — if employees don't respond to that email, \"you're sort of semi-fired or you're fired,\" he said, answering reporter questions during an event with French President Emanuel Macron.\n\nReality check:Musk and the White House have provided no evidence to back up that claim.\n\nZoom in:The Monday lawsuit amends an earlier complaint filed by a coalition of unions, including the AFL-CIO and American Federation of Government Employees.\n\nThe Office of Personnel Management,the federal government's HR office,which sent out the email over the weekend, does not have that authority, the suit alleges.\n\nThe intrigue:Several federal agencies have told their workers not to respond to the email request.\n\nWhat to watch:Also on Monday, an independent federal oversight agency said that some of the administration's mass firings of probationary workers were unlawful, per a report inGovernment Executive.\n\nThe bottom line:It's a confusing time to work for the federal government.\n\nEditor's Note: This story has been updated with additional reporting on the firings of probationary workers.",
        "source_2": "Gabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nJesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current affairs and trending news. He has covered current affairs, healthcare, pop culture, and sports. Jesus joined Newsweek's U.S. bureau in 2024, and has previously worked for The Financial Times and served as an international reporter and newsletter editor for El Espectador in Colombia. He graduated with an M.A. in Journalism and Digital Innovation from New York University. Languages: English, Spanish. You can get in touch with Jesus by emailingj.mosquera@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nMore than 20 civil service employees resigned Tuesday from Elon Musk's Department of Government Efficiency (DOGE), citing their refusal to use their technical expertise to \"dismantle critical public services.\"\n\nMusk, the world's richest man, and adviser to former President Trump,faced backlashas the departing staffers voiced concerns over the department's mission, which have included thousands of layoffs and contract cancellations.\n\nNewsweekhas reached out to DOGE's media contact via email on Tuesday morning for comment.\n\nDOGE, led by Musk, has been aggressively slashing the federal workforce and restructuring contracts in an attempt to cut spending. However, critics argue that the cost-saving claims are overstated and that many of the budget cuts have created inefficiencies rather than improvements.\n\nThe mass resignation of engineers, data scientists and product managers mark a temporary setback for Musk and theRepublicanpresident's tech-driven effort to overhaul the federal workforce. Their departures come amid a series ofcourt challengesaimed at halting or reversing attempts to fire or pressure thousands of government employees out of their jobs.\n\n\"We swore to serve the American people and uphold our oath to the Constitution across presidential administrations,\" the 21 staffers wrote in a joint resignation letter, a copy of which was obtained by The Associated Press. \"However, it has become clear that we can no longer honor those commitments.\"\n\nThe employees also warned that many of those recruited by Musk to shrink the federal government under PresidentDonald Trumpwere political ideologues lacking the necessary skills or experience for the task ahead.\n\n\"Several of these interviewers refused to identify themselves, asked questions about political loyalty, attempted to pit colleagues against each other, and demonstrated limited technical ability,\" the staffers wrote in their letter.\n\nSome interviewers displayed a limited grasp of technical matters, while many appeared to be young, ideologically driven, and more motivated by admiration for Musk than by a genuine interest in improving government technology.\n\n\"This process created significant security risks,\" the staffers said.\n\nThe resigning staffers had been part of what was originally the United States Digital Service, an office created during PresidentBarack Obama's administration in response to the failed launch of Healthcare.gov, the online portal for Americans enrolling in health insurance under his landmark health care law.\n\nMany had previously held senior positions at major tech firms likeGoogleandAmazonand had joined the government out of a commitment to public service.\n\nThat changed with Trump's decision to empower Musk. The day after Trump's inauguration, the staffers wrote, they were summoned to a series of interviews that previewed the opaque and disruptive operations of Musk's DOGE.\n\nThe remaining 65 staffers were absorbed into DOGE's government-cutting initiative, with nearly a third resigning together on Tuesday.\n\n21 civil staffers wrote in a joint resignation letter obtained by the Associated Press:\"We will not use our skills as technologists to compromise core government systems, jeopardize Americans' sensitive data, or dismantle critical public services,\" they wrote. \"We will not lend our expertise to carry out or legitimize DOGE's actions.\"\n\nSenator John Curtis, a Republican from Utah,saidon CBS'sFace the Nationon Sunday:\"If I could say one thing toElon Musk, it's like, please put a dose of compassion in this. These are real people. These are real lives. These are mortgages. It's a false narrative to say we have to cut and you have to be cruel to do it as well.\"\n\nSenator Chris Van Hollen, a Democrat from Maryland,saidonFace the Nationon Sunday:\"You've got Elon Musk taking a chainsaw to the federal government and important services, and there's no Article 4 in the Constitution that gives Elon Musk that authority... the actions he's taking are illegal, and we need to shut down this illegal operation.\"\n\nMusk announced on X over the weekend that federal workers would receive \"an email requesting to understand what they got done last week.\" He added that \"failure to respond will be taken as a resignation.\"\n\nIt remains to be seen whether, and how many, federal employees, will be removed from their posts afterthe deadline to respond to Musk's email passes. On Monday, theTeslaCEO issued a new threat, writing that \"subject to the discretion of the President,\" workers would be \"given another chance\" to send over details about what they did last week.\n\nAs many of 200,000 federal government employeeshave lost their jobsamid mass layoffs in the first month of Trump's second term.\n\nThis story contains reporting by The Associated Press.\n\nThis is a developing news story and will be updated as more information is available.\n\nUpdate: 2/25/25, 11:23 a.m. ET: This article has been updated with additional information.\n\nUpdate: 2/25/25, 11:55 a.m. ET: This article has been updated with additional information.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nJesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current affairs and trending news. He has covered current affairs, healthcare, pop culture, and sports. Jesus joined Newsweek's U.S. bureau in 2024, and has previously worked for The Financial Times and served as an international reporter and newsletter editor for El Espectador in Colombia. He graduated with an M.A. in Journalism and Digital Innovation from New York University. Languages: English, Spanish. You can get in touch with Jesus by emailingj.mosquera@newsweek.com\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he                                    ...Read more",
        "source_3": "Nearly two dozen federal techies working on the Department of Government Efficiency’s spending cuts resigned Tuesday, accusing Elon Musk of trying to “dismantle critical public services.”\n\nThe 21 staffers, who were engineers, data scientists and product managers at US Digital Service, said ina resignation letter obtained by the Associated Pressthat they felt they could no longer in good conscience carry out some of DOGE’s objectives.\n\n“We swore to serve the American people and uphold our oath to the Constitution across presidential administrations,” the workers wrote. “However, it has become clear that we can no longer honor those commitments.”\n\n“We will not use our skills as technologists to compromise core government systems, jeopardize Americans’ sensitive data, or dismantle critical public services,” the staffers said. “We will not lend our expertise to carry out or legitimize DOGE’s actions.”\n\nThe workers who quit constituted roughly a third of the 65 staff members who had been at the agency, which is part of the Office of Management and Budget and also helps with IT issues in the Executive Office of the President.\n\nEarlier this month, 40 other Digital Service staffers were forced out, including designers, human resources workers and contracting staff, current and former employees told the AP.\n\n“These highly skilled civil servants were working to modernize Social Security, veterans’ services, tax filing, health care, disaster relief, student aid, and other critical services,” the other group’s Tuesday resignation letter said. “Their removal endangers millions of Americans who rely on these services every day. The sudden loss of their technology expertise makes critical systems and American’s data less safe.”\n\nFederal judgeshave already dealt blows to some of DOGE’s cost-cutting directives at the hands of Musk’s reportedly wet-behind-the-ears minions, but that hasn’t halted the billionaire or his team of engineers onboarding at various agencies from pressing forward tofind waste, fraud and abuse of taxpayer dollarsandcall for mass firings.\n\nThe Digital Service employees who resigned had previously worked at big tech firms such as Google and Amazon and wrote in their letter that they were unimpressed with the experience and technical knowledge of the DOGE cost-cutters.\n\n“Several of these interviewers refused to identify themselves, asked questions about political loyalty, attempted to pit colleagues against each other, and demonstrated limited technical ability,” the group said. “This process created significant security risks.”\n\nThe Musk-inspired techies wore White House visitors’ badges and grilled the civil servants at times about their personal political opinions, some targeted staffers said.\n\nBooted Digital Service engineer Jonathan Kamens went public with his experience after being swept up in the initial firings, telling the AP that he believes he was sacked for having endorsed Democratic nominee and Vice President Kamala Harris for president in 2024.\n\nReps for the Digital Service and White House did not respond to Post requests for comment Tuesday."
    }
}