{
    "question": "How might the CDU’s 28% victory under Friedrich Merz shape Germany’s policy agenda and approach to governing in the coming months?",
    "content": {
        "source_1": "Europe must seek to “achieve independence” from the United States, Germany’s likely next chancellor Friedrich Merz said after exit polls showed his opposition conservatives were on track to win Sunday’s election, in a vote that also saw surging support for thefar-right.\n\nMerz, an old-school conservative who has never held a government role previously, is set to lead Europe’s biggest economy and most populous state, after his center-rightChristian Democratic Union (CDU)and its sister party won 28.6% of the vote, according to preliminary official results.\n\n“Let’s get the party started,” Merz, 69, told supporters as he declared victory at the CDU’s party headquarters in central Berlin, an apparent nod to wanting to get coalition negotiations underway quickly as the region grapples with US President Donald Trump’s upending of Europe and US relations.\n\nIn a televised roundtable later Sunday evening, Merz also criticized US “intervention” in the German election campaign in recent days. “The interventions from Washington were no less dramatic and drastic and ultimately outrageous than the interventions we have seen from Moscow,” he said. “We are under such massive pressure from two sides that my top priority is to create unity in Europe.”\n\nRelated articleWho is Friedrich Merz, Germany’s likely next chancellor?\n\nHe continued, “My absolute priority will be to strengthen Europe as quickly as possible so that, step by step, we can really achieve independence from the USA.”\n\n“I would never have believed that I would have to say something like that on television. But at the very least, after Donald Trump’s statements last week, it is clear that the Americans - at least this part of the Americans in this administration - are largely indifferent to the fate of Europe,” he said.\n\nThe far-rightAlternative for Germany (AfD)became the second-largest party, with an unprecedented 20.8%, preliminary official results showed, meaning the party – once on the fringes as officially suspected of extremism – is now a major political force. However, it faces exclusion from government by other parties, due to what is known as a “firewall” arrangement.\n\nChancellorOlaf Scholz’s center-left Social Democratic Party (SPD) took just 16.4% of the vote following the collapse of its “traffic light coalition” government – adramatic turnaroundin the party’s fortunes since the 2021 election, when it won 25.7%.\n\nMerz now faces an enormous task following Sunday’s snap election that was dominated by concerns over immigration, theeconomyand the return of Trump.\n\nSunday’s preliminary results cap off an eventful election period that drew extraordinary involvement from White House officials and has once again seen debate rage around Germany’s immigration policies.\n\nTrump sent shockwaves across Europe after he pushed ahead with peace talks on Ukraine with Russia, excluding both Kyiv and European leaders – prompting European leaders to hold emergency talks to discuss its unified response on the crisis.\n\nThe CDU’s party headquarters were filled with cheers and applause on Sunday evening as the exit polls were revealed and it became clear that the opposition party was set to become the largest group. Outside the building, a small group of protesters had gathered to demonstrate against what they perceive as party leader Friedrich Merz’s hard line on immigration.\n\nThe mood at the AfD election party, meanwhile, was ecstatic as it emerged that the party had almost doubled its support, with people cheering and waving Germany flags. Party co-leader Alice Weidel took to the stage to tell cheering crowds that the AfD had “never been stronger.”\n\nRelated articleGermany’s far-right may be frozen out of power, but the AfD is now a powerful force\n\nA day after the AfD surged to second place, Weidel stressed that “firewalls are undemocratic” as she spoke to CNN’s Fred Pleitgen in Berlin on Monday morning.\n\n“There should be no firewalls at all,” the far-right leader said. Asked how the AfD would want to work together with Trump administration, Weidel said she wanted them to be “very good” partners and be able to “have serious and proper conversations.”\n\nSpeaking to reporters on Monday morning, Weidel said she had missed overnight calls from America, including from tech billionaire Elon Musk. “When I turned my phone on this morning there were calls from the US, including one from Elon Musk, who wanted to congratulate me personally.”\n\nGermany’s rebuilding after the Nazi era came under the US-led NATO security alliance and its later prosperity was powered by cheap Russian energy and trade with China.\n\nWhat was once certain has unraveled and if Merz – who has pledged to tack right and promised to provide leadership in Europe - does become chancellor he has an enormous task ahead.\n\nTwo recent deadly attacks, one in Magdeburg before Christmas andanother in Munichlast week – both carried out by migrants with differing motives – fanned the flames of division in the run up to Sunday’s vote.\n\nThe AfD, which has been accused of using immigrants has a scapegoat, capitalized on these attacks for its own political gain, and has even called for “remigration” – the mass expulsion of immigrants, regardless of their citizenship status in Germany.\n\nBoth the CDU and the SPD also ramped up pledges around irregular migration and protecting internal security in the wake of recent attacks, meaning that even if the AfD do not take office they have already shaped the debate.\n\nWith all votes counted, world leaders began congratulating Merz on his election win.\n\nBritish Prime Minister Keir Starmer said in a post on X that he looked forward “to working with the new government to deepen our already strong relationship, enhance our joint security and deliver growth for both our countries.”\n\nFrench President Emmanuel Macron said he wanted to work together for a “strong and sovereign Europe.”\n\nOf the 60 million Germans eligible to vote on Sunday, 82.5% cast their ballot, according to official data — an increase from 2021 when voter turnout was at 76.4%.\n\nUnder Germany’s system it is difficult for any party to gain enough votes to govern alone and it remains to be seen what form coalition-building talks will take.\n\nSome aspects, however, are already clear-cut; other main parties made clear that the AfD will not be part of any negotiations, meaning it is shut out of power for now.\n\nIt seems likely that Merz will call on Scholz’s Social Democrats – the other major centrist party in Germany – to build a government. Another potential coalition partner is the environmental Greens, which served in Scholz’s coalition government.\n\nThe “traffic light” coalition brought together an uneasy alliance of three ideologically different parties and its collapse triggered Sunday’s snap vote, a relative rarity in a country which has long had one of the most stable political systems in Europe.\n\nAlso notable in the exit polls was a successful outcome for the socialist Die Linke party, which won 8.8% – comfortably pushing it over the 5% threshold needed to enter parliament.\n\nIt remains unclear at this stage whether Merz will need one or two partners to form a majority. Three-way coalition governments in Germany are rare.\n\nOverall, it could take weeks of haggling to form a new government, meaning more political paralysis for Berlin at a time of wider uncertainty.\n\nCNN’s Nadine Schmidt, Sebastian Shukla, Claudia Otto, Chris Stern and Benjamin Brown contributed reporting.",
        "source_2": "This is Radio Schuman, your new go-to podcast to spice up your weekday mornings with relevant news, insights, and behind-the-scenes from Brussels and beyond.\n\nFrom the economy to the climate and the EU's role in world affairs, this talk show sheds light on European affairs and the issues that impact on our daily lives as Europeans. Tune in to understand the ins and outs of European politics.\n\nNo agenda, no argument, no bias, No Comment. Get the story without commentary.\n\nDare to imagine the future with business and tech visionaries\n\nEuronews Tech Talks goes beyond discussions to explore the impact of new technologies on our lives. With explanations, engaging Q&As, and lively conversations, the podcast provides valuable insights into the intersection of technology and society.\n\nEurope's water is under increasing pressure. Pollution, droughts, floods are taking their toll on our drinking water, lakes, rivers and coastlines. Join us on a journey around Europe to see why protecting ecosystems matters, how our wastewater can be better managed, and to discover some of the best water solutions.   Video reports, an animated explainer series and live debate - find out why Water Matters, from Euronews.\n\nWe give you the latest climate facts from the world’s leading source, analyse the trends and explain how our planet is changing. We meet the experts on the front line of climate change who explore new strategies to mitigate and adapt.\n\nThis is Radio Schuman, your new go-to podcast to spice up your weekday mornings with relevant news, insights, and behind-the-scenes from Brussels and beyond.\n\nFrom the economy to the climate and the EU's role in world affairs, this talk show sheds light on European affairs and the issues that impact on our daily lives as Europeans. Tune in to understand the ins and outs of European politics.\n\nNo agenda, no argument, no bias, No Comment. Get the story without commentary.\n\nDare to imagine the future with business and tech visionaries\n\nEuronews Tech Talks goes beyond discussions to explore the impact of new technologies on our lives. With explanations, engaging Q&As, and lively conversations, the podcast provides valuable insights into the intersection of technology and society.\n\nEurope's water is under increasing pressure. Pollution, droughts, floods are taking their toll on our drinking water, lakes, rivers and coastlines. Join us on a journey around Europe to see why protecting ecosystems matters, how our wastewater can be better managed, and to discover some of the best water solutions.   Video reports, an animated explainer series and live debate - find out why Water Matters, from Euronews.\n\nWe give you the latest climate facts from the world’s leading source, analyse the trends and explain how our planet is changing. We meet the experts on the front line of climate change who explore new strategies to mitigate and adapt.\n\nThe centre-right Christian Democratic Union (CDU) and its leader Friedrich Merz were the big winners of German federal elections on Sunday with 28% of the vote, provisional results confirmed.\n\nThe Alternative for Germany (AfD) was second with 20%, doubling its vote share from Germany's last election in 2021, which turned out to be the best result for a far-right party in the country since World War II.\n\nHowever, several smaller parties tipped to make the 5% threshold needed to enter the Bundestag failed to do so, including the liberal Free Democratic Party (FDP) and the left-wing conservative Sahra Wagenknecht Alliance (BSW).\n\nFor hours, preliminary results showed the BSW had managed to pass the threshold — a result which would have deeply complicated Merz's desire to form a two-party coalition government.\n\nUltimately, the BSW scored a nail-biting 4,97%, while the far-left Die Linke party won 8% of the vote in a last-minute success following a viral social media campaign.\n\nOlaf Scholz's centre-left Social Democrats (SPD) party came in third with 16% of the vote — the worst score for the party since 1887.\n\nIn a speech, Scholz called the results \"bitter\" and claimed responsibility for the party's failure to score with voters.\n\nWhile the results will be confirmed as official only on 14 March, according to German election regulations, the provisional results can be taken as final as all the votes across the constituencies have been counted.\n\nThe SPD said it was open to talks coalition talks with the CDU, as members of the party hinted at a new leadership structure set to be announced on Monday in which Scholz will take a backseat.\n\nThe party's current co-leader, Lars Klingbeil, is tipped to become the new parliamentary chairman.\n\nA so-called \"GroKo\", or \"Grand Coalition\" between the CDU and the SPD, has been widely suggested as the most favourable result, as Merz has stated he would aim to avoid an ideologically messy three-way grouping.\n\nThe CDU leader has set his sights on a new government by Easter, noting in a televised appearance on Sunday evening that by that time, Germany wouldn't have had a government with a parliamentary majority for six months.\n\nWhether Merz's timeline is realistic is unclear, as SPD members hinted that upcoming coalition talks would be difficult with both sides disagreeing on several policy points.\n\nOne SPD lawmaker told Euronews the results marked a \"massive defeat\" for the party. He said that although SPD members would engage in talks to form a coalition with the CDU, trust in Merz was at an \"all time low\" after he cooperated with the far-right to push through harsh migration proposals during the election campaign.\n\nThe SPD's deputy leader Klara Geywitz told Bayerischer Rundfunk that the SPD's seat losses will cause the party \"major problems across the board.\"\n\n\"Friedrich Merz's CDU has presented an election program that would create additional billions in gaps in the already strained budget,\" she added.\n\nMembers of the SPD have also pushed for the right to veto entering into a coalition with the CDU, a process that would require the agreement of a majority of members of the party in order for a coalition to take shape.\n\nMeanwhile, the AfD cleaned up in east Germany, with results showing the far-right party ahead in areas of former East Germany, including Brandenburg, Saxony and Thuringia.\n\nThe AfD's co-leader Alice Weidel said she was open for coalition discussions with the CDU as she celebrated the party's historic victory on Sunday, a suggestion Merz dismissed.\n\nThe party is now set to be the largest opposition force in parliament, having gained a 10-point increase in their result in 2021.\n\n\"We will have fresh elections,\" Weidel said. \"I don't think we'll have to wait another four years.\"\n\nMerz has pledged that the AfD would cease to exist once his party solved the \"problems\" that led to its ride.\n\n\"The party only exists because there have been problems that haven't been solved. They're happy if these problems get worse and worse,\" Merz said.",
        "source_3": "Published:17:55 BST, 23 February 2025|Updated:09:24 BST, 24 February 2025\n\nGermany's hard right AfD has surged to second place in the snap election with the conservative opposition emerging as the largest party overall.\n\nThe exit poll suggests the conservative CDU have topped Sunday's election securing 28.5 per cent of the vote.\n\nMeanwhile, the AfD have taken 20 per cent of ballots cast which is the strongest showing for a far-right party in Germany's post war era.\n\nThe AfD are already celebrating the result with their leader Alice Weidel claiming that the anti-migrant party was now 'firmly anchored' in mainstream German politics.\n\nMeanwhile the governing centre-left SPD has slumped to third place in what looks set to be a disastrous result for Chancellor Olaf Scholz's party.\n\nThe party are already describing the result as a 'historic defeat' which if the exit poll is to be believed could see the SPD's vote share drop to its lowest since the 19th century.\n\nFollowing a campaign rocked by a series of violent attacks, and frequent interventions from President Trump's administration, the CDU looks set to return to government after four years in opposition.\n\nTheir leader, Friedrich Merz, is now on track to be the next chancellor despite not having any previous government experience.\n\nMerz, 69, has promised to provide greater leadership than ChancellorOlaf Scholzand to liaise more with key allies, restoringGermanyto the heart of Europe.\n\nThe leader of the AfD, Alice Weidel, waves a German flag at the party's headquarters. The party have taken 20 per cent which is the strongest showing for a far-right party in Germany's post war era\n\nThe victorious leader of the CDU Friedrich Merz looks set to be the country's next leader\n\nCurrent Chancellor Olaf Scholz. Meanwhile, the governing centre-left SPD has slumped to third place in what looks set to be a disastrous result for Scholz's party\n\nA brash economic liberal who has shifted the CDU to the right, he is considered the antithesis of former conservative Chancellor Angela Merkel, who led Germany for 16 years.\n\nGermany's politicians will now look to the tricky task of forming a coalition government which can often take weeks if not months.\n\nThose negotiations are certain to be even harder after a campaign which exposed sharp divisions over migration and the prospect of a much larger collection of AfD MPs in the bundestag.\n\nThe result suggests a remarkable surge for the AfD which has jumped from fifth place in 2021 to second place rising its share of the vote by ten points.\n\nHowever, the party is unlikely to be in government due to the firewall in German politics where moderate parties refuse to work with any hard right parties since the Second World War.\n\nDespite this, Wiedel has already said tonight that she is open to discussing a role in government with the CDU.\n\n'We extend our hand to offer cooperation with the CDU. Otherwise change won't be possible in Germany,' she said.\n\nSome analysts believe the party's strong showing tonight could pave the way for an AfD win in 2029.\n\nThis graph shows seat projects for different parties in the German parliament\n\nMerz celebrates with Bavarian state premier and leader of the Christian Social Union. Merz, 69, has promised to provide greater leadership than Chancellor Olaf Scholz and to liaise more with key allies, restoring Germany to the heart of Europe\n\nAfD deputy parliamentary leader Beatrix von Storch told The Mail: ‘So many people have voted here for us and expressed their political will, so it is outrageous that they are not able to have their view represented here, but it is of course quite clear that it is only a question time before other parties will change their position of keeping us out.’\n\n‘I can’t see the next coalition government lasting longer than two years, and after this we will then do very well because are just fed up of not being listened to and we are the only party who are responding to the fears and the anger of the German people right now concerned mass illegal migration.’\n\nFederal spokesperson Stephan Brandner added: ‘Back then we were called everything: nationalist, racist, you name it.\n\n‘But the truth is we are responding to the public. If you want a serious response to the massive problems in our county then it’s only us really offering it, and that’s why we will win outright at some point.’\n\nAmong Germany's smaller parties it looks set to be a bruising night for the Scholz's former and current coalition partners with the Greens taking 13.5 per cent of the vote.\n\nThe liberal centrist FDP look set to just miss the 5 per cent threshold needed to enter parliament - taking 4.9 per cent of the vote.\n\nIt was the FDP who brought down the government in November when they dramatically pulled out of the coalition during a dispute over the budget.\n\nThe party's leader Christian Lindner - who previously served as Scholz's finance minister -  has already hinted he could resign if his party failed to get into the parliament.\n\nWeidel and AfD party members react to the exit poll. The result suggests a remarkable surge for the AfD which has jumped from fifth place in 2021 to second place rising its share of the vote by ten points\n\nSupporters of Die Linke celebrate the exit poll result. The party appears to have seen a late surge to 8.5 per cent\n\nElsewhere, the far-left Die Linke - which was formed by former communists from East Germany - appears to have seen a late surge to 8.5 per cent seeing off a challenge to the party from the newly formed economically left-wing, socially conservative Sahra Wagenknecht Alliance.\n\nCoalition talks could leave Scholz in a caretaker role for months, delaying urgently needed policies to revive Europe's largest economy after two consecutive years of contraction and as companies struggle against global rivals.\n\nIt would also create a leadership vacuum in the heart of Europe even as it deals with a host of challenges including U.S. President Donald Trump threatening a trade war and attempting to fast-track a ceasefire deal for Ukraine without European involvement.\n\nGermany, which has an export-oriented economy and long relied on the United States for its security, is particularly vulnerable.\n\nSince the lastelectionin 2021 the once mighty German economy, which steered the EU through the Euro crisis, has stagnated since the start of the Ukraine war with Scholz's government struggling to revitalise Europe's largest economy.\n\nGermans are now more pessimistic about their living standards now than at any time since the financial crisis in 2008.\n\nOn top of this, the country is dealing with creaking infrastructure due to lack of investment in public services such as trains - which are now the most delayed in the whole of Europe.\n\nGermany has also struggled to modernise in recent years with many offices still reliant on fax machine.\n\nCoalition talks could leave Scholz in a caretaker role for months, delaying urgently needed policies to revive Europe's largest economy after two consecutive years of contraction and as companies struggle against global rivals\n\nGerman Economy and Climate Minister and top candidate for the Greens party Robert Habeck reacts after exit poll results are announced\n\nAttitudes towards migration have also hardened, a profound shift in German public sentiment since its 'Refugees Welcome' culture during Europe's migrant crisis in 2015, that the AfD has both driven and harnessed.\n\nTonight's exit poll has also revealed dramatic shifts in how different age groups vote with young people appearing to rush to the extreme ends of the political spectrum.\n\nDie Linke won among 18 to 24-year-olds with the AfD in second. Meanwhile, the AfD came top among 25 to 35-year -olds and the CDU is first among older voters.\n\nSunday's election came after the collapse last November of Scholz's coalition of his Social Democrats (SPD), the Greens and pro-market Free Democrats (FDP) in a row over budget spending.\n\nThe election campaign has been dominated by fierce exchanges over the perception that irregular immigration is out of control, fueled by a series of attacks in which the suspected perpetrators were of migrant origin.\n\nIt has also been overshadowed by the unusually forceful show of solidarity by members of the Trump administration - including Vice President JD Vance and tech billionaire Elon Musk - for the anti-migrant AfD, and broadsides against European leaders.\n\nThe 12-year old AfD party took second place for the first time in a national election, according to the exit polls.\n\nTo be sure, the AfD is unlikely to govern for now as all mainstream parties have ruled out working with it, though some analysts believe its strength could pave the way for an AfD win in 2029.\n\nSupport for the AfD, along with a small but significant vote share for the far left and the decline of Germany's big-tent parties, is increasingly complicating the formation of coalitions and governance.\n\nEU allies are cautiously hopeful the elections might deliver a more coherent government able to help drive forward policy at home and in the bloc.\n\nElection posters for the CDU and FDP in Munich. Following a campaign rocked by a series of violent attacks, and frequent interventions from President Trump's administration, the CDU looks set to return to government after four years in opposition\n\nThe AFD logo projected onto a building during the party's election event in Berlin\n\nSome also hope Merz will reform the 'debt brake', a constitutional mechanism to limit government borrowing that critics say has strangled new investment.\n\nThe most expected outcome of this election is a coalition of Merz's CDU with the SPD in an uneasy 'grand coalition.'\n\nOther coalition options include the 'Kenya coalition' - named for the colours on the Kenyan flag, which could see the Greens join the government.\n\nOr if the FDP enter parliament they might form a government with the CDU  and Greens in a so-called 'Jamaica coalition'.\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nBy posting your comment you agree to ourhouse rules.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with ourPrivacy Policy."
    }
}