{
    "question": "How might OPM’s request for weekly accomplishment reports—alongside agency discretion to exclude personnel and the FBI’s instruction to pause responses—shape the practical, legal, and organizational outcomes of the administration’s effort to reduce the federal workforce?",
    "content": {
        "source_1": "Elon Musk’s DOGE email ultimatum to federal workers may have revealed internal tensions in Trump administration\n\nI would like to be emailed about offers, events and updates from The Independent. Read ourPrivacy notice\n\nElon Musk’semail ultimatum to federal workers, sent as part of his supposedly unofficial role as the leader of the Department of Government Efficiency, is facing pushback from across Washington, D.C. just hours after it was sent.\n\nAnd some of the backlash is coming from unexpected corners of the Trump administration, perhaps teasing early signs of power struggles to come.\n\n“Consistent with President @realDonaldTrump’s instructions, all federal employees will shortly receive an email requesting to understand what they got done last week,” Musk wrote Saturday afternoon. “Failure to respond will be taken as a resignation.”\n\nFederal workers received an email from the Office of Personnel Management (OPM) asking, “What did you do last week?”\n\nThey were instructed to reply with five bullet points outlining their accomplishments in the previous seven days, excluding any classified information.\n\nUnderstandably, the email triggered confusion and questions about the legality of Musk's move. Accordingto a White House legal filing, Musk officially has no federal government role or authority.\n\nThe most strident response came from the FBI and its newly sworn-in director,Kash Patel. He sent his own email to employees to clarify where the bureau stood.\n\n“FBI personnel may have received an email from OPM requesting information. The FBI, through the Office of the Director, is in charge of all of our review processes and will conduct reviews in accordance with FBI procedures,” Patel wrote, according to anNBC report.\n\n“When and if further information is required, we will coordinate the responses. For now, please pause any responses.”\n\nSimilarly, at theState Department, Ambassador Tibor Nagy, currently performing the duties of the Under Secretary for Management,emailed colleaguesto say that no one is obligated to report their activities outside of their Department chain of command.\n\n“The State Department will respond on behalf of the Department,” Nagy wrote.\n\nSupervisors at theDepartment of Justicealso told employees to refrain from replying to the email, as they feared it could trigger ethics violations.\n\nBloomberg Law, citing five people familiar with the situation,reports that at least five DOJ office leaders quickly responded to the email by telling their staff not to detail their work until they receive further clarity.\n\nTwo sources told the outlet that two U.S. attorney’s offices messaged workers that the support office for all 93 U.S. attorneys was trying to gather guidance from DOJ leadership about how to comply or whether the email was even legitimate.\n\nA notable exception to the orders to hold off on replying was Trump loyalist Ed Martin, who now leads the U.S. attorney’s office in Washington. Martin gave his staff the go-ahead to reply.\n\n“DOGEand Elon are doing great work! History. We are happy to participate,” Martin told his office, according to an email he posted on X.\n\n“Please respond to the HR email carefully with regard to confidentiality and our duties. Be general if you need to. If anyone gives you problems, I’ve got your back. You’re good.”\n\nABC News reportsthat the acting U.S. attorney in Maryland, Philip Selden, sent a message to his office saying: “We are seeking guidance from [DOJ] about how employees in our office should respond to this request. Please note we want to be thoughtful given the sensitivity of the work we do every day. For example, grand jury secrecy as outlined by Rule 6(e), confidentiality, identifying uncharged targets, wiretap information, attorney-client privilege, etc. I suggest holding off on responding until we receive guidance.\"\n\nThe Musk OPM email is also reported to have been received by employees of theConsumer Financial Protection Bureau, theNational Oceanic and Atmospheric Administration, and the Centers for Disease Control and Prevention. One report suggested that some 2 million federal workers received it.\n\nCNN reportsthat the email even went toair traffic controllers, with their union telling the network that it wasn’t clear how and when the understaffed workforce would be able to respond.\n\nThe country’s more than 10,000 air traffic controllers are already working mandatory six-day weeks of ten-hour shifts, the union said.\n\nMeanwhile, at thePentagon,The Washington Postreports that one defense official said his manager told employees that they were “considering guidance” having received the email, though it was not clear if such guidance would come.\n\nThe Postsays that the official’s reaction to the situation was to send a reporter a well-known gif of the Muppet Elmo in hell, his arms outstretched while surrounded by fire.\n\nOne of the more fiery responses came from Senator Tina Smith, junior senator for Minnesota. She wrote on X, mocking Musk’s own questionable employment status with the federal government: “This is the ultimate d*** boss move from Musk — except he isn’t even the boss, he’s just a dick.”\n\nShe added: “I bet a lot of people have had an experience like this with a bad boss - there’s an email in your inbox on Saturday night saying, ‘Prove to me your worthiness by Monday or else.’ I’m on the side of the workers, not the billionaire a**hole bosses.”\n\nMusk's post on X and subsequent email came just after PresidentDonald Trumppraised Musk’s efforts at DOGE onTruth Socialand encouraged him to go even further: “ELON IS DOING A GREAT JOB, BUT I WOULD LIKE TO SEE HIM GET MORE AGGRESSIVE.”\n\nIt seems like a lot of people think he might have overstepped his remit.\n\nJoin thought-provoking conversations, follow other Independent readers and see their replies",
        "source_2": "US government workers received an email on Saturday afternoon asking them to list their accomplishments from the past week or resign - the latest development in the Trump administration's efforts to scale back the federal workforce.\n\nThe email came after Trump's billionaire confidant Elon Musk posted on X that employees would \"shortly receive an email requesting to understand what they got done last week\".\n\n\"Failure to respond will be taken as a resignation,\" he wrote.\n\nMusk, as the head of the so-called Department of Government Efficiency (Doge), has been leading an outside effort to aggressively curtail government spending through funding cuts and firings.\n\nThe email arrived in inboxes shortly after Trump spoke at the Conservative Political Action Conference (Cpac). The messages came with the subject line \"What did you do last week?\" from a sender listed as HR.\n\nThe Office of Personnel Management (OPM), the federal government's human resources agency, confirmed the email was authentic in a statement to CBS, the BBC's US news partner.\n\n\"As part of the Trump administration's commitment to an efficient and accountable federal workforce, OPM is asking employees to provide a brief summary of what they did last week by the end of Monday, CC'ing their manager,\" it said. \"Agencies will determine any next steps.\"\n\nIn a copy of the email obtained by the BBC, employees were asked to explain their accomplishments from the past week in five bullet points - without disclosing classified information - before midnight on Monday.\n\nThe message did not mention whether a failure to respond would be considered a resignation.\n\nThe American Federation of Government Employees, the largest union representing federal employees, criticised the message as \"cruel and disrespectful\" and vowed to challenge any \"unlawful terminations\" of federal employees.\n\n\"Once again, Elon Musk and the Trump Administration have shown their utter disdain for federal employees and the critical services they provide to the American people,\" Everett Kelley, union president, said in a statement.\n\nOn Sunday morning, Musk wrote on his social media platform X that \"a large number of responses have been received already\", adding: \"These are the people who should be considered for promotion.\"\n\nA few hours later, Musk said on X that the move was important because \"a significant number of people who are supposed to be working for the government are doing so little work that they are not checking their email at all\".\n\nMusk went on to say that Doge believes \"non-existent people or the identities of dead people are being used to collect paychecks\", claiming \"outright fraud\" without evidence.\n\nMusk has repeatedlymade claims of fraudindefending his team's workacross a range of government departments and functions.\n\nBut on Saturday, there appeared to be some disagreement about the latest email among government department heads.\n\nNewly-confirmed FBI director Kash Patel told his employees in an email that they should \"pause any responses\" to the OPM memo.\n\n\"FBI personnel may have received an email from OPM requesting information,\" Patel wrote in a message obtained by CBS News. \"The FBI, through the Office of the Director, is in charge of all of our review processes, and will conduct reviews in accordance with the FBI procedures.\"\n\nThe State Department sent a similar message to its employees and said it will respond on behalf of the department.\n\n\"No employee is obligated to report their activities outside of their Department chain of command,\" an email from Tibor Nagy, acting undersecretary for management, that was obtained by US media said.\n\nThe union that represents many government employees, the American Federation of Government Employees (AFGE), was critical of the email and threatened legal action if employees were unlawfully terminated.\n\n\"It is cruel and disrespectful to hundreds of thousands of veterans who are wearing their second uniform in the civil service to be forced to justify their job duties to this out-of-touch, privileged, unelected billionaire who has never performed one single hour of honest public service in his life,\" AFGE President Everett Kelley said.\n\nEarlier in the day, Trump touted cuts and told a crowd of supporters at Cpac that the work of federal employees had been inadequate because some of them work remotely at least some of the time.\n\n\"We're removing all of the unnecessary, incompetent and corrupt bureaucrats from the federal workforce,\" the president told the crowd at the annual conference in suburban Washington on Saturday afternoon.\n\n\"We want to make government smaller, more efficient,\" he added. \"We want to keep the best people, and we're not going to keep the worst people.\"\n\nElon Musk's team has exacted wide-ranging changes to the US federal infrastructure through Doge and with approval from the White House.\n\nThousands of government employees at the Internal Revenue Service (IRS), the Pentagon and the Federal Aviation Administration (FAA), as well as other agencies, have been fired in recent weeks.\n\nThe email mirrors Musk's handling of employees after he acquired social media platform Twitter, now called X, in 2022. As the staff there shrunk under his ownership, he issued ultimatums that included a now-infamous request to commit to being \"extremely hardcore\" at work or resign.\n\nTrump has repeatedly applauded Musk's government-cutting measures.\n\nIn a Truth Social post, Trump said that Musk is doing a \"great job\" in reducing the size of the federal government and that he would like to see him \"get more aggressive\" in the pursuit.\n\nThe US military is preparing to activate troops as part of Trump's crackdown on street crime.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.",
        "source_3": "Update (1647ET):Following Elon Musk's Saturday tweet instructing federal workers to list at least five accomplishments over the past week by Monday at midnight, or face termination - which was followed up by an actual email from the Office of Personnel Management (OPM),several agencies issued statements telling their employees to pump the brakes.\n\nSo far the Pentagon, FBI, State Department, and various parts of the Intelligence Community have told their employees to hold off.\n\n\"When and if required, the Department will coordinate responses to the email you have received from OPM.For now, please pause any response to the OPM email titled ‘What did you do last week,\" said DoD Under Secretary of Defense for Personnel and Readiness Darin Selnick in a statement.\n\nThat followed a similar statement by FBI Director Kash Patel, who told the bureau that they would conduct their own employee reviews that align with the agency's procedures.\n\nThe State Departmenttold its employees; \"The State Department will respond on behalf of the Department. No employee is obligated to report their activities outside of their Department chain of command.\"\n\nTop leadership at the State Department has instructed its employees to ignore@elonmusk’s productivity inquiry, saying, essentially—we will evaluate our own people. A sign not all Trump officials are on board with Musk’s DOGE email.pic.twitter.com/9tsufc1rXA\n\nWhile National Intelligence Director Tulsi Gabbard told employees of agencies she oversees in the Intelligence Community (IC): \"Given the inherently sensitive and classified nature of our work, I.C. employees should not respond to the OPM email,\" according toThe Hill.\n\nMeanwhile, Everett Kelley, the national president of the American Federation of Government Employees (AFGE), wrote a letter to Musk and OPM acting director Charles Ezell, directing its 800,000 members to defy the demand.\n\n\"Federal employees report to their respective agencies through their established chains of command; they do not report to OPM,\" said Kelly, adding that the demand was \"irresponsible\" and a \"sophomoric attempt\" to cause confusion and intimidate federal workers.\n\n\"I am also requesting that OPM rescind the email and apologize to all federal employees,\" he said.\n\nMusk has defended the 'accomplishments' email,saying thatit was designed to weed out \"non-existent people or the identities of dead people\"who are collecting government checks. He also agreed with commentator and author Mike Cernovich that this also helps to identify high-performing employees.\n\nI have a a few friends who are government employees wrapped up in the DOGE \"chaos.\" And unlike what is being reported in the media, they are ecstatic...Deep down, most (good) people want to feel like their job has meaning and purpose.They've been spinning their wheels in…\n\nI have a a few friends who are government employees wrapped up in the DOGE \"chaos.\" And unlike what is being reported in the media, they are ecstatic...Deep down, most (good) people want to feel like their job has meaning and purpose.They've been spinning their wheels in…\n\nYou can support ZeroHedge by purchasing one of these high-quality, sharp, kickassZeroHedge Multitoolswhich comes with belt pouch. On sale until Monday!\n\nUpdate (1118ET):After panic swept through Washington over Elon Musk's email requiring all federal employees to send an email by Monday at midnight with five bullet points explaining what they got done last week, Musk explained the reasoning behind the last minute demand:\"immense fraud.\"\n\n\"The reason this matters is thata significant number of people who are supposed to be working for the government are doing so little work that they are not checking their email at all!\"Musk wrote on X. \"In some cases, we believenon-existent people or the identities of dead peopleare being used to collect paychecks. In other words, there is outright fraud.\"\n\nThe reason this matters is that a significant number of people who are supposed to be working for the government are doing so little work that they are not checking their email at all!In some cases, we believe non-existent people or the identities of dead people are being used…https://t.co/Rj5Xe6vYZB\n\nMusk then said that the email is \"avery basic pulse check,\" adding in a subsequentpost\"They are covering immense fraud.\"\n\nThis email is a very basic pulse checkhttps://t.co/4qEKErwSuE\n\nUpdate (2356ET):Panic has predictably ensued over Elon Musk's requirement thatall federal employeesprovide a five bullet point summary of what they accomplished last week, due by midnight on Monday (full details below).\n\nWhile newly minted FBI Director Kash Patel exempted agency employees from the requirement (with much of the intelligence community reportedly set to get the same pass),there's a lot of upset feds out there.\n\nA DHS employee emails, re Elon's latest: \"Not answering that email, due with baby in three days and already having to use sick leave because of the stress... I hope they fire me at this point can't wait to sue them\"\n\nSenator Tina Smith (D-MN) lashed out, posting to X, \"This is the ultimate dick boss move from Musk - except he isn’t even the boss, he’s just a dick.\" (she said on the heels of a coordinated campaign to brand him 'Co-President Musk')\n\nTo which Musk replied, \"What did you accomplish this week?\"\n\nIndeed, this takes less than 5 minshttps://t.co/N9F53zxfbz\n\nThe Rapid Response team, which posts daily information about the Trump agenda, was happy to oblige.\n\nUpdate (2308ET):New FBI DirectorKash Patel sent an email to all agency employees on Saturday night instructing them to \"pause any responses\"to Elon Musk's request that all federal employees provide summaries of their accomplishments over the past week or face termination.\n\n\"The FBI, through the Office of the Director, is in charge of all of our review processes, and will conduct reviews in accordance with FBI procedures,\" reads the note from Patel. \"When and if further information is required, we will coordinate the responses.For now, please pause any responses.\"\n\nThe power struggles begin.FBI Director Kash Patel tonight has instructed his employees to ignore ⁦@elonmusk⁩’s productivity inquiry, saying, essentially—we will evaluate our own people, thanks.pic.twitter.com/BkisigRPNq\n\nMeanwhile, at least one federal employee apparently don't have time to answer the email - butdidhave time to complain to a MSM reporter about having to do it.\n\nFirst off, if this federal employee had time to email a left-wing reporter, surely she had time to email her manager about what she accomplished last week. Also, she took sick leave last week so she can just say that she took the week off from work. Why is this all so dramatic?https://t.co/A2AjlWf2H3\n\nElon Musk is 'running the Twitter playbook on the government,' after writing in a Saturday post on X that all federal employees will be receiving an email \"shortly\" requesting to \"understand what they got done last week.\"\n\nThose who fail to reply \"will be taken as a resignation.\"\n\nConsistent with President@realDonaldTrump’s instructions, all federal employees will shortly receive an email requesting to understand what they got done last week.Failure to respond will be taken as a resignation.\n\nAnd there it is (though no mention of the implied resignations for failure to respond):\n\nNew: America's diplomats serving around the world have now received Elon Musk's email asking them to explain their work, per a diplomatic source. Here it is, subject line: \"What did you do last week?\"https://t.co/4bOxUGpSF7pic.twitter.com/3sXspFUB1C\n\nWhen X user 'The Rabbit Hole' commented that Musk is \"running the Twitter playbook on the government,\" Musk replied: \"It works.\"\n\nThe post came hours after President Donald Trump encouraged Musk to \"get more aggressive\" with the Department of Government Efficiency (DOGE), adding \"REMEMBER, WE HAVE A COUNTRY TO SAVE.\"\n\nMusk's email comes after roughly 77,000 federal employees accepted DOGE's \"Fork in the Road\" email offering roughly 8 months of pay in exchange for resigning. After that,DOGE moved to fire thousands of employees across various agencies- mostly those in a probationary period who have been in their jobs for less than one year.\n\nIt also comes after the Trump administration scored a legal victory when a judge allowed Musk and crew to continue accessing federal data and arranging for mass layoffs.\n\nLast week, Trump signed an executive order directing agencies to work with DOGE to make \"preparations to initiate large-scale reductions in force.\""
    }
}