{
    "question": "How might MSNBC’s cancellation of The ReidOut and the planned primetime changes, including an expanded role for Jen Psaki, influence the network’s strategy for rebuilding viewership and its relationship with its core audience?",
    "content": {
        "source_1": "MSNBC‘s evening line-up may soon look quite different from what die-hard viewers have come to expect.\n\nThe NBCUniversal-backed cable network is expected to move the trio of Symone Sanders-Townsend, Alicia Menendez and Michael Steele to its 7 p.m. weekday slot Tuesday through Friday, according to two people familiar with the matter. The group on Mondays will lead two hours, 7 p.m. to 9 p.m. The move will have direct implications forJoy Reid, the anchor who currently fills 7 p.m. She is expected to host her last show on MSNBC this week.\n\nWhat’s more,Alex Wagner, who has hosted weeknights at 9 p.m. save for a Monday night led by Rachel Maddow, is expected to be named a contributor, according to three people with knowledge of current talks. Wagner, who has been working as a correspondent across the U.S. during the first 100 days of the new Trump presidencywhile Rachel Maddow anchors each day at 9, is unlikely to return to her weeknight slot, these people indicated. Jen Psaki is expected to take over at least one of the hours, according to one of these people. MSNBC is also in talks with Eugene Daniels of Politico and Melissa Murray, a law professor at New York University who specializes in the regulation of sex, marriage, caregiving and reproductive rights that would have them join the network in unspecified capacities, according to one of these people.\n\nMSNBC declined to make executives available for comment.Puck previously reportedon some of the aforementioned plans.\n\nThe moves come quickly afterRebecca Kutler, a former senior executive at CNN who is known for her facility in developing new talent and programming concepts,was named MSNBC’s new president.She takes the helm of the network as it faces unique challenges, including the pressures of working with the Trump White House and being spun off along with other NBCU cable networks into a new publicly-traded company.  “Our jobs are hard on a normal day, and these are not normal times,” she told employees on the day that her new role was announced by Mark Lazarus, the NBCU executive who will lead the new spin-off.\n\nLike other cable networks,MSNBC is facing significant business challenges. More of the viewers who settle in each evening to watch a few hours of commentary on MSNBC are migrating elsewhere. MSNBC is projected to shed approximately 10.5% of its subscribers between the end of 2023 and the end of 2025, according to estimates from Kagan, a market-research firm that is part of S&P Global Intelligence. Rivals Fox News Channel and CNN are seen experiencing similar erosions in that period. MSNBC could be left with an average of 61.3 million viewers at the end of 2025, compared with 68.5 million in 2023 — and this with an election year, an event that brings viewers back to news, between the two milestones.\n\nKutler has described plans to build an independent newsgathering apparatus for MSNBC, which will lose its ties to NBC News after the new company is formed. She wants to launch a separate MSNBC Washington bureau, and to add a new roster of international and domestic correspondents. She also wants to hire a new head of talent, a Washington bureau chief and a head of content strategy. Yet she has articulated a plan to hew close to the network’s progressive leanings, not trying to steer it to the center.\n\nMSNBC has been working to bring viewers back after the results of the 2024 presidential election. Both MSNBC and CNN saw significant erosion following Donald Trump’s return to the White House and the national conversation, and both have unveiled programing shake-ups in recent weeks. At MSNBC, Rachel Maddowreturned to hosting the 9 p.m. hour Monday through Friday, compared to the Monday-only schedule (with various special appearances) she has enjoyed in recent years. Since the inauguration, MSNBC’s overall viewership has surged in primetime and across the day, though its audience levels remain well below that of Fox News Channel.\n\nKutler helped create “The Weekend,” the show led by Sanders-Townsend, Melendez and Steele, which has run early Saturday and Sunday mornings. In its first year on air, the program has seen audience for its time slot improve noticeably in both overall viewership and among people between 25 and 54, the demographic most preferred by advertisers in news programs. Psaki, meanwhile,has been a favorite of MSNBC executivessince the former Biden White House press secretaryjoined its Sunday lineup in March of 2023.\n\nReid has been a weekday mainstay at MSNBC since 2020,when she replaced veteran Chris Matthews.At the time, the assignment was seen as a critical one, assembling a crowd in the early evening that would stick around for MSNBC’s primetime schedule. Reid was known for offering unapologetically partisan views, but the audience for her program, “The ReidOut,” has been eroding. Overall “ReidOut” viewership was off 28% in February through the 20th compared to the year-earlier period, according to Nielsen data, while audiences between 25 and 54 had fallen 14%. While Reid’s show drew more viewers overall than CNN’s “Erin Burnett Outfront,” its time-slot rival, CNN had a bigger audience among the advertiser demo.\n\nThere has been growing concern within several news outlets about drawing the wrath of the Trump administration. CNN, part of Warner Bros. Discovery, has parted ways with some anchors who tilted hard against Trump’s policies and media practices,including, most recently, Jim Acosta.\n\nKutler may have more changes in store, and has been looking at MSNBC’s daytime and weekend schedule as well. The network has yet to announce a formal replacement for Andrea Mitchell, the NBC News veteranwho anchored a noon program for decades, and recently left. Staffers are curious whether the daytime anchors, who are affiliated with NBC News, will stay with MSNBC over the longer haul.",
        "source_2": "MSNBC’s evening lineup is getting a makeover as it undergoes major changes that may surprise loyal viewers.\n\nThe network, backed by NBCUniversal, is reportedly moving Symone Sanders-Townsend, Alicia Menendez, and Michael Steele to the 7 p.m. weekday time slot, Tuesday through Friday, according toVariety.\n\nOn Mondays, the trio will host a two-hour block from 7 to 9 p.m., which will affect Joy Reid, who currently anchors at 7 p.m. She is expected to host her final show this week.\n\nAdditionally, Alex Wagner, who’s been hosting at 9 p.m. most nights (except Mondays when Rachel Maddow takes over), is likely to become a contributor instead, according to sources.\n\nWagner, who spent time reporting across the U.S. during the first 100 days of Trump’s presidency while Maddow anchored 9 p.m., probably will not return to her weeknight spot. Jen Psaki is expected to take over one of the hours, as sources suggest.\n\nThe startling reorganization comes after the naming of former CNN senior executiveRebecca Kutleras MSNBC’s new president.\n\nKutler is well-known for her keen eye in developing new talent and programming, which is key now that there are new pressures working with the Trump adminstration and the network being spun off as a publicly-traded company.\n\n“Our jobs are hard on a normal day, and these are not normal times,” she told employees on the day that her new role was announced by Mark Lazarus, the NBCU executive who will lead the new spin-off.\n\nKutler has laid out plans to create a totally separate news team for MSNBC once it breaks away from NBC News. She’s looking to start a new Washington bureau for MSNBC and bring in a mix of fresh international and U.S. reporters.\n\nSince her takeover at the helm of MSNBC, ratings have improved after a significant post-election decline, largely due to Rachel Maddow returning to regular primetime appearances during Trump’s first 100 days in office.\n\nKutler also wants to hire a new head of talent, a Washington bureau chief, and someone to lead content strategy.Despite all these changes, Kutler’s sticking with MSNBC’s progressive vibe and isn’t planning to push the network toward the center.\n\nIn speaking to staffers on Wednesday, Kutler hinted that MSNBC would have to develop its own newsgathering system, saying: “I think it’s important that we all share in the exciting parts of what the year ahead is going to mean in terms of getting to build a new news organization — one that is built for us, for our needs first, to be part of a new company that is standing itself up, and that we have a seat at the table at the ground floor of that, and what that’s going to look like and we get to help determine that.\n\n“It’s going to be hard, but it’s also going to be exciting and interesting and a really important time to do what all of us do.”\n\nIf you purchase a product or register for an account through a link on our site, we may receive compensation.By using this site, you consent to ourUser Agreementand agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with ourPrivacy Policy.",
        "source_3": "MSNBC anchorJoy Reidconfirmed herfinalReidOutairingwill be on Monday.\n\nReid has anchored the show for five years. Before hostingtheReidOut, Reid was a weekend host of the showAM Joyfrom 2016 to 2020. She was promoted to the 7 p.m. Eastern time slot in 2020.\n\n“I just want to say thank you to everyone who has reached out with kindness and encouragement, both personally and in these social media streets,” Reid wrote. “So very proud of The Reidout @joy.msnbc.com team, who are truly family, and all of our supporters & friends. See you tomorrow night at 7, one more time.”\n\nI just want to say thank you to everyone who has reached out with kindness and encouragement, both personally and in these social media streets. So very proud of The Reidout @joy.msnbc.com team, who are truly family, and all of our supporters & friends. See you tomorrow night at 7, one more time ‼️\n\nThe hosts of the network’sThe Weekend, including Symone Sanders-Townsend, Michael Steele, and Alicia Menendez, will reportedly take over Reid’s prime-time spot after co-hosting their show that airs Saturday and Sunday mornings. Steele is the only host with conservative roots, as he is a former Republican National Committee chairman. None have commented publicly as of Monday morning.\n\nReid will likely continue to post online. On TikTok, Reid has over 360,000 followers, and she has over 300,000 on Bluesky. It remains to be seen whether she will stay with the network.\n\n‘THE REIDOUT’ IS OUT: MSNBC CANCELS JOY REID’S SHOW IN NETWORK SHAKEUP\n\nIn November,Comcastannounced it would spin off a large chunk of NBCUniversal cable channels, including MSNBC. Comcast is likely considering the spinoff due to the overall decline in cable subscriptions. A projected70 million householdswill keep their cable by the end of this year, while in 2010, shortly before Comcast bought NBCUniversal and its networks, 105 million households had cable. Meanwhile, Fox News has about 75% of the cable news prime-time viewership.\n\nElon Musk has often joked online about how MSNBC would change if he bought it from Comcast. MSNBC host Joe Scarborough ofMorning Joemade alighthearted commentin November that “you never know what’s going to happen” and the whole show’s cast could be fired."
    }
}