{
    "question": "How might Dan Bongino’s appointment as FBI deputy director, given his background in law enforcement and conservative media, influence the bureau’s day-to-day operations and public perception of its high-profile investigations?",
    "content": {
        "source_1": "Conservative commentator Dan Bongino in Hollywood, Florida, in 2022. Photo: Jason Koerner/Getty Images\n\nConservative commentatorDan Bonginowas named deputy FBI director, PresidentTrumpannounced on Sunday night.\n\nThe big picture:The \"Dan Bongino Show\" podcast host will serve in the role that doesn't require Senate confirmation under newly confirmed FBI directorKash Patel, a fellow Trump loyalist.\n\nBackground:Bongino lacks FBI experience, but he previouslyservedin the New York Police Department (NYPD) beforejoiningthe U.S. Secret Service and working in the Presidential Protective Division during the administrations of PresidentsGeorge W. BushandObama.\n\nWhat they're saying:BonginothankedTrump on X as he shared the president's original post praising the former Fox News host as \"a man of incredible love and passion for our Country.\"\n\nGo deeper:What to know about Kash Patel, Trump's pick for FBI director\n\nEditor's note: This article has been updated with further context.",
        "source_2": "Ewan Palmer is a Newsweek News Reporter based in London, U.K. His focus is reporting on US politics, and Florida news. He joined Newsweek in February 2018 after spending several years working at the International Business Times U.K., where he predominantly reported on crime, politics and current affairs. Prior to this, he worked as a freelance copywriter after graduating from the University of Sunderland in 2010. Languages: English. Email: e.palmer@newsweek.com.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nA number of MAGA figures have celebrated the news that conservative podcast host Dan Bongino has been selected by PresidentDonald Trumpto serve as theFBI's deputy director.\n\nNewsweekhas connected the FBI and Bongino for comment via email.\n\nBongino isthe latest Trump loyalistto be given a top position at the nation's leading federal law enforcement agency afterKash Patelwas sworn in as FBI director on Friday.Democratshave long raised concerns that Trump might use the federal government to target political opponents.\n\nTrump announced via Truth Social on Sunday that Bongino has been named the next deputy director of the FBI. The president called the move \"great news for Law Enforcement and American Justice.\"\n\nA number of MAGA figures have praised the move to name Bongino as the next deputy director of the FBI. Colorado RepresentativeLauren Boebertdescribed the news as \"everything.\"\n\nThe announcement has also been condemned by Democratic figures and critics of the president. TheRepublicansAgainst Trump social media account shared the news online, adding, \"God help us all.\"\n\nBongino is a former New York City police officerand Secret Service agentwho served on the protection detail for PresidentsGeorge W. BushandBarack Obama. The formerFox Newshost also ran for a U.S.Senateseat in Maryland in 2012 and for congressional seats in Maryland and Florida in 2014 and 2016, losing all three races.\n\nHe is the host ofThe Dan Bongino Show, which is ranked the 56th most popular podcast on Spotify. Trump appeared on Bongino's podcast in October 2024, just before the election.\n\nBongino, a staunch Trump supporter, has said thatthe 2020 election was riggedagainst theRepublicanHe also described the FBI's search of Trump's Mar-a-Lago home in August 2022 for classified materials as \"tyranny.\"\n\nColorado Representative Lauren Boebert posted on X, formerly Twitter:\"This. Is. EVERYTHING!!\"\n\nCharlie Kirk, right-wing political commentator and founder of Turning Point USA, posted on X:\"Wow! BREAKING: Great patriot and dear friend Dan Bongino has just been named Deputy Director of the FBI. This is incredible news!! Thank you @dbongino for the sacrifice. I know this is in service to our country. America just got a huge upgrade.\"\n\nDefense Secretary Pete Hegsethposted:\"Huge congrats to my friend Dan Bongino. No better patriot or professional. Patel-Bongino atop the FBI is pure [fire emoji].\"\n\nPresident Donald Trump wrote on Truth Social:\"Great news for Law Enforcement and American Justice! Dan Bongino, a man of incredible love and passion for our Country, has just been named the next DEPUTY DIRECTOR OF THE FBI, by the man who will be the best ever Director, Kash Patel. Working with our great new United States Attorney General,Pam Bondi, and Director Patel, Fairness, Justice, Law and Order will be brought back to America, and quickly. Congratulations Dan!\"\n\nDan Bongino while sharing Trump's announcement on X:\"Thank you Mr. President, Attorney General Bondi, and Director Patel.\"\n\nRepublicans Against Trump posted:\"Donald Trump just named far-right MAGA podcaster Dan Bongino, a notorious conspiracy theorist who promoted the lie that the 2020 election was 'stolen,' to serve as Deputy Director of the FBI. God help us all.\"\n\nDemocratic Connecticut Senator Chris Murphy posted:\"Trump has chosen grifters to lead the FBI. Kash Patel sells 'K$SH' branded merch, vaccine reversal pills. Dan Bongino's entire show is telling listeners the world is ending so they buy the dozens of survivalist products he sells. I know this feels like a bad dream. It isn't.\"\n\nTrump's appointment of the FBI deputy director does not require Senate confirmation, meaning Bongino will face no issues in assuming the role.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nEwan Palmer is a Newsweek News Reporter based in London, U.K. His focus is reporting on US politics, and Florida news. He joined Newsweek in February 2018 after spending several years working at the International Business Times U.K., where he predominantly reported on crime, politics and current affairs. Prior to this, he worked as a freelance copywriter after graduating from the University of Sunderland in 2010. Languages: English. Email: e.palmer@newsweek.com.\n\nEwan Palmer is a Newsweek News Reporter based in London, U.K. His focus is reporting on US politics, and Florida news. He joined Newsweek in February 2018 after spending several years working at the International Business Times U.K., where he predominantly reported on crime, politics and current affairs. Prior to this, he worked as a freelance copywriter after graduating from the University of Sunderland in 2010. Languages: English. Email: e.palmer@newsweek.com.\n\nEwan Palmer is a Newsweek News Reporter based in London, U.K. His focus is reporting on US politics, and Florida                                    ...Read more",
        "source_3": "Fox News contributor Ben Domenech joins 'Fox & Friends Weekend' to discuss President Donald Trump touting his first month in a CPAC speech, DOGE and the president's transparency.\n\nPresidentDonald Trumpannounced that Dan Bongino will serve as the next deputy director of the Federal Bureau of Investigation (FBI).\n\n\"Great news for Law Enforcement and American Justice,\" Trump wrote in a post on Truth Social on Sunday night. \"Dan Bongino, a man of incredible love and passion for our Country, has just been named the next DEPUTY DIRECTOR OF THE FBI, by the man who will be the best ever Director, Kash Patel.\"\n\nThe president said Bongino has a Master’s Degree in Psychology from the City University of New York and an MBA from Penn State.\n\n\"He was a member of the New York Police Department (New York’s Finest!), a highly respected Special Agent with the United States Secret Service, and is now one of the most successful Podcasters in the Country, something he is willing and prepared to give up in order to serve,\" Trump wrote. \"Working with our great new United States Attorney General, Pam Bondi, and Director Patel, Fairness, Justice, Law and Order will be brought back to America, and quickly. Congratulations Dan!\n\nNEW FBI LEADER KASH PATEL TAPPED TO RUN ATF AS ACTING DIRECTOR\n\nDan Bongino as US Open winner Gary Woodland visits \"FOX & Friends\" at Fox News Channel Studios on June 18, 2019 in New York City.(Photo by Roy Rochlin/Getty Images)\n\n\"Another aspect of the life of Dan Bongino that I think is very important. He has a great wife, Paula, and two wonderful daughters who truly love their dad,\" Trump later wrote. \"What an incredible job Dan will do!!!\"\n\nDan Bongino, a conservative commentator, is photographed in Stuart, Florida on Thursday, March 18, 2021.(Calla Kessler for The Washington Post via Getty Images)\n\nShortly after the announcement, Bongino responded on X, saying, \"Thank you Mr. President, Attorney General Bondi, and Director Patel.\"\n\nPatel was sworn in to serve as the ninth FBI director on Friday, after a narrow senate vote of 51-49.\n\nPatel, a vociferous opponent of the investigations into Trump and one who served at the forefront of Trump's 2020 election fraud claims, vowed during his confirmation hearing last month that he would not engage in political retribution against agents who worked on the classified documents case against Trump and other politically sensitive matters.\n\nBut his confirmation comes at a time when theFBI’s activities, leadership and personnel decisions are being closely scrutinized for signs of politicization or retaliation.\n\nPatel held a number of national security roles during Trump's first administration — chief of staff to actingDefense SecretaryChris Miller, senior advisor to the acting director of national intelligence and National Security Council official.\n\nGreg Wehner is a breaking news reporter for Fox News Digital.\n\nStory tips and ideas can be sent to Greg.Wehner@Fox.com and on Twitter @GregWehner.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}