{
    "question": "How might Judge Dale Ho’s decision to vacate the trial date and appoint Paul Clement to argue against the DOJ’s motion to drop charges influence the balance between prosecutorial discretion and judicial oversight in this case?",
    "content": {
        "source_1": "A federal judge has vacated the upcoming trial date for New York City Mayor Eric Adams, but declined to immediately dismiss the charges all together in a case that has roiled the Justice Department.\n\nJudge Dale Ho, instead, is appointing conservative attorney Paul Clement to present arguments challenging the Justice Department’s decision to drop charges against Adams and as he explores what his options are and if a dismissal is in the public interest.\n\nThe DOJ move to end the case against Adams has prompted an exodus of prosecutors who disagreed with the decision.Eightfederal prosecutors, including the interim US attorney for the Southern District of New York, have resigned in protest.Four deputy mayors have departed City Hallas well.\n\nAdams, who consented in writing to the deal to drop the charges, has denied any quid pro quo with the Trump administration for dropping the charges of bribery, corruption, wire fraud and soliciting and accepting donations from foreign nationals in exchange for boosting President Donald Trump’s immigration agenda.\n\nRelated articleEric Adams’ embrace of Trump unites Democrats against the New York City mayor\n\nThe Justice Department was represented earlier this week by acting Deputy Attorney General Emil Bove, one of Trump’s former personal attorneys, after protests from DOJ prosecutors. Bove defended the motion to drop charges against Adams, stressing that the DOJ headquarters has prosecutorial discretion and a prosecution of Adams interferes with the Trump administration’s immigration initiatives in New York City. He also pushed back against claims of a quid pro quo between Adams and the Trump administration.\n\nBove added at one point, unprompted, “I want to be clear I think the only question is whether there’s any basis to believe that I made these representations to the court in bad faith, and the answer to that is absolutely not.”\n\nIn his ruling Friday, Ho said “it is clear” that the April 21 trial date will be canceled.\n\nBut his move to appoint Clement means the charges against Adams will not go away.\n\nClement, who served as solicitor general under former President George W. Bush, is one of the nation’s leading Supreme Court advocates.\n\nOver the years, he’s helped push the law in the US further to the right through a range of cases he’s argued and won before the high court, including one last year in which the court’s conservative supermajority overturned a longstanding legal doctrine that gives federal agencies wide latitude to create policies and regulations in various areas of life and another one from several years ago that dramatically expanded Second Amendment rights.\n\n“Normally, courts are aided in their decision-making through our system of adversarial testing, which can be particularly helpful in cases presenting unusual fact patterns or in cases of great public importance,” Ho wrote Friday.\n\n“Here, the recent conference helped clarify the parties’ respective positions, but there has been no adversarial testing of the Government’s position generally or the form of its requested relief specifically,” he added, referring to this week’s hearing.\n\nBriefs are due by March 7 and Ho says he’ll hold a hearing March 14, if necessary.\n\nCorrection: This story has been updated to reflect that Judge Dale Ho is the judge presiding over the case.\n\nThis story has been updated with additional developments.﻿",
        "source_2": "A federal judge did not immediately dismiss corruption charges against New York City Mayor Eric Adams on Friday, instead asking an independent attorney to present arguments on the Justice Department’s push to drop the case—as the Trump administration faces criticism for abandoning the charges andallegationsthe move was politically motivated.\n\nFeb. 21Judge Dale E. Ho vacated Adams’ trial date, butappointedPaul Clement—an attorney who served as U.S. solicitor general under President George W. Bush—to present arguments next month in the Justice Department’s request to drop the case against Adams.\n\nFeb. 19New York Gov. Kathy Hochul is set to announce guardrails seeking to expand the state’s oversight of New York City’s government and limit Adams’ independence, along with potential protections for city workers to prevent Adams from removing people who disagree with him,Politicoand TheNew York Timesreported—though Hochul hasnot exercised her powerto remove Adams from office.\n\nFeb. 17Four more top officials in New York City—First Deputy Mayor Maria Torres-Springer and deputy mayors Meera Joshi, Anne Williams-Isom and Chauncey Parker—resigned on Monday as part of the fallout of the former acting U.S. attorney accusing Adams of trading his cooperation with President Donald Trump’s immigration enforcement for the charges against him being dropped.,The New York Timesreported.\n\nFeb. 14Acting Deputy Attorney General Emil Bove and other DOJ officials formally filed a request for Ho to drop the case against Adams, ending a days-long standoff in which multiple DOJ staffers declined to sign the paperwork (one of the federal prosecutors who signed off on the request was Edward Sullivan, whoreportedlydid so to protect his colleagues from losing their jobs).\n\nFeb. 14Lead Adams prosecutor Hagan Scotten resigned early in the day, saying in a letter to Bove that “any assistant U.S. attorney would know that our laws and traditions do not allow using the prosecutorial power to influence other citizens, much less elected officials, in this way.”\n\nIn the scathing resignation letter, Scotten also said, “I expect you will eventually find someone who is enough of a fool, or enough of a coward, to file your motion,” adding: “But it was never going to be me.”\n\nFeb. 13Acting U.S. Attorney in Manhattan Danielle Sassoon resigned over the request to drop the charges against Adams, saying in aletterto Trump’s Attorney General Pam Bondi that she “remain(ed) baffled by the rushed and superficial process by which this decision was reached,” and equated it to a “quid pro quo.”\n\nAfter Sassoon resigned, the acting head of the DOJ’s Public Integrity Section, John Keller, and three other members of that section resigned, as did the acting head of the Criminal Division, Kevin Driscoll,NBC Newsreported.\n\nFeb. 10Bove requested the U.S. attorney for the Southern District of New York dismiss the corruption charges against Adams, saying they were filed too close to the 2025 mayoral primary and were limiting how much Adams could cooperate with Trump’s immigration policy changes,The New York Timesreported.\n\nGet Forbes Breaking News Text Alerts:We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to(201) 335-0739or sign uphere.\n\nNot yet. A federal judge has to approve the decision to drop the charges, and while theTimesreported on Feb. 14 that judges have “little discretion” when it comes to not accepting the request, a judge may hold a hearing to question officials on why the charges are being dropped. Ho has requested that attorneys file briefs by March 7, with oral arguments the following week if needed.\n\nAdams wascharged in late Septemberon bribery, wire fraud and campaign finance-related charges. Prosecutors accused him of receiving illegal campaign donations from the Turkish government to his 2021 mayoral campaign, and other illegal donations as far back as 2014 when he was Brooklyn borough president. Theindictmentalleged an unnamed senior official in the “Turkish diplomatic establishment” facilitated donations to Adams’ campaign and gave him free or discounted Turkish airline flights and other gifts in exchange for Adams pressuring the city’s fire department to approve a high-rise consulate building for Turkey. Damian Williams, the top federal prosecutor in Manhattan at the time, said in a release Adams “abused his position” as the city’s highest official, and as borough president, and “put the interests of his benefactors, including a foreign official, above those of his constituents.” Adams pleaded not guilty to all charges.\n\nBove directed the U.S. attorney for the Southern District of New York to drop the charges, arguing the charges were filed too close to the mayoral primary in New York, and that they limited how cooperative Adams could be with immigration policy changes from Trump’s administration. Bove ordered the charges be dropped without prejudice, meaning they could be brought again in the future.\n\nIn the memo instructing the charges be dismissed, Bove said the dismissal had nothing to do with the merits of the case or the integrity of the prosecutors, but rather that “the pending prosecution has unduly restricted Mayor Adams' ability to devote full attention and resources to... illegal immigration and violent crime,”Reutersreported. Trump has made immigration reform and mass deportations a key part of the first weeks of his presidency, and the administration has been trying tomake an exampleout of sanctuary cities, or places that have laws in place to limit local police from cooperating with federal immigration agents, by making deportation raids in those cities. Adams has been getting closer to Trump following his election and inauguration, and on Feb. 13 after meeting with Trump’s border czar Tom Homan, Adamsannouncedhe would be signing an executive order to allow Immigration and Customs Enforcement agents to return to Rikers Island, a famous prison in the Bronx, which hasn’t been allowed since 2015 because of the city’s sanctuary laws.\n\nSassoon, who was Manhattan’s acting U.S. attorney, was the first to resign over Bove’s request the case be thrown out. In her resignation letter to Bondi, Sassoon said the request was “inconsistent with my ability and duty to prosecute federal crimes without fear or favor and to advance good-faith arguments before the courts.” She alleged Adams’ lawyers “repeatedly urged what amounted to a quid pro quo, indicating that Adams would be in a position to assist with the Department’s enforcement priorities only if the indictment were dismissed.” Alex Spiro, Adam’s lawyer, toldThe New York Timesthere was no quid pro quo and “we offered nothing and the department asked nothing of us.” Bove accepted Sassoon’s resignation on Feb. 13, saying in aletterobtained by the Times it was accepted because of her “choice to continue pursuing a politically motivated prosecution despite an express instruction to dismiss the case.” Bove also said the attorney’s office under her leadership “has demonstrated itself to be incapable of fairly and impartially reviewing the circumstances of this prosecution,” so he intended to transfer Adams’ prosecution to the Justice Department.\n\nTrumpsaidin a press conference Feb. 13 he did not request Adams’ case be dropped and said, “I know nothing about it.” After Trump met with Adams in December, hesuggestedhe may pardon Adams because he was being “treated pretty unfairly,” but he said he didn’t know the details of the case and would need to review it.\n\nDOJ Asks Prosecutors To Dismiss Charges Against NYC Mayor Eric Adams(Forbes)\n\nSeventh prosecutor in Eric Adams case resigns and calls out Trump’s former lawyer in scathing letter(CNN)",
        "source_3": "Mayor Eric Adams’ criminal case will stay in limbo for several more weeks — as a federal judge said Friday he wants to hear from an independent lawyer before deciding whether to toss the charges.\n\nManhattan federal Judge Dale Ho ordered Adams’ April 21 corruption trial adjourned as he appointed former US Solicitor General Paul Clement to argue against the Justice Department’s position that the mayor’s case should be dismissed.\n\nHe wrote in a five-page order that such an argument was necessary to hear because the DOJ effectively took the same position as Adams’ defense — and “in light of the public importance of this case, which calls for careful deliberation.”\n\nThe move comes aftera hearing this weekin which both the government and Adams’ lawyers urged the court to dismiss the bribery case, which they claimed was stopping the mayor from helping with President Trump’s immigration agenda.\n\nThe judge noted Friday he would “endeavor to rule expeditiously” after hearing Clement’s arguments, and potential counterarguments from the feds and Adams’ lawyers.\n\nThe court asked Clement to file his arguments by March 7 and said a possible hearing could be held on March 14, though Adams won’t have to appear.\n\nClement served as solicitor general under President George W. Bush and represented conservative causes before the US Supreme Court several times in recent years. He was also one of Fox News’ attorneys in its lawsuit with Dominion Voting Systems.\n\nAdams’ attorney Alex Spiro didn’t return a request for comment.\n\nHo’s order will keep Adams’ corruption case alive – albeit on life support – as the mayor faces what could be a bruising primary election and growing questions about his ability to lead New York City.\n\nAdams had received a stunning potential reprieve last week from Acting Assistant Attorney General Emil Bove, who is Trump’s former criminal defense lawyer.\n\nBove ordered Manhattan federal prosecutors – who began their probe into Adams in 2021, before he became mayor – to dismiss the case, although he also left open the possibility of reviving the charges at an undisclosed later date.\n\nHe claimed the charges were brought as part of a politically motivated prosecution and argued that Adams’ ability to lead the nation’s largest city and help with Trump’s immigration agenda was hindered because his security clearance was revoked due to the case.\n\nThe unusual move came after Adams’ legal team lobbied for Trump’s help in killing the case as the mayor, a Democrat, cozied up to the Republican commander-in-chief.\n\nBove’s memo ordering prosecutors to drop the charges — for reasons having nothing to do with the strength of the case — didn’t go over well with Danielle Sassoon, the acting head of the Manhattan US Attorney’s Office.\n\nSassoon resigned in protest, alleging that Adams and Trump’s DOJ officials agreed to a “quid pro quo” in which the mayor conditioned his support for the president’s immigration agenda on his case going away.\n\nThe government’s plan to leave open the possibility of re-indicting Adams lateris a “dismissal-with-leverage” gambitthat keeps Adams wrapped tightly around Trump’s finger, the case’s lead prosecutor, Hagan Scotten, wrote in his own resignation letter.\n\nAdams’ team and DOJ officials have denied the accusation.\n\nBove appeared by himself at the hearing Wednesday in Manhattan federal court where he argued in favor of tossing the case.\n\n“The continuation of this prosecution is interfering with national security and immigration enforcement initiatives being run and conducted by the Executive Branch,” Bove told the judge.\n\nBove added he didn’t “concede” that the judge had the power to keep the case alive “even if there was a quid pro quo” between Adams and Trump’s camp."
    }
}