{
    "question": "How might the DOJ lawsuit against New York City’s sanctuary policies reshape federal-local relations on immigration enforcement and affect safety and trust within immigrant communities?",
    "content": {
        "source_1": "Mayor Eric Adams, whose corruption charges were dropped so he could help with deportations, is among the defendants in the suit, which argues the federal government has sole power over immigration.\n\nThe Justice Department on Thursday sued Mayor Eric Adams, claiming that New York City is thwarting the Trump administration’s enforcement of immigration law, as it escalates efforts to crack down on the country’slargest sanctuary city.\n\nIn a 37-page lawsuit filed in Federal District Court in Brooklyn, the Trump administration said the city’s policies violate the supremacy clause of the Constitution, which gives federal laws precedence over state laws. The clause gives the administration “well-established, pre-eminent and pre-emptive authority to regulate immigration,” the suit argues.\n\nThe lawsuit, which also names the City Council, the Police Department and its commissioner as defendants, was the latest legal action by the Trump administration against so-called sanctuary jurisdictions, which limit cooperation between local law enforcement and federal immigration authorities. It comes after a similar lawsuit against Illinois and Chicagoin February, another against four of New Jersey’s largest cities in May and one against Los Angelesin June.\n\n“New York City has long been at the vanguard of interfering with enforcing this country’s immigration laws,” the administration said in its suit. “Its history as a sanctuary city dates back to 1989, and its efforts to thwart federal immigration enforcement have only intensified since.”\n\nMr. Adams, a Democrat, had for monthspublicly aligned himselfwith Mr. Trump on manyimmigration issuesas he lobbied the federal government to dropcorruption chargesagainst him.\n\nWe are having trouble retrieving the article content.\n\nThank you for your patience while we verify access. If you are in Reader mode please exit andlog intoyour Times account, orsubscribefor all of The Times.\n\nThank you for your patience while we verify access.",
        "source_2": "Billal Rahman is an immigration reporter based in London, U.K. He specializes in immigration policy and border security. He has uncovered allegations of misconduct among border agents under investigation and exposed claims of abuse at ICE-run detention centers in the U.S. He joined Newsweek in 2024 from The Independent. He has covered the British Post Office scandal and the conflict between Israel and Hamas. Originally from Glasgow, he studied Journalism in Edinburgh and then worked for STV News before moving to London in 2022. You can contact Billal at b.rahman@newsweek.com.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nTheDepartment of Justicehas sued New York Mayor Eric Adams, challenging local \"sanctuary\" policies that limit cooperation with federal immigration authorities.\n\nIt wants New York City's sanctuary policies to be declared unconstitutional, saying they impede the enforcement of federal immigration laws.\n\nThe Trump administration has viewedsanctuary cities and statesas obstacles to immigration enforcement operations, withlocal police not involved in ICE activity. Sanctuary laws are designed tolimit local cooperationwith federal immigration enforcement. These laws seek to protect immigrants in the country illegally by restricting the sharing of personal information with federal authorities and preventing local law enforcement from assisting in immigration arrests. Critics argue that sanctuary laws impede immigration enforcement operations.\n\nIn the lawsuit, the federal government is seeking to have the court declare New York City's sanctuary policies unconstitutional under the Supremacy Clause and to issue an injunction preventing the city from enforcing its limited-cooperation provisions.\n\n\"Some of these aliens find safe havens from federal law enforcement detection in so-called 'sanctuary' cities, where they are shielded among innocent Americans—who, all too often, later become their crime victim,\" the DOJ wrote in its complaint.\n\nThe complaint was brought in the Eastern District of New York and names Adams' administration as the defendant.\n\nThe DOJ's complaint says that New York City's refusal to hold individuals beyond their scheduled release time at the request of Immigration and Customs Enforcement (ICE), along with its prohibition on sharing release or incarceration information without a state court warrant or a conviction for a serious crime, directly conflicts with federal immigration statutes and the authority of the executive branch.\n\nNew York first implemented limited-cooperation policies in 2013, expanded them in 2014 and 2017, and solidified them further through Executive Order 50, signed in 2022. These measures restrict local law enforcement and correctional facilities from cooperating with federal immigration authorities in most cases.\n\nUnder the law, the city is permitted to honor detention requests only for individuals convicted of \"violent or serious\" crimes—a list that includes more than 170 offenses, such as rape and murder. Additionally, ICE must provide a warrant signed by a federal judge with each request in order for it to be considered.\n\n\"New York City has released thousands of criminals on the streets to commit violent crimes against law-abiding citizens due to sanctuary city policies,\" said Attorney General Pamela Bondi. \"If New York City won't stand up for the safety of its citizens, we will.\"\n\nIn the early days of Trump's second term, Adams appeared to strike an informal agreement with the White House. He appeared onFox Newsalongside border czarTom Homan, pledging to cooperate with ICE on targeting serious criminal immigrants. However, publicly, he has maintained he only backs the arrest of serious criminals.\n\nAdams' Press Secretary Kayla Mamelak Altus toldNewsweek:\"The job of a mayor is to protect the safety of every single person in their city — and that's exactly what Mayor Adams has worked to do every day for nearly four years. Keeping New Yorkers safe also means making sure they feel safe, and Mayor Adams has been clear: no one should be afraid to dial 911, send their kids to school, or go to the hospital, and no New Yorker should feel forced to hide in the shadows.\n\n\"That's why the mayor supports the essence of the local laws put in place by the City Council — but he has also been clear they go too far when it comes to dealing with those violent criminals on our streets and has urged the Council to reexamine them to ensure we can effectively work with the federal government to make our city safer. So far, the Council has refused. We will review the lawsuit.\"\n\nTom Decker, a former director of ICE's New York field office, toldNewsweek:\"Sanctuary cities threatens everyone in the United States. Local law enforcement within sanctuary cities are prevented to work alongside ICE to protect the community by the foolish policies passed by local officials.\"\n\nAttorney General Pamela Bondi said in a post on X:\"The Department of Justice is suing New York City and Mayor Eric Adams for continuing to obstruct law enforcement with sanctuary city policies. If New York's leaders won't step up to protect their citizens, we will.\"\n\nAssistant Attorney General Brett Shumat said in a statement:\"For too long, New York City has been at the vanguard of interfering with enforcing our immigration laws. Its efforts to thwart federal immigration enforcement end now.\"\n\nUpdate 07/25/25, 9:55 a.m. ET: This article was updated with comment from Mayor Eric Adams' office\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nBillal Rahman is an immigration reporter based in London, U.K. He specializes in immigration policy and border security. He has uncovered allegations of misconduct among border agents under investigation and exposed claims of abuse at ICE-run detention centers in the U.S. He joined Newsweek in 2024 from The Independent. He has covered the British Post Office scandal and the conflict between Israel and Hamas. Originally from Glasgow, he studied Journalism in Edinburgh and then worked for STV News before moving to London in 2022. You can contact Billal at b.rahman@newsweek.com.\n\nBillal Rahman is an immigration reporter based in London, U.K. He specializes in immigration policy and border security. He has uncovered allegations of misconduct among border agents under investigation and exposed claims of abuse at ICE-run detention centers in the U.S. He joined Newsweek in 2024 from The Independent. He has covered the British Post Office scandal and the conflict between Israel and Hamas. Originally from Glasgow, he studied Journalism in Edinburgh and then worked for STV News before moving to London in 2022. You can contact Billal at b.rahman@newsweek.com.\n\nBillal Rahman is an immigration reporter based in London, U.K. He specializes in immigration policy and border security. He has                                    ...Read more",
        "source_3": "These Sanctuary Policies have resulted in countless criminals being released into the City who should have been held for immigration removal.\"\n\nThe Trump administration sued New York City on Thursday over its sanctuary city policies, arguing that the city has illegally impeded the federal government from enforcing immigration laws.\n\nThelawsuitasserts that the city is violating the federal government’s jurisdiction under the Constitution’s supremacy clause. The city’s sanctuary policies designed to protect illegal aliens from federal law enforcement infringe upon the federal government’s authority to police immigration.\n\n“New York City’s Sanctuary Provisions have the purpose and effect of making it more difficult for federal immigration officers to carry out their responsibilities in that jurisdiction.\n\nNew York City’s sanctuary laws “intentionally obstruct the sharing of information envisioned and affirmatively protected by Congress, including sharing basic information such as release dates, court appearance dates, and custodial status,” the lawsuit states. “The challenged provisions also impair federal detention of removable aliens, including dangerous criminals, contrary to federal law.”\n\n“The Sanctuary Provisions further purport to direct federal officials to procure criminal arrest warrants to take custody of removable aliens, even though Congress has made an explicit policy choice that such apprehensions for removal can be effectuated by civil arrest warrants for immigration enforcement,” it continues.\n\nThe lawsuit also accused the city of effectively ensuring that criminal aliens are released onto the streets rather than being turned over to federal authorities for potential deportation. The ban on city officials turning criminal aliens over to Immigration and Customs Enforcement requires “ICE to risk officer safety and expend considerable resources to effectuate arrests in communities.”\n\n“This intentional sabotage of federal immigration enforcement is unlawful and dangerous. These Sanctuary Policies have resulted in countless criminals being released into the City who should have been held for immigration removal from the United States,” the lawsuit states.\n\nNew York City is the latest in a string of major American cities that have been hit with lawsuits over sanctuary city policies. The Trump administration in June sued Los Angeles. In February, the administration filed a lawsuit against Chicago.\n\n“Sanctuary cities are only sanctuaries for criminals. President Trump promised to Make America Safe Again and deport criminal illegal aliens,” White House spokeswoman Abigail Jackson toldFox Newsin a statement. “But sanctuary cities, like NYC, are working in direct opposition to the mandate that President Trump was elected to fulfill and American citizens are paying the price. The Trump Administration will not tolerate local politicians interfering in the enforcement of federal immigration laws.”\n\nYour information could be the missing piece to an important story. Submit your tip today and make a difference."
    }
}