{
    "question": "How might the IRS’s decision to lay off about 6,700 relatively new employees—including revenue agents, customer service workers, and IT staff—affect taxpayer services, enforcement capacity, and overall operations in the coming months?",
    "content": {
        "source_1": "TheIRSstarted laying off employees on Thursday, just as tax season kicks into high gear.\n\nWhy it matters:The terminations,reportedly of 6,000relatively new workers at the agency, are part of President Trump'sbroader purgeof the federal workforce.\n\nZoom in:Layoffs began Thursday for dozens of Denver-based Internal Revenue Service employees.\n\n\"There are many, many, morethan 100,000 people working to collect taxes, and not all of them are fully occupied,\" Kevin Hassett, director of the White House Council of Economic Advisers, told reporters this afternoon.\n\nWhat they're saying:\"I've been with the IRS for 20 years, and I've never seen this kind of layoff. Never,\" the union's Allen said.\n\nZoom out:Just two weeks ago, IRS employees who arecritical to tax seasonwere told they would not be able to take the administration's so-called \"deferred resignation\" offer until after tax season.\n\nArlene R., who requested partial anonymityfor fear of retribution, is a Denver employee who has worked for the past five months in the IRS' special compliance department overseeing collections.\n\nEditor's Note: This story has been updated with White House comments.",
        "source_2": "Reporting by Steve Holland in National Harbor, Maryland and Nathan Layne in New York; additional reporting by Andy Sullivan; writing by Andy Sullivan; editing by James Oliphant and Stephen Coates\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nAndy covers politics and policy in Washington. His work has been cited in Supreme Court briefs, political attack ads and at least one Saturday Night Live skit.",
        "source_3": "The Internal Revenue Service reportedly notified staff that over 6,000 will be let go before week's end.\n\nThe decision follows President Donald Trump's directive to slash probationary workers across the federal government.\n\nAn internal email obtained byCBS Newsrevealed that more than 3,500 of those affected are probationary hires in the IRS' Small Business/Self-Employed Division.\n\nThe email, signed by SBSE Commissioner Lia Colbert and SBSE Deputy Commissioner Maha Williams, noted that employees will be notified by the agency's Human Capital Office on Thursday whether their positions have been impacted.\n\nIt stated, \"While details are still developing, we understand that over 3,500 SB/SE probationary hires will be terminated by the end of this week.\"\n\nThose expected to be terminated \"were not deemed as critical to filing season,\" the correspondence added.\n\nA separate email was sent to managers in the IRS' Large Business & International Division, requesting that they work in the office on Thursday and Friday \"to support offboarding activities,\" CBS News reported. The number of affected staffers in that division remains unclear.\n\nBefore launching the government-wide purge of probationary employees, the Trump administration offered a \"deferred resignation\" buyout that would have allowed workers to retain their pay and benefits until September 30. More than 75,000 federal workers took the deal.\n\nNeither the IRS nor the White House responded to CBS News' request for comment.\n\nThe cuts follow a visitlast weekfrom a Department of Government Efficiency staffer.\n\nWhite House spokesperson Harrison Fieldsstated, \"Waste, fraud, and abuse have been deeply entrenched in our broken system for far too long.\"\n\n\"DOGE will continue to shine a light on the fraud they uncover, as the American people deserve to know what their government has been spending their hard-earned tax dollars on,\" Fields added.\n\nCommerce Secretary Howard Lutnick toldFox News'Jesse Watters on Wednesday that Trump's goal is to \"abolish the Internal Revenue Service and let all the outsiders pay.\"\n\n\"As the president said, reciprocal tariffs, either you bring yours down or we're going to bring ours up. If we go to their level, it will earn us $700 billion a year to be equal to everybody else,\" Lutnick stated. \"And there goes our deficit. And interest rates come smashing down, and the whole economy explodes higher.\"\n\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox.Sign up here!"
    }
}