{
    "question": "How might President Trump’s executive order asserting presidential oversight of independent agencies reshape the balance between accountability and independence in federal regulation, and what legal and practical consequences could follow for agencies such as the FTC, SEC, and FERC?",
    "content": {
        "source_1": "President Donald Trump is branding himself a monarch.\n\nThe president of the United States made an unprecedented declaration on Wednesday while applauding his administration’s decision toterminate federal approval ofNew York’s congestion pricing program.\n\n“CONGESTION PRICING IS DEAD. Manhattan, and all of New York, is SAVED,” Trumpwroteon his social platform Truth Social. “LONG LIVE THE KING!”\n\nThe official White House social media accounts on X, Instagram and Facebook soon quoted his post, all sharing a fake magazine cover depicting an illustration of Trump smiling in a suit — and wearing a bejeweled golden crown. In the corner of the magazine cover appears the text: “LONG LIVE THE KING.”\n\nThe posts come as critics have accused him ofexceeding his constitutional authorityduring his first weeks in office.\n\nSince starting his second presidential term about a month ago, Trump has issuedmore than 60 executive orders— including multiple directives that have beenchallenged in courtand blocked by judges. On Tuesday, Trumpannouncedthat he has directed the Department of Justice to fire “ALL remaining ‘Biden Era’ U.S. Attorneys.”\n\nTrump has also sought to consolidate even more power. Earlier this week, hesigned an executive orderessentially declaring legal authority over independent agencies such as the Federal Communications Commission and the Securities and Exchange Commission, stating that only he and the attorney general could interpret law for the executive branch.\n\nAnd on Saturday, the White Houseshared a postthat included a statement from Trump appearing to declare himself above the law.\n\n“He who saves his Country does not violate any law,” Trump wrote.\n\nTrump’s proclamation of “LONG LIVE THE KING” became a trending topic on X, the platform (formerly Twitter) now owned by his political ally Elon Musk. The White House’s circulation of the phrase — and the accompanying imagery of Trump wearing a crown — stirred a flurry of immediate backlash.\n\nNew York Gov. Kathy Hochul rejected Trump’s and the White House’s posts in a press conference Wednesday.\n\n“I’m here to say: New York hasn’t labored under a king in over 250 years and we are not — we sure as hell are not going to start now,” Hochul said. “The streets of this city, where battles were fought, we stood up to a king and we won then and we will. In case you don’t know New Yorkers, when we’re in a fight, we don’t back down, not now, not ever.”\n\nOther government officials quickly joined the chorus of concerns.\n\nIllinois Gov. JB Pritzkertook to Xto post that his “oath is to the Constitution of our state and our nation.”\n\n“We don’t have kings in America, and I won’t bend the knee to one,” Pritzker wrote.\n\nSome of Trump’s supporters online lauded his declaration, even making and sharing their own imagery of him wearing a king’s crown. White House Deputy Chief of StaffTaylor Budowichsimilarly posted what appears to be an AI-generated image of Trump dressed in king’s garb. Others who claimed to have voted for him, however, expressed discomfort with this branding.\n\nTrump’s monarch proclamation is the latest in a series of unusual posts coming from the White House’s official social media accounts.\n\nOn Tuesday, the White House posted avideoof people in handcuffs and chains preparing to board a deportation flight, stating that it was an ASMR video. ASMR, which stands for autonomous sensory meridian response, refers to the calming sensation triggered by certain unusually pleasant sounds — it’s a popular genre of content typically made to help viewers relax.\n\nIn another attempted joke about his administration’s deportation efforts, the account on Valentine’s Day posted apoemwith the faces of Trump and his border czar Tom Homan, complete with hearts dotted over a pink background. It reads: “Roses are red, Violets are blue, Come here illegally and we’ll deport you.”\n\nThe White House has also repeatedly sharedphotos of Trump’s mugshot, which is nowhung in a frame outside the Oval Office.\n\nAngela Yang is a culture and trends reporter for NBC News.",
        "source_2": "Our name is about honesty. The Monitor is owned by The First Church of Christ, Scientist, and we’ve always been transparent about that.\n\nThe church publishes the Monitor because it sees good journalism as vital to progress in the world. Since 1908, we’ve aimed “to injure no man, but to bless all mankind,” as our founder, Mary Baker Eddy, put it.\n\nHere, you’ll find award-winning journalism not driven by commercial influences – a news organization that takes seriously its mission to uplift the world by seeking solutions and finding reasons for credible hope.\n\nA deeper view that unites instead of divides, connecting why the story matters to you.\n\nIt’s Monday morning. We start with two stories that track shifts on both sides of the Atlantic. Simon Montlake takes you to Durham Country, England, where the views of ordinary citizens illustrate how traditional political parties have left voters feeling dissatisfied and abandoned - and not just in the U.K. Anna Mulrine Grobe, meanwhile, reports on changing attitudes toward military service among young Americans. Welcome to a new week.\n\nThe Christian Science Monitor's coverage of the war between Hamas and Israel, and related articles.\n\nA deeper view that unites instead of divides, connecting why the story matters to you.\n\nFor the better part of a century, presidents have sought to quickly flex their new powers upon entering office. President Donald Trump has, critics say, taken this practice to an extreme over the past month.\n\nSaying that he is fulfilling a campaign promise to cut waste and root out fraud in Washington, President Trump and his administration have frozen vast sums of dollars of congressionally appropriated funds. He has, without an official reason, fired at least four Senate-confirmed agency officials as well as 17 independent agency inspectors general. His subordinates have gutted two federal agencies.\n\nAre these actions legal? Dozens of lawsuits are probing the questions. Legal scholars disagree on how the cases could turn out. But they tend to agree that if the actions the Trump administration is taking are extreme, they are also, in another sense, predictable.\n\nPresidential power has steadily expanded over the past century. Under the Trump administration, the Supreme Court will face questions about the bounds of that expansion.\n\nThe past century has been marked by a steady expansion of presidential power. As heads of the most nimble and proactive branch of government, the United States’ chief executives have sought greater authority. As the U.S. has become a superpower in a fast-paced, globalized world, Congress and the judiciary have willingly delegated this power. The U.S. Supreme Court punctuated the trend last year when it ruled that former presidents are mostly immune from criminal prosecution.\n\nThe president is unique in our system of government, Chief Justice John Roberts asserted in that decision. “Unlike anyone else,” he wrote, “the president is a branch of government.”\n\nThe public, however, seems wary. According to a Pew Research Centersurveypublished last week, 78% of Americans say it would be “too risky” to expand presidential power. Now, as President Trump is claiming even more power for the executive branch, the justices face the foundational question: Just how much power should that branch – should that person – have?\n\nThe first sentence in Article 2 of the Constitution says the executive power “shall be vested in” the president. Beyond that, it articulates a few specific powers, including the power to make treaties and appoint “officers of the United States.”\n\nFor more than 100 years, the presidency was relatively constrained. But at the turn of the 20th century, that began to change. President Theodore Roosevelt asserted that he had the right to all powers not explicitlydenied him. Decades later, President Franklin D. Roosevelt transformed Americans’ views of what the president could – or should – do with a flurry of actions inhis first 100 days.\n\nAs America has modernized and become a global superpower, its executive branch has grown in power and physical size. A branch that in 1789 had five Cabinet members and one federal agency now includes 16 Cabinet members andhundredsof federal agencies. Between 1940 and 2014, the number of civilian employees in the branchmore than tripled.\n\nConservatives have long criticized this expansion, arguing that federal agencies are now a de facto fourth branch of government – and one that is unelected and unaccountable to the public. While some presidents have tried over the years to trim layers of government workers, President Trump is now attempting to exert more control over these federal agencies, arguing that it’s necessary to fulfill a campaign promise to reduce waste and eliminate government fraud.\n\n“We are returning to the founders’ vision for what government ought to look like,” says Daniel Suhr, president of the Center for American Rights, a conservative legal organization. “That is the president at the top of the executive branch, and the officers under him being responsible to follow through on the policy direction he gives.”\n\nMr. Trump’s efforts are being led by what he has named the Department of Government Efficiency (DOGE), a temporary agency he created without congressional approval and that he alone oversees. Elon Musk, the world’s richest man, is a key adviser on this executive branch shakeup. (After his election, the presidenttappedMr. Musk to lead the agency, but the administration has suggested in a new court filing that, legally, Mr. Musk is not affiliated with DOGE.)\n\nThose efforts have translated into some unprecedented, controversial moves not just from the executive branch but also from the president himself.\n\nOver the past month, Trump officials have effectively shuttered the U.S. Agency for International Development and the U.S. Consumer Financial Protection Bureau. His administration has frozen hundreds of millions of dollars in grants and funds approved by the legislature. President Trump fired at least fourleaders ofindependent federalagenciesand 17 agency watchdogs, though it’s unclear if he had the authority to do so.\n\nOn Tuesday, he signed another executive order asserting the president's direct control over agencies that have long been understood to be largely independent, such as the Federal Trade Commission and the Federal Communications Commission.\n\n“Investigations of government structures and efficiencies have happened in the past,” says Mitchel Sollenberger, a political science professor at the University of Michigan-Dearborn. But with these latest Trump administration moves, “They’re stopping money; they’re restructuring ... departments,” he says. “I haven’t seen that before.”\n\nFive people who have played a role in this expansion of executive power now sit on the Supreme Court.\n\nChief Justice Roberts and Justice Samuel Alito, for example, worked in the U.S. Justice Department under President Ronald Reagan. Justice Elena Kagan was a top DOJ official under President Barack Obama. And Justices Neil Gorsuch and Brett Kavanaugh both worked in the George W. Bush administration, the former as a DOJ official and the latter as a White House official.\n\nNo members of the court have much legislative experience, however. That means “They come with a probably unavoidable – because they’re human – impulse to give more weight to interests they find familiar or recognizable,” says Aziz Huq, a University of Chicago Law School professor.\n\nWhen determining if a branch of government is trying to usurp the authority of other branches, they’re likely “giving more weight to the executive than to Congress because they’re more familiar with what it means to work in the executive,” he adds.\n\nThis may explain, in part, the court’s unprecedented ruling on presidential immunity last year. Chief Justice Roberts, a former DOJ and White House lawyer,wrotethat fear of prosecution would overly burden the “‘vigor’ and ‘energy’” of the president. That sentence quoted Alexander Hamilton, an early advocate for a strong presidency.\n\nThe president doesn’t have “an unlimited grant of power,” says Mr. Suhr of the Center for American Rights. But what “the Supreme Court has reminded us in the past decade is [that] the president is the executive branch, and he has the right to control his branch and his appointees.”\n\nIn an effort to gain more direct control over the executive branch, some of Mr. Trump’s recent actions seem to directly challenge these separation-of-powers concerns. The administration Feb. 16, for example,asked the high courtto uphold the president's firing of the head of an independent agency that protects government whistleblowers.\n\nCourts will be weighing in on other assertions of presidential power in the coming weeks and months.\n\nThe Supreme Court has said the president can fire certain federal agency leaders, for example. But does that mean he can unilaterally fire leaders at independent agencies like the Federal Election Commission or the National Labor Relations Board, as he did earlier this month?\n\nLast year the court rejected a challenge seeking to shut down the Consumer Financial Protection Bureau, holding that its funding mechanism is constitutional. So can DOGE effectivelyshutter the agencyby limiting its funding and pausing its activities?\n\nBy law, the executive branch can only “impound” certain funds and must otherwise spend money as appropriated by Congress. What does that mean for the freeze on federal grants?\n\nSo while some of Mr. Trump’s actions may be considered “a continuation” of the decadeslong expansion of presidential power, says Professor Huq, others are “so comprehensive that it’s hard not to see [them] as a claim for a fundamentally different kind of constitutional order.”\n\nLast summer brought a landmark ruling from the Supreme Court expanding the limits of presidential power.\n\nEditor's note: This story was updated on Feb. 19, the day of initial publication, to reflect an additional Trump executive order. On Feb. 21 the article was updated again, placing that news lower in the article and shortening how it is described.\n\nMonitor journalism changes lives because we open that too-small box that most people think they live in. We believe news can and should expand a sense of identity and possibility beyond narrow conventional expectations.",
        "source_3": "PresidentDonald Trumptook another step in his mission to assert control over the executive branch by signing an order that curbs the ability of independent agencies to operate outside the bounds of the president’s agenda, a move that could upend decades-old federal law.\n\nIndependent agencies that have significant authority, such as theFederal Election Commission, the Federal Trade Commission, or the Securities and Exchange Commission, should not operate independently of the president, Trump said in the order.\n\n“For the Federal Government to be truly accountable to the American people, officials who wield vast executive power must be supervised and controlled by the people’s elected President,” the Tuesday order stated.\n\nTRUMP’S EXECUTIVE STRATEGY TESTS PRESIDENTIAL POWERS\n\nIn practice, the order would require Office of Management and Budget Director Russ Vought to approve any major actions by the independent agencies. It would also require each agency to hire “White House liaisons” who would monitor their activities. The order tasks Vought, who helped craft Project 2025, with creating new instructions for independent agencies on how to carry out the order as well.\n\nThe order came as part of Trump’s aggressive effort to reshape the executive branch into a more consolidated version of its former self. Vought has been a top proponent of this strategy, which is alsoknown asthe “unitary executive theory.”\n\nAs part of this effort, Trump also recently fired, or attempted to fire, heads of some of the independent agencies, including the FEC, the Merit Systems Protection Board, and the Office of Special Counsel. He also fired the head of the National Labor Relations Board, which investigates allegations of unfair labor practices. The move incapacitated the board because it now does not have a quorum to function.\n\nThe firings have alarmed Trump’s critics, who say the president is shutting out crucial government watchdogs and neutering independent agencies’ abilities to do their jobs in a neutral manner. Congress passed laws to create these independent agencies and specifically included provisions for agency heads like term limits and prohibitions on firing them without cause, the critics point out, in order to protect them from politicized personnel action.\n\nHampton Dellinger, who leads the Office of Special Counsel, is in charge of vetting whistleblower complaints about wrongdoing within the government.\n\nTrump fired him without explanation in a one-sentence note, prompting Dellinger to sue Trump. Dellinger argued that he is owed, by law, an explanation for his firing. A judge agreed, and now Trump has asked the Supreme Court to step in and decide if Trump was authorized to fire him without cause or notice. Legal observers are closely watching for the high court’s decision, which could shed light on where it stands on independent agencies as a whole.\n\nConservative lawyer Andy McCarthy, a former federal prosecutor, told theWashington ExaminerTrump was right to sign an executive order that reins in independent agencies despite the inevitable legal challenges it will invite.\n\n“The so-called independent agencies are unconstitutional because they violate separation of powers, but restoring order would require a lot of overhaul by the Supreme Court,” McCarthy said.\n\nMcCarthy predicted Trump’s executive order would be met with extensive litigation “because the concept of independent agencies — i.e., agencies that are not fully accountable to any branch of government (or to the public) and that exercise a combination of executive, legislative, and judicial power (which is a violation of separation of powers) — is essential to the progressive political project and the administrative state as it has existed and expanded over nearly a century.”\n\nJonathon Hauenschild, an associate counsel for the Republican National Lawyers Association, also defended Trump’s executive order in a statement on X.\n\n“The problem is that agencies have acted, for far too long, as independent of both the president and Congress. Almost as if they were a fourth branch of government,” Hauenschildwrote.\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nTrump said in his order that the agencies had also been permitted to pass significant regulations in the past without the president signing off on them.\n\nThat activity prevents a “unified and coherent execution of Federal law,” Trump said."
    }
}