{
    "question": "How might the executive order directing federal agencies to develop policies that reduce out-of-pocket IVF costs affect patient access, insurance coverage, and overall healthcare spending?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nThe order calls for policy recommendations to “protect IVF access and aggressively reduce out-of-pocket and health plan costs for such treatments,” according to the White House.\n\nPresident Donald Trump on Tuesday signed an executive order aiming to reduce the costs of in vitro fertilization, a medical procedure that helps people facing infertility build their families.\n\nPresident Donald Trump speaks at Mar-a-Lago in Palm Beach, Fla., Tuesday, Feb. 18, 2025. (Pool via AP)\n\nPresident Donald Trump speaks at Mar-a-Lago in Palm Beach, Fla., Tuesday, Feb. 18, 2025. (Pool via AP)\n\nPresident Donald Trump speaks at Mar-a-Lago in Palm Beach, Fla., Tuesday, Feb. 18, 2025. (Pool via AP)\n\nPresident Donald Trump departs after speaking at Mar-a-Lago in Palm Beach, Fla., Tuesday, Feb. 18, 2025. (Pool via AP)\n\nPresident Donald Trump speaks at Mar-a-Lago in Palm Beach, Fla., Tuesday, Feb. 18, 2025. (Pool via AP)\n\n▶ Follow live updates onPresident Donald Trump and his administration\n\nWEST PALM BEACH, Fla. (AP) — PresidentDonald Trumphas signed an executive order meant to expand access to and reduce costs ofin vitro fertilizationand issued a presidential memorandum calling for “radical transparency requirements” from the government, which he suggested could reduce wasteful spending.\n\nOn the campaign trail, Trumpcalled for universal coverage of IVF treatmentafter his Supreme Court nominees helped to overturn Roe v. Wade, leading to a wave of restrictions in Republican-led states, including some that have threatened access to IVF by trying to define life as beginning at conception.\n\nTrump, who was at his Florida residence and club, Mar-a-Lago, on Tuesday, also signed another executive order as well as a presidential memorandum. The second executive order outlined the oversight functions of the Office of Management and Budget, while the memo requires the government to detail the “waste, fraud and abuse” that’s found as the Department of Government Efficiency, overseen by Tesla CEOElon Musk, looks to cut government spending.\n\nDOGE has often fallen short of the administration’s promises of transparency. Musk has taken questions from journalists only once since becoming Trump’s most powerful adviser, and he’s claimed it’s illegal to name people who are working for him. Sometimes DOGE staff members have demanded access to sensitive government databases with little explanation.\n\nTrump took more than 30 minutes of questions Tuesday on a range of topics and bashed the Biden administration throughout, highlighting issues such as its handling of the U.S.-Mexico border, Venezuela policy andRussia’s war in Ukraine.\n\nTrump said he thought he had a “good chance” to end Russia’s war in Ukraine but bristled at suggestions that theU.S. and Russia had begun negotiationsto end fighting without Ukraine playing a role. He even seemed to suggest that Ukraine was to blame for a war that began only after Russia invaded that country.\n\n“Today I heard, ‘Well, we weren’t invited.’ Well, you’ve been there for three years,” Trump said of Ukraine’s leaders. “You should have never started it.”\n\nIn anticipation of questions about his administration’s efforts to slash federal spending, the president said he wrote down examples of government programs around the world which he then listed off at length. They included funding to promote voter turnout in India and social cohesion initiatives in Mali — all of which Trump suggested collectively amounted to fraud.\n\nAsked about the White House’s arguing in a court filing that Musk wasn’t the head of Trump’s government efficiency efforts, Trump said: “You could call him an employee, you could call him a consultant, you could call him whatever you want. But he’s a patriot.”\n\nTrump said he thinks “women and families, husbands, are very appreciative” of his executive order on IVF, which offers a possible solution when a woman has trouble getting pregnant. The procedure involves retrieving her eggs and combining them in a lab dish with a man’s sperm to create a fertilized embryo, which is then transferred into the woman’s uterus in an attempt to create a pregnancy. IVF is done in cycles, and more than one may be required.\n\nBarbara Collura, president and CEO of RESOLVE: The National Infertility Association, said that what the White House put out “looks extremely promising.”\n\n“The biggest barriers for people to building their families are the out-of-pocket costs, the lack of insurance coverage for this care,” she said.\n\nIllinois Sen. Tammy Duckworth, a Democrat, said: “Donald Trump’s executive order does nothing to expand access to IVF. In fact, he’s the reason IVF is at risk in the first place.”\n\nDuckworth said if Trump is going to follow through on his campaign promise to provide free IVF, he can start by supporting her legislation that would require insurance plans to cover IVF.\n\nTrump, who spent the morning at his golf club in West Palm Beach, Florida, spoke to reporters hours before his first joint TV interview with Musk aired in prime time on Fox News Channel. The president acknowledged during it that “inflation is back,” but noted that he’d only been in office a few weeks and insisted “I had nothing to do” with prices that remain stubbornly high.\n\nTrump mentioned during that same interview that Musk is “probably not that happy” with things like tax breaks for electric vehicles likely not being included in tax legislation now being discussed in Congress, but he said Musk didn’t seek special treatment for Tesla.\n\n“I haven’t asked the president for anything, ever,” Musk added. Asked about potential conflicts of interest between Musk’s governmental efforts and his businesses and how they will be handled, Trump said, “He won’t be involved” and Musk said he’d recuse himself.\n\nMusk has drawn criticism from Democrats in Congress and others for the methods he and his team at DOGE are using to cut spending, including foreign aid, and eliminate jobs across the bureaucracy.\n\nThe joint interview follows Musk’s appearance with Trump in the Oval Office last week, when bothdefended Musk’s approachto federal cost-cutting.\n\nAlso Tuesday night, an awards program was held at Mar-a-Lago by America’s Future. That’s a conservative group led byMike Flynn, who briefly served as national security adviser in the Republican president’s first term. The program aims to preserve individual rights and promote American values and traditions, according to its website. The event honored one member each from the Army, Navy, Marines, Air Force and Space Force.\n\nThe event included a poolside reception, musical performances and dinner in Mar-a-Lago’s Grand Ballroom. The lineup included such names as Russell Brand, Ted Nugent and Mike Tyson.\n\nTrump made an appearance at the event, according to video posted on social media Tuesday night, addressing the crowd on the patio as he stood near Tyson, Flynn and Nugent and declaring, “This is very, very friendly territory.”\n\nTrump praised the men, including Flynn, who was one of the leading proponents of Trump’s efforts to overturn the 2020 presidential election. The president called him “the real deal” and indicated he wanted to bring Flynn into his administration, saying he offered him “about 10 jobs.”\n\n“Anytime you want to come in, you know that, Mike, OK?” Trump said.\n\nFlynnresigned from the first Trump administrationless than a month after Trump’s inauguration. He was charged in 2017 with lying to the FBI about conversations he had with the Russians on Trump’s behalf. He twice pleaded guilty, but Trumppardoned himin the final weeks of his presidency.\n\nPrice reported from New York. Associated Press writers Will Weissert and Chris Megerian in Washington and Laura Ungar in Louisville, Kentucky, contributed to this report. Follow the AP’s coverage of President Donald Trump athttps://apnews.com/hub/donald-trump.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Reporting by Andrea Shalal and Ahmed Aboulenein; Additional reporting by Ryan Patrick Jones; Editing by Ismail Shakil, Deepa Babington and Jamie Freed\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nWashington-based correspondent covering U.S. healthcare and pharmaceutical policy with a focus on the Department of Health and Human Services and the agencies it oversees such as the Food and Drug Administration, previously based in Iraq and Egypt.",
        "source_3": "WASHINGTON – President Trump signed an executive order Tuesday meant to start fulfilling a campaign pledge to make in-vitro fertilization (IVF) free for would-be parents.\n\n“PROMISES MADE. PROMISES KEPT: President Trump just signed an Executive Order to Expand Access to IVF!” White House press secretary Karoline Leavitttweeted.\n\n“The Order directs policy recommendations to protect IVF access and aggressively reduce out-of-pocket and health plan costs for such treatments.”\n\nThe document requires the Domestic Policy Council, led by Vince Haley, to submit a report within 90 days that contains “a list of policy recommendations on protecting IVF access and aggressively reducing out-of-pocket and health plan costs for IVF treatment.”“Americans need reliable access to IVF and more affordable treatment options, as the cost per cycle can range from $12,000 to $25,000,” the order says.“[I]t is the policy of my Administration to ensure reliable access to IVF treatment, including by easing unnecessary statutory or regulatory burdens to make IVF treatment drastically more affordable.”\n\nTrump pledged in Augustto make IVF freeif he reclaimed power — as Democrats claimed that Republican opposition to abortion threatened access to the procedure.\n\n“Under the Trump administration, your government will pay for — or your insurance company will be mandated to pay for — all costs associated with IVF treatment,” Trump said at a rally in Michigan.\n\nIt’s unclear exactly how much the initiative might cost — due in part to uncertainty about the precise terms of a possible reform — but experts say it could amount to$7 billion annuallyfor the government and insurance companies.\n\nIt’s also unclear whether congressional action will be needed to enact whatever reforms are commended to lower the cost of IVF.\n\nSome opponents of abortion also oppose IVF because it can result in the creation of embryos that aren’t used and are discarded.\n\nTrump won a second non-consecutive term by pledging to rein in inflation and illegal immigration and to adopt a range of new financial benefits for the middle class.\n\nThe president also promised as a candidate to abolish taxes on tips, overtime and Social Security benefits, to allow tax deductions for domestic car loan interest and to scrap the $10,000 cap on state and local taxes that can be deducted from federal tax bills.\n\nTrump’s plans, which he said would be paid for with higher tariffs and reduced federal spending, have an uncertain path forward in Congress — where House and Senate leaders disagree on strategy as fiscal hawks express concern about contributing to the deficit."
    }
}