{
    "question": "How does the White House’s assertion that Elon Musk has no formal decision-making authority, alongside uncertainty over who legally leads DOGE, shape perceptions of accountability and the legal scrutiny of DOGE’s actions?",
    "content": {
        "source_1": "A Trump administration personnel official says Musk has \"no actual or formal authority to make government decisions.\"\n\nElon Musk has eagerly touted DOGE’s work, described his influence over its operations and appeared alongside Donald Trump to talk about its mission. | Alex Brandon/AP\n\nElon Musk is not the leader of DOGE — the mysterious Trump administration operation overseeing an effort to break and remake the federal bureaucracy. In fact, he’s not even technically part of it at all, the White House said in court papers Monday night.\n\nIn athree-page declaration, a top White House personnel official revealed that Musk’s title is “senior adviser to the president,” a role in which he has “no actual or formal authority to make government decisions himself.”\n\nThat explanation, provided to a federal court by Joshua Fisher, the director of the White House’s Office of Administration, seems to directly contradict the way President Donald Trump and Musk have spoken publicly about the so-called Department of Government Efficiency, widely seen as a Musk-driven project to shrink and dismantle key aspects of the federal government.\n\nThe sworn statement instead deepens the questions surrounding DOGE. Fisher confirmed that Musk is not the official administrator of the office, which was established by Trump as an office in the Executive Office of the President. But Fisher did not indicate who the administrator actually is.\n\nThe technical designation does not mean Musk is not, for all practical purposes, the key decision-maker for DOGE, which has been staffed full of his allies and may still ultimately be fueled by his influence in the White House. Musk has eagerly touted DOGE’s work, described his influence over its operations and appeared alongside Trump to talk about its mission.\n\n“I’m going to tell [Elon Musk] very soon, like maybe in 24 hours, to go check the Department of Education,” Trump said ina Super Bowl interviewwith Fox News anchor Bret Baier. “He’s going to find the same thing … Then I’m going to go, go to the military. Let’s check the military.”\n\nBut the Fisher filing suggests a technical degree of separation that raises new questions about accountability for DOGE’s operations — a breakneck effort that has alarmed federal employees and raised fears about data breaches in some of the federal government’s most closely guarded databases. He compared Musk’s role to Anita Dunn, a senior adviser to President Joe Biden who occupied a similar title and employment designation in the White House.\n\nFisher’s filing was delivered to U.S. District Judge Tanya Chutkan, who isweighing a legal effortby Democratic attorneys general to bar Musk and his DOGE allies from continuing to exert influence on the federal government. The states say Musk has amassed so much power that he’s violating the constitution’s “Appointments Clause,” which requires senior executive branch officials to be confirmed by the Senate.\n\nChutkan indicated Monday that a ruling on the state’s emergency motion to sideline Musk will come within a day. She seemed unlikely to grant that motion but asked the Trump administration for more details about the mass firings it appears DOGE has been directing across the government.\n\nA Justice Department attorney, Joshua Gardner,declined to detailthe job cuts DOGE has been involved in so far, despite Chutkan’s request for specifics. He said the administration was not prepared to make a “programmatic representation” about what other job cuts may be imminent.\n\nAt a hearing Chutkan held earlier Monday, Gardner emphasized that all of the cuts so far have been carried out by personnel within federal agencies, not by DOGE officials themselves.",
        "source_2": "Beatrice Nolan is a reporter atFortunecovering tech. Beatrice previously worked as a tech reporter at Business Insider, covering stories about AI and Big Tech. She's based inFortune'sLondon office and graduated from the University of York with a bachelor's degree in English.\n\nNo one seems to be sure who is running the Department of Government Efficiency, also known as DOGE.\n\nDespite evidence to the contrary, the White House has saidElon Musk is not heading upthe cost-cutting team or even an employee of the department.\n\nIn a recent court filing, the White House said thatMusk is a presidential senior advisorand “has no actual or formal authority to make government decisions himself.” The court filing is part of a lawsuit filed by the state of New Mexico and 13 other Democratic attorneys general alleging that Musk has overstepped the bounds of his authority.\n\nJoshua Fisher, the director of the White House Office of Administration, said in the filing that Musk was an employee of the White House while DOGE was separate from it. He added that Musk was not the service administrator of DOGE or even an employee of the department—despite the billionaire repeatedly advocating for the team and publicizing its efforts.\n\nADOJ representative also said he didn’t knowwho DOGE’s administrator was when asked by two reporters in court.\n\nEven within the United States Digital Service Department itself, employees are reportedly confused about the chain of command. Accordingto a report byWired,multiple legacy USDS employees don’t know who the acting administrator is despite asking several times.\n\nOne USDS employee said they had received “no correspondence as far as who the head of this organization was” after Ted Carstensen, the highest-ranking legacy USDS leader, resigned from the organization on Feb. 6.\n\nRepresentatives for DOGE, Musk, and the White House did not immediately respond to a request for comment fromFortune.\n\nMusk has become the public face of DOGE over the last few months.\n\nBack in November, he penned an op-ed in theWall Street Journalthat laid out the vision and mission for DOGE. And around the same time, then President-elect Donald Trump said Elon Musk “will lead” the Department of Government Efficiency.\n\nTrump has since referred to DOGE as Musk’s team, and the billionaire has appeared in the Oval Office to defend its cost-cutting efforts. Musk has also repeatedly posted about the team on his social media platform, X, and has promoted the DOGE website.\n\nSteve Davis, who is president of one of Musk’s companies and was instrumental in overhauling Twitter—now X—is one of the people rumored to be in charge of the department, according toWired.\n\nOne former USDS employee told the outlet that Davis had “always been articulated as the leader of DOGE, but when I ask if he’s the administrator, [managers] say we don’t know.”\n\nThe confusion over who is legally in charge of the team may add a layer of legal insulation for the Trump administration and Musk himself, legal and political professionals said.\n\n“The White House is constructing the most defensible way to get around what is either a violation of the law or the exploitation of a series of loopholes,” Jeff Hauser, founder and executive director of the Revolving Door Project, a government accountabilitywatchdog, previously toldFortune.\n\nIn claiming he has no authority to execute the law and can only offer advice, “Musk cannot be sued for DOGE activities,” John Yoo, the Emanuel Heller Professor of Law at the University of California at Berkeley, said.\n\n“As a White House advisor, Musk is really just an extension of the president himself. Any lawsuit would have to really be against the president or the United States government,” he added.\n\n© 2025 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of ourTerms of UseandPrivacy Policy|CA Notice at Collection and Privacy Notice|Do Not Sell/Share My Personal InformationFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.",
        "source_3": "WASHINGTON —Tech billionaire Elon Muskis not officially an employee of the Department of Government Efficiency (DOGE), but is still overseeing its operations as a senior adviser to President Trump, the White House argued in a court filing this week.\n\nThe Tesla and SpaceX founder is considered a special government employee who can “advise” and “communicate” Trump’s orders, Office of Administration Director Joshua Fisher wrote ina signed declarationfiled in Washington, DC, federal court.\n\nThose include recommendations for DOGE cost-cutters and other employees in the executive branch, a White House spokesperson told The Post — despite Musk, 53, not being the non-governmental department’s administrator.\n\n“Elon Musk has been tasked with overseeing DOGE on behalf of the president,” White House press secretary Karoline Leavitt said on Fox News’ “America Reports” Tuesday.\n\nLeavitt also said that DOGE workers are “onboarding” at executive branch agencies “as political appointees” to “cut waste, fraud and abuse.”\n\n“Mr. Musk has no actual or formal authority to make government decisions himself,” Fisher said, likening his status to that of formerPresident Joe Biden’s senior adviser Anita Dunn.\n\nDOGEis a “component” of the Executive Office of the President, Fisher added, without providing the name of an administrator.\n\nThe presidenttapped Musk in Novemberto “provide advice and guidance from outside of Government” at DOGE, along with since-departed co-chair Vivek Ramaswamy.\n\nTrump, 78, had billed the effort as a “Manhattan Project” to “dismantle Government Bureaucracy, slash excess regulations, cut wasteful expenditures, and restructure Federal Agencies.”\n\n*Numbers calculated by The Post based on savings from contract and real estate cancellations provided on DOGE’s website\n\nSince then, the tech mogul’s team has run roughshod overofficials at the Treasury Departmentandthe US Agency for International Development, while cancelinggrants to left-wing organizations from the Department of Educationand performingaudits on the Department of Labor and other agencies.\n\nTrump has said Musk only reports to him and will be targeting the Pentagon next — even as the duo have accused critics of trying to drive them apart by stoking controversy about the extent of the tech titan’s influence.\n\nFisher’s declaration was in response to a lawsuit brought by 14 Democratic state attorneys general against DOGE, claiming Musk andhis army of engineers tasked with trimming federal spendingwere exercising “unchecked power.”\n\nThe suit, filed in DC Feb. 13, alleges that Musk’s authority requires Senate confirmation under the Constitution’s Appointments Clause.\n\nUS District Judge Tanya Chutkan, who is presiding over the case, is weighing an emergency request from the blue states to bar Musk from exerting further control over the federal government.\n\nDOJ lawyer Joshua Gardner emphasized in a Monday hearing before Chutkan that DOGE-directed budget cuts have been executed by agency heads and other federal employees — not Musk or his minions.\n\nDunn, who served as a White House adviser to Biden, was never confirmed by the Senate, either — but her level of power was obscured to a far greater degree,critics have charged.\n\nAs a special government employee, Dunn was exempt from filing financial disclosure forms between January and August 2021,CNBC first reported, and again for a brief stint in March 2022.\n\nUpon being officially appointed in May 2022, Dunn finally releasedher financial records, which showed her netting $738,715 as managing director of the Democratic consulting firm SKDK while also repping major corporations like AT&T and Pfizer.\n\nThe White House ordered Dunn to subsequently divest holdings valued between $16.8 million and $48.2 million and recuse herself from government matters involving SKDK clients."
    }
}