{
    "question": "How might this week’s focus on Scott Pelley’s 60 Minutes commentary, the FCC appeal over Fox’s broadcast license, and coverage of Trump and Elon Musk’s budget-cutting efforts shape public perceptions of media fairness and government accountability?",
    "content": {
        "source_1": "Media and Democracy Project (MAD) filed an appeal to the Federal Communications Commission (FCC) after Trump-appointed commissionerBrendan Carrrevived Biden-era petitions against liberal networks but not its effort to deny Fox Corporation a broadcast license for one of its local TV stations.\n\nThe move comes after former FCC chairJessica Rosenworcelused her final weeks in office todismiss four high-profile petitionsshe said attempted to “weaponize” the agency’s authority for political purposes. Only for the FCC’s leadership under PresidentDonald Trumpto revive three of those petitions – against ABC, CBS, and NBC – but not the case against Fox.\n\nOn Tuesday, the watchdog group appealed the decision.\n\nMAD’s challenge hinged on the Murdochs’ role in pushing false claims about the 2020 election, which culminated in Fox paying a staggering $787 million to settle a defamation lawsuit with Dominion Voting Systems. The group argues that the FCC, which is responsible for assessing whether broadcasters meet the agency’s “character” qualifications, ignored evidence of misconduct at Fox News when it rejected the petition.\n\n“The decision by previous FCC leadership to ignoreRupert [Murdoch]andLachlan Murdoch’sserious character flaws, highlighted in multiple court rulings, was as misguided as the current Chair’s decision not to resurrect MAD’s petition,” MAD co-founderBrian Hansburysaid in a statementcited by journalistOliver Darcy.\n\nHe added: “The adjudicated factual findings in the Dominion case—undisputed by Fox—form the backbone of our petition and clearly set it apart from the frivolous challenges against other networks, which are nothing more than a hyper-partisan attempt to facilitate President Trump’s terrifying efforts to censor and coerce speech.”\n\nAll said, MAD’s appeal will likely be dead on arrival, given the current makeup of the regulatory body.",
        "source_2": "Fox News contributor Ben Domenech and former 2020 Biden-Harris campaign deputy communications director Meghan Hays join 'MediaBuzz' to react to the media calling DOGE's spending cuts a 'constitutional crisis.'\n\nNearly everyone agrees that the federal government has become this bloated monster that needs to be cut down to size.\n\nThe massive bureaucracy, attacked by some as evil, is absurdly overstaffed and wastes massive amounts of money.\n\nWhatPresident Trumpis doing in trying to shrink the size of government is popular – even if his billionaire budget-slasher, Elon Musk, is not – and many of the court battles are likely to be resolved in his favor.\n\nBut the equation is turned on its head when actual people feel the impact. And the media start highlighting sad cases of devastated folks. AndRepublican lawmakersstart objecting to the cutbacks that hit home.\n\nThat’s why it’s so hard to cut the federal budget. It’s not like going into SpaceX and firing a bunch of software engineers. The political pressures can be intense.\n\nVirtually every program in the federal budget is there because some group, at some time, convinced Congress it was a good idea. There are noble-sounding causes – cancer research, aid to veterans, subsidies for farmers.\n\nIn fact, farmers are threatened by the near-abolition of USAID – while most people hate foreign aid, food programs provide a crucial market for American farmers, many of whom are now stuck with spoiling surpluses or loans they can’t repay.\n\nThe Trump administration's Elon Musk-backed evisceration of the U.S. Agency for International Development (USAID) drew the ire of many in Washington and beyond – especially because farmers, and, by extension, the food supply can be dependent on the program.(Kevin Dietsch/Getty Images)\n\nNow there’s plenty of game-playing that goes on with government programs. Let’s say, for the sake of argument, that agencies could cut one of every 10 employees without damaging their core functions.\n\nAnyone who’s looked at the endless cycle of conferences, conventions, training confabs, office renovations and the like knows how much fat there is in these budgets. When you throw in lucrative payments to well-connected contractors, that figure skyrockets.\n\nBut whenagency officialscome under fire, they immediately insist that any cutbacks will instantly hurt the poor and downtrodden, or working-class folks living paycheck to paycheck. It used to be called the Washington Monument defense, the notion that any attempt to reduce funding for the Interior Department would cause the memorial’s immediate shutdown.\n\nDOGE SAYS IT FOUND NEARLY UNTRACEABLE BUDGET LINE ITEM RESPONSIBLE FOR $4.7T IN PAYMENTS\n\nNIH, for instance, does world-class research that benefits the country. But the battle between Musk’s DOGE and the institute centers on how much is spent on indirect costs.\n\nMusk says his aim is \"dropping the overhead charged on NIH grants from the outrageous 60 percent to a far more reasonable 15 percent.\"\n\nBut anNBC storyis headlined: \"NIH Cuts Could Stall Medical Progress for Lifesaving Treatments, Experts Say.\"\n\nThe piece quotes Theodore Iwashyna, a physician at the Johns Hopkins School of Medicine, as saying his \"father had pancreatic cancer, and the care plan developed for him existed only because of research funded through organizations like the NIH.\"\n\nIwashyna says the overhead is needed for \"computers, whiteboards, microscopes, electricity, and janitors and staff who keep labs clean and organized.\"\n\nAlabama Sen. Katie Britt, whose state is getting $518 million in NIH grants, mainly to the University of Alabama at Birmingham, is raising objections. The conservative Republican told a reporter she wants the administration to take a \"smart, targeted approach\" so as not to endanger \"groundbreaking, lifesaving research.\"\n\nDOGE NEEDS TO 'CUT DEEPER' AND MUST ‘KEEP SLASHING’ TO SUCCEED, SAYS KEVIN O’LEARY\n\nThe examples are legion. Alaska Sen. Lisa Murkowski has asked the administration not to restrict funding for diversity programs among American Indian tribes.\n\nAs the New York Timesputs it, \"some Republicans\" have sought \"carve outs and special consideration for agriculture programs, scientific research and more, even as they cheered on Mr. Trump’s overall approach.\"\n\nMusk’s DOGE team seems to be using a meat-ax method. Why lay off hundreds of FAA technicians and engineers just weeks after the fatal plane crash at Reagan National Airport, when there’s already a major shortage of air traffic controllers?\n\nDOGE seems to be taking no prisoners with a \"meat-ax\" approach to slashing government spending.(Jim Watson/AFP via Getty Images)\n\nFEMA, which is already stretched thin after the Los Angeles wildfires and the Kentucky flooding, is preparing to fire hundreds of probationary workers,reports the Washington Post. Such workers, who have been with the government for one or two years, basically have no rights.\n\nBut there has been zero effort to assess them. Some were told their performance was the issue, but showed the Post their evaluations. \"Above fully successful,\" said one, for a fired GSA worker. \"An outstanding year, consistently exceeding expectations,\" said the review for a fired NIH staffer.\n\nBut viewed from a different angle, the hometown paper and other outlets buy into the notion that federal employees should have tenure for life. Everyone in Washington knows that before Trump it was virtually impossible to fire such employees, even for cause.\n\nSUBSCRIBE TO HOWIE'S MEDIA BUZZMETER PODCAST, A RIFF ON THE DAY'S HOTTEST STORIES\n\nBy contrast, Southwest Airlines just announced a 15% cut of its corporate workforce. No one is rushing to interview those laid off, because this sort of downsizing is routine in the private sector. But the Beltway ethos is that federal workers are entitled to their jobs.\n\nNow intellectual honesty requires the observation that even radical cuts to the federal payroll won’t have much impact on the $840 billion budget deficit or the $36 trillion federal debt. The bulk of the budget consists ofSocial Security, Medicare, Medicaid, defense spending and interest on the debt.\n\nCan Elon Musk and DOGE at least make progress on rooting out waste, fraud and abuse? Maybe. But the level of pain being inflicted on ordinary Americans, including in red states, and the natural tendency of politicians to shield local residents from that pain, and the media’s relentless spotlight on those suffering, are going to be a giant obstacle.\n\nHoward Kurtz is the host of FOX News Channel'sMediaBuzz(Sundays 11 AM-12PM/ET). Based in Washington, D.C., he joined the network in 2013 and regularly appears onSpecial Report with Bret BaierandThe Story with Martha MacCallumamong other programs.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time.",
        "source_3": "He has a lot of competition in the media, but few have as big a stage as60 Minuteselder Scott Pelley. As he continues to step up his attacks on PresidentDonald Trumpand the new administration, Pelley is elbowing aside all others to emerge as Trump’s loudest TV critic.\n\nNever a fan of Trump, Pelley has taken his60 Minutesperch at CBS to offer critical monologues of the president. People took notice even before Trump returned to the White House whenPelley rippedTrump’s Cabinet picks, saying, “Some nominees appear to have no compelling qualifications other than loyalty to Trump.”\n\nHowever, other than gnawing down his reading glasses, Pelley had no impact. All of Trump’s picks to get a Senate floor vote won.\n\nThen, on Sunday’s show, he opened with another hit on Trump, saying the president was in “defiance of the Constitution” with his agenda. Again, there was no impact since a day later, a federal judge expressed skepticism about any harm the president’s Department of Government Efficiency threatened.\n\nEach week,Secretsteams with the Media Research Center to choose the loudestliberal media scream, and Pelley won again this week. What’s more, Media Research Center Vice President Brent Baker gave Pelley’s rant a score of five out of five screams. That is a rare top score, but one we expect to see more of as the liberal media turns up the heat on Trump as it loses its influence on him and his White House.\n\nSCOTT PELLEY:It’s too soon to tell how serious President Trump is in defiance of the Constitution. In his first 28 days, he signed an order to nullify birthright citizenship for some — a right guaranteed by the 14th Amendment. And he has closed agencies and frozen spending that Congress mandated by law. Lower courts are holding up many of the president’s priorities, but nothing has risen to the Supreme Court, where these battles over presidential power could rewrite history. Presidents often push limits — FDR’s New Deal, for example — and voters in this last election wanted change. But the scope and speed of Trump’s reach for power may be unprecedented. One example is a 63-year-old agency created by Congress, codified in law and eviscerated by Trump in a matter of days.\n\nKRISTINA DRYE:People are really scared. I think that you know, 12 days ago, people knew where their next paycheck was coming from. They knew how they were going to pay for their kids’ daycare, their medical bills. And then, all gone overnight.\n\nPELLEY:“All gone, overnight,” for Kristina Drye and Adam Dubard — fired this month in the chaotic shutdown of foreign aid distributed by the U.S. Agency for International Development, USAID. More than 8,000 USAID employees were sent home by the administration.\n\nADAM DUBARD:They’re not looking for competency. They’re not looking for — if you’re good at your job. They’re looking for pure loyalty tests, and if you don’t give it, you will be punished…\n\nPELLEY:The world’s richest man had cut off assistance to the world’s poorest families. Musk spent nearly $250 million to get Trump and other Republicans elected. He collects billions in taxpayer dollars for his SpaceX rockets.\n\nANDREW NATSIOS, FORMER USAID ADMINISTRATOR:I think we’re creating a system that violates the separation of powers and the checks and balances that are intended in the Constitution.\n\nPELLEY:Republican Andrew Natsios, former head of USAID, spoke to us in Washington, in part because he is not hearing public appeals to reason from fellow Republicans.\n\nPELLEY TO NATSIOS:How do you view this moment in history?\n\nNATSIOS:I don’t want to be too pessimistic. But it does appear we may be headed towards some sort of a constitutional crisis. I don’t, I hope that doesn’t happen. I pray it doesn’t happen. But it’s certainly concerning to me what’s going on in this city right now.\n\nNATSIOS:We’ll see if they refuse to enforce a court order by the Supreme Court. If it gets to the Supreme Court and the Supreme Court rules against the administration on something and they refuse to enforce it, then we will have a constitutional crisis.\n\nSEE THE LATEST POLITICAL NEWS AND BUZZ FROM WASHINGTON SECRETS\n\nBaker, the Steven P.J. Wood senior fellow, explained our pick: “Another hit to whatever remnants are left of 60 Minutes as some sort of dispassionate news magazine which offers a fair and balanced look at complicated issues. Pelley not only matched the Trump Derangement Syndrome of the left, he doubled down on it, presuming the absolute worst motives behind President Trump while taking cheap ideological shots at Elon Musk. This is Exhibit A in why federal spending has never been cut since the end of World War II: The media go to war to discredit anyone who takes on the spending behemoth.”"
    }
}