{
    "question": "How might Trump and Putin’s 90-minute phone call, which Trump framed as a potential starting point for ending the war in Ukraine, influence Ukraine’s agency in any negotiations and the broader regional security landscape?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nPresident Donald Trump has upended three years of U.S. policy toward Ukraine, saying he and Russian leader Vladimir Putin have agreed to begin negotiations on ending the war.\n\nU.S. Defense Secretary Pete Hegseth said NATO membership for Ukraine was unrealistic and in sweeping remarks suggested that the way forward for Ukraine was for the country to abandon hopes of a return to its pre-2014 borders and prepare for a negotiated settlement with Russia — one that should be backed up with an international force of troops.\n\nPresident Donald Trump speaks as Tulsi Gabbard is sworn in as the Director of National Intelligence in the Oval Office of the White House, Wednesday, Feb. 12, 2025, in Washington. (Photo/Alex Brandon)\n\nMarc Fogel listens as President Donald Trump speaks in the Diplomatic Reception Room at the White House, Tuesday, Feb. 11, 2025, in Washington. (Photo/Alex Brandon)\n\nA police officer escorts Alexander Vinnik, center, as they arrive at Greece’s supreme court in Athens, Dec. 6, 2017. (AP Photo/Petros Giannakouris, File)\n\nPresident Donald Trump speaks as Tulsi Gabbard is sworn in as the Director of National Intelligence in the Oval Office of the White House, Wednesday, Feb. 12, 2025, in Washington. (Photo/Alex Brandon)\n\nWASHINGTON (AP) — President Donald Trump upended three years of U.S. policy toward Ukraine on Wednesday, saying that he and Russian leader Vladimir Putin had agreed to begin negotiations on endingthe warfollowing a suddenprisoner swap.\n\nTrump said he spent more than an hour on the phone with Putin and “I think we’re on the way to getting peace.” He noted that he later spoke with Ukrainian President Volodymyr Zelenskyy, but he was noncommittal about whether Ukraine would be an equal participant in U.S. negotiations with Russia.\n\n“I think President Putin wants peace and President Zelenskyy wants peace and I want peace,” Trump told reporters in the Oval Office. “I just want to see people stop being killed.”\n\nOf his conversation with Putin, Trump said, “People didn’t really know what President Putin’s thoughts were. But I think I can say with great confidence, he wants to see it ended also, so that’s good — and we’re going to work toward getting it ended and as fast as possible.”\n\nTrump noted that he would “probably” meet in person with Putin in the near term, suggesting that could happen in Saudi Arabia.\n\nTrump speaking to Putin sent a potentially dramatic signal that Washington and Moscow could work to hammer out a deal to end fighting in Ukraine by going around that country’s government. Doing so would break with the Biden administration, which steadfastly insisted Kyiv would be a full participant in any decisions made.\n\nAsked specifically about Ukraine being an equal member in the peace process, Trump responded, “Interesting question. I think they have to make peace.”\n\nIn another blow to Ukraine’s Western-leaning aspirations, Defense Secretary Pete Hegseth said at NATO headquarters in Brussels thatNATO membership was unrealisticfor Ukraine.\n\n“I don’t think it’s practical to have it, personally,” Trump said later about NATO membership for Ukraine. He added that Hegseth had said “it’s unlikely or impractical. I think probably that’s true.”\n\nAfterRussia invaded Ukrainein February 2022, the Biden administration joined other NATO members in vowing that membership in the Western military alliance was “inevitable.”\n\nTrump said Wednesday of Russia: “I think long before President Putin, they said there’s no way they’d allow that.”\n\n”They’ve been saying that for a long time that Ukraine cannot go into NATO,” Trump said. “And I’m OK with that.”\n\nDespite all that, Zelenskyy sought to put a brave face on what many in Ukraine will see as a major disappointment. In a social media post, he said he had “a meaningful conversation” with Trump that included discussion of “opportunities to achieve peace” and Kyiv’s “readiness to work together at the team level.”\n\nKremlin spokesman Dmitry Peskov said the conversation between Trump and Putin covered a good deal of ground, including the Middle East and Iran, but that Ukraine was the main focus.\n\nPeskov said Trump called for a quick cessation of hostilities and a peaceful settlement, and that “President Putin, in his turn, emphasized the need to remove the root causes of the conflict and agreed with Trump that a long-term settlement could be achieved through peace talks.”\n\n“The Russian president supported one of the main theses of the U.S. president that the time has come for our two countries to work together,” Peskov told reporters. “The Russian president invited the U.S. president to visit Moscow and expressed readiness to host U.S. officials in Russia for issues of mutual interest, naturally including Ukraine, the Ukrainian settlement.”\n\nIn the meantime,Ukrainehas offered to strike a deal with Trump for continuedAmerican military aidin exchange for developing Ukraine’s mineral industry — which could provide a valuable source of therare earth elementsthat are essential for many kinds of technology.\n\nTrump suggested that aid would continue to flow but that Treasury Secretary Scott Bessent was in Ukraine working to get written assurances that the U.S. would get access to its rare earth elements and oil and gas.\n\n“We’re asking for security on our money,” Trump said, noting of Ukraine: “They’ve agreed to it.”\n\nZelenskyy tweeted earlier about the meeting with Bessent, saying “we value our partnership with the United States” and “strive to expand our joint capabilities.”\n\nAsked about Trump’s views on Russia and Putin, White House press secretary Karoline Leavitt said, “I believe this nation views Putin and Russia as a great competitor in the region. At times, an adversary.” But she also noted of Trump: “At times, he enjoys having good diplomatic relationships with leaders around the world.”\n\nWorking more closely with Putin on Ukraine defies the long-held stance of Biden, who, together with his top national security aides, repeatedly insisted, “Nothing about Ukraine without Ukraine.”\n\nVice President JD Vance, Secretary of State Marco Rubio and Trump’s special Russia-Ukraine envoy, retired Gen. Keith Kellogg, will all be in Germany this week for the annual Munich Security Conference, which Zelenskyy also will attend.\n\nWednesday’s Trump-Putin call, and the resulting policy sea change, followed a prisoner swap that resulted in Russia releasing Pennsylvania schoolteacher Marc Fogel after more than three years of detention in return for convicted Russian criminal Alexander Vinnik.\n\nThe White House described the prisoner swap as evidence of a diplomatic thaw that could advance negotiations to end the fighting in Ukraine.\n\nIn a social media post detailing his call with Putin, Trump wrote, “We each talked about the strengths of our respective Nations, and the great benefit that we will someday have in working together.”\n\nTrump also noted they “agreed to have our respective teams start negotiations immediately.” The president appointed Rubio, CIA director John Ratcliffe, national security adviser Michael Waltz and his special Mideast envoy Steven Witkoff to lead those talks.\n\nFogel, who was deemed wrongfullydetained by Russia, was arrested in August 2021 for possession of marijuana and was serving a 14-year prison sentence. He had been left out of previous prisoner swaps with Russia that were negotiated by the Biden administration.\n\nVinnik — the other person involved, according to two U.S. officials — was arrested in 2017 in Greece at the request of the U.S. on cryptocurrency fraud charges and was later extradited to the United States, where he pleaded guilty last year to conspiracy to commit money laundering.\n\nHe is in custody in California awaiting transport to Russia, the officials said. The Kremlin confirmed that a Russian citizen was freed in the United States in exchange for Fogel but refused to identify him until he arrives in Russia.\n\nTrump welcomed Fogel at the White House on Tuesday evening after his return to the U.S. on Witkoff’s personal plane.\n\nAP reporter Eric Tucker contributed from Washington.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "So now we know. Washington is intent on decoupling from Europe and reconnecting with Russia. America’s stance was reaffirmed yesterday, in Brussels, by the newly minted Defense Secretary, Pete Hegseth, who was there primarily to discuss the Ukraine conflict. We already knew the top lines: Nato membership for Ukraine is “unrealistic”, he said, and the war “must end” through diplomacy. Kyiv must abandon aspirations of reclaiming pre-2014 borders —that includes Crimea — and prepare for a negotiated settlement with Russia.\n\nBut Hegseth’s message extended beyond Ukraine. “Stark strategic realities prevent the United States of America from being primarily focused on the security of Europe,” he continued, stating that European forces should assume responsibility for providing post-war security guarantees for Ukraine, explicitly ruling out US troop involvement. This aligns with Trump’s broader push for Nato allies to increase their defence spending. He clarified that these troops would not be part of a Nato-led mission and would not be covered under the alliance’s Article 5 guarantee, underscoring America’s disengagement from European security affairs.\n\nWhile these statements didn’t come as much of a surprise to European leaders, given Trump’s previous rhetoric, they did reinforce a fundamental shift in US Ukraine policy, one which prioritises diplomacy over continued military engagement. While this represents a welcome departure from Biden’s more confrontational stance, the path to peace remains fraught with obstacles.\n\nHegseth did not outline specifics for a possible peace deal between Ukraine and Russia. But, according to a leaked version of Trump’s proposed peace plan, reported by Ukrainian media, the territories seized by Russia would be ceded in exchange for security guarantees. Kyiv would be expected to renounce military and diplomatic efforts to reclaim lost land and officially recognise Russian sovereignty over these regions.\n\nRegardless of this plan’s veracity, it is clear that it reflects Russia’s main condition for peace — something of which Trump is fully aware. His administration’s recognition of this geopolitical reality, coupled with the improbability of Ukraine regaining those territories, signals an important shift toward realistic diplomacy. Further reinforcing this new diplomatic approach, Trump announced on Truth Social that he had held a “lengthy and highly productive” phone call with Russian President Vladimir Putin. “We agreed to work together, very closely, including visiting each other’s nations… We will begin by calling President Zelensky, of Ukraine, to inform him of the conversation, something which I will be doing right now”.\n\nRe-establishing direct dialogue between Washington and Moscow is undoubtedly a positive development. However, the biggest near-term risk is that Trump may attempt to pressure Putin into a ceasefire without a fully developed peace framework. This is bound to fail.\n\nFor Moscow, we know, will not compromise on its key demands, which include the complete withdrawal of Ukrainian forces from four Russian-occupied regions. We know from Russia’s Deputy Foreign Minister Sergei Ryabkov that any ultimatums from the US would be ineffective and that any negotiations must recognise the “reality on the ground”.\n\nA major problem here is the proposal to have European-led peacekeeping forces in Ukraine, which is almost certain to face strong resistance from Moscow. Regardless of whether they are Nato-affiliated or not, Russia would see them as a Nato proxy force — an unacceptable scenario. As Anatol Lievenput it: “This is just as unacceptable to the Russian government and establishment as Nato membership for Ukraine itself. Indeed, the Russians see no essential difference between the two”.\n\nAnother complicating factor is that America’s security decoupling from Europe — the Europeanisation of Nato — also risks becoming an obstacle to peace, insofar as it is, paradoxically, emboldening a more hawkish stance from key European leaders.\n\nWithin the European Union, an influential pro-war coalition has emerged, primarily driven by Poland, Estonia, and Lithuania. The new European Commission has placed these countries in key foreign policy and defence roles, further solidifying their influence. Polish Prime Minister Donald Tusk, in his inaugural address as European Council President, stated: “If Europe is to survive, it must be armed”.\n\nSimilarly, Kaja Kallas, the EU’s High Representative for Foreign Affairs and Security Policy, has insisted that Europe must significantly increase its defence spending in response to the US disengagement, while maintaining the position that Russia must be defeated at all costs. Meanwhile, Andrius Kubilius, the new European Commissioner for Defence, has called for a “Big Bang approach” to ramp up European defence production.\n\nBeyond the EU, the UK is equally belligerent and is doubling down on its military support for Ukraine. On January 16, Starmer signed a bilateral defence partnership in Kyiv, pledging an additional £3 billion in annual military aid, on top of the £12.8 billion already provided. The deal also reaffirms Britain’s backing for Ukraine’s Nato membership.\n\nNato Secretary-General, Mark Rutte, echoed these sentiments on Wednesday, stating that he “agrees” with Trump on the need to “equalise security assistance to Ukraine” but warned that “to truly change the course of the conflict, we must do even more”. His remarks follow recent statements advocating for Nato to “adopt a wartime mindset”.\n\nUnderlying this growing military buildup is the belief that Russia poses an existential threat to Europe, despite Moscow lacking both the capability and intent to attack Nato. What might be dismissed as European posturing in response to US disengagement actually represents a significant obstacle to peace. As long as European leaders continue to escalate militarily, the chances of a diplomatic resolution to the Ukraine war diminish.\n\nThe real danger is that by persistently predicting an inevitable war with Russia, and preparing for it, Europe may ultimately bring that very war into reality. Faced with a rapidly growing European arms buildup and entrenched anti-Russian sentiment, Moscow may conclude that waiting is no longer an option. If European Nato members continue escalating tensions, Russia could decide to strike pre-emptively rather than risk allowing Nato’s military capabilities to reach a critical threshold. Even in a less extreme scenario, Europe’s increasingly aggressive posture is fundamentally incompatible with a lasting peace in Ukraine.\n\nIn other words, while the Trump administration’s pivot away from Europe and push for diplomacy may appear to be a step toward de-escalation, it risks unintentionally achieving the opposite. Rather than restraining Europe’s military ambitions, US disengagement is emboldening key EU and Nato actors — particularly in Eastern Europe — to pursue an increasingly confrontational stance toward Russia.\n\nThe Europeanisation of Nato, framed as a necessity following US withdrawal, has accelerated the continent’s militarisation and its leaders’ demonisation of Russia, perpetuating the very conditions that caused the conflict in Ukraine in the first place. Instead of using this moment to engage in diplomacy, European leaders view the US retreat as a reason to escalate militarily. In this sense, Washington’s decoupling from Europe is at odds with Trump’s stated aim of achieving peace in Ukraine.\n\nUnless European leadership acknowledges Russia’s security concerns, the prospects for a long-term settlement will remain bleak — and the risk of a larger war will continue to loom over the continent. Ironically, the US’s attempt to distance itself from European security affairs may ultimately pull it back into an even larger conflict — one that it will have far less control over.\n\nThomas Faziis anUnHerdcolumnist and translator. His latest book isThe Covid Consensus, co-authored with Toby Green.\n\nWe welcome applications to contribute to UnHerd – please fill out the form below including examples of your previously published work.Pleaseclick hereto submit your pitch.\n\nPleaseclick hereto view our media pack for more information on advertising and partnership opportunities with UnHerd.",
        "source_3": "ByFyodor Lukyanov, the editor-in-chief of Russia in Global Affairs, chairman of the Presidium of the Council on Foreign and Defense Policy, and research director of the Valdai International Discussion Club.\n\nByFyodor Lukyanov, the editor-in-chief of Russia in Global Affairs, chairman of the Presidium of the Council on Foreign and Defense Policy, and research director of the Valdai International Discussion Club.\n\nThe long-anticipated phone call between Vladimir Putin and Donald Trump has finally taken place, sending shock waves through the geopolitical landscape. But before anyone gets carried away with triumph or despair, it’s worth recognizing what has actually happened: Russian-US relations have simply returned to their natural state – one of strategic rivalry, conflicting interests, and fundamental differences in worldview.\n\nFor decades, the US pursued a fantasy – one where it could reshape Russia in its own image, first through incentives and later through coercion. Washington believed it could mold Moscow into a compliant partner within the ‘liberal international order’, an illusion that only collapsed when reality hit: Russia was never going to be remade. Meanwhile, Moscow spent years trying to find common ground, adjusting its own policies in hopes of reaching a workable coexistence. That experiment, too, ended a decade ago.\n\nThe dissolution of the Cold War system in the late 1980s was a historical anomaly, a fluke that many mistook for a permanent transformation. The Western narrative of ‘victory’ was premature – history does not end, it evolves. Over time, the illusion of a unipolar world became harder to sustain, and the global balance of power began shifting. Those who benefited from the old order clung to it desperately, while those who felt shortchanged pushed back harder. Ukraine became the unfortunate fault line in this struggle, the battleground of irreconcilable visions.\n\nWhat is happening now is not the beginning of a new era but the inevitable correction of an old one. The US, even under Trump’s presidency, has recognized that great power rivalry is once again the defining feature of international politics. But unlike previous decades, when ideological battles masked geopolitical interests, the new competition is more pragmatic, stripped of the pretense of universal values. The liberal world order is no longer a guiding principle – it is a relic of the past.\n\nThis shift does not guarantee peace, nor does it eliminate the risks of confrontation. But it does bring a certain rationality back into the equation. The West’s ideological zeal, which often led it to take reckless, counterproductive actions, is giving way to a more sober assessment of power and interests. The focus is no longer on forcing one side to submit, but on negotiating tangible advantages.\n\nRussia, meanwhile, is positioned as a key player in shaping this new world order. The strategic fantasies of the 1990s have been replaced with a hard-nosed realism that acknowledges the limits of Western power. The reset to ‘factory settings’ does not mean stability – it means a return to the fundamentals of global politics, where strength, influence, and calculated diplomacy dictate the course of history.\n\n© Autonomous Nonprofit Organization “TV-Novosti”, 2005–2025. All rights reserved.\n\nThis website uses cookies. Read RTPrivacy policyto find out more."
    }
}