{
    "question": "How should investigators and policymakers weigh the role of air traffic controller staffing shortages alongside other factors when examining the recent crashes and setting safety priorities?",
    "content": {
        "source_1": "A huge shareof the country's air traffic control facilities are understaffed, per a recent FAA report.\n\nWhy it matters:January'smid-air collisionbetween a passenger jet and a U.S. Army helicopter in Washington, D.C., is bringing fresh attention to the staffing shortages, which are alongstanding problem.\n\nZoom in:As of September 2023, all Valley control towers included in the report were short of their 2024 goals set jointly by the FAA and the air traffic controllers' union.\n\n1 bright spot:The Phoenix TRACON, which manages aircraft leaving or entering the Phoenix area, actually beat its target of 58 controllers with 59.",
        "source_2": "Joshua Rhett Miller is a Newsweek chief investigative reporter based in New York. His areas of focus include U.S. politics, immigration and society, as well as crime, education and technology. In 2024, Joshua joined Newsweek following roles at the New York Post, FoxNews.com and Fox News Channel, where he worked as an associate producer for \"Shepard Smith Reporting.\" He also has extensive experience covering national and international breaking news, including terror attacks, COVID-related topics and live reports from the United States-Mexico border. The graduate of Pennsylvania State University can be reached at j.miller@newsweek.com.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nStaffing shortages at air traffic control facilities have a negative impact on public safety and have made conditions more dangerous for years, two air traffic controllers toldNewsweekin the aftermath of the deadliest U.S. aviation disaster in decades.\n\nThe Federal Aviation Administration employees, who requested anonymity because they are forbidden to speak to reporters, said low staffing levels in the high-pressure job equate to long hours, widespread mandatory overtime and high rates of turnover within the federal agency responsible for protecting the nation's busy skies.\n\nFAA officials did not respond to a question on the controllers' allegations that staffing shortages have a detrimental impact on safety and operations.\n\n\"The air traffic system, especially in reference to staffing, is absolutely critical,\" one veteran controller toldNewsweek. \"It's been dangerous for years.\"\n\nOne controller, with nearly 10 years of FAA experience, said it's unclear if insufficient staffing factored into the January 29 collision betweenAmerican AirlinesFlight 5342 and an Army helicopter, killing 67 people in the deadliest U.S. aviation disaster since 2001. But it wasn't wholly surprising to many aviation experts, he said.\n\n\"We've all seen s**t that's f***ing crazy, that nobody hears about, right? The unfortunate reality is that we have been saying for years, it's going to take a fatality with an air carrier to get people's attention,\" he said.\n\nThe controller said the FAA's workforce suffered from relatively low pay within the aviation industry compared to pilots and brutal schedules, especially for employees with children.\n\n\"It used to be an air traffic controller made more than a first officer, but just a little less than a captain,\" he said. \"Kids who are going to college are choosing the pilot route instead of the controller route because the pilot route has a better quality of life and it pays way more.\"\n\nPresidentDonald Trumpsaid FAA diversity requirements could be to blame following the Potomac River crash.\n\nOne controller said the diversity requirement did affect hiring and excluded some qualified candidates—including military veterans—although the training was the same for everyone and nobody who was working was unqualified to do so. A second controller said he believed hires on diversity grounds had not significantly impacted operations but could have had an effect on staffing numbers.\n\nAir traffic controllers earned a median annual salary of $137,380 in May 2023, compared to $219,140 for airline pilots, copilots and flight engineers, according to Bureau of Labor Statistics data.\n\nAir traffic control specialists earn a median annual wage of $127,805, with pay increases for completion of additional training, according to the FAA's website.\n\n\"The annual salary for more advanced controllers who have completed on-the-job training varies with the location of the facility and the complexity of the airspace,\" the site explains, adding that additional factors include experienced candidates who were directly hired by facilities.\n\nPay varies widely between states, with those in New Hampshire making an average $163,480 compared to $75,950 for Arkansas.\n\nFormer FAA administrator Mike Whitaker, who resigned in late January, said during his confirmation hearing in October 2023 that more competitive compensation was needed to address the shortage of air traffic controllers but little has changed since, the controller said.\n\nAir traffic controllers help safeguard more than 45,000 flights and 2.9 million airline passengers nationwide per day.\n\nMost air traffic control specialists work full-time, with some putting in additional shifts, including on weekends and holidays. But they can retire at age 50 following 20 years of service—unlike most other federal employees who must work 30 years before retiring— and enjoy larger annuities than their counterparts, according to the FAA.\n\nThe agency announced in September that it had hired more than 1,800 air traffic controllers in 2024, bringing the nationwide tally to more than 14,000, including roughly 3,400 in various training stages.\n\nBut the number of certified professional controllers stands at 10,800, several thousand short of the current target of 14,600 as set by the FAA and the National Air Traffic Controllers Association, a union that represents the federal employees.\n\nStaffing targets for certified professional controllers at airport towers and terminal approaches had only been 72 percent met as of September 2023,FAA figures show. Ronald Reagan National Airport, near the site of the disaster, had met only 63 percent of its staffing target.\n\nFAA officials said reversing the decades-long decline of air traffic controllers is a top priority.\n\n\"We continue to hire and onboard new controllers. Their work is critical to meeting our safety mission,\" the agency toldNewsweekin a statement.\n\nCandidates get up to four months of training in Oklahoma City. Then on-the-job training begins, lasting up to four years and with some failing to make it through. Each location has unique factors including weather patterns, traffic volume and geographic features that trainees must master before becoming certified.\n\nA mandatory retirement age of 56 meant more stress on those still in the system, one controller said. That meant the FAA handing out overtime like water or candy because the alternative was to reduce flights, the controller said.\n\nControllers at virtually all larger FAA sites, including Air Route Traffic Control Centers and Terminal Radar Approach Control Facilities, have six-day work weeks based on actual facility staffing levels compared to volume and complexity, the controller said.Newsweekwas not independently able to confirm the figures.\n\nThe impact of the shortage on safety is \"definitely detrimental,\" the controller said.\n\nPrior to the disaster in Washington, D.C., the deadliest U.S. aviation accident in two decades occurred on November 12, 2001, when American Airlines Flight 587 crashed into a neighborhood in Belle Harbor, New York, killing 260 people. The deadliest plane accident in U.S. history took place on May 12, 1979, when American Airlines Flight 191 crashed during takeoff at Chicago O'Hare International Airport, killing 273 people.\n\n\"The fact there has only been one major accident in the last 20 years shows how rugged, stress-tested and safe the U.S. is,\" the controller said. \"But it's definitely teetering on the edge of disaster.\"\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nJoshua Rhett Miller is a Newsweek chief investigative reporter based in New York. His areas of focus include U.S. politics, immigration and society, as well as crime, education and technology. In 2024, Joshua joined Newsweek following roles at the New York Post, FoxNews.com and Fox News Channel, where he worked as an associate producer for \"Shepard Smith Reporting.\" He also has extensive experience covering national and international breaking news, including terror attacks, COVID-related topics and live reports from the United States-Mexico border. The graduate of Pennsylvania State University can be reached at j.miller@newsweek.com.\n\nJoshua Rhett Miller is a Newsweek chief investigative reporter based in New York. His areas of focus include U.S. politics, immigration and society, as well as crime, education and technology. In 2024, Joshua joined Newsweek following roles at the New York Post, FoxNews.com and Fox News Channel, where he worked as an associate producer for \"Shepard Smith Reporting.\" He also has extensive experience covering national and international breaking news, including terror attacks, COVID-related topics and live reports from the United States-Mexico border. The graduate of Pennsylvania State University can be reached at j.miller@newsweek.com.\n\nJoshua Rhett Miller is a Newsweek chief investigative reporter based in New York. His areas of focus include U.S. politics,                                    ...Read more",
        "source_3": "A critical shortage of 3,800 air traffic controllers is because of the Federal Aviation Administration’s DEI practices leavinga “gaping hole” in recruitment, a lawyer claimed to The Post.\n\nOver 1,000 would-be air traffic controllers were wiped out from consideration overnight because of diversity and inclusion hiring targets suddenly being implemented, according to the lead lawyer in a class-action lawsuit against the FAA.\n\nMichael Pearson told The Post his clients had completed all their training at FAA-approved institutions before they were placed in a direct hiring pool for air traffic controllers — as was standard at the time.\n\nWithin months of graduating, they were informed by the FAA they would need to pass a new “biographical assessment” which, he claimed, awarded extra points to people with “no aviation experience.”\n\n“The FAA basically decided the students were too white and the schools too elite, so in 2013 knocked them off the preferred hiring list they had trained and worked hard to get onto — all because of their race,” Pearson claimed.\n\nAccording to the attorney, 95 percent of the previously qualified candidates he represents then failed the biographical assessment questionnaire — essentially a personality test — and were “screened out.”\n\n“They had the training and the passion and they were ready to be hired,” he said.\n\nThe air traffic control issue was sharply brought into focus on Jan. 31 when anAmerican Airlines passenger planeand a Black Hawk helicopter collided at Ronald Reagan Washington National Airport in Washington, DC, killing 67 people in the country’s deadliest aviation disaster in almost 25 years.\n\nThe air traffic control tower was operating with 19 full-time staff, two-thirds of the 30 recommended by the FAA. Nationwide there are 10,800 air traffic controllers (ATCs), but 14,600 are needed to meet the current demand, according to the National Air Traffic Controllers Association.\n\n“The FAA engaged in staffing suicide. It takes two to five years to train as an air traffic controller and a long time to get these people through,” Pearson claimed.\n\n“Losing them meant a gaping hole was left in the ATC talent pool.”\n\nSimultaneously, a four-year near-freeze on air traffic controller hiring was also underway as the DEI policies were introduced, according to Pearson, a former air traffic controller and trainer.\n\n“The FAA, because of DEI policies, stopped hiring for three to four years and that directly correlates to the lack of staffing, and controllers being overworked and getting fatigued and burned out,” he told The Post.\n\nIn 2018, the biographical assessment was “removed as a screening tool,”according to the FAA.\n\n“If the DC crash is determined to be linked to ATC fatigue or lack of awareness — it’s directly related to DEI — President Trump was right about that,” said Pearson.\n\nHe said he believes the tragedy was due to “human error” on the part of air traffic control.\n\nOn the night of the DC disaster, understaffing resulted in one controller pulling double duty — overseeing helicopters while also guiding arriving and departing planes on the busy airport’s runways, an initial report by the FAA found.\n\n“The occupation requires attentiveness and awareness,” Pearson said.\n\n“This was not the helicopter’s fault — it was air traffic control whose primary job is to apply separation.\n\n“The controllers put planes on converging courses without a means of separation.\n\n“The [aircraft] were headed at each other, where systems would have been predicting they were about to collide.\n\n“ATC did nothing when it was their job to do something.\n\n“Pilots screw up every day. I never worked a day in the FAA where a plane didn’t make a wrong turn — your job as an ATC is to correct that in a timely manner.”\n\nThe aviation agency and US Department of Transportation are fighting the class-action suit, filed in 2015, which is slated to go to court early next year.\n\nMeanwhile, there are other factors contributing to the lack of ATCs, according to other sources, including “deeply flawed”recruitment and trainingwhich hampers its own ability to replenish its talent pool.\n\nOne ATC hopeful who passed all the skills tests and traveled to Philadelphia for an interview for a place at the training academy told The Post he was forced to turn it down because the hiring process took too long.\n\n“I’d submit something they requested as part of my application, then six months would pass until they asked for the next thing and repeat — it went on like that for years,” said the source, who spoke on condition of anonymity.\n\n“I did the test in 2019 and I didn’t receive the final letter saying I had made it through the process until December 2023.\n\n“I had a few days to respond and let them know if I wanted to do the training at the academy in Oklahoma, reporting there in January 2024.”\n\nThe source said it had been his dream job but that he ultimately decided not to accept because “they made me jump through way too many hoops.”\n\nAfter completing training at the FAA Academy, trainees are placed in a radar facility or air traffic tower, which can be anywhere in the US. Employees should expect to work day, evening and night shifts, along with weekends and holidays, depending on assigned schedules, the FAA states on its site.\n\nAfter all the training, entry-level positions still only pay $35,000 to $45,000 per year, and although experienced ATCs make six figures, it typically takes years to reach top-end earnings.\n\nOne prominent air traffic controller source who spoke to The Post claimed training at the national academy, based in Oklahoma, is inadequate.\n\nThey pointed out the academy has not yet adopted “automated grading” and instructors therefore pick and choose who can and can’t become an ATC.\n\n“The academy is flawed because it is not teaching everything that is needed to become an ATC and it’s subjective to the opinion of an instructor who thinks you can or can’t do the job,” they said.\n\nThe academy did not respond to multiple requests for comment from The Post.\n\nSources said hope was on the horizon through the new Enhanced Air TrafficCollegiate Training Initiative (AT-CTI) programs, which will allow approved institutions to provide students with FAA Academy air traffic control training.\n\n“The college training is better because it is longer and more in-depth and comprehensive,” one of The Post’s air traffic controller sources said.\n\nThere are currently just a few schools approved to offer the program, in Embry–Riddle Aeronautical University in Daytona Beach, Florida; the University of Oklahoma and Tulsa Community College; and the University of North Dakota.\n\n“The FAA is working to strengthen our controller workforce and create a continuous pipeline of talent,” Tim Arel, chief operating officer of the FAA’s Air Traffic Organization, said in a November 2024 statement.\n\nHowever, they are “losing Air Traffic Controllers much faster than they are gaining them,” according to another source, particularly due to a wave of retirements that started during COVID-19.\n\nThe pandemic forced the FAA to close its academy for six months in 2020 and pause on-the-job training at facilities for almost two years.\n\n“The [air] traffic was very reduced so you couldn’t do quality training without the volume of traffic to train someone and certify them,” one source told The Post.\n\n“Then 2022 comes in and traffic started rolling back faster than anticipated — and [the FAA] lost more ATCs than anticipated to retirement.”\n\nThe FAA last year claimed it had more than 14,000 air traffic controllers after it was revealed that all air traffic control sites in the country were understaffed in 2023.\n\nHowever, that number includes around 3,400 controllers in various stages of training, theFAA announcedat the time.\n\nWhile they hired 1,811 ATCs in 2024, the largest number of hires it had made in nearly a decade, it is still working to “reverse a decades-long air traffic controller staffing level decline.”\n\nTrade association Airlines for America (A4A) described the situation as an “urgent and dire air traffic controller shortage” in May last year.\n\n“We have been sounding the alarm on this issue for more than a year that our nation’s air traffic control radar facilities are understaffed and overworked,” A4A president and CEO Nicholas E. Calio said at the time.\n\nThe FAA’s goal is to hire 2,000 controllers from the military and private industry in 2025, the agency said in a November 2024 statement.\n\n“We are enhancing training with modernized simulators to help us get new hires through training more efficiently,” it added."
    }
}