{
    "question": "How might the EPA’s move to revoke the 2009 greenhouse gas endangerment finding reshape U.S. climate policy, including its legal durability under the Clean Air Act, the scope of future regulations on vehicles and power plants, and potential impacts on industry and public health?",
    "content": {
        "source_1": "The U.S. Environmental Protection Agency building  in Washington, D.C.Jose Luis Magana/APhide caption\n\nThe Trump administration wants to overturn a key2009 Environmental Protection Agency findingthat underpins much of the federal government's actions to rein in climate change.\n\nThe EPA has crafted a proposal that would undo the government's \"endangerment finding,\" a determination that pollutants from burning fossil fuels, such as carbon dioxide and methane, can be regulated under the Clean Air Act. The finding haslong served as the foundation for a host of policies and rules to address climate change. The EPA's proposal to revoke the finding is currently under review by the White House Office of Management and Budget.\n\nAlready, environmentalists, climate advocates and others are bracing for what could be a fundamental shift away from trying to address the problem of a hotter climate. And the Trump administration is celebrating the proposal as a potential economic win.\n\n\"Today is the greatest day of deregulation our nation has seen,\" EPA Administrator Lee Zeldin said inannouncing the proposalin March. \"We are driving a dagger straight into the heart of the climate change religion to drive down cost of living for American families, unleash American energy, bring auto jobs back to the U.S. and more.\"\n\nThe administration's effort comes in the wake of thehottest yearhumans have ever recorded on Earth,climate-fueled wildfiresthat destroyed thousands of homes in Los Angeles and hotter ocean temperatures thatmade Hurricane Helene strongerand more likely to cause damage inland.\n\nThe move could still be overturned by courts. But if the decision is upheld, it would speed President Trump's efforts to end former President Biden's ambitious climate agenda and make it more difficult for future administrations to limit the human-caused greenhouse gas pollution that's heating the planet.\n\nOn the first day of his second term, Trump signed an executive orderasking the EPA administrator to submit recommendations\"on the legality and continuing applicability\" of theEPA's endangerment finding.\n\nIn 2007, theSupreme Court found inMassachusetts v. EPAthat the agency is required to regulate carbon dioxide and other greenhouse gas emissions under the Clean Air Act. Then, in 2009 during the Obama administration, the EPAdeclared greenhouse gases in the atmosphere were a hazard to people.\n\n\"This long-overdue finding cements 2009's place in history as the year when the United States Government began seriously addressing the challenge of greenhouse gas pollution and seizing the opportunity of clean-energy reform,\" then-EPA Administrator Lisa Jackson saidin announcing the decision.\n\nThe endangerment finding is the basis for rules regulating climate pollution fromcoal and gas-firedpower plants,car and truck exhaustandmethane from the oil and gas industry.\n\n\"The Trump administration's intent is clear: They want to undermine or overturn the endangerment finding so as to evade EPA's legal responsibility to address the harms caused by climate change,\" says Rachel Cleetus, policy director with the Climate and Energy Program at the Union of Concerned Scientists. \"This is simply a giveaway to the fossil fuel industry and an attempt to undo pollution standards to limit heat-trapping emissions from motor vehicles, from power plants, [and] from oil and gas operations.\"\n\nThe EPA has repeatedly reaffirmed the 2009 endangerment finding. In 2022, Congress included language in the climate-focused Inflation Reduction Act that labels greenhouse gases as pollutants under the Clean Air Act. That makes abandoning the finding more difficult.\n\nBut if the administration succeeds, that would make it easier to accomplish President Trump's other priorities, such as eliminating greenhouse gas limits on coal and gas power plants.\n\nIn June, the Trump administration announced plans to repeal all limits on greenhouse gas emissions fromfossil fuel-fired power plants. In proposing the change, the EPA argues that pollution from U.S. power plants is a small part of global emissions and is declining. The agency claims eliminating climate pollution from these facilities would have little effect on people's health.\n\nOn Jan. 20, Trumpdeclared a \"national energy emergency\"and signed hisUnleashing American Energy executive order. These contribute to the president's broader push to redirect the federal government away from former President Joe Biden's climate agenda andtoward an even deeper embrace of fossil fuels.\n\nTrump wrote in his order that the goal is to \"restore American prosperity\" and, as he said in his inauguration speech, \"We will drill, baby, drill.\"\n\nTheTrump administration arguesthat the EPA, under then-President Barack Obama, established the endangerment finding in \"a flawed and unorthodox way\" and \"did not stick to the letter of the Clean Air Act.\"\n\nIn seeking to reverse the endangerment finding, the Trump EPA ismaking a legal argumentthat previous administrators overstepped their legal authority and \"imposed trillions of dollars of costs on Americans.\" The agency repeats past Republican arguments that the 2007Massachusetts v. EPAdecision \"explicitly did not hold that EPA was required to regulate these emissions from these sources.\" And the EPA argues that more recent Supreme Court decisions raise further questions about the legality of the 2009 endangerment finding.\n\nEnvironmental groups instead see a proposal designed to benefit fossil fuel companies, who Trump courted during the campaign.\n\n\"By revoking this key scientific finding our government is putting fealty to Big Oil over sound science and people's health,\" Dan Becker, director of the Center for Biological Diversity's Safe Climate Transport Campaign wrote in a statement. \"These proposals are a giant gift to oil companies that will do real damage to people, wildlife and future generations.\"\n\nIn 2024, Trumpsuggested oil executives should raise $1 billion for his presidential bidbecause he would roll back environmental rules.\n\nCritics who cast doubt on the scientific consensus behind climate change see an opportunity to eliminate a decision they have long opposed.\n\n\"Since the 2009 endangerment finding, the EPA has been trying to regulate greenhouse gases and as a result trying to control large portions of the economy,\" Daren Bakst, director of the Center for Energy and Environment at the Competitive Enterprise Institute, which advocates for regulatory reform on various policy issues,wrote in an email to NPR. He specifically points to rules limiting climate pollution from power plants and from cars and trucks.\n\nBakst calls the potential harms in the 2009 endangerment finding \"speculative at best\" and echoes an argument many conservatives make, saying, \"Even if the United States eliminated all of its greenhouse gas emissions, it would have little to no measurable effect on global temperatures.\"\n\nThe U.S. is the largest historical emitterof man-made climate pollution and, under the Paris climate agreement, has agreed to contribute to the global effort to reduce emissions and limit warming. Trump has signed a directive to have the U.S. withdraw from that agreement.\n\nIf the EPA finds the 2009 endangerment finding is no longer applicable, Bakst says that \"would preclude future greenhouse gas regulations.\" And he says \"it should be easy to repeal existing rules that are predicated on the 2009 finding.\"\n\nBut that could still be years from now. There will be a public comment period, rulemaking processes and legal challenges the Trump administration would have to overcome first.",
        "source_2": "The Trump administration will propose the repeal of a landmark 2009 determination that climate change poses a danger to the public, Environmental Protection Agency (EPA) Administrator Lee Zeldin said Wednesday.\n\n“EPA has sent to the Office of Management and Budget a proposed rule to repeal the 2009 endangerment finding from the Obama EPA,” Zeldintold Newsmax.\n\n“Through the endangerment finding, there has been into the trillions worth of regulations, including tailpipe emissions and including electric vehicle mandates,” he added.\n\nIn 2009, then-President Obama’s administration made aformal determinationthat greenhouse gases including carbon dioxide and methane posed a threat to public health. It found emissions from vehicles contributed to the problem.\n\nThe finding provided a legal basis for EPA regulations on these planet-heating gases, including for its rules requiring automakers’ to cut emissions from their vehicle fleets.\n\nWhile these rules did not explicitly mandate a pivot to electric vehicles, standards issued by the Biden administration were expected to push the vehicle market toward more electric cars in the years ahead.\n\nThe EPA’s plans to propose a rule to repeal the finding were first reported byThe New York Times.\n\nThe Trump administration’s move comes despite aconsensus from the scientific communitythat human activity, especially its use of fossil fuels, is heating up the planet. This heating in turn exacerbates extreme weather.\n\nDuring President Trump’s first term, his administration weakened limits on planet-warming emissions, including from vehicles, but it did not repeal the endangerment finding.\n\nThe proposal to repeal it signals an escalation that could prevent the agency from having climate regulations on the books at all.\n\nZealan Hoover, who served as a senior EPA advisor during the Biden administration said it is “insane” to say that climate change doesn’t impact U.S. health and welfare.\n\n“We are right back to full-throated climate denialism of the early 2000s,” Hoover said.\n\n“Climate change impacts public health because it changes the Earth’s climate patterns in ways that are beyond both what the human body and our built systems, evolved to have been designed to adapt [to], so that looks like extreme heat, which can cause heat stress and death…. it leads to sea level rise, which you know is makes for more damaging storm surges and even flooding on, non-storm days,” he added.\n\nPresident Trump has repeatedly denied the existence of climate change, sought to downplay its impacts, repeal regulations meant to combat the problem and defund efforts to research and mitigate it.\n\nThe EPA’s 2009 endangerment finding came after a 2007 Supreme Court case which said that the agency can regulate greenhouse gas emissions under the Clean Air Act and that the agency should decide whether they imperil public health.\n\nThe Trump administration had previously signaled that it could repeal the finding.\n\nDuring his confirmation hearing, EPA Administrator Lee Zeldindeclined to saywhether he believed the EPA had a responsibility to regulate climate change.\n\nIn March, the agencysaid it would reconsiderthe finding without saying what the outcome of that reconsideration would be.\n\nThe move alsoechoes a similar proposalfrom the agency to determine that powerplants’ planet-warming emissions “do not contribute significantly to dangerous air pollution” and therefore should not be regulated.\n\nThe EPA appears to be preparing a proposal rather than a final decision, meaning the formal revocation of the endangerment finding could be months or even years away.",
        "source_3": "Six months in, Trump is attacking one of the major pillars of the climate change agenda.\n\nFor over 15 years, the government has operated on limited scientific research and legal findings to justify its climate action agenda. Now, the Trump administration is seriously considering scrapping the crux of these Obama-era climate change regulations.\n\nThe Trump administration is reconsidering the EPA's \"endangerment finding,\" a 2009 rule based on the results of the 2007Massachusetts v. EPASupreme Court case. The endangerment finding mandates the EPA to curb climate change caused by greenhouse gases under theClean Air Act, last amended in 1990.\n\n'Under the enlightened leadership of President Trump and Administrator Zeldin, the time for fresh thought has finally arrived.'\n\nOn his first day in office, President Trump signedExecutive Order 14154, called \"Unleashing American Energy,\" which mandated that the EPA and the Office of Management and Budget review the endangerment finding and related environmental regulations.\n\nRELATED:EV mandate killed in 'biggest day of deregulation in American history'\n\nPhoto by Demetrius Freeman/The Washington Post via Getty Images\n\nIn a Wall Street Journalopinion piecein March, EPA Administrator Lee Zeldin explained the goal of Trump's executive orders: \"By overhauling massive rules on the endangerment finding, we are driving a dagger through the heart of climate-changereligionand ushering in America's Golden Age.\"\n\nNow, apageon the OMB website lists an \"economically significant\" proposed rule titled the \"Greenhouse Gas Endangerment Finding and Motor Vehicle Reconsideration Rule.\" No other details about this proposed rule are available at this time because it still needs to be finalized and announced to the public. The rule was received by the OMB from the EPA on June 30.\n\nThe decision to reconsider the endangerment finding has caused a stir among climate change groups. David Doniger, a senior attorney at the advocacy group Natural Resources Defense Council, told the Post, \"They're trying to completely defang the Clean Air Act by saying, ‘Well, this stuff's just not dangerous.' That claim is just mind-bogglingly contrary to the evidence.\"\n\nThomas Pyle, president of the Institute for Energy Research,toldthe Washington Post, \"It's long since past the time for an administration to review this. Ultimately, Congress should have a say when it's all said and done.\"\n\nSeveral of the leaders involved in this reconsideration have signaled their support for the Trump administration's order in the past.\n\nIn a Marchpress release, Office of Information and Regulatory Affairs Administrator Jeff Clark said, \"Since 2009, I've consistently argued that the endangerment finding required a consideration of downstream costs imposed on both mobile sources like cars and stationary sources like factories. Under the enlightened leadership of President Trump and Administrator Zeldin, the time for fresh thought has finally arrived.\"\n\n\"EPA's regulation of the climate affects the entire national economy — jobs, wages, and family budgets. It's long overdue to look at the impacts on our people of the underlying Obama endangerment finding,\" said White House OMB Director Russ Vought in the press release.\n\n\"The 2009 endangerment finding has had an enormously negative impact on the lives of the American people. For more than 15 years, the U.S. government used the finding to pursue an onslaught of costly regulations — raising prices and reducing reliability and choice on everything from vehicles to electricity and more. It's past time the United States ensures the basis for issuing environmental regulations follows the science and betters human lives,” Energy Secretary Chris Wright said.\n\nThe endangerment finding will be reconsidered by the Office of Management and Budget before an official announcement to the public.\n\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox.Sign up here!"
    }
}