{
    "question": "In what ways could the judge’s temporary restraining order halting plans to place more than 2,000 USAID employees on paid leave shape the administration’s next steps and USAID’s operations before the Feb. 14 deadline?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nThe American flag flying alone beside an empty flagpole that previously had the flag of the U.S. Agency for International Development, or USAID, are pictured in the reflection of a window that previously had the sign and the seal of USAID, outside the agency’s headquarters in Washington, Feb. 7, 2025. (AP Photo/Jose Luis Magana, File)\n\nA street sign with names of U.S. government agencies housed at the Ronald Reagan Building, including the United States Agency for International Development, or USAID headquarters in Washington, is pictured with one building occupant taped, Friday, Feb. 7, 2025, in Washington. (AP Photo/Manuel Balce Ceneta)\n\nDemonstrators and lawmakers rally against President Donald Trump and his ally Elon Musk as they disrupt the federal government, including dismantling the U.S. Agency for International Development, which administers foreign aid approved by Congress, on Capitol Hill in Washington, Wednesday, Feb. 5, 2025. (AP Photo/J. Scott Applewhite)\n\nU.S. Secretary of State Marco Rubio, center right, walks with Edwin F. Lopez, the attaché for DHS Homeland Security Investigations, as they walk toward a Venezuelan government airplane that Rubio announced the U.S. is seizing at La Isabela International Airport in Santo Domingo, Dominican Republic, Thursday, Feb. 6, 2025. (AP Photo/Mark Schiefelbein, Pool)\n\nAn unidentified U.S. soldier stands guard as Albanian aid workers unload boxes of U.S. “Humanitarian Daily Rations” from a transport helicopter in Kukes, Albania at the Albania-Kosovo border April 4, 1999. (AP Photo/Michel Euler, File)\n\nUgandan human rights activist Kennedy Pius reads a letter from USAID on his laptop at home in Kampala, Uganda, Jan. 28, 2025. (AP Photo/Hajarah Nalwadda)\n\nDemonstrators and lawmakers rally against President Donald Trump and his ally Elon Musk as they disrupt the federal government, including dismantling the U.S. Agency for International Development, which administers foreign aid approved by Congress, on Capitol Hill in Washington, Wednesday, Feb. 5, 2025. (AP Photo/J. Scott Applewhite)\n\nDemonstrators and lawmakers rally against President Donald Trump and his ally Elon Musk as they disrupt the federal government, including dismantling the U.S. Agency for International Development, which administers foreign aid approved by Congress, on Capitol Hill in Washington, Wednesday, Feb. 5, 2025. (AP Photo/J. Scott Applewhite)\n\nA bouquet of white flowers placed outside the headquarters of the United States Agency for International Development, or USAID, is pictured, Friday, Feb. 7, 2025, in Washington. (AP Photo/Manuel Balce Ceneta)\n\nThe American flag flies alone beside an empty flagpole previously flying the flag of the United States Agency for International Development, or USAID, in front the USAID headquarters in Washington, Friday, Feb. 7, 2025. (AP Photo/Manuel Balce Ceneta)\n\nThe door of the U.S. Agency for International Development, or USAID, is seen with the sign and logo removed from the wall outside of the agency’s headquarters in Washington, Friday, Feb. 7, 2025. (AP Photo/Jose Luis Magana)\n\nWASHINGTON (AP) — A federal judge on Friday dealt President Donald Trump and billionaire ally Elon Musk their first big setback in their dismantling of theU.S. Agency for International Development,ordering a temporary halt to plans to pull thousands of agency staffers off the job.\n\nU.S. District Judge Carl Nichols, a Trump appointee, also agreed to block an order that would have given the thousands of overseas USAID workers the administration wanted to place on abrupt administrative leave just 30 days to move families and households back to the U.S. on government expense.\n\nBoth moves would have exposed the U.S. workers and their spouses and children to unwarranted risk and expense, the judge said.\n\nNichols pointed to accounts from workers abroad that the Trump administration, in its rush to shut down the agency and its programs abroad, had cut some workers off from government emails and other communication systems they needed to reach the U.S. government in case of a health or safety emergency.\n\nThe Associated Press reported earlier that USAID contractors in the Middle East and elsewhere had found even “panic button” appswiped off their mobile phonesor disabled when the administration abruptly furloughed them.\n\n“Administrative leave in Syria is not the same as administrative leave in Bethesda,” the judge said in his order Friday night.\n\nIn agreeing to stop the 30-day deadline given USAID staffers to return home at government expense, Nichols cited statements from agency employees who had no home to go to in the U.S. after decades abroad, who faced pulling children with special needs out of school midyear, and had other difficulties.\n\nThe judge also ordered USAID staffers already placed on leave by the Trump administration reinstated. But he declined a request from two federal employee associations to grant a temporary block on a Trump administration funding freeze that has shut down the six-decade-old agency and its work, pending more hearings on the workers’ lawsuit.\n\nNichols stressed in the hearing earlier Friday on the request to pause the Trump administration’s actions that his order was not a decision on the employees’ request to roll back the administration’s swiftly moving destruction of the agency.\n\n“CLOSE IT DOWN,” Trump said on social media of USAID before the judge’s ruling.\n\nThe American Foreign Service Association and the American Federation of Government Employees argue that Trump lacks the authority to shut down the agency without approval from Congress. Democratic lawmakers have made the same argument.\n\nTrump’s administration moved quickly Friday to literally erase the agency’s name. Workers on a crane scrubbed the name from the stone front of its Washington headquarters. They used duct tape to block it out on a sign and took down USAID flags. Someone placed a bouquet of flowers outside the door.\n\nThe Trump administration andMusk, who is running a budget-cutting Department of Government Efficiency, have made USAID their biggest target so far in an unprecedented challenge of the federal government and many of its programs.\n\nAdministration appointees and Musk’s teams have shut down almost all funding for the agency, stopping aid and development programs worldwide. They have placed staffers and contractors on leave and furlough and locked them out of the agency’s email and other systems. According to Democratic lawmakers, they also carted away USAID’s computer servers.\n\n“This is a full-scale gutting of virtually all the personnel of an entire agency,” Karla Gilbride, the attorney for the employee associations, told the judge.\n\nJustice Department attorney Brett Shumate argued that the administration has all the legal authority it needs to place agency staffers on leave. “The government does this across the board every day,” Shumate said. “That’s what’s happening here. It’s just a large number.”\n\nFriday’s ruling is the latest setback in the courts for the Trump administration, whose policies tooffer financial incentives for federal workersto resign and endbirthright citizenshipfor anyone born in the U.S. to someone in the country illegally have been temporarily paused by judges.\n\nEarlier Friday, a group of a half-dozen USAID officials speaking to reporters strongly disputed assertions from Secretary of State Marco Rubio that the most essential life-saving programs abroad were getting waivers to continue funding. None were, the officials said.\n\nAmong the programs they said had not received waivers: $450 million in food grown by U.S. farmers sufficient to feed 36 million people, which was not being paid for or delivered; and water supplies for 1.6 million people displaced by war in Sudan’s Darfur region, which were being cut off without money for fuel to run water pumps in the desert.\n\nThe judge’s order involved the Trump administration’s decision earlier this week to pull almost all USAID workers off the job and out of the field worldwide.\n\nTrump and congressional Republicans have spoken of moving a much-reduced number of aid and development programs under the State Department.\n\nWithin the State Department itself, employees fear substantial staff reductions following the deadline for the Trump administration’s offer of financial incentives for federal workers to resign, according to officials who spoke on condition of anonymity for fear of reprisal. A judge temporarily blocked that offer and set a hearing Monday.\n\nThe administration earlier this week gave almost all USAID staffers posted overseas 30 days, starting Friday, to return to the U.S., with the government paying for their travel and moving costs. Diplomats at embassies asked for waivers allowing more time for some, including families forced to pull their children out of schools midyear.\n\nIn a notice posted on the USAID website late Thursday, the agency clarified that none of the overseas personnel put on leave would be forced to leave the country where they work. But it said that workers who chose to stay longer than 30 days might have to cover their own expenses unless they received a specific hardship waiver.\n\nRubio said Thursday duringa trip to the Dominican Republicthat the government would help staffers get home within 30 days “if they so desired” and would listen to those with special conditions.\n\nHe insisted the moves were the only way to get cooperation because staffers were working “to sneak through payments and push through payments despite the stop order” on foreign assistance. Agency staffers deny his claims of obstruction.\n\nRubio said the U.S. government will continue providing foreign aid, “but it is going to be foreign aid that makes sense and is aligned with our national interest.”\n\nAP reporters Matthew Lee, Farnoush Amiri and Lindsay Whitehurst in Washington contributed to this report.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "A judge has temporarily blocked President Donald Trump from placing 2,200 workers at the US Agency for International Development (USAID) on paid leave, hours before it was due to happen.\n\nJudge Carl Nichols issueda \"limited\" temporary restraining order,in response to a last-minute lawsuit filed by two unions trying to save the agency.\n\nThe order will remain in place for a week, until 14 February at midnight.\n\nTrump has argued that USAID, the overseas aid agency, is not a valuable use of taxpayer money andwants to dismantle it- with plans to put nearly all of the agency's 10,000 employees on leave, except 611 workers.\n\nSome 500 staff had already been put on administrative leave and another 2,200 were due to join them from midnight on Friday (05:00 GMT).\n\nBut the last-minute lawsuit on Friday argued the government was violating the US Constitution, and also that the workers were suffering harm.\n\nJudge Nichols sided with the unions, saying they would suffer \"irreparable harm\" if the court did not intervene, while there would be \"zero harm to the government\".\n\nThe order also reinstates the 500 staff already placed on administrative leave.\n\n\"All USAID employees currently on administrative leave shall be reinstated until that date, and shall be given complete access to email, payment, and security notification systems until that date, and no additional employees shall be placed on administrative leave before that date,\" Nichols wrote.\n\nThe judge will also consider a request for a longer-term pause at a hearing on Wednesday.\n\nIt is unclear from the court order what will happen to the agency's remaining staff.\n\nAs the ruling came, officials had been removing and covering USAID signs at the organisation's headquarters in Washington DC.Theagency's websiteis also inaccessible, leading only to a landing page about the personnel cuts.\n\nUSAIDis the world's biggest aid donor- with much of its budget spent on health programmes around the world. Two-thirds of its 10,000 staff work overseas.\n\nIt is one of many federal agencies his administration is targeting as it works to slash federal spending in the US.\n\nThe Republican campaigned on overhauling the government and formed an advisory body named the Department of Government Efficiency (Doge) - led by tech billionaire Elon Musk - to slash the budget.\n\nFriday's ruling by Judge Nicholscame in response to an emergency petition by the American Foreign Service Association and American Federation of Government Employees - two unions representing employees of the agency.\n\nDuring the hearing, Judge Nichols - who was nominated by Trump during his first term - did not seem likely to grant other requests as part of the lawsuit, including to restore grants and contracts or reopen USAID buildings.\n\nThe legal action argued that the president was violating the US Constitution and federal law by attempting to dismantle the agency.\n\n\"Not a single one of defendants' actions to dismantle USAID were taken pursuant to congressional authorization,\" it said.\n\n\"And pursuant to federal statute, Congress is the only entity that may lawfully dismantle the agency.\"\n\nRepresenting the Trump administration, justice department official Brett Shumate told the judge that the president \"has decided there is corruption and fraud at USAID\".\n\nHours after Trump took office on 20 January, he signed an executive order halting all foreign assistance until such funds were vetted and aligned with his \"America First\" policy.\n\nThat led to a stop work order at USAID, which runs health and emergency programmes in around 120 countries, including in the world's poorest regions.\n\n\"USAID IS DRIVING THE RADICAL LEFT CRAZY,\" Trump posted on his Truth Social platform.\n\n\"THE CORRUPTION IS AT LEVELS RARELY SEEN BEFORE. CLOSE IT DOWN!\"\n\nBut Samantha Power, who was USAID chief under former President Joe Biden, wrote in a scathing New York Times opinion piece: \"We are witnessing one of the worst and most costly foreign policy blunders in US history.\"\n\nThe US is by far the biggest single provider of humanitarian aid around the world. USAID's budget amounts to around $40bn - about 0.6% of total US annual government spending of $6.75tn.\n\nThe head of the United Nations' programme for tackling HIV/AIDS told the BBC the cuts would have dire impacts across the globe.\n\n\"AIDS related deaths in the next five years will increase by 6.3 million\" if funding is not restored, UNAIDS executive director Winnie Byanyima said.\n\n©2025 BBC. The BBC is not responsible for the content of external sites.Read about our approach to external linking.",
        "source_3": "ELLEN KNICKMEYERFriday, 07 February 2025 04:53 PM EST ET\n\nA federal judge on Friday temporarily blocked the Trump administration from placing 2,200 employees of the U.S. Agency for International Development on paid leave.\n\nU.S. District Judge Carl Nichols, a Trump appointee, sided with two federal employee associations in agreeing to a pause in plans to put the employees on paid leave as of midnight Friday.\n\nThe workers associations argue that President Donald Trump lacks the authority to shut down an agency enshrined in congressional legislation.\n\nForced leaves pulling all but a small fraction of staffers of the U.S. Agency for International Development off the job around the world began Friday, while employees turned to federal courts to try to roll back the Trump administration's swift dismantling of the six-decade-old aid agency and its programs worldwide.\n\n“CLOSE IT DOWN,” Trump said Friday on social media of USAID.\n\nBefore the judge called for a pause, crews used duct tape to block out the agency’s name on a sign outside its Washington headquarters, and a flag was taken down. Someone placed a bouquet of flowers outside the door.\n\nA group of a half-dozen USAID officials speaking to reporters Friday strongly disputed assertions from Secretary of State Marco Rubio that the most essential life-saving programs abroad were getting waivers to continue. With all but several hundred staffers forced out and funding stopped, the agency has “ceased to exist,” one official on the call said.\n\nThe Trump administration and billionaire ally Elon Musk, who is running a budget-cutting Department of Government Efficiency, have targeted USAID hardest so far in an unprecedented challenge of the federal government and many of its programs.\n\nThe administration told remaining USAID officials on Thursday afternoon that it planned to exempt 297 employees from global leave and furloughs ordered for at least 8,000 staffers and contractors, according to USAID staffers and officials.\n\nLate that night, a new list was finalized of 611 employees to remain on the job, many of them to manage the return home of thousands of staffers, contractors and their families abroad, the officials said. Justice Department lawyer, Brett Shumate, confirmed the 611 figure in court.\n\nThe USAID officials and staffers spoke on condition of anonymity due to a Trump administration order barring them from talking publicly.\n\nSome of the remaining staffers and contractors, along with an unknown number of 5,000 locally hired employees abroad, would run the few life-saving programs that the administration says it intends to keep going for now.\n\nIt was not immediately clear whether the reductions would be permanent or temporary, potentially allowing more workers to return after what the Trump administration says will be a review of which aid and development programs it wants to resume.\n\nTrump and Musk have spoken of moving surviving programs under the State Department.\n\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission."
    }
}