{
    "question": "What are the potential implications of Trump’s sanctions on the ICC over its Israel proceedings for the court’s investigations, U.S. relations with ICC member states, and norms of international accountability?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nThe court said on Friday that the move was an attempt to “harm its independent and impartial judicial work.\n\nFILE -A view of the International Criminal Court in The Hague, Netherlands, June 26, 2024. (AP Photo/Peter Dejong, File)\n\nPresident Donald Trump meets with Israel’s Prime Minister Benjamin Netanyahu in the Oval Office of the White House, Tuesday, Feb. 4, 2025, in Washington. (AP Photo/Evan Vucci)\n\nFILE -The Judges enter the International Court of Justice, or World Court, in The Hague, Netherlands, July 19, 2024. (AP Photo/Phil Nijhuis, File)\n\nExterior of the International Criminal Court in The Hague, Netherlands, June 26, 2024. (AP Photo/Peter Dejong, File)\n\n▶ Follow today’slive updates on the Trump administration\n\nWASHINGTON (AP) —President Donald Trumpsigned an executive order imposing sanctions on the International Criminal Court over investigations of Israel, a close U.S. ally.\n\nNeither the U.S. nor Israel is a member of or recognizes the court, which has issued anarrest warrant for Israeli Prime Minister Benjamin Netanyahufor alleged war crimes over hismilitary response in Gazaafter the Hamas attack against Israel in October 2023. Tens of thousands of Palestinians, including children, have been killed during the Israeli military’s response.\n\nThe order Trump signed Thursday accuses the ICC of engaging in “illegitimate and baseless actions targeting America and our close ally Israel” and of abusing its power by issuing “baseless arrest warrants” against Netanyahu and his former defense minister, Yoav Gallant.\n\n“The ICC has no jurisdiction over the United States or Israel,” the order states, adding that the court had set a “dangerous precedent” with its actions against both countries.\n\nTrump’s action came asNetanyahu was visiting Washington. He and Trump held talks Tuesday at the White House, and Netanyahu spent some of Thursday meeting with lawmakers on Capitol Hill.\n\nThe order says the U.S. will impose “tangible and significant consequences” on those responsible for the ICC’s “transgressions.” Actions may include blocking property and assets and not allowing ICC officials, employees and relatives to enter the United States.\n\nHuman rights activists said sanctioning court officials would have a chilling effect and run counter to U.S. interests in other conflict zones where the court is investigating.\n\n“Victims of human rights abuses around the world turn to the International Criminal Court when they have nowhere else to go, and President Trump’s executive order will make it harder for them to find justice,” said Charlie Hogle, staff attorney with American Civil Liberties Union’s National Security Project. “The order also raises serious First Amendment concerns because it puts people in the United States at risk of harsh penalties for helping the court identify and investigate atrocities committed anywhere, by anyone.”\n\nHogle said the order “is an attack on both accountability and free speech.”\n\n“You can disagree with the court and the way it operates, but this is beyond the pale,” Sarah Yager, Washington director of Human Rights Watch, said in an interview prior to the announcement.\n\nLike Israel, the U.S. is not among the court’s 124 members and has long harbored suspicions that a global court could arbitrarily prosecute U.S. officials. A 2002 law authorizes the Pentagon to liberate any American or U.S. ally held by the court. In 2020,Trump sanctionedchief prosecutor Karim Khan’s predecessor, Fatou Bensouda, over her decision to open an inquiry into war crimes committed by all sides, including the U.S., in Afghanistan.\n\nHowever, those sanctions were lifted under President Joe Biden, and the U.S. began to tepidly cooperate with the tribunal — especially after Khan in 2023 charged Russian President Vladimir Putin withwar crimes in Ukraine.\n\nDriving that turnaround was Sen. Lindsey Graham, R-S.C., who organized meetings in Washington, New York and Europe between Khan and GOP lawmakers who have been among the court’s fiercest critics.\n\nNow, Graham says he feels betrayed by Khan — and is vowing to crush the court as well as the economy of any country that tries to enforce the arrest warrant against Netanyahu.\n\n“This is a rogue court. This is a kangaroo court,” Graham said in an interview in December. “There are places where the court makes perfect sense. Russia is a failed state. People fall out of windows. But I never in my wildest dreams imagined they would go after Israel, which has one of the most independent legal systems on the planet.”\n\n“The legal theory they’re using against Israel has no limits and we’re next,” he added.\n\nBiden had called the warrants an abomination, and Trump’s national security adviser, Mike Waltz, has accused the court of having an antisemitic bias.\n\nAny sanctions could cripple the court by making it harder for its investigators to travel and by compromising U.S.-developed technology to safeguard evidence. The court last year suffered a major cyberattack that left employees unable to access files for weeks.\n\nSome European countries are pushing back. The Netherlands, in a statement late last year, called on other ICC members “to cooperate to mitigate risks of these possible sanctions, so that the court can continue to carry out its work and fulfil its mandate.”\n\nThe U.S. relationship with the ICC is a complicated one. The United States participated in negotiations that led to the adoption of the Rome Statute that established the court as a tribunal of last resort to prosecute the world’s worst atrocities — war crimes, crimes against humanity and genocide — if individual governments did not take action.\n\nThe U.S. voted against the Rome Statute in 1998. Then-U.S. President Bill Clinton signed the statute in 2000 but did not send the treaty to the U.S. Senate to be ratified.\n\nWhen George W. Bush became president in 2001, he effectively canceled the U.S. signature and led a campaign to pressure countries to enter bilateral agreements not to hand over Americans to the ICC.\n\nGoodman reported from Miami. AP U.N. Correspondent Edith M. Lederer contributed to this report.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Dozens of countries have expressed \"unwavering support\" for the International Criminal Court (ICC) after US President Donald Trump imposed sanctions on its staff.\n\nA majority of member states, including the UK, Germany and France, said that the ICC was \"a vital pillar of the international justice system\".\n\nTrump announced the sanctions after hosting Israel's Prime Minister Benjamin Netanyahu - the first foreign leader to visit him since returning to power.\n\nLast year, the ICC issued an arrest warrant for Netanyahu over alleged war crimes in Gaza - which Israel denies - as well as a Hamas commander. The US has condemned the court's \"shameful moral equivalency\" between Israel and Hamas.\n\nThe US and Israel do not recognise the authority of the ICC, the only global court with powers to prosecute individuals for genocide, crimes against humanity and war crimes. It has also previously launched investigations into US citizens.\n\nThe ICC counts 125 member states around the world, including the UK and many European nations.\n\nThe UK, France and Germany were among the 79 signatories to a joint statement issued on Friday to condemn Trump's executive order. Australia, the Czech Republic, Hungary and Italy were among the absent.\n\nEarlier on Friday, the ICC had called on its member states and global civil society to \"stand united for justice and fundamental human rights.\"\n\nIt pledged to continue \"providing justice and hope to millions of innocent victims of atrocities across the world\".\n\nThe ICC last year issued arrest warrants for US-allied Israeli leaders, and a Hamas commander, over the war in Gaza.\n\nICC prosecutors have said there are \"reasonable grounds\" to suggest Netanyahu, his former defence minister Yoav Gallant, andHamas's Mohammed Deif - who was killed last year- bear \"criminal responsibility for alleged war crimes and crimes against humanity\".\n\nBut a White House memo circulated on Thursday accused the ICC of creating a \"shameful moral equivalency\" between Hamas and Israel by issuing the warrants at the same time.\n\nTrump's order said the ICC's recent actions \"set a dangerous precedent\" which threatened to  \"infringe upon the sovereignty of the United States\". It argued the ICC \"undermines\" the national security and foreign policy work of Washington and its allies.\n\nThe order also said the US and Israel \"are thriving democracies with militaries that strictly adhere to the laws of war\".\n\nThe sanctions were announced while Netanyahu was on a visit to Washington.\n\nThe list of affected individuals has not yet been announced, but the sanctions could target people who work in ICC investigations. Sanctions could include financial and visa restrictions placed on individuals and their families.\n\nThe court's technical and IT operations - including evidence gathering - could also be affected. Observers have voiced fears that victims of alleged atrocities may hesitate to testify.\n\nThe court's inaugural chief prosecutor has told the BBC how the rest of the world responds will be most important.\n\n\"It's a challenge for the all the state parties - for all Europe, UK, South Africa, Argentina, Brazil, Japan, New Zealand, Australia - are they going to let Mr Trump to become the global president?\" Luis Moreno Ocampo told the BBC Newshour programme.\n\nThe UN has called for the measure to be reversed, while European Commission President Ursula von der Leyen said the ICC \"must be able to freely pursue the fight against global impunity\".\n\nBut Israeli Foreign Minister Gideon Saar said he \"strongly\" commended Trump's executive order.\n\nHe claimed the ICC's actions were \"immoral and have no legal basis\", accusing the court of not operating \"in accordance with international law\".\n\nThe US has repeatedly rejected any ICC jurisdiction over American officials or citizens, and has accused the court of placing constraints on Israel's right to self-defence, while ignoring Iran and anti-Israel groups.\n\nDuring his first term in office, Trump imposed sanctions on ICC officials who were investigating whether US forces had committed war crimes in Afghanistan.\n\nThis includeda travel ban and asset freezes against former chief prosecutor Fatou Bensouda.\n\nThose sanctions were lifted by President Joe Biden's administration.\n\nBut during his last weeks in office, Biden also criticised the ICC's warrant for Netanyahu, calling the move \"outrageous\" and saying there was no equivalence between Israel and Hamas.\n\nIn response to efforts to what they described as attempts to challenge the ICC's authority, nine nations - including South Africa and Malaysia - launched the Hague Group last month in an effort to defend the court and its rulings.\n\nTrump's signing of his latest executive order follows his announcement ofa plan for the US to \"take over\" Gaza, resettle its Palestinian population and turn the territory into the \"Riviera of the Middle East\".\n\nAfter Arab leaders and the UN condemned the idea,the US president restated iton his Truth Social social media platform on Thursday.\n\nIn recent years, the court has issued arrest warrants for Russian President Vladimir Putin over alleged war crimes in Ukraine, Taliban leaders for \"persecuting Afghan girls and women\" andMyanmar's military leader for crimes against the Rohingya Muslims.\n\nFollow the twists and turns of Trump's second presidential term with North America correspondent Anthony Zurcher's weeklyUS Politics Unspunnewsletter. Readers in the UK cansign up here. Those outside the UK cansign up here.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nThe US military is preparing to activate troops as part of Trump's crackdown on street crime.\n\nIsrael says it targeted correspondent Anas al-Sharif, accusing him of leading a Hamas cell, which Al Jazeera denies.\n\nIsrael said it targeted well known reporter Anas al-Sharif and alleged he was part of Hamas, which Al Jazeera has denied.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.",
        "source_3": "Former IDF soldier Daniel Flesch breaks down President Donald Trump's plans to sign an executive order sanctioning the International Criminal Court on 'America Reports.'\n\nJERUSALEM - PresidentDonald Trump's executive order sanctioning the Hague-based International Criminal Court (ICC) will prevent a slippery slope of U.S. military and government officials facing prosecution from a nebulous judicial bureaucracy in the Netherlands, argue critics of the global criminal body.\n\nRichard Goldberg, a former Trump official who served on his first National Security Council, told Fox News Digital, \"This is a critical first step in defending American soldiers and officials from further lawfare illegitimately waged by radical anti-Americans at what’s become an international kangaroo court. Israel may be in the news today, but tomorrow it will be the Americans who are still being wrongfully investigated by the court for supposed war crimes in Afghanistan.\"\n\nGoldberg, a senior adviser at the Foundation for Defense of Democracies, added, \"These ICC officials have crossed a line, they have entered the battlefield against the United States and Israel by perverting international law and using it as a tool of warfare. The president has preserved an escalation ladder here, too. These sanctions only apply to officials and service providers, not to the court itself. We could absolutely go the next step and shut down the court if this lawfare isn’t terminated.\"\n\nTRUMP-NETANYAHU MEETING: RADICAL PROTESTS WAVE APPARENT HAMAS FLAG OUTSIDE WHITE HOUSE\n\nA general view of the International Criminal Court building in The Hague, Netherlands, on April 30, 2024.(Selman Aksunger/Anadolu via Getty Images)\n\nThe ICC fired back in a statement and said it \"condemns the issuance by the U.S. of an Executive Order seeking to impose sanctions on its officials and harm its independent and impartial judicial work. The Court stands firmly by its personnel and pledges to continue providing justice and hope to millions of innocent victims of atrocities across the world, in all Situations before it. We call on our 125 States Parties, civil society and all nations of the world to stand united for justice and fundamental human rights.\"\n\nTrump signed theexecutive order punishing the ICCon Thursday in response to its May 2024 arrest warrant for Israeli Prime Minister Benjamin Netanyahu and Israel's former Defense Minister Yoav Gallant.\n\nNetanyahu praised the order in a statement. \"Thank you, President Trump for your bold ICC Executive Order. It will defend America and Israel from the anti-American and antisemetic corrupt court that has no jurisdiction or basis to engage in lawfare against us. The ICC waged a ruthless campaign against Israel as a trial run for action against America. President Trump's Executive Order protects the sovereignty of both countries and its brave soldiers.\"\n\nThe ICC is reportedly still investigating U.S. citizens for war crimes committed in Afghanistan.(AP)\n\nHungarian Foreign Minister Peter Szijjarto said on Friday that Trump’s sanctions on the ICC are \"absolutely understandable.\" He added the ICC has become \"a biased political tool\" and that the central European country was evaluating its cooperation with the ICC.\n\n‘LEVEL IT’: TRUMP SAYS US WILL ‘TAKE OVER’ GAZA STRIP, REBUILD IT TO STABILIZE MIDDLE EAST\n\nPresident Donald Trump, right, and Israeli Prime Minister Benjamin Netanyahu answer questions during a joint press conference in the East Room at the White House in Washington, D.C., on Feb. 4, 2025.( REUTERS/Leah Millis)\n\nDozens of countries expressed their \"unwavering support\" for the ICC on Friday, a day after Trump authorized potentially far-reaching economic and travel sanctions against the court's staff.\n\n\"We reaffirm our continued and unwavering support for the independence, impartiality and integrity of the ICC,\" a group of almost 80 countries said in a joint statement. \"The court serves as a vital pillar of the international justice system by ensuring accountability for the most serious international crimes, and justice for victims.\"\n\nThe signatories came from all parts of the world but make up only about two-thirds of the 125 member states of thepermanent courtfor the prosecution of war crimes, crimes against humanity, genocide and crimes of aggression.\n\nAmong the countries who agreed to the statement were France, Germany and Britain. Among those absent were Australia, the Czech Republic, Hungary and Italy.\n\nGoldberg said that \"The president wasn’t going to wait around on Schumer’s games to act. The minute Senate Democrats blocked the bill it was a guarantee you would see an executive order follow. But if Schumer now says he supports the order, Senate Republicans should move quickly to codify it and force Schumer back to a vote.\"\n\nSenate Minority Leader Sen. Chuck Schumer,D-NY., torpedoed a GOP-led bill to sanction the ICC in January.\n\nReuters and Fox News' Diana Stancy contributed to this article\n\nBenjamin Weinthal reports onIsrael,Iran,Syria,TurkeyandEurope.You can follow Benjamin on Twitter @BenWeinthal, and email him at benjamin.weinthal@fox.com\n\nFox News' Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.\"\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}