{
    "question": "How should the reported arrest figures and nationwide protests be weighed when assessing how drastic President Trump’s deportation push is, and what might that signal for immigration policy and affected communities in the months ahead?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nThe first flight of deportees from the United States arrived in Colombia on Tuesday following a stand-off between the two nations over the weekend.\n\nA flight carrying migrants deported from the United States arrived in Guatemala on Monday. (AP/ Santiago Billy)\n\nMigrants make their way to a Border Patrol van after crossing illegally and waiting to apply for asylum between two border walls separating Mexico and the United States, Tuesday, Jan. 21, 2025, in San Diego. (AP Photo/Gregory Bull)\n\nA group of migrants wait to be processed between two border walls separating Mexico and the United States after crossing illegally before dawn Tuesday, Jan. 21, 2025, in San Diego. (AP Photo/Gregory Bull)\n\nA group of people react as they see that their appointments were canceled on the U.S. Customs and Border Protection (CBP) One app, as they arrive at the border crossing in Tijuana, Mexico on Monday, Jan. 20. 2025. (AP Photo/Gregory Bull)\n\nColombian migrants deported from the United States wait inside El Dorado airport after arriving in Bogota, Colombia, Tuesday, Jan. 28, 2025. (AP Photo/Fernando Vergara)\n\nColombian migrants deported from the United States arrive at El Dorado airport in Bogota, Colombia, Tuesday, Jan. 28, 2025. (AP Photo/Fernando Vergara)\n\nU.S. Immigration and Customs Enforcement officers use a chain to more comfortably restrain a detained person using handcuffs positioned in front, Monday, Jan. 27, 2025, in Silver Spring, Md. (AP Photo/Alex Brandon)\n\nA Border Patrol agent walks past four men detained after crossing the border illegally in a gap in two walls separating Mexico from the United States before turning themselves in, Thursday, Jan. 23, 2025, in San Diego. (AP Photo/Gregory Bull)\n\nWorkers begin the installation of a temporary shelter for possible deportees from the United States, in Ciudad Juarez, Mexico, Wednesday, Jan. 22, 2025. (AP Photo/Christian Chavez)\n\nMigrants walk into Mexico after being deported from the U.S. at El Chaparral pedestrian border bridge in Tijuana, Mexico, Tuesday, Jan. 21, 2025. (AP Photo/Felix Marquez)\n\nVenezuelan migrants Daniela Medina, right, and Oldris Rodriguez hug in celebration after entering the United States from Ciudad Juarez, Mexico through the Paso del Norte bridge, Monday, Jan. 20, 2025 in El Paso, Texas. (AP Photo/Andres Leighton)\n\nA U.S. military plane carrying Guatemalan migrants deported from the United States sits on the tarmac at La Aurora airport in Guatemala City, Monday, Jan. 27, 2025. (AP Photo/Moises Castillo)\n\nU.S. Immigration and Customs Enforcement officers wait to detain a person, Monday, Jan. 27, 2025, in Silver Spring, Md. (AP Photo/Alex Brandon)\n\nA Colombian Red Cross worker speaks with a Colombian migrant who was deported from the United States, upon arrival at El Dorado Airport in Bogota, Colombia, Tuesday, Jan. 28, 2025. (AP Photo/Fenando Vergara)\n\nColombian migrants deported from the United States sit inside El Dorado airport after their arrival to Bogota, Colombia, Tuesday, Jan. 28, 2025. (AP Photo/Fernando Vergara)\n\nThis photo provided by the U.S. Dept. of Defense, A U.S. Customs and Border Protection agent watches as undocumented immigrants are loaded onto a C-17 Globemaster III at Tucson International Airport in Tucson, Ariz., Thursday, Jan. 23, 2025. (Senior Airman Devlin Bishop/Dept. of Defense via AP)\n\nSAN DIEGO (AP) — During his first week in office, President Donald Trump signed 10 executive orders on immigration and issued a slew of edicts to carry out promises of mass deportations andborder security.\n\nSomeactions were felt immediately. Others face legal challenges. Some may take years to happen, if ever, but have generated fear in immigrant communities.\n\nMuch of what Trump can do will boil down to money. Congress is expected to consider additional support soon. Trump may use emergency powers totap the Defense Department, as he did for a border wall in his first term.\n\nHere’s a look at how immigration policy has changed so far under Trump and what hasn’t happened yet:\n\n▶ Stay up to date with the latest U.S. news by signing up to our WhatsApp channel.\n\nU.S. Immigration and Customs Enforcement said it made an average of 710 immigration arrests daily from Thursday through Monday, up from a daily average of 311 in a 12-month period through September under President Joe Biden. If that rate holds, it would surpass ICE’s previous high mark set in the Obama administration, when daily arrests averaged 636 in 2013.\n\nICE averaged 376 arrests a day in the government’s four fiscal years that align most closely with the first Trump administration, from 2017 to 2020.\n\nNumbers spiked starting Sunday and included highly publicized operations, including in Atlanta, Dallas and,most prominently, Chicago.\n\nThe Trump administration has highlighted participation of other agencies in ICE operations, a departure from Biden. They include the FBI, Drug Enforcement Administration, Bureau of Alcohol, Tobacco, Firearms and Explosives — all part of the Justice Department — and the Homeland Security Department’s Customs and Border Protection, which includes the Border Patrol.\n\nEmile Bove, the acting deputy attorney general, observed arrests in Chicago on Sunday in a sign of the Justice Department’s growing involvement.\n\nTrump expanded arrest priorities to anyone in the country illegally, not just people with criminal convictions, public safety or national security threats and migrants stopped at the border. Still, some said it was business as usual for ICE — at least so far.\n\n“There’s nothing unique about it,” said Andrew Arthur, a former immigration judge and a fellow at the Center for Immigration Studies, a research and advocacy group that favors immigration restrictions.\n\nHe anticipates more enforcement in next few weeks and believes Congress will approve funding for up to 80,000 beds, about double the current level. ICE needs the space to hold people while any legal proceedings play out and while it arranges deportations.\n\nICE hasn’t said how many people it has deported since Trump took office gain, but the administration has highlighted removal flights, including the use of military planes.\n\nUnder Biden, ICE deported more than 270,000 people in a 12-month period that ended in September. That was thehighest annual tally in a decade, helped by an increase in deportation flights. The Biden administration did not use military planes.\n\nIn an episode that may signal more hardball diplomacy with governments that resist or refuse to take back their citizens, Trump said Sunday that he would raise tariffs 25% on Colombia after President Gustavo Petro refused to let two military planes land with deportees. Trump put the tariffs measures on hold afterPetro backed down.\n\nA C-27 military transport plane landed Monday in Guatemala, with 64 deportees in shackles and handcuffs. “It’s my first attempt of the year and I don’t know if I will try again because it’s hard,” said Jacobo Dueñas, 38, who was arrested Friday on the Texas border.\n\nThe Trump administration made it easier for ICE to deport people without appearing before an immigration judge by expanding “expedited removal” authority nationwide for anyone in the country up to two years. The American Civil Liberties Union is challenging the fast-track deportations in court.\n\nThe administration ended a policy to avoid arrests at“sensitive locations,”including schools, hospitals and places of worship. It said it may deport people who entered the country legally on parole, a presidential authority that Biden usedmore than any president.\n\nIt also threatened to punish“sanctuary” jurisdictionsthat limit cooperation with federal immigration authorities.\n\nTrump ended use of a border app to allow migrants to enter the country on two-year permits with eligibility to work, canceling tens of thousands of appointments into early February for peoplestranded in Mexico. Nearly 1 million people entered the U.S. at land crossings with Mexico by usingthe CBP One app.\n\nTrump also ended a policy that allowedmore than 500,000 peoplefrom Cuba, Haiti, Nicaragua and Venezuela to fly to the country on two-year permits if they had a financial sponsor.\n\nOther actions will take time to play out. Trump secured Mexico’s approval to reinstate a hallmark policy of his first term,“Remain in Mexico,”which requires asylum-seekers to wait in Mexico for hearings in U.S. immigration court.\n\nThe Pentagon begandeploying 1,500 active-duty troopsto the border last week but it was unclear if they will break from supporting roles they have played under presidents since George W. Bush, including ground and aerial surveillance, building barriers and repairing vehicles.\n\nAn 1878 law prohibits military involvement in civilian law enforcement, but Trump and his aides have signaled he may invoke wartime powers. Trump said in his order that the Defense Department can assist with detention and transportation.\n\nTrumpstopped resettling refugeeswho are vetted abroad before entering the United States until further review, a program that he largely dismantled in his first term and was resurrected under Biden. Groups that provide temporary housing, job training and other support said the State Department told them Friday to stop work immediately.\n\nThe Justice Department also told legal aid groups to stop work on federal programs that help people in immigration courts and detention centers navigate complex laws.\n\nTrump said he was ending automatic citizenship for children born on U.S. soil, a precedent established by constitutional amendment in 1868. A federal judge in Seattlehas put it on hold.\n\nAssociated Press writers Sonia Pérez D. in Guatemala City and Gisela Salomon in Miami contributed.\n\nThe number of deportees on the C-27 military transport plane that landed Monday in Guatemala has been corrected to 64, instead of 80.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Since President Donald Trump took office for the second time, federal immigration authorities began carrying out a blitz of high-profile arrests and deportations.\n\n\"Here in New York City this morning we are getting the dirtbags off these streets,\" Homeland Security Secretary Kristi Noem said in New York while overseeing the apprehension of immigrants accused of crimes.\n\nArrests of undocumented immigrants have been happening for years across administrations, usually off camera.\n\nScripps News compiled data from Immigration and Customs Enforcement and found that over 10 years, ICE took into custody an average of 350 migrants a day.\n\nRELATED STORY |Truth Be Told: Trump is not the first president to send troops to border\n\nDuring President Trump's first days in office, the pace has picked up to more than 791 arrests each day — with many more to come according to Tom Homan, the president's border czar.\n\n\"I think success is removing every criminal gang member out of this country, every public safety, threat, illegal alien,\" Homan said.\n\nAside from arrests, deportations were also common before Trump took office.\n\nICE removed 271,484 noncitizens in 2024, including 3,706 known or suspected gang members and 237 known or suspected terrorists.\n\nUnder Trump, the federal government has started using military planes for deportations.\n\nRELATED STORY |Truth Be Told: Why some government employees can work from home until 2029\n\nThe Department of Homeland Security has not shared detailed information about who has been deported in recent days, but it is not just those with criminal rap sheets.\n\nNone of the 200 unauthorized immigrants sent to Colombia were criminals, a Colombian official said.\n\nIn another break from previous administrations, the Trump team is using images and videos of enforcement to send a message encouraging immigrants to leave voluntarily.\n\n\"One thing to keep in mind is that fear and anxiety and chaos are also tools of the mass deportation agenda,\" said Jennifer Koh, associate law professor at Pepperdine University's Caruso School of Law.\n\nIn previous years, ICE had prioritized deporting migrants with criminal convictions and charges. However, White House Press Secretary Karoline Leavitt said anyone in the country without documentation would now be considered a criminal and could face deportation.",
        "source_3": "PresidentDonald Trump’s“largest-ever”mass deportationhas led to the arrests of thousands ofillegal immigrantsin the first 10 days of his presidency, but the new administration has a ways to go if it intends to surpass the Obama administration’s massive first-term figures.\n\nThe operation started on Day One, Jan. 20, with arrests of illegal immigrants across the nation, and it has quickly ramped up since then. It topped 2,300 arrests in the first week, reaching approximately 5,500 in 10 days.\n\nTrump and Vice President JD Vance have touted plans to start arresting and deporting the 500,000 to 1 million illegal immigrants with criminal records.\n\nIn addition to criminals, the Trump-Vance administration wants to remove the people who have already been ordered by a federal immigration judge to be removed.\n\nAt last count, roughly1.4 millionpeople have been ordered deported and are still in the U.S., according to a November report by Fox News.\n\n“The numbers that they’re putting up are historic, but it’s also a lot less than the target number would be if this is the largest-ever or the most significant ever,” said a senior administration official with firsthand knowledge of the operation, who asked to speak on the condition of anonymity. “If they want to get to a meaningful number by the end of the calendar year, they have to scale up more.”\n\nThe same official said the arrest figures as of late have been “historic” and trending at two to three times the average number of arrests seen during the Biden administration and first Trump administration.\n\n“If I’mCaleb Vitelloor Tom Homan or other people that are in the know, you’re thinking, ‘The numbers are great. I love that we’re back in business, but they’re not good enough to meet what the expectations were,’” said the administration official.\n\nICE arrests under Biden between fiscal 2021 and 2024 ranged from an average of 200 to 470 per day, depending on the year. A total of 500,000 arrests occurred in that period.\n\nDuring Trump’s first term in office from 2017 to 2020, daily arrests ranged from 280 to 440 for a total of 548,000 arrests in four years.\n\nBut it was during the Obama administration that arrests were highest, according to the oldest available data obtained by theWashington Examiner.\n\nDuring former President Barack Obama’s eight years in office, Immigration and Customs Enforcement arrested an average of 882 illegal immigrants per day in 2011, the highest of his eight years in office. That year, more than 311,000 immigrants were arrested.\n\nIn Obama’s second term, more than 641,000 arrests occurred.\n\nIn all, more than 1.2 million people were arrested from 2009 to 2012.\n\nAt Trump’s present rate, he would finish the calendar year with 200,000 arrests. If he sustained that pace over four years, he would still fall short of coming anywhere close to Obama’s 1.2 million arrests over four years.\n\nICE is making arrests by getting people directly from local jails, where it has requested certain inmates be turned over, as well as going after specific people within communities.\n\nThe challenge is that ICE is limited in some “sanctuary” jurisdictions from getting illegal immigrants in jail handed over to them.\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nThe Biden administration stopped worksite enforcement operations, or going into job sites that had failed to respond to audits of workers.\n\nIf Trump restarted those operations, ICE could make hundreds more arrests per day, but it could come at a political price, angering some in the public who see hardworking immigrants as the victims."
    }
}