{
    "question": "What are the potential humanitarian, diplomatic, and strategic consequences of the U.S. withdrawing from the U.N. Human Rights Council and prohibiting future funding for UNRWA?",
    "content": {
        "source_1": "The actions come one day before Trump is set to meet with Israeli Prime Minister Benjamin Netanyahu in Washington.\n\nThe actions, which reinstate policies in place during the last Trump administration, come one day before the president is set to meet with Israeli Prime Minister Benjamin Netanyahu in Washington. | Ben Curtis/AP\n\nPresident Donald Trump is expected to issue an executive order on Tuesday withdrawing the U.S. from the U.N. Human Rights Council and prohibiting future funding for the U.N. relief agency for Gaza, according to a document obtained by POLITICO.\n\nThe actions, whichreinstate policies in placeduring the last Trump administration, will come on the day the president is set to meet with Israeli Prime Minister Benjamin Netanyahu in Washington. The U.S. has long accused the council of bias against Israel and of giving cover to governments with human rights abuses. It comes after the Biden administration paused funding to United Nations Relief and Works Agency for Palestine Refugees in the Near East, known as UNRWA,following reports thatstaffers were involved in the Oct. 7 attack by Hamas on Israel.\n\nA White House official said Monday afternoon that the executive order signing had been moved to Tuesday.\n\nIt also comes as the Trump administration has put the future of the United States Agency for International Development — which also promotes human rights abroad — into question over concerns whether it aligns with the president’s “America First” policy and how its dollars are being spent.\n\nUNRWA is the main agency providing aid for Gaza’s population amid the humanitarian disaster caused by Israel’s offensive in the area after the Oct. 7 attack. But the U.N.fired several staffers last summerafter an internal investigation found they may have been involved in the attack.\n\nIt’s also the next chapter in the country’s complicated, back-and-forth relationship with the U.N. Human Rights Council, which was created during the George W. Bush administration. Under Presidents Barack Obama and Joe Biden, the U.S. engaged with the council; under Bush and Trump, it did not.\n\nA spokesperson for the United Nations declined to comment.\n\nThe White House, in a fact sheet obtained by POLITICO, said the council “has not fulfilled its purpose and continues to be used as a protective body for countries committing horrific human rights violations” and condemned its stance on Israel.\n\n“The UNHRC has demonstrated consistent bias against Israel, focusing on it unfairly and disproportionately in council proceedings,” the document says. “In 2018, the year President Trump withdrew from the UNHRC in his first administration, the organization passed more resolutions condemning Israel than Syria, Iran, and North Korea combined.”\n\nBut human rights organizations and some lawmakers argue that the Human Rights Council is an important, if flawed, entity in policing human rights abuses across the globe. UNRWA, meanwhile, was founded to support displaced Palestinians and has played a key role amid the ongoing conflict in supporting people in Gaza.\n\nThe executive order will also require Secretary of State Marco Rubio to review and report to the White House which international organizations, conventions, or treaties that “promote radical or anti-American sentiment,” with a particular focus on UNESCO, the U.N. Educational, Scientific and Cultural Organization. The U.S. officially withdrew fromthe latter organization in 2019, also citing an anti-Israel bias.\n\nThe president’s actions come amid Rep.Elise Stefanik(R-N.Y.)’s pending confirmation as ambassador to the United Nations. During her confirmation hearing last month, Stefanik said she would focus on reforming the U.N. system and ensuring that U.S. funding is “going to programs through the U.N. that work, that have a basis in the rule of law, that have a basis in transparency and accountability, and strengthen our national security and our partnerships.”\n\nShe also specifically called out UNRWA, saying it turned a blind eye to local workers’ ties to Hamas.",
        "source_2": "Reporting by Jeff Mason and Kanishka Singh in Washington and Michelle Nichols in New York; Additional reporting by Emma Farge in Geneva; Editing by Leslie Adler\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nJeff Mason is a White House Correspondent for Reuters. He has covered the presidencies of Barack Obama, Donald Trump and Joe Biden and the presidential campaigns of Biden, Trump, Obama, Hillary Clinton and John McCain. He served as president of the White House Correspondents’ Association in 2016-2017, leading the press corps in advocating for press freedom in the early days of the Trump administration. His and the WHCA's work was recognized with Deutsche Welle's \"Freedom of Speech Award.\" Jeff has asked pointed questions of domestic and foreign leaders, including Russian President Vladimir Putin and North Korea's Kim Jong Un. He is a winner of the WHCA's “Excellence in Presidential News Coverage Under Deadline Pressure\" award and co-winner of the Association for Business Journalists' \"Breaking News\" award. Jeff began his career in Frankfurt, Germany as a business reporter before being posted to Brussels, Belgium, where he covered the European Union. Jeff appears regularly on television and radio and teaches political journalism at Georgetown University. He is a graduate of Northwestern University's Medill School of Journalism and a former Fulbright scholar.",
        "source_3": "PresidentDonald Trumpwill sign an executive order withdrawing the United States from the United Nations Human Rights Council and prohibiting future funding for the U.N. relief agency forGazaknown as UNRWA, a White House source told theWashington Examiner.\n\nThe executive order reinstates policies that Trump had in place during his first administration, though the Middle East looks vastly different than when he left the White House. It also comes a day before he’s set to meet with Israeli Prime MinisterBenjamin Netanyahu.\n\nUNRWA serves as the primary support system for the more than 2 million Palestinians in Gaza affected by the war, which has gone on for more than 15 months, but Israel has banned the entity from operating within its borders over allegations that several members of the U.N. agency participated in the Oct. 7, 2023, terrorist attack; the worst in Israel’s history.\n\nA high-level investigation by the United Nations Office of Internal Oversight Services in 2024 found that nine employees participated in the Oct. 7 attacks, and they did not find sufficient evidence against a further 10 individuals whom the Israeli government accused of playing a role.\n\nELISE STEFANIK, ISRAEL, AND THE ‘ANTISEMITIC ROT’ AT THE UN\n\nIsrael and the United Nations have a historically rocky relationship, and it worsened significantly after Hamas’s attack.\n\nRep. Elise Stefanik (R-NY), Trump’s pick to be the U.S. ambassador to the United Nations, praised the president’s decision on social media.\n\n“Today’s Executive Order is the correct action by President Trump to deliver America First peace through strength moral leadership,” she said. “The UN Human Rights Council is a den of human rights abusers and disgraceful and obsessive antisemitism. UNRWA must be defunded and dismantled. U.S. taxpayers dollars should NEVER prop up terrorism. Full stop.”\n\nThe U.N. Human Rights Council was created during the George W. Bush administration, but he and Trump, in his first term, did not engage with it, whereas, Under Presidents Barack Obama and Joe Biden, they did.\n\nThe White House said in a fact sheet the council “has not fulfilled its purpose and continues to be used as a protective body for countries committing horrific human rights violations” and condemned its stance on Israel, according toPolitico.\n\n“The UNHRC has demonstrated consistent bias against Israel, focusing on it unfairly and disproportionately in council proceedings,” the document added. “In 2018, the year President Trump withdrew from the UNHRC in his first administration, the organization passed more resolutions condemning Israel than Syria, Iran, and North Korea combined.”\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nTrump’s executive order also comes as his administration has halted the work of the United States Agency for International Development, which promotes human rights abroad, calling into question whether it will remain at all.\n\n“It’s been run by a bunch of radical lunatics, and we’re getting them out,” Trump told reporters on Sunday, while Department of Government Efficiency leaderElon Muskannounced his plan to shut the agency down.\n\nEDITOR’S NOTE: This article initially said President Donald Trump had signed the executive order. He is expected to sign it shortly. TheWashington Examinerregrets the error."
    }
}