{
    "question": "How might shutting down USAID and relocating its remaining functions to the State Department influence the effectiveness, oversight, and global perception of U.S. foreign aid and diplomacy?",
    "content": {
        "source_1": "Elon Musk said President Donald Trump agreed the US Agency for International Development needs to be “shut down,” following days of speculation over the future of the agency after its funding was frozen anddozens of its employees were put on leave.\n\n“With regards to the USAID stuff, I went over it with (the president) in detail and he agreed that we should shut it down,” Musk said in a X Spaces conversation early Monday.\n\nMusk said he checked with Trump “a few times” and Trump confirmed he wants to shut down the agency, which dispenses billions in humanitarian aid and development funding annually. CNN has reached out to the White House and USAID for comment.\n\nSunday evening, before the X Spaces conversation, when asked for comment on USAID, Trump told reporters: “It’s been run by a bunch of radical lunatics, and we’re getting them out, and then we’ll make a decision” on its future.\n\nMusk’s comments come after two top security officials at USAID were put on administrative leave Saturday night for refusing members of the Department of Government Efficiency access to systems at the agency, even when DOGE personnel threatened to call law enforcement, multiple sources familiar with the situation told CNN.\n\nAround 60 senior USAID staff were put on leave last week on accusations of attempting to circumvent Trump’s executive order to freeze foreign aid for 90 days. Another senior official was put on leave for trying to reverse that move after finding no evidence of wrongdoing.\n\nIn the X Spaces conversation early Monday, which he co-hosted with Republican Sen. Joni Ernst of Iowa and Vivek Ramaswamy – who was initially named co-chair of DOGE with Musk but has since left – the X owner called USAID “incredibly politically partisan” and said it has been supporting “radically left causes throughout the world including things that are anti-American.”\n\nlive updatesTrump signs tariffs on top trade partners as he enacts ‘America First’ agenda\n\nMusk said USAID is “beyond repair,” among other attacks he made against the agency created by Congress as an independent body.\n\nWe don’t have “an apple with a worm in it,” he said. “We have a ball of worms.”\n\nUSAID was established in 1961 under President John F. Kennedy’s administration and is the US government’s humanitarian arm. It dispenses billions of dollars annually across the world in an effort to alleviate poverty, treat diseases, and respond to famines and natural disasters. It also promotes democracy building and development by supporting non-government organizations, independent media and social initiatives.\n\nUSAID is a key soft power tool of the US to foster relations with communities around the world, officials say, noting that US national security is approached with the “three D” pillars: defense, diplomacy and development, led, respectively, by the Defense Department, State Department and USAID.\n\nAccording to sources, personnel from the Musk-created office first physically tried to access the USAID headquarters in Washington, DC, and were stopped. The DOGE personnel demanded to be let in and threatened to call US Marshals to be allowed access, two of the sources said.\n\nThe DOGE personnel wanted to gain access to USAID security systems and personnel files, three sources said. Two of those sources also said the DOGE personnel wanted access to classified information, which only those with security clearances and a specific need to know are able to access.\n\nThree sources told CNN that in the end, the DOGE personnel were eventually able to access the headquarters.\n\nThe incident, which had not been previously reported, is thelatest showdownas the Trump-affiliated DOGE seeks to exert increasing authority over the federal government as it aims to slash spending.\n\nIn a letter to Secretary of State Marco Rubio Sunday, Democratic members of the US Senate Foreign Relations Committee requested “an immediate update about the access of USAID’s headquarters, including whether the individuals who accessed the headquarters were authorized to be there and by whom.”\n\n“The potential access of sensitive, even classified, files, which may include the personally identifiable information (PII) of Americans working with USAID, and this incident as a whole, raises deep concerns about the protection and safeguarding of matters related to U.S. national security,” the letter said.\n\nThe Senators also wrote that “any effort to merge or fold USAID into the Department of State should be, and by law must be, previewed, discussed and approved by Congress.\n\nKatie Miller, whom Trump named to DOGE in December, on Sunday appeared to confirm that DOGE personnel had accessed classified information.\n\n“No classified material was accessed without proper security clearances,” she posted on X.\n\nOn Sunday, in response to CNN’s report about the incident, Musk said that “USAID is a criminal organization.”\n\nRelated articleUSAID website goes offline amid Trump administration’s freeze on foreign aid\n\nOther top Trump officials, such as Stephen Miller, who serves as deputy chief of staff for policy at the White House, have also taken aim at USAID, accusing its workforce of being overwhelmingly Democrats.\n\nOn Saturday, USAID’s website went dark and a new page for the agency appeared on the State Department website. USAID’s X account also went offline Saturday.\n\nA source told CNN that the entire USAID public affairs office was put on leave and locked out of their systems.\n\nShortly after being sworn in last month, Trump issued asweeping executive orderpausing all foreign aid for 90 days, leading towidespread confusion, layoffs and program shutdowns.\n\nUSAID Director of Security John Voorhees and his deputy are among dozens of USAID officials who have been put on leave amid fears that the agency is being intentionally dismantled — a move that some aid officials argue would have massive negative implications.\n\nAid officials argue the State Department isn’t equipped to take over and sustain USAID’s vast number of development projects. It would also erase, they argue, unique and essential soft power that can’t be replicated.\n\nThe State Department doesn’t “have the capacity, the expertise, the training to do that kind of work. It is a completely separate line of effort that is undertaken on the ground,” a former senior USAID official said.\n\n“The one element of the US government bureaucracy on the ground in foreign places that has been able to get out beyond the wire and actually have a deeper understanding of the places in which we work is USAID,” the former official continued, requesting anonymity due to growing and widespread fears of being targeted by the Trump administration.\n\n“That ability to work in that way, that culture — and it is a culture I think — gets lost. And with it, I think we lose an enormous, incredibly valuable tool of US foreign policy. We’re basically going to be punching with one arm behind our back,” the person said.\n\nThis story and headline have been updated with additional reporting.",
        "source_2": "Reporting by Jonathan Landay, Steve Holland and Daphne Psaledakis; Additional reporting by Patricia Zengerle and David Brunnstrom\nEditing by Humeyra Pamuk, Cynthia Osterman, Rosalba O'Brien and Himani Sarkar\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nDaphne Psaledakis is a foreign policy correspondent based in Washington, D.C., where she covers U.S. sanctions, Africa and the State Department. She has covered the rollout of U.S. sanctions on Russia after Moscow’s invasion of Ukraine, Washington’s efforts to enforce its sanctions and the U.S. response to the conflict in Ethiopia, among other issues. She previously covered European Union politics and energy and climate policy for Reuters in Brussels as part of an Overseas Press Club Foundation fellowship in 2019. Daphne holds a Bachelor of Journalism in Print and Digital News and a Bachelor of Arts in International Studies.",
        "source_3": "Thewebsiteof the US Agency for International Development (USAID) went offline Saturday evening amid reports that the Trump administration was preparing to curtail USAID's independence by placing it under the direct oversight of the State Department.\n\nAn error message on USAID's website read:\"This site can't be reached Check if there is a typo inwww.usaid.gov. DNS_PROBE_FINISHED_NXDOMAIN.\"\n\nTwo sources familiar with the transition toldReutersthat a major overhaul is expected in how Washington allocates US foreign aid, with USAID losing its independence and most likely coming under the control of the State Department.\n\nBy late Saturday, a new 'lite' page for USAID appeared on the State Department's website.\n\n\"Trump's been purging and intimidating USAID employees. Now there's a rumor he'll dissolve USAID as an independent agency,\" Senate Minority Leader Chuck Schumer wrote on X on Friday.\n\nTrump's been purging and intimidating USAID employees.Now there’s a rumor he'll dissolve USAID as an independent agency.It was created by JFK and established in law to further our national security and spread hope.This'd be illegal and against our national interests.\n\nTrump has made it very clear to Democrats and their Deep State counterparts that flooding taxpayer dollars into shady NGOs would be coming to an end under his 'America First' agenda.\n\n\"Monday Afternoon Massacre\": USAID Employees Placed On Leave For Allegedly Circumventing Trump's Ordershttps://t.co/CfMoclE462\n\nLast month, the Trump administration froze nearly all foreign aid programs amid efforts to overhaul the distribution of that aid.\n\nA post from Elon Musk's Department of Government Efficiency (DOGE) account on X clarified thatUSAID went on a woke spending spree in third-world countries...\n\nAt this point we need to end ALL foreign aid. Not a single American taxpayer cent should leave the country for a very very long time. It’s all money laundering.\n\nMusk responded \"True\" to Robby Starbuck's post aboutUSAID laundering taxpayer funds \"for Democrats in DC.\"And even explained how it worked:\n\nAnnnnd the USAid website is now down.Try it:https://t.co/lvZf3F02sp🔥🔥🔥pic.twitter.com/teB9WPVe6D\n\n\"Like I said before, USAID is a front for the CIA.  And together with NGO's like the Open Society Foundation, they have been using US tax dollars & govt resources as their personal piggy bank. It has been infuriating to watch. Hopefully now the whole truth will come out,\"journalist Lara Logan wrote on X.\n\nLike I said before, USAID is a front for the CIA. And together with NGO’s like the Open Society Foundation, they have been using US tax dollars & govt resources as their personal piggy bank. It has been infuriating to watch. Hopefully now the whole truth will come out.https://t.co/0eMqwBi3OR\n\nWhite House Deputy Chief of Staff for Policy Stephen Miller told CNN an uncomfortable truth:\"At USAID, 98% donated to Kamala Harris or other left-wing candidates.\"\n\nSTEPHEN MILLER: Overwhelmingly, the career federal service in this country is far-left.TAPPER: I don't know that's true.MILLER: At USAID, 98% donated to Kamala Harris or other left-wing candidates.TAPPER: You're demonizing an entire workforce.pic.twitter.com/IVLH8Qsy88\n\nFunding will soon dry up for NGOs and other entities that rely on USAID funds—some of which have been linked to furthering left-wing censorship efforts around the world and funding coups."
    }
}