{
    "question": "How might DOGE’s access to Treasury payment systems shape the administration of Social Security and Medicare payments, perceptions of political influence, and the balance between preventing fraud and ensuring uninterrupted benefits?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nElon Musk speaks at an indoor Presidential Inauguration parade event in Washington, Jan. 20, 2025. (AP Photo/Matt Rourke, File)\n\nWASHINGTON (AP) — TheDepartment of Government Efficiency,run by President Donald Trump’s billionaire adviser and Tesla CEO Elon Musk, has gained access to sensitive Treasury data including Social Security and Medicare customer payment systems, according to two people familiar with the situation.\n\nThe move by DOGE, a Trump administration task force assigned to find ways tofire federal workers, cut programs and slash federal regulations, means it could have wide leeway to access important taxpayer data, among other things.\n\nThe New York Times first reported the news of the group’s access of the massive federal payment system. The two people who spoke to The Associated Press spoke on condition of anonymity because they were not authorized to speak publicly.\n\nThe highest-ranking Democrat on the Senate Finance Committee, Ron Wyden of Oregon, on Friday sent a letter to Trump’s Treasury Secretary Scott Bessent expressing concern that “officials associated with Musk may have intended to access these payment systems to illegally withhold payments to any number of programs.”\n\n“To put it bluntly, these payment systems simply cannot fail, and any politically motivated meddling in them risks severe damage to our country and the economy,” Wyden said.\n\nThe news also comes after Treasury’s acting Deputy Secretary David Lebryk resigned from his position at Treasury after more than 30 years of service. The Washington Post on Friday reported that Lebryk resigned his position after Musk and his DOGE organization requested access to sensitive Treasury data.\n\n“The Fiscal Service performs some of the most vital functions in government,” Lebryk said in a letter to Treasury employees sent out Friday. “Our work may be unknown to most of the public, but that doesn’t mean it isn’t exceptionally important. I am grateful for having been able to work alongside some of the nation’s best and most talented operations staff.”\n\nThe letter did not mention a DOGE request to access Treasury payments.\n\nMusk on Saturday responded to a post on his social media platform X about the departure of Lebryk: “The @DOGE team discovered, among other things, that payment approval officers at Treasury were instructed always to approve payments, even to known fraudulent or terrorist groups. They literally never denied a payment in their entire career. Not even once.”\n\nDOGE was originally headed by Musk and former Republican presidential candidate Vivek Ramaswamy, who jointly vowed to cut billions from the federal budget and usher in “mass headcount reductions across the federal bureaucracy.”\n\nRamaswamy has sinceleft DOGE as he mulls a run for governor of Ohio.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "The Trump administration has given Elon Musk's deputies access to the federal payments system that controls the flow of trillions of dollars in funds every year, US media report.\n\nReports suggest members of Musk-led Department of Government Efficiency (Doge) - which is not a government department - have been granted access to a US Treasury Department system that includes sensitive information of millions of Americans.\n\nMeanwhile, two officials at the United States Agency for International Development (USAID)  were reportedly placed on leave after a standoff with Doge members over access.\n\nThe White House and the Treasury Department did not immediately respond to requests for comment.\n\nJust days after President Donald Trump announced its launch, Doge has fanned out to a number of US government agencies with the stated mission of slashing federal spending.\n\nMusk helped set up the team in order to carry out this effort, bringing allies from his private companies and Silicon Valley to assist the process.\n\nThose efforts appear to be causing turmoil within agencies like the Treasury Department and USAID, which the Tesla boss  has repeatedly attacked on social media.\n\nOn X, the social media platform he owns, the billionaire called USAID \"evil\" and claimed that Treasury employees \"are breaking the law every hour of every day\".\n\nThe Treasury division accessed by Doge handles payments of nearly $6 trillion for programmes like Social Security, pays government salaries, and distributes money allotted by Congress.\n\nThe access to the payment system was granted by incoming Treasury Secretary Scott Bessent on Friday,the same day when a longtime Treasury official named David Lebryk was placed on administrative leave and suddenly retired, the New York Times reported.\n\nThe newspaper said Mr Lebryk had strongly resisted allowing \"Musk's lieutenants into the department's payment system, which sends out money on behalf of the entire federal government\".\n\nTypically, only a handful of Treasury employees work on the payments system.\n\n\"To put it bluntly, these payment systems simply cannot fail, and any politically-motivated meddling in them risks severe damage to our country and the economy,\" US Senator Ron Wyden, a Democrat from Oregon, wrote in a letter to Bessent.\n\n\"I am concerned that mismanagement of these payment systems could threaten the full faith and credit of the United States,\" he wrote.\n\nMusk's allies are also causing turbulence at the USAID, which distributes billions in aid around the world. The agency's website has not worked since Saturday and its X account appears to have been deactivated.\n\nThe Trump administration reportedly placed two senior security officials on administrative leave after they resisted Doge team members who arrived at the agency seeking access to a secure facility, or a \"Scif\", the Washington Post reported on Sunday.\n\nSuch facilities are used to store and share highly classified information and are often highly restricted.\n\n\"No classified material was accessed without proper security clearances,\" Katie Miller, a spokesperson for Doge, wrote on X.\n\nMeanwhile, the federal workforce has been grappling with the multiple executive orders signed by Trump since taking office.\n\nEmployees have received letters from the Office of Personnel Management asking them to report their colleagues who are attempting to \"disguise\" diversity efforts, as well as an offer to take paid resignations -- an offer many employees view with suspicion.\n\nAgencies have scrambled topull down references to diversity, equity and inclusion, as well as transgender and LGBT individualsfrom their websites in order to comply with the  executive orders.\n\nA raft of such information has disappeared from the website for the Centers for Disease Control. The critical health agency serves as a repository for vetted, reliable scientific and medical information for researchers, medical professionals, and everyday Americans.\n\nNow, links to information about LGBT health for adults and minors, as well as mpox vaccines, lead to broken pages.\n\nDEI (diversity, equity and inclusion) programmes aim to promote participation in workplaces by people from a range of backgrounds.\n\nTheir backers say they address historical or ongoing discrimination and underrepresentation of certain groups, including racial minorities, but critics argue such programmes can themselves be discriminatory.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nThe US military is preparing to activate troops as part of Trump's crackdown on street crime.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.",
        "source_3": "Fox News senior national correspondent Rich Edson has the latest on the Senate confirmation hearings for President-elect Trump’s Cabinet nominees on ‘Special Report.’\n\nTech billionaire Elon Muskripped alleged \"fraudulent\" Treasury payments on Saturday as reports circulated that the Department of Government Efficiency has gained acces to the federal government's payment system as the second Trump administration continues cutting what they say is government fat and overspending.\n\n\"The @DOGE team discovered, among other things, that payment approval officers at Treasury were instructed always to approve payments, even to known fraudulent or terrorist groups. They literally never denied a payment in their entire career. Not even once,\" Musk, the chair of DOGE, posted early Saturday morning to X.\n\nMusk's post came just ahead of the New York Times reporting Saturday afternoon that Treasury Secretary Scott Bessent granted DOGE personnel access to the payment system. The Treasury spends roughly $6 trillion per year on payments for federal agencies.\n\nThe ranking Democrat on the Senate Finance Committee, Oregon Sen. Ron Wyden, posted to social media on Saturday that he has also been informed that DOGE was granted access to the system.\n\nDOGE ANNOUNCES MORE THAN $1B IN SAVINGS AFTER CANCELING 104 FEDERAL DEI CONTRACTS\n\nElon Musk is heading the Department of Government Efficiency.(Anna Moneymaker/Getty Images)\n\n\"Sources tell my office that Treasury Secretary Bessent has granted DOGE *full* access to this system. Social Security and Medicare benefits, grants, payments to government contractors, including those that compete directly with Musk's own companies. All of it,\" Wyden posted to social media site BlueSky on Saturday evening.\n\nDOGE's reported access to the payment system comes after the Washington Post reported on Friday that the former acting director of the Treasury, David A. Lebryk, was planning to exit the finance department of the federal government following a clash over granting DOGE access to its payment system. Lebryk oversaw the Treasury Department in the days betweenPresident Donald Trump's inaugurationon Jan. 20 and Bessent's confirmation to lead the department on Jan. 27.\n\nTOP DOGE LAWMAKER SAYS TRUMP ‘ALREADY RACKING UP WINS FOR TAXPAYERS’ WITH EFFICIENCY INITIATIVES\n\nOn Friday, reports also spread that civil servants within the Office of Personnel Management, which works as the federal government's HR department, were reportedly locked from the office's computer systems by DOGE.\n\nMusk quipped on X on Saturday that working over the weekend is a \"superpower,\" where the \"opposing team\" disappear for two days.\n\n\"Very few in the bureaucracy actually work the weekend, so it’s like the opposing team just leaves the field for 2 days! Working the weekend is a superpower,\" he posted.\n\n‘DOGE’-MEETS-CONGRESS: GOP LAWMAKER AARON BEAN LAUNCHES CAUCUS TO HELP MUSK ‘TAKE ON CRAZYTOWN’\n\nTrump officially created DOGE via an executive order signedon his first day in office. The EO outlines that government agency chiefs provide DOGE with access to internal government platforms such as, \"software systems, and IT systems.\"\n\n\"Agency Heads shall take all necessary steps, in coordination with the USDS Administrator and to the maximum extent consistent with law, to ensure USDS has full and prompt access to all unclassified agency records, software systems, and IT systems.  USDS shall adhere to rigorous data protection standards,\" the executive order reads.\n\nPresident Donald Trump signs executive orders in the Oval Office on Jan. 20, 2025.(Anna Moneymaker/Getty Images)\n\nTrump and Musk had long previewed the creation of DOGE while on the campaign trail, championing that the team would weed out overspending and fraud within the federal government. DOGE is not a government department, but instead operates as a team within the Trump administration.\n\nBefore Trump's win in November, Musk hosted the Republican president for an interview on X in August, where Musk railed against government overspending and inflation that has gripped the nation in recent years.\n\nPresident-elect Donald Trump and Elon Musk arrive to attend a viewing of the launch of the SpaceX Starship rocket on Nov. 19, 2024, in Brownsville, Texas.(Brandon Bell/Getty Images)\n\n\"A lot of people just don’t understand where inflation comes from. Inflation comes from government overspending because the checks never bounce when it’s written by the government. So if the government spends far more than it brings in, that increases the money supply. If the money supply increases faster than the rate ofgoods and services, that’s inflation,\" Musk said during their conversation.\n\nMUSK RENEWS HARSH REBUKE OF DEMS WHO REJECTED DEPORTING SEX OFFENDERS: VOTE OUT ‘EVERY ONE’\n\n\"So really we need to reduce our government spending, and we need to re-examine… I think we need a government efficiency commission to say like, ‘Hey, where are we spending money that’s sensible. Where is it not sensible?’\"\n\nSince its official creation last month, DOGE's X account has provided updates on its work to cut government spending, including announcing last week that it has cut more than $1 billion from federal spending through now-defunct diversity, equity and inclusion initiatives and personnel.\n\nFox News Digital reachedout to the White Houseand Treasury Department on Sunday morning, but did not immediately receive replies.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}