{
    "question": "How might the Pentagon’s new Annual Media Rotation Program—requiring NBC News, the New York Times, NPR, and Politico to vacate offices in favor of OANN, the New York Post, Breitbart, and HuffPost—affect day-to-day reporting from the building and public perceptions of fairness and transparency in defense coverage?",
    "content": {
        "source_1": "One America News Network would soon replace NBC News and Breitbart would swap with National Public Radio in coveted Pentagon press corps workspace under a plan shared with journalists Friday night.\n\nIn what the Pentagon is calling a new “annual media rotation program,” The New York Post will also be invited to move into The New York Times’ workspace. And a fourth outlet affected by the rotation program, Politico, would be replaced by HuffPost.\n\nThree of the changes, set to take effect on February 14, elevate relatively small and ardently pro-Trump media outlets while sidelining more popular, more mainstream news organizations.\n\nThe fourth is the exception: HuffPost, which has a progressive brand, is openly critical of President Donald Trump. Curiously, though, the site does not currently have a Pentagon correspondent.\n\n“If the Trump Administration and Secretary Hegseth are interested in more hard-hitting coverage of their stewardship of the Defense Department from HuffPost, we are ready to deliver,” a HuffPost spokesperson said Friday night.\n\nNBC News said in a statement, “We’re disappointed by the decision to deny us access to a broadcasting booth at the Pentagon that we’ve used for many decades. Despite the significant obstacles this presents to our ability to gather and report news in the national public interest, we will continue to report with the same integrity and rigor NBC News always has.”\n\nCNN has reached out to representatives for The New York Times, NPR and Politico for comment.\n\nThe Friday night announcement is bound to provoke challenges from members of the Pentagon press corps. But it is in line with the Trump administration’s stated goals to challenge long-held norms and create space for new, opinionated online media outlets.\n\nPentagon spokesman Jonathan Ullyot said in the internal memo to the Pentagon Press Association that the changes apply to individual office spaces in the “Correspondents’ Corridor” at the Defense Department — both a practical and symbolic move.\n\nThe year-by-year rotation program will “broaden access to the limited space of the Correspondents’ Corridor to outlets that have not previously enjoyed the privilege and journalistic value of working from physical office space in the Pentagon,” Ullyot wrote.\n\nOfficials apparently chose one outlet “from each press medium” — print, online, radio and TV — to forfeit their existing space for one years’ time.\n\nThe news outlets that are being replaced were effectively given two weeks’ notice.\n\nMembers of the Pentagon press corps were left wondering why The Times, NBC, NPR and Politico were told to vacate the office space, and whether the decisions were related to their rigorous coverage of new Defense Secretary Pete Hegseth, the former Fox News host who took charge at the Pentagon earlier this week.\n\n“To be clear, the outlets that vacate the spaces loaned to them” by the defense secretary “will remain as full members of the Pentagon Press Corps,” Ullyot wrote. “They will continue to enjoy the same media access to the Pentagon and will be able to attend and cover briefings and be considered for travel with civilian and military leaders in the Department as they have previously. The only change will be giving up their physical workspaces in the building to allow new outlets to have their turn to become resident members of the Pentagon Press Corps.”\n\nUllyot’s memo billed the rotation system as a fair way to welcome more media outlets into US  military headquarters, but the announcement came under immediate scrutiny.\n\nBreitbart, for example, was selected as a radio outlet, replacing NPR this year. But Breitbart – a well-known web site for pro-Trump coverage and commentary – barely has a radio operation of its own. The word “radio” doesn’t appear on its home page at all. The media outlet has a distribution deal with SiriusXM and one big podcast, Breitbart News Daily. Its footprint pales in comparison to NPR, which provides news coverage for local stations all across the country.\n\nOne America News was selected as TV outlet, replacing NBC this year. While NBC produces some of the most-watched news programs in the country, like “NBC Nightly News” and “Today,” One America is so small that it eschewed the Nielsen ratings measurement service. The far-right channel, headquartered in San Diego, faced multiple lawsuits stemming from the outlet’s lies about the 2020 election.\n\nKevin Baron, a former vice president of the Pentagon Press Association, called the development “the erasure of journalism at the Pentagon.”\n\n“Kicking out reporters HURTS coverage. If you can’t file your stories from inside the building you are disadvantaged. If you don’t have a work space you are disadvantaged,” Baron said in aseries of posts on X.\n\nThe National Press Club, an advocate for press freedom, said in a statement that it was troubled by the Pentagon’s announcement and called on the Defense Department to provide greater clarity about the decision.\n\n“The National Press Club is deeply concerned by the Defense Department’s decision to remove certain media organizations from their dedicated spaces in the Pentagon,” National Press Club President Mike Balsamo said in a statement. “Any action that restricts the ability of journalists to report on the operations of the U.S. government should alarm all who value transparency and press freedom.”\n\nThis story has been updated with additional details.",
        "source_2": "Several major media companies were told they would need to vacate their office spaces at the Pentagon, in favor of other outlets. Pentagon officialstold the news agencieson Friday night.\n\nNBC News, The New York Times, National Public Radio and Politicomust vacatetheir dedicated workspaces. The organizations learned about the new directive in a memo sent to the press corps without being individually notified, according to NBC News. The Pentagon released an email saying in part, “no additional information will be provided at this time.”\n\nDownload the SAN app today to stay up-to-date with Unbiased. Straight Facts™.\n\nThe Pentagon said this is part of a new program. They call it the Annual Media Rotation Program. They said it would give other news outlets a better privilege to work within the Pentagon.\n\n“For over a half-century, the Pentagon Press Corps has benefited from working out of individual office spaces that provide coveted and open access to some of the Department’s top military and civilian leaders,” read the memo Pentagon spokesperson John Ullyot sent to the Pentagon Press Association.\n\n“In order to broaden access to the limited space of the Correspondents’ Corridor to outlets that have not previously enjoyed the privilege and journalist value of working from physical office space in the Pentagon, beginning February 14, 2025,” Ullyot wrote, there will be “a new Annual Media Rotation Program for those dedicated media spaces.”\n\nThe Pentagon said One America News Network, the New York Post, Breitbart News and HuffPost would be moving into the spots.\n\nAccording to AllSides, a website that rates media bias, OANN, the Post and Breitbart are all considered right-leaning news sources. HuffPost is the only one of the new sources that lean to the left, according toAllSides.\n\nOfficials at NBC Newssaidthey are disappointed by the decision. The company said despite the new complications, it will continue to, “gather and report news in the national public interest, we will continue to report with the same integrity and rigor NBC News always has.”\n\nHuffPost doesn’t currently have a Pentagon correspondent. However, the company told CNN that it’s ready to deliver.\n\n“If the Trump administration and Secretary Hegseth are interested in more hard-hitting coverage of their stewardship of the defense department from HuffPost, we are ready to deliver,” a spokesperson for the outlet toldCNN.\n\nOfficials with The Timessaidit was concerned about the recent developments.\n\n“The Department of Defense has the largest discretionary budget in the government, millions of Americans in uniform under its direction and control of a vast arsenal funded by taxpayers. The Times is committed to covering the Pentagon fully and fairly. Steps designed to impede access are clearly not in the public interest,” the paper added in an email statement.\n\nNo summary available because of a lack of coverage.\n\nPentagon to swap traditional media with pro-Trump outlets under new rotational program for Defense Department workspace\n\nDefense Department To Boot NBC News, New York Times And Other Media From Workspaces As Part Of New Rotation; Trump-Friendly Outlets To Get Spots\n\nPentagon removes major media outlets from workspaces in new ‘rotation program'\n\nTrump's Pentagon says it will 'rotate' out some media from offices\n\nPentagon Boots NBC, NPR, NYT, and Politico from Offices – To Be Replaced by Breitbart and One America News\n\nPentagon Removes NBC News, NYT, Other Media From Offices in New Rotation Program\n\nDonald Trump in, Breitbart in, New York Times, NPR, NBC out of Pentagon\n\nNo summary available because of a lack of coverage.\n\nTrump's Pentagon says it will 'rotate' out some media from offices\n\nPentagon to swap traditional media with pro-Trump outlets under new rotational program for Defense Department workspace\n\nPentagon to swap traditional media with pro-Trump outlets under new rotational program for Defense Department workspace\n\nTrump’s Pentagon to remove some media, including New York Times, from offices\n\nPentagon removes these major news outlets from the workspace in 'rotation program'\n\nPentagon to swap traditional media with pro-Trump outlets under new rotational program for Defense Department workspace\n\nPentagon to swap traditional media with pro-Trump outlets under new rotational program for Defense Department workspace\n\nPentagon to swap traditional media with pro-Trump outlets under new rotational program for Defense Department workspace\n\nPentagon to swap traditional media with pro-Trump outlets under new rotational program for Defense Department workspace\n\nNo summary available because of a lack of coverage.\n\nTrump’s Pentagon says it will ‘rotate’ out some media from offices\n\nNYT, NBC, \"Politico\": Pentagon throws several media out of their offices\n\nTrump throws the New York Times out of the White House\n\nPentagon removes major media outlets, including NBC News, from dedicated workstations as part of a new ‘rotation program’\n\nDefense Department Orders ‘Unique’ Move Against Media Establishment Entrenched In Halls Of Pentagon\n\nNYT, NBC, NPR, Politico Evicted From Pentagon Press Offices In Favor Of Trump-Friendly Outlets – Nemos News Network\n\nNBC, Politico, NY Times booted at Pentagon in favor of center-right news outlets\n\nNBC, Politico, NY Times booted at Pentagon in favor of center-right news outlets · American Wire News\n\nTrump Pentagon Boots NBC, NYT, NPR, Politico to Make Room for NYP, Breitbart News, OANN, HuffPost\n\nPentagon Removes Major Media Outlets, NBC, NYT, NPR, Politico, in New ‘Rotation Program’ – Geller Report\n\nThePatriotLight – NYT, NBC, NPR, Politico Evicted From Pentagon Press Offices In Favor Of Trump-Friendly Outlets\n\nPentagon launches media rotation plan to reallocate space\n\nThe Trump administration announced that it will remove four media organizations, including the New York Times, from their private offices in the Pentagon.\n\nUS government removes New York Times, NBC News from Pentagon\n\nTrump: He's \"casting black\" on the media at the Pentagon and replacing them with \"his own\"\n\nHaggett: Removes NYTimes and other media from Pentagon\n\nFour media organizations are being evicted from the Pentagon. They will be replaced by those who are more loyal to Republicans\n\nPentagon removes major media outlets, including NBC News, from dedicated workstations as part of a new 'rotation program'\n\nMajor News Outlets Lose Pentagon Offices as Part of 'Rotation' Program\n\nTrump's Pentagon says it will 'rotate' out some media from offices – Blue Water Healthy Living\n\nDefense Department To Boot NBC News, New York Times And Other Media From Workspaces As Part Of New Rotation; Trump-Friendly Outlets To Get Spots\n\nPentagon to swap traditional media with pro-Trump outlets under new rotational program for Defense Department workspace\n\nThe Pentagon “evicted” a number of media outlets, they will be replaced by those that are more loyal to Trump\n\nPentagon removes New York Times, NPR and more from workspaces as part of ‘rotation program’ – Your Blog Domain\n\nPentagon eliminates vital media electrical retailers, consisting of NBC News, from devoted workstations in brand-new ‘rotation program’\n\nPentagon evicts news outlets from offices, allows right-of-center platforms to move in\n\nThe White House has ordered four media companies to vacate offices in the Pentagon\n\nTrump Pentagon Boots NBC, NYT, NPR, Politico to Make Room for NYP, Breitbart News, OANN, HuffPost – altnews.org\n\nThe Trump administration has decided to withdraw four leading media outlets from the Pentagon\n\nNBC News, NY Times, NPR and POLITICO to be kicked out of Pentagon…\n\nPentagon removes major media outlets, including NBC News, from dedicated\n\nDefense Department Swaps Out NBC News, New York Times And Other Media From Workspaces; Trump-Friendly Outlets To Get Spots\n\nProtection Division Swaps Out NBC Information, New York Instances And Different Media From Workspaces; Trump-Pleasant Retailers To Get Spots\n\nTrump's Pentagon says it will 'rotate' out some media from offices\n\nPro-Trump Media Outlets Set to Replace Major News Organizations in Pentagon\n\nTrump Pentagon Boots NBC, NYT, NPR, Politico to Make Room for NYP…\n\nPentagon removes New York Times, NPR and more from workspaces as part of ‘rotation program’ | Trump administration – Corruption By Cops",
        "source_3": "The Pentagon under Defense Secretary Pete Hegseth in a massive overhaul of its practice allowing journalists to work from inside the building is beginning a program to remove four establishment media news outlets from their workspaces for one year to replace them with new media outlets, including Breitbart News.\n\nActing Pentagon Press Secretary John Ullyot issued a memo on Friday to the Pentagon Press Association announcing that the NBC News, theNew York Times, National Public Radio, andPoliticomust give up their physical workspaces in the Pentagon for one year to theNew York Post, Breitbart News, and the Huffington Post.\n\n“Each year, one outlet from each press medium — print, online, television and radio — that has enjoyed working from a physical office in the Pentagon will rotate out of the building to allow a new outlet from the same medium that has not had the unique opportunity to report as a resident member of the Pentagon Press Corps,” the memo said.\n\nThe Pentagon is giving those outlets two weeks to vacate their offices, effective Friday, February 15, 2025.\n\nFor over a half-century, the Pentagon Press Corps has benefited from working out of individual office spaces that provide coveted and open access to some of the Department’s top military and civilian leaders.\n\nKnown as the Correspondents’ Corridor, this office space loaned to media outlets by the Secretary of Defense stands as a tribute to the importance the Department has long placed on informing the public about the U.S. military and all it does to project peace through strength. It also honors the many correspondents who put their lives on the line, and in many cases died, while covering our finest in battle.\n\nHe added the move was to broaden access to the limited space of the Correspondents Corridor to “outlets that have not previously enjoyed the privilege and journalistic value of working from physical office space in the Pentagon.”\n\nThe changes follow the White House announcing they would open up the press briefings to new media outlets who can apply for access and reverse the revocation of about 400 White House press passes under the Biden administration.\n\nAt the White House briefing on Friday, White House Press Secretary Karoline Leavitt said during her first press briefing on Wednesday:\n\n[I]n keeping with this revolutionary media approach that President Trump deployed during the campaign, the Trump White House will speak to all media outlets and personalities, not just the legacy media who are seated in this room, because apporting — according to recent polling from Gallup, Americans’ trust in mass media has fallen to a record low.  Millions of Americans, especially young people, have turned from traditional television outlets and newspapers to consume their news from podcasts, blogs, social media, and other independent outlets.\n\nShe added: “It’s essential to our team that we share President Trump’s message everywhere and adapt this White House to the new media landscape in 2025.  To do this, I am excited to announce the following changes will be made to this historic James S. Brady Briefing Room, where Mr. Brady’s legacy will endure.”\n\nFollow Breitbart News’s Kristina Wong on”X”,Truth Social, or onFacebook."
    }
}