{
    "question": "How might Columbia University’s $200 million settlement with the Trump administration—restoring most federal funding while adding oversight, new protest rules, and changes to disciplinary authority—affect academic freedom, campus climate, and the broader relationship between universities and the federal government?",
    "content": {
        "source_1": "Columbia University said Wednesday it will pay $200 million to the federal government to restore the majority of funding that was cut by the Trump administration over allegations it violated anti-discrimination laws.\n\n\"This agreement marks an important step forward after a period of sustained federal scrutiny and institutional uncertainty,\" acting university President Claire Shipman said in a statement.\n\nThe Trump administration in Marchsaid it was canceling $400 million in grantsto the school, accusing it of “inaction in the face of persistent harassment of Jewish students.”\n\nColumbia thenagreed to a list of demands by the Trump administration, which some critics saw as a capitulation by the private university.\n\nPresident Donald Trump celebrated the agreementon Truth Socialon Wednesday night and showed no signs that administration's pressure campaign on universities was over.\n\n\"Numerous other Higher Education Institutions that have hurt so many, and been so unfair and unjust, and have wrongly spent federal money, much of it from our government, are upcoming,\" he wrote.\n\nColumbia said in the Wednesday statement that under the agreement “a vast majority of the federal grants which were terminated or paused in March 2025 — will be reinstated and Columbia’s access to billions of dollars in current and future grants will be restored.”\n\n“This includes the reinstatement of the majority of grants previously terminated by the National Institutes of Health and the Department of Health and Human Services, renewal of non-competitive grants, the release of overdue payments on active, non-terminated grants, and Columbia’s restored eligibility to apply for new federal research funding in the ordinary course,” the university said.\n\nColumbia and other universities have been targeted by the Trump administration over student protests over the war in Gaza, which some Republican lawmakers have said were antisemitic.\n\nAnother major Ivy League college, Harvard University, refused Trump’s demands andhas sued the Trump administrationover threats to cut funding. That case is pending.\n\n\"While Columbia does not admit to wrongdoing with this resolution agreement, the institution’s leaders have recognized, repeatedly, that Jewish students and faculty have experienced painful, unacceptable incidents, and that reform was and is needed,\" the university said in Wednesday's statement.\n\nColumbia said the agreement will establish a “a jointly selected independent monitor\" — and that it will provide regular reports about its \"continued compliance with applicable federal laws and regulations pertaining to admissions, hiring, and international students.\"\n\nIt said the agreement also codifies changes it previously announced on campus safety, discipline and inclusion.\n\nThe $200 million, termed a settlement by the university, will be paid to the government over three years.\n\nIt will also pay $21 million to settle investigations by the U.S. Equal Employment Opportunity Commission, the university said.\n\nColumbia Board of Trustees co-chairs David Greenwald and Jeh Johnson said in Wednesday’s statement that the agreement “confirms the changes already underway at Columbia to meaningfully address antisemitism on our campus and allows the University to continue to undertake its transformative research and scholarship.”\n\nStudent protests over the war in Gaza, which Israel launched after the surprise terrorist attack by Hamas on Oct. 7, 2023, took place on college campuses across the U.S., including at Columbia.\n\nTrump campaigned on attacking those protests, and since taking office his administration hassought to deport some studentswho took part in pro-Palestinian demonstrations by accusing them of sympathizing with Hamas.\n\nU.S. Secretary of Education Linda McMahoncalled the Columbia settlement“a seismic shift in our nation’s fight to hold institutions that accept American taxpayer dollars accountable for antisemitic discrimination and harassment.”\n\nBrian Cohen, executive director of the Kraft Center for Jewish Student Life with Columbia/Barnard Hillel, hailed the agreement.\n\n“This announcement is an important recognition of what Jewish students and their families have expressed with increasing urgency: antisemitism at Columbia is real, and it has had a tangible impact on Jewish students’ sense of safety and belonging and, in turn, their civil rights,” he said.\n\nShipman, the Columbia president, saidin a letter to the university communitythat Columbia remains independent.\n\n\"No provision of this agreement, individually or taken together, shall be construed as giving the United States authority to dictate faculty hiring, university hiring, admissions decisions, or the content of academic speech,\" she wrote in the letter, quoting the agreement.\n\n\"This was our north star, and we did not waver from it,\" Shipman wrote. \"Columbia’s governance remains in our control. The federal government will not dictate what we teach, who teaches, or which students we admit.\"",
        "source_2": "Columbia University has agreed to pay $200m (£147m) to President Donald Trump's administration over accusations it failed to protect its Jewish students.\n\nThe settlement, which will be paid to the federal government over three years, was announced in a statement by the university and confirmed by the president on social media.\n\nIn exchange, the government has agreed to return some of the $400m in federal grants it froze or terminated in March.\n\nColumbia was the first school targeted by the administration for its alleged failures to curb antisemitism amid last year's Israel-Gaza war protests on its New York City campus. It had already agreed to a set of demands from the White House in March.\n\nThe deal with Columbia University is \"a seismic shift in our nation's fight\" to hold universities accountable, Education Secretary Linda McMahon said.\n\nClaire Shipman, Columbia's acting president, said in a statement: \"This agreement marks an important step forward after a period of sustained federal scrutiny and institutional uncertainty.\"\n\nColumbia is amonga list of universitiesthat have been pursued by the Trump administration over protests against Israel's war campaign in Gaza and other issues, including transgender athletes and diversity, equity and inclusion (DEI) programmes.\n\nThe government has targeted over 4,000 grants for termination at over 600 universities and colleges across the US, totalling roughly $8bn, according to a tracker by the Center for American Progress, a liberal think tank.\n\nTrump posted on Truth Social platform on Wednesday: \"Columbia has also committed to ending their ridiculous DEI policies, admitting students based ONLY on MERIT, and protecting the Civil Liberties of their students on campus.\n\n\"Numerous other Higher Education Institutions that have hurt so many, and been so unfair and unjust, and have wrongly spent federal money, much of it from our government, are upcoming.\"\n\nOne month after Trump was sworn into office, his administration stripped Columbia of $400m in federal funding over allegations of antisemitism.\n\nThe frozen funds posed an immediate threat to the university's research, leading Ms Shipman to say in June that things had reached a \"tipping point\".\n\nThe White House's decision led Columbia to enact campus rule changes demanded by the administration, including the re-organisation of its Middle Eastern studies department, and hiring a team of \"special officers\" empowered to remove students from campus and make arrests.\n\nColumbia said as part of its monetary settlement, a vast majority of the cancelled or paused grants would be reinstated.\n\nThe agreement codifies many changes the college has already announced and includes that a jointly selected independent monitor will be appointed to assess implementation of the agreement.\n\nSome of those adjustments include disciplining students who were part of the encampment on the university's campus as part of the Gaza protests, requiring protesters to show campus ID, not allowing face masks during demonstrations, providing greater oversight of student groups, and an expansion of officers on campus.\n\nThe university said the settlement was not an admission of wrongdoing.\n\n\"This agreement marks an important step forward after a period of sustained federal scrutiny and institutional uncertainty,\" Shipman said.\n\n\"The settlement was carefully crafted to protect the values that define us and allow our essential research partnership with the federal government to get back on track.\"\n\nShe added that the terms of the agreement would safeguard the school's independence.\n\nColumbia's willingness to comply with the administration in March was met with intense criticism from some who felt the Ivy League college had conceded its independence.\n\nAlthough the government has suspended billions in funding from the university and moved to end its ability to enrol international students, Harvard is suing the administration.\n\nHearings in the casebetween Harvard, the richest university in the country, and the White House, the nation's highest branch of government, began on Monday.\n\nThe Trump administration has signalled it is hoping schools go more in the direction of Columbia.\n\nIn her statement, McMahon called Columbia's reforms \"a roadmap for elite universities that wish to regain the confidence of the American public\".\n\n\"I believe they will ripple across the higher education sector and change the course of campus culture for years to come,\" she said.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "Rep. Kevin Kiley, R-Calif., discusses the Trump administration’s legal battles with Ivy League schools over federal funding on ‘Fox Report.’\n\nPresident Donald Trump has secured a $221 million settlement with Columbia University to resolve multiplefederal civil rights investigations.\n\nThe deal includes $200 million over three years for alleged discriminatory practices and $21 million to settle claims of antisemitic employment discrimination against Jewish faculty after the Oct. 7, 2023, Hamas attacks in Israel.\n\nThe White House called it the largest antisemitism-related settlement in U.S. history; Columbia confirmed the dollar amounts, but did not characterize the deal that way.\n\nThe agreement restores billions in federal research funding and imposes oversight through an independent monitor. Columbia has agreed to reform, including enhanced campus protest rules and changing disciplinary authority from faculty to administrators.\n\n\"The Trump Administration's deal with Columbia University is a seismic shift in our nation’s fight to hold institutions that accept American taxpayer dollars accountable for antisemitic discrimination and harassment,\" Education Secretary Linda McMahon said in a statement to Fox News Digital. \"For decades, the American public has watched in horror as our elite campuses have been overrun by anti-western teachings and a leftist groupthink that restricts speech and debate to push a one-sided view of our nation and the world.\n\n\"These dangerous trends fueled the outbreak of violent antisemitism that paralyzed campuses after the October 7th massacre and was previously unthinkable in the United States of America.\"\n\nCOLUMBIA PROFESSORS DEMAND ANSWERS AS WHITE HOUSE FINALIZES NEGOTIATIONS WITH IVY LEAGUE UNIVERSITY\n\nPresident Donald Trump is pushing back on pro-Palestinian protests on college campuses, including Columbia University.(Getty Images)\n\nColumbia confirmed that most of its suspended federal grants will be reinstated, including those from the National Institutes of Health and Department of Health and Human Services. The university noted that a portion of funding not restored reflects unrelated federal cuts in specific research areas.\n\nThe agreement also codifies reforms Columbia announced earlier this year, including changes to campus safety, enhanced training programs, and new reporting mechanisms. It further includes the appointment of Title VI and Title VII coordinators, as well as additional commitments made in July, most notably, the adoption of the International Holocaust Remembrance Alliance (IHRA) definition of antisemitism.\n\nColumbia’s public statement does not acknowledge White House claims that the university will review international student admissions or Middle East programs or share admissions process data.\n\nThe university's Jewish student life organization, Columbia/Barnard Hillel, said the settlement represents a major step in the right direction.\n\nJEWISH STUDENT SETTLES RELIGIOUS DISCRIMINATION SUIT AGAINST COLUMBIA\n\nColumbia University students set up a Gaza Solidarity Encampment on campus, April 24, 2024, in New York City.(Getty Images)\n\n\"This announcement is an important recognition of what Jewish students and their families have expressed with increasing urgency: antisemitism at Columbia is real, and it has had a tangible impact on Jewish students’ sense of safety and belonging and, in turn, their civil rights,\" Lavine Family Executive Director Brian Cohen said in a statement. \"Acknowledging this fact is essential, and along with the new path laid out by the President and Trustees, I am hopeful that today’s agreement marks the beginning of real, sustained change.\n\n\"In the months ahead, Columbia/Barnard Hillel will continue our work with the administration, faculty, students, and alumni to strengthen Jewish life at Columbia including making sure that the roadmap laid out in this agreement is followed.\"\n\nActing President Claire Shipman said the settlement safeguards academic independence and allows essential research to resume.\n\nColumbia admitted no wrongdoing but acknowledged the need for reform after \"painful, unacceptable incidents\" affecting Jewish students and faculty.\n\nStudents at Columbia University participate in a pro-Palestinian protest last year.(Spencer Platt/Getty Images)\n\nColumbia’s public statement does not mention several claims made by the White House, including a mandated review of Middle East programming and new data-sharing requirements tied to international student admissions.\"This agreement marks an important step forward after a period of sustained federal scrutiny and institutional uncertainty,\" Shipman said. \"The settlement was carefully crafted to protect the values that define us and allow our essential research partnership with the federal government to get back on track. Importantly, it safeguards our independence, a critical condition for academic excellence and scholarly exploration, work that is vital to the public interest.\"\n\nCLICK HERE TO GET THE FOX NEWS APPThe White House also cited provisions related to women’s sports and campus safety not mentioned in Columbia’s statement.\n\nThe White Housedid not immediately respond to Fox News Digital's additional request for comment.The full Columbia statement can befound here.\n\nJasmine is a writer at Fox News Digital and a military spouse. Stories can be sent tojasmine.baehr@fox.comor to@JasmineSBaehr via X.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}