{
    "question": "In what ways could President Trump’s comments linking the D.C. crash to alleged lowered FAA standards amid a diversity push influence public trust in the investigation and the broader debate over aviation safety policy?",
    "content": {
        "source_1": "In a Thursday press conference addressing the plane-helicopter collision thatkilled 67 people near Ronald Reagan National Airport, President Donald Trump made an array of statements about past and present federal policy for air traffic controllers.\n\nHe at one point said the crash \"could have been\" the result of diversity hiring initiatives, and he claimed air traffic controllers are allowed to work with serious health issues and disabilities.\n\nHere's what the USA TODAY Fact Check Team found on how Trump's statements compare to Federal Aviation Administration standards and past changes.\n\n“Hearing, vision, missing extremities, partial paralysis, complete paralysis, epilepsy, severe intellectual disability, psychiatric disability and dwarfism – all qualify for the position of a controller of airplanes pouring into our country.”\n\nAir traffic controllers must regularly meet specific medical standards and must be cleared by a flight surgeon,according to FAA documents. Those whofail to meet them are disqualifiedfrom the job.\n\nControllers must undergo regular medical examinations andare required to report any changes to their healthto their flight surgeon, the documents indicate.\n\nOne of the conditions referenced by Trump – epilepsy – isspecifically mentioned as disqualifying in the FAA documents. Controllers also mustpass a hearing testand have20/20 or better vision in each eye, with or without corrective lenses, for objects at long distances and 20/40 or better vision in each eye at a distance of 16 inches.\n\nAdditionally, they must have no history of bipolar disorder or any other psychoses or personality disorders and may not have had ablood alcohol test result of 0.04 or greaterduring the previous two years. They may not have aseated blood pressurehigher than 155 over 95. And they must haveno history of several cardiac conditionsthat include a heart attack, a cardiac valve replacement, a permanent pacemaker or a heart transplant.\n\nThe list of disabilities quoted by Trump comes from the FAA website's diversity and inclusion page, which lists people the federal government had a \"special emphasis\" on hiring atleast as far back as 2013, FAA archives show. Itremained onlinethrough Trump's first term.\n\n“As you know last week, long before the crash, I signed an executive order restoring our highest standards for air traffic controllers and other important jobs throughout the country.”\n\nTrump is referring tohis executive order titled “Keeping Americans Safe in Aviation”that claimed former President Joe Biden’s administration “sought to specifically recruit and hire individuals with serious infirmities that could impact the execution of their essential life-saving duties.” The order called for an immediate “return to non-discriminatory, merit-based hiring.” It did not specifically mention air traffic controllers.\n\nThe “Diversity and Inclusion”section of the FAA’s websiteunder the Biden administration, which isno longer active, said it “actively recruits, hires, promotes, retains, develops and advances people with disabilities.” It went on to say conditions including vision loss, complete paralysis, epilepsy and “severe intellectual disability” were among those that the federal government “has identified for special emphasis in recruitment and hiring.” But the FAA site under Biden didn't say those individuals were specifically sought for air traffic controller positions.\n\nThe Office of Personnel Management’swebsite under the Biden administrationnoted that certain physical disabilities and medical conditions are “disqualifying because there are medical and/or management reasons to conclude that an individual with such impairment/condition cannot perform the duties of the position without unacceptable risk to his or her own health, or to the health or safety of others – employees or the public.”\n\nSuch conditions included epilepsy and having less than 20/20 vision, severe spinal deformity or any kind of psychosis or neurosis.\n\n“Brilliant people have to be in those positions and their lives are shortened, very substantially shortened, because of the stress.”\n\nUSA TODAY found no record of studies showing air traffic controllers in particular have “substantially” shorter lifespans because of their profession.\n\nThe FAArequires air traffic controllers to retireat age 56 to “prevent burnout,” according to the Bureau of Labor Statistics. TheFAA also created a trainingto foster air traffic controller trainees’ “knowledge of career-specific stressors, stress responses and stress management techniques.”\n\nThere are studies supporting the notion that chronic stress reduces one’s lifespan, though they’re not specific to air traffic controllers.\n\nAFinnish study published in 2020found that chronic stress shortened the life expectancies of both men and women by more than two years, for example. AYale study the following yearfound that chronic stress accelerated the aging process.\n\n“We must have only the highest standards for those who work in our aviation system. I changed the Obama standards from very mediocre at best to extraordinary.”\n\nTrumpsought to blamehis predecessors, presidents Joe Biden and Barack Obama, for FAA hiring practices that promoted diversity, equity and inclusion. But Trumpdid not provide any evidenceto support his claims that hiring practices during the Biden and Obama administrations played a role in the crash.\n\nIt wasn't immediately clear what standards Trump was referencing, but archives of the FAA website show diversity initiatives stretch back to at least 2013 and continued throughout Trump's first term. The2013 diversity and inclusion pageon the FAA website said the federal government has a \"special emphasis in recruitment and hiring\" people with targeted disabilities, which it defines as \"hearing, vision, missing extremities, partial paralysis, complete paralysis, epilepsy, severe intellectual disability, psychiatric disability and dwarfism.\" That exact description remained online through Trump's term, visible in2019and inJanuary 2021versions of the page.\n\nUnder Trump in April 2019, the FAA announced anAviation Development Programthat allowed 20 people with disabilities to train at air traffic control centers for careers in air traffic operations. Candidates in the program were subject to the \"same rigorous consideration in terms of aptitude, medical and security qualifications\" as traditional applicants, the release said.",
        "source_2": "President Donald Trump doubled down on his attacks against the Federal Aviation Administration’s diversity, equity and inclusion policies in aTruth Socialpost Friday morning following the fatal collision between an American Airlines plane and an army helicopter—but he has not provided evidence DEI was related to the crash, and these policies have existed at the FAA for years, including during his first term.\n\nTrump posted screenshots of X posts and articles toTruth SocialFriday morning to slam an FAA commitment to hiring people with disabilities, stating this is “one reason why our Country WAS going to hell”—but according to Internet Archive screenshots from2017and2019, the same language about hiring employees with disabilities was active on the FAA’s website during Trump’s first term.\n\nTrump’s post contained quotes of the same now-deleted passage from the FAA’s website that he quoted during his press conference Thursday, which stated the FAA had committed to hiring people with “severe” disabilities because they are the “most under-represented segment” of the workforce, including those with “missing extremities, partial paralysis, complete paralysis,” and “epilepsy.”\n\nTrump has also not provided evidence anyone involved in the crash had disabilities.\n\nThough Trump blamed former President Joe Biden and former Transportation Secretary Pete Buttigieg, the FAA’s diversity website listed a commitment to hiring diverse and disabled candidates as early as 2013, according to theInternet Archive, and throughout Trump’s first term.\n\nTrump also suggested people with disabilities are being hired as air traffic controllers, though the FAA clarified toFox Newslast year it employs people for a “wide range of positions, from administrative roles to oversight and execution of critical safety functions,” all of whom must meet “rigorous qualifications.”\n\nThe FAA has also operated a program to boost hiring of candidates with disabilities, which also existed during Trump’s first term, according to FAAannual reports, and a 2023reportstates the “participants must meet the same qualifications as any other applicants.”\n\nThe FAA also posted on X (then Twitter) about itsdiversity commitmentsand commitments to hiring and trainingworkers with disabilitiesthroughout Trump’s first term.\n\nTrump said the crash “could have been” caused by diversity hiring in response to a question from a reporter without providing evidence, though he acknowledged “we don’t know” and the investigation is ongoing. But Trump used the press conference to attack the FAA’s DEI policies, stating Buttigieg ran the Transportation Department “right into the ground with his diversity” and slammed the FAA for committing to hiring people with “severe intellectual and psychiatric disabilities.”\n\nTrump issued an executive order on Jan. 22 eliminating policies he said “prioritized diversity, equity, and inclusion (DEI) over safety and efficiency” at the FAA. His executive order alleges “the Biden FAA specifically recruited and hired individuals with ‘severe intellectual’ disabilities,” and his executive order called for the FAA to pivot to “non-discriminatory, merit-based hiring.” At Trump’spress conferenceThursday morning, a reporter asked whether Trump’s executive order was successful because the crash happened after the order, to which Trump said “we’re in the process of making those changes.”\n\nTrump has madeeliminating DEIa central focus of his first days in office. On his first day, Trump issued an executive order requiring federal agencies to drop their DEI programs and, days later, he signed another executive order directing the military, Department of Defense and Department of Homeland Security to ditch their DEI offices and policies. Trump’s DEI attacks have been accompanied by a series of companiesrolling backtheir DEI programs, including Meta, Amazon and Target, though others, like Costco and Delta Airlines, have stood firm behind their diversity commitments.\n\nAn American Airlines passenger plane and military helicoptercollidedmidair outside Ronald Reagan National Airport near Washington, D.C. late Wednesday night, with no survivors among the 67 people on board, Trump confirmed at his press conference.\n\nRep. Andy Ogles, R-Tenn., also questioned whether DEI played a role in the fatal crash in an appearance onFox Business Networkthis morning, though he did not provide evidence. Republicans have pointed fingers at DEI after other recent disasters, including the wildfires in Los Angeles and a truck driver crashing into a crowd of people inNew Orleans. Sen.Marsha Blackburn, R-Tenn., sent a letter to the FBI alleging “the Bureau has prioritized Diversity, Equity, and Inclusion (DEI) initiatives over its core mission of protecting the American people,” days after the New Orleans attack.\n\nD.C. Plane Crash Live Updates: Trump Criticizes FAA’s DEI Hiring Policies And Suggests, Without Evidence, They Could Be To Blame(Forbes)\n\nWar On DEI: Deutsche Bank Stands ‘Firmly Behind’ Diversity Program As These Major Organizations Drop Them(Forbes)",
        "source_3": "There seemed to be two PresidentDonald Trumpsin the immediate aftermath of the deadly collision between anAmerican Airlinesairplane andArmyBlack Hawk helicopter overWashington.\n\nThe crash, which occurred over the Potomac River as the plane tried to land at Ronald Reagan Washington National Airport and the helicopter was conducting a training mission, presents the first test of Trump’s nascent second administration after a record of uneven responses to tragedy during his first term.\n\nAs 67 families learned their loved ones, including 60 airline passengers, four crew members, and three military personnel, were victims of the crash, theWhite Houseportrayed Trump as a traditional, steady, and measured commander in chief on Wednesday before the president returned to the campaign-style, reality TV star politician, speculating about the cause of the incident hours after the explosion before delivering a free-wheeling press briefing on Thursday.\n\nFor Republican strategist John Feehery, Trump was merely “channeling the thoughts and concerns of the American people.”\n\n“He asks probing questions,” Feehery told theWashington Examiner. “I think that is refreshing.”\n\nBut Republican strategist Doug Heye, a former communications director of theRepublican National Committee, disagreed, arguing that “ultimately his in-person statement is what mattered.”\n\n“We’ve given up on Trump meeting the moment like Reagan’sChallengerspeech, but that was next-level terrible,” Heye told theWashington Examiner.\n\nTrump’s reaction “was not good,” John Pitney, a former Republican aide and now Claremont McKenna College politics professor, concurred, citing the president’s aspersions about the helicopter pilot and air traffic controllers.\n\n“Trump publicly speculated about the causes of the crash, which was not helpful to the investigators or the families of the victims,” Pitney told theWashington Examiner.\n\nTrump started his briefing with a moment of silence to commemorate the loss of life before his first appearance in the room of his second administration became a blame game. In doing so, the current president apportioned most of the responsibility to the policies of former PresidentsBarack ObamaandJoe Bidendespite conceding, “We do not know what led to this crash, but we have strong opinions and ideas.”\n\n“You must have only the highest standards to work in ouraviation system,” Trump told reporters on Thursday morning. “I put safety first. Obama, Biden, and the Democrats put the policy first, and they put politics at a level that nobody’s ever seen because this was the lowest level. Their policy was horrible, and their politics was even worse.”\n\nWhen pressed for proof thatdiversity, equity, and inclusion policies were particularly problematic for the aviation industry and the reason for the accident, Trump repeatedly pointed to “common sense,” contending that “it just could have been.” The president then moderated his criticism somewhat during an executive action signing ceremony on Thursday afternoon.\n\n“It may have. I don’t know. Incompetence might have played a role,” he said in the Oval Office when pushed on the role of race and gender.\n\nDuring that event, Trump also quipped to a reporter who asked if he would visit the disaster site, “What’s the site? The water?”\n\nBut earlier in the briefing room, Trump singled out BidenTransportationSecretaryPete Buttigieg, the first openly gay confirmed Cabinet secretary, sarcastically as “a real winner.”\n\n“Do you know how badly everything has run since he’s run the Department of Transportation?” he said. “He’s a disaster. He’s just got a good line of bulls***.”\n\nTrump has a mixed record regarding his response to humanitarian disasters and is not above politicizing them, as evidenced by last week’s trip toCaliforniaandNorth Carolinaas the two states grapple with their respective recoveries fromfiresand floods. At the same time, he used the trip to demonstrate his capacity for empathy, a trait his critics claim he does not have.\n\nDuring his first term, he was scrutinized for his reaction to, for example,Hurricane Maria, for which his detractors have underscored how he tossed toilet paper rolls as if they were basketballs inPuerto Ricoafter the storm that killed more than 3,000 people. Simultaneously, he has been commended for the kindness he has shown victims ofcrime, especially so-called Angel Families who are victims ofillegal immigrantcrime.\n\nTrump’s briefing on Thursday undermined what had been a professional communications strategy from the White House and his aides, including an initial statement that he had been “fully briefed” and was grateful to the first responders for their “incredible work” but would continue to “monitor the situation.”\n\nWhite House press secretaryKaroline Leavitteven kept a previously arranged booking onFox Newsas news reports emerged about the impact.\n\n“This was not the planned topic of discussion for your program tonight,” Leavitt told hostSean Hannity. “But in light of this breaking news, I have called over to my counterparts at the White House and I can confirm that President Trump has been made aware of this situation.”\n\nTransportation SecretarySean Duffy, a former congressman-turned-Fox News commentator who had been confirmed and sworn in earlier Wednesday, was at an early Thursday morning press conference with Washington, D.C., MayorMuriel Bowser, in addition to Sens.Roger Marshall(R-KS) andJerry Moran(R-KS), both Kansas Republicans, where the flight had originated.\n\nAnother newly confirmed political appointee and Fox News anchor,DefenseSecretaryPete Hegseth, recorded a video update, in which he sported rolled-up sleeves, that same morning.\n\nUpdate on Guantanamo Bay Operations and@SecDefHegseth Addresses Tragic Mishap Involving US Army Helicopterpic.twitter.com/80J5djB4oP\n\nHegseth and Duffy later accompanied Trump and Vice PresidentJD Vanceto the briefing, during which they, too, undercut DEI.\n\n“When you don’t have the best standards in who you’re hiring, it means on the one hand, you’re not getting the best people in government,” Vance said. “But on the other hand, it puts stresses on the people who are already there.”\n\nHegseth added, “We will have the best and brightest in every position possible. … The era of DEI is gone.”\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nTrump went on to sign an executive memorandum on Thursday afternoon directing Duffy and his new Federal Aviation Administration administrator, Christopher Rocheleau, the aviation government regulator, “to review all hiring decisions and changes to safety protocols” since 2021.\n\n“The Obama Administration implemented a biographical questionnaire at the FAA to shift the hiring focus away from objective aptitude,” the memo stated. “The Biden Administration egregiously rejected merit-based hiring, requiring all executive departments and agencies to implement dangerous ‘diversity equity and inclusion’ tactics, and specifically recruiting individuals with ‘severe intellectual’ disabilities in the FAA.”"
    }
}