{
    "question": "What implications might the fatal midair collision near Reagan National Airport have for air traffic coordination and safety protocols between commercial and military aircraft operating in shared airspace?",
    "content": {
        "source_1": "NTSB says that Blackhawk was flying more than 100ft higher than its allowed altitude when collision took place\n\nI would like to be emailed about offers, events and updates from The Independent. Read ourPrivacy notice\n\nThe remains of all 67 people who were killed in the Washington, D.C. plane crash last week have been recovered, authorities announced Tuesday, adding that all but one of the victims has been positively identified.\n\n“This marks a significant step in bringing closure to the families and the community,” said a statement by the operation’s Unified Command.\n\nThe Washington, D.C. Office of the Chief Medical Examiner is working to identify the final crash victim.\n\nThe victims were killed Wednesday night when a U.S. Army Black Hawk helicopter operated by three soldiers collided with American Eagle Flight 5342 as it descended into Reagan National Airport in Arlington, Virginia around 9 p.m. The plane was en route from Wichita, Kansas with 64 people on board.\n\nNo one survived the collision. The accident is the deadliest American aviation disaster in 16 years.\n\nInvestigators on Monday recovered the aft fuselage, right engine and right pylon of the airplane. Authorities previously said they would need to recover additional parts of the aircraft to locate all remains.\n\nOfficials now will work to clear the remainder of the wreckages from the Potomac River, where the jet operated by American Airlines and the helicopter went down. Salvage operations are ongoing with a commitment to the dignified recovery of any additional remains, authorities said.\n\nOn Tuesday, investigators recovered the airplane’s right wing, center fuselage, part of the left wing and left fuselage, significant portions of the forward cabin and cockpit, vertical and horizontal stabilizers, tail cone, rudder, elevators, TCAS computer and quick access recorder.\n\nAnyone who finds parts of the plane or belongings washed up on Potomac or Anacostia River shorelines is asked to call 911. People are asked not to touch the items as they can be critical in supporting impacted families as well as the investigation.\n\nThe U.S. Army Corps of Engineers, U.S. Coast Guard and U.S. Navy Supervisor of Salvage and Diving will hoist major components of the regional jet from the water through Wednesday. Once that’s complete, efforts will shift to recovering additional wreckage from the Black Hawk helicopter.\n\nThe National Transportation Safety Board (NTSB), the lead investigative agency, is working to determine the cause of the accident. A preliminary report is due 30 days from the date of the incident. Little is known about what might’ve caused the incident, but investigators this weekend said they believed the helicopter was flying at 300 feet, 100 feet higher than its allowed altitude.\n\nThe collision occurred between 300 to 350 feet. The NTSB said it needed additional information from the helicopter to verify data points. Officials expect to pull the Sikorsky UH-60 Military Helicopter from the water this week.\n\nThe US Department of Transportation put significant restrictions on helicopters flying along Route 4, a route typically flown by Black Hawks as commercial jets fly above them, following the crash.\n\nSeveral people on board the flight belonged to figure skating communities near Washington, D.C. and Boston, Massachusetts. Many of the victims were children and their parents who were returning to the area after participating in the National Development Camp in Wichita, which brings together about 150 young skaters annually.\n\nOther victims belonged to the United Association of Union Plumbers and Pipefitters in Maryland.\n\nAuthorities said there was a delay in identifying the victims because some of their next of kin reside overseas. Families had been asked to come to the airport to identify their loved ones’ remains.\n\nJoin thought-provoking conversations, follow other Independent readers and see their replies",
        "source_2": "Isabel van Brugen is a Newsweek Reporter based in Kuala Lumpur. Her focus is reporting on the Russia-Ukraine war. Isabel joined Newsweek in 2021 and had previously worked with news outlets including the Daily Express, The Times, Harper's BAZAAR, and Grazia. She has an M.A. in Newspaper Journalism at City, University of London, and a B.A. in Russian language at Queen Mary, University of London. Languages: English, Russian\n\nYou can get in touch with Isabel by emailingi.vanbrugen@newsweek.comor by following her on X @isabelvanbrugen\n\nJoshua Rhett Miller is a Newsweek chief investigative reporter based in New York. His areas of focus include U.S. politics, immigration and society, as well as crime, education and technology. In 2024, Joshua joined Newsweek following roles at the New York Post, FoxNews.com and Fox News Channel, where he worked as an associate producer for \"Shepard Smith Reporting.\" He also has extensive experience covering national and international breaking news, including terror attacks, COVID-related topics and live reports from the United States-Mexico border. The graduate of Pennsylvania State University can be reached at j.miller@newsweek.com.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nFigure skaters and coaches were among those killed when an American Airlines regional jet carrying 64 people collided with a military helicopter while landing at Ronald Reagan National Airport near Washington, D.C., late Wednesday.\n\nU.S. Figure Skating, the sport's governing body in the U.S., confirmed in a statement that \"several members of our skating community\" were on the American Airlines regional jet that collided with an Army Black Hawk over the Potomac River. At least three Russian figure skaters were reportedly among the victims.\n\nAmerican Airlines Flight 5342 was carrying 60 passengers and four crew members when it collided with an Army helicopter en route from Wichita, Kansas, to Reagan National Airport in Washington, D.C., at about 9 p.m. Wednesday.\n\nThree U.S. Army soldiers were aboard the military helicopter, which was taking part in a training flight, U.S. officials speaking on the condition of anonymity said, Reuters reported.\n\nU.S. Figure Skating said in a statement released early Thursday that athletes, coaches and their family members aboard the flight were returning home from the National Development Camp, which was held in conjunction with the U.S. Figure Skating Championships in Wichita, Kansas.\n\nTass, Russia's state-run news agency, reported early Thursday that at least three Russian figure skaters were on the crashed jet, including former Russian championsVadim Naumov, 55, and Evgenia Shishkova, 52,who won the pairs title at the 1994 World Championships.\n\nRussian Media is now reporting that Russian Figure Skating Champions, Evgenia Shishkova and Vadim Naumov were onboard PSA Airlines Flight 5342, when it crashed earlier tonight into the Potomac River, following a Mid-Air Collision with a Helicopter, while approaching Ronald Reagan…pic.twitter.com/0JcudfV4EI\n\nThe news agency said the pair had lived in the U.S. since 1998, where they had worked as coaches.\n\nThe couple's 23-year-old son, Maxim Naumov, a U.S. junior national champion in 2020, was not on the plane, Skating Club of Boston officials told reporters early Thursday.\n\nInna Volyanskaya, 58, a former pair skater who competed for the Soviet Union in the 80s, was reported to have been on board the crashed jet, Tass said.\n\n\"On board the crashed plane was former Russian figure skating coach Inna Volyanskaya,\" an unnamed source told Tass.\n\nNewsweekhas contacted the Russian Foreign Ministry for additional comment.\n\nThe Skating Club of Boston confirmed early Thursday six of its members were among the victims, including coaches Naumov and Shishkova, skaters Jinna Han, 15, and Spencer Lane, 16, and two of their parents, Jin Han and Christine Lane.\n\n\"Our sport and this club have suffered a horrible loss with this tragedy,\" Skating Club of Boston CEO Doug Zeghibe said in a statement. \"Skating is a tight-knit community where parents and kids come together 6 or 7 days a week to train and work together. Everyone is like family ... We are devastated and completely at a loss for words.\"\n\nLane's father, Douglas Lane, said he and his wife Christine adopted their two sons, Spencer and Milo, from South Korea.\n\n\"Whether he was in his home club in Boston, [Spencer] was just loved by everyone,\"Douglas told WPRI. \"From adults running the club to smaller skaters, to the people that are competing for a shot at theOlympics, they all adored him.\"\n\nSpencer, who previously attended Barrington High School in Rhode Island, was a \"force of nature,\" Lane said.\n\nAuthorities believe 67 people, including three aboard the Army helicopter, died in the crash. At least 30 bodies have been recovered.\n\nHamaad Raza, who arrived at Reagan National Airport late Wednesday to pick up his wife, identified Asra Hussain, 26, as one of the passengers on the flight when reached early Thursday.\n\n\"We've got a lot of family coming in, and um, just going to be with them,\" Hussain toldNewsweekbefore ending a brief phone call.\n\nJonathan Campos, 34, was the primary pilot of American Airlines Flight 5342,CNNreported Thursday.\n\nSam Lilley, the second pilot in command, started his flight training in 2019 and was engaged to be married this fall, his fathertold Fox 5 Atlanta.\n\n\"This is undoubtedly the worst day of my life,\" Timothy Lilley, a former Army helicopter pilot, told the station.\n\nSam Lilley, 28, had ties to Savannah, Georgia, and Charlotte, North Carolina, records show.\n\nIn aFacebookpost early Thursday, Lilley said he was \"so proud\" when his son became a pilot.\n\n\"Now it hurts so bad I can't even cry myself to sleep,\" Lilley wrote. \"I know I'll see him again but my heart is breaking. He was doing great in his career and his personal life. He was engaged to get married in the fall.\"\n\nLilley was the first officer, or second pilot in command, on the flight, his father said.\n\n\"It is so devastating to lose someone that is loved so much,\" Lilley wrote in the post.\n\nA North Carolina woman also died in the crash, according to an online fundraiser created Thursday.\n\nWendy Jo Shaffer, of Charlotte, is survived by her husband Nathan and two sons, ages 3 and 1.\n\n\"Her love, kindness, and unwavering spirit touched everyone who knew her, and her absence leaves a void that can never be filled,\"an online fundraiser reads.\n\nThree students and six parents from Fairfax County Public Schools in Virginia also died in the crash, officials confirmed.\n\n\"Two of the parents were current or former FCPS staff members,\" district officialssaid in a statement. \"Multiplying the grief are the siblings, spouses, relatives, friends and colleagues who have lost loved ones.\"\n\nNone of the victims were immediately identified by the district.\n\nAccording to theDelaware News Journal,a Delaware coach and at least two members of the University of Delaware Figure Skating Club were on the flight from Wichita.\n\nAlexandr \"Sasha\" Kirsanov, who coached Angela Yang and Sean Kay, was killed on the flight with his students. The newspaper said Kirsanov's wife, Natalie Gudin, confirmed the news as she spoke with an Eastern European accent.\n\n\"We always use American Airlines when we go to competition,\" Gudin told theDelaware News Journal.\"This time they go without me, and all of them are gone.\"\n\nThe New York Timesreported Thursday night that two Maryland men died while returning from a hunting trip in Kansas — Michael Stovall, 42, and Jesse Pitcher, 30.\n\n\"It was a boys' trip,\" said Shawna Slarb, Stovall's cousin, told theTimes.\"They were there on a duck hunt.\"\n\nU.S. Figure Skating in a statement:\"U.S. Figure Skating can confirm that several members of our skating community were sadly aboardAmerican AirlinesFlight 5342, which collided with a helicopter yesterday evening in Washington, D.C. These athletes, coaches, and family members were returning home from the National Development Camp held in conjunction with the U.S. Figure Skating Championships in Wichita, Kansas. We are devastated by this unspeakable tragedy and hold the victims' families closely in our hearts. We will continue to monitor the situation and will release more information as it becomes available.\"\n\nDonald Trump on Truth Social: \"The airplane was on a perfect and routine line of approach to the airport. The helicopter was going straight at the airplane for an extended period of time. It is a CLEAR NIGHT, the lights on the plane were blazing, why didn't the helicopter go up or down, or turn. Why didn't the control tower tell the helicopter what to do instead of asking if they saw the plane. This is a bad situation that looks like it should have been prevented. NOT GOOD!!!\"\n\n\"What a terrible night this has been. God bless you all!\"\n\nAmerican Airlines CEO Robert Isom in a video statement:\"First and most importantly, I'd like to express our deep sorrow about these events. This is a difficult day for all of us at American Airlines, and our efforts now are focused entirely on the needs of our passengers, crew members, partners, first responders, along with their families and loved ones.\n\n\"Our cooperation is without pause, and we want to learn everything we can about today's events. That work will take time, but anything we can do now, we're doing, and right now that means focusing on taking care of all passengers and crew involved, as well as their families.\"\n\nTeam USA figure skater Luke Wang on X (formerly Twitter):\"Praying for all those on the flight from wichita to dc. among the passengers were skaters and coaches. absolutely heartbreaking. As we hold everybody on board in our thoughts, we will continue to wait for official information to be released.\"\n\nFirst responders are continuing recovery efforts in the Potomac River. The operation is likely to take days, authorities said.\n\nRunways at Reagan National Airport reopened at 11 a.m. Thursday.\n\nIsabel van Brugen is a Newsweek Reporter based in Kuala Lumpur. Her focus is reporting on the Russia-Ukraine war. Isabel joined Newsweek in 2021 and had previously worked with news outlets including the Daily Express, The Times, Harper's BAZAAR, and Grazia. She has an M.A. in Newspaper Journalism at City, University of London, and a B.A. in Russian language at Queen Mary, University of London. Languages: English, Russian\n\nYou can get in touch with Isabel by emailingi.vanbrugen@newsweek.comor by following her on X @isabelvanbrugen\n\nJoshua Rhett Miller is a Newsweek chief investigative reporter based in New York. His areas of focus include U.S. politics, immigration and society, as well as crime, education and technology. In 2024, Joshua joined Newsweek following roles at the New York Post, FoxNews.com and Fox News Channel, where he worked as an associate producer for \"Shepard Smith Reporting.\" He also has extensive experience covering national and international breaking news, including terror attacks, COVID-related topics and live reports from the United States-Mexico border. The graduate of Pennsylvania State University can be reached at j.miller@newsweek.com.\n\nIsabel van Brugen is a Newsweek Reporter based in Kuala Lumpur. Her focus is reporting on the Russia-Ukraine war. Isabel joined Newsweek in 2021 and had previously worked with news outlets including the Daily Express, The Times, Harper's BAZAAR, and Grazia. She has an M.A. in Newspaper Journalism at City, University of London, and a B.A. in Russian language at Queen Mary, University of London. Languages: English, Russian\n\nYou can get in touch with Isabel by emailingi.vanbrugen@newsweek.comor by following her on X @isabelvanbrugen\n\nIsabel van Brugen is a Newsweek Reporter based in Kuala Lumpur. Her focus is reporting on the Russia-Ukraine war. Isabel                                    ...Read more",
        "source_3": "ByELENA SALVONI, SENIOR FOREIGN NEWS REPORTERandJOE HUTCHISON, US NEWS REPORTERandNICK ALLEN, US NEWS EDITOR (POLITICS)\n\nPublished:02:34 BST, 30 January 2025|Updated:10:37 BST, 31 January 2025\n\nAnAmerican Airlinespassenger jet with 64 people on board has crashed midair into a military helicopter while attempting to land at Reagan National Airport in Washington.\n\nEmergency services in the city are searching the nearby Potomac River after the jet plummeted into the water just before 9pm on Wednesday night.\n\nOfficials have not said how many people died in the accident but have suggested that there may be no survivors. It is the first major commercial air crash in the US in 16 years.\n\nDive teams have been scouring three debris fields and have recovered one of the jet's data recorders, also known as the black boxes, CBS News reports.\n\nEmergency workers are facing tough conditions as they search the icy river for possible survivors, with the bodies of 19 people reported to have been recovered so far - a number which is expected to rise.\n\nAmong the dead are several members of the US figure skating community, including athletes, coaches and their family members, the sport's governing body has said.\n\nThey had been returning home from the National Development Camp, an advanced training camp for promising young athletes which is held in conjunction with the US Figure Skating Championships, US Figure Skating said..\n\n'We are devastated by this unspeakable tragedy and hold the victims' families closely in our hearts. We will continue to monitor the situation and will release more information as it becomes available,' it added in a statement.\n\nAs many as 15 people on the flight may have been involved in figure skating, according to reports.\n\nRussian figure skaters Yevgenia Shishkova and Vadim Naumov, were also on board the plane, Russian state-run TASS news agency reported, citing a source.\n\nMarried couple Shishkova, 53, and Naumov, 56, won the world championship in pairs figure skating in 1994.\n\nTheir son Maxim Naumov, 23, a prominent American skater recently placed fourth at the US championships in Kansas. He is not believed to have been on the plane.\n\nIf their deaths are confirmed, the couple would be the first named victims in the tragedy, which is feared to have claimed dozens of lives.\n\nSurveillance footage taken from inside the airport also captured the moment the two collided in midair\n\nEmergency response units assess airplane wreckage in the Potomac River\n\nPart of the wreckage is seen as rescue boats search the waters of the Potomac River\n\nRescue boats search the waters of the Potomac River for survivors after the deadly plane crash\n\nThe Federal Aviation Authority said that the jet, a Bombardier CRJ700, collided with a Sikorsky H-60 Black Hawk helicopter while on approach to Runway 33\n\nRussian figure skaters Yevgenia Shishkova and Vadim Naumov are reported to have been on board the American Airlines plane that crashed into a Black Hawk helicopter\n\nThe plane was being operated as an American Eagle Flight by PSA Airlines for its parent carrier American Airlines\n\nTents have been set up in the vicinity following the plane crash, pictures show\n\nEmergency response teams are seen at the scene of the crash in the Potomac River\n\nAn American Eagle, operated by PSA Airlines, a CRJ-700 aircraft arrives at Ronald Reagan Washington National Airport on January 22, 2025 in Arlington\n\nWashington DC Mayor Muriel Bowser said in a statement on X: 'Tonight, as our first responders continue their efforts, we are sending our love and prayers to the families, loved ones, and communities who are experiencing loss during this terrible tragedy.'\n\nShe announced that a briefing will take place at 7.30am ET (12.30pm UK time) as rescuers continue to search the Potomac river.\n\nThe airline has confirmed that there were 60 passengers and four crew members on Flight 5342 from Wichita,Kansas, to the capital when the collision happened.\n\nThe plane is said to have split in two and is in around seven feet of water, while the helicopter is upside down and is unstable, according to the outlet.\n\nImages captured at the scene show emergency officials on boats around what appears to be part of the fuselage and a wing jutting out of the river.\n\nThe Federal Aviation Authority said that the jet, a Bombardier CRJ700, collided with a Sikorsky H-60 Black Hawk helicopter while on approach to Runway 33.\n\nDefense officials have confirmed that the Black Hawk was an Army chopper carrying three soldiers on a training flight.\n\nThe plane was being operated as an American Eagle Flight by PSA Airlines for its parent carrier American Airlines.\n\nAudio from LiveATC.net, a respected source for in-flight recording, captured the final communications between the three crew members of the helicopter - call sign PAT25 - before it collided with the CRJ700 Bombardier jet carrying 64 passengers and crew.\n\n'PAT25, do you have a CRJ in sight? PAT25, pass behind the CRJ,' an air traffic controller said at 8.47pm local time on Wednesday (01.47 GMT on Thursday).\n\nSeconds later, another aircraft called in to air traffic control, saying, 'Tower, did you see that?' - apparently referring to the crash. An air traffic controller then redirected planes heading to runway 33 at Reagan Washington National Airport to go around.\n\nThe explosion in midair occurred over the frigid Potomac River near the airport.\n\n'Crash, crash, crash, this is an alert three,' one of the air traffic controllers can be heard saying in the audio from around the time of the crash.\n\n'I don't know if you caught earlier what happened, but there was a collision on the approach into 33. We're going to be shutting down operations for the indefinite future,' another controller remarked.\n\n'Both the helicopter and the plane crashed in the river,' a third air traffic controller can be heard saying.\n\n'It was probably out in the middle of the river,' the controller said. 'I just saw a fireball and then it was just gone. I haven't seen anything since they hit the river. But it was a CRJ and a helicopter that hit.'\n\nPictured: Russian figure skaters Yevgenia Shishkova and Vadim Naumov , who were reportedly on the plane, with their son Maxim, 23, a prominent US figure skater\n\nSignage displays an emergency message inside Ronald Reagan National Airport following a collision between an American Eagle flight and an Army helicopter in Washington\n\nAt a press conference last night, officials could not give any further information on casualties and could not confirm whether any bodies had been recovered.\n\nTransportation Secretary Sean Duffy did say that the FAA would study the crash and look at possibly changing flight paths around Reagan National.\n\nOfficials said there were 300 first responders out working in 'complex and extremely rough' conditions, citing ice still in the cold water.\n\nFire and EMS Chief John Donnelly said; 'If you can imagine, the river is a large black spot at night with no lights on it, except for a few buoy lights.'\n\nThe airport said in a post to X: 'All takeoffs and landings have been halted at DCA. Emergency personnel are responding to an aircraft incident on the airfield. The terminal remains open. Will update.'\n\nImages taken at the scene show scores of emergency service teams along the riverside.\n\nFootage has also emerged online of helicopters with search lights passing over the Potomac River.\n\nVideo from an observation camera at the nearby Kennedy Center shows two sets of lights consistent with aircraft appearing to conjoin in a fireball.\n\nSurveillance footage taken from inside the airport also captured the moment the two collided in midair.\n\nDefense officials have confirmed that the Black Hawk was an Army chopper that was carrying three soldiers at the time who were on a training flight\n\nDefense officials have confirmed that the Black Hawk was an Army chopper that was carrying three soldiers at the time\n\nA search and rescue boat operates along the Potomac River near the site of the crash after American Eagle flight 5342 collided with a helicopter\n\nA helicopter assists with search and rescue operations over the Potomac River\n\nVideo from an observation camera at the nearby Kennedy Center shows two sets of lights consistent with aircraft appearing to conjoin in a fireball\n\nThe plane is said to have split in two and is in around seven feet of water, while the helicopter is upside down and is unstable\n\nLights from emergency vehicles are seen at Reagan National Airport in Washington, DC, after an air crash near the Potomac Rive\n\nEmergency equipment stages at Gravelly Point, north of Ronald Reagan Washington National Airport, along the Potomac River, Wednesday, Jan. 29, 2025\n\nFebruary 12, 2009: a Colgan Air Bombardier aircraft flying from New York to the small town of Buffalo crashes, killing the 49 passengers onboard.\n\nJanuary 15, 2009: a US Airways Airbus A320 carrying more than 150 people collides with a flock of birds before making a spectacular landing on the Hudson River in New York, thanks to the pilot's exemplary actions.\n\nAugust 27, 2006: a regional transport plane uses a wrong, unlit runway, rather than the designated one and crashes shortly after taking off from Lexington airport, Kentucky, killing around 50 people onboard.\n\nDecember 19, 2005: a Grumman G-73T Mallard hydroplane operated by Ocean Airways, connecting Miami and an island in the Bahamas, crashes into the sea shortly after takeoff, killing both crew members and 18 passengers.\n\nOctober 19, 2004: a BAE Jetstream 32 operated by AmericanConnection crashes near Kirksville, Missouri due to poor visibility. Both pilots and 11 out of the 13 passengers are killed.\n\nJanuary 8, 2003: a US Airways Beechcraft 1900, flying between Charlotte, North Carolina and Greenville, South Carolina, crashes into a hangar shortly after takeoff. Both pilots and the 19 passengers onboard are killed.\n\nNovember 12, 2001: two months after the September 11 attacks, an American Airlines Airbus A-300, flying from New York to Saint-Domingue, crashes shortly after taking off from JFK airport. The 251 passengers and nine crew members are killed. On the ground, several houses are destroyed or damaged, and five residents killed.\n\nJanuary 13, 1982: an Air Florida Boeing 737-222 hits a bridge over the Potomac before crashing into the river just after takeoff during a snowstorm. The crash kills 78 people including four motorists who were on the bridge.\n\nFlightradar tracking data shows the final approach of the flight as it crosses over the Potomac, before it cuts out.\n\nNBCChief Meteorologist Doug Kammerer said that at the time of the incident the water temperature in the river was around 37 degrees Fahrenheit.\n\nKammerer said that at that temperature someone in the water has only 15 to 20 minutes before they start suffering from hypothermia.\n\nHamaad Ramza spoke withWUSAon Wednesday evening and revealed that his wife had been on the plane when it crashed.\n\nHe said: 'I'm just praying that someone is pulling her out of the river right now as we speak. I'm just praying to God.'\n\nAs the rescue mission continued, a small crowd gathered silently on the west bank of the Potomac River at Daingerfield Island in Virginia.\n\nThey watched as three helicopters shone spotlights on the black water scouring for survivors.\n\nThere was a small debris field on the water and a boat, and it was believed divers had gone in.\n\nVast numbers of emergency vehicles were gathered on the east bank of the river, on the Washington D.C. side, their lights illuminating the Capitol building and the Washington Monument.\n\nMore emergency vehicles waited on the end of the airport runway to the north of where the crash happened. Police vehicles closed off roads accessing the airport building, which was virtually empty.\n\nAs the disaster unfolded the two terminal buildings at Reagan National Airport were eerily quiet.\n\nIn Terminal 2, where the flight had been due to arrive, digital signs read: 'Due to an emergency all flights are being held on the airfield. For customers on departing flights please check with your airline representative.'\n\nA smattering of passengers waited for early departing flights, reading about news of the crash on their phones.\n\nThrough a vast window overlooking the airfield they could see a forest of red and blue lights from emergency vehicles on the runway beyond the parked planes.\n\nA Red Cross van brought supplies of bottled water and food to the terminal, and a group of men in khaki arrived to join the rescue effort.\n\nKansas Senator Roger Marshall posted to his X saying: 'Tonight, we received devastating news of what can only be described as nothing short of a nightmare.\n\nVast numbers of emergency vehicles were gathered on the east bank of the river, on the Washington D.C. side, their lights illuminating the Capitol building and the Washington Monument\n\nRescue boats work the scene on the Potomac River near Ronald Reagan Washington National Airport, Wednesday, Jan. 29, 2025, in Arlington\n\nBoats work the scene on the Potomac River near Ronald Reagan Washington National Airport, Wednesday, Jan. 29, 2025\n\n'A plane, traveling to the Nation's capital from Wichita, KS carrying roughly 60 passengers collided with a Military helicopter.\n\n'My prayer is that God wraps his arms around each and every victim and that he continues to be with their families.\n\n'There are no words that can make telling this story any easier. I ask the world to join me in praying for Kansas this evening, the first responders, rescue crews, and all those involved in this horrific accident.\n\n'I have been in contact with local and national authorities asking for answers and will continue to demand more information on how this unfolded.'\n\nThe White House has also confirmed the nature of the crash, with press secretary Karoline Leavitt confirming live on air that President Trump had been made aware.\n\nEmergency services in Washington DC said that a small aircraft had crashed in the Potomac River near the Reagan National Airport, seen here\n\nEmergency services in the city are searching the Potomac River near the airport following the incident just before 9pm on Wednesday night\n\nTrump said in a statement: 'I have been fully briefed on the terrible accident which just took place at Reagan National Airport. May God Bless their souls.\n\n'Thank you for the incredible work being done by our first responders. I am monitoring the situation and will provide more details as they arise.'\n\nAmerican Airlines said in a statement: 'We're aware of reports that American Eagle flight 5342, operated by PSA, with service from Wichita, Kansas (ICT) to Washington Reagan National Airport (DCA) has been involved in an incident. We will provide information as it becomes available.'\n\nIn a post to X, Vice President JD Vance said: 'Please say a prayer for everyone involved in the mid-air collision near Reagan airport this evening.\n\n'We're monitoring the situation, but for now let's hope for the best.'\n\nAn FAA statement said: 'A PSA Airlines Bombardier CRJ700 regional jet collided in midair with a Sikorsky H-60 helicopter while on approach to Runway 33 at Reagan Washington National Airport around 9 p.m. local time.\n\n'PSA was operating as Flight 5342 for American Airlines. It departed from Wichita, Kansas.  The FAA and NTSB will investigate. The NTSB will lead the investigation.'\n\nDailyMail.com has approached the Metropolitan Washington Airports Authority for more information.\n\nAmerican Airlines has asked that anybody that believes they had loved ones on the flight to call 800-679-8215.\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nBy posting your comment you agree to ourhouse rules.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with ourPrivacy Policy."
    }
}