{
    "question": "How could M23’s control of much of Goma, the killing of U.N. peacekeepers, and the confirmed presence of Rwandan troops shape the humanitarian situation for displaced civilians and the course of regional and international responses?",
    "content": {
        "source_1": "Kenya has announced a virtual crisis summit, but Congolese state media says President Felix Tshisekedi will not attend.\n\nRwanda-backed M23 rebels havetightenedtheir grip on Goma, the biggest city in the eastern Democratic Republic of the Congo (DRC), signalling a major blow to the Congolese army and a serious escalation in a years-long conflict that has seen hundreds of people killed and millions displaced.\n\nMarch 23 Movement (M23) fightersenteredGoma on Sunday and claimed to have taken control of the city a day later. Three days of clashes between Congolese armed forces and the Rwanda-backed M23 rebels have killed more than 100 people and wounded nearly 1,000 people in Goma.\n\nOn Wednesday, while fighting in the city had largely eased, intermittent gunfire continued in the Goma’s northern areas, including Katoyi, Mabanga, Majengo, Kibwe and Turunga, where the situation “remains tense”, according to local DRC media outlets.\n\nIn a post on X, Bertrand Bisimwa, the head of M23’s political wing, said the group’s fighters were in the process of bringing “the last pockets of insecurity [in Goma] … under control”.\n\n“Our army is working hard to guarantee total security, complete tranquility and definitive peace, as is the case for all their compatriots living in liberated zones,” Bisimwa said.\n\nAs residents in Goma emerged from their homes on Wednesday, they saw the M23 armed group and Rwandan troops had seized the airport and were controlling most of the city centre and neighbourhoods.\n\n“After days of heavy fighting, there’s no audible sound of gunfire in the city centre and the streets normally packed with cars during rush hour and the bustling markets are relatively empty,” Al Jazeera’s Malcolm Webb said, reporting from Kenya, citing Goma residents.\n\nSpeaking to AFP news agency by phone, Rwanda’s regional ambassador Vincent Karega said the armed group would not stop its offensive at Goma.\n\n“They [M23] will continue into South Kivu, because Goma cannot be an end on its own, unless in between they get good dialogue and negotiation with the government in Kinshasa, which I doubt.”\n\nHe added that it is “possible” M23 fighters could press beyond eastern DRC because DRC’s “forces and military capabilities” are “concentrated in Goma”.\n\nFive diplomatic and security sources told the news agency Reuters that M23 fighters were on Wednesday advancing south towards Bukavu, the capital of South Kivu province.\n\nSeveral international aid groups have raised the alarm over thehumanitarian situationin the Congolese city, with the United Nations warning of potential mass displacement, severe food shortages, overburdened hospitals and disease outbreaks.\n\nDoctors Without Borders (Medecins Sans Frontieres, or MSF) said in a statement that its team in Goma also continues to treat the influx of wounded at Kyeshero Hospital.\n\n“At Kyeshero Hospital, a bullet pierced the roof of the operating theatre during an operation,” said Virginie Napolitano, MSF’s emergency coordinator in North Kivu.\n\n“Several of our stocks of equipment and medicines have been looted, jeopardising our medical assistance inside and outside Goma. Armed looting has also affected our colleagues in Goma. One of them was wounded by gunshot in his home during an attack.”\n\nThe International Committee of the Red Cross (ICRC) also expressed alarm over the “devastating” impact on civilians of the fighting in and around Goma.\n\n“We are getting a large number of calls from injured and wounded people who feel lost and abandoned. Humanitarian workers must have safe access to meet people’s most urgent needs, such as food, healthcare, electricity and safe drinking water,” said Francois Moreillon, head of the ICRC’s delegation in the DRC, calling on the parties to the conflict to abide by international humanitarian law.\n\nThe World Food Programme’s spokesperson Shelley Thakral said that “depending on the duration of violence, the supply of food into the city could be severely hampered”.\n\nM23 is one of the hundreds of armed groups operating in the eastern DRC. The DRC, the UN and several other countries have accused Rwanda of supporting the group, which Kigali denies.\n\nThe group is comprised of Tutsi fighters and claims it is fighting for the rights of the DRC’s minority Tutsi population. It emerged in 2012 after a group from the armed forces of the DRC (FARDC) broke away, complaining of ill-treatment.\n\nIn 2012, the M23 captured Goma and controlled it for about a week before surrendering it after mounting international pressure on Rwanda, including the suspension of aid from the United States and United Kingdom.\n\nHowever, the DRC faced a resurgence of M23 violence in 2022. The group has since advanced on Goma, seizing territory in battles with the Congolese army and two peacekeeping missions: the UN mission to the DRC (MONUSCO) and the South African Development Community (SADC) mission in the DRC.\n\nThe DRC and the head of the UN peacekeeping mission claim Rwandan troops are active in Goma, supporting M23. But Rwanda has said it is defending itself against the threat from Congolese militias, without directly addressing whether its troops have crossed the border.\n\nThe US and European nations have called for a ceasefire, while some countries including Belgium have also issued DRC travel advisories. The UN has urged Rwanda to stop supporting M23.\n\nOn Wednesday, US Secretary of State Marco Rubio held talks with Rwanda’s President Paul Kagame and “urged for an immediate ceasefire” in the region.\n\nKagame acknowledged “the need to ensure a ceasefire in eastern DRC and address the root causes of the conflict once and for all”.\n\nDRC President Felix Tshisekedi, however, will not attend an emergency virtual meeting with Kagame that had been scheduled for Wednesday, according to Congolese state media.\n\nHe is instead expected to address the nation on Wednesday, in his first public statement since M23 entered Goma, according to state broadcaster RTNC.\n\nAl Jazeera’s Webb said that the situation will remain tough for Goma citizens until the fighting completely stops.\n\n“Over the last couple of days, thousands of people have crossed to Gisenyi, the adjoining city in neighbouring Rwanda. Many others have remained in Goma,” he said.\n\nHe noted that the electricity has been off for at least five days now, and the internet has also been cut off in most places.\n\n“Certainly for many people … times are very tough,” he added.\n\nThe International Crisis Group (ICG), a global think tank aimed at resolving deadly conflict, also released a statement on the violence in eastern DRC, saying negotiation is desperately needed to stop bloodshed from spreading.\n\n“Left unchecked, the fighting could spread throughout the Great Lakes region, recalling the horrors of the late 1990s and early 2000s, when millions died amid a multi-country war in the Congo,” it said.\n\nThe ICG also suggested that a possible way to pull back from the brink is for East African leaders to propose a compromise: M23 withdraws from Goma and an “alternative African force, possibly mandated from the East African Community, [takes] administrative control of the city” during negotiations.",
        "source_2": "Reporting by Benoit Nyemba and Ange Kasongo in Kinshasa, David Lewis, John Irish, Sonia Rolley and George Obulutsa; Writing by Anait Miridzhanian;\nEditing by Ros Russell and Andrew Cawthorne\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab",
        "source_3": "Over half a million people have reportedly been displaced by the battle raging between Democratic Republic of the Congo (DRC) security forces and M23 insurgents for control of Goma, a strategic city in the eastern Congo.\n\nDRC Foreign Minister Therese Kayikwamba Wagersaidthe “humanitarian situation continues to deteriorate” after M23 rebels launched a major offensive at the beginning of January.\n\nOn Monday, the rebelsenteredGoma, the capital of North Kivu province. Over a dozen peacekeepers working for MONUSCO, the U.N. peacekeeping mission to the Congo, were killed, along with government soldiers, allied militia fighters, and civilians.\n\nAs of Tuesday, much of the city was under M23’s control, including the airport. U.N. personnel remaining in the city have been instructed to shelter in their bases while rebel forces rampage through the streets.\n\nSome government forces have surrendered, some retreated from the city, and a few are dug into defensive positions. Residents reported nearly constant gunfire across the city on Monday night. On Tuesday morning, security officials conceded the DRC military had lost the battle to control Goma’s airport – a defeat that will cut off both resupply to government forces and humanitarian aid.\n\n“There are real risks of breakdown of law and order in the city, given the proliferation of weapons,”warnedU.N. spokesman Stephane Dujarric.\n\n“The situation in Goma requires urgent and coordinated international action,” MONUSCO deputy special representative Vivian van de Perre told the U.N. Security Council (UNSC) on Monday.\n\n“These attacks continue to ravage the city, killing, injuring, traumatizing and displacing civilians and exacerbating the crisis,” van de Perre said.\n\nU.N. humanitarian spokesman Jens Laerke said “heavy small arms fire and mortar fire” were reported across Goma, along with “the presence of many dead bodies in the streets.”\n\nLaerke relayed reports of “rapes committed by fighters” and “looting of property,” along with attacks on “humanitarian health facilities.” Hospitals still in operation have been overwhelmed by casualties.\n\nThe International Committee of the Red Cross (ICRC)saidcivilians with bullet and shrapnel wounds have been transported to Goma’s hospitals by bus, motorcycle, and stretcher. Some of the wounded have been “forced to wait lying on the floor because of the lack of space.”\n\nThe ICRC condemned the use of artillery against densely populated areas for causing a huge number of civilian casualties, including artillery fire against refugee camps.\n\n“The parties to the conflict must abide by international humanitarian law, taking care always to spare civilians and their property. They must also take every possible measure to minimize the humanitarian consequences of their military operations,” said Francois Moreillon, head of ICRC operations in the Congo.\n\n“We are getting a large number of calls from injured and wounded people who feel lost and abandoned. Humanitarian workers must have safe access to meet people’s most urgent needs, such as food, health care, electricity and safe drinking water,” he said.\n\nMoreillon also condemned the looting of medical warehouses and issued a disturbing warning about threats to a laboratory where samples of dangerous germs are kept, including Ebola.\n\n“Should it be hit in any way by shells which could affect the integrity of the structure, this could potentially allow germs to escape, representing a major public health issue well beyond the borders,” he cautioned.\n\nGoma was already struggling to deal with thousands of internally displaced persons (IDP) driven from the eastern Congo by the rebel advance. Those IDPs are now displaced once again, fleeing from Goma to seek refuge at U.N. bases. Many have fled across the border into Rwanda, which is actively assisting the M23 insurgency.\n\nBoth the U.N. and DRC officialsconfirmedRwandan troops entered Goma along with the M23 insurgents on Monday. International observers also accuse Rwanda of arming and training the rebels, who are suspiciously well-equipped and disciplined for a band of extremists living in the far reaches of the Congo. Captured M23 rebels have said they were trained by Rwandan special forces officers.\n\n“There was no question that there are Rwandan troops in Goma supporting the M23,” U.N. peacekeeping chief Jean-Pierre Lacroix said on Wednesday.\n\nProtesters in the DRC marched against Rwanda’s involvement in the war, setting fires around the Rwandan embassy in Kinshasa on Tuesday:\n\n“What Rwanda is doing is with the complicity of France, the U.S. and Belgium. The Congolese people are fed up. How many times do we have to die?” one protester asked, as angry crowds also formed around the French, Kenyan, Dutch, Belgian, Ugandan, and American embassies. Uganda has itsown entanglementswith some of the many armed factions in the eastern Congo.\n\nRwandan officials claimed their soldiers entered Goma to protect Rwandan interests against tribal extremists lurking there. Rwanda’s government, like the M23 insurgency, is dominated by members of the Tutsi tribe, which wastargeted for genocideby its enemies in the Hutu tribe in the 1990s.\n\n“This fighting close to the Rwandan border continues to present a serious threat to Rwanda’s security and territorial integrity, and necessitates Rwanda’s sustained defensive posture,” the Rwandan Foreign Ministry said on Sunday.\n\nThe Foreign Ministry rejected allegations that Rwanda funded, trained, and directed the rebel assault on Goma as “misguided or manipulative.”\n\nThe Rwandans, in turn, accused DRC President Felix Tshisekedi and his top officials in North Kivu of collaborating with the Democratic Forces for the Liberation of Rwanda (FDLR), a Hutu militia whose membership includes perpetrators of the 1990s genocide.\n\nTheNew York Times(NYT)notedon Tuesday that the Rwanda-Congo conflict is making Western leaders very uncomfortable because Rwandan President Paul Kagame has been the toast of the international community ever since the Tutsi genocide. Rwanda has also been helpful in regional counter-terrorism operations and it looks like a much safer bet for economic and political investment than the DRC, a poor nation that constantly struggles with disease, famine, and political upheaval.\n\nKagame has held power for decades and over the past two years has marched up to four thousand troops across the border to collude with the ultra-violent M23 extremists in a war of conquest against the DRC.\n\nTheir past history with Kagame and Rwanda —not to mention a big minerals deal the European Union (EU) signed with Rwanda in 2024 — could make the U.N. and EU reluctant to apply sanctions.\n\nFormer U.N. adviser Dino MahtanitoldtheNew York Times:\n\nPowerful Western countries have for long been reticent about punishing Rwanda, which cultivated a reputation as a donor darling. While some are now finally demanding Kagame pull back support to M23, they are unlikely to take action against what they see as the military solution against jihadis in Mozambique.\n\nThe Trump administration does not appear to share that reluctance. Secretary of State Marco Rubio has spoken with both Kagame and Tshisekedi since the assault on Goma began. On Monday, hetoldTshisekedi the United States respects the “sovereignty of the DRC” and condemns the assault on Goma.\n\nOn Tuesday, Rubio told Kagame the United States is “deeply troubled by the escalation of the ongoing conflict in the eastern DRC, particularly the fall of Goma to the Rwandan-backed M23 armed group.”\n\nRubio told Kagame the United States wants an “immediate ceasefire in the region, and for all parties to respect sovereign territorial integrity.”"
    }
}