{
    "question": "What are the potential short- and long-term impacts on communities, labor markets, and perceptions of justice as ICE begins carrying out the Trump administration’s mass deportation plan, including arrests at formerly protected areas?",
    "content": {
        "source_1": "Instead of cutting back on undocumented immigrants, the new administration will be forced to provide more visas to keep food flowing to stores.\n\nTeresa Cotsirilos is a staff writer and producer at the Food & Environment Reporting Network.\n\nTed Genoways is a senior editor at the Food & Environment Reporting Network.\n\nAt least 70 percent of the agricultural workers who harvest crops in the U.S. were born outside the country. | Godofredo A. Vásquez/AP\n\nThis article was produced in collaboration with theFood & Environment Reporting Network, an independent, nonprofit news organization.\n\nThe U.S. food system is propped up by low-wage immigrant workers from farm to table. From California’s strawberry fields to Florida’s orange orchards,at least 70 percentof the agricultural workers who harvest our crops were born outside the U.S. In our meatpacking plants, nearly half of the people who slaughter, cut and package beef, pork and poultry were born elsewhere. Andover a quarter of the truck driverswho shuttle cows to slaughterhouses and steaks to supermarkets are foreign-born, too.\n\nWhile many of these workers are undocumented —about 40 percentof U.S. farmworkersare undocumented, for instance — research suggests that amajority of them are legal immigrants. In 2020, the total number of immigrants with Temporary Protected Status, or TPS, a designation for immigrants from countries with unsafe conditions to reside and work legally in the United States, was just over 406,000. At that time,more than 76,000of those immigrants — nearly 19 percent — were employed in the food industry. But the Trump administration has promised to crack down on documented and undocumented immigrants alike. Trump’s border czar Tom Homan is consideringcreating a “hotline”so residents can report undocumented people. The new administration is expected totry to end TPS protectionsand has flirted withstripping naturalized citizensof their status. The food industry’s immigrant workforce is massive, and the administration has put it squarely in its crosshairs.\n\nIf the Trump administration follows through on its most ambitious mass deportation plans, who exactly will replace these essential workers? According to several high-ranking members of Trump’s incoming administration, Americans will. In an interview withThe New York Timeslast year, Trump’s deputy chief of staff for policyStephen Miller claimedthat the jobs held by deported workers would be filled by U.S. citizens, “who will now be offered higher wages with better benefits to fill these jobs.” Vice President JD Vance has madesimilar arguments.\n\nLabor organizers, public interest attorneys and labor economists we have interviewed believe that rather than improving the quality of food industry jobs to attract more American-born workers, employers will continue hiring low-wage immigrants. And the real development that we expect? The Trump administration will provide food industry employers with low-wage immigrant workers by expanding the existing H-2 visa program. While this would be a boon for employers, this expanded H-2 workforce would likely be more vulnerable to abuse than many of the undocumented workers, asylum recipients and other immigrants it would be replacing. And potentially, this change would also come at American workers’ expense.\n\nThe H-2 programs, which wereimplemented in their current form during the Reagan administration in the 1980s, provide temporary work visas to seasonal, “unskilled” workers from other countries. H-2A visas are reserved for agricultural workers specifically, and H-2B visas are used by a wider variety of sectors that claim to be experiencing labor shortages. In the agricultural sector, the number of H-2A workers that farmers brought into the countryspiked by over 64percent between 2017 and 2022 and hascontinued to grow. In food manufacturing, the number of meatpacking plants that received H-2B workers has alsoskyrocketedin recent years. States with seasonal tourism, such as Florida and Virginia, employmore than 20,000 H-2B workersin food-related hospitality jobs, such as waiters and dishwashers. (The National Restaurant Association has repeatedly called for immigration reform,saying bluntly: “Employers need to be able to recruit and hire a legal workforce.”) The H-2 programs’ many fans appear to include Trump himself, whose businesses haveincreasingly reliedon foreign labor and employedover 1,000 H-2 workersin the past two decades; cooks, bartenders and other food workers were among those hired, some of them on staff at his Mar-a-Lago club.\n\nBut while the food industry may like the H-2 program, these visas are notoriously abusive to foreign workers. That’s because they effectively create a captive workforce: In contrast to other immigrant workers in the U.S. — including recipients of certain humanitarian programs, like TPS — H-2 workers’ presence in the country is tied to a particular job and employer. H-2 employees are eligible to work for whoever sponsors their visa, and it can be prohibitively difficult for them to switch jobs even if they’re mistreated. If they quit, they’re sent back to their home countries, which would ruin many H-2 workers and their families financially. (Over half of all H-2A farmworkersenter the country in debt to illegal recruiters, who charge fees for connecting workers with job contracts.) Workers can file a complaint with the U.S. Department of Labor (DOL), but they’re unlikely to get a swift result. As of October 2023, the underfunded agency had750 investigators on staff, and they were tasked with monitoring over 11 million employers. Let’s just say they’re a little backlogged.\n\nPredictably, some employers take advantage of the power the H-2 program gives them over their employees. The nonprofit Polaris, which runs a U.S. human trafficking hotline, hasconnectedthe H-2A visato rampant human trafficking, as have a number ofcriminal casesandmediainvestigations. Wage theft is also a pervasive problem. In aninterview with Prism media, Mike Rios, a DOL regional agricultural enforcement coordinator, said that wage theft is “baked into” the H-2A visa, and described the program as the “literal purchase of humans.” An Economic Policy Institute report, published in 2022, found that migrants with H-2B visas are being “employed in industries in which there isextensive wage theft and lawbreaking by employers” — with the largest share, more than half of all penalties assessed between 2000 and 2021, coming from the food industry.\n\nBecause the U.S. food system is so dependent on immigrant labor to function, the deportations have the potential to profoundly destabilize the food supply.|Sandy Huffaker/AFP/Getty Images\n\nH-2 workers have so little bargaining power that some employers prefer to hire them over U.S. citizens — which ends up disenfranchising the American-born workers Trump and Miller say their deportations will benefit. Under federal law, employers must show they were unable to hire American workers before they’re approved to hire H-2 workers, but some employers circumvent that rule and commit visa fraud to avoid hiring Americans at higher rates. The United Food and Commercial Workers (UFCW) has filed astring of complaintswith the DOL, alleging that meatpacking companies have repeatedly requested increased allocations of H-2B workers as a way ofundercutting wages.\n\nSo much for “America first.” Unsurprisingly, H-2 visas have been fiercely criticized fromtheleft,rightandcenter, and immigration hard-liners in Trump’s orbit, who object to increases even in legal immigration, have called for them to be abolished.In Project 2025, author Jonathan Barry notes that H-2A agricultural workers “suffer frequent employer abuse,” and that the program should be “phased out.”\n\nBut despite this rhetoric fromwithin Trump’s camp, we expect Trump to expand the H-2 program. He’s done it before. In Trump’s first term, temporary work visa programssteadily grew; by 2019, they were 13 percent larger than they had been under the Obama administration. Then, during the pandemic, his administration issued a series of emergency measures that made H-2A and H-2B visasmoreflexibleand employer-friendly. Workers were allowed to stay in the country for longer periods of time, in part because they had been deemed “essential workers,” and wages for H-2A workerswere effectively frozen. And if Trump’s second presidency is faced with a labor shortage of his own making, he might have no other choice but to expand the program again.\n\nWe don’t know how extensive the administration’s mass deportations will be, but because the U.S. food system is so dependent on immigrant labor to function, the deportations have the potential to profoundly destabilize the food supply. And while the Stephen Millers of the world might hope these deported food workers will be replaced by Americans, there are some serious barriers to that happening. For one thing,Trump has pledgedto launch the “largest deportation in the history of our country,” and there may not be enough able-bodied American workers to replace the workers he deports. While American workers have a long history of doing many food industry-related jobs, the immigrant workforce of the last four decades was hired explicitly to work at speeds and under conditions that American workers had traditionally rejected.\n\nTake agricultural work. Historically, American-born workers have only harvested crops by hand on large-scale farms if they wereenslaved,imprisoned,forced into severe debt,displaced by environmental disastersor otherwise oppressed. There’s a reason for that. Agricultural work remains one of themostdangerousjobsin America;at least 20 percentof farmworker families live below the federal poverty line; and at the federal level, agricultural employers are largely exempt from many labor laws, includingchild labor lawsand theright to form a union. If the Trump administration were to replace undocumented farmworkers with Americans, it would likely need to enact regulations that would fundamentally change agricultural work so that American workers would find those jobs appealing.\n\nOr it could just replace undocumented farmworkers with an expanded H-2A workforce. One of these solutions would be easier than the other. (Or it would need to find a captive American-born workforce that could be compelled to do this work: Louisiana and other southern states have usedprisoners as farm laborersin recent years.)\n\nAgricultural lobbying groupshave met already with Trump’s transition team and urged them to expand the H-2A visa program, andfarmers are hopingthe Trump administration will roll back a Biden-era rule that gave H-2A workers more labor protections. Trump senior adviser Jason Miller has already talked aboutexpanding H-2A as well. “Any opportunity to come to this country is going to be temporary and only to do the work that nobody else wants to do,” says Kim Cordova, president of UFCW Local 7. “It’s like human slavery.”\n\nSo what would an expansion of the H-2A and H-2B mean for our food system? For employers, it could be to their advantage, particularly if the Trump administration also embraces additional visa reforms. For instance, H-2A workers are currently “temporary and seasonal,” but the agricultural industry has been urging the federal government toexpand the programso that H-2A workers can work year-round. For workers, it could be a profound loss. Unless the program is significantly changed, American-born workers will continue to be undercut by a captive, lower-wage workforce — and foreign-born workers will continue to be mistreated.",
        "source_2": "Our name is about honesty. The Monitor is owned by The First Church of Christ, Scientist, and we’ve always been transparent about that.\n\nThe church publishes the Monitor because it sees good journalism as vital to progress in the world. Since 1908, we’ve aimed “to injure no man, but to bless all mankind,” as our founder, Mary Baker Eddy, put it.\n\nHere, you’ll find award-winning journalism not driven by commercial influences – a news organization that takes seriously its mission to uplift the world by seeking solutions and finding reasons for credible hope.\n\nA deeper view that unites instead of divides, connecting why the story matters to you.\n\nIt’s Monday morning. We start with two stories that track shifts on both sides of the Atlantic. Simon Montlake takes you to County Durham, England, where the views of ordinary citizens illustrate how traditional political parties have left voters feeling dissatisfied and abandoned - and not just in the U.K. Anna Mulrine Grobe, meanwhile, reports on changing attitudes toward military service among young Americans. Welcome to a new week.\n\nThe Christian Science Monitor's coverage of the war between Hamas and Israel, and related articles.\n\nA deeper view that unites instead of divides, connecting why the story matters to you.\n\nFor months, President Donald Trump had promised to ramp up deportations of unauthorized immigrants in the U.S. as part of a restrictionist immigration policy.\n\nNow, federal agencies are beginning to fulfill that promise, backed by the White House and Mr. Trump’s executive orders. On Sunday, agents from Immigration and Customs Enforcement began stepping up operations in Chicago together with the FBI and other agencies to “enforce U.S. immigration law and preserve public safety and national security by keeping potentially dangerous criminal aliens out of our communities,” ICEsaid in a statement on X. It didn’t provide details about how many people had been detained.Acting Deputy Attorney General Emil Bove was in Chicagoto help oversee the multiday operations there.\n\nThe Trump administration has said its initial priority is to find and deport immigrants who are in the U.S. illegally and have criminal records. Polls show this policy has significant support from voters across the political spectrum, many of whom also support targeting other categories of unauthorized immigrants. A rightward shift on immigration has come after a surge of asylum seekers arrived during the Biden administration, turning the issue into a political liability for Vice President Kamala Harris in November’s election.\n\nPublic opinion on immigration has shifted right, but nuances remain. Americans strongly support deporting criminals, and many favor targeting other categories of unauthorized immigrants, while also wanting paths to legal status for law-abiding people.\n\nA recentIpsos/New York Times pollfound that a clear majority of Americans, including 44% of Democrats, supported the deportation of individuals who entered the country illegally during the past four years. Among Hispanic respondents, support for this policy was 54%. Asked about unauthorized immigrants with criminal records, nearly 9 in 10 respondents agreed they should be deported.\n\n“I think Trump is on the right track,” says John Burke, a Trump voter who runs a sports-card store in Chicago. “I’m sure many people are good people,” he says of those targeted for deportation. But, he adds, “There are probably many people who blend in and are connected to cartels.”\n\nMr. Trump’s policies will test anew a longstanding American tension between valuing immigrants and securing borders against an unmanaged influx. In the past few years, the public has grown less welcoming overall toward immigrants. But while Americans strongly support deporting criminals, many also say there should be paths to legal status for law-abiding people, many of whom have lived in the U.S. for decades.A Pew Research Center poll from Novemberfound that 43% of respondents who said they supported mass deportations also said that unauthorized residents should have legal pathways.\n\nApparent contradictions in public opinion are unlikely to stop President Trump from carrying out an expansive deportation agenda. But they point to nuanced views on the subject that some experts say could result in a backlash should the administration’s tactics be deemed overly harsh.\n\n“Although in general [Americans] support the idea of deportations of the undocumented, in the specifics they may or may not support,” says Theresa Cardinal Brown, a former Department of Homeland Security official in the Bush and Obama administrations. Such specifics include making arrests in churches and mosques, and separating U.S.-born children from parents who don’t have legal status. Last Tuesday,the DHS revoked previous guidelines on avoiding arrestsin “sensitive locations” such as schools, hospitals, and places of worship.\n\nIn 2022, the federal government estimated thetotal unauthorized population to be 11 million. That’s now considered an undercount, given that millions more entered without prior visa approvals under President Joe Biden. Of the population of immigrants who currently lack legal status, the majority came before 2010, and some have spent decades in the U.S. and put down roots.\n\nMarco Duran crossed the southern border from his native Mexico in the 1980s at the age of four. He and his parents benefited from amnesty programs under President Ronald Reagan that afforded legal status for millions of unauthorized immigrants. Today he’s a U.S. citizen, running a busy tire-repair shop in Pilsen, a diverse neighborhood in Chicago, where many last week began bracing for raids by ICE after news leaked that the city would be the first target of Mr. Trump’s deportation efforts.\n\nAs an icy wind scoured the streets, he sat bundled in a jacket and a baseball cap with ear muffs inside his office. He wore thin rubber gloves to protect his hands from the grime of tire changes; stacks of tires crowded around his desk.\n\nMr. Duran opposes the deportation simply because people don’t have legal residency or citizenship. It’s not good for business; his customers tell him they’re worried about being sent home. He says criminals should be targeted for removal by ICE, but that’s about it. “If they’re criminals and they have a record, I agree with it,” he says. “If it’s a person who is a working person, has a family, is a provider and is a contributing member of society, I’m not OK with it.”\n\nMr. Duran didn’t vote in November, saying he was unhappy with his choices. Erika Gonzalez, who manages a nearby barbershop with her husband, voted for Mr. Trump because she liked his tough immigration policy. Born in the U.S. to Mexican parents, she’s concerned about the strain put on public services in Chicago by large numbers of new migrants from Venezuela under President Biden.\n\nMs. Gonzalez supports the deportation of those with criminal records. But despite her vote for Mr. Trump, she says she’s not on board with mass deportations, especially not of immigrants who have built new lives over decades. They are her neighbors, and she doesn’t want them targeted.\n\n“There are a lot of people who come to the USA to work, to have a better life. People follow the rules, pay taxes,” she says. “Some people have been here 30 years. They have their own house, they have a small business.... What’s going to happen to them?”\n\nThe economic effect of mass deportations is a major unknown for an administration that has promised greater prosperity and lower prices. “A lot of these people are in low-wage jobs, essential workers,” says William Frey, a senior fellow at Brookings Metro in Washington who studies demographic and migratory trends.\n\nExpelling unauthorized immigrants while putting up barriers to new arrivals also has long-term implications for the country’s aging labor force. “If we have low immigration, the kind we had during the last Trump administration, we will have no growth in our labor-force-age population by 2035. So it’s an economic issue, not just a cultural issue,” says Mr. Frey.\n\nMr. Trump also ordered a pause this week on immigration by refugees, who are vetted and approved before entry. In the past fiscal year, more than 100,000 refugees resettled in the U.S. More than 2 million migrants who have sought asylum in the U.S. are waiting for courts to hear their cases;the average wait for a court hearing is four years.\n\nIn Mount Greenwood, a mostly white working-class district in Chicago, disdain for the Biden administration’s handling of immigration runs deep. Mr. Trump is popular with voters who want to see action on illegal immigration and reduce its demands on city services; closing the border is also seen as essential. But even here, there are reservations about mass deportation.\n\nVince Picciola hasn’t voted for a Democrat for president since John F. Kennedy. He works at his family’s house-cleaning business, manning the phones. “I always believe in law and order. If you don’t have law and order you don’t have a country,” he says when asked about immigration.\n\nYet Mr. Picciola, who came to the United States from Italy in 1955, is forgiving of unauthorized immigrants, saying it depends who they are and their standing in society. “If they’ve been here and are well established and have a family, they should be given an opportunity to become citizens,” he says.\n\nJim Trolia, Jr. is a director at his family’s funeral home, where he’s worked since childhood. He’s a Trump voter who wants to see the border closed and criminal immigrants sent home. He frets about the financial burden on taxpayers from a rise in new migrants in Chicago and other cities. But he wants to see humane treatment of immigrants, especially those who have lived in the U.S. for years without legal status and could now be detained under the Trump administration.\n\n“Morally, you don’t want to see good people uprooted,” he says. “But legally, you want people to follow the laws.”\n\nBack in Pilsen, Ms. Gonzalez looks out at the mostly empty streets outside the barbershop. It’s not just the cold that is keeping people indoors, she says. “People are scared.”\n\nRichard Mertens reported from Chicago. Simon Montlake and Caitlin Babcock reported from Washington.\n\nMonitor journalism changes lives because we open that too-small box that most people think they live in. We believe news can and should expand a sense of identity and possibility beyond narrow conventional expectations.",
        "source_3": "You’re not a bad person for wanting to preserve America’s sovereignty and national identity and to improve our immigration system so that it truly benefits US citizens.\n\nRight now, leftists are using the power of the pulpit, twisting Scripture, and blasting Christians for supporting President Donald Trump’s immigration raids.\n\nPresident Trump, of course, promised to deport millions of illegal aliens who have entered the country. Most Americans support these endeavors.\n\nAs part of an effort to stop Trump, leftists say that mass deportations and the restriction of immigration violate core Christian principles of caring for the poor and needy. Even certain Catholic bishops are claiming we cannot deport illegal aliens.\n\nDon't let leftists twist Scripture to make you feel bad for wanting violent freaks out of your country and for being concerned with America's common good.\n\nWhat does the Catechism of the Catholic Church say? Well, it is clear about Christians' duty of care to migrants.\n\nIn paragraph2241 of the Catechism,it says, “The more prosperous nations are obliged, to the extent they are able, to welcome the foreigner in search of the security and the means of livelihood which he cannot find in his country of origin. Public authorities should see to it that the natural right is respected that places a guest under the protection of those who receive him.”\n\nThe key phrase here is “to the extent they are able.” The United States is a very prosperous nation. Yes, we are. But are we really able to welcome everyone in the world? No, of course not.\n\nWe are trillions of dollars in debt. Thousands upon thousands of Americans die from drug overdoses every year. We have rampant poverty in many parts of the U.S., broken families in rural and inner cities, and social degradation across the board.\n\nThe U.S. government has a duty first and foremost to protect its own citizens. Allowing mass migration exacerbates all those issues and harms U.S. citizens.\n\nSo what should political authorities do regarding immigration? They are called to consider the “common good” in all that they do.\n\nTo get more content like this direct to your inbox, sign up for the Liz Wheeler Newsletter. Clickhereto sign up.\n\nThe Catechism goes on to say, “Political authorities, for the sake of the common good for which they are responsible, may make the exercise of the right to immigrate subject to various juridical conditions, especially with regard to the immigrants' duties toward their country of adoption.”\n\nSo what does this mean? Countries have a right to secure their borders. We have a right to self-definition. We have a right to enforce our laws. We have a right to enforce our immigration laws.\n\nAnd we have a right to condition immigration laws upon immigrants assimilating into our American values. This is Christian teaching.\n\nChristians are not called to implement an open-borders policy. We are not morally obligated to redistribute wealth. We are not morally obligated to allow our daughters to be assaulted and raped by illegal aliens who reside in our communities or to allow members of gangs like MS-13 to infiltrate our cities and cause crime to skyrocket.\n\nSo what does the Catholic Church teach regarding immigrants?\n\nIt says that immigrants “are obliged to respect with gratitude the material and spiritual heritage of the country that receives them, to obey its laws and to assist in carrying civic burdens.”\n\nThat means the Church says that immigrants should not violate the law by coming across the border illegally. It means all immigrants are called to respect America’s Christian and capitalist heritage.\n\nWe are not called to allow immigration to run wild without concern for our common good.\n\nJust last week, President Trump arrested at least 538 violent criminals of the worst kind. You’re telling me it’s the Christian thing to let them stay in your town? Would you want them as your neighbor?\n\nNo, you’re not a bad person for wanting to keep yourself and your family safe. You’re not a bad person for wanting to preserve America’s sovereignty and national identity and to improve our immigration system so that it truly benefits U.S. citizens.\n\nDon't let leftists twist Scripture to make you feel bad for wanting violent freaks out of your country and for being concerned with America's common good."
    }
}