{
    "question": "In what ways could DeepSeek’s open-sourcing of its R1 model—and the ensuing stock market reaction and registration limits following an undisclosed cyberattack—reshape expectations for AI innovation, competition, and oversight?",
    "content": {
        "source_1": "On January 20,DeepSeek, a relatively unknown AI research lab from China, released an open source model that’s quickly become the talk of the town in Silicon Valley. According to a paper authored by the company, DeepSeek-R1 beats the industry’s leading models likeOpenAI o1on several math and reasoning benchmarks. In fact, on many metrics that matter—capability, cost, openness—DeepSeek is giving Western AI giants a run for their money.\n\nDeepSeek’s success points to an unintended outcome of thetech cold warbetween the US and China.US export controlshave severely curtailed the ability of Chinese tech firms to compete on AI in the Western way—that is, infinitely scaling up by buying more chips and training for a longer period of time. As a result, most Chinese companies have focused on downstream applications rather than building their own models. But with its latest release, DeepSeek proves thatthere’s another way to win: by revamping the foundational structure of AI models and using limited resources more efficiently.\n\n“Unlike many Chinese AI firms that rely heavily on access to advanced hardware, DeepSeek has focused on maximizing software-driven resource optimization,” explains Marina Zhang, an associate professor at the University of Technology Sydney, who studies Chinese innovations. “DeepSeek has embraced open source methods, pooling collective expertise and fostering collaborative innovation. This approach not only mitigates resource constraints but also accelerates the development of cutting-edge technologies, setting DeepSeek apart from more insular competitors.”\n\nSo who is behind the AI startup? And why are they suddenly releasing an industry-leading model and giving it away for free? WIRED talked to experts on China’s AI industry and read detailed interviews with DeepSeek founder Liang Wenfeng to piece together the story behind the firm’s meteoric rise. DeepSeek did not respond to several inquiries sent by WIRED.\n\nEven within the Chinese AI industry, DeepSeek is an unconventional player. It started as Fire-Flyer, a deep-learning research branch of High-Flyer, one of China’s best-performing quantitative hedge funds. Founded in 2015, the hedge fund quickly rose to prominence in China, becoming the first quant hedge fund to raise over 100 billion RMB (around $15 billion). (Since 2021, the number has dipped to around $8 billion, though High-Flyer remains one of the most important quant hedge funds in the country.)\n\nFor years, High-Flyer had been stockpiling GPUs and building Fire-Flyer supercomputers to analyze financial data. Then, in 2023, Liang, who has a master's degree in computer science, decided to pour the fund’s resources into a new company called DeepSeek that would build its own cutting-edge models—and hopefully develop artificial general intelligence. It was as if Jane Street had decided to become an AI startup and burn its cash on scientific research.\n\nBold vision. But somehow, it worked. “DeepSeek represents a new generation of Chinese tech companies that prioritize long-term technological advancement over quick commercialization,” says Zhang.\n\nLiang told the Chinese tech publication 36Kr that the decision was driven by scientific curiosity rather than a desire to turn a profit. “I wouldn’t be able to find a commercial reason [for founding DeepSeek] even if you ask me to,”he explained. “Because it’s not worth it commercially. Basic science research has a very low return-on-investment ratio. When OpenAI’s early investors gave it money, they sure weren’t thinking about how much return they would get. Rather, it was that they really wanted to do this thing.”\n\nToday, DeepSeek is one of the only leading AI firms in China that doesn’t rely on funding from tech giants like Baidu, Alibaba, or ByteDance.\n\nAccording to Liang, when he put together DeepSeek’s research team, he was not looking for experienced engineers to build a consumer-facing product. Instead, he focused on PhD students from China’s top universities, including Peking University and Tsinghua University, who were eager to prove themselves. Many had been published in top journals and won awards at international academic conferences, but lacked industry experience, according tothe Chinese tech publication QBitAI.\n\n“Our core technical positions are mostly filled by people who graduated this year or in the past one or two years,”Liang told 36Kr in 2023. The hiring strategy helped create a collaborative company culture where people were free to use ample computing resources to pursue unorthodox research projects. It’s a starkly different way of operating from established internet companies in China, where teams are often competing for resources. (A recent example:ByteDance accused a former intern—a prestigious academic award winner, no less—of sabotaging his colleagues’ work in order to hoard more computing resources for his team.)\n\nLiang said that students can be a better fit for high-investment, low-profit research. “Most people, when they are young, can devote themselves completely to a mission without utilitarian considerations,” he explained. His pitch to prospective hires is that DeepSeek was created to “solve the hardest questions in the world.”\n\nThe fact that these young researchers are almost entirely educated in China adds to their drive, experts say. “This younger generation also embodies a sense of patriotism, particularly as they navigate US restrictions and choke points in critical hardware and software technologies,” explains Zhang. “Their determination to overcome these barriers reflects not only personal ambition but also a broader commitment to advancing China’s position as a global innovation leader.”\n\nIn October 2022, the US government started putting together export controls that severely restricted Chinese AI companies from accessing cutting-edge chips like Nvidia’s H100. The move presented a problem for DeepSeek. The firm had started out with a stockpile of 10,000 A100’s, but it needed more to compete with firms like OpenAI and Meta. “The problem we are facing has never been funding, but the export control on advanced chips,” Liang told 36Krin a second interview in 2024.\n\nDeepSeek had to come up with more efficient methods to train its models. “They optimized their model architecture using a battery of engineering tricks—custom communication schemes between chips, reducing the size of fields to save memory, and innovative use of the mix-of-models approach,” says Wendy Chang, a software engineer turned policy analyst at the Mercator Institute for China Studies. “Many of these approaches aren’t new ideas, but combining them successfully to produce a cutting-edge model is a remarkable feat.”\n\nDeepSeek has also made significant progress on Multi-head Latent Attention (MLA) and Mixture-of-Experts, two technical designs that make DeepSeek models more cost-effective by requiring fewer computing resources to train. In fact, DeepSeek's latest model is so efficient that it required one-tenth the computing power of Meta's comparable Llama 3.1 model to train,according to the research institution Epoch AI.\n\nDeepSeek’s willingness to share these innovations with the public has earned it considerable goodwill within the global AI research community. For many Chinese AI companies, developing open source models is the only way to play catch-up with their Western counterparts, because it attracts more users and contributors, which in turn help the models grow. “They’ve now demonstrated that cutting-edge models can be built using less, though still a lot of, money and that the current norms of model-building leave plenty of room for optimization,” Chang says. “We are sure to see a lot more attempts in this direction going forward.”\n\nThe news could spell trouble for the current US export controls that focus on creating computing resource bottlenecks. “Existing estimates of how much AI computing power China has, and what they can achieve with it, could be upended,” Chang says.\n\nCorrection 1/27/24 2:08pm ET: An earlier version of this story said DeepSeek has reportedly has a stockpile of 10,000 H100 Nvidia chips. It has been updated to clarify the stockpile is believed to be A100 chips.\n\nIn your inbox:Five new newslettersby deeply sourced experts\n\nUncanny Valley:An insider look atthe influence of Silicon Valley",
        "source_2": "The battle over DeepSeek as AI enters new phase: hacks, restrictions and censorship\n\nThe upstart ChatGPT competitor DeepSeek has investorschallenging their pre-existing notions of the spending required to develop artificial-intelligence tools. But the Chinese company has also found itself facing challenges of its own on Monday — including hacks and accusations of censorship.\n\nDeepSeek was founded in 2023, and it just released itsR1 large language AI model last week. Like OpenAI’s ChatGPT, DeepSeek’s model is designed for natural language processing — but, unlike the newest versions of ChatGPT, DeepSeek’s open-source model means that any AI developer can use it.\n\nWeston Blasi is a reporter. You can follow him on Twitter @WestonBlasi.\n\nCopyright ©2025MarketWatch, Inc. All rights reserved.",
        "source_3": "EMJ Capital President and founder Eric Jackson analyzes tough A.I. competition, the future of Stargate and cryptocurrency cybersecurity under the Trump administration.\n\nU.S. tech shares tumbled on Monday after the popularity of Chinese AI startup DeepSeek raised concerns among investors over American dominance in the sector.\n\nThe tech-heavy Nasdaq Composite plunged 3.5% in afternoon trading. The S&P 500 was down 2% while the Dow Jones Industrial Average was up 60 points.\n\nDeepSeek is gaining attention in Silicon Valley as the company appears to be nearly matching the capability of chatbots like OpenAI's ChatGPT, but at a fraction of the development cost.\n\nNvidia shares were hit the hardest, falling more than 15%, and led other tech companies lower. Arm Holdings and Advanced Micro Devices were lower by 9.5% and 6%, respectively. Microsoft shares slid 3.5%.\n\nDeepSeek has surgedin popularity in global app stores since the app was released earlier this month, having been downloaded1.6 million times by Jan. 25 in the U.S. and ranking No. 1 in iPhone app stores in Australia, Canada, China, Singapore, the U.S. and the U.K. Unlike ChatGPT and other major AI competitors, DeepSeek is open-source, allowing developers to offer their own improvements on the software.\n\nThe company unveiled R1, a specialized model designed for complex problem-solving, on Jan. 20, which \"zoomed to the global top 10 in performance,\" and was built far more rapidly, with fewer, less powerful AI chips, at a much lower cost than other U.S. models,according to the Wall Street Journal.\n\nMeta's Chief AI scientist, Yann LeCun, took to social media to speak about the app and its rapid success.\n\nAI WILL BE THE MAJOR FOCUS AT LAS VEGAS CONSUMER ELECTRONICS SHOW\n\nA chatbot app developed by the Chinese AI company DeepSeek(Getty Images / Getty Images)\n\nHe pointed outin a post on Threads,that what stuck out to him most about DeepSeek's success was not the heightened threat created by Chinese competition, but the value of keeping AI models open source, so anyone could benefit.\n\n\"It's not that China's AI is ‘surpassing the US,’ but rather that ‘open source models are surpassing proprietary ones,’\" LeCun explained.\n\nOPENAI CEO SAM ALTMAN RINGS IN 2025 WITH CRYPTIC, CONCERNING TWEET ABOUT AI'S FUTURE\n\nIn this photo illustration, the OpenAI logo is seen displayed on a mobile phone screen with ChatGPT logo in the background.(Photo Illustration by Idrees Abbas/SOPA Images/LightRocket via Getty Images / Getty Images)\n\nExperts told the Journal thatDeepSeek’s technology is still behind OpenAIand Google. However, it is a close rival despite using fewer and less-advanced chips, and in some cases skipping steps that U.S. developers consider essential.\n\nAs of Saturday, the Journal reported that the two models of DeepSeek were ranked in the top 10 on Chatbot Arena, a platform hosted by University of California, Berkeley researchers that rates chatbot performance.\n\nSignage outside Meta headquarters in Menlo Park, California, on Thursday, Feb. 1, 2024.(Photographer: David Paul Morris/Bloomberg via Getty Images / Getty Images)\n\nWhile DeepSeek’s flagship model is free, the Journal reported that the company charges users who connect their own applications to DeepSeek’s model and computing infrastructure.\n\nFOX Business' Stepheny Price contributed to this report\n\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\n\nBy clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time."
    }
}