{
    "question": "What are the potential cultural, diplomatic, and informational consequences of Google Maps adopting \"Gulf of America\" and \"Mount McKinley\" in the U.S., while showing legacy names to users abroad, after President Trump’s executive order and the GNIS updates?",
    "content": {
        "source_1": "Google announced that it was planning to rename the Gulf of Mexico and Denali in its Google Maps service, following President Donald Trump’s executive order last week officially renaming the geographical features to the “Gulf of America” and “Mount McKinley.” The controversial name changes were signed into law by executive order on Trump’s first day in office last week. “We have a longstanding practice of applying name changes when they have been updated in official government sources,” Google said in astatementposted on X. The tech giant said it follows theGeographic Names Information Systemfor its place names in Google Maps. The database is maintained by the U.S. Geological Survey, part of the Department of the Interior. In apress releaseon Friday, the department said it was “working expeditiously” to implement the name changes in the GNIS. But as of Monday evening, both Google Maps and the GNIS still listed both features by their original, pre-Trump order names. After the names change in the USGS database, “we will update Google Maps in the U.S. quickly to show Mount McKinley and Gulf of America,” the company said. However, Google Maps users abroad will likely still see the legacy names in parentheses, the company said. “When official names vary between countries, Maps users see their official local name. Everyone in the rest of the world sees both names. That applies here too.”",
        "source_2": "Dan Cody is a journalist based in London. His focus is increasing the search visibility of Newsweek's reporting across all subjects. Dan joined Newsweek in 2024 from the London Evening Standard and had previously worked at The New Statesman. He is a graduate of Nottingham Trent University. You can get in touch with Dan by emailingd.cody@newsweek.com. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nGoogle Maps users in the United States will soon notice a significant change in their app: the Gulf of Mexico will be renamed the Gulf of America.\n\nThe change follows anexecutive order by President Donald Trumpand will be implemented once the update is finalized in the U.S. Geographic Names Information System. The rebranding, announced byGoogleon Monday, marks a controversial renaming spree initiated by Trump.\n\nThe Gulf of Mexico name will remain in use in Mexican versions of Google Maps, and international users will see both names displayed side by side.\n\n\"As directed by the President, the Gulf of Mexico will now officially be known as the Gulf of America,\" the Interior Department stated in a statement last week. Google responded by noting that the change complies with its longstanding policy of aligning map labeling with updates in official government databases.\n\nThe executive order to rename the Gulf of Mexico was one of several signed by Trump on his first day back in office.\n\nOther measures included renaming Denali, North America's tallest peak, back to Mount McKinley—reversing a name change byBarack Obamain 2015.\n\nThe order to rename the Gulf of Mexico was justified by the area being an \"integral asset\" to the United States, yielding around 14% of U.S. crude oil production, \"vibrant American fisheries,\" and it being \"a favorite destination of American tourism.\"\n\nIn response, Mexican President Claudia Sheinbaum suggested that North America be renamed \"Mexican America\" as a nod to historic maps that carried such labels.\n\nThe Gulf of Mexico, or Gulf of America under its new U.S. designation, has long been a critical area for commerce, energy and environmental stewardship.\n\nUnlike land, much of the Gulf is federal property managed by the U.S. government. The offshore areas of the Gulf are governed by extensive regulations and agreements concerning fishing, drilling and shipping rights.\n\nAccording to the U.S. Department of the Interior, the Gulf generates billions of dollars annually through activities such as offshore oil drilling.\n\nEnvironmental advocates worry that renaming the Gulf to emphasize \"America\" could signal intentions to further exploit these resources, according to some reports.\n\nStretching over 600,000 square miles, the Gulf of Mexico is bordered by the southeastern United States, eastern Mexico and western Cuba. Its waters provide essential ecosystems and are a major driver of the economies of Texas, Louisiana, Mississippi, Alabama and Florida.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nDan Cody is a journalist based in London. His focus is increasing the search visibility of Newsweek's reporting across all subjects. Dan joined Newsweek in 2024 from the London Evening Standard and had previously worked at The New Statesman. He is a graduate of Nottingham Trent University. You can get in touch with Dan by emailingd.cody@newsweek.com. Languages: English.\n\nDan Cody is a journalist based in London. His focus is increasing the search visibility of Newsweek's reporting across all subjects. Dan joined Newsweek in 2024 from the London Evening Standard and had previously worked at The New Statesman. He is a graduate of Nottingham Trent University. You can get in touch with Dan by emailingd.cody@newsweek.com. Languages: English.\n\nDan Cody is a journalist based in London. His focus is increasing the search visibility of Newsweek's reporting across all                                    ...Read more",
        "source_3": "The Gulf of America and Mount McKinley will soon appear on Google Maps toreflect President Trump’s decision to renamethe two topographical features, the company announced Monday.\n\nThe navigation mainstay will make the changes as soon as the Department of the Interior updates the Geographic Names Information System, Google said.\n\n“We’ve received a few questions about naming within Google Maps,” the tech giant posted on X Monday evening. “We have a longstanding practice of applying name changes when they have been updated in official government sources.”\n\nWhen the GNIS makes the change, Google will then move to “update Google Maps in the U.S. quickly to show Mount McKinley and Gulf of America.”\n\nThe company said the forthcoming update follows their longstanding practice regarding official names of places that vary between countries.\n\nGoogle Map users will still “see their official local name” based on their location. So, for users outside of the United States, Google Maps will likely still have the previous names, the Gulf of Mexico and Mount Denali, listed alongside the new ones.\n\n“Everyone in the rest of the world sees both names,” Google said in its X post. “That applies here too.”\n\nMount Denali, soon to be reverted to Mount McKinley, was renamed by President Obama in 2015 per the request of the Koyukon, an Alaskan native group. They had been fighting to have the name changed to Denali since 1975."
    }
}