{
    "question": "What are the potential political and social consequences of Elon Musk’s surprise video appearance backing AfD and urging Germans to “move beyond” past guilt at the party’s campaign launch?",
    "content": {
        "source_1": "Updated on:  January 28, 2025 / 9:35 AM EST/ CBS News\n\nLondon —Elon Musk made a surprise videolink appearance at a campaign event for Germany's far-right Alternative for Germany (AfD) party on Saturday, during which he told a crowd of around 4,500 AfD supporters that \"children should not be guilty of the sins of their parents, let alone their great-grandparents,\" in an apparent reference to the Nazi Germany just two days before Holocaust Remembrance Day. The AfD, which Musk hadpreviously voiced his support for, has been labelled a suspected extremist organization by Germany's national security services.\n\n\"There is too much focus on past guilt, and we need to move beyond that,\" Musk said, adding that he considered the anti-immigration, anti-cultural integration party, \"the best hope for Germany.\"\n\n\"It's good to be proud of German culture, German values, and not to lose that in some sort of multiculturalism that dilutes everything,\" said Musk, who has become aclose allyandadviser to President Trump.\n\nHe gave the remarks just days after police in Germany said they were investigating the projection of large-scale images of Musk making a gesture reminiscent of the Nazi salute onto a Tesla factory outside Berlin. Musk made the gesture twice at an inauguration event for President Trump at the beginning of last week.\n\nA U.K. campaign group and a German satirical group have taken responsibility for the projections.\n\nAny display of Nazi symbols is against federal law in Germany. Musk has not directly denied giving a Nazi salute, but he mocked criticism of the gestures in a post on X, saying: \"Frankly they need better dirty tricks. The 'everyone is Hitler' attack is sooo tired.\"\n\nIsraeli Prime Minister Benjamin Netanyahu defended Musk, calling him a friend of the Jewish people and dismissing the criticism, saying the tech magnate had been \"falsely smeared.\"\n\nIn the U.S., the Anti-Defamation League, which tracks antisemitism, called Musk's actions an \"awkward gesture,\" but said it was \"not a Nazi salute.\"\n\nIn 2023,Musk threatened to sue the ADLfor defamation after the organization alleged hisX platform was enabling the spread of antisemitism.\n\nPoland's Prime Minister Donald Tusk, speaking a day before his nation welcomed survivors and foreign dignitaries for a memorial service to commemorate80 years since the liberationof the notorious Auschwitz Nazi death camp, condemned Musk's weekend remarks to the AfD gathering.\n\n\"The words we heard from the main actors of the AfD rally about 'Great Germany' and 'the need to forget German guilt for Nazi crimes' sounded all too familiar and ominous,\" Tusk said Sunday on social media. \"Especially only hours before the anniversary of the liberation of Auschwitz.\"\n\nOn Monday, as people gathered for the solemn memorial service at Auschwitz, Tusk said in a new post that \"the whole world should hear once more those words: NEVER AGAIN! We must not forget the tragic lesson of our past. Evil, violence and contempt cannot triumph anew. Under any circumstances!\"\n\nGermany is expected to hold a snap election in February, after Chancellor Olaf Scholz lost a vote of confidence and his ruling coalition collapsed. The AfD, which recently became the first far-right party towin a state electionsince the Nazi era, has seen a surge in support.\n\nAfter Musk's remarks on Saturday, the leader of the AfD, Alice Weidel, thanked him and told the crowd: \"Let's make Germany great again.\"\n\nLate last year, the German government accused Musk of trying to influence the country's February elections when he published an op-ed in a local newspaper endorsing the AfD.\n\n\"It is indeed the case that Elon Musk is trying to influence the federal election,\" a government spokesperson said on social media at the time, though the spokesperson said Musk was free to express his views, adding: \"After all, freedom of opinion also covers the greatest nonsense.\"\n\nHaley Ott is the CBS News Digital international reporter, based in the CBS News London bureau.",
        "source_2": "This is Radio Schuman, your new go-to podcast to spice up your weekday mornings with relevant news, insights, and behind-the-scenes from Brussels and beyond.\n\nFrom the economy to the climate and the EU's role in world affairs, this talk show sheds light on European affairs and the issues that impact on our daily lives as Europeans. Tune in to understand the ins and outs of European politics.\n\nNo agenda, no argument, no bias, No Comment. Get the story without commentary.\n\nDare to imagine the future with business and tech visionaries\n\nEuronews Tech Talks goes beyond discussions to explore the impact of new technologies on our lives. With explanations, engaging Q&As, and lively conversations, the podcast provides valuable insights into the intersection of technology and society.\n\nEurope's water is under increasing pressure. Pollution, droughts, floods are taking their toll on our drinking water, lakes, rivers and coastlines. Join us on a journey around Europe to see why protecting ecosystems matters, how our wastewater can be better managed, and to discover some of the best water solutions.   Video reports, an animated explainer series and live debate - find out why Water Matters, from Euronews.\n\nWe give you the latest climate facts from the world’s leading source, analyse the trends and explain how our planet is changing. We meet the experts on the front line of climate change who explore new strategies to mitigate and adapt.\n\nThis is Radio Schuman, your new go-to podcast to spice up your weekday mornings with relevant news, insights, and behind-the-scenes from Brussels and beyond.\n\nFrom the economy to the climate and the EU's role in world affairs, this talk show sheds light on European affairs and the issues that impact on our daily lives as Europeans. Tune in to understand the ins and outs of European politics.\n\nNo agenda, no argument, no bias, No Comment. Get the story without commentary.\n\nDare to imagine the future with business and tech visionaries\n\nEuronews Tech Talks goes beyond discussions to explore the impact of new technologies on our lives. With explanations, engaging Q&As, and lively conversations, the podcast provides valuable insights into the intersection of technology and society.\n\nEurope's water is under increasing pressure. Pollution, droughts, floods are taking their toll on our drinking water, lakes, rivers and coastlines. Join us on a journey around Europe to see why protecting ecosystems matters, how our wastewater can be better managed, and to discover some of the best water solutions.   Video reports, an animated explainer series and live debate - find out why Water Matters, from Euronews.\n\nWe give you the latest climate facts from the world’s leading source, analyse the trends and explain how our planet is changing. We meet the experts on the front line of climate change who explore new strategies to mitigate and adapt.\n\nTop European politicians are among those who have criticised Elon Musk for telling Germans to let go of \"the guilt of the past\" during an Alternative for Germany (AfD) campaign rally over the weekend.\n\nThe South Africa-born billionaire made the contentious remark during a virtual speech at an event attended by thousands of AfD supporters in the east German city of Halle on Saturday.\n\nMusk has previously said that only the far-right AfD, a party which says that Germans should no longer apologise for the country's Nazi past, can \"save Germany\" in next month's elections.\n\n\"To be honest, the focus is too much on the guilt of the past and we have to leave that behind us,\" the world's richest man said at the campaign rally.\n\n\"Children should not be guilty of the sins of their parents, let alone their great grandparents,\" Musk added, seemingly referring to Germany's Nazi history.\n\nThe owner of X also urged Germans to be proud of \"German values\" and not \"lose that in some sort of multiculturalism that dilutes everything.\"\n\nThe entrepreneur's comments came shortly after he appearedto mimica Nazi salute during a speech at Donald Trump's presidential inauguration.\n\nPolish Prime Minister Donald Tusk was quick to respond to his latest comments, writing on X that Musk's words sounded \"all too familiar and ominous\".\n\n\"Especially only hours before the anniversary of the liberation of Auschwitz,\" he said.\n\nTusk is overseeing commemorations on Monday for the 80th anniversary of the liberation of Auschwitz, the Nazi concentration camp in Poland where at least 1.1 million people were murdered.\n\nGerman Chancellor Olaf Scholz took to X to say he agreed with his Polish counterpart's appraisal of Musk's words.\n\nMusk also drew criticism from Dani Dayan, the chairman of Yad Vashem, Israel’s memorial to the victims of the Holocaust.\n\n\"Contrary to Elon Musk’s advice, the remembrance and acknowledgment of the dark past of the country and its people should be central in shaping the German society,\" Dayan said.\n\n“Failing to do so is an insult to the victims of Nazism and a clear danger to the democratic future of Germany,” he added.\n\nSteffen Seibert, Germany's ambassador to Israel, said that Musk \"doesn't seem to know\" much about Germany's history.\n\n\"Nobody makes children feel guilty for Nazi crimes. We want them to grow up informed and responsible and to apply the lessons of Germany's past.\"\n\nMusk has thrown his support behind the AfD ahead of the country's federal elections on 23 February.\n\nDuring his speech on Saturday, Musk said he was \"very excited\" for the party. \"I think you're really the best hope for Germany ... fight for a great future for Germany,\" he told AfD supporters to great applause.\n\nThe AfD are currently polling in second place with 19% of the projected vote, while the Christian Democratic Union are in first place with 28%.\n\nThe CDU's leader, Friedrich Merz, has repeatedly ruled out joining a coalition with the AfD, whosemembershave been fined for using Nazi slogans.\n\nLast week, however, Merz signalled that he would beopento gaining the AfD's support in pushing through tougher migration policies.\n\nOther parties have denounced the suggestion, as the far-right party is typically shunned by Germany's political establishment.",
        "source_3": "Tesla CEOElon MuskencouragedGermansto “move beyond” historical guilt in a speech to the right-wing Alternative fur Deutschland party.\n\nMusk’s public support for the AfD, which began last month, represents his latestinternationalpolitical venture. After previously hosting a space with the AfD candidate for chancellor, Alice Weidel, Musk took his support a step further by remotely speaking to a crowd of AfD supporters at their election campaign kick-off in Halle, Germany. In his speech, Musk said that the AfD was the “best hope for Germany,” and urged the crowd to be proud of their German identity.\n\n“I think that is just very important … that people take pride in Germany and being German, this is very important,” Musk said. “It’s OK to be proud to be German. This is a very important principle … it’s good to be proud of German culture, German values, and not to lose that in some sort of multiculturalism that dilutes everything.”\n\n“I think we want to have unique cultures in the world. We want to have people that … we don’t want everything to be the same everywhere, where it’s just one big sort of soup,” he added.\n\nMusk then addressed the sense of historical guilt for the crimes of the Third Reich that havedefined Germanysince its defeat during World War II.\n\n“I think there’s … frankly, too much of a focus on past guilt, and we need to move beyond that,” he said. “People, children should not be guilty of the sins of their parents, let alone their grandparents, their great grandparents, even, and we should be optimistic and excited about a future for Germany.”\n\nWeidel celebrated the speech on X, declaring, “Make America & Germany great again!”\n\nElon Musk‘s great speech at our party convention! Make America & Germany great again! 🇺🇸🇩🇪pic.twitter.com/XHtMIBfOYh\n\nMusk’s remarks were greeted by cheers from the crowd. They were less well-received by international critics.\n\n“The words we heard from the main actors of the AfD rally about ‘Great Germany’ and ‘the need to forget German guilt for Nazi crimes’ sounded all too familiar and ominous. Especially only hours before the anniversary of the liberation of Auschwitz,” Polish Prime Minister Donald Tusksaid.\n\nAfD is broadly considered a right-wing or fringe party. It is mainly characterized by its anti-immigration stance, which has won laudits among Germans disillusioned with the country’s immigration system. It has surged in the polls this year, winning its first election in September in the formerly communist state of Thuringia.\n\nAhead of Germany’s snap elections on Feb. 23, triggered by the collapse of the ruling Social Democratic Party-led coalition government, Muskthrewhis support behind the resurgent party.\n\nThe AfD has been growing in popularity since former Chancellor Angela Merkel decided to take in a large number of mostly Syrian refugees in 2015. Though the party has featured prominently in polls since 2015, it has always been locked out of the government due to a “Brandmauer,” or “firewall,” an agreement among all the major parties that they would not work with the AfD, viewing it as too extreme.\n\nThat could change in February, as the party has taken the second spot in polling with 20% — above the ruling SPD Party. Another surging party, the eclectic left-wing populist Sahra Wagenknecht Alliance, or BSW, hassignaledthat it may be willing to work with the AfD in a coalition.\n\nEven more promising for the AfD, Friedrich Merz’s Christian Democratic Union recently announced it would introduce tough migration laws if elected, even “if only the AfD supports our proposals.”\n\n“We will introduce motions in the German Bundestag that are exclusively in line with our convictions,” Merz told thenewsagencyDeutsche Presse-Agenturon Friday. “And we will introduce them regardless of who agrees with them.”\n\n“The firewall has fallen!” Weidel triumphantlydeclaredon X after the interview.\n\nThe exact label of the AfD Party is itself a source of controversy. Left-wing critics openly accuse it of being a neo-Nazi group.\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nThe party has consistently rejected the far-right label, with its leaderssayingthe party stands for “the liberal democratic order and has nothing to do with this suspected neo-Nazi grouping.”\n\nOther analysts take a more nuanced view, painting the party as acoalitionof different broadly right-wing ideological factions."
    }
}