{
    "question": "How might the decision to destroy millions of dollars’ worth of USAID-funded contraceptives to comply with the Kemp-Kasten Amendment influence U.S. foreign aid credibility, partnerships with global health organizations, and health outcomes for the women who were meant to receive them?",
    "content": {
        "source_1": "As part of president’s end to foreign aid, destruction of the long-acting contraceptives will cost US taxpayers $167,000\n\nTheTrump administrationhas decided to destroy $9.7m worth of contraceptives rather than send them abroad to women in need.\n\nA state department spokesperson confirmed that the decision had been made – a move that will cost US taxpayers $167,000. The contraceptives are primarily long-acting, such as IUDs and birth controlimplants, and were almost certainly intended for women inAfrica, according to two senior congressional aides, one of whom visited a warehouse in Belgium that housed the contraceptives. It is not clear to the aides whether the destruction has already been carried out, but said they had been told that it was set to occur by the end of July.\n\n“It is unacceptable that the State Department would move forward with the destruction of more than $9m in taxpayer-funded family planning commodities purchased to support women in crisis settings, including war zones and refugee camps,” Jeanne Shaheen, a Democratic senator from New Hampshire, said in a statement. Shaheen and Brian Schatz, a Democratic senator from Hawaii, have introduced legislation to stop the destruction.\n\n“This is a waste of US taxpayer dollars and an abdication of US global leadership in preventing unintended pregnancies, unsafe abortions and maternal deaths,” added Shaheen, who in June sent a letter to the secretary of state,Marco Rubio, about the matter.\n\nThe department decided to destroy the contraceptives because it could not sell them to any “eligible buyers”, in part because of US laws and rules that prohibit sending US aid to organizations that provide abortion services, counsel people about the procedure or advocate for the right to it overseas, according to the state department spokesperson.\n\nMost of the contraceptives have less than 70% of their shelf life left before they expire, the spokesperson said, and rebranding and selling the contraceptives could cost several million dollars. However, the aide who visited the warehouse said that the earliest expiration date they saw on the contraceptives was 2027, and that two-thirds of the contraceptives did not have anyUSAIDlabels that would need to be rebranded.\n\nThe eradication of the contraceptives is part of the Trump administration’smonths-longdemolitionof the Agency for International Development (USAID), the largest funding agency for humanitarian and development aid in the world. After the unofficial “department of government efficiency” (Doge)erased 83%of USAID’s programs, Rubioannouncedin June that USAID’s entire international workforce would be abolished and its foreign assistance programs would be moved to the state department. The agency will bereplaced by an organizationcalled America First.\n\nIn total, the funding cuts to USAIDcould lead to more than 14m additional deaths by 2030, according to a recentstudypublished in the journal the Lancet. A third of those deaths could be children.\n\n“If you have an unintended pregnancy and you end up having to seek unsafe abortion, it’s quite likely that you will die,” said Sarah Shaw, the associate director of advocacy at MSI Reproductive Choices, a global family planning organization that works in nearly 40 countries. “If you’re not given the means to space or limit your births, you’re putting your life at risk or your child’s life at risk.”\n\nMSI tried to purchase the contraceptives from the US government, Shaw said. But the government would only accept full price – which Shaw said the agency could not afford, given that MSI would alsohave to shoulder the expense oftransportingthe contraceptives and the fact that they are inching closer to their expiration date, which could affect MSI’s ability to distribute them.\n\nThe state department spokesperson did not specifically respond to a request for comment on Shaw’s allegation, but MSI does provide abortions as part of its global work, which may have led the department to rule it out as an “eligible buyer”.\n\nIn an internal survey, MSI programs in 10 countriesreported that, within the next month, they expect to be out of stock or be on the brink of being out of stock of at least one contraceptive method. The countries include Burkina Faso, the Democratic Republic of Congo, Mali, Ethiopia, Nigeria, Tanzania, Timor-Leste, Senegal, Kenya and Sierra Leone.\n\nShaw expects the stock to be incinerated. “The fact that the contraceptives are going to be burned when there’s so much need – it’s just egregious,” she said. “It’s disgusting.” The Department of State spokespersondid not respond to a request for information on the planned method of destruction.\n\nThe destruction of the contraceptives is, to Shaw, emblematic of the overall destruction of a system that once provided worldwide help to women and families. USAID funding is threaded through so much of the global supply chain of family planning aid that, without its money, the chain has come apart. In Mali, Shaw said, USAID helped pay for the gas used by the vehicles that transport contraceptives from a warehouse. Without the gas money, the vehicles were stuck – and so were the contraceptives.\n\n“I’ve worked in this sector for over 20 years and I’ve never seen anything on this scale,” Shaw said. “The speed at which they’ve managed to dismantle excellent work and really great progress – I mean, it’s just vanished in weeks.”\n\nOther kinds of assistance are also reportedly being wasted. This week,the Atlantic reportedthat almost 500 metric tons of emergency food were expiring and would be incinerated, rather than being used to feed about 1.5 million children in Afghanistan and Pakistan. Meanwhile, almost 800,000 Mpox vaccines that were supposed to be sent to Africa are now unusable because they are too close to their expiration date,according to Politico.\n\nThe cuts to foreign aid are slated to deepen. Early on Friday morning, Congresspassed a billto claw back roughly $8bn that had been earmarked for foreign assistance.\n\n“It’s not just about an empty shelf,” Shaw said. “It’s about unfulfilled potential. It’s about a girl having to drop out of school. It’s about someone having to seek an unsafe abortion and risking their lives. That’s what it’s really about.”",
        "source_2": "Reporting by Ammu Kannampilly in Nairobi, Jennifer Rigby in London, and Jonathan Landay in Washington; additional reporting by Charlotte Van Campenhout in Brussels; Editing by Alexandra Hudson and Rosalba O'Brien\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nAmmu Kannampilly joined Reuters in 2024 and manages news coverage of 14 countries across East Africa and the Indian Ocean. Her stories include a cover-up of protester killings by Kenyan police and an exclusive on U.S. aid cuts leaving food for millions mouldering in warehouses around the world. Prior to joining Reuters, she worked at AFP for 14 years and ABC News before that. She holds a doctorate from the University of Oxford in British poetry of the First World War but still struggles to write a good headline. Contact: ammu.kannampilly@thomsonreuters.com\n\nJen is the Global Health Correspondent at Reuters, covering everything from pandemics to the rise of obesity worldwide. Since joining the news agency in 2022, her award-winning work includes coverage of gender-affirming care for adolescents in the UK and a global investigation with colleagues into how contaminated cough syrup killed hundreds of children in Africa and Asia. She previously worked at the Telegraph newspaper and Channel 4 News in the UK, and spent time as a freelancer in Myanmar and the Czech Republic.",
        "source_3": "The contraceptives, meant for foreign distribution, may have been purchased in violation of federal law.\n\nWASHINGTON—The State Department is destroying $13 million worth of contraceptives, The Daily Wire has learned, in addition to saving nearly $31 million by canceling contraceptive orders placed by President Joe Biden’s administration.\n\nThe contraceptives — including everything from hormonal birth control pills to birth control implants — were set to be distributed abroad through the U.S. Agency for International Development. But the State Department now says the Biden administration purchased much of these contraceptives in violation of the Kemp-Kasten Amendment, which prevents U.S. funds from going to organizations that support or participate in programs of coercive abortion or involuntary sterilization.\n\nThere were some interested buyers, a State Department official said, but they were deemed ineligible since they support organizations involved in coercive abortion and sterilization. Those buyers reportedly included the Gates Foundation, the Children’s Investment Fund Foundation (CIFF), and the United Nations Population Fund. None of these organizations immediately responded to requests for comment.\n\nA State Department official noted that it would cost the department several million dollars to sell the materials to other vendors, given that the department would have to rebrand some of these materials. Destroying the contraceptives, meanwhile, would cost taxpayers around $167,000, the official said. Doing so also avoids potential further violations of the Kemp-Kasten Amendment and ensures the materials don’t fall into the wrong hands — something that has happened before with USAID, according to the State Department.\n\nThe move is part of President Donald Trump’s January 2025 presidential directive thatstops supportfor organizations that are involved in coercive reproductive practices, according to a State Department memo shared with The Daily Wire. It is the Trump administration’s latest effort to curtail USAID, a once-sprawling operation that has been radically reined in and placed firmly under the auspices of the State Department.\n\nAn inventory of USAID-Funded Contraceptive Commodities held at a distribution center in Belgium shows that USAID had formerly funded millions of dollars’ worth of birth control implants (including $3,850,540 for levonorgestrel rod implants and over $3,500,000 for etonogestrel rod implants).\n\nUSAID was also funding hundreds of thousands of dollars’ worth of birth control pills, hormones, and IUDs, according to data reviewed by The Daily Wire.\n\nThe Belgian distribution center, Belgium RDC, was holding a total of $9,734,251 contraceptive commodities, and $3.4 million in commodities are still being held by its supplier, according to the State Department memo.\n\nYour information could be the missing piece to an important story. Submit your tip today and make a difference."
    }
}