{
    "question": "How might the mass firing of 17 inspectors general affect federal oversight and public trust in government, especially amid disputes over whether the dismissals were lawful?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nPresident Donald Trump arrives on Air Force One at Harry Reid International Airport in Las Vegas, Friday, Jan. 24, 2025. (AP Photo/Mark Schiefelbein)\n\nChairman Chuck Grassley, R-Iowa, speaks at the Senate Judiciary Committee confirmation hearing for Pam Bondi, President-elect Donald Trump’s choice to lead the Justice Department as attorney general, at the Capitol in Washington, Wednesday, Jan. 15, 2025. (AP Photo/Ben Curtis)\n\nSenate Minority Leader Chuck Schumer, D-N.Y., speaks during a news conference on Capitol Hill in Washington, Wednesday, Jan. 22, 2025. (AP Photo/Jose Luis Magana)\n\nWASHINGTON (AP) — The Trump administration has fired about 17 independent inspectors general at government agencies,a sweeping actionto remove oversight of hisnew administrationthat some members of Congress are suggesting violated federal oversight laws.\n\nThe dismissals began Friday night and were effective immediately, according to two people familiar with the actions. They spoke on condition of anonymity to provide details that have not been made public. Neither confirmed the exact number of firings, but an email sent by one of the fired inspectors general said “roughly 17” inspectors general had been removed.\n\nTrump confirmed the move in a conversation with reporters aboard Air Force One on Saturday, claiming, “it’s a very common thing to do.” He said he would “put good people in there that will be very good.”\n\nCongress was not given the legally required 30-day notices about the removals — something that even a top Republican is decrying.\n\n“There may be good reason the IGs were fired. We need to know that if so,” Sen.Chuck Grassley, chair of the Senate Judiciary Committee, said in a statement. “I’d like further explanation from President Trump. Regardless, the 30 day detailed notice of removal that the law demands was not provided to Congress,” said Grassley, R-Iowa.\n\nThe role of the modern-day inspector general dates to post-Watergate Washington, when Congress installed offices inside agencies as an independent check against mismanagement and abuse of power. Though inspectors general are presidential appointees, some serve presidents of both parties. All are expected to be nonpartisan.\n\nSen.Lindsey Graham, R-S.C., acknowledged that the firings violated statutes but shrugged it off: “Just tell them you need to follow the law next time,” he said.\n\nDemocrats and watchdog groups, however, used the dismissals to raise alarm that Trump was making it easier to take advantage of the government.\n\n“Inspectors General are the cops on the beat preventing bad things from happening,” Max Stier, president and CEO of the nonpartisan Partnership for Public Service, said in a statement. “Their work saves the taxpayer tens of billions of dollars every year.”\n\nThe White House did not comment on Saturday. President Donald Trump wasin Las Vegas for a speechfocused on his campaign promise to end federal taxation on tips.\n\nBut the moves were consistent with the president’s first week back in the White House, which has featured aseries of stepsto remake the federal government. Trump has done everything from using executive orders to impose hiring freezes andcrack down ondiversity, equity and inclusion initiatives, to suggesting that he wants toshuttertheFederal Emergency Management Agencyand leave disaster recovery up to individual states affected by major emergencies.\n\n“Yesterday, in the dark of night, President Trump fired at least 12 independent inspector generals at important federal agencies across the administration,” Senate Democratic leader Chuck Schumer of New York said Saturday on the chamber’s floor. “This is a chilling purge and it’s a preview of the lawless approach Donald Trump and his administration are taking far too often as he’s becoming president.”\n\nSchumer said the dismissals are “possibly in violation of federal law” and help demonstrate that the move “is a glaring sign that it’s a golden age for abuse in government and even corruption.”\n\nThe Washington Post, which first reported the firings, said that many were appointees from Trump’s first term. Among those inspectors general reportedly removed included those for the Departments of Agriculture, Commerce, Defense and Education.\n\nIn a lengthy statement Saturday, Hannibal Ware, the chairman of the Council of the Inspectors General on Integrity and Efficiency, an independent entity that represents the interests of government watchdogs, noted that inspectors general conduct their “oversight in a strictly non-partisan manner. They are appointed, by law, without regard to their political affiliation and, during their tenures, they work effectively across Administrations and with Congress, without regard to political party.”\n\nHe suggested that the firings violated the legal requirements that presidents notify Congress 30 days before firing an inspector general and provide a detailed rationale for the decision.”\n\n“IGs are not immune from removal. However, the law must be followed to protect independent government oversight for America,” the statement said.\n\nSpared in this round of dismissals, however, wasMichael Horowitz, the longtime Justice Department inspector general who has issued reports on assorted politically explosive criminal investigations over the past decade.\n\nIn December 2019, for instance, Horowitz released a report faulting the FBI for surveillance warrant applications in the investigation into tiesbetween Russia and Trump’s 2016 presidential campaign. But the report also found that the investigation had been opened for a legitimate purpose and did not find evidence that partisan bias had guided investigative decisions.\n\n“Michael Horowitz we’re keeping,” Trump said Saturday, calling his 2019 findings “such an accurate, well done report.”\n\nHorowitz’s status aside, the move against the watchdogs drew criticism from congressional Democrats.\n\nSen.Amy Klobuchar, D-Minn., noted that inspectors general are “critical to rooting out waste, fraud, and abuse throughout the federal government.” The mass firings were “alarming,” she said.\n\nRep.Gerald Connollyof Virginia, a Democrat who is the ranking member of the House Committee on Oversight and Government Reform, called it a “coup to overthrow legally protected independent inspectors general.”\n\nHe also suggested that the move — coming on just the fourth full day of Trump’s second term — could potentially free up a series of positions that can subsequently be filled with loyalists who are strongly sympathetic to the Trump administration.\n\n“Replacing independent inspectors general with political hacks will harm every American who relies on social security, veterans benefits, and a fair hearing at IRS on refunds and audits,” Connolly said.\n\nStill, Trump hasaggressively challengedthe authority of independent agency watchdog groups in the past.\n\nIn 2020, he replaced multiple key inspectors general, including those leading the Defense Department and intelligence community, as well as the inspector general tapped to chair a special oversight board for the $2.2 trillion economic relief package on the coronavirus.\n\nDemocratic Sen.Elizabeth Warrenof Massachusetts called Trump’s actions “a purge of independent watchdogs in the middle of the night.”\n\n“Inspectors general are charged with rooting out government waste, fraud, abuse, and preventing misconduct,” Warren posted on X. “President Trump is dismantling checks on his power and paving the way for widespread corruption.”\n\nWeissert reported from Las Vegas. Associated Press writers Mary Clare Jalonick and Stephen Groves contributed to this report.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Reporting by Nadita Bose in Washington, Chandni Shah in Bengaluru, Ismail Shakil in Ottawa Jonathan Landay in Washington and Nate Raymond in Boston; Writing by Doina Chiacu; Editing by William Mallard, Matthew Lewis and Chizu Nomiyama\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab",
        "source_3": "'All-Star' panelists reacts to President Donald Trump's visit to victims of Hurricane Helene and the California wildfires on 'Special Report.'\n\nPresidentDonald Trumpfired 17 independent watchdogs at various federal agencies late Friday, a Trump administration official confirmed to Fox News, as he continues to reshape the government at a blistering pace.\n\nTrump dismissed inspectors general at agencies within the Defense Department, State Department, Energy Department, Department of Housing and Urban Development (HUD) Department of Veterans Affairs and more, notifying them by email from the White House Presidential Personnel Office, the Washington Post first reported.\n\n\"It’s a widespread massacre,\" one of the terminated inspectors general told the Post. \"Whoever Trump puts in now will be viewed as loyalists, and that undermines the entire system.\"\n\nSen. Chuck Grassley, R-Iowa, the chairman of the Senate Judiciary Committee, said that Trump's action may violate federal law that requires the president to give 30 days' notice to Congress of his intent to fire any independent watchdog, the Associated Press reported.\n\n‘FLOODING THE ZONE’ TRUMP HITS WARP SPEED IN FIRST WEEK BACK IN OFFICE\n\nPresident Donald Trump holds up outgoing President Joe Biden's letter as he signs executive orders in the Oval Office of the White House in Washington, D.C., on Jan. 20, 2025.(Jim Watson/AFP via Getty Images)\n\n\"There may be good reason the IGs were fired. We need to know that if so,\" Grassley said in a statement. \"I’d like further explanation from President Trump. Regardless, the 30 day detailed notice of removal that the law demands was not provided to Congress.\"\n\nTheWhite Housedid not respond to a request for comment.\n\nInspectors general at federal agencies are called on to investigate government waste, fraud and abuse. They operate independently and can serve in multiple administrations.\n\nThe mass firing is Trump's latest attempt to force the federal bureaucracy into submission after he shut down diversity, equity and inclusion programs, rescinded job offers and sidelined more than 150 national security and foreign policy officials. Trump began his second term with the intent of purging any opponents of his agenda from the government and replacing them with officials who would execute his orders without hesitation.\n\nTRUMP TO DECLASSIFY JFK FILES: FAMED DOCTOR WHO INVESTIGATED ASSASSINATION PREDICTS WHAT AMERICANS COULD LEARN\n\nJustice Department Inspector General Michael E. Horowitz testifies to Congress.(Tom Williams/CQ-Roll Call, Inc via Getty Images)\n\nAmong those spared from Trump's wrath was Department of Justice inspector general Michael Horowitz, the New York Times reported. Horowitz led the investigation of theFBI's Russian collusion probe, which exposed at least 17 \"significant inaccuracies and omissions\" in the FBI's application for a FISA warrant in the Crossfire Hurricane investigation.\n\nSen. Elizabeth Warren, D-Mass., slammed Trump's firings, calling them a \"purge of independent watchdogs in the middle of the night.\"\n\nTRUMP MEETS WITH CALIFORNIA RESIDENTS, FIRE AND LAW ENFORCEMENT OFFICIALS TO SEE LA WILDFIRE DAMAGE FIRST HAND\n\nSenate Judiciary Chairman Chuck Grassley, R-Iowa., said the president's firing of more than a dozen inspectors general did not comply with federal law requiring him to give Congress 30 days' notice.(ALLISON BAILEY/Middle East Images/AFP via Getty Images)\n\n\"President Trump is dismantling checks on his power and paving the way for widespread corruption,\" Warren posted on X.\n\nDuring his first term, Trump fired five inspectors general in less than two months in 2020. This included the State Department, whose inspector general had played a role in the president's impeachment proceedings.\n\nLast year, Trump's predecessor Joe Biden fired the inspector general of the U.S. Railroad Retirement Board, after an investigation found the official had created a hostile work environment.\n\nIn 2022, Congress passed reforms that strengthened protections for inspectors general and made it harder to replace them with political appointees, requiring the president to explain their removal.\n\nChris Pandolfo is a breaking news reporter for Fox News Digital. Send tips to chris.pandolfo@fox.com and follow him on Twitter @ChrisCPandolfo.\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox"
    }
}