{
    "question": "How might the $7.4 billion settlement with Purdue Pharma and the Sackler family shape how states and local communities fund and structure opioid treatment, prevention, and recovery programs over the next decade?",
    "content": {
        "source_1": "The Sacklers will no longer have liability protection from future lawsuits.\n\nThe company and the once-prominent family behind the drug OxyContin agreed Thursday to increase their financial contribution to resolve mass opioid litigation.\n\nThe Sacklers and Purdue Pharma boosted their settlement contribution to $7.4 billion after the U.S. Supreme Courtoverturned a prior settlement in June 2024. If approved, the new plan would end the costliest corporate bankruptcy resulting from the U.S. opioid crisis.\n\nPurdue, under the leadership of the Sackler families, invented, manufactured and aggressively marketed opioid products for decades, according to the lawsuits. States and cities across the country said it fueled waves of addiction and overdose deaths.\n\nThe pharmaceutical company introduced OxyContin, a brand name of oxycodone, in the 1990s and filed for chapter 11 bankruptcy in 2019 after the company was sued thousands of times.\n\nUnder the settlement terms, the Sacklers' control of Purdue Pharma ends. The $7.4 billion will go directly to communities across the U.S. -- including states, counties, cities and territories -- over the next 15 years to support opioid addiction treatment, prevention, and recovery programs.\n\nThe Sacklers will also no longer have liability protection from future lawsuits as they previously demanded.\n\n\"Families throughout New York and across the nation are suffering from the immense pain and loss wrought by the opioid crisis,\" said New York Attorney General Letitia James, whose office helped negotiate the settlement agreement.\n\n\"The Sackler family relentlessly pursued profit at the expense of vulnerable patients, and played a critical role in starting and fueling in the opioid epidemic,\" she continued. \"While no amount of money will ever fully repair the damage they caused, this massive influx of funds will bring resources to communities in need so that we can heal.\"\n\nPurdue Pharma planned to exit bankruptcy last year under terms that gave the Sacklers a full release from all civil opioid claims even though they themselves were not declaring bankruptcy. In return, the Sacklers agreed to pay $6 billion.\n\nThe Supreme Court rejected the attempt by the Sacklers to use Purdue Pharma's bankruptcy to shield themselves from liability.\n\nUnder the new terms, a significant amount of the settlement funds will be distributed in the first three years, with the Sacklers paying $1.5 billion and Purdue paying nearly $900 million in the first payment, followed by $500 million after one year, an additional $500 million after two years, and $400 million after three years.\n\nA board of trustees selected by participating states in consultation with the other creditors will determine the future of the company. Purdue will continue to be overseen by a monitor and will be prevented from lobbying or marketing opioids.\n\n\"This story is about a family of cruel billionaires who believed they were above the law, pursued by states who never backed down,\" Connecticut Attorney General William Tong said Thursday. \"Today, we are forcing Purdue Pharma and the Sackler family to pay $7.4 billion for their role in igniting one of the most devastating public health crises in American history.\"\n\nPurdue Pharma said in a statement to ABC News, \"We are extremely pleased that a new agreement has been reached that will deliver billions of dollars to compensate victims, abate the opioid crisis, and deliver treatment and overdose rescue medicines that will save lives. We have worked intensely with our creditors for months in mediation, and we are now focused on finalizing the details of a new Plan of Reorganization, which we look forward to presenting to the bankruptcy court.\"",
        "source_2": "Gabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nMandy Taheri is a Newsweek reporter based in Brooklyn. She joined Newsweek as a reporter in 2024. You can get in touch with Mandy via email: m.taheri@newsweek.com. Languages: English, French\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nMembers of the Sackler family that owns Purdue Pharma, the maker of OxyContin, and the company have agreed to pay up to $7.4 billion in a new settlement related to lawsuits over the impactsof the prescription painkiller,several state attorneys announced on Thursday.\n\nNewsweekreached out to Purdue Pharma for comment via email on Thursday.\n\nThe deal between Purdue Pharma, the Sackler family members who own the company, and lawyers representing state and local governments along with thousands of opioid crisis victims marks an over $1 billion increase from a previous settlement that was rejected by the U.S.Supreme Courtlast year.\n\nMore than 700,000 people in the United States have died from an overdose involving opioid drugs, which includes OxyContin, since 1999, including both prescription and illegal forms, according to the federal government's Center for Disease Control and Prevention (CDC).\n\nThe numerous fatalities and addiction issues have contributed to what is known as the \"opioid crisis,\" which New York Attorney General James said in her Thursday press release that the Sacklers and Purdue Pharma played an \"instrumental role in creating.\"\n\nThis settlement ranks among the largest in recent years in a series of lawsuits aimed at holding companies accountable for the deadly opioid epidemic. In addition to the Purdue agreement, other settlements amounting to roughly $50 billion have been announced, with most funds required to be used to address the crisis.\n\nThe settlement states that the Sacklers will pay the vast majority, $6.5 billion, and Purdue Pharma will pay just under one billion, $900 million.\n\nJames was one of over a dozen state attorneys general participating in the case.\n\nPurdue Pharma toldNewsweekin an emailed statement on Thursday:\"We are extremely pleased that a new agreement has been reached that will deliver billions of dollars to compensate victims, abate the opioid crisis, and deliver treatment and overdose rescue medicines that will save lives. We have worked intensely with our creditors for months in mediation, and we are now focused on finalizing the details of a new Plan of Reorganization, which we look forward to presenting to the bankruptcy court.\"\n\nJames, in a statement on Thursday:\"The Sackler family relentlessly pursued profit at the expense of vulnerable patients and played a critical role in starting and fueling the opioid epidemic. While no amount of money will ever fully repair the damage they caused, this massive influx of funds will bring resources to communities in need so that we can heal. The Sacklers no longer have control of Purdue and will never be allowed to sell opioids in the United States again. I will continue to go after the companies that caused the opioid epidemic and fight to get justice for those who have suffered.\"\n\nConnecticut Attorney General William Tong, in a statement on Thursday:\"This story is about a family of cruel billionaires who believed they were above the law, pursued by states who never backed down. Today, we are forcing Purdue Pharma and the Sackler family to pay $7.4 billion for their role in igniting one of the most devastating public health crises in American history. This is $1.4 billion more than the settlement reached in 2022, and $3.1 billion more than the settlement Connecticut rejected in 2021...There will never be enough justice or dollars to restore those families or right this terrible wrong.\"\n\nMassachusetts Attorney General Andrea Joy Campbell, in a statement on Thursday:\"The Sackler family will forever be remembered as a symbol of greed, profiting off pain to destroy countless lives across the Commonwealth and country. While this settlement cannot bring back the lives lost, it will bring in much-needed funds to begin to remediate the damage and ensure that the Sacklers can be held accountable for the lasting devastation they have caused.\"\n\nThe deal still requires court approval, and some details are yet to be finalized.\n\nUpdated 1/23/25, 1:40 p.m. ET: This article was updated with additional information.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nMandy Taheri is a Newsweek reporter based in Brooklyn. She joined Newsweek as a reporter in 2024. You can get in touch with Mandy via email: m.taheri@newsweek.com. Languages: English, French\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he                                    ...Read more",
        "source_3": "Purdue Pharma and its owners, the Sackler family, reached a settlement of up to $7.4 billion for its role in theopioidcrisis, less than a year after the Supreme Courttossed outa proposed $6 billion settlement.\n\nThe settlement, in principle, announced Thursday byNew YorkAttorney GeneralLetitia James, would not shield the parties from additional liability, which was part of the previous settlement that was found to be an abuse of bankruptcy protections.\n\nFor decades, the Sackler family fueled waves of opioid addiction and overdose deaths across the country, causing our families immense devastation and loss.Now, we're holding them accountable for the destruction they caused and making them pay up to $6.5 billion.\n\n“My office is making Purdue Pharma and the Sackler family pay up to $7.4 billion for their roles in fueling the opioid crisis,” James said in a post on X. “This money will be used to fund opioid treatment and prevention programs nationwide, and the Sackler family’s control over Purdue will end.\n\n“For decades, the Sackler family fueled waves of opioid addiction and overdose deaths across the country, causing our families immense devastation and loss,” she added.\n\nThe agreement would have the Sackler family pay $6.5 billion, while Purdue Pharma would pay $900 million. James said she expects the deal to be finalized toward the end of the year, claiming that once it is finalized, the family will not have control over Purdue Pharma and “will never be allowed to sell opioids in the United States again.”\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nThe settlement will include 14 other states and will give New York $250 million, James said.\n\nUnder the agreement, the Sackler family will have to pay the states over a 15-year period, including $3 billion in the first three years."
    }
}