{
    "question": "What are the key legal and practical consequences of the federal judge’s 14-day block on the executive order limiting birthright citizenship, and how might the upcoming court arguments shape the outcome for government policy and affected families?",
    "content": {
        "source_1": "A federal judge said Thursday that President Donald Trump’s executive order ending birthright citizenship was “blatantly unconstitutional” and issued atemporary restraining order to block it.\n\nJudge John Coughenour, a Ronald Reagan appointee who sits in Seattle, granted the request by Washington Attorney General Nick Brown and three other Democratic-led states for the emergency order halting implementation of the policy for the next 14 days while there are more briefings in the legal challenge.\n\nRelated articleHow the modern Supreme Court might view the 14th Amendment and birthright citizenship\n\n“I have been on the bench for over four decades. I can’t remember another case where the question presented was as clear,” Coughenour said.\n\n“Where were the lawyers” when the decision to sign the executive order was made, the judge asked. He said that it “boggled” his mind that a member of the bar would claim the order was constitutional.\n\nThe Democratic-led states are seeking a temporary restraining order, as they argue that Trump’s executive order is a blatant violation of the Constitution’s 14th Amendment, which guarantees citizenship to all children born on US soil “and subject to the jurisdiction thereof.”\n\nAn attorney for the state of Washington, Lane Polozola told the judge that “births cannot be paused” while the court considers the case.\n\n“Babies are being born today here, and in the plaintiff states and around the country, with a cloud cast over their citizenship,” Polozola said.\n\nChildren denied citizenship under Trump’s order will face “longterm substantial negative impacts,” he added.\n\nPolozola also argued that the Trump administration not only ignored those harms in the filings it has submitted so far in the dispute, but that harm “appears to be the purpose” of the executive order.\n\nBeyond the impact that Trump’s order will have on their residents, Washington and the other states are arguing that the end of birthright citizenship will burden their state programs financially and logistically, as those children are shut off from federal benefits that they would be entitled to as citizens.\n\nThe Trump administration is arguing that that clause “subject to the jurisdiction thereof” allows the president to exclude the children of undocumented immigrants and even children whose parents are lawfully present but lack permanent legal status.\n\nJustice Department attorney Brett Shumate urged the judge to hold off on issuing an emergency order blocking the policy until there was more briefing on the policy.\n\n“i understand your concerns,” Shumate said, but he urged the court against making “a snap judgment on the merits.”\n\nShumate noted that the other cases challenging the executive order were moving on a slower timeline and argued that “imminent harm” is threatening the states.\n\nAt the White House on Thursday, Trump told reporters the administration will contest the ruling.\n\nA handful of other lawsuits have been brought this week against the order, including by a separate group of Democratic attorneys general, immigrant rights groups and individual plaintiffs.\n\nDuring a status conference held Thursday in one of those cases, a lawyer for the Justice Department told a federal judge in Maryland that he wasn’t aware of any federal agencies that have taken steps to begin enforcement of the order next month. That challenge was brought by immigrant rights groups and pregnant women in the state whose babies could be impacted by the order.\n\n“The executive order was issued three days ago during a time of change of administration. And so it’s very early for the agencies to develop their policies that would be necessary” to implement it, the attorney, Brad Rosenberg, told US District Judge Deborah Boardman.\n\nThe judge is set to consider a request by the plaintiffs to temporarily block the order during a hearing on February 5.\n\nMeanwhile, in a case brought by the American Civil Liberties Union and other civil rights and immigration rights groups in New Hampshire, a federal judge there has set a hearing for February 10 to consider the groups’ request to block the order from taking effect for now.\n\nThis story has been updated with additional developments.",
        "source_2": "A federal judge has temporarily blocked the birthright citizenship executive order that President Donald Trumpissuedon Monday, which seeks to bar certain children born to foreign parents on U.S. soil from automatically receiving citizenship. The order is nowon holdfor at least two weeks.\n\n\"I've been on the bench for over four decades, I can't remember another case where the question presented is as clear as this one is,\"saidWestern District of Washington Judge John C. Coughenour, a Ronald Reagan appointee. \"This is a blatantly unconstitutional order.\"\n\nOn the first night of his second presidential term, Trumpsigneda long-promised executive order challenging the 14th Amendment'sguaranteethat \"all persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States.\" The 14th Amendment \"has never been interpreted to extend citizenship universally to everyone born within the United States,\" the ordercountered.\n\nBabies born in the U.S. to unlawfully present parents or to lawfully but temporarily present parents (such as people \"on a student, work, or tourist visa\") would no longer automatically receive citizenship, according to the order. Trumpdirectedgovernment departments and agencies to stop issuing and recognizing citizenship-affirming documents to those children starting 30 days after the order was issued.\n\nThe orderquicklyfacedlawsuits from states, immigrant advocacy groups, and expectant mothers. On Monday, the American Civil Liberties Union, three of its New England state chapters, and several other organizationssuedTrump in federal court in New Hampshire. The next day,18state attorneys generalfileda lawsuit in Massachusetts federal court and four others sued in Washington.\n\nThe latter lawsuitestimatedthat in the U.S., over 150,000 children are born to undocumented parents each year. Trump's executive order \"would deny rights and benefits\" to those individuals \"and leave some of them stateless,\" it argued, per aNew York Timesreport. The states alsoheldthat \"the administration's order created an immediate burden for them, requiring them to alter systems that determine eligibility for federal-backed programs.\"\n\nMany legal experts haveexpressedskepticismthat a birthright citizenship executive order would pass constitutionalmuster. Coughenour proved sympathetic to that argument. \"Frankly, I have difficulty understanding how a member of the bar would state unequivocally that this is a constitutional order,\" hesaid. \"It just boggles my mind.\"\n\nStart your day withReason. Get a daily brief of the most important stories and trends every weekday morning when you subscribe toReason Roundup.\n\nNEXT:Congress Should Extend the Trump Tax Cuts. The Path Won't Be Easy.\n\nFiona Harriganis a deputy managing editor atReason.",
        "source_3": "A federal judge in Seattle issued a temporary restraining order Thursday to block the administration from carrying out PresidentTrump’splan to deny automatic citizenship to children of illegal immigrants.\n\nDistrict JudgeJohn Coughenourcalled the president’s executive order an affront to the Constitution, local news media reported.\n\n“I’ve been on the bench for over four decades. I can’t remember another case where the question presented is as clear as this one is. This is a blatantly unconstitutional order,” JudgeCoughenoursaid, according to The Seattle Times.\n\nThe ruling is the first legal setback for Mr.Trumpin his new term. At least for now, it shuts down one of his marquee policies from dozens of executive actions he has taken during his first days in office.\n\nMr.Trumpalso faces legal challenges over his end to Biden-era catch-and-release “parole” programs for illegal immigrants, his attempt to strip civil service protections from some federal employees and his creation of the Department of Government Efficiency, or DOGE.\n\nJudge Coughenour’s restraining order suspends the president’s birthright citizenship policy for two weeks while the legal case develops.\n\nHe assailed the Justice Department for attempting to defend Mr.Trump’spolicy.\n\n“Frankly, I have difficulty understanding how a member of the bar could state unequivocally that this is a constitutional order,” the judge said. “It just boggles my mind.”\n\nMr.Trump’sorder, signed on his first day in office, declares illegal immigrants and temporary visitors to be outside the jurisdiction of the government for purposes of the 14th Amendment, which otherwise extends automatic citizenship to children born on U.S. soil.\n\nThe amendment was adopted in the wake of the Civil War to overturn the Dred Scott decision and make clear that those who had been part of slavery had the full rights of citizenship.\n\nMr.Trump’sorder has been challenged in courtrooms from Boston to Seattle, but JudgeCoughenourwas the first to act.\n\nThe 14th Amendment reads, in part: “All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States.”\n\nThe legal issue is who qualifies for the jurisdiction language.\n\nIn United States v. Wong Kim Ark, an 1898 case, the Supreme Court ruled that a child born to two Chinese migrant parents was entitled to automatic citizenship.\n\nThat ruling acknowledged three exceptions to the 14th Amendment: children born to diplomats, those born to mothers in an enemy army occupying U.S. territory, and children born on American Indian tribal lands, which at that time were considered outside U.S. jurisdiction because tribes have quasi-sovereignty.\n\nMany legal scholars say the ruling closed the door on attempts to limit birthright citizenship and that a constitutional amendment would be required.\n\nOthers argue that Congress has enough room to act by law.\n\nMr.Trumpsaid he concluded he could do it through an executive order.\n\n“The Fourteenth Amendment has always excluded from birthright citizenship persons who were born in the United States but not subject to the jurisdiction thereof,” he said in his order, signed Monday.\n\nUnder his plan, children born on U.S. soil when neither parent is a citizen or legal permanent resident would not qualify for automatic citizenship. That would exclude children born to illegal immigrants and those on temporary visas, such as guest worker or student visas.\n\nMr.Trumpordered federal officers to refuse to issue or accept documents that would recognize citizenship in those cases.\n\nActing Assistant Attorney General Brett A. Shumate argued to JudgeCoughenour, a Reagan appointee, that the case was premature because Mr. Trump’s order didn’t kick in for nearly four more weeks.\n\nHe also argued that the Constitution is less clear than the judge said. For one thing, he said, the 1898 court case involved two parents who were legal permanent residents of the U.S., although not citizens.\n\nMr. Shumate said an 1884 Supreme Court ruling involving a birth in an Indian tribe showed valid exceptions.\n\nThe challenge to Mr.Trumpwas led by the state of Washington and joined by three other Democratic-led states: Arizona, Illinois and Oregon.\n\n• Stephen Dinan can be reached atsdinan@washingtontimes.com.\n\nCopyright © 2025 The Washington Times, LLC.Click\n                            here for reprint permission.\n\nPope Leo should tell Catholics: Marry young, have many children\n\nTrump’s TikTok delays undermine his China hawks while Intel controversy grows"
    }
}