{
    "question": "How might President Biden’s last-minute pardons of several family members influence public perceptions of the pardon power and expectations for its use by future administrations?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nPresident Joe Biden on Monday pardoned Dr. Anthony Fauci, retired Gen. Mark Milley and members of the House committee that investigated the Jan. 6 attack on the Capitol. Biden also pardoned his siblings and their spouses.\n\nPresident Joe Biden arrives for the 60th Presidential Inauguration in the Rotunda of the U.S. Capitol in Washington, Monday, Jan. 20, 2025. (Kenny Holston/The New York Times via AP, Pool)\n\nHunter Biden steps into a vehicle as he leaves federal court, Thursday, Sept. 5, 2024, in Los Angeles, after pleading guilty to federal tax charges. (AP Photo/Eric Thayer, File)\n\n▶ Follow live updates onPresident Donald Trump’s return to Washington\n\nWASHINGTON (AP) — Joe Biden pardoned his siblings and their spouses on his way out of the White House, saying Monday that his family had been “subjected to unrelenting attacks and threats, motivated solely by a desire to hurt me — the worst kind of partisan politics.”\n\n“Unfortunately, I have no reason to believe these attacks will end,” he said as his presidential term was ending.\n\nThe family pardons were the surprise finale in a series of unprecedented presidential actions by the Democrat, who has been known as an intuitionalist during his half-century in politics.Biden also pardoned Dr. Anthony Fauci, retired Gen.Mark Milley, members of the House committee that investigated the Jan. 6 attack on the Capitol and allies who have been targeted by Republican President Donald Trump. He was sworn in Monday.\n\nIt was a remarkable use of Biden’s presidential power: None of the above has been charged with any crime, and the move was designed to guard against possible retribution by Trump.\n\nTrump, during his campaign, repeatedly suggested he would seek to use the Justice Department to exact retribution against his perceived political foes. His pick forattorney general, Pam Bondi, told lawmakers during her confirmation hearing last weekthat the department would not prosecute anyone for political purposes. But she refused to rule out potential investigations into Trump adversaries, including the special counsel who brought two federal criminal cases against Trump that have since been abandoned.\n\nLast month,Biden pardoned his son Hunterfor tax and gun crimes, despite his previous pledges not to do so.\n\nBiden issued blanket pardons for his brother James and his wife, Sara; his sister, Valerie, and her husband, John Owens; and his brother Francis.\n\n“The issuance of these pardons should not be mistaken as an acknowledgment that they engaged in any wrongdoing, nor should acceptance be misconstrued as an admission of guilt for any offense,” he said in a statement.\n\nThe pardons came just before noon. Biden was already at the Capitol to seeTrump inaugurated.\n\nHouse Republicans in Junesent a letter to the Justice Departmentrecommending the prosecution of Hunter and James Biden, accusing them of making false statements to Congress as part of a Republican impeachment inquiry. James Biden’s lawyer at the time called it a “baseless partisan action.” James Biden’s business dealings were heavily scrutinized by Republicans as part of their failed impeachment inquiry. Republicans pointed to a series of payments that they claimed showed the president benefited from his brother’s work.\n\nHouse Democrats defended the transaction, pointing to bank records they say indicate James Biden was repaying a loan provided by his brother Joe, who had wire transferred $200,000 to him about six weeks earlier. The money changed hands while Joe Biden was a private citizen.\n\nIn a voluntary interview as part of the impeachment inquiry, James Biden said his brother “never had any involvement” in the business dealings of other members of his family.\n\nTrump denounced the move in remarks to supporters hours after the Biden White House announced the pardons. He mocked the Democratic administration for waiting until the final minutes of its term to announce the move.\n\n“Did you know that Biden, while I was making my speech, pardoned his whole family?” Trump said. “The brother — the whole deal was pardoned. Can you imagine that?”\n\nDuring a separate exchange with reporters, Trump accused Biden of creating “unbelievable precedent” for future presidents.\n\n“I guess now I have precedent to do it,” Trump said.\n\nOther presidents have pardoned family members, but those were for specific criminal convictions.\n\nBill Clintonpardoned his brother Roger for drug charges after he had served his sentence roughly a decade earlier. In the final weeks of his first term,Trump pardoned Charles Kushner, the father of his son-in law, Jared Kushner, as well as multiple allies convicted in special counsel Robert Mueller’s Russia investigation.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Joe Biden in the final minutes of his presidency on Monday issuedpardonsto five more members of his family—his brother James and wife Sarah, his younger sister Valerie Biden Owens and husband John T. Owens, and his brother Francis Biden—after he says they were \"subjected to unrelenting attacks and threats\" motivated by a desire to hurt him.\n\nThe move comes after Biden controversially pardoned his son Hunter—who was previously charged with tax and gun crimes—andgave preemptive pardonsto Trump foes like Dr. Anthony Fauci, General Mark Milley and members of the House Jan. 6 committee.\n\nOther than his son Hunter, Biden’s family members haven’t faced charges.\n\nBiden said in a statement the preemptive pardons are not an admission that his family members engaged in any wrongdoing, nor that they’re guilty of any crimes.\n\nHe called out \"baseless and politically motivated investigations\" meant to target political rivals and their families as motivation for the pardons, and said that even being investigated for a crime they’ll be cleared of “can irreparably damage their reputations and finances.”\n\nPresident Donald Trump, who was sworn in roughly 20 minutes after the pardons were announced,has suggestedhe could use federal agencies to prosecute his political rivals if he was reelected, telling Spanish-language television network Univision \"it could certainly happen\" and that his indictments, which he has also claimed were politically motivated, \"released the genie out of the box.\"\n\nGet Forbes Breaking News Text Alerts:We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to(201) 335-0739or sign uphere.\n\nBiden holds therecordfor the most individual pardons and commutations issued.\n\nThe GOP-led House Oversight Committee launched an investigation into Biden and his family in January 2023, citing concerns with the foreign business activities of Biden's son, Hunter, and brother, James. The investigation, and theimpeachment inquirythat followed, alleged—but ultimately didn’t dig up evidence—that Joe Biden was involved in or personally profited from his family's business dealings, or that he improperly influenced policy based on them during his time as vice president. James Biden, who has been accused ofcapitalizingon the Biden name to further his business prospects,testifiedthat his brother has never been involved with or benefited from any of his business ventures.\n\nHunter Biden, the second son of Joe Biden and his first wife, Neilia Hunter Biden, was in Juneconvictedon three federal felonies for unlawfully purchasing a gun while he was addicted to drugs in 2018. Prosecutors allege Biden was in the throes of an addiction to crack cocaine when he lied on a federal form to purchase a gun by checking a box that he was not a drug user. By doing so, he lied to a federally licensed firearm dealer and illegally owned the gun for 11 days. Prosecutors used Hunter Biden's memoir, “Beautiful Things,” to prove he was addicted to drugs at the time and several family members were called to testify against him. The three charges carried a maximum sentence of 25 years in prison and $750,000 in fines. He wasscheduledto be sentenced on the charges in December, but his fatherpardoned himon Dec. 1. Separately, Hunter Bidenpleaded guiltyto tax crimes.The then-president saidhis son was “selectively, and unfairly, prosecuted,” arguing in a statement the charges “came about only after several of my political opponents in Congress instigated them to attack me and oppose my election.” “No reasonable person who looks at the facts of Hunter’s cases can reach any other conclusion than Hunter was singled out only because he is my son – and that is wrong,” the president wrote.\n\nBiden on Monday morning issuedpreemptive pardonsto Milley, Fauci and lawmakers and staffers who served on the House Jan. 6 select committee. He said the pardons were to prevent the incoming Trump administration from targeting them with “politically motivated” criminal investigations and prosecutions. On Sunday, Bidengranted clemencyto five people who were convicted of non-violent drug offenses and commuted the sentence of two people he said have demonstrated \"remorse, rehabilitation, and redemption\" in decades of incarceration. On Friday, Bidencommutedthe sentences of almost 2,500 people convicted of nonviolent drug offenses. In December, hecommutedthe sentences of roughly 1,500 people who were released from prison and placed on home confinement during the coronavirus pandemic and pardoned 339 Americans convicted of nonviolent crimes. Biden previously issued 122 commutations and 21 other pardons.",
        "source_3": "By signing up to our newsletters you agree to the Just the NewsTerms of ServiceandPrivacy Policy\n\nPresident Joe Biden pardons his brother Jim Biden and other family members on Monday.\n\nPresident Joe Biden pardons brother Jim Biden and other family members on Monday just before his time in office expired.\n\n\"My family has been subjected to unrelenting attacks and threats, motivated solely by a desire to hurt me -- the worst kind of partisan politics,\" Biden wrote in a statement. \"Unfortunately, I have no reason to believe these attacks will end.\"\n\nBiden also issued pardons for his sister-in-law Sara, his sister Valerie and her husband, John Owens, and his brother Francis.\n\n“The issuance of these pardons should not be mistaken as an acknowledgment that they engaged in any wrongdoing, nor should acceptance be misconstrued as an admission of guilt for any offense,” Biden's statement continued.\n\nBiden's family has been subject to investigations from House Republicans for overseas business deals in Ukraine. Last month, Biden pardoned his son Hunter for gun and tax crimes.\n\nHouse Oversight Committee Chairman James Comer, R-Ky., blasted Biden following the pardons.\n\n\"President Biden’s preemptive pardons for the Biden Crime Family serve as a confession of their corruption as they sold out the American people to enrich themselves,\" Comer said in a statement. \"Our investigation revealed that at least ten members of the Biden Crime Family and their associates raked in over $30 million by selling Joe Biden’s influence to corrupt foreign entities and individuals in China, Russia, Ukraine, Romania, and Kazakhstan.\"\n\nBiden also granted clemency to Indigenous activist Leonard Peltier, who murdered FBI agents Jack Coler and Ronald Williams in 1975. He was sentenced to life in prison\n\nHuman rights organizations argued that Peltier was wrongly convicted,according to reports."
    }
}