{
    "question": "What are the potential implications of the Supreme Court upholding the TikTok sell-or-ban law, given that enforcement now hinges on the incoming Trump administration, for U.S. national security, free expression, and the millions of American users and businesses on the platform?",
    "content": {
        "source_1": "WASHINGTON — TheSupreme Courton Friday delivered a blow to TikTok by upholding a law that could lead to a ban on the video-sharing social media platform in the United States.\n\nIn an unsigned opinion with no dissents, the justices rejected a free speech challengefiled by the company, meaning the law is set to go into effect on Sunday as planned.\n\nThe bipartisan law requires China-based TikTok owner ByteDance to divest itself of the company by Sunday, the day before President-elect Donald Trump is to take office. If no sale takes place, the platform used by millions of Americans will in theory be banned.\n\nIn what is a fast-changing situation, it is unclear what will happen at that point, as there are signs that Trump may seek to keep the app available. TheBiden administration has also signaledit will not take any action to enforce the law on Sunday.\n\nIn astatement Friday evening, TikTok indicated it would go dark on Sunday if the Biden administration cannot provide \"a definitive statement to satisfy the most critical service providers assuring non-enforcement.\"\n\n\"The statements issued today by both the Biden White House and the Department of Justice have failed to provide the necessary clarity and assurance to the service providers that are integral to maintaining TikTok’s availability to over 170 million Americans,\" TikTok said in the statement, posted to X.\n\nThe anti-TikTok sentiment that led Congress to pass the law, driven by the concern about the level of control the Chinese government has over the company, has rapidly dissipated in some quarters.\n\nWhite House press secretary Karine Jean-Pierre issued a statement saying that “TikTok should remain available to Americans” but that the national security issues should be addressed.\n\n“Given the sheer fact of timing, this administration recognizes that actions to implement the law simply must fall to the next Administration, which takes office on Monday,” she added.\n\nTrump responded onTruth Social, although he did not explain exactly what he plans to do.\n\n“The Supreme Court decision was expected, and everyone must respect it. My decision on TikTok will be made in the not too distant future, but I must have time to review the situation. Stay tuned!” he said.\n\nEarlier, Trump saidin another postthat he had discussed TikTok with Chinese President Xi Jinping during a Friday call.\n\nIn response to the ruling, TikTok CEO Shou Chew posted a video on the apppraisingTrumpand expressing hope for \"a solution that keeps TikTok available.\"\n\nThe Justice Department had raised two key issues in defending the law: that the Chinese government could exert control over what content users see in order to influence public opinion, and that it could collect sensitive data on millions of American users.\n\nIn the ruling, the court acknowledged that the national security rationale affected its analysis of whether there was a free speech violation under the Constitution’s First Amendment, with the justices focusing on the data collection issue.\n\nThe court concluded that the reasons for enacting the law are “decidedly content agnostic,” meaning they have nothing to do with restricting certain speech.\n\n“TikTok’s scale and susceptibility to foreign adversary control, together with the vast swaths of sensitive data the platform collects, justify differential treatment to address the government’s national security concerns,” the court said.\n\n“The challenged provisions further an important government interest unrelated to the suppression of free expression and do not burden substantially more speech than necessary to further that interest,” the court added.\n\nIn a concurring opinion, Justice Neil Gorsuch expressed skepticism about the government’s content manipulation argument, saying that journalists, publishers and others “routinely make less-than-transparent judgments about what stories to tell and how to tell them.”\n\nTrump had filed an unusual amicus brief at the court urging it to put the law on hold in the hope that he could “pursue a political resolution” on the issue once in the White House.\n\nDuring his first term in office, Trump himself tried to ban TikTok, but he has since changed his tune. He recently said he had a “warm spot” in his heart for the platform and met with the company’s CEO.\n\nOne of Trump’s options would be to grant a 90-day extension for TikTok to find an American buyer by citing a provision in the law aimed at forcing a sale. There has been speculation about potential buyers, but ByteDance has said it will not approve a sale.\n\nTrump could also vow not to enforce the law, but that might not be enough to convince companies that could face legal exposure, such as Apple and Google, which currently allow people to access TikTok in their app stores. The law imposes civil penalties on companies that help the company “distribute, maintain or update” its services, including those that operate app stores. Those penalties could be sought up to five years after the alleged violation, including after Trump leaves office.\n\nDuring the Supreme Court oral arguments, Solicitor General Elizabeth Prelogar cast doubt on some of TikTok’s pronouncements, suggesting it may be playing a “game of chicken” and might abruptly change course if the law goes into effect.\n\nIf TikTok were to “go dark,” as its lawyer told the Supreme Court it would if the law is not blocked, content creators would have to move to alternative platforms that have sought to compete with the app by launching features focusing on the sharing of short-form videos, such as Instagram Reels and YouTube Shorts.\n\nThe U.S. Court of Appeals for the District of Columbia Circuit previously upheld the law.\n\nLawrence Hurley is a senior Supreme Court reporter for NBC News.\n\nKat Tenbarge is a tech and culture reporter for NBC News.",
        "source_2": "President Donald Trump has for a third time extended the deadline that would have required TikTok to be sold or face a ban in the US.\n\nA bipartisan law passed by Congress last year mandates TikTok's Chinese parent company, ByteDance, sell the app.\n\nThe platform'went dark'for a day in January after the law took effect, until Trump intervened issuing consecutive 75-day postponements, and now a 90 day extension until September.\n\nThe US government has said TikTok poses a threat to national security because Chinese authorities might access its vast trove of user data, which Beijing denies.\n\nTrump once supported a ban, but changed his position in part because of the role he believes it played in his second election victory:  \"I have a warm spot in my heart for TikTok because I won youth by 34 points\", he said in December.\n\nBut a key Democrat lawmaker has criticised continued postponements.\n\nSenator Mark Warner accused Trump of \"flouting the law and ignoring its own national security findings about the risks posed by a PRC [People's Republic of China] controlled TikTok\".\n\nIf no deal is reached by 17 September, the app could once again face a US ban and be pulled from app stores.\n\nAnd the executive orders extending the time to find a buyer do not overturn the sell-or-ban law passed by Congress and upheld by the US Supreme Court.\n\nPresident Trump has previously said \"multiple investors\" were closing in on a deal.\n\nHe also suggested the US could offer a deal where China agrees to approve a TikTok sale in exchange for relief from US tariffs on Chinese imports.\n\nBut it is unlikely that TikTok's parent company will sell without the blessing of the Chinese government.\n\nSeveral potential buyers have cropped up in reports.\n\nAmazonhas put in a last-minute offer to the White House to acquire TikTok, according to the BBC's US partner CBS. Amazon declined to comment.\n\nTrump has said he would be open to selling TikTok toOracle co-founder Larry Ellison, as well as Elon Musk, although the latter said he had no intention of buying.\n\nOther potential buyers include billionaireFrank McCourt,together with Canadian businessmanKevin O'Leary- a celebrity investor on Shark Tank, the US version of Dragons' Den.\n\nAlexis Ohanian, who co-foundedReddit, said in a post on X last month that he had joined Mr McCourt's bid.\n\nThe biggest YouTuber in the worldJimmy Donaldson- AKAMrBeast- has also said he's looking to buy TikTok as part of a group of investors.\n\nTim Stokely, the British founder ofOnlyFans, has also to offered to buy TikTok under his recently re-launched company, Zoop.\n\nComputing giantMicrosoft, private equity giantBlackstone,venture capital firmAndreessen Horowitzand search enginePerplexity AIare also reportedly in the running for a stake.\n\nThe White House has reportedly considered an option whereby ByteDance would keep ownership of TikTok's algorithm, but lease it to a new entity operating the video-sharing app within the US.\n\nTikTok says it has 170 million US users who spent - on average - 51 minutes per day on the app in 2024.\n\nExperts say rivals such as Instagram Reels and YouTube Shorts could benefit if Trump's efforts to broker a sale of TikTok don't succeed.\n\n\"Chief marketing officers who we've spoken with confirmed that they will divert their media dollars to Meta and Google if they can no longer advertise on TikTok,\" said Kelsey Chickering, an analyst at market research company Forrester.\n\nOther potential winners include Amazon's Twitch, which made its name by hosting livestreams - a popular feature on TikTok. Twitch is well known particularly to gamers, though its other content is expanding, too.\n\nOther Chinese-owned platforms,such as Xiaohongshu- known as RedNote among its US users - have also seen rapid growth in the US and the UK.\n\nAdditional reporting by Liv McMahon & Imran Rahman-Jones\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nThe US military is preparing to activate troops as part of Trump's crackdown on street crime.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nIf approved by the energy watchdog Ofgem, it would allow the US firm to take on the UK's dominant suppliers.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "O'Leary Ventures Chairman Kevin O'Leary reacts to the latest developments around the California wildfires, a potential TikTok sale and his latest meeting with President-elect Trump at Mar-a-Lago.\n\nPresident Joe Biden will not seek to enforce the ban on the popularsocial media platform TikTokthat is slated to take effect on Jan. 19 due to legislation passed last year, the Associated Press reported, citing a U.S. official.\n\n\"Our position on this has been clear: TikTok should continue to operate under American ownership. Given the timing of when it goes into effect over a holiday weekend a day before inauguration, it will be up to the next administration to implement,\" a White House official noted in a statement, according toABC News.\n\nBidensigned off last yearafter Congress passed a massive multi-billion-dollar package stuffed with items such as foreign aid and the TikTok-related measure.\n\nTIKTOK PLANNING TO SHUT DOWN IN US ON SUNDAY: REPORTS\n\nFOX Business’ Lydia Hu joins ‘Varney & Co.’ to report on the latest news emerging from the TikTok ban as users and creators prepare for the potential ban.\n\nTheSupreme Court issued a rulingon the matter on Friday, opting not to slap down the ban.\n\n\"There is no doubt that, for more than 170 million Americans, TikTok offers a distinctive and expansive outlet for expression, means of engagement, and source of community. But Congress has determined that divestiture is necessary to address its well-supported national security concerns regarding TikTok’s data collection practices and relationship with a foreign adversary. For the foregoing reasons, we conclude that the challenged provisions do not violate petitioners’ First Amendment rights,\" the high court held.\n\nTrump, the second U.S. president to notch non-consecutive White House wins, is set to be sworn in on Monday, which is also the day of the federal holiday celebrating Martin Luther King Jr.'s birthday, though King's actual birthday was on Jan. 15.\n\nPOTENTIAL TIKTOK BAN: WHAT SOCIAL MEDIA APPS ARE POPPING UP IN APP STORES\n\nBillionaire entrepreneur Frank McCourt, Jr. discusses the future of TikTok in the United States on 'The Claman Countdown.'\n\n\"President Trump has repeatedly expressed his desire to save Tik Tok, and there’s no better deal maker than Donald Trump,\" Trump-Vance transition spokeswoman Karoline Leavitt said in a statement. Trump has tapped Leavitt to serve as his White House press secretary.\n\nIf Tiktok is sold so that it severs ties with Chinese company ByteDance and is no longer viewed as a foreign adversary controlled application, it would no longer be subject to a ban under the law.\n\n'MAKE TIKTOK WONDERFUL AGAIN': KEVIN O'LEARY EXPLAINS HIS PLAN TO SAVE THE SOCIAL MEDIA PLATFORM\n\nTrump National Security Adviser pick Rep. Mike Waltz, R-Fla., tells 'Special Report' that the incoming administration will work to on a deal to keep the 'fantastic platform' in place for Americans while protecting their data.\n\nRep. Mike Waltz, R-Fla., who Trump tapped to serve as his national security adviser, said during an appearance on \"Fox & Friends\" that the incoming administration \"will put measures in place to keep TikTok from going dark,\" noting that the legislation allows for pushing back the ban if a deal is in the works.\n\n\"The Administration, like the rest of the country, has awaited the decision just made by the U.S. Supreme Court on the TikTok matter,\" White House press secretary Karine Jean-Pierre said in a statement.\n\n\"President Biden’s position on TikTok has been clear for months, including since Congress sent a bill in overwhelming, bipartisan fashion to the President’s desk: TikTok should remain available to Americans, but simply under American ownership or other ownership that addresses the national security concerns identified by Congress in developing this law.  Given the sheer fact of timing, this Administration recognizes that actions to implement the law simply must fall to the next Administration, which takes office on Monday,\" Jean-Pierre added.\n\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\n\nBy clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time."
    }
}