{
    "question": "How might the uncertainty over whether arson, lingering embers from a New Year’s fireworks blaze, or utility equipment sparked the Palisades and Eaton fires shape public trust, accountability, and future wildfire prevention strategies in Los Angeles?",
    "content": {
        "source_1": "Hikers and outdoor enthusiasts have long been drawn to Skull Rock north of Sunset Boulevard in Pacific Palisades.\n\nA relatively short hike on the Temescal Ridge trail reveals the skeletal-shaped Skull Rock and dramatic Pacific Ocean views.\n\nNow, this area is the subject of an investigation as a potentialstarting point for the Palisades fire,which burned thousands of structures last week.\n\nIt’s unclear where the fire started, and its cause is under investigation.\n\nSpeculation about the cause of Los Angeles’ devastating fires is rampant. The official investigations are now underway.\n\nThe general area was the site of a small fire on New Year’s Eve that burned for a few hours before fire officials said they snuffed it out with help from a water-dropping helicopter.\n\nSources with knowledge of the investigation told The Times that officials are aware of the earlier fire and its general proximity to  the Palisades fire. They are looking into whether that could be the cause. Because the area is frequented by the public, the sources said it’s possible a new fire was somehow sparked there on Jan 7.\n\nThe earlier fire appears to have been sparked by fireworks, officials said.\n\nAs for the Palisades fire, the sources — who spoke on  condition of anonymity because they were not authorized to speak publicly — said it appears to have human origins, but that the investigation is ongoing.\n\nAfter dropping his kids off at school around 8:15 a.m. on the day  the Palisades fire started, Darrin Hurwitz drove to the area to hike.\n\nHe did a five-mile loop that took him up above Skull Rock, and surveyed the burn scar from the New Year’s Eve fire.\n\n“Around the same time, I noticed a bit of a smoky smell. I didn’t make much of it. I figured it was either coming from somewhere else or was the remnants of the fire itself,” he told The Times.\n\nHe had done another hike recently in Malibu where the Franklin fire had burned a few weeks earlier and noticed a “faint ash smell.” But the smell on that day near Skull Rock was stronger, he said, and he wondered whether the wind had rustled up ash.\n\nThose looking to assist residents affected by the Los Angeles County firestorm have a number of options to donate money, materials or their time.\n\nOne of his neighbors also smelled the smoke, he later learned.\n\n“The timing of this was about an hour before the fire,” he said. “Now, what that all means, I don’t know. Could it be possible that there were still some embers that weren’t out and the winds were kind of rustling them up?”\n\nThe fire was first reported about an hour later from the address on Piedra Morada Drive where Nic Libonati’s family lives.In an interview with The Timeslast week, Libonati confirmed that he was the first to call 911 and that he went to alert his neighbors to the fire.\n\nWhen Libonati and his sister first spied the fire, he said, it was about two miles from their home. But he knew they were in trouble when he tried to hose down their plants and the wind blew the water back into his face. Libonati realized the flames were headed in their direction.\n\nA specialized team from theBureau of Alcohol, Tobacco, Firearms and Explosivesbegan processing the scene Monday.\n\nLos Angeles Police Department Asst. Chief Dominic Choi said no causes have been ruled out in the Palisades fire: “There’s been no definitive determination that it is arson at this point, but we’re looking at every angle.”\n\nLaw enforcement sources said there are power poles charred nearby but it’s far from clear that they were the point of origin.\n\nIf it turns out the Palisades fire was caused by a rekindling of the earlier fire, it would fit a pattern.\n\nThe massive Oakland Hills fire of 1991 — which destroyed more than 2,500 structures — exploded after firefighters thought they had contained it. That fire was originally six acres and was declared contained but not out.Firefighters left equipmentat the scene but did not monitor it at all times. Winds picked up and then flames quickly consumed homes.\n\nThe devastation of the Palisades fire extends to the trail and rock formations.\n\nThe Times listed Skull Rock as a top Southern California hike,describing it this way:“Enjoy heavily shaded switchbacks under oaks and coastal chaparral hillsides as you ascend on the Temescal Ridge trail toward panoramic viewpoints that stretch from Santa Monica to the Channel Islands on a clear day. Skull Rock and its boulder buddies are the midpoint of your geological journey and a great locale for some rock scrambling to a picnic perch.”\n\nHurwitz hiked the trail near his house at least three times a week.\n\n“That trail is spectacular,” Hurwitz said. “It’s just a little bit of everything. It’s really great scenery. It’s definitely one of the more popular trails in L.A. People drive from all over the city to hike it.”",
        "source_2": "The hiking trail through Temescal Canyon in western Los Angeles is a favourite of locals.\n\nTowering above the twisting roads and manicured homes that make up the Pacific Palisades, urban hikers seeking an escape from America's famously gridlocked city have a clear view of the pristine waters of the Pacific.\n\nNow the green, brush-lined path in the canyons is grey and burned as far as the eye can see.\n\nYellow police tape surrounds the path up to the trail. Police guarding this area are calling it a \"crime scene\" and prevented BBC reporters, including me, from getting any closer.\n\nIt's where investigators think the deadly blaze that destroyed so many homes in the area may have started.\n\nA similar scene is playing out across town in the north of the city. There, the community of Altadena was levelled by a different fire that ignited in the San Gabriel Mountains.\n\nInvestigators in both locations are scouring canyons and trails, and examining rocks, bottles, cans – any debris left behind that might hold clues to the origins of these blazes, which are still unknown.\n\nIt's the one thing on-edge and devastated Angelenos are desperate to know: how did these fires start?\n\nWithout answers, some in fire-prone California are filling in the gaps themselves. Fingers have been pointed at arsonists, power company utilities or even a blaze days prior in the Pacific Palisades that was snuffed out but may have re-ignited in the face of Santa Ana winds blowing at 80-100mph (128-160 kmph) last week.\n\nInvestigators are examining all those theories and more. They're following dozens of leads in the hopes that clues in burn patterns, surveillance footage and testimony from first responders and witnesses can explain why Los Angeles saw two of the most destructive fire disasters in US history ignite on 7 January, so far killing 27 people and destroying more than 10,000 homes and businesses.\n\nBut this tragic mystery will take time to solve – possibly as long as a year.\n\n\"It's just too early,\" Ginger Colbrun, a spokeswoman for the Los Angeles division of the US Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) told the BBC.\n\n\"Everyone wants answers, we want answers, the community wants answers. They deserve an explanation. It just takes time.\"\n\nThe first trace of the Palisades Fire may have been spotted by Kai Cranmore and his friends as they hiked in Temescal Canyon, on a trail frequented by nature lovers and California stoners alike.\n\nIt's not uncommon for visitors to bring alcohol and music, relaxing in nature by Skull Rock – a landmark rock formation along the trail.\n\nIn a series of videos posted online, Mr Cranmore and his friends are seen running down the canyon on the morning of 7 January. His first videos show a small cloud of smoke billowing from a hill as they navigate through brush and rock formations in a desperate escape. Out of breath, they comment on having smelled fire before seeing smoke rising.\n\nIn further clips, that small cloud gets darker and flames can later be seen cresting over the hilltop.\n\n\"Dude, that's right where we were standing,\" one person exclaims in the video as flames whip in the distance. \"We were literally right there,\" another chimes in.\n\nThe videos of the hikers are being examined as part of the official investigation into the origin of the Palisades Fire, Ms Colbrun of the ATF confirmed, saying their experience is just one of many tips and potential leads that have been flagged to authorities.\n\n\"The investigators, they're talking to everyone,\" she said.\n\nSome on the internet were quick to blame the group for the fire, noting how close they were to the blaze when it erupted. Even actor Rob Schneider posted about the hikers, asking his followers to help identify them.\n\nIn interviews with US media outlets, members of the hiking group noted how fearful they became as people started online attacks. One of the men said he deleted his social media accounts.\n\n\"It's scary,\" one of the group told the LA Times. \"Just knowing as a matter of fact of our experience that we didn't do it but then seeing the amount of people that have different theories is overwhelming.\"\n\nMs Colbrun said investigators were also speaking to firefighters who responded to a blaze days earlier that sparked nearby in the same canyon. A persistent theory holds that a small fire on 1 January was never fully extinguished and reignited six days later as winds picked up.\n\nThe Palisades Fire is thought to have erupted around 10:30 local time on 7 January, but several hikers told US media they'd smelled smoke earlier that morning as they used the trail.\n\nA security guard who works near the trail told the BBC he'd seen smoke or dust for several days in the area. The morning of the blaze he was patrolling the neighbourhood bordering the canyon and called firefighters as a plume of smoke formed.\n\nBut Los Angeles County Fire Chief Anthony Marrone was dismissive of speculation the the two fires in the Palisades, nearly a week apart, could be connected.\n\n\"I don't buy it. Personally, I don't buy it,\" he told the BBC. \"I believe that a week is too long for a fire to get re-established that wasn't fully contained.\" He acknowledged such incidents do happen but they are rare.\n\nWhile Chief Marrone's agency is not leading the probe into the Palisades Fire, he said investigators were also examining the possibility of arson.\n\n\"We had numerous fires in the LA County region almost simultaneously, which leads us to believe that these fires were intentionally set by a person,\" Chief Marrone said.\n\nHe adds that about half of the brushfires the agency typically responds to are intentionally set.\n\nChief Marrone has been primarily focused on the other side of town, dousing the Eaton Fire that tore through much of Altadena. It levelled whole neighbourhoods, destroyed blocks of businesses and killed at least 17 people.\n\nThe agency is working with Cal Fire, California's state-wide fire agency, to investigate the cause of that blaze and where it ignited.\n\nThe Eaton Fire erupted shortly after sunset on 7 January - hours after firefighters became overwhelmed in the Palisades.\n\nJeffrey Ku captured what could be some of the earliest footage of the fire.\n\nA Ring doorbell camera on his home captured the moment his wife came to pull him outside. \"Hey babe, I need you to come out here right now,\" she tells him as her hair whips in the fierce winds. \"We have a very big problem.\"\n\n\"Oh no!\" Mr Ku can be heard saying as bright orange flames light up the sky.\n\nAt that point, the fire was still small. It was blazing under a large metal utility tower on the mountainside.\n\nIn a series of videos, Mr Ku documented how quickly it spread – each update carrying more worry in his voice as he and his wife packed what they could to leave.\n\n\"Please God, please God save us, save our house. Please God, please,\" he says in one – the whole sky now glowing yellow-orange. Sirens echo around him.\n\nThe large metal utility tower Mr Ku recorded is now a focus for fire investigators.\n\nUtility providers have been blamed for some of California's worst fires, including the 2018 Camp Fire that killed 85 people and destroyed the town of Paradise. In 2019, Pacific Gas and Electric (PG&E) agreed a $13.5bn (£10.2bn) settlement with victims of the Camp Fire and other wildfires in the state.\n\nIn the week since the Eaton Fire, there have already been at least five lawsuits filed against Southern California Edison, the power provider that operates the tower seen in Mr Ku's video.\n\nThe company says it has not found any evidence that its equipment was responsible for the fire and is reviewing the lawsuits.\n\nIn a statement, it said its preliminary analysis of transmission lines across the canyon showed there were \"no interruptions or operational/electrical anomalies in the 12 hours prior to the fire's reported start time until more than one hour after the reported start time of the fire\".\n\nAdditionally, the company said its distribution lines to the west of Eaton Canyon \"were de-energized well before the reported start time of the fire\" as part of its fire safety shut-off program.\n\nChief Marrone told the BBC that investigators were looking into all possibilities, including whether the tower may have been where a spot fire ignited – meaning the initial blaze could have been started elsewhere but then spread to the tower through flying embers.\n\nHe explained the tower where the fire was spotted is not like those seen in neighbourhoods. Rather than a wooden pole with a small, easy-to-blow transformer or slim wires, this was a massive metal transmission tower with high voltage lines as thick as a fist.\n\nThese types of lines aren't typically the cause of fires because they're computerised, he said, and the system automatically turns off power once there is an issue.\n\nHe noted, though, that investigators were looking into whether Southern California Edison's systems operated properly that night and cut power.\n\nCal Fire cautioned against casting any blame so early in the probe.\n\n\"We want to make very sure that we're not pointing any fingers in any direction because we've seen what happens when someone is falsely accused,\" Gerry Magaña, deputy chief of operations, told the BBC in an interview.\n\nAdditional reporting from Hannah Green and Emma Pengelly\n\nThe Edinburgh landmark was evacuated as the flames spread up the hill, with no reported casualties.\n\nAshdown Forest is warning silver-studded blue butterflies' habitat is vulnerable to wildfire.\n\nHeld at the Sonoma County Fair in Santa Rosa, the annual event promotes adopting dogs of all ages and appearances.\n\nAcross the country, more than 50 agricultural and forest fires have broken out in the past 24 hours - one of the worst days this summer.\n\nThe fire service says the body of an elderly man was found inside his home in the Togani area, close to where the fire started.",
        "source_3": "Los Angeles police said three people were charged with arson in separate incidents this week after they were caught lighting fires near where the massive, deadly blazes have torn through parts of Southern California.\n\nLos Angeles Police Chief Jim McDonnell said the suspects, who were not identified, were not responsible for starting the infernos in the Pacific Palisades and Eaton that have claimed at least 25 lives since they ignited last week.\n\nAuthorities said one person was arrested Monday on Van Nuys Boulevard after the person was seen igniting a brush fire.\n\nOfficers raced to the area, arrested the suspect on arson charges and took the person to the Van Nuys Jail, Chief McDonnell said. Firefighters had put out the fire by the time police arrived.\n\nAnother suspect was arrested Monday when police said they received a call about a person setting a trash can on fire in West Los Angeles.\n\nAuthorities said witnesses directed officers to the suspect. Fire crews quickly extinguished the budding blaze.\n\nOn Sunday night, police said a person was caught using a BBQ lighter to ignite fires around North Hollywood.\n\nChief McDonnell said the person was arrested on an outstanding felony warrant for arson and was booked into the Van Nuys Jail.\n\nAt least five people total have been charged with arson since the wildfires broke out Jan. 7 in the Palisades.\n\nThe Los Angeles County District Attorney’s Office said Jose Gerardo Escobar, 39, was charged Friday after he was accused of lighting a large tree on fire in Pioneer Park in Azusa.\n\nMr. Escobar, who is thought to be homeless, could spend up to nine years in jail if convicted of the charge.\n\nCalifornia parks authorities said a woman was charged with arson Jan. 8 after she was accused of starting a brush fire near Leo Carrillo State Park in Los Angeles County.\n\nGloria Lynn Mandich, 60, is being kept behind bars in Ventura County, police said.\n\nAn illegal immigrant from Mexico was tackled and held to the ground by wary citizens last week when he was observed with a blowtorch near where the Kenneth fire broke out.\n\nPolice took Juan Manuel Sierra into custody on a felony probation violation in the incident, but he was cleared on suspicion of arson charges after police said there wasn’t enough probable cause to link him to a crime.\n\nThe arson arrests come as police crack down on looters and others who are violating the evacuation order in the Palisades and Eaton fire zones.\n\nThe Los Angeles Police Department said it has handcuffed 14 people near the Palisades fire on charges ranging from burglary, shoplifting, driving under the influence and impersonating a firefighter.\n\nThe Los Angeles County Sheriff’s Department said it has made 34 arrests in the past week, largely near the Eaton fire. Suspects have been charged with curfew violations and at least two were linked to flying a drone near the wildfire.\n\n• Matt Delaney can be reached atmdelaney@washingtontimes.com.\n\nCopyright © 2025 The Washington Times, LLC.Click\n                            here for reprint permission.\n\nPope Leo should tell Catholics: Marry young, have many children\n\nTrump’s TikTok delays undermine his China hawks while Intel controversy grows"
    }
}