{
    "question": "In what ways could the surge of U.S. users to RedNote amid a potential TikTok shutdown shape policy debates and future decisions about other Chinese-owned apps like Lemon8?",
    "content": {
        "source_1": "As Supreme Court justicesponderthe future of TikTok in the United States, a growing number of American social media users have responded by moving to an unlikely alternative: Xiaohongshu, a hugely popular social media app inChina.\n\nThe app, which means “Little Red Book,” often shortened by US users to RedNote, surged to the top position on Apple’s US App Store on Tuesday.\n\nFounded in 2013, Xiaohongshu is one of China’s biggest social media platforms with 300 million users, according to research firm Qian Gua. Described as China’s answer to Instagram, the app has becomeespecially popularfor sharing tips on travel, makeup and fashion.\n\nBut while it has cornered the Chinese market, it hasn’t gained much prominence beyond the Chinese-speaking world. Until now.\n\nXiaohongshu is surging in popularity worldwide in the same week that TikTok could potentially go offline in the US.\n\nUS mobile downloads of Xiaohongshu almost tripled over the past week, compared to the seven days before, San Francisco-based market intelligence firmSensor Towertold CNN on Tuesday.\n\nRelated articleHere’s what TikTok users are saying about the looming ban\n\nWithin the span of two days, more than 700,000 new users have joined Xiaohongshu, Reuters reported, citing a person close to the company. CNN has reached out to Xiaohongshu for comment.\n\nAs of Wednesday, the hashtag “TikTok refugee” had garnered nearly 250 million views and over 5.5 million comments. Many of the American users they had joined as an act of defiance against Washington’s move on TikTok.\n\n“Our government is out of their minds if they think we’re going to stand for this TikTok ban,” a user called Heather Roberts said in a video message on Xiaohongshu, which has garnered more than 45,000 likes. “We’re just going to a new Chinese app, and here we are.”\n\n“This is so much better than TikTok,” another self-proclaimed “refugee” said in video message. “Americans are coming here … so sorry you’ll hate us, but I promise we’ll do our best.”\n\nThe sudden migration of US users to Xiaohongshu has created an unlikely platform for Chinese and American users to interact with each other.\n\n“I just want to reassure you that we want to try to find a way to communicate with you, be respectful to your community,” one user said. “We want to be good guests.”\n\nSome American newbies have appealed to their compatriots to respect Chinese users on the platform.\n\n“Just a quick message for the American users coming over here: Please don’t bring politics here. We want to have fun here, we want to enjoy here, and we want to show respect to the people who are already here,” one user posted.\n\nMost Chinese users have warmly welcomed the newcomers, with some even sharing video tutorials to help the new “TikTok refugees” navigate the app.\n\n“This could be a historic moment,” one Chinese user commented. “It feels like so much has changed in an instant. Ordinary people from our two countries have never really connected before … I hope everyone can take this brief chance to engage in meaningful exchanges of ideas.”\n\nRelated articleThey built careers on TikTok. Now they’re bracing for a possible ban\n\nOne person even seized the opportunity presented by the influx of American netizens to ask for help with their English homework in aviral postthat garnered over 2,000 likes.\n\nIvy Yang, a China tech analyst and founder of consulting firm Wavelet Strategy, said the new American users had “unexpectedly created one of the most organic forms of cultural exchange between the US and China we’ve seen in recent years.”\n\n“Users are finding creative ways to transcend language barriers, navigate cultural differences, and co-exist in fascinating ways,” she added. “This community building happening in real time could have lasting impact, and I’m cautiously optimistic.”\n\nFor a brief period in 2021,similar exchangeswere also seen on the social media app Clubhouse, where Chinese and American users engaged in uncensored dialogue on sensitive topics in virtual chat rooms, before Chinese censors intervened to block the app.\n\nAs of Tuesday, only a “very small proportion” of X posts about Xiaohongshu touched on sensitive topics in China, where online discourse is carefully censored, according to media intelligence firm PeakMetrics.\n\nWell, for starters, Xiaohongshu wasn’t designed for English speakers, while TikTok isn’t in China at all.\n\nXiaohongshu’s name could be seen as a tongue-in-cheek reference to a red-covered book of quotations from the founding father of Communist China, Mao Zedong.\n\nOne of the app’s key features is its content algorithm, which focuses on user interests rather than the people they follow. Some users say this fosters more original content and reduces the dominance of powerful influencers.\n\nThe company behind the app, Xingin Information Technology, was founded by Charlwin Mao and Miranda Qu and is headquartered in Shanghai.\n\nTikTok is owned by Chinese internet company ByteDance and was tailored for a global audience. TikTok is also not accessible in China, where a sister app, Douyin, serves the domestic market.\n\nLemon8, a lifestyle community app also owned by ByteDance, is currently ranked as the second-most downloaded app on Apple’s US store.\n\nLemon8 has a similar video sharing function as TikTok. Modeled after Instagram and Pinterest, it was first launched in the US in 2023.\n\nIt’s unclear whether the looming ban on TikTok might also jeopardize Lemon8’s operations in the US.\n\nThe US law passed by Congress last year states that the divest-or-ban requirement will generally apply to all apps that are owned or operated by ByteDance, meaning that although Lemon8 was not explicitly mentioned in the statute, the ban may also extend to the platform.\n\n— CNN’s Simone McCarthy and Yuri Liu contributed reporting.\n\nClarification: This story has been updated to reflect data analysis from PeakMetrics.",
        "source_2": "Reporting by Katie Paul, Krystal Hu and Doyinsola Oladipo in New York, and Eduardo Baptista in Beijing, additional reporting by Sophie Yu in Shanghai; Editing by Matthew Lewis\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nKrystal reports on venture capital and startups for Reuters. She covers Silicon Valley and beyond through the lens of money and characters, with a focus on growth-stage startups, tech investments and AI. She has previously covered M&A for Reuters, breaking stories on Trump's SPAC and Elon Musk's Twitter financing. Previously, she reported on Amazon for Yahoo Finance, and her investigation of the company's retail practice was cited by lawmakers in Congress. Krystal started a career in journalism by writing about tech and politics in China. She has a master's degree from New York University, and enjoys a scoop of Matcha ice cream as much as getting a scoop at work.",
        "source_3": "A version of this story appeared in the dailyThreat Statusnewsletter from The Washington Times.Click hereto receive Threat Status delivered directly to your inbox each weekday.\n\nAmerican users fearing a potential TikTok shutdown because of the popular video-sharing app’s ties to Beijing are rushing toChina’ssocial media app Xiaohongshu as an alternative.\n\nThe frenzy to find a substitute before the threatened ban next week has made Xiaohongshu, which means “Little Red Book” in English, the top downloaded app in Apple’s App Store.\n\nLemon8, which like TikTok is owned by China-based ByteDance, appeared second in Apple’s list of top free downloaded apps on Tuesday, trailing only Xiaohongshu, colloquially referred to by TikTok users as RedNote. ByteDance faces a deadline later this month to sell or shut down its popular American subsidiary under a bipartisan law signed by President Biden last spring.\n\nThe #tiktokrefugee topic notched more than 160,000 posts on Xiaohongshu, indicating internet audiences are adaptable and prepared to work around government-imposed restrictions and digital blockades.\n\n“Aaand now all the “TikTok refugees” are flocking to RedNote — another [Chinese] brain rot social media platform,” Rep. Daniel Crenshaw, Texas Republican, said on X. “By the way: ’RedNote’ refers to Mao’s ’Little Red Book,’ which was literal propaganda distributed during the Chinese Cultural Revolution.”\n\nThe TikTok refugees are not going quietly to their new digital dens. Droves of TikTok fans moving to Rednote are giving it stellar ratings on Apple’s App Store, along with reviews trashing Meta’s rival platforms.\n\n“Not bending my knee to Zuck,” said one reviewer on Monday, a reference to Meta head Mark Zuckerberg. “I’ll gladly giveChinamy data. AllMeta platformsdeleted.”\n\nTech writer Taylor Lorenz encouraged X users to ditch the American app for RedNote, and said “Long LiveChina,” according to a translation of her Chinese-language post.\n\n“Follow me on Rednote, the hottest new social app in America!!” Ms. Lorenz said on X.\n\nXiaohongshu is not exactly new. The platform had roughly 300 million monthly active users in July, according to the South China Morning Post, and has competed with Chinese tech firms since its founding in 2013, according to CNBC.\n\nWhether Xiaohongshu’s popularity endures in the U.S. remains to be determined, as is the fate of TikTok in America. The Supreme Court is expected to rule soon on the constitutionality of the law forcing TikTok’s divestiture fromChina’sByteDance by Jan. 19 or face a ban on national security grounds.\n\nWhile those same policymakers may have expected Google’s YouTube and Meta’s Instagram to be among top beneficiaries of TikTok in peril, Hudson Institute senior fellow Michael Sobolik thinksChina’sother platforms that will benefit more.\n\n“The narrative up until now has been IG reels or YouTube Shorts benefiting from TikTok’s potential demise,” Mr. Sobolik said on X alongside an image showing Google Search interest for RedNote rising. “It seems an alternative [Chinese Communist Party]-controlled app stands poised to benefit most of all.”\n\nMr. Sobolik said Xiaohongshu could one day meet the same fate as TikTok in the U.S. market, likely falling under the scope of the same bill that forced TikTok’s sale.\n\n•This story is based in part on wire service reports.\n\n• Ryan Lovelace can be reached atrlovelace@washingtontimes.com.\n\nCopyright © 2025 The Washington Times, LLC.Click\n                            here for reprint permission.\n\nPope Leo should tell Catholics: Marry young, have many children\n\nTrump’s TikTok delays undermine his China hawks while Intel controversy grows"
    }
}