{
    "question": "How could renewed U.S. interest in acquiring Greenland reshape relations among the U.S., Denmark, and Greenland, and what consequences might it have for NATO cohesion, Arctic security, and Greenland’s path toward independence?",
    "content": {
        "source_1": "What happens when you treat the world like a game of Risk.\n\nIt is an era of superpower conflict and competition for natural resources. Newly accessible sea routes are transforming the world’s political geography. The US government eyes a strategically located island territory, currently under the control of the Kingdom of Denmark, which Washington believes is necessary for its national security and economic interests. After first making an offer to buy the territory — one rejected by Copenhagen — the US suggests that it won’t rule out the use of military force to take it. The Danes, in response, grudgingly take the deal.\n\nThe year is 1915 and the territory in question is theDanish West Indies, known today as the US Virgin Islands. In the wake of thesinking of the passenger ship Lusitaniaby German submarines, President Woodrow Wilson’s administration wanted control of the Caribbean islands out of fear they could be annexed by Germany, and used as a base to attack shipping through the recently opened Panama Canal. That deal – which wasfinalized in 1917 for $25 million, or a bit less than $600 million in today’s money — was the last major territorial purchase by the United States.\n\nSuch territorial acquisitions were a relatively common practice in the age of overseas empires, but are nearly unheard of today. This musty topic, though, is unexpectedly back in the news, thanks to President-elect Donald Trump’svery public coveting of Greenland: another Danish-administered island.\n\nTrump first publicly discussedthe idea of the United States purchasing the world’s largest islandback in 2019, during his first term. The idea was rejected out of hand by the government of Denmark at the time, with Prime Minister Mette Frederiksen saying she “hope[s] that this is not meant seriously.”Trump canceled a visit to Denmarkin response.\n\nHow serious Trump is now is known to him alone, but he has not let the idea go as he prepares to return to the White House. In December, in a social media post announcing his pick of PayPal co-founder Ken Howery to serve as ambassador to Denmark,Trump posted, “For purposes of National Security and Freedom throughout the World, the United States of America feels that the ownership and control of Greenland is an absolute necessity.”\n\nThe Greenland proposal comes alongside Trump repeated is-he-joking-or-isn’t-hesuggestions that Canada be made the “51st state”anddemands that Panama return controlof the Panama Canal — altogether, an agenda for territorial expansion on a level not seen since theJames K. Polk administrationin the mid-19th century. The Republican-led House Foreign Affairs Committeeposted on X then deleteda post praising Trump’s plans for Greenland and Panama, writing that it’s “un-American to be afraid of big dreams.”\n\nThings got more serious on Tuesday at a press conference at Mar-a-Lago whenTrump refused to rule outusing “military or economic coercion” to take Greenland or the canal. (Canada, it seems, is off the hook for military force but not economic.) Also this past week, the president-elect’s son,Donald Trump Jr., visited Greenlandfor a brief and heavily-documented stopover.\n\nNow that the president-elect of the United States has refused to rule out military force against a NATO ally in Denmark, European leaders clearly no longer find this funny. Chancellor Olaf Scholz of Germanyposted on X, “Borders must not be moved by force” — the sort of admonition usually used against Russia and China.\n\nEven if we take Trump entirely at his word that he is serious about this and will make it a priority, the acquisition of Greenland is extremely unlikely to happen. But perhaps inadvertently, Trump has highlighted some thorny issues about geopolitics in a rapidly transforming and geopolitically important Arctic, and the suddenly contested borders of what had seemed like a settled world map.\n\nGreenland, an 836,000-square-mile island mostly covered by ice, has been under Danish rule since the 18th century, except for a period of German occupation during World War II followed by brief US protectorate. As Trump has pointed out,President Harry Truman made an offer(rebuffed by the Danes) to take permanent control of Greenland after the war.\n\nBut Greenland is also not simply property that Denmark could sell at will. In recent decades, Greenland’s population, which is nearly 90 percent Inuit, has been moving gradually toward full independence. Greenlandattainedhome rule, including its own parliament, in 1979, and took on even greater political autonomyfollowing a 2008 referendum.\n\nGreenland now has its own prime minister, domestic laws, and court system. Its foreign and security policies are still dictated from Copenhagen, althoughGreenland is seeking more autonomyon those issues as well. In a New Year’s speech, made in the context of Trump’s remarks, Greenland Prime Minister Múte Egede suggested the time may have come tomove more quicklytoward independence.\n\nTheGreenland Self-Government Act, passed in 2009, stipulates that if the people of Greenland decide to move toward full independence, they will enter into negotiations with Denmark on making that happen. The push for independence has been coupled with a historical reckoning over colonial-era practices including theremoval of Greenlandic children from their familiesto be raised by Danes. “Greenlanders are very tired of being, in a sense, treated like second-class citizens or like teenagers that are not really responsible for their actions,” said Ulrik Pram Gad, a senior researcher on Arctic issues at the Danish Institute for International Studies.\n\nOn the other hand, there are also reasons why full independence hasn’t happened yet. For one thing, while Greenland would be one of the biggest countries in the world by land area (it’s larger than Mexico), it would be one of the world’s smallest by population with just 57,000 people (less than the capacity of an NFL football stadium). And thatpopulation is only shrinking.\n\nDespite some painful history, many Greenlanders also have close family and cultural ties to Denmark. The island also receives about $500 million per year in social welfare payments from the Danish state, and Greenlanders have access to free medical care and free tuition at Danish universities. (All of which is to say, Puerto Rico-like status in Trump’s America might be a tough sell for a people used to the generous Nordic welfare state.)\n\nOf course, Greenland independence could become a lot more viable if the territory, which iscurrently reliant mainly on fishing for income, developed more independent sources of wealth. Which is where Trump’s interest in the place comes in.\n\nIt’s not entirely clear when Trump decided that control of Greenland is an “absolute necessity,” for US national interests, but one theory,reported by the New York Timesback in 2021, was that it came after a briefing at the White House by Greg Barnes, an Australian minerals prospector who has long touted Greenland’s mining potential. (Cosmetics heir Ronald Lauder, an old friend of Trump’s, alsoseems to have pushed the idea.) Greenland has substantialreserves of metals like lithium, niobium, and zirconium, which are used for producing batteries, as well as rare earth elements that are considered vital for the green energy transition, but which China currentlyenjoys a near monopoly over.\n\nGreenland’s Arctic climate and geology make it a difficult place to extract these materials — there arecurrently only two active mineson the island — but as the ice sheet covering80 percent of Greenland melts, the idea is that they will become more accessible. (There’s something a bit perverse about the notion of Greenland’s shrinking glaciers, which could raise global sea levels by 20 feet if they melted entirely, as asolutionto climate change.) This has attracted interest and investments from a number of mining companies and governments, includingChina — likely another reason for Trump’s interest. These projects have also encountered local resistance: In 2021, Greenland’s parliamentpassed legislation banning uranium miningand halting a major rare earths mining project.\n\nOn the less climate-friendly side, the US Geological Survey has also estimated that Greenland may have as many as 31 billion barrels of oil, though no oil has actually been found despite nearly 50 years of exploration, and thegovernment ended exploration in 2021, citing environmental concerns.\n\nIn an era of rising great power tension, governments around the world are also increasingly looking at the Arctic as an area ofstrategic importance and competition. Part of this is the region’s potential mineral reserves. Part of it isshipping routesthat have become newly navigable thanks to melting Arctic Sea ice.\n\nRussia, which generates much of its GDP from oil and gas extracted above the Arctic circle, has taken a particular interest in the region. Under President Vladimir Putin, the Russian government hasreopened 50 previously shuttered Soviet-era military basesin the area. Perhaps not coincidentally, the Arctic has seenalleged “gray zone”attacks by Russia against telecommunications infrastructure and an increasing number ofclose encounters by military aircraft. Geopolitical tensions in the Arctic have only grown since Russia’s 2022 invasion of Ukraine.\n\nChina, which describes itself as a “near-Arctic state” even though it is nearly a thousand miles away from the Arctic Circle at its closest point, has been increasing its economic and military assets in the region as well. Critics say the US, an Arctic power thanks to Alaska — another old territorial purchase — has been slow to respond to these developments: case in point, the US currently has only hasone operational icebreaker in its fleetand likely won’t have a new one until the 2030s.\n\nThe Arctic’s geopolitical importance is also a reason why Denmark (as well as the European Union) would be reluctant to part with Greenland. Thanks to Greenland, Denmark is not only 50 times bigger than it would be otherwise, it is also the only European Union country with an Arctic coastline. (Arctic Norway is not an EU member.) This gives it a seat on theArctic Counciland a say on issues involving an increasingly contested region of the world. “There has been a kind of Greenland card, which has made Denmark more important security-wise than a standard, small European country,” Gad said.\n\nIt should be noted that none of the reasons why Greenland is strategically important for the United States explain why it needs to bepart ofthe United States. American companies, including anew mining venture backed by Bill Gates and Jeff Bezos, are already investing in Greenland’s minerals. The US also already has a military base in the country:Pituffik Space Base, formerly known as Thule Air Base, is both the northernmost US military base in the world and a key node inAmerica’s missile early warning system.\n\nThe US benefits from Greenland being under the jurisdiction of a friendly NATO ally: In 2017, the Danish governmentblocked an effort by a Chinese mining companyto acquire an abandoned military base in Greenland, in part out of a desire to maintain good relations with the US. These are the sort of relations that are potentially threatened by publicly musing about annexing territory by force.\n\nIt’s worth briefly considering justwhyTrump’s Greenland idea seems so bizarre. The United Statesacquired more than half of its current land massby paying for it through transactions like the Louisiana Purchase, the Alaska Purchase, and theTreaty of Guadalupe Hidalgo, under which Mexico ceded the territory for much of what became the American West. It was once relatively common for countries to trade, say, the north sea island of Heligoland for the African archipelago of Zanzibar, asBritain and Germany did in 1890.\n\nBritain acquired Bombay (now Mumbai) from Portugal as part of awedding dowryfor the marriage of a Portuguese princess to King Charles II. (Barron Trump is probably safe from being married off to a Danish princess as part of a deal, but never say never.)\n\nBorders are still sometimes redrawn by agreement these days:Tajikistan ceded some mountainous territoryto China in 2011,India and Pakistan have exchangedsome left over border enclaves, but they’re rare and the territories in question are usually pretty small.\n\nThe main reason why the market for national sovereignty isn’t what it used to be is probably that while much of the world’s landmass was once covered by colonial empires, it is now mostly covered by sovereign nation-states, in which citizens have some expectation of sovereignty — which includes the right to not simply be sold off to the highest bidder.\n\nGreenland’s political status makes it something of a holdover in this regard, but that doesn’t mean its people and leaders — who’ve been steadily moving toward greater political independence — will simply acquiesce to being treated as an imperialist bargaining chip. “We are a proud Indigenous people with a right to self-determination and not some sort of good that can be traded,” Aaja Chemnitz, a member of Greenland’s parliament,told NBC News.\n\n(Though Trump has claimed that the “people of Greenland are ‘MAGA’” and will “benefit tremendously” from US acquisition, it’s not clear if he envisions them having any say in the matter.)\n\nAs for Trump’s refusal to rule out military force,wars of territorial conquestare thankfully also a lot more rare than they used to be and a lot less likely to be successful. That’s one reason why Russia’s invasion and annexation of parts of Ukraine has been such a shock to the international system.\n\nAt least since the days of Woodrow Wilson, US governments have — with some notable exceptions —had a bias toward preserving international bordersrather than redrawing them. But Trump, who broke from most of the international community by recognizingIsraeli sovereignty over the Golan HeightsandMoroccan control of Western Saharaduring his first term, clearly has a far more transactional view of borders and sovereignty than the last century of American presidents. Describing his Greenland plan, the former developer hascompared it to a real estate deal: ““I look at a corner, I say, ‘I’ve got to get that store for the building that I’m building,’ etc. It’s not that different,” he told reportersinterviewing him for a bookat the end of his first term.\n\nThe risk of treating the world map like agame of Risk, even just in rhetoric, is not merely that it strains relations with US allies. It’s that it could validate territorial claims by US enemies.\n\nIt’s hardly surprising that Russian pundits and politicians have taken a keeninterest in Trump’s Greenland plans. As The Economist’s Shashank Joshiwrites, “If the next US government normalises the idea of absorbing territory by force … it makes it more likely that China will believe that the US will ultimately stand aside during an invasion of Taiwan.”\n\nBack in 2014, when Russia first annexed Crimea, thenSecretary of State John Kerry scoffed, “You just don’t in the 21st century behave in 19th-century fashion by invading another country on a completely trumped-up pretext.” Now, it appears, it’s the US that wants to take the world back to the age of empires.\n\nUnderstand the world with a daily explainer, plus the most compelling stories of the day.",
        "source_2": "In recent weeks, US President-elect Donald Trump has shown renewed interest in taking control of Greenland, a largely autonomous territory of Denmark in the Arctic and the world's largest island.\n\nHe first indicated an intention to buy Greenland in 2019, during his first term as president, but this week he went further, refusing to rule out economic or military force to take control of it.\n\nDanish and European officials have responded negatively, saying Greenland is not for sale and its territorial integrity must be preserved.\n\nSo how could this unusual situation play out, with two Nato allies at odds over a huge territory which is 80% covered with ice but has considerable untapped mineral wealth?\n\nAnd how could the aspirations for independence among Greenland's population of 56,000, under Danish control for 300 years, affect the final outcome?\n\nHere we look at four possible scenarios for Greenland's future.\n\nThere is some speculation that Trump's move is just bluster, a move to get Denmark to boost Greenland's security in the face of the threat of both Russia and China seeking influence in the region.\n\nLast month,Denmark announced a new $1.5bn (£1.2bn) military packagefor the Arctic. It had been prepared before Trump's remarks but the announcement just hours after them was described by the Danish defence minister as an \"irony of fate\".\n\n\"What was important in what Trump said was that Denmark has to fulfil its obligations in the Arctic or it's got to let the US do it,\" says Elisabet Svane, chief political correspondent for Politiken newspaper.\n\nMarc Jacobsen, associate professor at the Royal Danish Defence College, believes that this is a case of Trump \"positioning himself before entering office\" while Greenland is using the occasion to gain more international authority, as an important step towards independence.\n\nSo even if Trump were to lose further interest in Greenland now, which Professor Jacobsen thinks is the most likely scenario, he has certainly put the spotlight on the issue.\n\nBut independence for Greenland has been on the agenda for many years, and some say the debate could even go in the opposite direction.\n\n\"I noticed in the last few days the Greenland PM is calmer in his comments - ie. yes, we want independence but in the long run,\" says Svane.\n\nThere is a general consensus in Greenland that independence will happen eventually, and also that if Greenland votes for it, Denmark will accept and ratify it.\n\nHowever, it is also unlikely that Greenland would vote for independence unless its people are given guarantees that they can keep the subsidies they currently get from Denmark to pay for things like healthcare and the welfare system.\n\n\"The Greenland PM may be up in arms now, but in the event that he actually calls a referendum, he will need some kind of convincing narrative about how to save the Greenland economy and welfare system,\" Ulrik Gad, a senior researcher at the Danish Institute for International Studies, told the BBC.\n\nOne possible next step is a free association - something like the US currently has with Pacific states the Marshall Islands, Micronesia and Palau.\n\nDenmark has previously opposed this status both for Greenland and for the Faroe Islands, but according to Dr Gad, current Prime Minister Mette Frederiksen is not categorically against it.\n\n\"Danish understanding of the Greenland historical experience is way better than it was 20 years ago,\" he says, with Denmark accepting colonial responsibility.\n\nThe recent discussions \"might persuade [Frederiksen] to say - better to keep Denmark in the Arctic, keep some kind of connection to Greenland, even if it's a looser one\", he adds.\n\nBut even if Greenland is able to get rid of Denmark, it has become clear in recent years that it can't get rid of the US. The Americans never really left after taking control of the island in World War Two, and see it as vital for their security.\n\nAn agreement in 1951 affirmed Denmark's basic sovereignty of the island but, in effect, gave the US whatever it wanted.\n\nDr Gad said that Greenland officials had been in contact with the last two US administrations about Washington's role.\n\nThere has been speculation that Trump's economic rhetoric is potentially the biggest threat to Denmark - with the US drastically increasing tariffs on Danish, or even EU, goods, forcing Denmark into concessions of some kind over Greenland.\n\nProfessor Jacobsen says Danish governments have been preparing for that, and not just because of the Arctic territory.\n\nTrump has been threatening universal 10% tariffs on all US imports which could, among other things, significantly disrupt European growth, and some Danish and other European companies are now considering setting up manufacturing bases in the US.\n\nPossible options for raising tariffs include by invoking the 1977 International Emergency Economic Powers Act (IEEPA), Benjamin Cote of international law firm Pillsbury told the website MarketWatch.\n\nOne of the main Danish industries potentially affected by this is pharmaceuticals. The US receives products such as hearing aids and most of its insulin from Denmark, as well as the diabetes drug Ozempic, made by the Danish company Novo Nordisk.\n\nAnalysts say the hike in prices that would result from these measures would not find favour with the US public.\n\nThe \"nuclear option\" seems far-fetched, but with Trump failing to rule out military action it has to be considered.\n\nEssentially, it wouldn't be hard for the US to take control, given that they already have bases and plenty of troops in Greenland.\n\n\"The US has de facto control already,\" says Professor Jacobsen, adding that Trump's remarks seemed ill-informed and he didn't understand the point of them.\n\nThat said, any use of military force by Washington would create an international incident.\n\n\"If they invade Greenland, they invade Nato,\" says Svane. \"So that's where it stops. Article 5 would have to be triggered. And if a Nato country invades Nato then there's no Nato.\"\n\nDr Gad says Trump sounds like Chinese President Xi Jinping talking about Taiwan or Russia's Vladimir Putin talking about Ukraine.\n\n\"He's saying it's legitimate for us to take this piece of land,\" he says. \"If we take him really seriously this is a bad omen for the whole of the Western alliance.\"\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nThe US military is preparing to activate troops as part of Trump's crackdown on street crime.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.",
        "source_3": "President-elect Donald Trump is not planning a military invasion of Greenland, nor should he. However, he does actually make sense when he suggests that theUnited Statesshould try to acquireGreenlandfromDenmarkpeacefully. Trump and Congress should look closely into how much Greenland would be worth to this country and examine whether it would be worthwhile to offer to buy it from Denmark for an appropriate price.\n\nU.S. purchases of territory have a long and beneficial history. The Louisiana Purchase of 1803 doubled the nation’s territory in one fell swoop. The 1819 Florida Purchase, the 1848 Mexican Cession, the 1853 Gadsden Purchase, and the 1867 Alaska Purchase all proved to be wise moves for the U.S. while bringing beneficent government to those lands. And the U.S. even has a history of buying from Denmark itself, in the $25 million purchase of what would become the Virgin Islands in 1917.\n\nAs for Greenland, it would be of more use to the U.S. than it is to tiny Denmark. Its land mass of 836,000 square miles, bigger than Alaska and California combined, dwarfs Denmark’s own, making it almost unmanageable for the Danes long term. And its strategic military benefits to Denmark are virtually nil because Denmark will not be a major player in “great power” competition regardless. For the U.S., though, and for world peace and freedom, a purchase of Greenland could be a great boon. Indeed, twice before, in 1867 and 1946, U.S. officials seriously considered buying the huge island.\n\nThe U.S. already operates a long-standing military facility there, the Pituffik Space Base (formerly known as the Thule Air Base), which conducts important satellite operations and keeps tabs on any Russian missile launch, which assuredly would cross over the Arctic rather than travel a longer course over Western Europe and the broad Atlantic Ocean. That base is in the northwest of the island, but the southern part of Greenland, which the U.S. right now does not control, oversees theGreenland-Iceland-U.K. gap, which is a maritime route of critical strategic-military importance.\n\nMoreover, as both Russia and China evince interest in claiming large parts of, or the entirety of, the Arctic Ocean as their own, with interest in snatching its oil and minerals, the U.S. would be well advised to bracket the ocean with Greenland on one side to go with Alaska on the other. The Arctic contains an estimated 13% of the world’s undiscovered oil and 30% of its undiscovered natural gas, along with diamonds, iron ore, nickel, copper, and zinc. And Greenland itself is full of those riches, ones Denmark may not have the wherewithal to develop but the U.S. does, and it also boasts tremendously productive fisheries.\n\nThe U.S. in turn has more resources than Denmark to provide superb environmental protections for the large interior of Greenland and to do worthwhile environmental research there.\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nIf the U.S. did purchase the huge island, the island’s 56,000 residents could enjoy territorial status in much the same way as the Virgin Islands, Guam, and Puerto Rico — or, perhaps, the island could be added to the state of Maine, thus affording its residents full representation in Congress.\n\nEither way, a U.S. absorption of Greenland could make great sense. Denmark may not want to let it go, but perhaps the U.S. could offer a price worth considering."
    }
}