{
    "question": "In what ways do the LAFD’s budget accounting choices—such as setting aside $76 million for labor agreements outside its operating account—shape perceptions of a “cut” and affect staffing and prevention capacity during the Los Angeles wildfires?",
    "content": {
        "source_1": "“The consistent defunding of other city programs in order to give the LAPD billions a year has consequences,” said a local activist.\n\nLess than 12hours after a massive fire began ripping through the Pacific Palisades on Tuesday, the Los Angeles Fire Department made a rare request. All LAFD firefighters, including those off-duty, were asked to phone in their availability. Stoked by high winds, the blaze was growing quickly, and the LAFD was already fighting a losing battle. Such a summons hadn’t been issued in nearlytwo decades.\n\nAs of January 8, the Palisades Fire is 0 percent contained. Two additional wildfires, the Hurst Fire and the Eaton Fire, are also currently at zero containment as they scorch greater Los Angeles County, burning thousands of acres, destroying over 1,100 structures, and killing at least five people. As hundreds of firefighters race to stop the spread, gusting Santa Ana winds and a landscape desiccated by a bone-dry winter — an anomalylinkedto broader climate change trends — aren’t the only obstacles the LAFD is facing.\n\nThe LAFD makes up about 6 percent of the city’s expense budget; the LAPD receives 15 percent.\n\nIn June, Los Angeles Mayor Karen Bass signed an adopted $12.8 billion budget that cut the fire department’s funding by more than $17.5 million, or around 2 percent of the previous year’s budget of $837 million. It was the second-largest departmental operating cut to come out of the city’s 2024-25 fiscal year budget, which shaved funding from the majority of city departments — but not the police. The Los Angeles Police Department received a funding bump of nearly $126 million.\n\nThe mayor’s initial budget proposal included a $23 million decrease for the fire department — a more drastic reduction than what the LA City Council finally approved. (The outdated $23 million figure circulated widely on social media after the wildfires this week.) The fire department operating budget is about a third of what the LAPD is allocated.\n\n“What is currently happening and unfolding is what we have been warning about,” said Ricci Sergienko, a lawyer and organizer withPeople’s City Council LA. “The consistent defunding of other city programs in order to give the LAPD billions a year has consequences, and these elected officials do actually have blood on their hands. The city is unprepared to handle this fire, and Los Angeles shouldn’t be in that position.”\n\nOther departments that received major cuts included the Bureau of Street Services, the Bureau of Sanitation, and General Services, for an overall budget decrease of nearly $250 million. Funds for rental support, homelessness services, and street lighting were also reduced.\n\nOnly three city councilmembers — Hugo Soto-Martínez, Nithya Raman, and Eunisses Hernandez — voted against the budget last May, noting in apress releasethat it allocated tens of millions of dollars to fund LAPD positions that would likely remain vacant. That’s because the LAPD hasstruggledto recruit officers in recent years, even as it continues to request and receive funding for those empty positions.\n\nSince The Intercept and local news outlets reported that the fiscal-year LA fire budget declined by $17.6 million, elected officials have pushed back. LA City Councilmember Bob Blumenfield disputed the budget cuts, telling Politico that the fire department in fact received a $50 million increase in funding this year. The new funds he referenced appear to come from an agreement reached with the firefighters’ union in November for raises and benefits, but are not linked to increased staffing. Those funds have not yet been distributed, according to City Controller Kenneth Mejia. (Blumenfield’s office did not respond to The Intercept’s request for comment.)\n\nLos Angeles Fire Chief Kristin Crowley tells@NorahODonnellthe department was \"limited to a certain factor\" after a recent $17.6 million budget cut. She had recently warned that cuts would hamper their ability to respond to large-scale emergencies and said the department \"did…pic.twitter.com/wK989fEn3q\n\n— CBS Evening News (@CBSEveningNews)January 10, 2025\n\nA spokesperson for Mejia said that the LAFD budget cuts last June included a reduction in sworn payroll, reduced funds for operating supplies, and the elimination of 58 positions. In December, weeks after the new union contract was signed, the Board of Fire Commissioners sent areportto Bass and the City Council outlining how the funding cuts in the budget had adversely impacted the department’s crucial services.\n\nAn LAPD spokesperson reached by The Intercept said that they could not respond to questions by the time of publication.\n\nWhile it’s unclearthat any amount of staffing could have fully contained the fires raging across Los Angeles this week, the call for help — and the firefighters traveling in to assist from across California and nearby states — show that any additional capacity in place before the fires sparked could have helped.\n\nThe controversial cuts were ostensibly made to help close the city’s budget deficit. Critics, however, have noted that defunding the fire department is a recipe for disaster as the climate crisis brings increasingly devastating fires to the drought-stricken region.\n\n“The Los Angeles City Fire Department (LAFD) is facing unprecedented operational challenges due to the elimination of critical civilian positions and a $7 million reduction in Overtime Variable Staffing Hours,” wrote Fire Chief Kristin Crowley wrote in the December Board of Fire Commissionersreportto city officials. “These budgetary reductions have adversely affected the Department’s ability to maintain core operations, such as technology and communication infrastructure, payroll processing, training, fire prevention, and community education.”\n\nThe LAFD’s Fire Prevention Bureau, for instance, had six of its roles cut and its overtime hours reduced. Crowley wrote that the decrease in overtime hours created an “inability to complete required brush clearance inspections, which are crucial for mitigating fire risks in high-hazard areas.”\n\nOriginal reporting. Fearless journalism. Delivered to you.Will you take the next step to support our independent journalism by becoming a member of The Intercept?\n\nBy signing up, I agree to receive emails from The Intercept and to thePrivacy PolicyandTerms of Use.\n\nWhile most departments received cuts, LAPD’s budget continues to bloat, and Mejia has pointed tooverspending on police liability claimsas one major source of the city’s deficit. The city spent more than double its annual liability payouts budget in the first six months of this fiscal year, with the LAPD leading the spending at more than $100 million in legal settlements. Recentpayoutsinclude a $17.7 million settlement with the family of a mentally disabled man who was fatally shot by an off-duty officer inside a Costco, and a $11.8 million payout to a man who sustained a traumatic brain injury in a car accident when an LAPD detective ran a red light.\n\nDiana Chang, Mejia’s communications director, highlighted two forces that are driving a rise in liability payouts, most of which are made from the city’s General Fund rather than department-specific appropriations. Departments are either “not held accountable for liabilities they give rise to,” Chang wrote, or they are “underfunded / understaffed and cannot keep up with the necessary demands and needs of the City.”\n\n“We just give more money to the police, who then end up costing us more money, due to all of these settlements. It’s a never-ending loop.”\n\nSergienko, of People’s City Council LA, bristled at the use of taxpayer money to fund police abuse settlements. “We’re paying for state-sanctioned violence instead of having money to deal with the climate crisis,” he said. “We just give more money to the police, who then end up costing us more money, due to all of these settlements. It’s a never-ending loop.”\n\nLooking ahead, the LAPD has already requested another increase for the 2025-26 fiscal year. In November, the LA Board of Police Commissioners approved a spending package that included a request for an additional $160.5 million from the city’s budget — an increase of more than 8 percent. Bass is currently reviewing the proposal; she’s expected to unveil the city’s next budget plan in late April.\n\nBass’s office, which did not immediately respond to a request for comment, has publicly clashed with Mejia over his criticism of the city budget. Last spring, after Mejia called the deductions to public services “short-sighted,” Bass spokesperson Zach Seidldismissedthe remarks as “theatrical exaggeration and doomsday projections.”\n\nFor many Angelenos, that doomsday is now here. The fires burning across the county are already the most destructive inmodern LA history, forcing more than 80,000 evacuations with no signs of abating. Whole blocks in the Palisades are leveled. The Eaton fire is eating its way through Altadena, Pasadena and the surrounding communities, taking at least five lives so far.\n\nLos Angeles is no stranger to wildfires, but a January disaster is unusual. Studiesshowthat climate change is contributing to longer, more destructive fire seasons. Still, in 2020, LA’s then-Mayor Eric Garcetticutanother $500,000 in funds set aside for a Climate Emergency Mobilization Office.\n\n“The impact of this catastrophic event will be felt by our community well past today, but we hope that our City’s coordinated efforts will provide assistance to ensure the smoothest recovery possible,” Chang wrote in a statement. “As always, we support putting resources and meaningful investments toward saving lives through emergency preparedness, wildfire prevention, and serious climate action, and encourage the City’s decisionmakers to prioritize these resources and investments.”\n\nUpdate: January 10, 2025The headline of this story has been updated to specify how the city budget cuts affected the fire department. Additional material in the story describes new funds designated to the fire department from a general fund in November for raises and benefits, five months after LAFD’s operating budget was cut by $17.6 million.\n\nWhat we’re seeing right now from Donald Trump is a full-on authoritarian takeover of the U.S. government.\n\nCourt orders are being ignored. MAGA loyalists have been put in charge of the military and federal law enforcement agencies. The Department of Government Efficiency has stripped Congress of its power of the purse. News outlets that challenge Trump have been banished or put under investigation.\n\nYet far too many are still covering Trump’s assault on democracy like politics as usual, with flattering headlines describing Trump as “unconventional,” “testing the boundaries,” and “aggressively flexing power.”\n\nThe Intercept has long covered authoritarian governments, billionaire oligarchs, and backsliding democracies around the world. We understand the challenge we face in Trump and the vital importance of press freedom in defending democracy.\n\n“The more the President’s wealth depends on anonymous investors around the world with hidden agendas, the greater the risk.”\n\nThe State Department was told to cut from its human rights reports info on election integrity, corruption, and the expulsion of refugees.\n\nMonuments to racism license racist violence. White supremacists, for their part, know this well.",
        "source_2": "Critics on social media have alleged that Mayor Karen Bass cut the city fire department’s budget by $23 million this year. The accusation has spread quickly, with many looking to cast blame for the devastating wildfires that have destroyed thousands of buildings in Los Angeles County this week and resulted in at least 4 deaths.\n\nIn her story on criticism’s of Mayor Bassduring this crisis, reporter Linh Tat addressed the budget question.\n\n“On Thursday, a spokesperson for L.A. City Councilmember Bob Blumenfield, who was budget chair last year, said the city increased the fire department’s overall budget by approximately $53 million in the current fiscal year. However, $76 million – intended to pay for fire department personnel – was placed in a fund separate from the fire department’s regular account when the budget was adopted because contract negotiations with department employees were still taking place at the time.”\n\nAs a result, if you just compare the LAFD’s budget last year to this year’s, it looks like it went down $23M. But that’s because when the budget was adopted last May or June, the city was still negotiating those new contracts. The $76M that was set aside in a separate account ultimately was moved once the MOUs were finalized.\n\nBut some news outlets and critics of L.A. Mayor Karen Bass suggested this week that there were cuts to areas of the fire department’s budget.\n\nLos Angeles Fire Chief Kristin Crowley lashed out at city leaders on Friday, Jan. 10, saying that budget cuts to her department hampered firefighters’ ability to respond to the deadly wildfires that have ravaged Southern California.\n\nHow money was allocated seems to be what is now called into question. While the budget increased to support salaries, LAFD Chief went onCNN to say the city had failed herand the department with cuts to certain areas, such as civilian personnel.\n\n“Let me be clear. The $17 million budget cut and elimination of our civilian positions like our mechanics did and has and will continue to severely impact our ability to repair our apparatus,” Crowley said on CNN, adding that more than 100 fire apparatuses are out of service.\n\n“Having these apparatus and the proper amount of mechanics would have helped,” she said on CNN.\n\nOn Friday, Crowley told a Fox 11 reporter that there were cuts to her department. “Yes, it was cut and it did impact our ability to provide service,” she said.\n\nIn social media posts this week,L.A. City Controller Kenneth Mejia jumped in, posting:\n\n“Seeing City officials in the press ignore the severe impacts of these budget cuts, especially the ones covering for their poor budget decisions to cut a majority of departments’ budgets & even AFTER Chief Crowley told them about the impacts these cuts have had, is DISGRACEFUL. …\n\n“Btw the money that they keep saying is being held for LAFD’s raises are in this ‘separate account’ HASN’T even been transferred to the LAFD’s operating budget as of this date! How do we know all this? Because we’re the City’s Accountant! We know the City’s budget and finances.\n\n“We didn’t want to get into the City’s budget and finances during these times, but to see City officials come out and ignore the Fire Chief’s warnings/impacts of the department’s budget cuts made us jump in.”",
        "source_3": "Los Angeles MayorKaren Bassfaced scorching criticism Wednesday as it was revealed she cut the city’s fire department budget by $17.6 million ahead ofthis week’s devastating fires— as she prioritized funds for its massive homeless population that largely went unspent, according to a report.\n\nThe cut was the second-largest in Bass’ 2024-25 fiscal budget, city figures show — and it wasn’t even the gutting she wanted.\n\nIf she’d had it her way, the LAFD budget would have been slashed by $23 million.\n\nLA budgeted $837 million for the Bravest in fiscal year 2023-2024 — which was shockingly 65% of the $1.3 billion slated for the homeless,according to Fox News.\n\nA city comptroller study found that nearly half of that funding went unused, according to the outlet.\n\nHer budget cuts resurfaced as the LAFD issued a rare plea asking off-duty firefighters to join the battle against three massive wildfires burning across the city, which were kicked up Tuesday by 100-mph Santa Ana winds and have proceeded to grow by the hour.\n\nAt least 70,000 peoplehave been ordered to evacuatefrom their homes as the fire has become the most destructive in the city’s history within just a day.\n\n“It’s all about leadership management, that we’re seeing a failure of, and all these residents are paying the ultimate price for that,” said Rick Caruso, an LA developer who lost the city’s 2022 mayoral race to Bass.\n\nThe fact that Bass was in Ghana when the flames broke out added further fuel to the backlash.\n\nAmid reportsthat LA fire hydrants have run dry as firefighters battle the flames, Caruso said Bass was directly to blame — and called her out for being literally absent as the city burned.\n\n“I think you should start asking … Why don’t you call the mayor, who is out of the country, and ask her? Get an answer from her,” he told Fox LA.\n\nAs the flames kicked up Tuesday and exploded overnight into Wednesday, Bass was 7,400 miles away in Ghana, where she was celebrating the inauguration of President John Dramani Mahama.\n\n“Los Angeles Mayor Karen Bass is on a taxpayer-funded trip to Africa as part of a Biden administration presidential delegation WHILE HER CITY IS BURNING TO THE GROUND,” wrote America First Works president Ashley Hayek on X.\n\nElon Musk, who has been serving as an adviser and confidant to President-elect Donald Trump, even chimed in and called Bass “utterly incompetent.”\n\nBass finally returned Wednesday to Los Angeles, where she met with California Gov. Gavin Newsom amid the torched rubble as flames still burned uncontained across the city.\n\nAs her plane touched down, Bass refused to respond when a Sky News reporter asked if she regretted cutting the fire department budget, traveling to Ghana, or whether she had any words of apology to the citizens of Los Angeles.\n\n“Madam Mayor, have you absolutely nothing to say to the citizens today who are dealing with this disaster?” reporter David Blevins, standing feet away, repeatedly asked Bass as she looked blankly ahead.\n\n“We have questions. I know where I am, but I don’t know where my mayor was when this was happening,” one furious resident who was forced to evacuate her home told Fox News.\n\n“I’m born and raised in Los Angeles, I spend my life worrying about when the earthquakes come, when the Santa Ana winds come. I plan my trips around this. For someone to be in charge of my town … where were you?” the woman asked.\n\nAt least five people have been killed and more than 1,000 buildings destroyed across the three fires.\n\nThe Pacific Palisades Fire, burning in the northwest corner of LA, is over 15,000 acres (23.4 square miles). The Eaton Fire, to the northeast, is over 10,000 acres (15.6 square miles) after starting the day at around 2,000. The Hurst Fire, north of the city, is around 500 acres."
    }
}