{
    "question": "How might a decision not to block the Jan. 19 TikTok ban shape the balance between national security concerns and protections for American users’ speech, and what precedents could it set for regulating foreign-owned social media platforms?",
    "content": {
        "source_1": "Jan. 19 is the deadline: After that, the app wouldn't vanish from your phone — but TikTok would become much harder to use\n\nWithin days, TikTok could be banned from being distributed in the United States and, eventually, stop working as an app altogether if the U.S. Supreme Court does not intervene toblock a bipartisan lawthat is set to take effect on Jan. 19.\n\nOn Friday, Jan. 10, the justices heard arguments on whether or not to step in and temporarily pause the measure given what TikTok claims isa violation of free speechfor its tens of millions of American users.\n\nAccording toABC News,CNNandThe New York Times, a majority of the justices appeared inclined to rule against TikTok and don’t seem to feel the law creates an unconstitutional block on speech since TikTok can simply be sold by its Chinese owners.\n\nTheTimesreports that a ruling is expected imminently, given the Jan. 19 deadline.\n\n“The law is only targeted at this foreign corporation, which doesn’t have First Amendment rights,” Justice Elena Kagan said at one point at Friday’s hearing.\n\nThelegislation, which overwhelmingly passed Congress and was signed by President Joe Biden last year, is designed to force the popular app’s Chinese owners, ByteDance, to sell it over fears China's government could use its data to manipulate or harm Americans.\n\nCountries like India have taken similar action against TikTok.\n\nChina has likewise banned several massive U.S. platforms, like Facebook, Google and YouTube.\n\nTikTok has pushed back,criticizing the sell-or-ban legislationas “conceived and pushed through based on inaccurate, flawed, and hypothetical information, resulting in outright censorship of the American people.”\n\n“The government just doesn’t get to say ‘national security’ and the case is over,” an attorney for some TikTok users, Jeffrey Fisher, told the Supreme Court on Friday. “It’s not enough to say ‘national security’ — you have to say, ‘What is the real harm?’ ”\n\nLower courtshave concludedthe federal government has a valid interest in thinking the Chinese app could create national security issues regarding China’s government.\n\nOn Friday, Solicitor General Elizabeth Prelogar, arguing on behalf of the government, said the solution was simple: TikTok could operate as normal — if only ByteDance would sell it.\n\n“TikTok, if it were able to do so, could use precisely the same algorithm to display the same content by the same users,” she said. “All the act is doing is trying to surgically remove the ability of a foreign adversary nation to get our data and to be able to exercise control over the platform.”\n\nJustice Amy Coney Barrett echoed that as well: “The law doesn't say 'shut down' [TikTok]. It says ByteDance must divest. If it did that, we wouldn't be here.\"\n\nMore broadly, said Justice Samuel Alito, \"If TikTok went dark, is there reason to doubt some other media company won't jump in?\"\n\nHowever, Justice Neil Gorsuch sounded more skeptical, noting that TikTok would accept a disclaimer about China and saying, “Don’t we normally assume that the best remedy for problematic speech is counter speech?”\n\nIncoming President Donald Trump has pushed for a pause to the new law as well, filing a brief about it before the high court urging that he be given time to “resolve the issues at hand through political means once he takes office.”\n\nNever miss a story — sign up forPEOPLE's free daily newsletterto stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\nIf TikTok is not sold by its owner, ByteDance — or be “divested” and then bought by a non-“foreign adversary,” in the language of the new law — then it will become illegal for internet services in the U.S. to support or distribute it.\n\nTikTok has called that a “total ban,” though in practice the app will not magically disappear from users’ phones on Jan. 19.\n\nInstead, the law would force the app to be removed from app stores (like through Apple or Google) and make it inaccessible through internet browsers in America.\n\nIf TikTok or other internet companies violated the law, they could face giant financial penalties.\n\nPeople who still have TikTok as an app on their phone could potentially access its content after Jan. 19, but the app would not be updated over time and would be expected to become more difficult to use.\n\n\"We go dark,\" TikTok attorney Noel Francisco told the justices on Friday, \"Essentially, the platform shuts down.\"\n\nNew users would not be able to access or download TikTok.\n\nHowever, the new law requires that TikTok provide users with their data, including content they posted, if they request it before the restrictions take effect on Jan. 19.",
        "source_2": "When Congresspassed the law that required TikTok’s parent company, ByteDance, to sell it or see it banned in the U.S., it was partially motivated by the fear that the Chinese government might use TikTok to contort Americans’ discourse, pitting people against one another and eroding their trust in the democratic systems that define American politics.\n\nOn Friday, at the oral argument that will determine TikTok’s fate, Chief Justice John Roberts made a joke underlining this risk: “Did I understand you to say, a few minutes ago, that one problem is that ByteDance might be, through TikTok, trying to get Americans to argue with each other?” He then answered his own question, spurring laughter from the crowd: “If they do, I’d say they’re winning!”\n\nForeign governments, including China’s, have long run influence operations to try to divide and propagandize American citizens, and haveused social media platforms to do so. (The U.S. government hasrun similar campaignsabroad, too.) But the TikTok law is the first attempt by the U.S. Congress to directly regulate a social media platform for the purpose of limiting those influence operations. This raises a key First Amendment question: Can the U.S. government, in trying to stop other governments from manipulating speech, itself manipulate speech by forcing the shutdown of a massively popular platform?\n\nThe whole idea of the U.S. government fighting foreign speech manipulation is “at war with the First Amendment,” argued Noel Francisco, counsel for ByteDance, on Friday. But the D.C. Circuit Court of Appeals disagreed with that argument last month, in a controversial ruling thatsaidsometimes, limitations on Americans’ speech are necessary to ensure a healthy free speech ecosystem. “[T]he Government acted solely to protect” Americans’ First Amendment freedoms, the D.C. circuit held — even as it upheld a law that might lead to the shutdown of a massive speech platform.\n\nToday, a small handful of tech companies hold immense power over the information that Americans consume. In the NetChoice Cases last term, the Supreme Courtheldthat American tech giants have a First Amendment right to curate that content — to promote some messages over other messages – as they wish. But foreign tech giants do not have that right, and in passing the TikTok law, Congress said that at least when those foreign companies are controlled by foreign adversaries, the same editorial control that is protected speech when done by an American company is a national security risk when done by a Chinese (or Russian or Iranian) one.\n\nThis tension leaves social media users with little transparency about why they see the messages they do, and which governments might have pressured them to promote or demote certain narratives. Just this week, Metaannounced staggering changesto its content policies in an effort to curry favor with the incoming Trump Administration. But because Meta is a domestic firm acting of its own accord, it was just exercising its free speech rights. (In a previous life I held content policy positions at Facebook and Spotify.)\n\nThe TikTok bill is not a direct ban: it gives ByteDance the choice to sell TikTok instead of seeing it banned. But ByteDance, at least thus far, has insisted that it will not sell TikTok; instead, it will leave the U.S. market altogether.\n\nJustice Amy Coney Barrett pressed this point during arguments, noting that TikTok will only be banned if ByteDance chooses a ban over a sale. But practically, ByteDance may not have much of a choice at all, because the Chinese government has said it is not allowed to sell TikTok, and flouting the Chinese government could endanger both ByteDance’s business and its employees’personal safety.\n\nSolicitor General Elizabeth Prelogar compared the case to a game of chicken between the Chinese and U.S. governments, and urged them not to let the U.S. blink first. Clearly, ByteDance does not want to sell TikTok, and it won’t do so unless it has no other option. Prelogar urged the justices to let the law go into effect on January 19, causing a temporary shutdown of TikTok in the U.S. There would be “nothing permanent or irrevocable” about such a ban, she said — it could be lifted as soon as a divestment is complete, and it might provide a “jolt” to ByteDance that would make it take seriously the possibility of a sale.\n\nIf the law does go into effect, TikTok will likely not only disappear from theapp stores, but will also stop working in the United States. That’s because the law would require all the U.S. companies that help keep TikTok online, fromcloud companieshosting TikTok’s data to content delivery networks and their providers, to stop doing so.\n\nThere are three ways the justices could stop the law from going into effect on January 19. They could rule for TikTok, and find that the law is unconstitutional, or they could issue one of two types of stays, temporarily stopping the law from going into effect while they deliberate on its fate. To grant the first type of stay, called a temporary restraining order, the court would need to find that ByteDance and TikTok are likely to eventually win their case. But the second type of stay, an administrative stay, would not require the court to take a position on the merits. Instead, it would just reflect the court’s decision that they need more time to consider the case.\n\nThe court is widely expected to rule on the case extremely quickly, before the January 19 deadline. If it upholds the law, TikTok will at least temporarily go offline — though President Trump couldtry to bring it backby issuing a one-time, three-month extension to give the company time to negotiate a sale.\n\nStill, if the law is upheld, a three-month extension will likely not make a significant difference in TikTok’s future. Unless the justices invalidate the law, ByteDance will have to sell TikTok, or the platform will disappear in the United States.",
        "source_3": "‘FOX News Sunday’ anchor Shannon Bream discusses the rise in antisemitism across the US and reacts to a recent poll showing more voters prefer Vice President Kamala Harris over President Biden.\n\nTheSupreme Courton Friday heard oral arguments in a fast-tracked case over the future of TikTok, a Chinese-owned social media app that will be barred from operating in the U.S. in just nine days barring divestiture or eleventh-hour intervention from the high court.\n\nAt issue is the Protecting Americans from Foreign Adversary Controlled Applications Act, a law signed by President Biden that passed Congress in April with bipartisan approval. The act gave TikTok either nine months to either divest from its Chinese parent company, ByteDance, or be removed from U.S.-based app stores and hosting services.\n\nOn Friday, lawyers for the Biden administration reiterated their argument that TikTok’s Chinese ownership poses a \"grave\" national security risk for American users.\n\nU.S. Solicitor General Elizabeth Prelogar cited risks that China could weaponize the app, including by manipulating its algorithm to prioritize certain content or by ordering parent company ByteDance to turn over vast amounts of user data compiled by TikTok on U.S. users.\n\n\"We know that the PRC has a voracious appetite to get its hands on as much information about Americans as possible, and that creates a potent weapon here,\" Prelogar said. \"Because the PRC could command ByteDance [to] comply with any request it gives to obtain that data.\"\n\n\"TikTok's immense data set would give the PRC a powerful tool for harassment, recruitment and espionage,\" she added.\n\n'HIGHLY QUALIFIED': FORMER STATE AGS URGE SENATE TO CONFIRM BONDI TO LEAD JUSTICE DEPARTMENT\n\nParticipants hold signs in support of TikTok outside the U.S. Capitol Building in Washington, D.C., on March 13, 2024, as lawmakers voted to pass a law that would require TikTok to divest from its Chinese parent company, ByteDance, within nine months.(Anna Moneymaker/Getty Images)\n\nEarlier in oral arguments when TikTok was presenting its case, justices on the bench as a whole appeared skeptical of the company's core argument, which is that the law is a restriction of speech.\n\n\"Exactly what is TikTok's speech here?\"Justice Clarence Thomasasked in the first moments of oral arguments in an early sign of the court's apparent doubt that the law is in fact a First Amendment violation.\n\nAt the conclusion of oral arguments, it remained unclear as to how the Supreme Court might proceed in the matter — though a ruling or order is expected before the Jan. 19 ban comes into force.\n\nThe Supreme Court and its 6-3 conservative majority have been historically deferential to Congress on matters of national security.\n\nThe divestiture law in question passed Congress last year with strong bipartisan support — as well as the guidance of top Justice Department officials, who worked directly with House lawmakers to write the bill and help it withstand possible legal challenges.\n\nBut the argument also comes at a time when President-elect Trump has signaled possible support for TikTok. His attorneys filed an amicus brief last month, urging the Supreme Court to delay the ban until he is sworn in as president.\n\nIf the goal of China and ByteDance, through TikTok, is \"trying to get Americans to argue with each other,\" said Chief Justice John Roberts, \"I’d say they are winning.\"\n\nNoel Francisco, TikTok’s lawyer, on Friday sought to frame the case primarily as a restriction on free speech protections under the First Amendment, which the company argues applies to TikTok’s U.S.-based incorporation.\n\nA TikTok logo is displayed on a smartphone in Suqian, Jiangsu province, China, on Thursday.(CFOTO/Sipa USA)\n\nFirst Amendment protectionsmust be considered under strict scrutiny, which requires the government to sustain a higher burden of proof in justifying a law's constitutionality. More specifically, the law must be crafted to serve a compelling government interest and be narrowly tailored to achieve that interest — a test TikTok says the law fails to meet.\n\nIt's a difficult legal test to satisfy in court. But the U.S. Court of Appeals for the District of Columbia Circuit used it last month in considering the divestiture law, and still voted to uphold it — meaning that justices could theoretically consider the case under strict scrutiny and still opt to uphold the law — and the looming Jan. 19 ban.\n\nJustice Sonia Sotomayor on Friday noted that the case before them appears to be the first one to be heard by the court centered directly on the ownership of a platform or app, rather than speech.\n\nThe liberal justice also questioned whether the court might consider the divestiture requirement under the law as a data control case, not properly a free-speech issue, as TikTok's legal team has sought to frame it.\n\nPresident-elect Trump's X account is seen displayed on a smartphone alongside the TikTok logo.(Avishek Das / SOPA Images/Sipa USA)\n\nWeighing the case as a data control case would trigger a lower level of scrutiny — a point that Francisco also acknowledged.\n\nFrancisco told justices in oral arguments on Friday that the U.S. government has \"no valid interest in preventing foreign propaganda,\" and that he believes the platform and its owners should be entitled to the highest level of free speech protections under the U.S. Constitution.\n\nFrancisco told Chief Justice John Roberts that he believes the court should grant TikTok First Amendment protections because it is operating as a U.S.-incorporated subsidiary.\n\nThe TikTok attorney was also grilled over the Chinese government’s control over the app, and ByteDance’s control over the algorithm that shows certain content to users.\n\nAsked by Justice Neil Gorsuch whether some parts of the recommendation engine are under Chinese control, Francisco said no.\n\n\"What it means is that there are lots of parts of the source code that are embodied in intellectual property, that are owned by the Chinese government\" and which a sale or divestiture would restrict, he said. \"It doesn't alter the fact that this is being operated in the United States by TikTok incorporated.\"\n\nTRUMP SAYS FATE OF TIKTOK SHOULD BE IN HIS HANDS WHEN HE RETURNS TO WHITE HOUSE\n\nThe U.S. Supreme Court building in Washington, D.C.(AP Photo/Mariam Zuhaib))\n\nUnless justices intervene, or TikTok’s owners agree to sell, the app will be barred from operating in the U.S. by Jan. 19.\n\nOral arguments center on the level of First Amendment protections that should be granted to TikTok and its foreign owner, ByteDance.\n\nThis is not the first time the Supreme Court has grappled with whether full First Amendment protections should be extended to foreign speakers. In previous cases, they have ruled that speech by a foreign government or individuals is not entitled to the full protections.\n\nThe Biden administration, for its part, will argue that the law focuses solely on the company’s control of the app, which attorneys for the administration argue could pose \"grave national security threats\" to Americans rather than its content.\n\nLawyers for the administration will also argue that Congressdid not impose any restrictions on speech, much less any restrictions based on viewpoint or on content, and therefore fails to satisfy the test of free speech violations under the First Amendment.\n\nThe court’s decision could have major ramifications for the roughly 170 million Americans who use the app.\n\nJustices agreed in December to hold the expedited hearing and will have just nine days to issue a ruling before the ban takes place on Jan. 19.\n\nBreanne Deppisch is a national politics reporter for Fox News Digital covering the Trump administration, with a focus on the Justice Department, FBI, and other national news.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}