{
    "question": "What are the implications of Zuckerberg’s Rogan interview claims about Biden administration pressure to remove COVID-19 content for how platforms and governments should interact during public health crises?",
    "content": {
        "source_1": "Photo illustration: Sarah Grillo/Axios. Photo: Josh Edelson/AFP via Getty Images\n\nMark Zuckerberg spent this weekreshaping Meta to be more MAGA-friendly, and capped it off Friday by calling for the \"repopulation\" of the \"cultural elite class\" onJoe Rogan's podcast.\n\nWhy it matters:Over the last few days, Metahas dropped internal DEI guidelinesandopened the floodgates for hate speech, racism, and conspiracy theories, but Zuckerberg's comments on Rogan tie him explicitly to right-wing talking points.\n\nThe big picture:Zuckerberg said that a \"new class of creators\" — social media users — should \"become the new kind of cultural elites.\"\n\nBetween the lines:Zuckerberg was vague on exactly what he was criticizing the media for, but elsewhere in the interview, he slammed journalists for reporting on Facebook's role in 2016 election interference.\n\nThe bottom line:Meta's decisions to loosen content moderation, change its speech guidelines, curb its DEI efforts, andappoint Trump friend Dana Whiteto its board of directors all point to a MAGA-forward future for the company.",
        "source_2": "Katherine Fung is a Newsweek senior reporter based in New York City. She has covered U.S. politics and culture extensively. Katherine joined Newsweek in 2020. She is a graduate of the University of Western Ontario and obtained her Master's degree from New York University. You can get in touch with Katherine by emailingk.fung@newsweek.com. Languages: English\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nMark Zuckerberg unloaded on PresidentJoe Bidenand his administration during a surprise appearance onJoe Rogan's podcast that was published Friday.\n\nZuckerberg attacked the White House over the way senior officials pressuredMetato moderate content on its social media networks, part of a scathing interview just 10 days before Biden is set to leave office.\n\nNewsweekreached out to the White House via email for comment.\n\nSince President-electDonald Trump's 2024 victory, Zuckerberg has been in the process of a personal and professional reconciliation with Trump (the Meta chief had dinner with Trump at Mar-a-Lago in November), and MAGA priorities.\n\nIn the last week alone, Meta pledged a $1 million donation to Trump's upcoming inauguration, killed its fact-checking program, loosened speech restrictions on how users talk about social issues, gutted its major diversity, equity and inclusion (DEI) programs and added UFC president and CEO Dana White—a top Trump ally—to its board.\n\nZuckerberg's recent moves are a strong signal to both his employees and the nation about the future of Meta and the relationship he hopes the social network will build with the incoming Trump administration.\n\nDuring his appearance on Rogan's show, the tech executive said that his industry is a \"bright spot for the American economy\" and expressed optimism that Trump would highlight America's strategic advantage in the field.\n\nZuckerberg also spent a chunk of the interview airing his grievances with President Biden and members of his administration, whom he claimed \"would call up our team and scream at them and curse\" over COVID-related posts they wanted Meta to take down.\n\nHe recalled running the company during the pandemic, saying that he gave deference to the government and public health authorities in the early days of the health crisis because he was \"sympathetic\" to concerns about misinformation at the time.\n\n\"I deferred too much to the kind of critique of the media on what we should do,\" he said.\n\nBut Zuckerberg said that as guidance changed, it became difficult to follow what was and was not accurate — something many Americans can recall feeling in those days.\n\nThings reached a head during the Biden administration's vaccine rollout, according to the Meta chief, who said while he agreed that the vaccines had more positive than negatives, the Biden administration \"also tried to censor anyone who is basically arguing against it.\" He said while he was not directly involved in those conversations, the administration began pressuring Meta \"super hard\" to take certain posts down.\n\nHe also slammed Biden for asserting that social media companies were directly \"killing people\" by allowing COVID misinformation to spread. Biden later walked back those remarks. But it was too late, in Zuckerberg's telling. Shortly after the president made that comment, different government agencies started coming after the tech company with \"brutal\" investigations, Meta's chief said.\n\nZuckerberg also revealed there was one particular meme that the Biden administration wanted Meta to censor.\n\n\"They want us to take down this meme of Leonardo DiCaprio looking at a TV, talking about how 10 years from now or something, you're gonna see an ad that says, 'Okay, if you took a Covid vaccine, you are eligible for this kind of payment.' So, this sort of like class action lawsuit type meme,\" Zuckerberg told Rogan. \"[The Biden administration was] like, 'No, you have to take that down.' And we just said, 'No, we're not gonna take down humor and satire.'\"\n\nZuckerberg told Rogan: \"They pushed us super hard to take down things that were honestly, were true, right? I mean they basically pushed us and to, and said, 'You know, anything that says that vaccines might have side effects, you basically need to take down.' And I was just like, 'Well, we're not gonna do that. Like, we're clearly not gonna do that.'\"\n\nPresident Biden clarified his \"killing people\" remarks in July 2021 to reporters: \"Facebookisn't killing people – these 12 people are out there giving misinformation. Anyone listening to it is getting hurt by it. It's killing people. It's bad information.\"\n\nPresident-elect Trump told Fox News Digital on Tuesday: \"Honestly, I think they've come a long way — Meta, Facebook, I think they've come a long way.\"\n\nMike Issac, a tech reporter for theNew York Times, wrote in a post on X, formerly Twitter: \"the Rogan interview with Zuckerberg that dropped this morning is something to behold. basically him dumping years of anger at the media, the government, social discussion. clearly all pent up for years and now allowing himself to do it because of Trump coming to power.\"\n\nwhat i anticipate will happen is Zuckerberg going all out with his views will give license to a greater number of CEOs and executives who have been too nervous to talk openly about how they feel (and hew far more to conservatism than they let on in corporate memos)\n\nMeta's policies are effective immediately. All of them can be readhere.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nKatherine Fung is a Newsweek senior reporter based in New York City. She has covered U.S. politics and culture extensively. Katherine joined Newsweek in 2020. She is a graduate of the University of Western Ontario and obtained her Master's degree from New York University. You can get in touch with Katherine by emailingk.fung@newsweek.com. Languages: English\n\nKatherine Fung is a Newsweek senior reporter based in New York City. She has covered U.S. politics and culture extensively. Katherine joined Newsweek in 2020. She is a graduate of the University of Western Ontario and obtained her Master's degree from New York University. You can get in touch with Katherine by emailingk.fung@newsweek.com. Languages: English\n\nKatherine Fung is a Newsweek senior reporter based in New York City. She has covered U.S. politics and culture extensively.                                    ...Read more",
        "source_3": "Meta boss Mark Zuckerberg slammed the Biden Administration for censorship, took shots at one of his biggest tech rivals and said he’s “optimistic” about President-elect Donald Trump during a wide-ranging interview with popular podcaster Joe Rogan.\n\nWearing a brown T-shirt and gold-chain, the suddenly conservative-sounding tech tycoon spent the first hour of the nearly three-hour sit-down discussing the strong-arm tactics Team Biden used to silence those who cast doubt on the COVID vaccine – a topic dear to Rogan’s heart.\n\nBiden officials phoned executives at Meta to “scream” and “curse” at them while demanding that they remove any negative posts about the coronavirus vaccine on Facebook, said Zuckerberg, rehashing the the admission he made in front of Congress over the summer.\n\n“It was brutal,” Zuckerberg said during the interview on the “Joe Rogan Experience,” released Friday.\n\n“The US government should be defending its companies, not be at the tip of the spear attacking its companies,”\n\nWhen Rogan – who sparked controversy by questioning the efficacy of the vaccines — asked whether those phone calls were recorded, Zuckerberg responded that he didn’t think so.\n\nZuckerberg said Biden’s aides wanted Meta to remove posts that correctly stated that the vaccines could induce side effects.\n\n“Basically it just got to this point [where we told them], ‘No, we’re not going to take down this thing that was true,’” Zuckerberg said.\n\nHe then went on to lavish a bit of praise on Trump.\n\n“I think he just wants America to win,” Zuckerberg said.The interview with Rogan capped a series of recent head-turning incidents. Last month, the Facebook founder met with President-elect Donald Trump at his Mar-a-Lago resort in Florida.He also drew criticism from left-leaning circles for adding UFC boss Dana White, a prominent Trump ally, to Meta’s board of directors, as well as ending Meta’s fact-checking program and killing DEI initiatives at the company.Zuckerberg – who also spent a good chunk of the interview with Rogan discussing their mutual love for jiu-juitsu – did take several swipes at Apple.\n\nHe said the iPhone maker hasn’t “really invented anything great in a while.”\n\nZuckerberg slammed Apple’s practice of charging a 30% fee on transactions within its App Store – a frequent point of criticism for Apple’s competitors and regulators alike.\n\n“The number of sales, I think, has generally been flat to declining. So how are they making more money as a company?” Zuckerberg said. “They do it by basically squeezing people and having this 30% tax on developers.”\n\nHe also took issue with Apple’s practice of having texts sent from non-iPhones appear as “green bubbles” in group messages.\n\n“They’re like, if you don’t have a blue bubble, you’re not cool, and you’re like the out crowd, and then they always wrap it in like security,” Zuckerberg said.\n\nAs for White, Zuckerberg told Rogan that he thought the UFC boss was “awesome” and an “amazing entrepreneur” who turned mixed martial arts from an afterthought into a mainstream sport.“He’s a world-class entrepreneur and he’s got a strong backbone,” Zuckerberg said. “The conversation I had with him around joining our board was, ‘we have a lot of governments and folks around the world putting a lot of pressure on our company. We need strong people who are gonna basically advise us on how to handle some of these situations.’”"
    }
}