{
    "question": "How might President Trump’s directive to pursue a new census excluding unauthorized immigrants, potentially using 2024 election data, affect congressional apportionment, redistricting plans, and federal funding, and what legal and logistical obstacles would shape its outcome?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nA briefcase of a census taker is seen as she knocks on the door of a residence, Aug. 11, 2020, in Winter Park, Fla. (AP Photo/John Raoux, File)\n\nWASHINGTON (AP) — President Donald Trump has instructed the Commerce Department to change the waythe U.S. Census Bureaucollects data, seeking to exclude immigrants who are in the United States illegally, he said Thursday.\n\nThe census’ data collections will be based on “modern day facts and figures and, importantly, using the results and information gained from the Presidential Election of 2024,” the Republican president said on his social media platform, an indication he might try to inject his politics into a head count that determines political power and how federal funding is distributed.\n\nTrump stressed that as part of the changes people in “our Country illegally” will be excluded from census counts.\n\nExperts said it was unclear what exactly Trump was calling for, whether it was changes to the2030 censusor a mid-decade census, and, if so, whether it would be used for a mid-decade apportionment, which is the process of divvying up congressional seats among the states based on the population count.\n\nAny changes in the conduct of a national census, which is the biggest non-military undertaking by the federal government, would require alterations to the Census Act and approval from Congress, which has oversight responsibilities, and there likely would be a fierce fight. While the Census Act permits a mid-decade census for things like distributing federal funding, it can’t be used for apportionment or redistricting and must be done in a year ending in 5, said Terri Ann Lowenthal, a former congressional staffer who consults on census issues.\n\n“He cannot unilaterally order a new census. The census is governed by law, not to mention the Constitution,” Lowenthal said. “Logistically, it’s a half-baked idea.”\n\nIt would be almost logistically impossible to carry out a mid-decade census in such a short period of time, New York Law School professor Jeffrey Wice said.\n\n“This isn’t something that you can do overnight,” said Wice, a census and redistricting expert. “To get all the pieces put together, it would be such a tremendous challenge, if not impossible.”\n\nTrump’s Truth Social post fits into an overall pattern in which he has tried to reshape basic measures of how U.S. society is faring to his liking, a process that ranges from monthly jobs figures tohow congressional districts are drawngoing into the 2026 midterm elections. But there could be legal challenges if he were to reshape the census, which also guides the distribution of $2.8 trillion in federal funds to the states for roads, health care and other programs.\n\nIn a 2019 decision, the Supreme Court effectively blocked Trump from addinga citizenship questiontothe 2020 census. The 14th Amendment says that “the whole number of persons in each state” should be counted for the numbers used for apportionment, the process of allocating congressional seats and Electoral College votes among the states based on population.\n\nPresident Donald Trump speaks in the Oval Office, Aug. 6, 2025, in Washington. (AP Photo/Alex Brandon)\n\nThe last time the census included a question about citizenship was in 1950, and the Census Bureau’s own experts had predicted that millions of Hispanics and immigrants would go uncounted if the census asked everyone if he or she is an American citizen.\n\nChanges to the census could also play into the efforts by Trump to urge several Republican-led states, including Texas, toredraw their congressional mapsahead of schedule in ways that would favor GOP candidates.\n\nRedistricting typically occurs once every 10 years following the census, as states adjust district boundaries based on population changes, often gaining or losing seats in the process.\n\nDespite Texas having redrawn its maps just a few years ago, Trump is pressuring Republicans in the state to redistrict again, claiming they are “entitled” to five additional Republican seats. Texas Republicans have cited population growth as justification for redrawing the congressional map. The state currently has 38 House seats, 25 held by Republicans.\n\nTrump’s team is also engaged in similar redistricting discussions in other GOP-controlled states, including Missouri and Indiana.\n\nLast Friday, Trumpfired the head of the Bureau of Labor Statistics,Erika McEntarfer, after standard revisions to the monthly jobs report showed that employers added 258,000 fewer jobs than previously reported in May and June. The revisions suggested that hiring has severely weakened under Trump, undermining his claims of an economic boom.\n\nThe White House insists that the problem was the size of the revisions and that it wants accurate numbers. But outside experts disagreed with that assessment.\n\n“Trump is basically destroying the federal statistical system,” said Margo Anderson, a professor emerita at the University of Wisconsin-Milwaukee who has written extensively on the history of the census. “He wants numbers that support his political accomplishments, such as he sees them.”\n\nAfter the citizenship question was stopped by the Supreme Court in 2019, Trump madeanother effortin 2020, announcing a plan to exclude people living in the country illegally from the apportionment figures.\n\nAfter states, cities and organizations sued, lower courts ruled the plan was illegal. By the time the Supreme Court weighed in, Trump had lost his reelection bid. The justices sidestepped a decision on the legality of Trump’s plan, throwing out the case on technical procedural grounds. The court said in an unsigned opinion that spoke only for the six-justice conservative majority that “we express no view on the merits of the constitutional and related statutory claims presented. We hold only that they are not suitable for adjudication at this time.”\n\nThe three liberal justices dissented, saying the effort to exclude people in the country from the population for divvying up House seats is unlawful.\n\n“I believe this Court should say so,” Justice Stephen Breyer wrote, joined by Justices Elena Kagan and Sonia Sotomayor.\n\nAP writer Mark Sherman in Washington contributed to this report. Schneider reported from Orlando, Fla.\n\nFollow the AP’s coverage of the U.S. Census Bureau athttps://apnews.com/hub/us-census-bureau.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Amanda M. Castro is a Newsweek Live Blog Editor based in New York. Her focus is reporting on U.S. politics, breaking news, consumer topics, and entertainment. She specializes in delivering in-depth news and live blog reporting and has experience covering U.S. presidential debates, awards shows, and more. Amanda joined Newsweek in 2024 from the The U.S. Sun and is a graduate of the University of New Haven.\n\nYou can get in touch with Amanda by emailing a.castro@newsweek.com.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nPresidentDonald Trumpsaid Thursday he has directed the Department of Commerce to begin work on a new census that excludes undocumented immigrants, citing data from the 2024 presidential election as a basis for the overhaul.\n\nTrump's directive for a new census that excludes undocumented immigrants from the count threatens toreshape how congressional representation is allocatedacross the United States. If implemented, it would mark a significant departure from long-standing census practice, potentially shifting political power, especially in states with large immigrant populations.\n\nLegal, logistical, and constitutional questions surround the move, with historical precedent and recent court decisions casting uncertainty on its ultimate fate. The development comes as several states,led by Texas, consider early or mid-decade redistricting based on changing population data.\n\nTrump's directive cited the 2024 presidential election data as providing the impetus for anoverhaul of current census methodologies.\n\nRedistricting in the United States traditionally follows the decennial census, where the U.S. Census Bureau counts every person residing in the country, regardless of immigration status. This count is then used to determine how the 435 House seats are distributed among the 50 states, a process called reapportionment.\n\nIn Texas,Republicanshave supported a plan, backed by Trump, that relies on new census data to propose redistricting before the end of the current decade. This plan would reportedly deliver five additionalRepublicanseats inCongress, significantly affecting theDemocratic Party's ability to reclaim a majority in the House.\n\nThe proposal echoes Trump's prior attempt in 2020 to exclude undocumented immigrants from census counts used for apportionment. This effort was blocked in the courts and sidestepped by theSupreme Court, which declared the case premature due to unresolved facts and implementation challenges.\n\nPresident Donald Trump in a Truth Social post on Thursday morning:\"I have instructed our Department of Commerce to immediately begin work on a new and highly accurate CENSUS based on modern day facts and figures and, importantly, using the results and information gained from the Presidential Election of 2024. People who are in our Country illegally WILL NOT BE COUNTED IN THE CENSUS. Thank you for your attention to this matter!\"\n\nFlorida Governor Ron DeSantis, at a press conference on August 1, regarding undocumented immigrants:\"I think it's wrong. I think it's unconstitutional that they're counted in the census.\"\n\nNew York Law School Adjunct Professor and Senior Fellow Jeffrey Wice told Fox13:\"The Congress debated whether or not to count citizens only, and the decision was made back in the 1860s that the reapportionment was to be based on the whole number of persons, regardless of their status.\"\n\nDepartment of Commerce spokesperson toNewsweek:\"The Census Bureau will immediately adopt modern technology tools for use in the Census to better understand our robust Census data. We will accurately analyze the data to reflect the number of legal residents in the United States.\"\n\nThe fate of Trump's order depends on multiple factors: legal challenges, administrative capacity, and the positions of state and federal courts.\n\nThe Supreme Court previously hesitated to endorse similar measures, and lower courts have ruled such exclusions unconstitutional or illegal under federal law. If the administration attempts to move forward, renewed litigation is likely.\n\nUpdate 8/7/25, 9:10 a.m. ET: This article was updated with additional information.\n\nUpdate 8/8/25, 8:05 a.m. ET: This article was updated to include comment from DOC.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nAmanda M. Castro is a Newsweek Live Blog Editor based in New York. Her focus is reporting on U.S. politics, breaking news, consumer topics, and entertainment. She specializes in delivering in-depth news and live blog reporting and has experience covering U.S. presidential debates, awards shows, and more. Amanda joined Newsweek in 2024 from the The U.S. Sun and is a graduate of the University of New Haven.\n\nYou can get in touch with Amanda by emailing a.castro@newsweek.com.\n\nAmanda M. Castro is a Newsweek Live Blog Editor based in New York. Her focus is reporting on U.S. politics, breaking news, consumer topics, and entertainment. She specializes in delivering in-depth news and live blog reporting and has experience covering U.S. presidential debates, awards shows, and more. Amanda joined Newsweek in 2024 from the The U.S. Sun and is a graduate of the University of New Haven.\n\nYou can get in touch with Amanda by emailing a.castro@newsweek.com.\n\nAmanda M. Castro is a Newsweek Live Blog Editor based in New York. Her focus is reporting on U.S. politics,                                    ...Read more",
        "source_3": "Fox News Flash top headlines are here. Check out what's clicking on Foxnews.com.\n\nPresidentDonald Trumpdeclared in a Thursday morning Truth Social post that he has directed the Commerce Department to start working on a new census, noting that illegal aliens in the U.S. will not be included in the population count.\n\n\"I have instructed our Department of Commerce to immediately begin work on a new and highly accurate CENSUS based on modern day facts and figures and, importantly, using the results and information gained from the Presidential Election of 2024,\" the president said in thepost.\n\n\"People who are in our Country illegally WILL NOT BE COUNTED IN THE CENSUS. Thank you for your attention to this matter!\" he added.\n\nThe U.S. conducts a census every decade — the last decennial census was conducted in 2020 and another is scheduled for 2030.\n\nILLEGAL IMMIGRANTS POTENTIALLY COUNTED IN US CENSUS TAKE CENTER STAGE IN REDISTRICTING BATTLE\n\nPresident Donald Trump in the Oval Office of the White House in Washington, D.C., on Wednesday, Aug. 6, 2025(Bonnie Cash/UPI/Bloomberg via Getty Images)\n\nThe decennial census is key to determining the balance of political power each state holds, because the population counts are used in apportionment, the determination of how many seats each state gets in theHouse of Representatives.\n\nMUSK CALLS OUT UNFAIR BLUE STATE ADVANTAGE GAINED FROM ILLEGAL IMMIGRATION\n\nClose-up of human hand holding a letter from the Census Bureau regarding the 2020 Census, San Ramon, Calif., April 24, 2020.(Smith Collection/Gado/Getty Images)\n\nConsequently, the count also ultimately determines how manyelectoral voteseach state gets for presidential elections, since a state's electoral vote count equals the number of House and Senate seats in each state.\n\nThe 14th Amendment to the U.S. Constitution reads in part, \"Representatives shall be apportioned among the several States according to their respective numbers, counting the whole number of persons in each State, excluding Indians not taxed.\"\n\nThe U.S. Census Bureau, which falls under the Department of Commerce, indicates that \"unauthorized immigrants\" are counted in the resident population figures, noting on a frequently asked questionsweb pagethat \"all people (citizens and noncitizens) with a usual residence in the United States are included in the resident population for the census.\"\n\nSUPREME COURT DISMISSES CASE ON EXCLUDING ILLEGAL IMMIGRANTS FROM CENSUS COUNT AS ‘RIDDLED' WITH ‘SPECULATION’\n\nA U.S. Department of Commerce sign is displayed at the Herbert C. Hoover Federal Building on June 9, 2025, in Washington, D.C.(Kevin Carter/Getty Images)\n\nDuring his first term in office, Trump issued anmemorandumin 2020 declaring that he \"determined that respect for the law and protection of the integrity of the democratic process warrant the exclusion of illegal aliens from the apportionment base, to the extent feasible and to the maximum extent of the President’s discretion under the law.\"\n\nPresident Joe Biden issued anexecutive orderin 2021 which revoked Trump's memorandum, but Trumprevoked Biden's orderthis year.\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox"
    }
}