{
    "question": "How might Coca-Cola’s plan to introduce a cane sugar Coke in the U.S., announced after President Trump’s request, shape public health messaging, consumer choices, and the company’s brand?",
    "content": {
        "source_1": "Coca-Colaannouncedplans on Tuesday to distribute in the United States a version of its signature soft drink with cane sugar, a move that comes afterDiet Coke-lovingPresidentDonald Trumptook credit last week for pressuring the company to switch.\n\nTrump’s administration would have you believe this change is some sort of pro-health coup. When, for example, fast-food company Steak n’ Shake announced plans to distribute Coke with cane sugar last weekend, Health and Human Services Secretary Robert F. Kennedy Jr. claimed, “MAHA is winning,” referring to the so-called Make America Healthy Again movement.\n\nAsThe Washington Post points out, Kennedy told a radio show in 2023, “High-fructose corn syrup. That is poison. … Clearly it is linked to the obesity epidemic. It’s linked to the diabetes epidemic.” He went on to tout so-called Mexican Coke “because they don’t have it in it.”\n\nTrump himself claimed Coke with cane sugar is“just better” when he made his announcement last week.In terms of taste, perhaps.\n\nFor its part,Coca-Cola’s announcement— that it will offer Coke with cane sugarin additionto Coke with corn syrup — wasn’t really pitched by the company itself as a decision motivated by health reasons. Which was smart, because as to whether cane sugar–sweetened Coca-Cola is markedlyhealthierthan regular Coke, sweetened with high-fructose corn syrup, an NBC Newsreportanswered in the negative:\n\nWhen it comes to potential health impacts, the answer is no, said Dr. Dariush Mozaffarian, a cardiologist and director of the Food is Medicine Institute at the Friedman School of Nutrition Science and Policy at Tufts University. ‘Both high-fructose corn syrup and cane sugar are about 50% fructose, 50% glucose, and have identical metabolic effects,’ he said. That is, both can equally raise the risk for obesity, diabetes, and high triglycerides and blood pressure. Both provide the same number of calories, but the body processes them differently.\n\nAnother expert told NBC News that the change could produce some benefits on a very broad basis but also noted that neither cane sugar nor corn syrup is especiallyhealthy:\n\nDr. Melanie Jay, a professor of medicine and population health at the NYU Grossman School of Medicine and director of the NYU Langone Comprehensive Program on Obesity Research, said it’s possible that switching from corn syrup to cane sugar may be beneficial on a population level. ‘A 5% difference might mean that millions of people are getting less fructose,’ she said. ‘But it’s not like table sugar is a health food. Added sugar in whatever form should be limited.’\n\nIt’s a point MSNBC contributor Brian Tyler Cohen also made after Kennedy’s Steak n’ Shake endorsement.\n\n“I was a personal trainer for almost a decade. Honest to God, the number one thing I would tell my weight loss clients was to eliminate soda and fast food from their diets,” Cohen said “Here, the ‘MAHA’ Secretary of HHS is cheering on soda... at a fast food restaurant. Snake oil salesman.”\n\nIn contrast to the other decisions Trump’s administration has made that stand to harm public health — likeundermining efforts to stop the spread of “forever chemicals”linked to cancer and heart disease,overseeing steep cuts to federal food safety programsandrolling back federal air pollution standardsthat prevent the spread of mercury and arsenic — the Trump administration’s spin on the Coca-Cola news seems more like public health theater than a truly beneficial change.\n\nJa’han Jones is an MSNBC opinion blogger. He previously wrote The ReidOut Blog. He is a futurist and multimedia producer focused on culture and politics. His previous projects include “Black Hair Defined” and the “Black Obituary Project.”",
        "source_2": "Coca-Cola is launching a cane-sugar soda this fall in the U.S., the beverage company announced in its second quarter earnings Tuesday.\n\nThe company’s new product announcement comes nearly a week after President Donald Trump took to Truth Social Wednesday to declare thatCoca-Cola had agreedto switch from high-fructose corn syrup to real cane sugar in its U.S. beverages.\n\nThe postsaid, “I have been speaking to Coca-Cola about using REAL Cane Sugar in Coke in the United States, and they have agreed to do so. I’d like to thank all of those in authority at Coca-Cola. This will be a very good move by them — You’ll see. It’s just better!”\n\nAt the time, Coca-Cola didn’t immediately confirm the president’s remarks. Instead, it said, “We appreciate President Trump’s enthusiasm for our iconic Coca-Cola brand. More details on new innovative offerings… will be shared soon.”\n\nThe beverage company said ina press releaseon its earnings report that its new cane-sugar product will “expand its Trademark Coca-Cola product range” and is intended to “offer more choices across occasions and preferences.”\n\nTrump's comment comes amid a push by the administration to pressure food and beverage companies into cleaner ingredient lists. Health and Human Services Secretary Robert F. Kennedy Jr. has publicly criticized HFCS as “a formula for making you obese and diabetic,” and has urged food makers to remove what he calls “the worst ingredients” from their products; however, nutritional experts generally agree sugar offers no significant health advantages over HFCS.\n\nPepsiCo, Coca-Cola’s main competitor, alsoreportedThursday its investment into healthier options.\n\nCoca-Cola beat some of Wall Street's expectations during its second quarter earnings posted before the bell Tuesday. The soda companyreportedan earnings per share of $0.87 with a revenue of $12.5 billion.\n\nZacks Equity Researchestimated Coca-Cola would report a decline in its earnings, with an earnings per share of $0.83 on a $12.59 billion revenue. The soda company exceeded analysts EPS expectations but fell below revenue projections.\n\nCoca-Cola updated its full year guidance in its earnings report, stating it now expects an earnings per share growth of about 3%.\n\nAfter the company’s earnings report was released, its stock fell 0.8% to $69.54 pre-market,Barrons reported. The company’s stock opened at $69.45 after closing Monday at $70.07, according toMarketWatch.\n\nAlthough the company beat analysts’ EPS estimates, Coca-Cola reported a decline in its unit case volume globally and failed to surpass revenue projections. This decline showed in Tuesday’s premarket movement as investors were hesitant to push the stock up and instead let it fall nearly 1%.\n\nThe beverage producer reported a 1% decline in global unit case volume, due to declining growth in Mexico, India, and Thailand offsetting positive growth in Central Asia, Argentina, and China.\n\nThe company’s North American unit case volume dropped 1%, due to a decline in Coca-Cola.\n\nUnit case volume grew in Europe, the Middle East, and Africa by 3%, while it dropped 2% in Latin America and 3% in Asia Pacific.\n\nSparkling soft drinks dipped 1% while the company’s trademark beverage Coca-Cola declined 1%. However, Coca-Cola Zero Sugar grew 14% from growth “across all geographic operating segments,” the report said.\n\nJuice, value-added dairy and plant-based drink options dropped 4%.\n\nCoca-Cola owns Dasani, Coca-Cola, Fairlife, Fanta, Powerade, Minute Maid, Sprite, and more.",
        "source_3": "Coca-Cola will swap corn syrup for cane sugar in its U.S. products after President Donald Trump urged the company to make the change, he claimed in a Truth Social post Wednesday.\n\n“I have been speaking to Coca-Cola about using REAL Cane Sugar in Coke in the United States, and they have agreed to do so,” Trump wrote. “This will be a very good move by them — You’ll see. It’s just better!”\n\nCoca-Cola released an ambiguousstatementshortly after Trump’s post.\n\n“We appreciate President Trump’s enthusiasm for our iconic Coca‑Cola brand. More details on new innovative offerings within our Coca‑Cola product range will be shared soon,” the company wrote\n\nHealth and Human Services (HHS) SecretaryRobert F. Kennedy Jrapplauded the supposed move in a Thursday morning X post.\n\nKennedyhas long criticized high-fructose corn syrup,notingit’s a “key ingredient in highly processed foods” and a “contributor to childhood obesity.”\n\nCoca-Cola, for its part, has repeatedly defended the use of high-fructose corn syrup.(RELATED: Big Soda Floods State Capitol In Unprecedented Fashion To Lobby Against MAHA)\n\n“The name sounds complex, but high fructose corn syrup (HFCS) – which we use to sweeten some of our beverages – is actually just a sweetener made from corn,” the company tweeted Wednesday. “It’s safe; it has about the same number of calories per serving as table sugar and is metabolized in a similar way by your body.”\n\nThe name sounds complex, but high fructose corn syrup (HFCS) – which we use to sweeten some of our beverages – is actually just a sweetener made from corn. It’s safe; it has about the same number of calories per serving as table sugar and is metabolized in a similar way by your…\n\nCoca-Cola’s use of corn syrup in its U.S. products makes it a global outlier. In most major markets — including Brazil, Canada and much of the European Union — Coca-Cola is sweetened with cane sugar instead.\n\nMost European Union countries havebannedthe cultivation of genetically modified crops. While Coca-Colamaintainsnone of its products containGMOs, the vast majority of high-fructose corn syrup in the U.S. is made from genetically modified corn,accordingto the Alliance For Science.\n\nCoca-Cola did not immediately respond to the Daily Caller’s request for publication."
    }
}