{
    "question": "How might the Florida grand jury’s decision to issue no criminal indictments while criticizing transparency and broad vaccine promotion influence public trust and guide future state and federal vaccine policy?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nFlorida Gov. Ron DeSantis gestures during a news conference, Wednesday, Sept. 25, 2024, at the Tampa Electric Company offices in Tampa, Fla. (AP Photo/Chris O’Meara, File)\n\nTALLAHASSEE, Fla. (AP) — Astatewide grand juryconvened at the request of Florida Gov. Ron DeSantis to investigate “any and all wrongdoing” concerningCOVID-19vaccines did not find any evidence of criminal activity, according to a report unsealed on Tuesday.\n\n“(N)ot finding any indictable criminal activity does not mean we did not find any problems. On the contrary, there are profound and serious issues involving the process of vaccine development and safety surveillance in the United States,” the grand jury wrote in its final report.\n\nIn response to its findings, the grand jury made policy recommendations in its report, including increasing transparency around clinical trials and banning advertisements for pharmaceutical drugs.\n\nThe Centers for Disease Control and Prevention maintains thatCOVID-19 vaccinesunderwent intensive safety analyses and that the shots continue to be monitored after FDA approval to ensure they still meet federal safety and efficacy standards.\n\nWhile the vaccines aren’t perfect, they do a good job ofpreventing severe disease,hospitalization and death, and have proven very safe, with only rare seriousside effects, according tofederal officialsand public health experts.\n\nDeSantissought the investigationin 2022, ahead of his bid for the Republican Party’s presidential nomination and as he was bolstering his national profile through hard-line opposition to pandemic lockdowns and mask mandates.\n\n▶ Stay up to date with the latest U.S. news by signing up to our WhatsApp channel.\n\nAt the time, DeSantis said the probe would “bring legal accountability to those who committed misconduct” and could help get more information from pharmaceutical companies about the vaccines and potential side effects.\n\nA spokesperson for the governor did not immediately respond on Tuesday to a request for comment from The Associated Press.\n\nStatewide grand juries, usually comprised of 18 people, can investigate criminal activity and issue indictments but also examine systemic problems in Florida and make recommendations. In recent years, other panels have tackled immigration issues and school safety.\n\n___ Kate Payne is a corps member for The Associated Press/Report for America Statehouse News Initiative.Report for Americais a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Directed to investigate possible wrongdoing related to COVID-19 vaccines, a statewide grand juryreleased a reportTuesday that found “deceptive and obfuscatory behavior” that “straddled the line between ethical and unethical conduct.”\n\nWhile it didn’t find criminal activity, the grand jury recommended a series of changes at the state and federal levels.\n\n“While a few of our recommendations are specific to the COVID-19 pandemic andCOVID-19 mRNA vaccines, we also believe that our other recommendations could serve as a basis for substantive public policy changes that would be in the best interests of the American people, who rely upon the quality and safety of our regulatory system for all pharmaceutical products,” the report said.\n\nFor example, at the state level, the report questioned a time limit forstatewide grand juries, which, with a six-month extension, can run for 18 months, and called for putting criminal sanctions in law for not complying with statewide grand-jury subpoenas. The report said multinational corporations that were part of the COVID-19 investigation were headquartered outside of Florida.\n\n“If those subpoena recipients had chosen to raise legal challenges to our subpoenas, it might have taken many months to shepherd those challenges through the trial and appellate courts before we could even begin receiving documents,” the report states. “This did not come to pass, but there is no reason to expect that will be the case in future statewide grand juries.”\n\nMore:A look back: Key moments from the first months of COVID-19\n\nThe report also called for Florida to enact “more widespread monitoring of wastewater for pathogens.”\n\n“During the pandemic, states were able to glean valuable insight regarding the geographic spread of SARS-CoV-2 (the virus that causes COVID-19) by monitoring viral load in samples gathered from wastewater treatment facilities,” the report said.\n\nAt the federal level, for example, the report called for new clinical trials of the vaccines and regulations against a \"revolving door\" in which employees move between the U.S. Food and Drug Administration, the Centers for Disease Control and Prevention, the National Institutes of Health and the private sector.\n\n“We understand that prior experience in the regulatory arm of a particular industry can be an attractive quality in a potential job candidate, just as private sector experience can help a regulator interface with these private actors,” the report said.\n\n“This phenomenon has clearly produced a ‘fellow traveler’ attitude between the pharmaceutical companies and the agencies designed to regulate them. The boats of the regulators and the regulated are not supposed to be rowing in the same direction.”\n\nThe grand jury did not pursue criminal charges, in part, because it did not uncover activities involving vaccine makers and distributors that were not approved by federal regulators, the report said. Also, the grand jury did not find “statements that were both objectively false and sufficiently precise to support a criminal prosecution.”\n\n“The COVID-19 pandemic gave sponsors (pharmaceutical companies) enormous leverage over federal regulators, and they were certainly not afraid to use it. Still, regulators had the responsibility to recognize and temper these intentions,” the report said.\n\n“It is hard to lay blame solely at the feet of the pharmaceutical industry for cutting regulatory comers when government actors were holding their hand the whole way. The lack of tension between federal regulators and sponsors is a significant problem.”\n\nThe grand jury was set up in December 2022, as Gov. Ron DeSantis was planning to embark on a run for the Republican presidential nomination. The report said the grand jury “did not draft this final report to win any arguments or settle any scores.”\n\n“Given the political, social and cultural wars that have been waged over the last four years, asking those who read this document to keep an open mind is probably asking for too much,” the report said. “Instead, we will just say that no matter what anyone's prior opinions are regarding these issues, our findings will likely confirm some of them and debunk others.”\n\n©2025 The News Service of Florida. All rights reserved.",
        "source_3": "‘Hiding the details, methodology and results of scores of safety investigations from public view does not build public confidence; it undermines it.’\n\nOn Tuesday, a Florida grand jury released itsfinal reporton potential “criminal or wrongful activity” regarding the creation and promotion of the Covid jabs.\n\nRequestedby Gov. Ron DeSantis, R-Fla., andauthorizedby the Florida Supreme Court in December 2022, the grand jury wastaskedwith looking into whether individuals and entities, “including, but not limited to, pharmaceutical manufacturers (and their executive officers) and other medical associations or organizations” possibly violated state law related to the development, clinical testing, and marketing of the mRNA shots. The jury previously released interim reports inFebruaryandMay2024, respectively, which undercut much of the pseudo-science pushed by government “experts” on subjects such as masking, lockdowns, and natural immunity.\n\nFollowing its investigation, the grand jury ultimately declined to charge any individual or entity in the case after the jurors “did not find any statute that [they] believed would be an appropriate vehicle for a criminal indictment based on the facts” in its final report. The grand jury did, however, note that such a conclusion does not absolve entities of engaging in unethical behavior.\n\n“We want to be abundantly clear that this does not mean we believe the actions of these sponsors were always appropriate, or that the statements they made turned out to be factually correct,” the report reads. “It just means that those actions and statements are not sufficient bases to support criminal prosecutions.”\n\nDespite the lack of criminal charges, the jury did unearth numerous major findings in its report that shine a light on deceptive behavior and actions surrounding the development and promotion of the Covid shots. Here are some of the biggest takeaways from the analysis.\n\nWhile understanding the seriousness Covid posed to vulnerable populations (such as the elderly) and the desire to quickly develop medical interventions to save lives, the grand jury disagreed with the Food and Drug Administration’s (FDA) assessment that the Covid “emergency” “applied to everyone.” Based upon its assessment of the flagship trial data available at the time, the jury opined that the “Emergency Use Authorization” (EUA) granted to the Pfizer and Moderna Covid shots “should only have been granted as to the elderly and comorbid populations most at risk from SARS-Co V-2 complications.”\n\n“A broader authorization might have been appropriate had the flagship trials demonstrated efficacy against transmission, but the FDA did not require them to be designed that way, and neither Moderna nor Pfizer took it upon themselves to build transmission efficacy into their protocols,” the report reads.\n\nThe jury found an alarming lack of care given to conducting secure flagship trials and research on the Covid shots’ impact on pregnant women. Specifically, the jurors disclosed their belief that expectant mothers were not “well-served by the United States public health apparatus” and that such “troubling issues” were not “properly and meaningfully disclosed and discussed over the last four years.”\n\n“Troubling results that occurred in newly pregnant women in the flagship clinical trials were not contemporaneously disclosed by the FDA, Pfizer or Moderna, nor do they appear to have been meaningfully investigated beyond allowing pregnant women to serve as human guinea pigs based on limited observational data that did not address infant health risks, then using statistically unreliable safety databases like [the Vaccine Adverse Event Reporting System] to ‘enthusiastically recommend vaccination’ to this vulnerable group,” the report reads.\n\nAs noted by the jury, the FDA provided “Full Approval” letters to Pfizer and Moderna, granting complete market access for their respective Covid shots. In order to keep their licenses, both companies were required to conduct a series of “interventional and observational” studies monitoring the “safety and effectiveness” of the jabs after they were released to market.\n\nDespite having received these mandates years ago (Pfizer in August 2021 and Moderna in January 2022), the grand jury found that both companies have failed to complete several of the required studies by deadline and received timeline extensions from federal administrators.\n\n“These missed deadlines do not give us confidence,” the grand jury report reads. “Each one represents an opportunity for the FDA and the public to be better informed about the safety of these products that cost billions of taxpayer dollars to develop, manufacture and administer. We recognize that conducting these trials and studies can be challenging work, but we think the money Pfizer and Moderna made [from their Covid shots] should be more than enough to fund and timely administer these tasks as they have been directed.”\n\nAs described in the report, pharmaceutical companies and public health agencies possess postmarketing surveillance databases that collect reports of potential side effects experienced by those who receive their approved vaccines. According to the analysis, after a “safety signal” is “identified,” the former entities will conduct research using available data and research to determine the validity of the safety signal. If such signals are valid, the companies share their data with the FDA to determine whether it is “confirmed” or “refuted.”\n\nAccording to the report, “If a signal is ‘confirmed,’ the FDA — in conjunction with the [Advisory Committee on Immunization Practices] — must then decide what kind of response is warranted,” with some signals requiring “no more than a published communication or warning about potential risks,” and others requiring “updates to their physician or patient information.”\n\nThe grand jury noted that while Moderna confirmed five safety signals regarding its Covid shot, “the public likely does not know … that Moderna investigated a total of 65 safety signals, ‘refuting’ 60 of them in consultation with the FDA.” A Pfizer representative interviewed by the jury said the company investigated “[a]bout 100 signals” for its shot, which resulted in “very, very few” being confirmed.\n\nWhen pressed on if the company made this information available to the public, a Moderna representative told the jury, “No, it’s irrelevant for them,” and claimed, “the reason is that, these are issues that are unknown … [a]nd if we were to advise the public of every theoretical safety concern, I think that would be a disservice to the public.”\n\n“We emphatically disagree,” the jury wrote. “In fact, we believe it perfectly illustrates the larger paternalistic attitude on the part of both government health agencies and the pharmaceutical industry towards the public. …Hiding the details, methodology and results of scores of safety investigations from public view does not build public confidence; it undermines it.”\n\nWhile maintaining that Vaccine-Related Myocarditis and Pericarditis (VRMP) events are “very rare,” the grand jury disclosed significant findings about such incidents, including the apparent withholding of such information from the American public.\n\nWhile reports of a potential myocarditis signal associated with the Covid shots first began to emerge in Israel in February 2021, the jurors found that “a less-publicized safety signal for myocarditis” regarding the Pfizer and Moderna jabs “appeared after the United States military began vaccinating its servicemembers.” According to the jury, this information “was not made public until after the VRMP safety signal was confirmed on June 23, 2021” — despite “representatives from Pfizer and Moderna [confirming to the] Grand Jury that several government agencies, including the DOD, were investigating it well before then.”\n\nThe grand jury highlighted remarks by CDC Director Rochelle Walensky, who when asked during an April 27, 2021, interview about reports of myocarditis among service members and a possible connection to the Covid shots, claimed, “We have not seen a signal.”\n\nThe jury noted that despite the director’s statement, “contemporaneous communications between top CDC officials suggest [the CDC], along with the FDA, Pfizer, Moderna and the DOD were all actively investigating the VRMP safety signal right around the time Director Walensky was saying CDC had not seen one.”\n\nThe report later acknowledges that, “For a sizeable group of healthy young men, there is credible evidence that the risk of side effects from second doses [Pfizer] or [Moderna]alwaysoutweighed their benefits, even at the height of the COVID-19 pandemic.”\n\n[Exclusive: Biden Admin ‘Ignored’ Vaccine Safety Protocols To Fast-Track Its Covid Shot Mandates]\n\nThe grand jury devoted attention to themass censorshipdeployed by the federal government and Big Tech against Americans who disagreed with its preferred narrative on Covid. While characterizing the scheme as a “concerted effort … to seek thesuppressionof opinions not in line with messages they wanted to amplify,” the judicial body noted how these government figures “exercised considerable soft power … by attempting to control vaccine-related narratives on social media websites, asking for specific posts or authors to be removed altogether, or even ‘blacklisted’ … on the grounds that they contained ‘misinformation’ or ‘disinformation.'”\n\nThe jury further noted how pharmaceutical companies exercised “indirect” influence in shaping the public discourse on Covid shots “by selectively releasing efficacy and safety data regarding their products,” which is then regurgitated by researchers, journalists, and medical organizations in their writings.\n\nModerna and Pfizer also deployed deceptive “unbranded” advertising tactics when marketing their products to the public, according to the report.\n\nThe grand jury noted how pharmaceutical companies are “required to disclose both the brand and generic names of their pharmaceuticals, their ingredients and a ‘major statement’ about side effects and contraindications associated with their products.” However, these mandates are “only applied to advertisements thatpromoted the vaccines, not to advertisements thatpromoted vaccination generally.”\n\n“If the advertisement did not mention the branded drug by name … the FDA did not enforce its marketing limitations. … After all, it was not theproductthat was being advertised, just theactof getting vaccinated,” the report reads. “While this may be a fictional and outright silly distinction, it has real consequences, allowing the companies to avoid communicating the risk of their products while simultaneously reminding consumers of their existence and even extolling their benefits.”\n\nWhile the grand jury acknowledged that the Emergency Use Authorization for the Pfizer and Moderna shots was reasonable at the time given the early data from the flagship trials and other “limited information” available, it subsequently noted that “circumstances have changed” in the years since that call into question their necessity. Specifically, the panel detailed how the virus “infects and causes COVID-19 disease at a much lower rate than it used to” and produces “fewer hospitalizations and deaths.”\n\nJurors also recognized that most people have already been infected with and recovered from Covid.\n\n“The issue in 2024 is that the COVID-19 vaccines may not be different enough. The SARS Co V-2 virus still mutates to new variants on a frequent basis,” the report reads. “Even with the extra speed derived from the FDA’s willingness to accept immunogenicity results rather than clinical endpoints, new formulations of [Pfizer and Moderna’s Covid shots] regularly lag more than a generation behind the latest variants by the time they reach consumers, meaning that they provide less protection from SARS Co V-2 risks, and that whatever protection they do provide is likely to wane quickly.”\n\n“We no longer have a clear idea of which demographic groups are still deriving a meaningful benefit from [Pfizer] and [Moderna] and whether that benefit is worthwhile in the context of their side effect profiles,” it added.\n\nDespite declining to file indictments against any individual or entity, the grand jury did offer several recommendations for state and federal officials to take to ensure greater accountability in the vaccine-approval process.\n\nAmong those at the federal level include suggestions that the FDA “reinstate its pre-1997 ban on the direct-to-consumer advertising of therapeutics,” the federal government to institute policies “impeding the ‘revolving door’ of private-sector employees and lobbyists in and out” of health agencies, and the implementation of rules requiring Big Pharma companies to “publish the anonymized individual patient data — with all their attendant safety, efficacy and immunogenicity information — shortly after [the] granting of any FDA license.”\n\nAt the state level, the jury recommended Florida lawmakers make it a crime for failure to comply with a statewide grand jury subpoena, allow statewide grand juries to indict and the Office of Statewide Prosecution to prosecute individuals who commit perjury while testifying before the jury, and provide for a “pre-swearing discovery period” for any statewide grand jury.\n\n© 2025 The Federalist, A wholly independent division of FDRLST Media. All rights reserved."
    }
}