{
    "question": "How might Turo’s move to consult national security and counterterrorism experts after the New Orleans and Las Vegas attacks shape its screening practices and the broader responsibilities of peer-to-peer rental platforms?",
    "content": {
        "source_1": "Updated on:  January 3, 2025 / 1:10 PM EST/ CBS News\n\nThe vehicles used in two separate incidents, the deadly New Orleans attack and the explosion in front of the Trump International Hotel in Las Vegas, were rented via the same app, a peer-to-peer service called Turo, the company said.\n\nAuthorities are looking into several parallels between the incidents, including that both involved trucks — a Ford pickup in New Orleans andTesla Cybertruck in Las Vegas— were rented from Turo and occurred on New Year's Day. Both also involved U.S.-born military servicemen who served in Afghanistan around the same timeframe, but don't appear to have any known connections.\n\nBut on Thursday, an FBI official, Christopher Raia, said that at this point, there's \"no definitive link\" between the two occurrences.\n\nIn an email to CBS News, a Turo spokesperson said the company is \"actively partnering with law enforcement authorities as they investigate both incidents.\"\n\nTuro CEO Andre Haddad released a statement on Friday detailing the company's ongoing cooperation with authorities. \"We've spent these tense, mournful hours investigating, partnering with law enforcement, and working around the clock to figure out how our platform could be misused by the perpetrators of such atrocities,\" the CEO said.\n\nAccording to the 12-year-old company, out of its entire history of rentals — which includes 27 million bookings spanning 8.6 billion miles driven — less than .10% have ended in a \"serious incident, such as a vehicle theft.\"\n\n\"Despite this strong track record, and as an immediate next step while we wait for law enforcement to conclude their investigations, we're consulting with national security and counterterrorism experts to learn more about how we can get even better and play our part in helping prevent anything like this from happening ever again,\" Haddad said.\n\nThey added, \"We do not believe that either renter involved in the Las Vegas and New Orleans attacks had a criminal background that would have identified them as a security threat.\"\n\nTuro operates similarly to Airbnb, but with cars instead of houses or apartments. Car owners who aren't using their vehicles can rent them out to others via the app, which handles screening, billing and other services. In some cases, individuals have become \"professional hosts\" by renting out fleets of cars via Turo,accordingto a company filing.\n\nIn a separate email to CBS MoneyWatch, a Turo spokesperson said, \"We are outraged by the misuse of our marketplace by the two individuals who perpetrated these acts.\"\n\nTuro, which started in 2009, had about 150,000 active hosts who rented out about 350,000 vehicles as of Sept. 30, according to the company's filing. About 3.5 million people rented those cars in the 12-month period through the end of September, it added.\n\nThe car rental service operates in 16,000 cities in the U.S., Australia, France, the U.K. and Canada.\n\nTuro says that in order to use its service, individuals need an email address, Google account or Apple ID, and a valid driver's license. Renters must also provide a home address and payment card.\n\nCustomers must be at least 18 years old to rent a car on Turo, or over 25 for more expensive vehicles. For instance, to rent a \"deluxe\" car — those valued between $45,000 to $85,000 — drivers must be older than 25. \"Super deluxe\" cars, or those valued over $85,000, are limited to people over 30.\n\nOn itswebsite, Turo says \"We may ask for additional photos and information and/or may check your personal and/or business credit report, auto insurance score, and criminal background to verify your account.\"\n\nThe man who drove the Ford truck into a crowd on Bourbon Street in New Orleans, Shamsud-Din Jabbar, had pleaded guilty in 2015 to charges tied to driving under the influence (DUI),accordingto CNN.\n\nIn the state of Louisiana, a DUI offense is considered a felony on third and subsequent convictions,accordingto Louisiana Court Records, although first-time DUI offenders can face felony charges in instances where a death or violation of child endangerment laws is involved.\n\nTuro also says it relies on its proprietary \"risk score\" to assess potential renters, which relies on \"more than 50 data inputs,\" such as information submitted by customers as well as parameters set by the car owner.\n\n\"Every Turo renter is screened through a proprietary multilayer, data science-based trust and safety process,\" the Turo spokesperson wrote to CBS MoneyWatch.\n\n\"These individuals in question had valid driver's licenses, clean background checks, and were honorably discharged from the U.S. military,\" the spokesperson added. \"They could have boarded any plane, checked into a hotel, or rented a car or truck from a traditional vehicle rental chain. We do not believe these two individuals would have been flagged by anyone — including Big Rental or law enforcement.\"\n\nIn a separate statement Thursday, Turo CEO Haddad also said the company is consulting with national security and counterterrorism experts to \"learn more about how we can get even better and play our part in helping prevent anything like this from happening ever again.\"\n\nThe driver inthe New Orleans attack, Jabbar, a 42-year-oldU.S.-born citizen from Texas, was a U.S. Army veteran who lived in Houston. The FBI said he posted several videos before the attack proclaiming his support for ISIS.\n\nJabbar rented a Ford electric pickup truck from Turo in Houston on Dec. 30, 2024, and drove the vehicle to New Orleans on Dec. 31. On Jan. 1, he bypassed barriers put in place on Bourbon Street, which included patrol cars and law enforcement, before plowing onto the sidewalk, according to police officials. The attack killed at least 14 people and injured dozens.\n\nIn the second Jan. 1 occurrence, Matthew Alan Livelsberger, an active-duty U.S. Army Special Forces intelligence sergeant who was serving in Germany but on leave in Colorado at the time of the incident, rented a Tesla Cybertruck from Turo in Denver.\n\nThat Cybertruck, a 2024 model, pulled up to the Trump hotel's glass entrance doors on Wednesday morning, officials said. Smoke began emerging from the vehicle, and then a large explosion occurred. Gasoline and camp fuel canisters and large firework mortars were found in the back of the vehicle after the explosion, which occurred about 15 seconds after the vehicle pulled in front of the building.\n\nThe Cybertruck explosion, which is being investigated as a possible act of terrorism, killed the driver of the car and injured seven people outside of the vehicle.\n\nThe body was \"burnt beyond recognition,\" Sheriff Kevin McMahill of the Las Vegas Metropolitan Police Department said in a briefing Thursday, but the coroner's office later confirmed it was Livelsberger. Investigators said Livelsberger's military ID, passport and credit cards were found in the vehicle, along with several firearms.\n\nTesla CEO Elon Musk wrote on X, his social media app, that the vehicle's structure helped limit the damage.\n\n\"The evil knuckleheads picked the wrong vehicle for a terrorist attack,\"wroteMusk. \"Cybertruck actually contained the explosion and directed the blast upwards.   Not even the glass doors of the lobby were broken.\"\n\nAimee Picchi is the associate managing editor for CBS MoneyWatch, where she covers business and personal finance. She previously worked at Bloomberg News and has written for national news outlets including USA Today and Consumer Reports.",
        "source_2": "Monica is a Newsweek reporter based in Boston. Her focus is reporting on breaking news. Monica joined Newsweek in 2024. She is a graduate of Clark University, with a master's from both Clark University and Northwestern University. She was part of the team named a finalist for the Goldsmith Prize for Investigation as well as a winner of the George Polk award for their work uncovering Phillips Respironics wrongdoings with their breathing machines. You can get in touch with Monica by emailing m.sager@newsweek.com. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nThe Turo app was used to rent the cars associated with the vehicular attack in New Orleans as well as the Cybertruck explosion in Las Vegas on Wednesday.\n\n\"We are heartbroken by the violence perpetrated in New Orleans and Las Vegas, and our prayers are with the victims and families,\" a Turo spokesperson toldNewsweek. \"We are actively partnering with law enforcement authorities as they investigate both incidents.\"\n\nShamsud-Din Jabbar, 42, has been named the suspect in the New Year's attack on Bourbon Street that killed at least 15 people and injured 30 early Wednesday morning.\n\nLater on Wednesday in Las Vegas,a Cybertruck exploded in front of the Trump InternationalHotel, killing one and injuring seven others. It was not due to a defectiveTesla, but instead \"large fireworks and/or a bomb carried in the bed,\" according to CEOElon Musk.\n\nBoth incidents are being treated as an act of terrorism. Both also were associated with the Turo app, as reported by the Associated Press.\n\n\"We do not believe that either renter involved in the Las Vegas and New Orleans attacks had a criminal background that would have identified them as a security threat,\" a Turo spokesperson toldNewsweek. \"We remain committed to maintaining the highest standards in risk management, thanks to our world-class trust and safety technologies and teams that include experienced former law enforcement professionals.\"\n\nTuro is a car rental marketplace that allows users to rent cars from \"trusted hosts\" across the United States, Canada, Australia and France, according to the app's description onGooglePlay.\n\nThe app says it is the \"world's largest car sharing marketplace,\" allowing people to \"skip the rental car counter\" and instead \"choose from an extraordinary selection of vehicles shared by local hosts and rent the best car for your trip, then you can pick it up at a convenient location near you or your destination.\"\n\n\"Entrepreneurs can take the wheel of their futures by becoming hosts and building car sharing businesses on Turo, leveraging an established platform to scale their businesses and meet their goals,\" the app description reads. \"With Turo, everyone has the power to get in the driver's seat.\"\n\nTuro offers a variety of cars, from vans to exotic vehicles, as well as vintage cars and SUVs. The app has a 4.9 out of 5 rating on Google Play and a 4.8 out of 5 stars in the App Store. Reviews called the service a \"game-changer.\"\n\nThe company toldNewsweekit has \"facilitated 27 million trips, over 90 million booked days, spanning 8.6 billion miles driven,\" through its 12 years of operation. During that time there has been \"less than 0.10 percent\" of Turo trips ending with a \"serious incident, such as a vehicle theft.\"\n\nThe attack in New Orleans occurred around 4:15 a.m. ESTin the French Quarter, one of New Orleans' busiest areas, during the city's New Year's Eve celebrations. Three victimshave been identifiedby their families: Reggie Hunter, Nikyra Dedeaux and Tiger Bech.\n\nThe New Orleans Police Department said the suspect opened fire on officers after thevehicle came to a stop. He was driving aFordpickup truck, which officials said appeared to be rented.\n\nAn ISIS flag was found in the vehicle, according to theFBI. Weaponsand a potential IED were also foundin the vehicle. Other potential IEDs were also located in the French Quarter.\n\nJabbar was allegedly staying at anAirbnb, which burned down earlier Wednesday,about a mile and a half away from the attacks.\n\nAcross the country in Las Vegas,one person died, and seven more suffered from minor injuries after a Tesla Cybertruck explodedin the Trump International Hotel valet area.\n\nPolice have yet to determine what caused the incident, but until then, they are treating the blast as a possible criminal act and a possible act of terror,ABCNews reported.\n\nIn a press conference Wednesday night about the New Orleans attack, PresidentJoe Bidenalso mentioned the Las Vegas incident, noting that law enforcement and the intelligence community are looking into if there's \"any possible connection.\"\n\n\"Thus far, there's nothing to report on that score at this time,\" Biden said.\n\nAndre Haddad, chief executive,toNewsweek: \"Thinking about how egregiously the two individuals who perpetrated these heinous crimes abused our platform, I'm outraged. These individuals had valid driver's licenses, clean criminal backgrounds, and were decorated US military servicemembers — one was honorably discharged and was even awarded a Global War on Terrorism Service Medal, and one was an active duty Green Beret. They could have boarded any plane, checked into any hotel, or rented a car or truck from any traditional vehicle rental chain. We do not believe these two individuals would have been flagged by anyone – including law enforcement.\"\n\nNew Orleans victim Nikyra Dedeaux's mother, Melissa Dedeaux, to Nola.com:\"I just want to see my baby. She was the sweetest person. She would give you anything, anything.\"\n\nLouisiana Governor Jeff Landry, on X, formerly Twitter:\"A horrific act of violence took place on Bourbon Street earlier this morning. Please join Sharon and I in praying for all the victims and first responders on scene. I urge all near the scene to avoid the area.\"\n\nPresident Joe Biden, in a statement:\"I will continue to receive updates throughout the day, and I will have more to say as we have further information to share. In the meantime, my heart goes out to the victims and their families who were simply trying to celebrate the holiday. There is no justification for violence of any kind, and we will not tolerate any attack on any of our nation's communities.\"\n\nEric Trump, the president-elect's second-eldest son and one of the executive vice presidents of the Trump Organization, on X: \"Earlier today, a reported electric vehicle fire occurred in the porte cochère of Trump Las Vegas.\"\n\n\"The safety and well-being of our guests and staff remain our top priority. We extend our heartfelt gratitude to the Las Vegas Fire Department and local law enforcement for their swift response and professionalism,\" he added.\n\nJeremy Schwartz, acting FBI Special Agent in Charge for the Las Vegas office, at a news conference:\"I know you have a lot of questions.\"\n\nThe FBI will be the lead agency in investigating the New Orleans case. Anyone with information that can assist is asked to contact the FBI's New Orleans Bureau by calling (504) 816-3000 or by emailing tips@fbi.gov.\n\nThe public is being asked to avoid Bourbon Street north from Canal to Dumaine Street, east to Royal Street, and west to Dauphine Street until further notice.\n\nThe Las Vegas Police Department said it is investigating the fire and explosion. At Wednesday's news conference, Schwartz confirmed that theFBIis also involved in this investigation.\n\nUpdate 1/1/25, 7:43 p.m. ET: This article was updated with additional information.\n\nUpdate 1/1/25, 9:36 p.m. ET: This article was updated with a statement from Turo.\n\nUpdate 1/1/25, 10:37 p.m. ET: This article was updated with additional information.\n\nUpdate 1/3/25, 12:14 p.m. ET: This article was updated with an additional statement from Turo.\n\nMonica is a Newsweek reporter based in Boston. Her focus is reporting on breaking news. Monica joined Newsweek in 2024. She is a graduate of Clark University, with a master's from both Clark University and Northwestern University. She was part of the team named a finalist for the Goldsmith Prize for Investigation as well as a winner of the George Polk award for their work uncovering Phillips Respironics wrongdoings with their breathing machines. You can get in touch with Monica by emailing m.sager@newsweek.com. Languages: English.\n\nMonica is a Newsweek reporter based in Boston. Her focus is reporting on breaking news. Monica joined Newsweek in 2024. She is a graduate of Clark University, with a master's from both Clark University and Northwestern University. She was part of the team named a finalist for the Goldsmith Prize for Investigation as well as a winner of the George Polk award for their work uncovering Phillips Respironics wrongdoings with their breathing machines. You can get in touch with Monica by emailing m.sager@newsweek.com. Languages: English.\n\nMonica is a Newsweek reporter based in Boston. Her focus is reporting on breaking news. Monica joined Newsweek in 2024.                                    ...Read more",
        "source_3": "The deadly New Orleans terror attack and the Cybertruck explosion outside the Trump International Hotel Las Vegas on New Year’s Day have at least one connection — the car-sharing app Turo.\n\nWhile officials have indicated that they have no evidence so far that the two incidents may be linked, investigators have determined the pickup truckused by a terrorist on Bourbon Streetandthe exploding Tesla truckwere both procured using Turo.\n\nTuro is a platform that allows users to rent vehicles from trusted hosts that are registered with the site.\n\nUsers punch in their location and are presented with a variety of rentable cars in the area, from sports cars to minivans and everything in between.\n\nThere are very limited requirements for renters to secure a car from Turo.\n\nRenters using Turo are not required to have a US license and are not required to have personal insurance coverage to rent a car, according to Turo’s website.\n\nTuro said in a statement that insurance is automatically provided on every trip by the company.\n\nRenters do need a valid driver’s license to be a Turo account holder, and to be of age, which in the US is 18 years old.\n\n“In most cases, you’ll get approved immediately,” Turo boasts on itswebsite.\n\nThe site says most hosts will organize the delivery of the rented car to the guest.\n\nRenters can alternatively pick up the cars at designated locations such as parking lots or homes.\n\nContactless pickup methods, involving lock boxes or app-based unlocking, are also common practice.\n\nTuro operates in the US, the United Kingdom, Canada, Australia and France.\n\nShamsud-Din Jabbarkilled at least 15 people and injured 30 moreNew Year’s Eve revelers in a car attack in the early hours Wednesday in New Orleans’ French Quarter.\n\nAuthorities said Jabbar used Turo to rent the white Ford electric pickup truck used in the terror attack.\n\nLater Wednesday, a Tesla Cybertruck parked outside the Trump International Hotel in Las Vegas exploded, killing one.\n\nThat Cybertruck was rented using the Turo app, according to law enforcement.\n\nNo arrests have been made in connection to the Tesla truck explosion, which is being investigated as a possible act of terror.\n\n“We are heartbroken by the violence perpetrated in New Orleans and Las Vegas, and our prayers are with the victims and families. We are actively partnering with law enforcement authorities as they investigate both incidents,” a Turo spokesperson said in a statement to The Post.\n\n“We do not believe that either renter involved in the Las Vegas and New Orleans attacks had a criminal background that would have identified them as a security threat,” the spokesperson added."
    }
}