{
    "question": "How might Biden’s executive ban on offshore oil and gas drilling across 625 million acres shape U.S. energy strategy, coastal economies, and environmental goals, given the legal hurdles to reversing it?",
    "content": {
        "source_1": "President Joe Biden on Monday announced an executive action that will permanently ban future offshore oil and gas development in parts of the Atlantic and Pacific oceans in a way that could be especially difficult for the incoming Trump administration to undo.\n\nBiden’s executive action will ban new oil and gas leasing across 625 million acres of US ocean. The ban will prevent oil companies from leasing waters for new drilling along the entire East Coast, the eastern Gulf of Mexico, the coasts of Washington, Oregon and California, and portions of Alaska’s Northern Bering Sea.\n\n“My decision reflects what coastal communities, businesses, and beachgoers have known for a long time: that drilling off these coasts could cause irreversible damage to places we hold dear and is unnecessary to meet our nation’s energy needs,” Biden said in a statement. “It is not worth the risks.”\n\nThe action, whichCNN reported on Friday, invokes the 1953 Outer Continental Shelf Lands Act, a law that gives presidents broad authority to withdraw federal waters from future oil and gas leasing and development.\n\nThe law does not give presidents explicit authority to revoke the action and place federal waters back into development, meaningPresident-elect Donald Trumpwould have to get Congress to change it before he could reverse Biden’s move.\n\nNevertheless, Trump on Monday said in an interview he would try to undo the action.\n\n“Look, it’s ridiculous. I’ll unban it immediately,” Trump said in a radio interview on “The Hugh Hewitt Show.”\n\nAs Biden’s presidency draws to a close, environmental and climate groups have advocated for him to withdraw areas off the Eastern Gulf of Mexico, as well as other parts of the Atlantic and Pacific oceans — giving the areas permanent protections from future drilling. The move would guard against future oil spills and against adding more planet-warming pollution from fossil fuels to the atmosphere.\n\n“President Biden’s new protections add to this bipartisan history, including President Trump’s previous withdrawals in the southeastern United States in 2020,” said Oceana Campaign Director Joseph Gordon in a statement. “Our treasured coastal communities are now safeguarded for future generations.”\n\nDespite a friendly posture towards the oil and gas industry, Trump also moved to ban offshore drilling while president. After proposing a major expansion in offshore drilling early in his first term, Trump in 2020 extended a ban on future oil drilling in the Eastern Gulf and expanded it to include the Atlantic coasts of three states: Florida, Georgia and South Carolina.\n\nStill, Trump’s incoming press secretary, Karoline Leavitt, lambasted the decision, writing in apost on X, “This is a disgraceful decision designed to exact political revenge on the American people who gave President Trump a mandate to increase drilling and lower gas prices. Rest assured, Joe Biden will fail, and we will drill, baby, drill.”\n\nThe oil industry lashed out against the executive action, too.\n\n“President Biden’s decision to ban new offshore oil and natural gas development across approximately 625 million acres of US coastal and offshore waters is significant and catastrophic,” Ron Neal, chairman of the Independent Petroleum Association of America Offshore Committee, said in a statement. “It represents a major attack on the oil and natural gas industry.”\n\nNeal said the ban would severely limit the industry’s potential for future oil and gas exploration in new areas, hurting the industry’s long-term ability to survive.\n\nBut Biden noted in his statement that protecting coastlines from offshore drilling has bipartisan support.\n\n“From California to Florida, Republican and Democratic Governors, Members of Congress, and coastal communities alike have worked and called for greater protection of our ocean and coastlines from harms that offshore oil and natural gas drilling can bring,” Biden said.\n\nHe argued that after the devastating 2010 Deepwater Horizon spill in the Gulf of Mexico, the ban he imposed will help protect similar ecological disasters from happening again.\n\n“Every president this century has recognized that some areas of the ocean are just too risky or too sensitive to drill,” Earthjustice vice president of litigation for lands, wildlife and oceans Drew Caputo said in a statement Friday.\n\nEnergy analysts told CNN the move won’t make much of a difference in US oil production, whichhas set new recordsunder Biden.\n\nIt’s “not particularly consequential for US exploration and production going forward,” Tom Kloza, global head of energy analysis at the Oil Price Information Service, said on Friday. Kloza noted there are plenty of existing offshore rigs pumping oil in the Gulf of Mexico and added that offshore projects typically take 6-8 years to come online.\n\n“I don’t see it as having any real impact on US supply, exports, imports,” Kloza said.\n\nBiden agreed, arguing in his statement that preserving the environment and the coastlines will help local economies flourish.\n\n“We do not need to choose between protecting the environment and growing our economy, or between keeping our ocean healthy, our coastlines resilient, and the food they produce secure and keeping energy prices low,” Biden said. “Those are false choices.”\n\nStill, the American Petroleum Institute blasted Biden’s decision.\n\n“American voters sent a clear message in support of domestic energy development, and yet the current administration is using its final days in office to cement a record of doing everything possible to restrict it,” API CEO Mike Sommers said in a statement. “We urge policymakers to use every tool at their disposal to reverse this politically motivated decision and restore a pro-American energy approach to federal leasing.”\n\nIn a separate announcement, the Biden administration is expected to declare two new national monuments in California in the coming week, a source familiar with the planning told CNN.\n\nBiden will establish the Chuckwalla National Monument in Southern California near Joshua Tree National Park and the Sáttítla National Monument in Northern California, the source said. Native tribes have been actively pushing the administration to protect the land from energy development.\n\nBiden has so far conserved or expanded10 national monumentsas president.",
        "source_2": "US President Joe Biden has announced a ban on new offshore oil and gas drilling along most of America's coastline, weeks before Donald Trump takes office.\n\nThe ban covers the entire Atlantic coast and eastern Gulf of Mexico, as well as the Pacific coast off California, Oregon and Washington and a section of the Bering Sea off Alaska.\n\nIt is the latest in a string of last-minute climate policy actions by the Biden administration ahead of Donald Trump's return to the White House.\n\nTrump has vowed to revoke the ban \"immediately\" when he takes office, but he may find it difficult to reverse under US law.\n\nDuring his campaign, Trump pledged to \"unleash\" domestic fossil fuel production in a bid to lower gas costs, despite the US already seeing record high extraction rates.\n\nAnnouncing the new drilling ban, Biden said: \"My decision reflects what coastal communities, businesses, and beachgoers have known for a long time: that drilling off these coasts could cause irreversible damage to places we hold dear and is unnecessary to meet our nation's energy needs.\n\nIn a radio interview, Trump branded the ban \"ridiculous\".\n\n\"I'll unban it immediately,\" he said. \"I have the right to unban it immediately.\"\n\nTrump has previously said he will reverse Biden's conservation and climate change policies.\n\nFor the new drilling ban, Biden is taking the action under the Outer Continental Shelf Lands Act of 1953, which allows US presidents to withdraw areas from mineral leasing and drilling.\n\nThe law does not grant presidents the legal authority to overturn prior bans, according to a 2019 court ruling. It means a reversal would likely require an act of Congress, which is now controlled by Trump's Republicans.\n\nThe law also does not allow presidents to revoke any areas already leased for offshore drilling.\n\nTrump - despite being in favour of more oil and gas exploration and repeatedly deploying his tag line \"Drill, baby, drill\" during campaigning - has used the law himself to protect waters off the coast of Florida in 2020.\n\nAt the time, this was seen as an effort to garner votes from the state ahead of the 2020 US election, and the protection was due to expire in 2032. Biden's decision will protect the same area with no expiry date.\n\nThe new offshore drilling ban covers more than 625 million acres (253 million hectares) of waters.\n\nAfter it was reported last week that Biden would introduce the policy, Trump's incoming press secretary Karoline Leavitt called it \"a disgraceful decision\".\n\nShe said the move was \"designed to exact political revenge on the American people who gave President Trump a mandate to increase drilling and lower gas prices\".\n\nJoseph Gordon, from conservation organisation Oceana, said: \"This is an epic ocean victory.\n\n\"Our treasured coastal communities are now safeguarded for future generations.\"\n\nAn oil and gas industry trade group said Biden's decision would harm American energy security and should be reversed by Congress.\n\nMike Sommers, president of the American Petroleum Institute, said: \"We urge policymakers to use every tool at their disposal to reverse this politically motivated decision and restore a pro-American energy approach to federal leasing.\"\n\nIn 2017, during his first term in office, Trump tried to reverse former President Barack Obama's protection of 125 million acres (50.6 million hectares) of the Atlantic and Arctic Oceans.\n\nTwo years later, a US District Court ruled thatthe act did not allow a president to reverse decisionsof previous administrations – meaning Trump could not revoke Obama's protections.\n\nIt is expected that Trump - whose inauguration ceremony takes place on 20 January - will still seek to challenge Biden's move. A final legal decision could be made by the Supreme Court, which currently has a majority of Republican judges.\n\nEnvironmentalists and Democrats had been calling on Biden to introduce the ban because of concerns that any new drilling would threaten US ambitions to cut its greenhouse gas emissions and tackle climate change.\n\nThe International Energy Agency estimates that global oil and gas demand needs to fall by 5% annually tolimit global temperature rise to 1.5C, which is seen as crucial to help avoid the most damaging impacts.\n\nThe US military is preparing to activate troops as part of Trump's crackdown on street crime.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "FOX Business host Taylor Riggs joined 'Fox & Friends First' to discuss how the move impacts President Biden's legacy and how it could impact Trump's ability to drill and ultimately bring energy prices down.\n\nPresident-elect Donald Trump said he plans to immediately reverse President Biden's new ban onoffshore drillingalong most of the U.S. coastline, but he faces major roadblocks under a 70-year, irrevocable law.\n\nThroughout his 2024 presidential campaign, Trump vowed that, if elected, he would expand oil and gas drilling in an effort to bolster American-made energy.\n\nHowever,Biden issuedan 11th-hour executive order Monday morning to forestall such actions exactly two weeks before his term ends, announcing a permanent stop to most new oil and gas drilling across U.S. coastal and offshore waters in an area that spans about 625 million acres.\n\n\"It's ridiculous. I'll unban it immediately,\" Trump said on \"The Hugh Hewitt Show\" on Monday. \"What's he doing?\"\n\nBIDEN MOVING TO BAN OIL AND GAS LEASES FOR 20 YEARS IN NEVADA REGION, JUST WEEKS BEFORE TRUMP INAUGURATION\n\nPresident-elect Donald Trump said he will \"unban\" President Biden's block on driling along the coast.(Sarah Meyssonnier)\n\n\"We can't let that happen to our country,\" Trump added. \"It's really our greatest economic asset.\"\n\nThe executive order, issued under the Outer Continental Shelf Lands Act (OCSLA), seeks to block future oil and natural gas leasing along the East and West coasts, the eastern Gulf of Mexico and portions of Alaska's Northern Bering Sea.\n\nTrump said that he \"has the right\" to reverse such an action, but given that Biden issued the order under a 1953 law that allows the president to enact bans on oil and gas development, he would not be able to simply reverse it.\n\nTRUMP TELLS EU TO BUY MORE AMERICAN-MADE OIL AND GAS OR FACE ‘TARIFFS ALL THE WAY’\n\nIn 2019, during Trump's first term, a federal judge ruled that OCSLA does not permit presidents to overturn bans established by previous administrations. This means Trump would need congressional approval to reverse Biden's decision.\n\nDCOR LLC's Edith offshore oil and gas platform, right, and Beta Operating Company LLC's Eureka oil and gas platform stand in the Beta Field off the coast of Long Beach, California, on Tuesday, May 18, 2010.(Tim Rue)\n\nBiden said that his decision stemmed from his efforts to curb climate change – one of dozens of moves from the Democratic president's green energy agenda.\n\n\"My decision reflects what coastal communities, businesses, and beachgoers have known for a long time: that drilling off these coasts could cause irreversible damage to places we hold dear and is unnecessary to meet our nation’s energy needs,\" Biden said in a statement. \"It is not worth the risks. As the climate crisis continues to threaten communities across the country and we are transitioning to a clean energy economy, now is the time to protect these coasts for our children and grandchildren.\"\n\nTrump's spokeswoman, Karoline Leavitt, also issued a statement criticizing Biden's order.\n\n\"This is a disgraceful decision designed to exact political revenge on the American people who gave President Trump a mandate to increase drilling and lower gas prices. Rest assured,Joe Bidenwill fail, and we will drill, baby, drill,\" Leavitt said.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}