{
    "question": "What are the potential political and policy implications of Trudeau announcing he will resign but remain prime minister and Liberal leader until a successor is elected?",
    "content": {
        "source_1": "Under-fire leader of Liberal party to speak about his political future at Rideau Cottage on Monday\n\nThe Canadian prime minister,Justin Trudeau, is expected to announce on Monday that he plans to step down, local media have reported, after a snowballing leadership crisis during which he lost support from within his own party.\n\nThe prime minister’s office said he would speak about his political future from Rideau Cottage, his temporary residence, at 10.45 am. The press conference marks the first time that he will have answered questions from reporters since November.\n\nOn Sunday evening, the Globe and Mail newspapercited three sourcessaying that Trudeau would quit as head of the ruling Liberal party, which in turn would bring to an end his nine years as prime minister at some point later this year. The 53-year-old became party leader in 2013 and has been prime minister since November 2015.\n\nThe paper said one of the sources had recently spoken to the prime minister and believed he intended to step down before an emergency meeting of party members on Wednesday, “so it doesn’t look like he was forced out by his own MPs”.\n\nThe Toronto Star said ithad also confirmedthat Trudeau was “expected to signal his intentions to step aside as early as Monday”, citing what it said was a senior source.\n\nTrudeau’s popularity has plummeted amid record inflation,an acute housing crisis, high food prices and voter fatigue with incumbent politicians. Recent polling put the Liberals at 16% support, their worst pre-election standing in more than a century, with the opposition Conservatives coming out on top.\n\nAt the end of October, almost two dozen backbench Liberal MPs signed a lettercalling on Trudeau to step down, with the party fearing a seismic electoral defeat in the federal election scheduled for next year.\n\nHis political horizons darkened in mid-December with the shockresignation of his deputy, Chrystia Freeland, who left withstern wordsfor the prime minister, questioning his ability to guide Canada through Donald Trump’s “America first” economic nationalism, including a threatof 25% tariffson Canada.\n\n“We need to take that threat extremely seriously,” she said in a departing letter, which questioned whether the government understood the “gravity of the moment”.\n\nFreeland, a former Financial Times reporter, had previously won praise for navigating the North American Free Trade Agreementrenegotiation processduring Trump’s first term.\n\nThe resignation of a key ally sent Ottawa into chaos and the fallout has resulted in the smallerNew Democratic party, which had kept the Liberals in power,pulling its support for the prime minister.\n\nTrudeau had attempted to placate the incoming US president, with a visit to Florida, where theyposed for a smiling photo, and he told the Canadian Broadcasting Corporation that he had promised Trump that Canada would shore up border security.\n\nStill, days later Trump publicly mocked Trudeau, belittling him as the “governor” ofCanada, as if his country were merely a US state rather than an independent nation, and musing that it could become part of the US.\n\nMany Canadian observers now expect an election to be called for spring. It is unclear whether Trudeau would stay on as prime minister until a new Liberal leader is selected.\n\nThe former high school teacher and the eldest son of Pierre Trudeau, one of Canada’s best-known prime ministers, became Liberal leader in 2013 when the party was also faring badly, and his leadership was seen abroad as an example of stable, progressive power.\n\nThe Conservative leader, Pierre Poilievre, hasrepeated his calls for an immediate election, saying: “The government of Canada is itself spiralling out of control.”",
        "source_2": "This article was published more than 6 months ago. Some information may no longer be current.\n\nPrime Minister Justin Trudeau speaks at the federal Liberal caucus holiday party, the day after Finance Minister Chrystia Freeland unexpectedly resigned, in Ottawa, Ontario, Canada December 17, 2024.Carlos Osorio/Reuters\n\nUpdate: On Jan. 6, Prime Minister Justin Trudeau addressed the nation from his residence in Ottawa and announced he will step down.Read more here.\n\nJustin Trudeauis expected to announce as early as Monday that he will resign as Liberal Party Leader, three sources said Sunday, as the Prime Minister faces a caucus revolt and dismal public opinion polls that show his party will likely be swept out of power by Pierre Poilievre’s Conservatives.\n\nThe sources stressed that they don’t know definitely when Mr. Trudeau will announce his plans to leave but said they expect it will happen before a key national caucus meeting on Wednesday. The Globe and Mail is not identifying the sources because they were not authorized to discuss internal party matters.\n\nOne of the sources, who spoke recently to the Prime Minister, said Mr. Trudeau realizes he needs to make a statement before he meets the Liberal caucus so it doesn’t look like he was forced out by his own MPs.\n\nThe three sources said they are unsure about what the Liberal Party national executive plans to do to replace Mr. Trudeau as leader. They said it remains unclear whether he will leave immediately or stay on as Prime Minister until a new leader is selected. The Liberal Party national executive, which decides on leadership issues, plans to meet this week, likely after the caucus session.\n\nOn Friday, The Globe reported that Mr. Trudeau’s advisers are looking at how he can remain Prime Minister while a new Liberal leader is selected. A fourth source said on Sunday they believed that Mr. Trudeau would stay in his position until a new leader was chosen. The Globe is not naming the source, who was not authorized to discuss the private deliberations.\n\nHowever, several MPs have expressed a preference for an interim leader, including Alberta Liberal George Chahal. He wrote a letter to his caucus colleagues with that request last week.\n\nThe party has two options: appoint an interim leader on the recommendation of national caucus or hold a shortened leadership contest. A leadership contest would require the Prime Minister to request that Governor-General Mary Simon prorogue Parliament, which constitutional experts say is not guaranteed.\n\nOne of the sources said that the Prime Minister discussed with Finance Minister Dominic LeBlanc whether he would be willing to step in as interim leader and prime minister. But the source said that would be unworkable if Mr. LeBlanc, as expected, plans to run for the leadership.\n\nAnother of the sources said it makes sense for Mr. Trudeau to remain as Prime Minister until a leader is chosen so he can deal with the incoming administration of Donald Trump and his threat of 25-per-cent tariffs.\n\nA separate Liberal Party source said a leadership race would take at least three months, although the party constitution requests at least four months. Besides, the source said, a leadership race needs enough time to be a true contest. The Globe is not identifying the source, who was not authorized to discuss party matters.\n\nThe national executive is aware that shorter timelines can lead to bad choices, the source said. The individual played down an interim-leader scenario, noting that no modern sitting prime minister has ever given over leadership in such a manner.\n\nComplicating matters is a scheduled March 28 vote on supply to allow the government to operate. The Prime Minister could make a request for prorogation before that date, the Liberal Party source said.\n\nMr. Trudeau has remained largely silent since Chrystia Freeland’s surprising resignation as finance minister and deputy prime minister on Dec. 16 that led to renewed calls from Liberal MPs for him to leave. She quit on the day she was to deliver her economic and fiscal update, citing concerns over what she called spending gimmicks, such as the GST holiday and $250 rebates, and lack of seriousness in dealing with possible Trump tariffs.\n\nThe Atlantic, Ontario and Quebec caucuses have signalled that most of their membership no longer supports Mr. Trudeau remaining at the helm. Of the 153 seats that the Liberals hold in the House of Commons, those three regions account for 131 of them.\n\nThe Prime Minister subsequently told MPs that he’d reflect on his future, and his inner circle made it clear just before the holiday break that he wouldn’t announce any decisions over that time period.\n\nDuring the past two weeks, however, Mr. Trudeau’s closest advisers have been consulting with senior Liberals about how it could work if Mr. Trudeau remained as leader and Prime Minister until the end of a leadership race to replace him.\n\nThough there is yet no firm answer from Mr. Trudeau nor any concrete rules in place for a leadership race, talk of who might replace him and how they’d structure their own campaigns is already taking place.\n\nPrior to the Christmas break, The Globe reported that one of the questions that the Prime Minister was contending with was whether he still had the team behind him to stay on as leader.\n\nThe fourth source, who has been in contact with Mr. Trudeau, told The Globe Sunday that if the Prime Minister steps down it’s not because he doesn’t think he’s the right person to lead the party but rather because he came to the conclusion that the caucus is no longer behind him.\n\nIn the wake of Ms. Freeland’s resignation it was not immediately clear how MPs would respond given that many in the Liberal backbench were unhappy with her performance as finance minister and advocated for her to be replaced. But the source said that over the past few weeks reports from regional caucus meetings and individual calls between MPs and the Prime Minister’s team have made it clearer that he doesn’t have the team in place any more.\n\nThe source said their sense is that Mr. Trudeau knows that there’s no longer a path for him to stay on.\n\nLiberal candidates who are possible leadership contenders: Ms. Freeland, Mr. LeBlanc, former housing minister Sean Fraser, Foreign Affairs Minister Mélanie Joly, Innovation Minister François-Philippe Champagne, Transport Minister Anita Anand, former central banker Mark Carney and former B.C. premier Christy Clark.\n\nPolls over the past year have shown the Conservatives with a double-digit advantage over the governing Liberals. An Angus Reid survey, released Friday, suggests that under Mr. Trudeau, the Liberals only have the support of 13 per cent of voters, but those numbers do change if a new leader is in place.\n\nIf Ms. Freeland were to take over, 21 per cent of voters would cast a ballot for the Liberals, the highest number among the leadership candidates tested.\n\nAngus Reid conducted an online survey from Dec. 27 to Tuesday among 2,406 Canadian adults who are members of Angus Reid Forum. Online polls cannot be considered truly random. But for comparison purposes, a sample of this size would carry a margin of error of plus or minus 1.5 percentage points, 19 times out of 20.\n\nAuthors and topics you follow will be added to your personal news feed inFollowing.",
        "source_3": "As expected, Canada's Prime Minister Justin Trudeau is resigning after more than nine years leading Canada, amid a collapse in approval ratings and a rebellion within his political party.\n\nTrudeau, 53, currently the longest-serving leader of any G-7 country, announced Monday he plans to step down as head of the governing Liberal Party. He will remain as prime minister until a new leader is selected, and parliament has been suspended until March 24 while that process is underway.\n\nThe winner of the Liberal leadership contest is set to become Canada’s 24th prime minister and will have to quickly prepare for an election, which the Conservative Party is the clear favorite to win, according to public opinion polls.\n\nA national vote is due by October, but it’s likely it will come sooner. The three major opposition parties in parliament have said they will back a motion of non-confidence in the government. If they follow through on that threat, they would bring down the government, and an election campaign would begin.\n\nAs Bloomberg notes, Trudeau’s political future has been shaky for months, as he proved unable to reverse a slide in his party’s fortunes that accelerated after an inflation shock, and the resulting jump in interest rates, took a toll on Canadian households. His departure makes him the latest leader of an advanced economy to lose his grip on power. US President Joe Biden was forced to drop his run for reelection, Rishi Sunak’s party suffered a humbling defeat in the UK’s general election, while German Chancellor Olaf Scholz appears set to lose a forthcoming vote.\n\nFor Trudeau, the fatal blow was administered by Chrystia Freeland, his longtime deputy prime minister and finance minister. Once one of his closest allies, she stunned the nation on Dec. 16 by publishing a stinging resignation letter that indirectly criticized him for “costly political gimmicks” at a time when Canada is preparing for a possible trade war with the US.\n\nFreeland’s exit ignited already smoldering discontent across Trudeau’s party. Dozens of elected members of his own caucus publicly and privately pressed for him to go in the face of dreadful polls.\n\nTrudeau's departure is great news for long-suffering Canadaaccording to Polymarket, which now sees a 92% chance of Pierre Poilievre becoming the next prime minister.\n\nUpdate 1:Confirming the earlier report, Bloomberg updates that Turdeau (sic) will announce Monday morning he plans to resign as leader of Canada’s Liberal Party. Trudeau’s office has scheduled an announcement for 10:45 a.m. in Ottawa. He has been under pressure from elected lawmakers in his party to quit for months; that has only intensified since Chrystia Freeland, his finance minister, stepped down on Dec. 16, saying she and the prime minister were at odds on policy.\n\nTrudeau will stay on as prime minister until his successor is chosen, the Bloomberg source added.\n\nAfter the split with Freeland, some of Trudeau’s closest advisers held the view that the prime minister would be unable to survive the political fallout, people familiar with the matter told Bloomberg News.\n\nFreeland, new Finance Minister Dominic LeBlanc and former Bank of Canada Governor Mark Carney are seen by political observers as candidates to replace him.\n\nMore than 20 Liberal members of parliament have publicly called for Trudeau’s departure, and even more have said in private meetings that the prime minister has no choice but to leave. The Liberals have 153 seats in the House of Commons, including Trudeau’s.\n\n“The country could face instability, notably from an economic threat in the potential of a 25% US tariff on Canadian imports from the incoming administration,” said a recent letter sent to the prime minister by Kody Blois, who leads a group of Liberal members from the four easternmost provinces. “Simply put, time is of the essence,” Blois said, adding that it’s “not tenable for you to remain as the leader.”\n\nBack on New Year's Eve, when looking at the global tsunami of resentment and loathing at establishment politics and corrupt politicians that crushed incumbent political parties and politicians around the globe, we eyed the one person that was long overdue to be swept in the tidal wave. We are talking of course about Canada's prime minister Justin Turdeau (sic)...\n\nThe global anti-incumbent wave has yet to claim its final victimhttps://t.co/nNi6C3gPRo\n\n... and we are delighted to announce that his time has now also come: citing a source, Reuters reports that Canadian Prime Minister and the world's most iconic virtue signaling blackface, Justin Trudeau, is \"increasingly likely to announce he intends to step down, though he has not made a final decision.\"\n\nThe source spoke to Reuters after the Globe and Mail reported that Trudeau was expected to announce as early as Monday that he would quit as leader of Canada’s ruling Liberal Party after nine years in office.\n\nFollowing the news, odds that Trudeau would be out before April surged to 97%\n\nTrudeau’s departure would leave the party without a permanent head at a time when polls show the Liberals will be crushed by the official opposition Conservatives in an election that must be held by late October.\n\nSources told the Globe and Mail that they did not know definitely when Trudeau would announce his plans to leave but said they expect it would happen before a emergency meeting of Liberal legislators on Wednesday, and could come as soon as today.  An increasing number of Liberal parliamentarians, alarmed by a series of gloomy polls, have publicly urged Trudeau to quit.\n\nIt remains unclear whether Trudeau will leave immediately or stay on as prime minister until a new Liberal leader is selected, the Globe and Mail report added, although it is unclear how he hopes to continue after confirming defeat.\n\nTrudeau, who was recently mocked by Trump who proposed that he become governor of the \"51st state of Canada\", took over as Liberal leader in 2013 when the party was in deep trouble and had been reduced to third place in the House of Commons for the first time. If he does resign, it would prompt fresh calls for a quick election to put in place a stable government able to deal with the administration of President-elect Donald Trump for the next four years.\n\nThe prime minister has discussed with Finance Minister Dominic LeBlanc whether he would be willing to step in as interim leader and prime minister, one source told the newspaper, adding that this would be unworkable if LeBlanc plans to run for the leadership.\n\nTrudeau, 53, had been able to fend off Liberal legislators worried about the polls and the loss of safe seats in two special elections.But calls for him to step aside have grown since December, when Trudeau tried to demote Finance Minister Chrystia Freeland, one of his closest cabinet allies, after she pushed back against his proposals for more spending.\n\nFreeland quit instead and penned a letteraccusing Trudeau of “political gimmicks” rather than focusing on what was best for the country.\n\n“The country could face instability, notably from an economic threat in the potential of a 25% US tariff on Canadian imports from the incoming administration,” said a recent letter sent to the prime minister by Kody Blois, who leads a group of Liberal members from the four easternmost provinces. “Simply put, time is of the essence,” Blois said, adding that it’s “not tenable for you to remain as the leader.”\n\nTrudeau propelled the Liberals to power in 2015 promising “sunny ways” and a progressive agenda that promoted the rights of women and a promise to fight climate change. But the everyday realities of governing gradually wore him down and like many Western leaders, the need to deal with the effects of the pandemic ate up much of his time.\n\nAlthough Ottawa spent heavily to protect consumers and businesses, racking up record budget deficits, this provided little protection from public anger as prices soared.\n\nA botched immigration policy led to hundreds of thousands of arrivals, straining an already overheated housing market.\n\nThe Canadian currency strengthened as much as 0.4% to C$1.4388 per dollar after the Globe report before paring those gains. The currency has been trading near its weakest level since March 2020 and has lost more than 7% against the greenback in the past year.\n\n“Traders may be buying the loonie on the view that the worst is over for Canadian politics after all the recent uncertainty,” said Ken Cheung, a strategist at Mizuho Bank.\n\nFinally, in a revealing sit-down interview with Daily Wire’s Dr. Jordan Peterson,Pierre Poilievre, leader of the Conservative Party of Canada and the man most likely to succeed Prime Minister Justin Trudeau, shed light on the Great White North’s escalating economic woes, with a particular focus on its spiraling housing costs. Poilievre also outlined a bold set of policies he plans to implement to reverse these catastrophic trends.\n\nPIERRE POILIEVRE: Our productivity is another major problem right now.Productivity sounds complicated, but it's actually extremely simple. You just take the GDP and divide it by the hours worked in the country.So, American GDP is $80, meaning that for every hour an American worker works on average, he or she produces $80 of GDP. In Canada, it's 50. That means we have to work 60% more just to make the same amountand have the same level of income to buy food and housing. Now, that sounds like a bunch of wonk speak, and it might seem like it only matters to someone staring at a spreadsheet or a graph or a chart, but in fact, it's reflected in the reality that two million people are lined up at food banks because they can't afford food. 80% of youth can't afford homes, and our quality of life—the things we can afford to provide our kids—has fallen back.\n\nJORDAN PETERSON:That’s apretty stark and easily comprehensible statistic. If you work and you produce $80 worth of goods and services in an hour compared to working and producing 50,obviously that's a substantial shortfall. Yeah, so is there a starker indicator of the economic disparity between the US and Canada than that? Or do you think that's the primary statistic?\n\nPIERRE POILIEVRE:I think housing costs are another one. I mean,there was a study out just 10 days ago that has Toronto and Vancouver now by far the most unaffordable housing markets in North America. And so, you know, housing costs are 50% higher in Toronto than they are in Chicago, even though Chicago workers make 50% more money. The same is true between Vancouver and Seattle. Seattle workers make way more than Vancouver workers, but housing is 60 or 70% more expensive in Vancouver.\n\nJORDAN PETERSON:We're and we're paying more, paying more by a lot, right? And most of that's transpired in the last 10 years.\n\nPIERRE POILIEVRE:Yes, andwe're paying the difference by accumulating enormous quantities of debt.Our households are by far the most indebted in the G7. Even when you divide total household debt by GDP, we now have a bigger stock of household debt than our entire economy. We are more indebted as households than the Americans were right before the '08 financial crisis. So what we have as a model in Canada is we have artificial scarcity imposed by a very heavy and restrictive state that suppresses production,but in order to allow for consumption, we print money and borrow money, and then flood the economy with that money.\n\nJORDAN PETERSON:That's another problem. So that's the inflationary problem. Now, the problem with inflation—there are many problems with inflation—but one of them is that it particularly punishes people who are thrifty and who save. Yes, right. So, inflation punishes the people who forgo gratification to invest in the future. That's a very bad idea.\n\nPIERRE POILIEVRE:Inflation is the single most immoral tax for so many reasons. One, it takes from savers and people who are trying to be responsible, thus making it impossible to be responsible. Because if you refuse to play the inflation game of borrowing money to buy things you can't afford, someone else inevitably will, and you won't be able to afford anything. So, you ultimately have to act irresponsibly. It's like Milton Friedman was asked, 'What would you do with your money in times of inflation?'He said, 'Spend it.' Like, the first thing you want to do when inflation is out of control is to make sure you get rid of this thing that's losing its value.\n\nThe second reason it's immoral is it takes from the poor, because the poorest people cannot put—they do not have the ability to buy inflation-proof assets like gold and real estate and fancy watches and art collections and fine wines and things that go up with or even exceed inflation. So, it's a very big wealth transfer from the poor and the working class to the very, very wealthy. A very small group of people actually get richer.\n\nJORDAN PETERSON:So the socialist policies that provide goods and services to Canadians, let's say, or citizens of other countries, by printing money actually punish the poor brutally, oh absolutely, in consequence of the inflation that they generate.\n\nPIERRE POILIEVRE:Yes, I mean all the socialist policies in practice take redistribute from the working class to the super wealthy in practice and I can prove that again and again, again in practice. Yeah, in practice, in practice, all the redistribution that happens in these so-called socialist countries ultimately goes from the working class to the super wealthy. That is the real... okay, but just one last thing on inflation, the final reason why it's so immoral is nobody votes on it.The basic principle of our parliamentary system is the government can't tax what Parliament has not voted. The people must—no taxation without representation, right? But no one ever votes to have the money printing happen, and so the inflation is adopted secretly. And you blame the grocer because groceries are more expensive, or your local gas station because gas is more, or your realtor because houses are more. In fact, it was actually the government that bid up all of those things with money printing, and you didn't even know about it. So it is silent. It's a silent thief that takes from the poor, gives to the richest people, and destroys the working class. And that's why I am—I want to crush inflation.We need a policy that seeks to stop inflation at all costs.\n\nJORDAN PETERSON:What would you do to stop inflation?\n\nPIERRE POILIEVRE:We stop the money printing, you know, we need a... and the money printing is just a means to fund deficit spending. Governments borrow to finance the deficit. So basically, the deficit is the difference between what the government spends and what it brings in. It’s usually calculated on a yearly basis. The debt is just the accumulation of the deficits. So the deficit right now is 62 billion, and I thought it had a ceiling of 41 billion. There are very real present-day consequences for that. Deficits increase the money supply. Central banks effectively facilitate that increase in the money supply, and that causes inflation.\n\nI have a buddy whose family moved here from Italy back in 1973. His father worked paving roads, and his mother made sandwiches in a senior’s home.They were able to pay off their home 10 minutes from Parliament Hill in seven years. Their grandchildren wouldn’t be able to save up a down payment for that home in 15 years,and they will be university-educated with all the advantages of having been here two decades. That is the consequence of the money supply growing vastly quicker than the stuff that money buys. So what we have to do is stop growing the money supply and start growing the stuff money buys. Produce more energy, grow more food, build more homes. We have to unleash the free enterprise system to produce more stuff of value.\n\nAnd this is where we have to remove the artificial scarcity that the government is imposing on the population.Let’s incentivize our municipalities to grant the fastest building permits in the world to build homes. I’m going to say to the municipal governments: they either speed up permits, cut development charges, and free up land, or they will lose their federal infrastructure money. So they will have a powerful carrot-and-stick incentive to speed up home building.\n\nJORDAN PETERSON:What’s the percentage of a new house price that's a consequence of government taxation and regulation?\n\nPIERRE POILIEVRE:In Vancouver, it's 60%. Does that include the land and the house? Yes, that includes everything. Here's how they calculated it: they took the cost of building a home and compared it to the cost of buying a home. The gap between those two was found to be $1.2 million. This extra cost above and beyond materials, labor, land, and developer profit is attributed to development charges, sales taxes, land transfer taxes, delays in getting permits, and the various consultants, lawyers, accountants, and lobbyists that developers must hire to get approval.\n\nIn Vancouver, we're spending twice as much on bureaucrats as we do on all the other costs combined to build a home.More money goes to bureaucrats than to the carpenters, electricians, and plumbers who actually build the homes. To add insult to injury, those tradespeople can't even afford to live in the homes they build.\n\nWhat we need to do is slash the bureaucracy. I'm going to tell the mayors that they won't get federal infrastructure money unless they reduce development charges, speed up permits, and make housing more affordable. I also plan to remove the federal GST on new homes under a certain limit and encourage provinces to do the same.\n\nWe have so much land in Canada that we should have the most affordable housing in the world. It should be dirt cheap, given the amount of land we have; we just need to get the government out of the way. The same goes for our resource sector. Why are we still importing oil when we have the world's third-largest supply? Why can't we export our natural gas overseas?"
    }
}