{
    "question": "In what ways could Mike Johnson’s bare-majority speaker win, coming after President-elect Trump’s public backing, influence his ability to manage the House and set the Republican agenda?",
    "content": {
        "source_1": "WASHINGTON — Boosted by President-elect Donald Trump, Rep. Mike Johnson on Friday narrowly won his first full two-year term as speaker of the House, beating back a tiny right-wing rebellion that ultimately caved.\n\nJohnson, a Louisiana Republican and self-described “MAGA conservative,” secured the 218 votes he needed to be re-elected speaker on the first ballot. The Democratic leader, Rep. Hakeem Jeffries of New York, received 215 votes.\n\nIn the end, just one Republican, Rep. Thomas Massie, R-Ky., voted against Johnson.\n\nWith Johnson’s election, Republicans now officially control both chambers of Congress and they can begin to lay the groundwork for a second Trump administration and the ambitious legislative agenda that he has promised voters. Congress is slated to certify Trump’s election victory on Monday, Jan. 6, thefourth anniversaryof the Capitol attack.\n\nAnd Trump will take the oath of office at the Capitol on Jan. 20.\n\nA trio of conservative rebels initially voted to block Johnson from being re-elected speaker, defying Trump and threatening to paralyze the House, which cannot conduct any business until a speaker is elected.\n\nThey were among nine Republicans who publicly hesitated during the speaker’s vote — two initially voted for other candidates before flipping for Johnson, and six more withheld their votes during the first roll call. Those nine are notable as the GOP’s new rules package will require nine lawmakers to trigger a “motion to vacate” the speaker’s chair and remove Johnson — up from one member.\n\nMassie, who has railed for weeks against Johnson, cast his vote for Majority Whip Tom Emmer, R-Minn. And Rep. Ralph Norman, R-S.C., voted for Judiciary Chairman Jim Jordan, R-Ohio, while Rep. Keith Self, R-Texas, voted for Rep. Byron Donalds, R-Fla.\n\nBut that's when Trump began getting involved, making multiple phone calls personally urging the holdouts to rally behind Johnson to enact his agenda. In the middle of his golf game, Trump got on the line with GOP Rep. Nancy Mace who passed the phone to her South Carolina colleague Norman, the latter said.\n\n\"He said, 'Norman, we've got the most opportunity we've ever had, three houses ... the trifecta. You don't get that opportunity,'\" Norman recalled. \"And I said, 'Mr. President, I agree with you but I'm just hoping Mike has got the oomph to pull it off.\"\n\nLater, before calling the vote to a close, Johnson huddled in the cloakroom just off the floor with Norman and Self, as well as key conservative members who voted for him — including House Freedom Caucus Chairman Andy Harris, R-Md., and past Freedom Caucus Chairman Scott Perry, R-Pa.\n\nTrump again was put on the phone with the holdouts, Norman said. The president's message to the group was \"Get united!\" according to Johnson.\n\nThey emerged roughly 20 minutes later and Self and Norman switched their votes, both backing the speaker. Following Johnson's election and swearing in, he swore in all House members; new senators were sworn in earlier in the day.\n\n\"President Trump is probably the most powerful president in the modern era, maybe in all of American history,\" Johnson told reporters after the vote. \"And his voice and his influence is of singular importance.\n\n\"So, grateful to have his support. I’m humbled by it, and I think that was a big factor,\" the speaker added. \"And he wants us to unify as a as a conference, and to get the job done and we must.\"\n\nSelf said he flipped to yes after securing a commitment from Johnson that more conservatives, including Freedom Caucus members, will be included on the internal GOP team that is negotiating the \"reconciliation\" package that will serve as the vehicle to enact Trump's agenda.\n\n\"We needed to shore up the processes to make it more member-oriented for the Trump agenda,\" Self told reporters, \"because we needed more input from members like myself — not a chairman, not a leadership position — and I think that's what we have done.\"\n\nJust 15 months ago, Johnson, then the No. 7 GOP leader, rose from obscurity to become speaker following a conservative coup that toppled Speaker Kevin McCarthy, R-Calif. During the three weeks that followed, several of McCarthy’s top lieutenants — including Majority Leader Steve Scalise, R-La., and Majority Whip Tom Emmer, R-Minn. — vied to win the prized gavel but fell short.\n\nJohnson, a Trump ally with little name recognition and no known enemies, emerged from the dust victorious. During the past year, he struck deals with Democrats on spending, controversial Ukraine aid and the renewal of a powerful surveillance program known asFISA Section 702.\n\nBut it was precisely those bipartisan deals that infuriated some of his critics on the right. Massie, a libertarian-minded fiscal conservative from Kentucky, was the most vocal, vowing early on that he would oppose Johnson for speaker in Friday’s floor vote.\n\nJohnson had argued that a protracted House floor fight over the speaker’s gavel — similar to the15-round battleMcCarthy endured two years ago — would delay the House’s work on implementing Trump’s 2025 agenda.\n\nRep. Andy Barr, R-Ky.,pleaded with his colleagues to elect Johnson quickly.\n\n“I hope not. I hope not. I hope not,” Barr said when he was asked whether it would again take multiple ballots to elect a speaker. “Unity is our strength and our leverage. ... Do we really need to be spending multiple rounds fighting with one another?”\n\nAs they prepare for their GOP trifecta in Washington, Trump and congressional Republicans have laid out an ambitious agenda for 2025. They plan to use an arcane process known as budgetreconciliationto bypass Democrats and renew the expiring tax cuts enacted during Trump's first administration, as well as beef up border security, crack down on illegal immigration and tackle high energy costs.\n\n\"The path of prosperity has long been paved with policies that put America and Americans first, and that is what we will champion in the 119th Congress,\" a beaming Johnson said in a speech from the House dais after his election. \"We have a mandate and that was shown in the election cycle that people want an America First agenda.\"\n\nJohnson added that Republicans would \"cut the size and scope\" of the federal government, expedite new drilling permits, deport \"dangerous\" undocumented immigrants and complete Trump's border wall.\n\nThere is agrowing divisionwithin the GOP over strategy for advancing Trump's agenda, with some pushing for doing it all in one bill and others saying break it up and bag a victory on border security first before turning to taxes later in the year.\n\nJohnson, pressed Thursday by Fox Business host and former Trump economic adviser Larry Kudlow to pursue the one-bill strategy, kept his powder dry, saying there is a \"compelling case\" for it but that Republicans are still evaluating the path forward.\n\nIn addition to navigating a busy legislative agenda, the new Republican-controlled Senate will have to hold hearings and confirmation votes for Trump’s Cabinet nominees. Incoming Majority Leader John Thune, R-S.D., is threatening to make senators work Fridays — which they rarely do — to get their work done.\n\nAsked how long he expects that to last, Thune spokesman Ryan Wrasse told NBC News, “As long as it takes.”\n\nNow that Johnson has secured the gavel for the next two years, the coming days will be busy on Capitol Hill.\n\nCongress is scheduled to certify Trump's presidential election victory on Monday. And, later in the week, former President Jimmy Carter, who died Sunday at age 100, willlie in state in the Capitol Rotundafrom Tuesday afternoon until Thursday morning. Johnson and Thune are expected to speak at a congressional tribute shortly after Carter’s casket arrives.\n\nScott Wong is a senior congressional reporter for NBC News.\n\nSahil Kapur is a senior national political reporter for NBC News.\n\nKyle Stewart is a producer and off-air reporter covering Congress for NBC News, managing coverage of the House.\n\nSyedah Asghar is an associate producer covering the House for NBC News.\n\nJulie Tsirkin is a correspondent covering Capitol Hill.",
        "source_2": "Reporting by Bo Erickson, Richard Cowan and Katharine Jackson; Writing by Andy Sullivan; Editing by Scott Malone, Howard Goller and Alistair Bell\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nAndy covers politics and policy in Washington. His work has been cited in Supreme Court briefs, political attack ads and at least one Saturday Night Live skit.",
        "source_3": "Fox News contributors Byron York and Mollie Hemingway explain why House Speaker Mike Johnson's re-election is a 'triumph' on 'America Reports.'\n\nPresident-elect Trumpappears to have helped Speaker Mike Johnson, R-La., avoid a messy, drawn-out fight to lead the House of Representatives.\n\nTrump spoke by phone with both Reps. Ralph Norman, R-S.C., and Keith Self, R-Texas, after they had initially voted for people other than Johnson for speaker, two knowledgeable sources told Fox News Digital.\n\nSelf and Norman were seen disappearing into a side room with Johnson and others after the roll call vote was complete, but before the vote was formally closed.\n\nThey emerged minutes later and announced they would bothvote for Johnson– cementing the Louisiana Republican's victory.\n\nJOHNSON BLASTS DEM ACCUSATIONS HE VOWED TO END OBAMACARE AS 'DISHONEST'\n\nRep Keith Self, left, President-elect Donald Trump, center, and Rep Ralph Norman, right(Getty)\n\nSelf then confirmed to reporters that he had spoken with Trump by phone multiple times on Friday.\n\n\"I talked to him a couple of times today,\" Self said. \"We had a lively discussion.\"\n\nSelf did not elaborate much further on the contents of the discussion.\n\nBut the two people who spoke with Fox News Digital said Rep. Nancy Mace, R-S.C., connected Trump with Self and Norman by phone after they voted against Johnson.\n\nREPUBLICANS GIVE DETAILS FROM CLOSED-DOOR MEETINGS WITH DOGE'S MUSK, RAMASWAMY\n\nTwo people said Rep. Nancy Mace connected the holdouts with Trump.(Getty Images)\n\nMace would not comment, but Fox News Digital saw her and Johnson share a hug on the House floor after they and others were in the side room with the holdouts.\n\nShe was also seen in intense talks with Norman off the House floor earlier.\n\nNorman also later confirmed to reporters that he spoke with Trump on Friday.\n\n\"He just made his point about how Mike is the only one who could get elected,\" Norman said, adding that Trump did not change his vote but rather a \"commitment that things are gonna change\" from Johnson.\n\nJohnson won the House speakership in the first round of voting, after it initially appeared he was poised to lose.\n\nRep. Keith Self confirmed he spoke with Trump.(Tom Williams/CQ-Roll Call, Inc via Getty Images)\n\nSelf, Norman and Rep. Thomas Massie, R-Ky., each voted for people other than Johnson, appearing to put the speaker's gavel out of reach.\n\nBut House leaders did not formally close the vote while figuring out a path forward. Meanwhile, GOP lawmakers were told to be on the House floor immediately in preparation for a second vote.\n\nThat second vote did not occur, however, and Johnson was sworn in as speaker on Friday afternoon.\n\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\n\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}