{
    "question": "How should the Las Vegas Cybertruck explosion be interpreted in light of the suspect’s suicide before the blast, his active-duty military status and recent personal upheaval, and the still-unproven similarities to the New Orleans attack?",
    "content": {
        "source_1": "The explosion occurred outside the Trump International Las Vegas Hotel.\n\nMatthew Livelsberger -- the driver ofthe Tesla Cybertruck that exploded on New Year's Dayoutside the Trump International Las Vegas Hotel -- shared personal and political \"grievances\" in two letters found on a phone in the vehicle and called the attack a \"wake up call,\" authorities said Friday.\n\nLivelsberger, an active-duty Army soldier, said the country was being led by the \"weak\" and those out to \"enrich themselves,\" while also claiming the incident was not meant as a terrorist attack, according to excerpts of the two letters shared by the Las Vegas Metropolitan Police Department.\n\n\"I know everyone is very eager to try to understand and be able to explain what happened,\" Las Vegas Assistant Sheriff Dori Koren said during a press briefing on Friday. \"We still have a large volume of data to go through, a lot of content to go through.\"\n\nThe department released the two letters to the public following the press briefing.\n\n\"You'll see that he actually calls it a stunt, in one of these documents that we're going to release to you, that he was trying to get the attention of the American people because he was upset about a number of different things,\" Sheriff Kevin McMahill of the Las Vegas Metropolitan Police Department said during Friday's briefing when asked about the suspect's political views. \"But I'll let those writings speak for themselves.\"\n\nIn one of the letters police say were found on his phone, Livelsberger expressed support for Donald Trump and the president-elect's allies, Elon Musk and Robert F. Kennedy Jr. He also expressed disdain for diversity, equity and inclusion initiatives and income inequality and expressed a concern about homelessness, according to the letters.\n\nLivelsberger died from a self-inflicted gunshot wound prior to the blast, the Clark County coroner confirmed Thursday evening. No one else was seriously hurt, though seven bystanders sustained minor injuries, officials said.\n\nThe evidence shows Livelsberger \"thoughtfully prepared\" and acted alone in the incident, Spencer Evans, special agent in charge for the FBI's Las Vegas division, said during Friday's press briefing. Livelsberger was not on the FBI's radar prior to the incident, Evans said.\n\n\"Although this incident is more public and more sensational than usual, it ultimately appears to be a tragic case of suicide involving a heavily decorated combat veteran who was struggling with PTSD and other issues,\" Evans said.\n\nAuthorities are also looking into a letter purportedly sent by Livelsberger and shared by the military-themed \"Shawn Ryan Show\" podcast on Friday. That information was sent to the FBI following the attack, Evans confirmed.\n\n\"We still have not conclusively determined that that's from the subject, but feel confident, based on evidence that we're uncovering on his devices, that that was, in fact, from Livelsberger,\" Evans said.\n\nIn the Cybertruck, officials found credit and identification cards in Livelsberger's name, evidence he owned the weapons found in the destroyed vehicle and identified tattoos that appeared to match Livelsberger's body, however, severe physical injuries slowed the identification process.\n\nThe Clark County coroner ultimately identified Livelsberger -- of Colorado Springs, Colorado -- as the driver on Thursday. His cause of death was a self-inflicted intraoral gunshot wound.\n\nLivelsberger was found with a gun at his feet. Two firearms -- one handgun and one rifle -- were found in the vehicle \"burnt beyond recognition,\" McMahill said.\n\nBoth weapons were purchased legally on Monday, he added.\n\nTwo phones were recovered from the vehicle, including one containing the two letters, Koren said. Investigators have been unable to access the other phone at this time, he said.\n\nIt is unclear why Livelsberger chose a Tesla or the route he took, authorities said Friday.\n\nLivelsberger rented the Tesla vehicle on Saturday in Denver via the Turo app, before driving to Las Vegas through cities in Colorado, New Mexico and Arizona. His progress was tracked through Tesla charging stations, officials said.\n\nThe vehicle first pulled into the Trump International Las Vegas Hotel valet area just after 7:30 a.m. Wednesday, officials said. It then left the area, driving along Las Vegas Boulevard, before returning to the valet area at about 8:39 a.m., exploding 17 seconds after its arrival.\n\nLivelsberger served as a Green Beret in the Army and was on approved leave from serving in Germany at the time of his death, a U.S. Army spokesperson said Thursday.\n\nHe received extensive decorations in combat, including the Bronze Star with a \"V\" device for valor, indicating heroism under fire. Livelsberger received four more standard Bronze Star medals, according to Army records. He also earned the Afghanistan Campaign Medal with three stars. Each star represents service in a separate campaign in Afghanistan.\n\nLivelsberger had been receiving mental health assistance over the last year, a U.S. official confirmed Friday.\n\nAnother U.S. official confirmed that officials thought Livelsberger was stable enough to go home for Christmas and his leave was approved.\n\nThe Department of Defense has turned over Livelsberger's medical records to local law enforcement, Pentagon press secretary Sabrina Singh told reporters during a briefing on Friday.\n\n\"I just don't have more details to share,\" she added, when asked aboutreporting from CNNthat the suspect had been diagnosed with depression last year.\n\nSingh noted that service members are encouraged to seek help with any mental health issues.\n\nThe Las Vegas incident is not believed to have any direct connection to the New Year's Day truck attack in New Orleans that killed 14 people -- as well as the suspect -- and injured 35 others, according to the FBI. The truck used in the New Orleans attack was also rented using the Turo app, officials said.\n\nEvans reiterated Friday that there is no evidence that the two events are connected, saying there are \"coincidental similarities\" between them -- including that both drivers were in the military, rented vehicles through the same service and stayed in an Airbnb.\n\nThere is no evidence at this time that the two drivers had any overlap even though both served in Afghanistan, Singh also said Friday.\n\nLivelsberger was a supporter of Trump, an official briefed on the probe told ABC News. His wife, who investigators spoke to in Colorado Springs, said he had been out of the house since around Christmas after a dispute over allegations of infidelity, the official said.\n\nHis wife told officials she did not believe Livelsberger would want to hurt anyone, the official told ABC News.\n\nLivelsberger is believed to have told the person he rented the truck from that he was going camping at the Grand Canyon, the official told ABC News.\n\nInvestigators are still looking to determine how the items in the truck were detonated, but with the contents of the vehicle so badly burned, it may be a slow process, according to the official.\n\nThe sheriff said Musk, Tesla's CEO, helped the investigation by having the truck unlocked after it auto-locked in the blast and by giving investigators video of the suspect at charging stations along its route from Colorado to Las Vegas.\n\nMcMahill said police believe the explosion was an \"isolated incident\" and that \"there is no further threat to the community.\"\n\nVideo played at Thursday's Las Vegas news conference showed a load of fireworks-style mortars, gasoline cans and camping fuel canisters in the back of the truck.\n\nIf you are struggling with thoughts of suicide or worried about a friend or loved one, call or text the Suicide& Crisis Lifeline at 988 for free, confidential emotional support 24 hours a day, seven days a week.",
        "source_2": "Alicia Arlett and Matthew Livelsberger were together from 2018-2021. In this 2019  photo, they are on a government trip for \"spy school\" Arritt told The Denver Gazette.\n\nOn the morning of Dec. 29, 2024, Matthew Livelsberger texted Alicia Arritt, a former girlfriend, out of the blue to tell her about the Cybertruck he had rented.\n\nOn the morning of Dec. 29, 2024, Las Vegas explosion suspect Matthew Livelsberger started texting an old girlfriend about the Cybertruck he had rented. He was texting from Denver and continued to communicate with Alicia Arritt off and on until New Year's Eve.\n\nFor three days from Dec. 29-Dec. 31, Cybertruck explosion suspect Matthew Livelsberger texted Alicia Arritt, who had not heard from him in three years since a painful breakup. She said he was in a playful mood, sending her messages about the vehicle.\n\nAlicia Arlett and Matthew Livelsberger were together from 2018-2021. In this 2019  photo, they are on a government trip for \"spy school\" Arritt told The Denver Gazette.\n\nOn the morning of Dec. 29, 2024, Matthew Livelsberger texted Alicia Arritt, a former girlfriend, out of the blue to tell her about the Cybertruck he had rented.\n\nOn the morning of Dec. 29, 2024, Las Vegas explosion suspect Matthew Livelsberger started texting an old girlfriend about the Cybertruck he had rented. He was texting from Denver and continued to communicate with Alicia Arritt off and on until New Year's Eve.\n\nFor three days from Dec. 29-Dec. 31, Cybertruck explosion suspect Matthew Livelsberger texted Alicia Arritt, who had not heard from him in three years since a painful breakup. She said he was in a playful mood, sending her messages about the vehicle.\n\nAlicia Arritt had no inkling that her ex-boyfriend was planning to blow up one of the swankiest hotels on the Las Vegas strip.\n\nIn the days before the explosion and apparent suicide, Matthew Livelsberger’s texts to her were playful, almost like a kid with a new toy.\n\n“I rented a Tesla Cybertruck. It’s the s***,” he wrote her at 9 a.m. on Sunday from Denver. He continued to text her until New Year’s Eve, sending photos and music videos of the vehicle.\n\n\"I feel like Batman or halo,\" he texted at 9:07 a.m. on Sunday.\n\nIt sounded like conversation between old friends, but, according to Arritt, it was strange to hear from him out of the blue. The two had stopped talking and moved on after a painful 2021 breakup.\n\nLivelsberger married and had a baby daughter. Arritt is a single mother who works 12-hour shifts.\n\nIt's been reported that Livelsberger left his Colorado Springs home the day after Christmas after an argument with his wife. Neighbors said they hadn't seen him for days.\n\n\"I'm building drones in my new position,\" he wrote. \"You would love it.\"\n\n“How fast is it?” Arritt asked of the Cybertruck. He texted back: “Ungodly.”\n\nAuthorities in Las Vegas on Thursday said Livelsberger, a Green Beret, shot himself inside a Tesla Cybertruck on New Year's Day seconds before the vehicle exploded in front of President-elect Donald Trump's hotel in Las Vegas.\n\nLivelsberger was a Colorado Springs resident who had spent the majority of his 19-year military career at Fort Carson and on assignment in Germany, according to new information from the U.S. Army and the Las Vegas Metropolitan Police Department.\n\n“I just want everyone to know that Matt was the kindest man I ever knew,” Arritt told The Denver Gazette. “He got me through a difficult time.”\n\nWhen Livelsberger’s mother became ill, he bought her a house. He had two back surgeries from his days as a paratrooper.\n\nArritt said Livelsberger was an honorable man who loved his country. She does not understand why he did it, she said.\n\nPolitically, she knew him as a conservative, but she wondered why he would pack explosives in a truck created by Elon Musk and park it in front of a hotel owned by the Republican president-elect.\n\nOne neighbor of Livelsberger in their northeast Colorado Springs townhome complex was shocked to learn the bombing suspect was him.\n\nCindy Helwig said she's known Livelsberger and his current wife, who just recently had a baby, for two years.\n\n\"He seemed like a normal guy,” she said after talking to other neighbors on Thursday morning. “His wife is awesome, too. I never expected anything like that. I would never have thought it would have been him.”\n\nArritt cried when she realized investigators could only identify him by the World War II plane tattoo on his right arm.\n\nThe two met in 2018 after Livelsberger and his first wife, Sara, divorced. They had military service in common. Arritt was an Army nurse at one time, stationed at Landstuhl Regional Medical Center in Germany and he was in Special Forces.\n\nIn one photo taken on a mountain hike, she has a wildflower in her hair and he’s standing behind her smiling. The picture was taken during a government trip for “spy school” in Washington state.\n\nArritt said that Livelsberger’s behavior changed in 2019 after he returned from a tour in the Middle East with a traumatic brain injury. He became isolated. She believes that the depressive symptoms he showed went untreated because “it’s not acceptable to seek treatment when someone is in Special Forces.”\n\nThe relationship did not last, partly because “he wanted to focus on his career,” Arritt, of Colorado Springs, said in a phone interview on Thursday.\n\nOn Wednesday, New Year’s Day evening, the FBI knocked on Arritt’s door. They had tracked her from the text messages they found on Livelsberger’s account. She was at work.\n\nAgents circled back on Thursday morning and arranged to meet her at around 9.\n\nShe showed them that, on Dec. 29, Livelsberger sent photos of the gold-hued Tesla Cybertruck he rented.\n\n“It matches my Kobe 2 shoes I had when I was little,” he wrote. “Google them.”\n\nThere was no clue in the sporadic text check-ins that Livelsberger was planning to blow up the hotel and possibly end his life.\n\nThe FBI told Arritt that she was not the only old girlfriend Livelsberger contacted in those last few days.\n\n“I don’t know if I could have stopped him,\" she said.\n\nThe Gazette's Emily Moyer contributed to this story.\n\nThe motive for why career Army man Matthew Livelsberger, 37, apparently committed suicide before detonating a rented Tesla Cybertruck in front…\n\nYour browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:\n\nWelcome to the Denver GazetteSubscribe to stay up to date with all things Colorado.",
        "source_3": "Published:14:34 BST, 2 January 2025|Updated:13:48 BST, 3 January 2025\n\nTeslaCybertruck bomber Matthew Livelsberger is a long-serving married Green Beret who was on leave from active duty when he carried out the attack outsideDonald Trump'sLas Vegashotel.\n\nLivelsberger, 37, was identified by law enforcement sources as the bomber in Wednesday's attack, which left seven wounded. The electric vehicle exploded about 15 seconds after the driver pulled up in front of the hotel's entrance.\n\nThe blast was caused by 'a bomb carried in the bed of the rented Cybertruck' or 'very large fireworks', according to Tesla CEOElon Musk.\n\nLivelsberger died in the bombing. He lived in Colorado Springs and was an active member of the Army. He previously received a Meritorious Honor Award for work benefiting the US Embassy in Tajikistan.\n\nLiveslberger was profiled by a local newspaper inOhiofor his work with the military inAfghanistan.\n\nHe grew up in Ohio and was married tosocial worker Sara Livelsberger, who in the lead up to the 2016electionshared a slew ofFacebookposts spouting anti-Trump rhetoric.\n\nAccording to CBS News, Liveslberger was on break from duty inGermanywhen he carried out the attack. His wife hadn't heard from him from several days.\n\nProperty records reveal the couple purchased a home inColoradoSprings together in 2015.\n\nHowever, police have linked Livelsberger to several addresses throughout the city - including a different townhouse that was raided by the FBI overnight.\n\nMatthew Livelsberger, 37, was identified as the bomber in the attack that left seven wounded. He is pictured in Afghanistan in a profile by a local newspaper in the Ohio town where he grew up\n\nFew details have been made public about the alleged bomber's personal life. He is pictured with his ex-wife Sara. Livelsberger remarried and had a baby after the couple's divorce\n\nLivelsberger, 37, was identified by law enforcement sources\n\nLivelsberger is suspected of renting the Cybertruck in Colorado Springs and driving it across the border toNevadaon Wednesday morning to carry out his attack.\n\nLaw enforcement sources have also revealed that Livelsberger previously served at the same military base asNew Orleansterrorist Shamsud Din Jabbar, who on Wednesday drove a rented truck into a crowd of New Year revelers, killing at least 15 people and wounding dozens. Police have not confirmed if the pair were known to each other.\n\nJabbar served at Fort Liberty in North Carolina, previously known as Fort Bragg. Livelsberger previously lived at an address close to the base, but investigators have yet to confirm the location of the base the pair have in common.\n\nLivelsberger has served in the Army for 19 years, the majority of which was spent in the Special Forces unit.\n\nThe suspected terrorist seemingly climbed the ranks throughout his time with the unit, having started off working as a SF Communications Specialist in 2006.\n\nWhile holding that position, Livelsberger said on his Linkedin that he also worked on a nearly one-year contract with General Dynamics Corp, a firm specializing in aerospace and defense.\n\nHe alleges he 'engineered and fielded the first mobile standoff hyperspectral imaging \"Lightguard Minotaur\" system' during his time at General Dynamics Corp.\n\nGeneral Dynamics told DailyMail.com they have no record of employing Livelsberger.\n\nLivelsberger in 2015 moved into an intelligence and operations role within the SF and in 2016 received the Department of State Meritorious Honor Award.\n\nHe was recognized by the US Ambassador for 'interagency contributions that resulted in increased interoperability and efficiency while serving as the Operations Sergeant at Special Operations Command Forward- Central Asian States (SOCFWD-CAS) within US Embassy Dushanbe', Livelsberger wrote on LinkedIn.\n\nHe became a SF operations manager and team sergeant in February 2023 and moved into his remote and autonomous systems role in November last year.\n\nHis LinkedIn profile also touts proficiency in French and certifications in unmanned aircraft systems, as well as a Project Director qualification.\n\nLivelsberg is seen in another picture from his deployment\n\nThe Tesla cybertruck exploded about 15 seconds after the driver pulled up in front of the hotel's entrance. The blast was caused by 'a bomb carried in the bed of the rented Cybertruck' or 'very large fireworks'\n\nLivelsberger (pictured) - who died in the bombing - grew up in Colorado Springs and was an active member of the Army. He previously received a Meritorious Honor Award for work benefiting the US Embassy in Tajikistan\n\nLivelsberger has limited social media presence, but his 'registered Democrat' ex-wife Sara was very active on Facebook in 2015 and 2016\n\nShe also shared a screenshot of a tweet posted by Trump in 2015, writing that he 'needs to spend less time on Twitter posting and deleting tweets, and more time focusing on maybe...a god d**m platform of some sort?'\n\nAnother post showed her wearing a t-shirt that said 'Girls just want to have FUN-damental Rights', suggesting she takes a pro-choice stance on abortion\n\nLivelsberger has limited social media presence, but his ex-wife Sara was very active on Facebook in 2015 and 2016.\n\nSara, who according to her profile studied political science and social work, revealed that she was a 'registered Democrat' in a post shared in May 2016.\n\nSharing a photo of a sign featuring a cartoon image of Trump that read 'stop bigotry', Sara wrote that she 'can't wait to slap this baby on my truck'.\n\nShe also shared a screenshot of a tweet posted by Trump in 2015, writing that he 'needs to spend less time on Twitter posting and deleting tweets, and more time focusing on maybe...a god d**m platform of some sort?'\n\nAnother post showed her wearing a t-shirt that said 'Girls just want to have FUN-damental Rights', suggesting she takes a pro-choice stance on abortion.\n\nSara, whose hometown is listed as Playa del Carmen, Mexico, has not posted on Facebook since May 2016.\n\nShe also has not been tied to the Las Vegas bombing.\n\nThe Tesla cybertruck arrived inLas Vegasat 7.30am Wednesday, Las Vegas Metropolitan Police Sheriff Kevin McMahill said in a press conference.\n\nLivelsberger is suspected of renting the Tesla Cybertruck in Colorado Springs, via the Turo app, and driving it across the border to Nevada on Wednesday morning - where he carried out the attack (pictured)\n\nSurveillance footage showed the truck sitting outside the front entrance, appearing to have nothing wrong with it. Seconds later, the entire car explodes, its roof blowing up first before the truck goes flying\n\nThe explosion took place at 8.40am in the hotel's valet area.Surveillance footageshowed the truck sitting outside the front entrance. Seconds later, the entire $80,000 car blew up in a fiery blaze - with its roof going up in flames first.\n\nDebris smoked as it pinged off the pavement and sparks which looked like fireworks could be seen lighting up the black cloud of smoke emitting from the vehicle.\n\nA tumble of charred fireworks mortars, cannisters and other explosive devices were found crowded into the back of the pickup.\n\nOfficials are still exploring how the explosives were detonated, but sources with knowledge of the investigation have expressed that it was likely controlled by the driver.\n\nLivelsberger was the sole fatality in the attack, and authorities largely credit Musk's hulking stainless steel truck with preventing further damage because it was able tocontain much of the explosion.\n\nNone of the nearby windows of the hotel were damaged despite the violence of the blast.\n\nAccording to the KOAA, law enforcement officers wearing tactical gear and travelling in armored vehicles arrived at one of Livelsberger's Colorado Springs properties Wednesday night.\n\nNeighbors were 'escorted away' from the townhome complex in the Stetson Hills neighborhood as investigators carried out their search. Police have assured the public they do not suspect there is any ongoing threat to the community.\n\nHours before the attack in Las Vegas, Shamsud DinJabbar drove an electric vehicle into crowds in New Orleans, killing 15 pedestrians and injuring dozens more.\n\nSoldier Matthew Livelsberger is the man who filled the truck with explosives and fuel before driving it to the Trump Hotel in Las Vegas and setting them off on Wednesday morning\n\nPolice have released a series of photographs from inside the Cybertruck which blew up outside Trump International Hotel in Las Vegas, revealing an arsenal of explosives\n\nFireworks, gas tanks and camping fuel were in the bed of the car, and were likely connected to a detonation system controlled by the driver\n\nLaw enforcement sources have since revealed the cars used in both attacks were rented through Turo, and they were both EVs, prompting concerns they are linked.\n\nTuro is akin to Airbnb for cars and lets people hire strangers' vehicles for a daily rate.\n\nPolice revealed on Wednesday afternoon that they are currently investigating potential links and have not ruled anything out yet.\n\n'Do I think it's a coincidence? I don't know,' Sheriff Kevin McMahill said. 'We're absolutely looking into any connections to New Orleans.'\n\nA spokesperson for Turo later issued a statement describing the company's heartbreak 'by the violence perpetrated in New Orleans and Las Vegas, and our prayers are with the victims and families.\n\n'We are actively partnering with law enforcement authorities as they investigate both incidents.\n\n'We do not believe that either renter involved in the Las Vegas and New Orleans attacks had a criminal background that would have identified them as a security threat.'\n\nTuro added: 'We remain committed to maintaining the highest standards in risk management, thanks to our world-class trust and safety technologies and teams that include experienced former law enforcement professionals.'\n\nFireworks, gas tanks and camping fuel were in the bed of the car, and were likely connected to a detonation system controlled by the driver\n\nA Cybertruck - made by Trump ally Elon Musk's company Tesla - was seen in a fiery blaze outside the front revolving doors of the Trump International Hotel on Wednesday\n\nOfficers have also considered that Livelsberger may have purposefully chosen to use a car owned by Elon Musk to send a message - given the Tesla billionaire's newfound friendship with President-electDonald Trump.\n\n'It's a Tesla truck, we knowElon Muskis working with President-elect Trump and it's the Trump hotel, so there's obviously something to look at,' McMahill said.\n\nBy Wednesday afternoon, Musk revealed the explosion wascaused by 'a bomb carried in the bed of the rented Cybertruck' or 'very large fireworks.'\n\nHe said the explosion was not caused by or related to the vehicle itself, and it's understood the unnamed driver had rented the truck using Turo.\n\n'Law enforcement currently believes it was most likely intentional,' he added.\n\n'Both this Cybertruck and the F-150 suicide bomb in New Orleans were rented from Turo. Perhaps they are linked in some way.'\n\nMusk said 'Tesla vehicles transmit their state of health continuously,' meaning his team were able to check whether anything was wrong with the car's mechanics prior to the explosion.\n\nMcMahill thanked Musk for his efforts in assisting the investigation, turning over data to authorities along with access to CCTV from Tesla charging stations across the nation.\n\nTrump has also broken his silence on the explosion outside his Las Vegas hotel,vowing to rid America of 'violent scum.' The president-elect took to his social media platform, Truth Social, to excoriate the security and justice establishment.\n\nHe wrote in a post: 'Our Country is a disaster, a laughing stock all over the World! This is what happens when you have OPEN BORDERS, with weak, ineffective, and virtually nonexistent leadership.\n\n'The DOJ,FBI, andDemocratstate and local prosecutors have not done their job. They are incompetent and corrupt, having spent all of their waking hours unlawfully attacking their political opponent, ME, rather than focusing on protecting Americans from the outside and inside violent SCUM that has infiltrated all aspects of our government, and our Nation itself.\n\n'Democrats should be ashamed of themselves for allowing this to happen to our Country. The CIA must get involved, NOW, before it is too late. The USA is breaking down - A violent erosion of Safety, National Security, and Democracy is taking place all across our Nation.\n\n'Only strength and powerful leadership will stop it. See you on January 20th. MAKE AMERICA GREAT AGAIN!'\n\nThe 37-year-old man reportedly has a military background and served at the same base as Shamsud Din Jabbar, 42, (pictured), who fatally ran down 15 people in a rented car in New Orleans in the early hours of New Years Day\n\nThe FBI has said officials 'do not believe that Jabbar was solely responsible' for the New Orleans attack.\n\n'We're aggressively running down every lead, including those of his known associates,' Alethea Duncan, an assistant special agent with the FBI's New Orleans field office, said in at a news conference Wednesday.'\n\nLaw enforcement officials in Texas searched a residence in Houston on Wednesday that they believe could be connected to Jabbar.\n\n'FBI Houston and the Harris County Sheriff’s Office are continuing a court-authorized search of a location near the intersection of Hugh Road and Crescent Peak Drive,' the agency said in a statement.\n\nAs of Wednesday night, no arrests had been made at the residence.\n\nAuthorities previously revealed that the rented truck was listed on Turo by a 42-year-old man who lives in Houston, who has been contacted by investigators. It is unclear if the Houston property that was searched Wednesday night was linked to this man.\n\nThe FBI's New Orleans field office is also 'conducting a number of court authorized search warrants in New Orleans and other states'.\n\nThe driver who plowed into pedestrians celebrating the New Year in New Orleans killing at least 10 people and injuring dozens is dead following a shootout with police\n\nSuspect Jabbar is said to have made a series of videos that is being reviewed by law enforcement.\n\nJabbar was killed by police after he slammed a truck into pedestrians celebrating the New Year, exited the vehicle, and started firing.\n\nInvestigators recovered a handgun and an AR-style rifle after the shootout, law enforcement officials said.\n\nInvestigators are probing a theory Jabbar rented a nearby property on Airbnb in St. Roch for his base before carrying out the attack.\n\nExclusiveDailyMail.com photographsshow the moment the FBI removed bomb making materials from the two-bedroom and two-bathroom property close to the French Quarter.\n\nJabbar is also said to have made a series of videos that are being reviewed by law enforcement. Authorities believe that the videos were made as he drove from Texas to Louisiana, although the timing is unclear.\n\nMultiple officials told CNN that the recordings appear to have been made while driving at night and the suspect is not visible in them.\n\nCNN reported that the recordings make reference to his divorce and that he planned on gathering his family together for a fake celebration so he could kill them.\n\nThe suspect is also said to havetalked about how he joined ISIS,and spoke of dreams that he had about joining the terrorist group.\n\nThere were no overt links to ISIS in the Las Vegas attack as there were in New Orleans, but detectives have not ruled out any motive.\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nBy posting your comment you agree to ourhouse rules.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with ourPrivacy Policy."
    }
}