{
    "question": "How might the New Year’s Day vehicle-ramming in New Orleans, which killed 14 and ended in a fatal shootout with police, affect the way cities plan and secure public celebrations?",
    "content": {
        "source_1": "A day after 14 people were killed in an attack in the French Quarter of New Orleans, chilling details began to emerge about the man who plowed a pickup into revelers on Bourbon Street in what the FBI is calling \"an act of terrorism.\"\n\nAuthorities sayShamsud-Din Jabbar, 42,rented a truckand rammed it into crowds celebrating New Year's in the bustling tourist district, killing at least 14 and injuring dozens more before he was shot dead in a gunfight with law enforcement. An Islamic State flag was recovered from the truck, which also carried weapons and what appeared to be an improvised explosive device.\n\nThe FBI said Jabbar, a U.S. citizen born in Texas, posted videos on social media shortly before the attack saying he was inspired by ISIS and decided to attempt the mass killing in New Orleans after initially planning to harm his family and friends. The U.S. Army veteran had grown increasingly withdrawn and devout in his Muslim faith, according to family and friends.\n\nJabbar was twice divorced, according to court records. In 2020, during his second divorce, a judge granted Jabbar's ex-wife a restraining order and Jabbar wrote about severe financial difficulties despite holding a $120,000-a-year job at Deloitte, records say.\n\nDeputy Assistant FBI Director Christopher Raia on Thursday said investigators are focusing on Jabbar's \"path to radicalization\" and what led him to carry out the deadly attack on New Year's Day.\n\nLive updates:Search intensifies for other suspects in New Orleans truck attack\n\nRaia said Jabbar posted videos on Facebook as he headed to New Orleans in which he \"proclaimed his support for ISIS.\"\n\nRaia said there were five videos posted on Jabbar’s Facebook account before the attack. In the first video, Jabbar said he originally planned “to harm his family and friends” but was “concerned the news headlines would not focus on the ‘war between the believers and the disbelievers,’” Raia said.\n\nJabbar stated he had joined ISIS “before this summer” and also provided a will and testament, Raia said.\n\n\"Let me be very clear about this point: This was an act of terrorism,” Raia said. “It was premeditated and an evil act.\"\n\nRaia added that the attack was \"100% inspired by ISIS\" and said investigators are digging through more of Jabbar's social media accounts and interviewing more of his relatives and friends.\n\nOne of Jabbar's neighbors in northern Houston said he saw the Army veteran loading up a white pickup truck with \"hand-held items\" on the morning of New Year's Eve.It did not raise his suspicions because Jabbar was a quiet, calm and “non-violent” neighbor who moved into the predominantly Muslim neighborhood more than a year ago, the man, who asked not to be named for fear of jeopardizing his family's safety, told USA TODAY Network reporters.“He was quiet. Not (a) bother (to) anybody. Not touching anybody. I have a family, so I would have been afraid for that type of person to be here,” the neighbor said.\n\nJabbar had recently told him he planned on moving to Louisiana.\n\nOne of Jabbar's relatives, who did not wish to be identified citing safety concerns, told USA TODAY, “I don’t think he did this of his own free will.”\n\n“I could never see him doing that,” said the family member. “Maybe he just went… If he did do he may have just went crazy. I just don’t see it happening.”\n\nThe family member said the Jabbar family is “doing all right,” but they are still in shock over the events in New Orleans.\n\nFriends of Jabbar described the Army veteran as a kind man and said there were little signs that he would be capable of carrying out such a deadly attack.\n\nChris Pousson first met Jabbar at a middle school in Beaumont, Texas. The pair were friends through high school but lost contact when Jabbar enlisted in the Army and he joined the Air Force,Pousson told NBC News. He described Jabbar as \"very quiet, very reserved, smart, articulate.\"\n\nThe two reconnected in 2017 and 2018, and Pousson kept up with his old friend on social media, he told the outlet. Jabbar's posts on social media grew increasingly focused on his faith. \"It was always positive — peace be with you, uplifting type of stuff,\" Pousson told the outlet, adding: \"What happened today was a complete 180 of anything I ever knew about him.\"\n\nMarilyn Bradford, a woman who lived above Jabbar in an apartment complex in Houston, said he would help her carry her groceries and had seen him spending time with his children on the weekends. \"He was no terrorist to me,\" she toldthe New York Times.\n\nDwayne Marsh, who is married to Jabbar's ex-wife,told the New York TimesJabbar had been acting increasingly erratic in recent months, causing Marsh and his wife to stop allowing the two daughters she shared with Jabbar to see him.\n\nMarsh told the outlet Jabbar was “being all crazy, cutting his hair” after converting to Islam, the Times reported.\n\nJabbar's brother, Abdur Jabbar,told the New York Timeshe had last spoken with his brother two weeks ago and that he didn't mention New Orleans or any intention of carrying out an attack.\n\nHe said they were brought up Christian but Jabbar converted to Islam long ago. “As far as I know he was a Muslim for most of his life,” the younger Jabbar told the New York Times. “What he did does not represent Islam. This is more some type of radicalization, not religion.”\n\nJabbar's street as well as the surrounding area has a large Muslim and Middle Eastern presence. Houston itself has the largest Muslim population in Texas and in the Southern U.S.\n\nRamadan Khairallah, who is a manager at Ramadan Halal Meat Market a few miles from Jabbar's residence, told USA TODAY reporters he is not worried about backlash hurting the community.\n\n\"I'm not concerned to be honest with you,\" Khairallah said.\n\nThere have been anti-Muslim incidents in the area in the past, including at some nearby Halal stores and other businesses, he said. But it’s not something he worries about after the attack in New Orleans. \"The people that are around us and stuff, there's nothing to be concerned about from them,” Khairallah said. “Nothing but positive energy in here.\"\n\nJabbar enlisted in the Army in 2007, at the height of the wars in Iraq and Afghanistan when more than 100,000 U.S. troops had deployed to war zones, according to the Army and a U.S. official who spoke on condition of anonymity.\n\nHis initial specialty was a human resource specialist, a job whose duties included payroll, mail delivery and processing medals. He became an information technology specialist, a common transition in the Army. As an IT solider, he would have been a trained as a computer-system troubleshooter.\n\nJabbar deployed to Afghanistan in Feb. 2009. Subsequently, he was posted at bases including Joint Base Elmendorf-Richardson in Alaska, and what was then Fort Bragg in North Carolina.\n\nAfter his deployment, Jabbar joined the Army Reserve and continued serving as an IT specialist until July 2020. He left the Army as a staff sergeant, and received an honorable discharge, according to the official.\n\nJabbar in 2015 pled guilty to a drunk driving charge after prosecutors say he was driving impaired inside one of the Army's largest military instillations, court records say.\n\nAccording to a charging document, Jabbar was found in November 2014 driving over the legal limit and with an open container of alcohol within the Fort Liberty Military Reservation, formerly known as Fort Bragg.\n\nFort Liberty, just west of Fayetteville, North Carolina, has about 55,000 military service members and employs about 12,000 civilian personnel,according to an Army website.\n\nHe pleaded guilty to a Level 5 DWI charge in May 2015, records say. He was placed under probation, paid a $200 fine, surrendered his driver's license, had to complete 24 hours worth of community service and participate in an alcohol rehabilitation program, according to court records.\n\nIn 2005, he was charged with driving with an invalid license in Texas, records say. Three years earlier, he was charged with a property theft misdemeanor.\n\nJabbar graduated from Georgia State University with a degree in computer information systems, according to the university.\n\nHe attended the 4-year university located in Atlanta from 2015 to 2017.\n\nCourt records in Texas show Jabbar, who has been married and divorced twice, had written of financial troubles during his legal ups and downs with wives. As he negotiated his second divorce two years ago, his attorney attached records to court files indicating Jabbar’s finances were limited.\n\n“Time is of the essence. I cannot afford the house payment. It is past due in excess of $27,000 and in danger of foreclosure if we delay settling the divorce,” Jabbar wrote to his attorney in January 2022.\n\nJabbar proposed dividing the equity from the sale of the couple's home in Fresno, Texas. He also mentioned two real estate holding companies he formed that were worth $0, he wrote. He proposed $1,100 child support and mentioned his two children.\n\nLater, a detailed summary of Jabbar’s finances listed a paystub from Deloitte, the global accounting firm. He listed a gross salary of $120,000 per year. He listed credit card, student loan and other debts in excess of $41,000.\n\nJabbar's second wife filed a motion for a temporary restraining order in 2020, records show.\n\nDeloitte said in a statement that Jabbar filled a \"staff-level role\" and the company is \"shocked\" to learn he had \"any association with our firm.\"\n\n\"Like everyone, we are outraged by this shameful and senseless act of violence and are doing all we can to assist authorities in their investigation.”\n\nJabbar held a real estate license that expired in February 2023, according to the Texas Real Estate Commission.\n\nIn a video posted on YouTube, which has since been deleted, a man with the same name as the suspect said his time in the military taught him the “meaning of great service” and “what it means to be responsive and take everything seriously.”\n\n“I've taken those skills and applied them to my career as a real estate agent, where I feel like what really sets me apart from other agents is my ability to be able to one be a fierce negotiator,\" he said.\n\nThe company mentioned in the video, Blue Meadow Properties, lost its real estate license in 2022 when it expired.\n\n(This story was updated to add additional information.)\n\nContributing: Claire Thornton and Tom Vanden Brook, USA TODAY;Reuters",
        "source_2": "Reporting by Nathan Layne in West Palm Beach, Florida and Idrees Ali in Washington; Editing by Alistair Bell, Don Durfee and Daniel Wallis\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nHouston-based energy reporter focused on oil markets and energy companies. Arathy closely tracks U.S. crude supply and its impact on global markets, ever changing crude oil flows, and reports on U.S. shale producers and oilfield service companies.",
        "source_3": "Retired senior Secret Service Agent Tim Spiess reacts to latest terror probe news.\n\nHOUSTON – The brother of the suspected terrorist accused of ramming a truck through crowdedBourbon Street in New Orleansdiscussed his brother's religious background in a recent interview and said the attack was an example of \"radicalization.\"\n\nAbdur Jabbar, 24, spoke toThe New York Timesin Beaumont, Texas, where he and Shamsud-Din Jabbar, 42, grew up, saying they were raised Christian, but the now-deceased suspect had converted to Islam.\n\n\"As far as I know, he was a Muslim for most of his life,\" the brother told the Times.\n\n\"What he did does not represent Islam,\" he added. \"This is more some type of radicalization, not religion.\"\n\nBOMB-MAKING MATERIALS FOUND AT NEW ORLEANS AIRBNB POTENTIALLY TIED TO BOURBON STREET TERRORIST: REPORT\n\nA next-door neighbor, who asked not to be identified, told Fox News Digital he had seen Shamsud-Din Jabbar loading up the white truck on Tuesday outside his Houston home, the morning before the attack in New Orleans. He said he spoke with Shamsud-Din Jabbar, who told him he had gotten a job and was moving to Louisiana. The neighbor said he was under the impression Shamsud-Din Jabbar had gotten another job in IT.\n\nShamsud-Din Jabbar's home in Houston.(Peter Pinedo/ Fox News Digital)\n\n\"He said he got the job that day in Louisiana,\" the man said, describing how Shamsud-Din Jabbar was loading \"very light stuff, handheld stuff, not heavy stuff\" into the truck.\n\n\"The morning he was moving, I asked him if he needed help moving out, as a neighbor, 'Do you need any help for moving?' He said, 'I'm OK,'\" the neighbor told Fox News Digital.\n\nThe neighbor expressed disbelief upon learning Shamsud-Din Jabbar was accused of the Bourbon Street bloodshed. \"Blow my mind, I was shocked, somebody seized the carpet under my feet, I was just like too shocked, unbelievable, 'This really happened?'\" the man said. \"Like I said, we still don't believe, we still don't believe that that's the person, just there's no way, it can't be like that.\"\n\nThe Times reported that Jabbar was known \"as a smart, caring brother and a quiet, helpful neighbor.\"\n\nThe newspaper also spoke to Chris Pousson, a 42-year-old retired Air Force veteran who lives in Beaumont and went to middle and high school with Jabbar.\n\nReferring to Jabbar as \"Sham,\" Pousson described him to the Times as\"quiet, reserved, and really, really smart.\"\n\nShamsud-Din Jabbar's Houston home where law enforcement knocked down a gate.(Peter Pinedo/ Fox News Digital)\n\nThe FBI said Shamsud-Din Jabbar, a U.S. citizen from Texas, drove a rented Ford pick-up truck laden with an ISIS flag, weapons and a potential improvised explosive device (IED) into a crowd of New Year’s revelers at approximately 3:15 a.m. local time Wednesday, killing at least 15 and injuring more than 30 others. Authorities said other potential IEDs were also located in the French Quarter.\n\nA photo released by the FBI of Shamsud-Din Jabbar.(FBI)\n\nAuthorities say Shamsud-Din Jabbar, a U.S. Army veteran who recently held a six-figure job, opened fire on law enforcement officers, who returned fire, and was declared dead at the scene.\n\nAerial image of New Orleans attack suspect's home in Houston.(KRIV)\n\nSUSPECT IDENTIFIED AS FBI INVESTIGATES ACT OF TERRORISM AFTER BOURBON STREET ATTACK\n\nShamsud-Din Jabbar at one point was stationed in Fort Bragg, North Carolina, and deployedonce to Afghanistan, the Times reported, citing court documents.\n\nThe U.S. Army said Shamsud-Din Jabbar worked mostly as an information technology specialist and was discharged from theArmy Reservein 2020 with the rank of staff sergeant.\n\nLaw enforcement officials execute a search warrant at the New Orleans attack suspect's home in Houston.(KRIV)\n\nShamsud-Din Jabbar had been married and divorced twice. He shared two daughters, ages 15 and 20, with his first wife, Nakedra Charrlle Marsh, the Times reported.Her new husband, Dwayne Marsh, said Shamsud-Din Jabbar had been acting erratically in recent months, \"being all crazy, cutting his hair\" after converting to Islam, and that they stopped letting him around the daughters.\n\nShamsud-Din Jabbar's brother said the suspect was also the father to a 6-year-old son.\n\nDanielle Wallace is a breaking news and politics reporter at Fox News Digital. Story tips can be sent to danielle.wallace@fox.com and on X:@danimwallace.\n\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}