{
    "question": "In what ways did economic pressures and debates over immigration shape the anti-incumbent wave in the 2024 global elections, and what consequences might this have for governance and public trust in the year ahead?",
    "content": {
        "source_1": "LONDON — In this historic year of elections, the world gave its rulers a shellacking.\n\nMost notable for Americans, of course, was the defeat ofVice President Kamala HarristoPresident-elect Donald Trump. But zoom out and that is just one data point in a pattern that stretches from India to Austria, Botswana to South Korea, and Britain to Uruguay.\n\nNBC News reported at the start of 2024 how it would see more elections than any other year on record, with more than 70 nations covering 4 billion people going to the polls.\n\nNow that all the ballots have been cast and tallied, the trend is unmistakable: In almost all the world’s industrialized countries — and in many developing countries, too — governments’ vote shares decreased.\n\n“It has been a remarkably bad year for incumbents,” said Rachel Kleinfeld, a senior fellow at the Carnegie Endowment for International Peace, a think tank in Washington, D.C.\n\nThis was the first year since records began in 1905 that every incumbent party lost vote share in developed countries holding elections, according to data from ParlGov, an independent database run by the University of Bremen in Germany and first analyzed by the Financial Times newspaper.\n\nEven the exceptions came with caveats: June’s victory for Mexico’s governing party came after a string of more than a dozen incumbent defeats in Latin America; and Ireland’s government was re-elected in November despite its support diminishing slightly.\n\nTo be sure, every country had unique problems and scandals. Sri Lankans kicked out their leaders after an organic farming crisis; Japan’s dominant Liberal Democratic Party was punished for an alleged campaign fundraising corruption scandal; and South Africa’s African National Congress, the party of Nelson Mandela, lost its majority partly amid increasing power cuts, violent crime and widespread poverty disproportionately affecting Black people.\n\nBut one issue came up time and again: To update the famous quote from veteran Democratic political strategist James Carville: It’s the post-Covid economy, stupid.\n\nThe pandemic snarled global supply chains, hiking prices that remain stubbornly high. At the same time, governments pumped money into their limping economies, which some economists say fueled inflation. Hardly helping was the general declining trust and satisfaction with public institutions, and even evidence of a collective growing unhappiness, worldwide.\n\nThe Pew Research Center highlighted the “extent of global economic gloom,” with polling this month finding that 64% of adults across 34 countries thought their countries’ finances were in bad shape.\n\nEven in the U.S., whose macroeconomic numbers are the envy of the world, millions feel trapped in the same cost-of-living crisis plaguing much of the planet. Groceries are noticeably more expensive, and interest rates mean mortgages and credit cards are increasingly tough to pay.\n\nThat was also the story in the United Kingdom, where the country’s inflation briefly hit 11% and was a factor in the ruling Conservative Party’s worst electoral result in almost 200 years. One of the few Conservatives who did hold onto their seats was the party’s former leader, Iain Duncan Smith.\n\n“I was not surprised by Trump’s win,” he told NBC News. Around the world, “governments are being overturned on the same issue — the cost of living.”\n\nSimilar forces were at work in Japan, which experienced decades of economic stagnation give way to rising prices. In October, voters delivered a sharp rebuke to the Liberal Democratic Party, which has ruled almost continuously since its 1955 founding. Prime Minister Shigeru Ishiba only managed to hang onto power in a minority government.\n\n“Wages haven’t gone up, meanwhile prices have more than tripled,” said Masamitsu Sudo, 51, a real estate worker from Japan’s Aichi prefecture. “I didn’t vote for LDP because they can never bring about change.”\n\nEven Narendra Modi, India’s powerful prime minister, failed to secure a parliamentary majority in June, with voters accusing him of failing to provide enough jobs for the country’s 1.4 billion people.\n\nPrashant Shah, 40, who runs a consultancy in the central city of Indore, criticized the party’s “highly pro capitalist attitude,” which he said put big business above jobs and inflation.\n\nIn some regions, this economic anxiety went hand in hand with concerns over mass immigration.\n\nTrump supporters told Pew in September that border security was their second election priority behind the economy. The president-elect duly made that a key campaign message, promising to enact a policy of mass deportation.\n\n“The failure of the Biden administration on the border and immigration,” was another factor in Trump’s win, according to the Tory grandee Smith, a longtime advocate of tougher rules. “This is not unique to the U.S. — just look at the U.K.”\n\nAcross Europe, parties on the nationalist hard right were able to tap into similar concerns, this time about people arriving from mostly Muslim-majority countries in the Middle East and Africa.\n\nFrench President Emmanuel Macron lost ground to Marine Le Pen’s National Rally during snap summer parliamentary elections. In neighboring Belgium, the far-right Vlaams Belang party and the right-wing nationalist New Flemish Alliance parties trounced the ruling liberal coalition. And in Austria, the far-right Freedom Party, founded by former Nazis in the 1950s, won more votes than anyone else.\n\nIt’s a familiar cocktail. Right-wing parties have for decades risen when immigration is high and the economy is low, according to expert studies.\n\nThis time, it’s also allowed populists to make political hay.\n\n“It’s a crisis of leadership,” said Kelley E. Currie, who has held senior State Department roles. Though she has previously been critical of Trump, her former boss, she agrees with the “dissatisfaction with out-of-touch and selfish elites” that motivated some of his supporter base.\n\nMainstream politicians “have committed to decades of a globalization model that has damaged the economies and social contracts of these democratic societies,” she said. “While the elites have benefited extraordinarily.”\n\nMany people are simply becoming more unhappy, not just with their governments, but also with their own lives. Global well-being has declined for four years straight, according to an annual survey by the California nonprofit organization Six Seconds. It warns of a post-pandemic “emotional recession characterized by low well-being and high burnout.”\n\nSome argue that social media is partly to blame, its algorithms pushing discord, rewarding trenchant, binary opinions, while enabling people to compare their imperfect lives to the curated happiness of others,according to this 2022 studyand others.\n\n“Social media harnesses outrage and highlights negativity more than positivity,” said Kleinfeld at Carnegie Endowment for International Peace. And increasingly, politicians are held responsible because the pandemic “made government a bigger and much more public player in people’s everyday lives.”\n\nPoliticians made mistakes and “the vehemence of public views made it impossible to please everyone,” she said. Leaders were “under a spotlight from their voters that made outrage and distrust vastly more viral than support.”\n\n“Given that, it’s no wonder so many of them got thrown out.”\n\nAlexander Smith is a senior reporter for NBC News Digital based in London.",
        "source_2": "2024 was a remarkable year for elections asvoters in more than 60 countrieswent to the polls. It also turned out to be adifficult year for incumbentsand traditional political parties. Rattled byrising prices, divided overcultural issuesand angry at thepolitical status quo, voters in many countries sent a message of frustration.\n\nThis analysis of the 2024 election year is based on global public opinion data from surveys conducted by Pew Research Center and independent research. Links to original sources of data – including the methodologies of individual surveys and the specific questions asked – are available here:\n\nIn this essay, we analyze four major themes that emerged from this year’s busy slate of elections around the world:\n\nSouth Africa’s general election results come in at the Gallagher Convention Center in Midrand on June 2, 2024. The African National Congress failed to win a majority of National Assembly seats for the first time since the end of apartheid. (Phill Magakoe/AFP via Getty Images)\n\nIn one of the year’s highest-profile elections, Democrats in theUnited Stateslost the presidency, with Donald Trump, the Republican former president, defeating Vice President Kamala Harris. Republicans also won majorities in both houses of Congress.\n\nIt was the third straight U.S. presidential election in which the incumbent party lost. And it was one of many notable losses for incumbents around the world in 2024:\n\nElsewhere, incumbent parties held on to power but still suffered significant setbacks:\n\nWhat made 2024 such a tough year for incumbents? While every election is shaped by local factors,economic challenges were a consistent theme across the globe. That included the U.S., wherethe economy was the top issuefor registered voters – especially forthose who supported Trump.\n\nA survey we conducted in 34 countries earlier this year illustratedthe extent of global economic gloom. Across these nations, a median of 64% of adults said their national economy was in bad shape. In several nations that held elections in 2024 – including France, Japan, South Africa, South Korea and the UK – more than seven-in-ten expressed this view.\n\nInflation was anespecially important issuein this year’s elections, although economic concerns were prevalent in many countries before the post-pandemic wave of global price increases. The past two decades have seen financial crises, the Great Recession, the COVID-19 economic downturn, inflation and ongoing economic inequality, all of which may have shaped the mood in nations around the globe.\n\nBut the economy wasn’t the only thing driving voter discontent. Our global surveys over the past few years have highlighted abroader frustration with the functioning of representative democracy. Across 31 nations we surveyed in 2024, a median of 54% of adults weredissatisfied with the way democracy is working in their country. And in several high-income nations, dissatisfaction has increased significantly over the past three years.\n\nOur surveys have shown that many people feel disconnected from political leaders and institutions. Large majorities in many nationsbelieve elected officials don’t carewhat people like them think. Many say there isno political party that represents their viewswell. And large shares say people like themhave little or no influenceon politics in their country.\n\nSupporters of the Alternative for Germany (AfD) political party gather at a campaign rally in Erfurt, Germany, on Aug. 31, 2024. AfD went on to win in Thuringia, becoming Germany’s first far-right party to win a state election since World War II. (Sean Gallup/Getty Images)\n\nFrustrations with the political class have created opportunities for right-wing populists and other challengers to traditional parties and the political status quo. Several elections this year in Europe highlighted this trend:\n\nOver the past decade, commentators have regularly debated whether right-wing populism in Europe isrising or falling, based on the results of the most recent election. But the larger story is thatright-wing populist parties have become embedded in Europe’s political landscape, significantly disrupting the continent’s politics.\n\nIn some cases, right-wing parties have won the most votes, as inthe Netherlandsin 2023andItalyin 2022. Sometimes they have lost power, as inPoland’s late 2023 elections. But they are now consistently competitive in ways they were not until relatively recently.\n\nPopulists have had success outside of Europe as well. In theUnited States, Trump’s “Make America Great Again” movement has become thedominant force within the Republican Party. The party has moved in a populist direction that looks very different from the pre-2015 GOP.\n\nWith Republican electoral victories this year, the party will soon control the executive and legislative branches of government. Republican presidents have also appointed six of the nine current Supreme Court justices. Trump appointed three of these in his first term and may have the opportunity to appoint more in his second.\n\nDifferent varieties of right-wing leaders have found success in other regions as well. InIndia,Narendra Modi may have suffered a setbackin this year’s elections, but he still dominates the nation’s politics. InIndonesia,Prabowo Subianto won the presidential electionamid concerns about his human rights record.\n\nRight-wing leaders in Latin America offer an eclectic mix of ideologies. Butas The Economist has noted, several share an opposition to abortion, women’s rights and LGBTQ+ rights; an opposition to social democracy; and a hard-line view on crime. This group includesJavier Milei, who won the presidential election inArgentinain December 2023, andEl Salvador’s Nayib Bukele, who won reelection as president with over 80% of the vote and was buoyed by strong support for his crackdown on criminal gangs.\n\nPopulism has had some success on the left, too. One example isMexico’s Morena party, which has only been in existence for about a decade butnow dominates the nation’s politics. Building on the popularity of outgoing President Andrés Manuel López Obrador and the country’s relatively positive economic mood,Morena won outright majorities in both chambersof the Congress. And Morena’s Claudia Sheinbaum is nowMexico’s first female president.\n\nWhether on the right or left, populist parties have been able to capitalize on voters’ frustrations with elites – and the belief, shared by many, that establishment parties and leaders areout of touch with ordinary citizens.\n\nAbortion-rights supporters stage a counterprotest during the 50th annual March for Life rally on Washington, D.C.’s National Mall on Jan. 20, 2023, several months after a U.S. Supreme Court ruling ended the federal right to abortion. (Chip Somodevilla/Getty Images)\n\nThe spread of populism has coincided with deepening political divides over culture and identity in many nations.\n\nInFrance, Le Pen and her National Rally party regularly make arguments aboutdefending French culture and civilizationfrom immigrants and outsiders. The Freedom Party of Austria, Alternative for Germany, the Party for Freedom in the Netherlands and the Brothers of Italy also have made concerns about immigration – especially immigration from predominantly Muslim nations – central to their platforms.\n\nAdditionally,Austria’s Freedom Partyhas opposed LGBTQ+ rights. Its platform includes a constitutional determination that there are only two genders, and the party opposes same-sex relationships. Similar issues have appeared inother 2024 electionsas well.\n\nMore broadly, surveys have found sharp ideological divides over the value of tradition in society.\n\nA 2022 cross-national Pew Research Center surveyincluded a question exploring tradition and change. It asked respondents whether they believe their country will be better off in the future if it sticks to its traditions and ways of life, or if it is open to changes regarding its traditions and ways of life.\n\nIn 15 of the 16 nations where we measured ideology, there was a significant difference between the ideological right and left. The gap was largest by far in theUnited States, where 91% of liberals say the country will be better off if it embraces change, compared with just 28% of conservatives.\n\nAnd our cross-national polling has consistently shown that the U.S. is more ideologically divided than most, with especially wide gaps on issues includingabortionandclimate change.\n\nAmerica’s two-party system has a tendency to exacerbate ideological differences. And asEzra Klein,Lilliana Masonand other writers have described, polarization has intensified in recent years as various types of identities have become“stacked” on top of people’s partisan identities. Today, race, religion and ideology are often more aligned with partisanship than was the case when the two major parties were relatively heterogenous coalitions. Often, this results in identity-based conflicts and seemingly existential arguments over different conceptions of American identity.\n\nA Ukrainian gunner stands guard in an infantry fighting vehicle on Dec. 7, 2023, in the Donetsk province of Ukraine. (Roman Chop/Global Images Ukraine via Getty Images)\n\nVoters almost always prioritize domestic issues over international challenges. But international conflicts – especially the Russia-Ukraine and Israel-Hamas wars – nonetheless played an important role in the global election year of 2024.\n\nIn many nations, there areideological divisions over how to deal with Russia’s invasion of Ukraine, with support for Kyiv oftenlower among those on the ideological right.\n\nJust days before elections in theUnited Kingdom, Farage, the leader of the Reform UK party, reiterated previous claims thatRussia’s invasion of Ukraine had been “provoked”by “the ever-eastward expansion of NATO and the European Union.” InFrance, Le Pen has beencritical of EU sanctions against Russiaand has called forrestrictions on French aid to Ukraine. And she has hadkind wordsin the past for Russian President Vladimir Putin and his policies.\n\nInSlovakia,voters chose as their new president Peter Pellegrini, a close ally of the country’s pro-Russia Prime Minister Robert Fico. And right-wing populist parties inAustriaandGermanyhaveexpressed reservationsaboutsupport for Ukraine.\n\nMany on the ideological right in theUnited Statesare also skeptical about supporting Ukraine. When aUkraine aid bill passed the House of Representatives in April, Republicans were divided, with 101 voting in favor and 112 opposing the legislation.\n\nAt the Munich Security Conference in February, JD Vance – now the vice president-elect – saidthe U.S. should provide less aid to Kyiv. And as a Senate candidate in 2022, he said, “I don’t really carewhat happens to Ukraine one way or another.”\n\nPew Research Center polling has documenteddeclining support among Republicansfor providing aid to Ukraine since Russia’s invasion.\n\nMeanwhile, the Israel-Hamas war has generated tensions within the ideological left.\n\nTake theUnited Kingdom. While the Labour Partywon an overwhelming victorythis year, some of its few losses were tocandidates on the leftwho were critical of Prime Minister Keir Starmer’s support for Israel.\n\nIn theUnited States, polling highlights sharp divisions among the supporters of the Democratic Party,especially young liberals, many of whom opposed the Biden administration’s approach to the Israel-Hamas war. It was also an issue inFrance, where many haveaccused leaders of France Unbowed– which has been strongly critical of Israel – of antisemitism.\n\nThe list of nations set tohold national elections in 2025includesCanada,Chile,Germany,Jamaica,NorwayandSingapore. The results will show whether incumbents – and those who are seen as representing the political status quo – continue to be targets of voter discontent.\n\nThis report was written by Richard Wike, director of global attitudes research; Moira Fagan, research associate; and Laura Clancy, research analyst. Janakee Chavda, associate digital producer, produced the report. John Carlo Mandapat, information graphics designer, produced the graphics. It was checked by Christine Huang, research associate; and Jordan Lippert, research analyst. David Kent, senior copy editor, copy edited it. Editorial guidance was provided by John Gramlich, associate director of short reads.\n\nSouth Africa’s general election results come in at the Gallagher Convention Center in Midrand on June 2, 2024. The African National Congress failed to win a majority of National Assembly seats for the first time since the end of apartheid. (Phill Magakoe/AFP via Getty Images)\n\nSupporters of the Alternative for Germany (AfD) political party gather at a campaign rally in Erfurt, Germany, on Aug. 31, 2024. AfD went on to win in Thuringia, becoming Germany’s first far-right party to win a state election since World War II. (Sean Gallup/Getty Images)\n\nAbortion-rights supporters stage a counterprotest during the 50th annual March for Life rally on Washington, D.C.’s National Mall on Jan. 20, 2023, several months after a U.S. Supreme Court ruling ended the federal right to abortion. (Chip Somodevilla/Getty Images)\n\nA Ukrainian gunner stands guard in an infantry fighting vehicle on Dec. 7, 2023, in the Donetsk province of Ukraine. (Roman Chop/Global Images Ukraine via Getty Images)",
        "source_3": "PARIS -- It's amazing how fast the woke Western establishment turned into a bunch of bigots, by their own definition, when they sensed that their own backsides were on the line this year.\n\nIt seems like just yesterday that leaders across Western Europe and North America were advertising their openness to immigration from around the world as an integral part of their identity. Look how welcoming we are! Not like those nasty authoritarian regimes (which actually do take in a lot of migrants in some cases, just ones whose diversity contribution isn't as superficial).\n\nNothing says democracy and freedom like the need to jack up internal security because your diversity experiment has spun out of control.\n\nAlmost overnight, welcome mats have suddenly been getting yanked all across the Western world over the past year in reaction to a rise in populist parties winning elections. Observers could be forgiven for trying to file claims for whiplash injury. But if there's one thing that causes globalists to abandon their agenda it's an imminent threat to their own political behinds.\n\nPerhaps the most subtle case is in the United States, where the Biden administration is estimated to have quietly carried out about as many deportations as during Trump's first presidential term, according to the Migration Policy Institute earlier this year.\n\nCanada has imported so many global conflicts onto its own soil over the years that the spats have taken center stage in the country's political life. From clashes between pro-Israel and pro-Palestinian supporters outside a recent G20 meeting in Montreal to allegations of systemic political pandering to ethnic minority groups by various lawmakers being the focus of seemingly endless \"foreign interference\" hearings, and even an ongoing beef between the Indian government and the Sikh Khalistani separatist group playing out violently in the streets of Canada and in Ottawa's halls of power.\n\nNow, after cutting immigration targets and limiting temporary residency, Canada is also actively deterring asylum seekers with ads in 11 languages, including Ukrainian, Hindi, Urdu and Tamil, according to Reuters earlier this month.\n\nNo doubt the language choices are totally random. Unless you're a bigot.\n\nSurely this sudden onset of political schizophrenia couldn't have anything to do with the fact that Canada's current housing crisis risks ejecting Prime Minister Justin Trudeau's incumbent Liberals from power in next fall's scheduled election in favor of the Conservatives.\n\nIn a desperate (and failed) attempt to fend off an election defeat, Britain's Conservatives cut a deal with Rwanda to hold UK asylum seekers for processing. Others have been housed on a barge off the British coast.\n\nOver in Europe, where populist gains in the European Union parliament and across the bloc have rattled the establishment, they're so keen to ditch migrants that the bombing hadn't even stopped in Syria amid the recent overthrow of President Bachar al-Assad before European countries were already packing Syrian migrants' bags.\n\nOr at least they can't come here anymore, even if they may have ALREADY applied. Austria, France, Germany, Belgium and Greece announced a halt to processing any more asylum applications from Syrians. Because the very same al-Qaida jihadists that the EU still accuses on its own website of assassinations, forced religious conversions, hostage takings and suicide bombings, now self-identity as statesmen. And the leader talks like the only kind of war he's into now is social justice, saying things like, \"diversity is a strength,\" according to Britain's Telegraph.\n\nAnd he dresses like he shares a stylist with the West's girlfriend, Ukrainian President Volodymyr Zelensky. And apparently that's good enough for European countries to at least give him the benefit of the doubt.\n\nThese Syrian terrorists' reputational Botox hasn't even finished settling in yet and already Austria is talking about deporting Syrian refugees back home.\n\nAnd if the thought of heading back and taking a chance on a country being ruled by the same jihadist leader who still has a $10 million dollar bounty on his head in Washington for palling around with ISIS head-choppers isn't enticing enough for Syrians, then maybe a cash bribe of EUR1,000 from the German government will do the trick, as some opposition politicians have suggested offering.\n\nThere's the minor detail of the U.S. and Israel still bombing Syria, but no big deal, right? It would be just like walking into a movie theater while the clean-up crew is still knee deep in the mess from the previous showing.\n\nGermany had already started drop-kicking Afghans out of social housing back in 2022 to make room for Ukrainians, according to Foreign Policy magazine.\n\nAnd back in September, the BBC reported that German officials were also looking at Britain's Rwanda deportation plan with goo-goo eyes. Meanwhile, the European Commission has recently started referring to the need to defend Europe against the \"weaponization\" of migration - implying that this wonderful source of multiculturalism could actually be some kind of threat.\n\nIt's almost like the West is just a giant hotel now with suddenly no vacancy. Maybe if our genius leaders had availed themselves of the exit ramp that their own citizens have been screaming at them to take from the backseat for years, rather than accusing populists of spreading fake news about immigration, then they wouldn't currently be facing such a brutal mugging by reality."
    }
}