{
    "question": "How might Ridah Bin Saleh al-Yazidi’s repatriation to Tunisia influence debates about the future of the Guantanamo Bay detention facility?",
    "content": {
        "source_1": "Ridah bin Saleh al-Yazidi’s transfer back to Tunisia was approved more than a decade ago\n\nI would like to be emailed about offers, events and updates from The Independent. Read ourPrivacy notice\n\nA prisoner who has been held atGuantanamo Baysince the day it opened over 20 years ago has been released, thePentagonsaid.\n\nRidah bin Saleh al-Yazidi’s transfer back to Tunisia was approved more than a decade ago, and he was never charged, but authorities have only just confirmed his repatriation.\n\nThe 59-year-old spent years in the notorious prison because deals could not be made to repatriate or resettle him, according toTheNew York Times.In a secret operation, al-Yazidi was airlifted from the military base, the paper reported.\n\nAl-Yazidi, who was sent to the prison on January 11, 2002, isone of the prisoners pictured kneeling in an iconic photo from the facility.\n\nHe is the last of a dozen Tunisian men once held at Guantanamo. Of those remaining, seven face active cases.\n\nIn a statement, the U.S. military said it had worked with authorities in Tunisia for the “responsible transfer” of al-Yazidi.\n\nAl-Yazidi was captured with a group by Pakistani forces near the Afghan border in December 2001, according to theTimes, citing a 2007 prison assessment. Some of the group were suspected of being bodyguards toOsama Bin Laden.\n\nHe was described in the assessment as a dangerousdetainee, who was “hostile” to guards at the prison and threw a cup of tea at a U.S. soldier, according to theTimes.\n\nBy 2010, it was deemed by anObama administrationtask force that Al-Yazidi could not be prosecuted for war crimes and was eligible for release to another country.\n\nA former State Department staffer who arranged prisoner and detainee transfers told theTimesthat the delay was due to Tunisia being deemed “too dangerous” or the nation was “uninterested” in taking Al-Yazidi.\n\n“He could have been gone a while ago but for Tunisian foot-dragging,” Ian Moss told the newspaper.\n\nMany imprisoned at Guantanamo over the years were subjected to torture, including waterboarding, sleep deprivation, sexual harassment and physical abuse. Some were also tortured at CIA “black sites” prior to their arrival.\n\nBarack Obama issued anexecutive order to close the facility on his second day in the White Housein 2009 and the prison population was reduced from 245 to 41 detainees during his two terms in office.\n\nHowever, Obama ultimately failed to close down the facility.\n\nThe Biden administration has sincemoved to reduce the population in the prison.There are now 26 men being held at Guantanamo, down from a peak population of about 700 Muslim men detained abroad and brought to the military facility in the years after theSeptember 11 attacks.\n\nTwo of the 26 have been convicted and sentenced by the military commission. The Biden administration, pressed by rights groups to free remaining Guantanamo detainees held without charge, transferred out three other men this month.\n\nThe U.S. says it is searching for suitable and stable countries willing to receive the remaining 14.\n\nJoin thought-provoking conversations, follow other Independent readers and see their replies",
        "source_2": "Guantanamo Bay inmate Ridah Bin Saleh al-Yazidi has been repatriated to Tunisia, the US Department of Defense says.\n\nHe was found eligible for transfer from the detention facility after a \"rigorous interagency review process\", a press statement said.\n\nHuman rights groups say Mr Yazidi was one of the prison's original detainees in January 2002. The Pentagon did not say if he had accepted any guilt.\n\nSince 2002, the Guantanamo Bay detention facility has been used to hold what the US describes as captured unlawful combatants during America's \"war on terror\".\n\nThe camp is part of a US naval base complex in south-eastern Cuba.\n\nAccording to the New York Times, Mr Yazidi was never charged and was approved for transfer more than a decade ago.\n\nHuman Rights Watch and Cage International said he had been at Guantanamo Bay since the facility was first set up in 2002.\n\nAccording to Monday's Pentagonstatement, 26 detainees remain at Guantanamo Bay, of whom 14 are eligible for transfer.\n\nEarlier in December, the Pentagon announced that the US had repatriated three other detainees,the Associated Press news agency reported.\n\nThe camp was established by the Bush administration to detain the most dangerous suspects for interrogation and the prosecution of war crimes.\n\nControversy has centred around the period of time detainees have been held without charge and the use of interrogation techniques.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nThe US military is preparing to activate troops as part of Trump's crackdown on street crime.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.",
        "source_3": "By signing up to our newsletters you agree to the Just the NewsTerms of ServiceandPrivacy Policy\n\nDefense Secretary Lloyd Austin notified Congress earlier this year about his plans to repatriate prisoner Ridah Bin Saleh Al-Yazidi.\n\nThe Pentagon on Monday returned to Tunisia a detainee held at the United States' military base at Guantanamo Bay, in Cuba, since 2002.\n\nThe Defense Department saidRidah Bin Saleh al-Yazidi, 59, was repatriated to the government of Tunisia after he was \"determined transfer-eligible by a rigorous interagency review process established by [a] 2009 Executive Order.\"\n\nDefense Secretary Lloyd Austin notified Congress of his intentions in January 2024.\n\nThe Pentagon says 26 detainees remain at Guantanamo Bay: 14 are eligible for transfer; three are eligible for a Periodic Review Board; seven are involved in the military commissions process; and two detainees have been convicted and sentenced by military commissions.\n\nPresident George W. Bush established the detention center in January 2002 to hold terrorism suspects and \"illegal enemy combatants\" during what was known as the \"Global War on Terrorism.\""
    }
}