{
    "question": "What does Vladimir Putin’s 25-year milestone as Russia’s leader suggest about the sources of his longevity and the challenges that could shape the country’s path in the years ahead?",
    "content": {
        "source_1": "Crisis has aided the Russian strongman’s regime stability far more than any index of economic success, writesMark Almond\n\nWhen Boris Yeltsin suddenly resigned asRussia’s first post-communist president on New Year’s Eve, 1999, his country seemed to be spiralling downhill into economic and political disintegration.Few gave his largely unknown successor as acting president much chanceof reversing the economic implosion or remaining in office for long.\n\nThe then prime ministerVladimir Putin’s media operation had already begun to portray the ex-KGB operative in stark contrast to the moribund Yeltsin asan action man. That same year the second Chechen war on the country’s southern border raged. Twenty-five years later, Vladimir Putin is still in the Kremlin but Russia is again in the grip of war on its post-Soviet periphery after last week’sdowning of an airliner over Chechen airspace.\n\nAdd to the tension that Putin’s Russia has been engaged in a covert war againstUkrainesince 2014, which he had turned into a full-scale invasion by early 2022 – a conflict that remains at an impasse today. As with his earlier war againstChechnya, Putin’s obduracy turned an opening military fiasco into a brutal war of attrition which Russia’s resources could win at a huge price.\n\nBut Putin’s rise over the years owed more to bureaucratic infighting skills than any dark espionage arts, or even thejudo skills which he would at one time displayin front of loyal cameras.\n\nBorn in post-war Leningrad amid the grim legacy of the Nazi siege, the young Vladimir Putin learnt survival arts more appropriate to the chaotic post-Soviet dog-eat-dog society of the 1990s than the shining utopian future promoted by communist propaganda.\n\nWesterners imbued with the myth of the KGB as anti-James Bond supervillains overlook that it was Putin’s relationship with his law professor at university rather than his time in a dingy office in Dresden that launched his meteoric rise.\n\nAnatoly Sobchakwas the classic “licensed” dissident in late Soviet times. A non-Communist Party member permitted to whisper subversive comments in return for quietly cooperating with the KGB against really awkward customers, Sobchak was in a position to present himself as a new broom once Mikhail Gorbachev permitted real elections after 1989.\n\nOn returning from East Germany, Putin left the KGB and became one of Sobchak’s lieutenants, soon in the key role of managing the new mayor of Leningrad’s vast city property portfolio. This job brought the new civic bureaucrat into contact with the emerging post-communism new rich.\n\nPeople were inclined to be dismissive of Putin in the 1990s, as they had Stalin 70 years before. When a comrade derided Stalin as a “mediocrity”, Trotsky agreed, but added, “Not a non-entity.” He saw thatPutin’s great predecessoractually was a kind of living embodiment of huge sections of the new Soviet society.\n\nIt was the West’s failure to grasp that Putin represented swathes of Russians in the 1990s that gave him traction in Russian politics. Putin’s ability to serve Yeltsin and his cronies through that decade led them to the fatal error of choosing him as an easily manipulated successor as president.\n\nPutin’s pardoning of Yeltsin for any misdeeds while in office was followed by a ruthless suppression of the oligarchs. He showed state power trumped money power. Military powerground down the Chechen rebels. Oil and gas prices soared as George W Bush’s war on terrorism benefited Putin’s economy. Yet years of economic growth and peace at home did not stabilise Putin’s regime.\n\nIn 2011, mass protests shook Moscow. The fact that these took place in a time of peace and relative plenty taught Putin a lesson. Crisis made for regime stability far more than any index of economic success. If people felt secure in their everyday lives, they could get above themselves.\n\nLike so many past Russian rulers, Putin is well aware that the relaxation that comes with peace can promote political dissent.\n\nPutin’s studied indifference to the fate of the crew of thesunken submarineKurskin 2003and their families’ trauma as the drama played out below the Barents Sea was one episode of his Stalin-like view of mass death as a matter of statistics.\n\nWesterners thought the misfiring of the Ukraine war would undermine Putin. However, rather as pro-Assad media used to show a parade of Western leaders who had demanded his fall and yet had been and gone while he ruled on, Putin has outlived many of his Western critics.Yet he must also be haunted by Assad’s sudden downfall.\n\nWill his power crumble so quickly? Back in July 2023, when his former-chef-turned-warlord Yevgeny Prigozhin rebelled against him, no one resisted the march from Rostov in the south to the gates of Moscow. Then Prigozhin did a deal with Putin –before his plane crashed with him and his fellow mercenary bosses.\n\nJust as after he triumphed over Hitler in 1945, Stalin did not relax his regime but intensified internal repression, Putin today sees military victory as less essential to his survival in power than continuing international tension. But even as shrewd a political operator and as skilled a propagandist as Vladimir Putin knows, at 72 years of age, that the clock is ticking against him. Stalin died in his bed. Will Vladimir Putin?\n\nBack in 1999, Putin had taken charge of the attempt to force rebellious Chechnya on its southern border back under the Kremlin’s control. Only a few days ago, as collateral damage of today’s Ukraine conflict, thefatal crippling of an Azeri airliner over Chechen airspace by Russia’s trigger-happy air defencesbrought home how far – a quarter of a century later – Putin’s reign has been so far bookended by war.\n\nJoin thought-provoking conversations, follow other Independent readers and see their replies",
        "source_2": "Vladimir Putin came to power as a professed reformer on the eve of 2000, and has since become one of the 21st century's most prolific warlords. DW looks at how EU, US and NATO relations with Putin's Russia have evolved.\n\nIn August 1999, Vladimir Putin was appointed the prime minister of theRussian Federation. Months later, as the world prepared to welcome the year 2000, he succeeded the ailing Russian president,Boris Yeltsin. When he took office, Putin declared that Russia was, and would remain, a great power. In Europe and the United States, he was seen as someone who would restore order within Russia as the country emerged from the tumult of the 1990s.\n\n\"I looked the man in the eye,\" US President George W. Bush said following his June 2001 summit with Putin in Slovenia. \"I found him to be very straightforward and trustworthy. We had a very good dialogue. I was able to get a sense of his soul: a man deeply committed to his country and the best interests of his country.\"\n\nIn a speech to Germany's parliament, the Bundestag, in September 2001, Putin offered EU countries a security partnership with Russia. He questioned the role of the leadingNATOpower, the United States, but did not rule out Russia's eventually becoming a member of the alliance and the European Union.\n\nThe EU and Russia agreed on a number of cooperation programs and initiatives, with the aim of establishing a \"strategic partnership.\" NATO opened an office in Moscow, and Russia set up a permanent mission to the alliance in Brussels. A special NATO-Russia Council was established to discuss strategic issues, including the decision by various Central and Eastern European countries to join the alliance.\n\nBeing one of the main suppliers of oil and gas to the European Union also proved very profitable for Russia.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 video\n\nIn 2004, German ChancellorGerhard Schröderdescribed Putin as a \"flawless democrat\" despite evidence that he was clamping down on domestic opposition and the press. After he left office, Schröder was given lucrative positions in Russian state-run energy companies.\n\nAt the Munich Security Conference in 2006, Putin notably changed his diplomatic approach. He said the US and EU had not accepted Russia as a great power, and portrayed the expansion of NATO to include central and eastern European countries as a breach of assurances that the alliance would not bring its borders closer to his. In fact, Russia had agreed to the expansion in 1997, with the signing of the NATO-Russia Founding Act.\n\nArms reduction agreements were scrapped. Russia was sharply critical of a planned US missile defense system. At its April 2008 summit, NATO promised Ukraine and Georgia that they would be allowed to join the alliance. Putin was outraged.\n\nIn August 2008, Putin demonstrated Russia's military might by intervening in a conflict inGeorgia, and, after a short war, brought the regions of South Ossetia and Abkhazia under the Kremlin's control.\n\nIn 2013, the European Commission was still discussing its long-term vision of establishing a \"common economic and humanitarian space\" with Putin's Russia, stretching \"from Lisbon to Vladivostok.\"\n\nFollowing the democraticMaidan Revolutionin Kyiv and the ousting of pro-Russia President Viktor Yanukovych in the spring of 2014, Putinattacked Ukraine. Russia annexed theCrimean Peninsulain violation of international law, and brought parts of eastern Ukraine under its control with the help of pro-Kremlin separatists. The US and EU imposed sanctions on Russia and attempted to mediate. German Chancellor Angela Merkel and French President Francois Hollande brokered theMinsk Agreement, which was supposed to lead to peace. It never did, but Merkel later said it had bought Ukraine time to grow stronger.\n\nIn the eyes of EU officials, Putin was becoming an increasingly autocratic ruler. In 2021, the European Commission noted a \"negative spiral\" inEU-Russia relations, but the bloc continued to turn to the Kremlin for energy imports.\n\nIn March 2022, shortly after the full-scale invasion of Ukraine by Russia, US President Joe Biden said Putin was a \"war criminal\" and \"a murderous dictator, a pure thug.\" From this point on, NATO regarded Putin's Russia, its new-old enemy in the East, as \"the most significant and direct threat to Allies' security and to peace and stability in the Euro-Atlantic area.\"\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 video\n\nThe European Union imposed sweeping sanctions on Russia, and moved to expedite the end of its dependence onKremlin-sold oil and gas. Almost three years after the start of the war in Ukraine, the European Union has not fully achieved this goal. Liquefied natural gas still flows from Russia to the European Union. Trade has shrunk, but many EU companies still do business in Russia. The food, pharmaceutical and chemical industries are not affected by sanctions.\n\nTwenty-five years after Putin took office, NATO is bracing itself for a new arms race. The alliance's primary mission now is to defend itself against aggression from Russia.",
        "source_3": "Russian President Vladimir Putin delivered his traditional New Year's Eve address on Tuesday, speaking about the challenges the country has faced since the beginning of this century and what it has achieved.\n\nThe first Russian region to celebrate the New Year was Far Eastern Kamchakta, which is nine hours ahead of Moscow.\n\nPutin highlighted the achievements of the nation’s military, who have taken on“the warrior's noble mission of protecting”the country, its peace and security, and dedicated 2025 to them.\n\nOver the past 24 years, Russia has managed to stay“independent, free, and strong”as it faced“many tough and historic challenges”thanks to its people’s unity, their faith and their abilities that have only grown stronger with time, Putin said.“We can rightfully be proud of what we have already accomplished. This is our common heritage, a reliable foundation for further development,”he added.\n\nThe president praised Russians for their love of their homeland and desire to contribute to its security and development, which“has become a matter of honor for us.”He hailed the soldiers and officers still fighting on the frontlines of the ongoing conflict between Moscow and Kiev, calling them“heroes”and saying that“2025 has been declared the Year of the Defender of the Fatherland in Russia.”\n\n“We are the children, grandchildren and great-grandchildren of the generation that crushed Nazism. And we uphold the legacy and traditions of our veterans,”Putin said.\n\nRussia’s leader also maintained that citizens’ well-being“have been, and will remain, our absolute value”as he wished prosperity to“every home, to every family, and to our beloved country, Russia.”\n\n“When we're together, everything is possible,”the president concluded.\n\n© Autonomous Nonprofit Organization “TV-Novosti”, 2005–2025. All rights reserved.\n\nThis website uses cookies. Read RTPrivacy policyto find out more."
    }
}