{
    "question": "How might President-elect Trump’s support for the H-1B visa program, alongside Elon Musk’s forceful advocacy and visible divisions within his base, shape his immigration agenda and political alliances?",
    "content": {
        "source_1": "President-elect TrumpbacksH-1B visas, siding withElon Muskafter the tech billionaire pledged to go to \"war\" to defend the program and branded GOP opponents \"hateful, unrepentant racists.\"\n\nWhy it matters:The MAGA-DOGE civil war that erupted over the last 48 hours has now come to a tipping point, with Trump's new techno-libertariancoalition of billionairestaking full aim at his traditional base.\n\nThe latest:The president-electtoldthe New York Post on Saturday he has \"always liked the visas.\"\n\nReality check:Trumppledgedto end the program in 2016.\n\nCatch up quick:The MAGA-DOGE skirmishes started last Sunday, with anti-immigration and anti-Indian vitriol against Trump's pick of venture capitalistSriram Krishnanas his AI advisor.\n\nZoom in:Just before midnight Friday, Musk once againdefended the H-1B programin vulgar, all-caps terms, saying the program was the key to the success of his (and other big American) companies.\n\nWhat they're saying:As with Musk's previous posts defending Ramaswamy and condemning his opponents, Trump supporters did not react well to Musk's promise to defend the H-1B program.\n\nThe intrigue:Though Trump has been mostly quiet on the matter, those around him have started showing their hands.\n\nEditor's note: This story has been updated with additional statements and context.",
        "source_2": "President-elect Donald Trump appeared to side with technology bosses Elon Musk and Vivek Ramaswamy in a row over a visa programme that brings skilled workers to the US.\n\nTrump told the New York Post on Saturday that he \"always liked\" H-1B visas and hired guest workers under the scheme - even though he's previously been critical of the programme.\n\nHe was wading into a debate that has pitted his advisors from the tech world against Republicans who want a harder line on all forms of immigration.\n\nThe argument broke out after Ramaswamy, tapped by Trump along with Musk to slash government spending, blamed American culture for US firms deciding to hire skilled workers from other countries.\n\n\"Our American culture has venerated mediocrity over excellence,\" Ramaswamy wrote in a long X post that argued that foreign workers improve the US economy.\n\n\"A culture that celebrates the prom queen over the math olympiad champ, or the jock over the valedictorian [the top student in a class], will not produce the best engineers,\" he wrote.\n\nThe post attracted backlash from anti-immigrant Trump supporters, and Ramaswamy later clarified that he believed \"the H-1B system is badly broken & should be replaced\".\n\nAfter the argument raged online for days, Trump told the Post: \"I've always liked the visas, I have always been in favour of the visas. That's why we have them.\"\n\n\"I have many H-1B visas on my properties. I've been a believer in H-1B. I have used it many times. It's a great program,\" he said.\n\nTrump moved to restrict access to the H-1B programme during his first term.\n\nBoth the president-elect and his running mate JD Vance have been critical of the visas in the past, although Vance has close ties to the tech world and in his previous career as a venture capitalist funded start-ups that hired workers with H-1B visas.\n\nRamaswamy's assertions led to a full-blown row online over the holidays, as mainstream Republicans and far-right influencers joined in criticising him and other wealthy figures in Trump's inner circle.\n\n\"If we are going to have a throwdown, let's have it now,\" prominent Trump supporter Steve Bannon said on his War Room podcast on Friday. He went on to call the Republican claims of support of the H-1B programme a \"total scam\".\n\nRamaswamy's perceived view of skilled worker visas was backed by Elon Musk, the X, Tesla and SpaceX boss selected to co-direct Trump's proposed \"Department of Government Efficiency\".\n\nMuskdefended the H-1B visa programmeas attracting the \"top ~0.1%\" of engineering talent\".\n\n\"Thinking of America as a pro sports team that has been winning for a long time and wants to keep winning is the right mental construct,\" he wrote.\n\nCritics online posted screenshots of job postings at Musk's companies filled by people with H1-B visas, showing salaries of $200,000 and much less, and argued these hires did not constitute an elite talent pool but rather a way to hold down the wages of US-born workers.\n\nMusk then shot back at \"contemptible fools\", saying he was referring to \"those in the Republican Party who are hateful, unrepentant racists\".\n\n\"They will absolutely be the downfall of the Republican Party if they are not removed,\" he wrote.\n\nHe later swore at one of his critics and said he would \"go to war\" to defend the visa programme.\n\nNikki Haley, Trump's former ambassador to the United Nations and a former Republican presidential candidate, became a prominent voice arguing against Ramaswamy and Musk.\n\n\"There is nothing wrong with American workers or American culture,\" she wrote in response on X. \"All you have to do is look at the border and see how many want what we have. We should be investing and prioritizing in Americans, not foreign workers.\"\n\nHaley, who like Ramaswamy was born to Indian immigrants, was joined in opposing the visa programme by far-right accounts online.\n\nLaura Loomer, an anti-Islam activist who regularly spreads conspiracy theories but is also known for her unwavering support of Trump, led the online charge with posts viewed millions of times.\n\nEarlier in the week, Loomer criticised Trump's choice of Sriram Krishnan, an India-born entrepreneur, as the White House senior advisor on artificial intelligence. Loomer wrote that Krishnan was a \"career leftist\" who is \"in direct opposition to Trump's America First agenda\".\n\nCheered on by far-right X accounts, she also called Indian immigrants \"invaders\" and directed racist tropes at Krishnan.\n\nLoomer then accused Musk, who owns X, of \"censorship\" for allegedly restricting replies to her posts on the network and removing her from a paid premium programme.\n\nEchoing criticisms of Trump about the influence of the X boss, she wrote: \"'President Musk' is starting to look real… Free speech is an illusion.\"\n\nOn Friday and Saturday, a number of other conservative and far-right accounts also complained that the reach of their messages had been throttled on X.\n\nThe number of H-1B visas issued is capped at 65,000 per year plus an additional 20,000 for people with a master's from US institutions.\n\nRecentresearch by Boundless, an immigration consultancy, indicates that around 73% of the H-1B visas are issued to Indian nationals, with 12% issued to Chinese citizens.\n\nTrump promised that mass deportations of undocumented immigrants will start immediately after he takes office.\n\nIn recent days the president-elect also denied that he's unduly under the influence of Musk and the other billionaires who backed his campaign.\n\nOn Sunday, Trump told a conservative conference in Arizona that he was not under Musk's thumb.\n\n\"You know, they're on a new kick,\" he told the crowd at AmericaFest, organised by Turning Point USA. \"All the different hoaxes. The new one is that President Trump has ceded the presidency to Elon Musk.\"\n\n\"No, no, that's not happening,\" he said. \"He's not gonna be president.\"\n\nThe BBC’s Nomia Iqbal speaks to voters in Philadelphia, where the tech billionaire campaigned for the president and even gave away a few $1m cheques.\n\nThe former US president says he has no regrets over his late withdrawal in the contest against Donald Trump.\n\nAged just 10 when his father first became president, he's now well over six feet tall, and goes to New York University.\n\nThe US president spoke about his plans for the second Trump administration, as well as criticising the 'corrupt establishment'.\n\nWatch the historic moment when the 45th president is returned to power as he takes the oath of office.\n\nElon Musk, Mark Zuckerberg and Jeff Bezos were among those invited inside the Capitol for Donald Trump's swearing in.\n\nThousands of people joined in on demonstrations as the United States prepares to inaugurate its new president.\n\nThe outgoing US president warned against power in the hands of the wealthy, the threat of the tech industry and climate change.\n\nTrump's pick for US attorney general was pressed on claims of election fraud and pardons for January 6 rioters.\n\nDonald Trump's defence secretary nominee was asked about his stance on women in combat and his alleged excessive drinking.\n\nHarris, who Trump defeated in the 2024 election, presided over the event as required by the US Constitution.\n\nAmong the allies the president-elect has chosen to join his administration are contentious figures, including among fellow Republicans.\n\nThe president-elect has nominated RFK to lead the Department of Health and Human Services.\n\nThe suspect used an “improvised incendiary device” to start the fire in Portland, Oregon, ahead of the US election.\n\nA week after losing the election, Kamala Harris's team are still appealing for funds.\n\nRepublicans have won control of both chambers of Congress, yielding Trump limited congressional oversight for at least 2 years.\n\nThe president and president-elect shook hands as part of a long-standing tradition signifying the transfer of power.\n\nGiven all the things they’ve said about each other, Joe Biden and Donald Trump’s meeting could be really awkward.\n\n'I think Putin believes that he knows how to play Trump', says Trump's former adviser John Bolton.\n\nThe Russian president says he was impressed by Trump's reaction to the first assassination attempt against him.\n\nThe accused says his attorneys were not answering his questions and that they were \"a million miles apart\".\n\nJoe Biden's son directs expletive-filled accusations at the Hollywood actor for his part in the former president quitting the campaign.\n\nThe BBC’s Nomia Iqbal speaks to voters in Philadelphia, where the tech billionaire campaigned for the president and even gave away a few $1m cheques.\n\nTasked with reducing government spending and cutting jobs, the agency has faced legal challenges.\n\nThe former US president says he has no regrets over his late withdrawal in the contest against Donald Trump.",
        "source_3": "President-electDonald Trumphas weighed in on the debate that roiled his MAGA movement and split them in recent weeks: skilled immigration.\n\nDepartment of Government Efficiency nomineesVivek RamaswamyandElon Muskhave come underheavy firefor their support of H-1B visas in recent days from the anti-immigration right.\n\nTrump took Musk’s and Ramaswamy’s side with his comments Saturday.\n\nVIVEK RAMASWAMY SAYS FEDERAL AGENCIES CAN BE ‘DELETED.’ CAN TRUMP DO THAT?\n\n“I’ve always liked the visas, I have always been in favor of the visas. That’s why we have them,” Trump told theNew York Post. “I have many H-1B visas on my properties. I’ve been a believer in H-1B. I have used it many times. It’s a great program.”\n\nThis follows Trump’s comments this summer, which didn’t attract as many headlines, that he is in favor of giving green cards to people who graduate from universities in the U.S.\n\n“You graduate from a college, I think you should get automatically, as part of your diploma, a green card to be able to stay in this country, and that includes junior colleges, too,” hesaidonAll-In, a podcast hosted by Silicon Valley tech investors.\n\nThe recent firestorm started after TrumpnominatedSriram Krishnan, an Indian immigrant who became an American citizen several years ago, as hisSenior White House Policy adviser on Artificial Intelligence.\n\nHOW ELON MUSK HELPED WILL TRUMP BACK TO THE WHITE HOUSE\n\nMusk and Ramaswamy threw their support behind Krishnan, who has worked for the likes of Facebook, Microsoft and Twitter, to the ire of those in the MAGA movement who oppose immigration. Opponents of Krishnan have lobbed attacks at the new administration nomination, which he has not responded to.\n\nTrump’s statement looks to break the kerfuffle between the MAGA factions. Right-wing commentator Nick Fuentes, who said he did not vote for Trump after supporting him in the past, suggested Trump was a hypocrite for his recent comments.\n\n“In 2016 Trump said the H-1B program ‘shouldn’t exist’ because it is ‘very unfair for (American) workers.’ Now in 2024, under the influence of Silicon Valley donors, Trump says he used and supports H-1B. This is the definition of selling out,” hepostedon X.\n\nTrump has opposed aspects of the H-1B visa in the past. During his first administration, Trumpinsistedthat the process should not be abused and only the most qualified workers should be considered.\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nHe temporarily suspended the visas in 2020, which disabled over 100,000 immigrants from seeking jobs in the United States.\n\nBut his comments indicate his stance has changed, and his partnership with Ramaswamy and Musk will lead to more favorable conditions for those who seek H-1B visas."
    }
}