{
    "question": "How might Han Duck-soo’s impeachment by South Korea’s Parliament shape the country’s governance and political stability in the coming weeks?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nProtesters hold banners showing images of impeached President Yoon Suk Yeol, right, and acting President Han Duck-soo during a rally demanding Han’s impeachment outside of the National Assembly in Seoul, South Korea, Dec. 27, 2024. The signs read “Impeachment immediately” (AP Photo/Ahn Young-joon)\n\nLawmakers of the ruling People Power Party protest to South Korea’s National Assembly Speaker Woo Won Shik, top center, during a plenary session for the impeachment motion against South Korean acting President Han Duck-soo at the National Assembly in Seoul, South Korea, Friday Dec. 27, 2024. (AP Photo/Ahn Young-joon)\n\nImpeached South Korean acting President Han Duck-soo gets into a car as he leaves the government complex building in Seoul, South Korea, Friday, Dec. 27, 2024. (Hong Hae-in/Yonhap via AP)\n\nSouth Korea’s acting President Choi Sang-mok speaks during the National Security Council at the government complex building in Seoul, South Korea, Friday, Dec. 27, 2024. (Hong Hae-in/Yonhap via AP)\n\nLawmakers of the ruling People Power Party protest to South Korea’s National Assembly Speaker Woo Won Shik, top center, during a plenary session for the impeachment motion against South Korean acting President Han Duck-soo at the National Assembly in Seoul, South Korea, Friday Dec. 27, 2024. (AP Photo/Ahn Young-joon)\n\nProtesters stage a rally demanding the arrest of impeached South Korean President Yoon Suk Yeol outside of the Constitutional Court in Seoul, South Korea, Friday, Dec. 27, 2024. The signs read, “Fire the rebellion leader Yoon Suk Yeol immediately.” (AP Photo/Ahn Young-joon)\n\nWreaths sent by supporters of impeached South Korean President Yoon Suk Yeol are displayed outside the Constitutional Court in Seoul, South Korea, Friday, Dec. 27, 2024. (AP Photo/Ahn Young-joon)\n\nSouth Korea’s opposition Democratic Party leader Lee Jae-myung, bottom center, walks past lawmakers of the ruling People Power Party protesting to South Korea’s National Assembly Speaker Woo Won Shik, top center, during a plenary session for the impeachment motion against South Korean acting President Han Duck-soo at the National Assembly in Seoul, South Korea, Friday Dec. 27, 2024. (AP Photo/Ahn Young-joon)\n\nSEOUL, South Korea (AP) — Theimpeachmentof South Korea’s acting PresidentHan Duck-sooFriday has plunged the country into further political turmoil, coming less than two weeks after lawmakers impeached PresidentYoon Suk Yeol.\n\nThe successive impeachments that suspended the country’s top two officials are unprecedented, and the deputy prime minister and finance minister, Choi Sang-mok, is now South Korea’s new interim leader. Upon taking over power, Choi swiftly ordered the military to boost readiness to thwart potential North Korean aggressions and told diplomats to reassure key partners like the U.S. and Japan.\n\n“(Han’s) impeachment now creates an opportunity for external threats while causing Korea’s foreign partners to alienate it from the global community,” said Duyeon Kim, a senior analyst at the Center for a New American Security in Washington.\n\nA look at the latest developments on the South Korean political tumult, which began with Yoon’s short-lived Dec. 3 martial law.\n\nPrime Minister Han Duck-soo, the No. 2 official in South Korea, became the acting leader after the assembly impeachedYoonon Dec. 14 over hismartial law decreethat brought hundreds of troops into Seoul streets and harkened back to the days of military rule in the 1960-70s.\n\nHan, a career bureaucrat, tried to reassure major diplomatic partners and stabilize markets. But he was embroiled in political strife with the main liberal opposition Democratic Party, which holds a majority in the assembly. A major trigger for Han’s impeachment was his refusal to accept a DP demand that he immediately appoint threevacant justices’ seatsat the Constitutional Court to enhance fairness and public confidence in its ruling on Yoon’s impeachment.\n\nRestoring the court’s full nine-member panel is crucial because a court ruling to remove Yoon from office needs backing from at least six justices, and a full bench will likely increase the prospects for Yoon’s ouster. Han said he wouldn’t appoint the justices without bipartisan consent, but critics suspect he was siding with Yoon’s loyalists at the governing People Power Party, or PPP, who want to see Yoon regaining power.\n\nChoi Jin, director of the Seoul-based Institute of Presidential Leadership, said Han lacked legitimate reasons to go against the appointment of the court justices. But he noted that DP shouldn’t have pursued Han’s impeachment so hurriedly.\n\nHan’s impeachmentcame as South Korea has been telling the world that things have returned to normal in the aftermath of the marital law incident, which caused worries from neighbors, halted high-level diplomacy and shook financial markets.\n\nYoon’smartial lawstunt baffled policy makers in the U.S, Japan and Europe as he has been their key diplomatic partner against shared challenges including China’s assertiveness, North Korean nuclear threats and vulnerabilities in global supply chains.\n\n“South Korea is now in a far more serious crisis of leadership and governance. The DP’s political gambit is actually putting the country’s economy and national security at grave risk,” Duyeon Kim said. “Han had the experience and credentials to deal with both security and financial crises if they arise during South Korea’s political uncertainty.”\n\nChoi Jin doubted acting leader Choi would smoothly engage with diplomacy with world leaders. “We’ll suffer a disgrace internationally and our international credibility will plunge,” he said. “Negative effects on economy, culture and all other sectors will likely come quietly and extensively.”\n\nThe governing party argued Han’s impeachment was “invalid” because it passed with a simple majority in the 300-member assembly, not a two-thirds majority as claimed by the PPP.\n\nThere are no specific laws on the impeachment of an acting president, and the PPP filed a petition with the Constitutional Court to review the vote.\n\nIt’s not clear when the court will rule on that request. The Constitutional Court has up to 180 days to determine whether to uphold the impeachment of both Yoon and Han, though their decisions are expected to come sooner.\n\nHan called his impeachment “regrettable” but said he respects the assembly’s decision.\n\nThe court had its first pretrial on Yoon’s case on Friday. If Yoon is thrown out of office, a national election to find his successor must take place within 60 days. Yoon and others faceseparate probesby investigative agencies on allegations that they committed rebellion, abuse of power and other crimes in connection with the martial law decree.\n\nAccording to surveys, Democratic Party leaderLee Jae-myungis a clear favorite to win a possible presidential by-election in the event of Yoon’s ouster. But Lee has own legal issues, and could possibly be prohibited from running for president if the appellate and Supreme courts uphold his lower court conviction forelection law violationin November.\n\nIf he becomes president, his trials would stop because South Korean law give a sitting president immunity from most criminal prosecution.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Reporting by Joyce Lee, Hyunsu Yim, Hyunjoo Jin, Moon Youn-ah, Cynthia Kim; Writing by Josh Smith, Jack Kim; Editing by Ed Davies, Clarence Fernandez and Ros Russell\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nSeoul-based reporter covering the Koreas with a focus on South Korean politics, North Korea's missile tests and the K-pop industry. Before joining Reuters, he worked at The Korea Herald.",
        "source_3": "Lawmakers fromSouth Korea’sopposition party impeached Prime Minister and acting President Han Duck-soo.\n\nTheimpeachmentis the latest event to mar South Korea after a political firestorm following a sudden, unpopular declaration of martial law by President Yoon Suk Yeol. The declaration led to Yoon’s impeachment on Dec. 14.\n\nHan’s impeachment was the first time an interim leader had been impeached in South Korean history. He was in office for just 13 days, making him the shortest-serving leader in South Korean history, a record previously held by his immediate predecessor.\n\nHan’s impeachment won the support of 192 lawmakers, much more than the needed 151 out of 300 seats. He bowed to the vote for the sake of political stability.\n\n“In order not to add to the confusion and uncertainty, I will suspend my duties in line with relevant laws, and wait for the swift and wise decision of the Constitutional Court,” he said in a statement.\n\nFinance Minister and Deputy Prime Minister Choi Sang-mok assumed the presidency after Han’s ousting on Friday.\n\n“The most important thing right now is to minimize the confusion in state affairs,” he said after becoming interim president. “The government will do its best to stabilize them.”\n\nThe legislative body justified its second impeachment of a top politician by saying Han refused on Thursday to appoint three judges to fill vacancies in the Constitutional Court, which will decide whether to remove Yoon.\n\nHan said he held off on doing so until his People Power Party and the opposition bloc, including the Democratic Party and other smaller parties, can agree on whether an acting president can appoint such positions.\n\nAn acting president should “refrain from exercising the president’s own significant powers, including the appointment of constitutional institutions,” he said.\n\nDemocratic Party floor leader Park Chan-dae told reporters that Han’s words were “not those of an acting president, but of one who is admitting to insurrection.” His party has accused the acting leader of aiding Yoon’s declaration of martial law earlier this month.\n\nHowever, the two main opposing parties disagreed on how many votes were needed to remove Han. The majority party said a two-thirds threshold must be met because the prime minister is acting president, while the opposition says only a majority is needed.\n\nThe opposition party likely has the votes needed for a majority but not for a two-thirds majority.\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nOn Dec. 4, Yoondeclared martial lawfor the first time in South Korea since 1980 and for the first time since the country became a democracy. His rationale was alleged pro-North Korean interests taking control of parliament and other “anti-state” forces. Immediately, opposition lawmakers rushed to the National Assembly, jumping over barricades and locking out special forces soldiers. Before the soldiers could enter the chamber, parliament unanimously voted to overturn martial law, leading to its end six hours later.\n\nThe saga has shaken South Korea’s international image, jeopardizing its long-standing alliance with the United States and Washington’s efforts in East Asia."
    }
}