{
    "question": "How should Congress and her constituents handle expectations for transparency and representation when a sitting lawmaker, such as Rep. Kay Granger, is in assisted living with dementia issues and has not voted since July?",
    "content": {
        "source_1": "The Texas lawmaker had been noticeably absent from Congress in recent months.\n\nRep. Kay Granger, who was first elected in 1996, announced in 2023 that she would not seek another term in office. | Francis Chung/POLITICO\n\nThe son of Rep. Kay Granger (R-Texas) confirmed that his mother has “dementia issues” that have kept her away from Congress in recent months, the Dallas Morning News reported Sunday.\n\n“It’s been a hard year,” Brandon Granger, 52, was quotedas saying by the newspaper.He also said she was living in Traditions Senior Living in Fort Worth, Texas.\n\nKay Granger, 81, had been the chair of the House Appropriations Committee until stepping down from that position in April, making her absence particularly noticeable during the recent negotiations over legislation designed to avert a government shutdown.\n\nHer situation attracted attention after an article was publishedin The Dallas Express(“Where is Congresswoman Kay Granger?”) in which it was reported that Granger had been residing in “a local memory care and assisted living home for some time after having been found wandering lost and confused in her former Cultural District/West 7th neighborhood.”\n\nThe publication noted she had not voted on the House floor since July.\n\nA statement from Granger’s office specified that she “is not in memory care” but did not deny other elements of The Dallas Express article. (Her son also said she was not in a memory care unit.) Brandon Granger told the Dallas Morning News: “There’s nothing wrong with someone wanting to live in a community with other folks their age.”\n\nKay Granger’s office also provided a statement from her:\n\n“I am deeply grateful for the outpouring of care and concern over the past several days. As many of my family, friends, and colleagues have known, I have been navigating some unforeseen health challenges over the past year. However, since early September, my health challenges have progressed making frequent travel to Washington both difficult and unpredictable. During this time, my staff has remained steadfast, continuing to deliver exceptional constituent services, as they have for the past 27 years.”\n\nGranger, who was first elected in 1996, announced in 2023 that she would not seek another term in office. Craig Goldman, a fellow Republican from Fort Worth, won the open seat in November.\n\nThe news of her situation prompted some quips about the general age of American leadership. “I’m more concerned about the congressmen who have dementia and are still voting,” Rep.Thomas Massie(R-Ky.)wrote on X.\n\n“Kay Granger’s long absence reveals the problem with a Congress that rewards seniority & relationships more than merit & ideas. We have a sclerotic gerontocracy,” Rep.Ro Khanna(D-Calif.)wrote on X. “We need term limits. We need to get big money out of politics so a new generation of Americans can run and serve.”\n\nGranger is one of 23 members of Congress (16 in the House and seven senators) who are at least 80 years old, a group that is led by Sen. Chuck Grassley (R-Iowa), who is 91.",
        "source_2": "Retiring U.S. Rep. Kay Granger, R-Fort Worth, has missed votes in Congress since the summer and her son said she has been “having some dementia issues late in the year.”\n\nThe last time the 81-year-old congresswomancast a voteon the House floor was the morning of July 24.\n\nIn a statement from her office, Granger expressed gratitude for the public’s concern and said that since early September, her health issues have made frequent travel to Washington, D.C., “both difficult and unpredictable.”\n\nGet the latest politics news from North Texas and beyond.\n\nBy signing up you agree to ourTerms of ServiceandPrivacy Policy\n\n“As many of my family, friends, and colleagues have known, I have been navigating some unforeseen health challenges over the past year,” the statement said.\n\nGranger added she was able to return to Washington in November to hold meetings and oversee the closure of her office.\n\nFrom South Carolina, Brandon Granger, 52, toldThe Dallas Morning NewsSunday, “It’s been a hard year,” adding it has been a surprise how quickly the health issues have progressed.\n\nBrandon said his mother is living at Tradition Senior Living in Fort Worth, but she is not in a memory care facility, as some media reports have stated. He said that while the facility has a memory care community on the same property, Granger resides in the independent living facility.\n\nOn its website, Tradition Senior Living says it offers “resort-style living with ultra-inclusive services” on “approximately six acres along the Trinity River with miles of walking trails.” Brandon said his mother made the move because she wanted to be in a more active community of other older people.\n\n“There’s nothing wrong with someone wanting to live in a community with other folks their age,” he said. “She’s in a building with a lot of other folks her age that are super active that she really loves. She has exercise classes, she gets to be around people all the time, it’s wonderful for her for this point in life.”\n\nTradition Senior Living said it was not able to confirm the residency status of any individual when reached by phone Sunday.\n\nGranger has three children and five grandchildren, according to her congressional website.\n\nShe announced in November 2023 shewould not seek reelection.\n\n“It’s time for the next generation to step up and take the mantle and be a strong and fierce representative for the people,” she said in a statement at the time.\n\nAfter her announcement,state Rep. Craig Goldman,R-Fort Worth, filed for the seat. He defeated businessman John O’Shea in a primary runoff and Democrat Trey Hunt in the general election. He will be sworn in to office Jan. 3.\n\nGranger closed out her long tenure in Congress by missing several months of votes.\n\nShemissed votesthe night of July 24 and the next day before the House broke for its August recess. The House did not vote again until Sept. 9. Lawmakers left for the campaign trail after voting Sept. 25 and did not vote again until they returned Nov. 12.\n\nThe final vote of the 118th Congress was Friday, when the House passed a spending bill to keep the government open. The tally was 366-34. Granger was one of 29 members who did not vote.\n\nDespite missing these votes, Granger did attend a celebration of her career on theHouse Appropriations Committeein mid-November in Washington.\n\n“As my time in Congress comes to an end, I feel fulfilled and depart with optimism that this chamber will continue to serve the best interests of the American people,” she said according to a press release.\n\nA photo of her laughing while looking at her official portrait, unveiled at the celebration, wasposted to her professional X page.\n\nGranger set a number of “firsts” over the years. She servedas Fort Worth’s first female mayorand became thefirst Republican woman elected to the U.S. House from Texasin 1996.\n\nLast year, she was thefirst Republican woman to take over as chairof the House Appropriations Committee, a powerful panel responsible for crafting federal spending bills.\n\nIt was widely assumed one factor in her decision to retire, aside from her age, was the fact that House GOP rules set a three-term limit for top committee positions.\n\nShe’d already served two terms as the senior Republican when Democrats controlled the House, so absent a waiver, she would have been forced to give up the gavel in the following session.\n\nShestepped down as chair of the committeein March, after Congress wrapped up the previous round of spending bills.\n\nIn a statement at the time, Granger noted the appropriations process typically pushes well beyond fall deadlines in election years. She said she was stepping down early to ensure a seamless transition to the new chair as the committee began focusing on the next round of spending bills.\n\nOn the committee, Granger has been a leading Republican voice on national security. She has pushed for robust defense spending and advocated for systems produced by defense contractors in the Fort Worth area, such as Lockheed Martin’s F-35 jets.\n\nShe secured funding for other priorities in the district, including the $1.1 billion Trinity River Vision/Central City flood control project.\n\nHardline conservatives often criticized Granger as a Republican in name only who was emblematic of a GOP establishment too eager to compromise with Democrats.\n\nThose criticisms intensified after she was among the relatively small group of Republicans who blockedHouse Judiciary Chairman Jim Jordan’sbid to become speaker last year.\n\nMonths before she had announced her retirement, O’Shea launched a primary challenge against Granger, slamming her as “the matriarch of the opposition.”\n\nJulia is a breaking news reporter with the Dallas Morning News, currently focused on covering weather and climate. She is a Louisiana native and a graduate of the University of Mississippi where she studied journalism and public policy. She previously covered education for Mississippi Today in Jackson, Miss.\n\nJoseph Morton covers the intersection of business and politics in the Washington Bureau. Before joining The News, Joseph worked for CQ Roll Call and the Omaha World-Herald. He graduated from the University of Missouri School of Journalism.\n\nThank you for reading. We welcome your thoughts on this topic. Comments are moderated for adherence to ourCommunity Guidelines. Please read the guidelines before participating.",
        "source_3": "Fox News Flash top headlines are here. Check out what's clicking on Foxnews.com.\n\nRep. Kay Granger, R-Texas, has been living in a retirement facility, a source told Fox News on Sunday. The source also denied a local news report that said she was in a memory care facility.\n\nGranger, who is retiring at the end of thiscongressional term,has largely remained absent from the Capitol in recent months, having last cast votes on July 24. She was not present for over 54% of votes this year.\n\nTheDallas Expressinvestigated the 81-year-old congresswoman's absence, publishing a report on Friday that quoted a constituent of her district who said that Granger was residing in a memory care facility in Texas. The report was later picked up by other news outlets.\n\nFox News spoke with a source from Granger's office who denied that Granger was in a memory care unit. The source told Fox News that Granger is in a retirement facility where memory care is provided, though not in the memory care unit itself.\n\nHOUSE PASSES FUNDING BILL WITH JUST HOURS UNTIL GOVERNMENT SHUTDOWN\n\nRep. Kay Granger leaves the House Republicans' caucus meeting at the Capitol Hill Club in Washington, May 10, 2023.(Bill Clark/CQ-Roll Call, Inc via Getty Images)\n\nGranger released a statement to Fox News, saying that she has faced\"health challenges\"and is \"deeply grateful for the outpouring of care and concern\" over the weekend.\n\n\"As many of my family, friends, and colleagues have known, I have been navigating some unforeseen health challenges over the past year,\" Granger said in the statement. \"However, since early September, my health challenges have progressed making frequent travel to Washington both difficult and unpredictable. During this time, my incredible staff has remained steadfast, continuing to deliver exceptional constituent services, as they have for the past 27 years.\"\n\nRep. Kay Granger speaks during a news conference with other Republican members of the House at the Capitol on July 21, 2020.(Samuel Corum/Getty Images)\n\nGranger, who did not seek re-election for the coming term, has served in the House since 1997. She previously served as the first female mayor of Fort Worth, Texas.\n\nWhile Granger appears to not have cast a vote since July, she did return to the Capitol in November for the unveiling of her portrait as Appropriations Committee Chairwoman, and a reception that followed. House Speaker Johnson, R-La., and House Majority Leader Steve Scalise, R-La., both spoke at the event.\n\nGOP REP-ELECT OUTLINES HOW DOGE, TRUMP AGENDA WILL GET COUNTRY ‘BACK ON TRACK’: ‘NO MORE BUSINESS AS USUAL’\n\nOne senior Republican source told Fox News that Granger did not step down earlier due to the paper-thinGOP House majority.\n\n\"Frankly, we needed the numbers,\" the source told Fox News.\n\nThe slim majority presents a challenge for the speaker of the 119th Congress, in whichvote attendancecould be the difference between success or defeat for Republicans.\n\nFox News reached out to Johnson's office for comment.\n\nGranger’s long absence was blasted by Rep. Ro Khanna, D-Calif., in a post on X.\n\n\"Kay Granger's long absence reveals the problem with a Congress that rewards seniority & relationships more than merit & ideas,\" he wrote. \"We have a sclerotic gerontocracy. We need term limits. We need to get big money out of politics so a new generation of Americans can run and serve.\"\n\nKhanna was one of the few lawmakers who previously criticized what he referred to as the \"gerontocracy.\" In May 2023, he called on Democratic Sen. Dianne Feinstein, who was then aged 89, to step down as her own health issues kept her away from the Capitol. Feinstein died months later in September 2023.\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox"
    }
}