{
    "question": "How might the shooting of an off-duty CBP officer in Manhattan influence New York City’s approach to sanctuary policies and bail laws, and what actions could local and federal authorities take to address public safety concerns while maintaining community trust?",
    "content": {
        "source_1": "The officials also faulted Mayor Eric Adams of New York, where the shooting occurred, and promised to flood the city with federal agents who would search for undocumented migrants.\n\nTrump administration officials on Monday blamed Mayor Eric Adams and New York City’spro-immigrant lawsfor theshooting of an off-duty customs officerduring an attempted robbery, and they warned that federal agents will flood the city in search of people who entered the United States illegally.\n\nThe 42-year-old officer was sitting with a friend in a Manhattan park late Saturday night when two men rode up on a scooter, police officials said. One of the men approached the officer and revealed a firearm, and when the officer realized he was being robbed, he drew his service weapon and the two men exchanged gunfire. Later that night, the police detained Miguel Francisco Mora Nunez, 21, who had come from the Dominican Republic in 2023, as a person of interest in the shooting.\n\nOn Monday, Kristi Noem, the U.S. homeland security secretary, said during a news conference in New York that a second person, Cristian Aybar Berroa, had been detained in connection with the attack. Ms. Noem said that both men were undocumented immigrants from the Dominican Republic, and police officials had said that Mr. Mora Nunez was wanted in connection with other violent crimes.\n\n“When I look at what Mayor Adams has done to New York City, it breaks my heart to see the families that have suffered because of his policies,” Ms. Noem said. She accused Mr. Adams and mayors from other Democratic cities of “protecting criminals who go out and murder, rape, rob.”\n\nThomas Homan, President Trump’s top border adviser, said that federal officials planned to ramp up immigrant detentions in New York and cities withso-called sanctuary policies, which usually prevent local law enforcement officers from cooperating with federal immigration authorities. Mr. Homan had made the threat before, but it has since been buttressed by an infusion ofbillions of dollars for immigration enforcement effortsas part of Mr. Trump’s recently passed domestic policy law.\n\n“Sanctuary cities are now our priority,” Mr. Homan said, adding that federal agents would “flood the zone.”\n\nWe are having trouble retrieving the article content.\n\nThank you for your patience while we verify access. If you are in Reader mode please exit andlog intoyour Times account, orsubscribefor all of The Times.\n\nThank you for your patience while we verify access.",
        "source_2": "Dan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nBillal Rahman is an immigration reporter based in London, U.K. He specializes in immigration policy and border security. He has uncovered allegations of misconduct among border agents under investigation and exposed claims of abuse at ICE-run detention centers in the U.S. He joined Newsweek in 2024 from The Independent. He has covered the British Post Office scandal and the conflict between Israel and Hamas. Originally from Glasgow, he studied Journalism in Edinburgh and then worked for STV News before moving to London in 2022. You can contact Billal at b.rahman@newsweek.com.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nHomeland Security SecretaryKristi Noemon Monday morning placed the blame forthe attack of an off-duty Customs and Border Protection (CBP) officeron New York CityMayor Eric Adamsand his city's sanctuary policies.\n\nNoem said one of the two suspects in Saturday's attack entered the U.S. during the Biden administration and had been shielded from Immigration and Customs Enforcement (ICE) in the city.\n\n\"He was arrested four different times in New York City and, because of the mayor's policies and sanctuary city policies, was released back to do harm to people and individuals living in this city,\" Noem said.\n\n\"Make no mistake—this officer is in the hospital today fighting for his life because of the policies of the mayor of this city and the City Council and the people that were in charge of keeping the public safe.\"\n\nWhen approached for comment, New York City HallreferredNewsweekto a press conference Mayor Adams held Monday morning, where he was asked about Noem's remarks.\n\n\"I have nothing to do with the rules that are put in place, I just carry out the rules,\" Adams said, emphasizing immigrants' rights to access education and health care.\n\n\"I am extremely angry that we have a Customs and Border [Protection] officer that is in the hospital because a person that should have not been on our streets was on our streets.\"\n\nThe Trump administration has viewedsanctuary cities and statesas barriers to federal immigration enforcement, withlocal police not involved in ICE activity. Adams has said he supports ICE when it comes to seeking out suspected illegal immigrants and wasseen to have been far more cooperativethan his counterparts in Boston, Chicago and Los Angeles.\n\nTheDepartment of Homeland Security(DHS) arrested Miguel Francisco Mora Nunez and Christhian Aybar-Berroa in connection with the shooting in Fort Washington Park under theGeorge WashingtonBridge in upper Manhattan on Saturday night.\n\nFootage released by the agency showed two armed men approach an off-duty CBP officer at a park before exchanging gunfire.\n\nNunez was initially taken into custody by U.S. Border Patrol in April 2023 after crossing the southern border in Arizona. He was later released into the United States pending further immigration proceedings.\n\nNunez has been arrested multiple times by law enforcement agencies since his arrival in the United States, according to DHS.\n\nOn October 11, 2023, the New York City Police Department (NYPD) charged him with felony grand larceny, petit larceny and reckless driving.\n\nIn October 2024, he was arrested and charged with assault in the second and third degrees, followed by an arrest for criminal contempt in November of the same year. He was arrested again for criminal contempt in January 2025.\n\nIn February 2025, the Leominster Police Department in Massachusetts issued a criminal warrant for his arrest in connection with an armed robbery involving a firearm.\n\nNunez was issued a removal order in November 2024 after failing to appear at an immigration hearing.\n\nAybar-Berroa was apprehended by federal agents on Monday.\n\nHe is a citizen of the Dominican Republic and entered the United States without authorization in 2022. According to DHS, an immigration judge issued a final order of removal against him in 2023.\n\nAybar-Berroa has a criminal record in New York City, including arrests on charges of reckless endangerment and larceny. Noem said that detainers requesting his transfer into federal custody were not honored by local authorities.\n\nAybar-Berroa was released from local custody before ICE agents could detain him.\n\nNoem's assertion that New York's sanctuary policies led to the attack repeats a similar message to others from the White House since January—that the policiesprevent ICE from detaining alleged criminalsbefore they can commit serious crimes.\n\nThat is despite most sanctuary policies, which differ by location, generally allowing police and sheriff's departments to cooperate with federal agents when it comes to serious and violent criminals.\n\nThere have been notable incidents in the past year in New York City involving illegal immigrants, includingthe death of a womanwho wasset on fireon the subway.\n\nAdams was seen to make a deal of sorts with the White House in the early days of the second Trump administration, appearing onFox Newswith border czarTom Homanand promising to work with ICE on serious illegal immigrant criminals. The mayor was clear, however, that he did not want the city's wider undocumented population to live in fear.\n\nHomeland Security Secretary Kristi Noem told reporters Monday morning:\"How many more lives will it take? How many more people have to be hurt and victimized before we have public safety be a number one priority in some of our largest cities? When I look at what Mayor Adams has done to New York City, it breaks my heart to see the families that have suffered because of his policies.\"\n\nBorder czar Tom Homan told reporters Monday:\"Sanctuary cities are sanctuaries for criminals. Hard stop.\"\n\nNew York City Mayor Eric Adams, during a press conference Monday:\"He [Nunez] has inflicted violence in our city and once he is charged for last night's crimes, we will be able to add attempted murder to his rap sheet.\"\n\nDHS spokesperson Tricia McLaughlin, in a statement:\"This violent criminal illegal alien [Nunez] had multiple run-ins withNYPDfor assault and felony grand larceny before he ambushed and shot a CBP officer.\"\n\nNoem urged sanctuary cities and states to change their policies now, saying leaders there took an oath to protect their citizens. Those leaders have argued that they do, and that it is the federal government's job to enforce immigration laws.\n\nUpdate 7/21/25, 3:55 p.m. ET: This article was updated with a response from New York City Hall.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nBillal Rahman is an immigration reporter based in London, U.K. He specializes in immigration policy and border security. He has uncovered allegations of misconduct among border agents under investigation and exposed claims of abuse at ICE-run detention centers in the U.S. He joined Newsweek in 2024 from The Independent. He has covered the British Post Office scandal and the conflict between Israel and Hamas. Originally from Glasgow, he studied Journalism in Edinburgh and then worked for STV News before moving to London in 2022. You can contact Billal at b.rahman@newsweek.com.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security.                                    ...Read more",
        "source_3": "Retired Border Patrol Agent Chris Clem and former Homeland Security advisor Chuck Moreno join 'America's Newsroom' to weigh in on an illegal immigrant allegedly shooting and injuring an off-duty Border Patrol agent.\n\nThe head of U.S. Immigration and Customs Enforcement (ICE) is blasting leading New York mayoral candidateZohran Mamdanifor his \"deafening\" silence in the wake of Saturday night's shooting of a Customs and Border Protection officer in a city park.\n\nIn a statement to Fox News Digital, acting ICE Director Todd Lyons said, \"The silence from Zohran Mamdani is not just deafening, it’s deliberate, disturbing, and sadly predictable.\"\n\nLyons went on to say that Mamdani’s \"reckless anti-law enforcement policy positions would endanger legal, law-abidingNew Yorkers.\"\n\n\"His silence in the face of this brutal attack speaks volumes about where his priorities lie, and it’s not with public safety and the American people,\" said Lyons.\n\nBORDER PATROL SAYS SOME ILLEGAL MIGRANTS ARRESTED IN SACRAMENTO RAID HAD CRIMINAL HISTORIES\n\nActing ICE Director Todd Lyons, left, and New York City Democratic mayoral candidate Zohran Mamdani(Matt Stone/MediaNews Group/Boston Herald via Getty Images; Angela Weiss/AFP via Getty Images)\n\nThis comes after analleged attempted robberyby two criminal illegal immigrants, Dominican nationals Cristian Aybar Berroa and Miguel Francisco Mora Nunez, led to a shootout in which an off-duty CBP officer was struck in the face and forearm. He has been hospitalized and is in stable condition.\n\nNunez was shot in the leg and groin during the shootout, police said. He was dropped off at a hospital in the Bronx, according to authorities. Both suspects have been apprehended.\n\nIn response to the shooting, Homeland Security SecretaryKristi Noemsaid New York City sanctuary policies are responsible.\n\nDHS Assistant Secretary Tricia McLaughlin told Fox News Digital that \"sanctuary politicians must condemn this violence and put the safety and security of our citizens first.\"\n\n\"Make no mistake: these criminal illegal aliens pulled the trigger, but Zohran Mamdani, and other sanctuary politicians in this country have blood on their hands,\" said McLaughlin, adding, \"Secretary Noem is calling on every politician at every level of government to abandon these reckless, lawless policies and stop playing Russian roulette with American lives.\"\n\nHOUSE REPUBLICANS CRITICIZE DEMOCRATS FOR ANTI-ICE RHETORIC\n\nCristian Aybar-Berroa, left, and Miguel Francisco Mora Nunez have been taken into custody following the shooting of an off-duty CBP officer in New York City on Saturday, July 19.(Department of Homeland Security )\n\nShe added that DHS \"will continue to flood the zone in sanctuary cities and remove these criminals one by one.\"\n\nMeanwhile, Mamdani, who, as the Democratic nominee, is the likely frontrunner for New York City mayor, has yet to address the incident.\n\nMamdani's social media posts and website show no public statement on the matter, which has become national news and sparked a broader discussion of PresidentJoe Biden'sborder policies and criticism of sanctuary cities.\n\nFox News Digital reached out to Mamdani's campaign for comment but did not immediately hear back.\n\nMamdani has been widely criticized for his previous calls to defund the police and his stated opposition to working with Trump to deport illegal immigrants if he is elected mayor in November. After winning the primary race in June, Mamdani said he would halt \"masked\" U.S. Immigration and Customs Enforcement (ICE) officials from \"deporting our neighbors.\"\n\nThe mayoral hopefulannounced on Sundaythat he was headed to Uganda \"in a personal capacity\" to celebrate his marriage to his wife, Rama, with their family and friends.\n\nNOEM BLAMES 'SANCTUARY' POLICIES FOR MIGRANT ACCUSED OF SHOOTING OFF-DUTY CBP OFFICER\n\nZohran Mamdani speaks at his primary election party, June 25, 2025, in New York.(AP Photo/Heather Khalifa)\n\n\"I do want to apologize to the haters, because I will be coming back,\" he said, adding he would return to New York City \"by the end of the month.\"\n\nSome of Mamdani's opponents have responded to the shooting by calling for the arrest of criminal illegals.\n\nOn Monday, Mayor Eric Adams said he would\"welcome\" the Trump administrationsending more ICE agents to New York City if they \"go after dangerous people like this individual who shot an innocent Customs and Border Patrol agent.\"\n\nAdams noted, however, that \"if it's going to be to go after everyday individuals who are trying to complete the path to be a citizen, I don't think we should do that.\"\n\nRepublican mayoral nominee Curtis Sliwa has said, \"I am the only candidate on the ballot who opposes sanctuary city status. Adams, Cuomo, and Mamdani all support it.\"\n\nFormer Gov.Andrew Cuomo, who is running for mayor as an independent, did not immediately respond to Fox News Digital's request for comment.\n\nBLUE STATE POLITICIANS REPEATEDLY ALLOWED CRIMINAL MIGRANTS TO RUN RAMPANT THROUGH AMERICAN CITIES: BEN DOMENECH\n\nNew York City mayoral candidates Zohran Mamdani, Eric Adams, Andrew Cuomo and Curtis Sliwa(Getty Images)\n\nFederal immigration authorities have faced an increase in public scrutiny from Democrats and left-wing activist groups, even to the point of violence. Border Patrol was targeted in an ambush earlier this month at an annex facility in McAllen, Texas, where alocal police officerwas hit in the leg, and two Border Patrol personnel were injured. The gunman was killed.\n\nIn addition, 12 individuals are facing charges, including 10 forattempted murderof federal officers, in an Independence Day attack outside the Prairieland Detention Center in Alvarado, Texas, intended to target ICE agents. A police officer was shot in the neck but is expected to recover, and cars were vandalized.\n\nOverall, ICE agents have faced an 830% increase in assaults since this time last year as the Trump administration continues to ramp up deportation and immigration enforcement efforts, according to DHS.\n\nFox News Digital's Andrew Mark Miller and Deirdre Heavey contributed to this report.\n\nCameron Arcand is a politics writer at Fox News Digital in Washington D.C. Story tips can be sent to Cameron.Arcand@Fox.com and on Twitter: @cameron_arcand\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}