{
    "question": "How did Donald Trump and Elon Musk’s public criticisms influence House Republicans’ shift to a slimmer funding bill, and what does the bill’s defeat indicate about congressional dynamics and the prospects of averting a shutdown?",
    "content": {
        "source_1": "Updated on:  December 21, 2024 / 9:51 PM EST/ CBS News\n\nWashington— President Biden signed a funding bill to avert a prolonged government shutdown into law on Saturday, ending a turbulent week in Washington.\n\nEarly Saturday morning, the Senate overwhelmingly approved the bill by a margin of 85-11, with most Democrats and Republicans supporting the measure. Just hours earlier, the House passed thelegislationwith a vote of 366 in favor to 34 against and one member voting present, with more Democrats voting to support it than Republicans. The Senate vote came just after the Friday midnight deadline that would have marked the beginning of the shutdown.\n\n\"The bipartisan funding bill I just signed keeps the government open and delivers the urgently needed disaster relief that I requested for recovering communities as well as the funds needed to rebuild the Francis Scott Key Bridge,\" Mr. Biden said in a statement. \"This agreement represents a compromise, which means neither side got everything it wanted. But it rejects the accelerated pathway to a tax cut for billionaires that Republicans sought, and it ensures the government can continue to operate at full capacity. That's good news for the American people, especially as families gather to celebrate this holiday season.\"\n\nEarly Saturday morning, the Office of Management and Budget said in a statement that it had \"ceased shutdown preparations because there is a high degree of confidence that Congress will imminently pass the relevant appropriations and the President will sign the bill on Saturday.\"\n\nIt capped a chaotic week in Washington that saw President-elect Donald Trump torpedo a deal that House Speaker Mike Johnson reached with Democrats, a potential glimpse at the difficulties Republicans will face when they assume control of Congress and the White House next month.\n\nThe measure extends current government funding through March 14 and provides $100 billion in disaster relief funds to help with hurricane recovery and other natural disasters. It also allocates $10 billion in aid to farmers.\n\nIt does not address the debt ceiling, something Trump had demanded during the tumultuous back-and-forth over the course of the week. House Republicans instead vowed to address the issue in a future tax bill once Trump is in power.\n\nJohnson painted the measure as a \"necessary step to bridge the gap\" before Republicans take control of both chambers of Congress and the White House in January.\n\n\"Trying to jam a debt ceiling suspension into the legislation at the 11th hour was not sustainable,\" House Minority Leader Hakeem Jeffries said ahead of the vote. Jeffries later praised the bill's passage, saying \"House Democrats have successfully stopped the billionaire boys club.\"\n\nThe White House expressed support for the legislation as House members were voting on the floor.\n\n\"While it does not include everything we sought, it includes disaster relief that the president requested for the communities recovering from the storm, eliminates the accelerated pathway to a tax cut for billionaires, and would ensure that the government can continue to operate at full capacity,\" White House press secretary Karine Jean-Pierre said.\n\nThe bill was Johnson's third attempt this week to extend government funding and avoid a politically perilous shutdown heading into the holidays.\n\nAn earlier deal he crafted over several weeks of talks with Democrats collapsed when Republicans, led by Trump and billionaire Elon Musk, revolted against many spending provisions that went beyond extending funding at current levels.\n\nTrump's opposition sank that version of the bill, which stretched to 1,547 pages. He simultaneously issued a new demand: Republicans should suspend or abolish the debt ceiling. Doing so would effectively eliminate a source of leverage for Democrats when he is in power next year.\n\nJohnson tried to placate Trump by bringing up a slimmed-down, 116-page version of the bill on Thursday. It included disaster relief, farm aid and the debt ceiling. Trumpimmediately backed it, calling it a \"SUCCESS\" and \"a very good deal.\"\n\nBut many House Republicans were not as enthusiastic and balked at suspending the debt limit after years of railing against runaway deficit spending in Washington. Thirty-eight of them bucked the incoming president and voted down the bill, sending Johnson back to the drawing board.\n\nThe speaker huddled with fellow Republicans on Friday afternoon to chart a new path forward. He settled on a plan to bring up the bill without the debt ceiling suspension that irked many conservatives and nearly all Democrats.\n\nRepublicans made quick work of passing the bill, and it sailed through with a strong majority.\n\nTrump, for his part, publicly stayed quiet about the third version of the bill, while Muskquestionedwhether it was \"a Republican bill or a Democrat bill.\"\n\nJohnson said after its passage that he was in constant communication with Trump throughout the process.\n\n\"He knew exactly what we were doing and why,\" Johnson said. \"I think he certainly is happy about this outcome as well.\"\n\nThe speaker revealed he had also spoken with Musk shortly before the vote.\n\n\"We talked about the extraordinary challenges of this job,\" Johnson said. \"And I said, 'Hey, do you want to be speaker of the House?' …He said, 'This may be the hardest job in the world.'\"\n\nEd  O'Keefe,Laura  Garrison,Jaala  Brown,Alan  HeandRobert  Costacontributed to this report.\n\nCaitlin Yilek is a politics reporter at CBSNews.com, based in Washington, D.C. She previously worked for the Washington Examiner and The Hill, and was a member of the 2022 Paul Miller Washington Reporting Fellowship with the National Press Foundation.",
        "source_2": "Reporting by Richard Cowan, Katharine Jackson, Andy Sullivan and Bo Erickson; Additional reporting by Kanishka Singh, Jasper Ward and Mrinmay Dey; Editing by Scott Malone, Jonathan Oatis, Richard Chang and Daniel Wallis\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nAndy covers politics and policy in Washington. His work has been cited in Supreme Court briefs, political attack ads and at least one Saturday Night Live skit.",
        "source_3": "Fox News senior congressional correspondent Chad Pergram has the latest on the fight over the interim spending plan on 'The Ingraham Angle.'\n\nA bill to avert a partial government shutdown that was backed by President-elect Trump failed to pass the House of Representatives on Thursday night.\n\nCongress is inching closer to the possibility of a partial shutdown, with the deadline coming at the end of Friday.\n\nThe bill needed two-thirds of the House chamber to pass, but failed to even net a majority. Two Democrats voted with the majority of Republicans to pass the bill, while 38 GOP lawmakers bucked Trump to oppose it.\n\nIt comes after two days of chaos in Congress as lawmakers fought among themselves about a path forward on government spending – a fight joined by Trump and his allies Elon Musk and Vivek Ramaswamy.\n\nMeanwhile, thenational debthas climbed to over $36 trillion, and the national deficit is over $1.8 trillion.\n\nSpeaker of the House Mike Johnson, R-La., speaks as Republican presidential candidate former President Donald Trump listens during a news conference, Friday, April 12, 2024, at Mar-a-Lago in Palm Beach, Fla.(AP Photo/Wilfredo Lee)\n\nThe legislation was hastily negotiated on Thursday after GOP hardliners led by Elon Musk and Vivek Ramaswamy rebelled against an initial bipartisan deal that would have extended the government funding deadline until March 14 and included a host of unrelated policy riders.\n\nThe new deal also includes several key policies unrelated to keeping the government open, but the 116-page bill is much narrower than its 1,547-page predecessor.\n\nLike the initial bill, the new iteration extended the government funding deadline through March 14 while also suspending the debt limit – something Trump had pushed for.\n\nIt proposed to suspend the debt limit for two years until January 2027, still keeping it in Trump's term but delaying that fight until after the 2026 Congressional midterm elections.\n\nElon Musk helped tank the original bipartisan deal.(Samuel Corum/Getty Images)\n\nThe new proposal also included roughly $110 billion in disaster relief aid for Americans affected by storms Milton and Helene, as well as a measure to cover the cost of rebuilding Baltimore's Francis Scott Key Bridge, which was hit by a barge earlier this year.\n\nExcluded from the second-round measure is the first pay raise for congressional lawmakers since 2009 and a measure aimed at revitalizing Washington, D.C.'s RFK stadium.\n\nThe text of the new bill was also significantly shorter – going from 1,547 pages to just 116.\n\n\"All Republicans, and even the Democrats, should do what is best for our Country, and vote ‘YES’ for this Bill, TONIGHT!\" Trump wrote on Truth Social.\n\nBut the bill hit opposition before the legislative text was even released.\n\nDemocrats, furious at Johnson for reneging on their original bipartisan deal, chanted \"Hell no\" in their closed-door conference meeting on Thursday night to debate the bill.\n\nNearly all House Democrats who left the meeting indicated they were voting against it.\n\nMeanwhile, members of the ultra-conservative House Freedom Caucus also said they would vote against the bill.\n\n\"Old bill: $110BB in deficit spending (unpaid for), $0 increase in the national credit card. New bill: $110BB in deficit spending (unpaid for), $4 TRILLION+ debt ceiling increase with $0 in structural reforms for cuts. Time to read the bill: 1.5 hours. I will vote no,\" Rep. Chip Roy, R-Texas, wrote on X.\n\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\n\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox"
    }
}