{
    "question": "What are the potential implications of the NDAA’s combination of significant pay raises for junior troops and the prohibition on TRICARE coverage of gender-related surgeries for minors on military families, recruitment, and overall readiness?",
    "content": {
        "source_1": "The Senate on Wednesday passed the National Defense Authorization Act, or NDAA, a massive defense spending package that includes a ban on coverage of gender-affirming care for the transgender children of military service members.\n\nThe vote in the Senate was 85 to 14, after the House last weekpassed the bill, which was negotiated by Senate and House leaders of both parties. It now heads to President Joe Biden's desk.\n\nThe $895 billion bill sets the budget for the Defense Department for the following year. It includes over a thousand pages of defense policy, but the ban on gender-affirming care for minors drew particular ire from Democrats.\n\nOver 20 Democratic senators, led by Sen. Tammy Baldwin, of Wisconsin,sought to amend the billMonday to remove language that would ban the military's health care service, Tricare, from covering “medical treatment for military dependents under the age of 18 who are diagnosed with gender dysphoria.”\n\nTheir push was unsuccessful, but Senate Majority Leader Chuck Schumer on Tuesday acknowledged, \"Of course, the NDAA is not perfect.\"\n\n\"It doesn’t have everything either side would like. It includes some provisions that we Democrats would not have added and other provisions that we would want left out entirely. But of course, you need bipartisanship to get this through the finish line,\" Schumer added at a news conference on Capitol Hill.\n\nIn a separate speech on the Senate floor Tuesday, Schumer again acknowledged that the final version of the NDAA \"is not a perfect bill.\"\n\n\"It nonetheless has some very good things that Democrats fought hard for that will strengthen military families and boost tech innovation here at home, something very important to me,\" Schumer added, highlighting the Democratic wins in the bill.\n\nHouse Speaker Mike Johnson, R-La., was a major proponent of adding the ban on gender-affirming care for minors to the legislation, attacking gender-affirming care as \"radical woke ideology\" in a statement after the House vote last week.\n\nThe NDAA refocuses “the Pentagon on military lethality, not radical woke ideology. This legislation permanently bans transgender treatment for minors, prohibits critical race theory in military academies, ends the DEI bureaucracy, and combats antisemitism,\" Johnson said.\n\nIn the House, the billpassed281-140, with 200 Republicans and 81 Democrats voting in favor of it and 124 Democrats and 16 Republicans voting against it.\n\nIn a statement alongside her push to amend the bill and remove the language banning gender-affirming care, Baldwin said military service members had \"earned the right\" to make decisions about their children's care, rather than the federal government.\n\n“Let’s be clear: We’re talking about parents who are in uniform serving our country who have earned the right to make the best decisions for their families. I trust our service members and their doctors to make the best health care decisions for their kids, not politicians,” she said.\n\nRep. Adam Smith, D-Wash., the ranking member of the House Armed Services Committee, blasted the provision last week and voted against the bill.\n\n“The inclusion of this harmful provision puts the lives of children at risk and may force thousands of service members to make the choice of continuing their military service or leaving to ensure their child can get the health care they need,\" Smith said in a statement.\n\nAlexandra Marquez is a politics reporter for NBC News.",
        "source_2": "Reporting by Patricia Zengerle; Editing by Chizu Nomiyama and Diane Craft\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nPatricia Zengerle has reported from more than 20 countries, including Afghanistan, Iraq, Pakistan, Saudi Arabia and China. An award-winning Washington-based national security and foreign policy reporter who also has worked as an editor, Patricia has appeared on NPR, C-Span and other programs, spoken at the National Press Club and attended the Hoover Institution Media Roundtable. She is a recipient of the Edwin M. Hood Award for Diplomatic Correspondence.",
        "source_3": "U.S. Army Staff Sergeant Payton May joins 'Fox & Friends Weekend' and sheds light on being reunited with his former military service dog Yyacob.\n\nTheSenate votedto pass the $895 billion annual defense policy bill that includes a pay raise for U.S. servicemembers and a provision that restricts transgender care.\n\nThe bill passed 85 to 14, and now heads to President Biden’s desk for his signature.\n\nThe legislation scored a more bipartisan vote in the Senate than it did in the House, where more Democrats voted no on the legislation in protest of the transgender provisions.\n\nThe bill prohibitsmilitary health careprovider Tricare from paying for transgender care \"that could result in sterilization\" for children under 18.\n\nThe legislation passedthe Houselast week 281-140, with 16 Republicans voting \"no.\" Only 81 Democrats voted yes – 124 voting no – a much larger margin than in years passed when the legislation typically enjoyed bipartisan support.\n\nThe 1,800-page bill details how $895.2 billion allocated toward defense and national security will be spent. It will be voted on more than two months after the start of the fiscal year.\n\nThe $895.2 billion represents a 1% increase over last year’s budget, a smaller number than some defense hawks would have liked.\n\nAerial view of the Pentagon in Washington, D.C., on March 31, 2024.(DANIEL SLIM/AFP via Getty Images)\n\nAdditionally, while the National Defense Authorization Act (NDAA) outlines policy, a separate spending bill will actually fund the programs it lays out. That spending legislation will be voted on in the next Congress, when Republicans will have a narrow majority in both chambers.\n\nA significant portion of the legislation focused on quality-of-life improvements for servicemembers amid recordrecruitment issues, a focus of much bipartisan discussion over the last year. That includes a 14.5% pay increase for junior enlisted servicemembers and increasing access to child care for servicemembers while also providing job support to military spouses.\n\nThe measure authorizes a 4.5% across-the-board pay raise for all servicemembers starting Jan. 1 and a 2% increase for civilian personnel within the Department of Defense.\n\nIt also puts more restrictions onChinese-made drones,fearing their use in the U.S. could be for foreign surveillance. It specifically targets China-based DJI and Autel Robotoics.\n\nThe NDAA mandates that a national security agency must determine within one year if drones from DJI or Autel Robotics pose unacceptable national security risks. If no agency completes the study, the companies would automatically be added to the Federal Communications Commission’s \"covered lists,\" preventing them from operating in the U.S.\n\nThe bill includes new measures to combat drone incursions near military bases.(Grant Parpan/Newsday RM via Getty Images)\n\nDJI is the world’s largestdrone manufacturerand sells more than half of all U.S. commercial drones.\n\nThe bill recommends a $20 million increase in counter-unmanned aerial systems (UAS) Advanced Development budget and requires the Defense secretary to establish a \"C-UAS task force\" within 30 days and provide a report to congressional defense committees on the military’s latest counter-drone training efforts within four months.\n\nPENTAGON ANNOUNCES NEW COUNTER-DRONE STRATEGY AS UNMANNED ATTACKS ON US INTERESTS SKYROCKET\n\nSen. Tammy Baldwin, D-Wis., led a group of 21 Democratic senators demanding an amendment to remove the transgender care restrictions from the NDAA. That amendment was not included as it would have forced the bill back to the House. Congressional leaders spent months conferencing to find agreement between the chambers and the parties on the yearly must-pass legislation.\n\n\"Let’s be clear: we’re talking about parents who are in uniform serving our country who have earned the right to make the best decisions for their families,\" Baldwin said in a statement. \"I trust our servicemembers and their doctors to make the best health care decisions for their kids, not politicians.\"\n\nThe amendment will affect care for 7,000 children, according to Baldwin, who said she would support the NDAA if not for the provision.\n\nOther Democrats said they had objections to the provision, but the bill's provisions to strengthen U.S. defenses against China, raise pay for servicemembers, invest in new military technologies and replenish weapons stockpiles.\n\nThe measure authorizes a 4.5% across-the-board pay raise for all servicemembers starting Jan. 1.(REUTERS/David Mdzinarishvili)\n\nCONGRESS UNVEILS BILL TO AVERT FRIDAY GOVERNMENT SHUTDOWN WITH OVER $100B IN DISASTER AID\n\n\"Of course, the NDAA is not perfect. It doesn’t have everything either side would like … But of course, you need bipartisanship to get this through the finish line,\" said Senate Majority Leader Chuck Schumer, D-N.Y.\n\nSen. Jack Reed, D-R.I., chair of the Senate Armed Services Committee, told reporters Tuesday he shares his colleagues' \"frustration\" with House Speaker Mike Johnson's \"extreme, misguided provision,\" but he said Democrats during the negotiation process were able to strip out \"the vast majority of very far right provisions that had passed in the House bill.\"\n\nProvisions like a blanket ban on funding for gender transition surgeries for adults did not make their way into the bill. Neither did a ban on requiring masks to prevent the spread of diseases.\n\nThe bill also supports deploying theNational Guardto the southern border to help with illegal immigrant apprehensions and drug flow.\n\nAnother provision opens the door to allowing airmen and Space Force personnel to grow facial hair. It directs the secretary of the Air Force to brief lawmakers on \"the feasibility and advisability\" of establishing a pilot program to test out allowing beards.\n\nDemocrats are also upset the bill did not include a provision expanding access to IVF for servicemembers. Currently, military health care only covers IVF for servicemembers whose infertility is linked to service-related illness or injury.\n\nHowever, the bill did not include an amendment to walk back a provision allowing the Pentagon to reimburse servicemembers who have to travel out of state toget an abortion.\n\nThe bill extends a hiring freeze on DEI-related roles and stops all such recruitment until \"an investigation of the Pentagon’s DEI programs\" can be completed.\n\nJohnson, meanwhile, touted $31 billion in savings in the legislation that would come from cutting \"inefficient programs, obsolete weapons, and bloated Pentagon bureaucracy.\"\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}