{
    "question": "In what ways could Chrystia Freeland’s resignation over how to prepare for Trump’s proposed tariffs, and Justin Trudeau’s appointment of Dominic LeBlanc as finance minister, shape Canada’s tariff strategy and Trudeau’s political standing ahead of the 2025 election?",
    "content": {
        "source_1": "Chrystia Freeland's resignation from cabinet on Monday has encouraged some Liberal MPs to double down on their efforts to push Prime Minister Justin Trudeau out of the top job.\n\nTrudeau faced frustrated MPs at a hastily arranged caucus meeting on Monday night. One MP who was in the room told CBC News that most of the 15 MPs who spoke at the meeting said Trudeau has to step down after mismanaging his once-crucial relationship with Freeland.\n\nA number of other MPs have now publicly called on the prime minister to step aside and let someone else lead the Liberals into the next election.\n\n\"The prime minister, as I understand it … will reflect on both the decision that minister Freeland made, but also what he's heard from members of his own caucus,\" Natural Resources Minister Jonathan Wilkinson said Tuesday.\n\n\"I think we all need to give him a little time to reflect, and I respect that fact that he's going to take some time to reflect.\"\n\nThe House of Commons started its holiday break on Tuesday and isn't scheduled to return until the end of January — giving Trudeau some time to consider his options.\n\nHere are a few ways Trudeau could decide to proceed in the coming weeks.\n\nIf Trudeau decides he is ready to step down, the Liberal Party would need to choose a new leader — and prime minister. Party leadership races have brought new prime ministers to office several times in the past, including Pierre Trudeau in 1968, John Turner in 1984, Kim Campbell in 1993 and Paul Martin in 2003.\n\nParliament could carry on as normal while the Liberal Party conducted a new leadership race. But since the Liberals don't have a majority of seats in the House of Commons, they would run the risk of being toppled in a non-confidence vote before a new leader is chosen.\n\nTrudeau's government in crisis: What’s the PM's next move?\n\nAs a result, it might be safer for Trudeau to ask the governor general to prorogue Parliament until a new prime minister is ready to govern.\n\nProrogation works as a sort of parliamentary pause button. For as long as Parliament is prorogued, neither the House nor the Senate meet or conduct business. The legislative slate is wiped clear, killing all bills that haven't received royal assent, and a new session begins when Parliament returns.\n\nIf Trudeau decides to stay as prime minister, he'll still have to manage an increasingly disgruntled Liberal caucus and a House of Commons that might be primed to defeat his government.\n\nHe might be able to appease some MPs by offering them cabinet positions. Trudeau was expected to shuffle his cabinet at some point in the coming weeks to replace a number of ministers who have decided they won't be seeking re-election. That long-rumoured shuffle — which also triggered Freeland's exit — likely would still have to happen if Trudeau decides he's staying at the helm.\n\nWith the House now adjourned, an immediate election can only be triggered by Trudeau himself asking the governor general to dissolve Parliament. By law, federal campaigns must be at least 37 days, so even if an election were triggered today, the result wouldn't be decided until after Donald Trump's inauguration on Jan. 20.\n\nThe House is scheduled to reconvene on Jan. 27, so the first opportunity for opposition parties to defeat the government would come sometime after that. But the Conservative and Bloc Quebecois parties — which have been calling for an election in the wake of Freeland's resignation — don't have enough votes on their own to bring down the government.\n\nTo topple the government, the NDP wouldeither have to vote with the Conservatives and Bloc or abstain from a confidence vote.\n\nNew Democrats have been calling on Trudeau to resign since Freeland quit cabinet. But the NDP appears to be more willing than the other opposition parties to give the prime minister a bit more time to consider his future.\n\nNDP House leader Peter Julian told CBC News Network'sPower & Politicson Monday that if Trudeau hasn't stepped down by February or March, the NDP will vote against the Liberals on a non-confidence motion.\n\n\"If we have the continued debacle that we're seeing here and the prime minister has not stepped down … yes, [we would vote no confidence],\" he told host David Cochrane.\n\nDarren Major is a senior writer for CBC's parliamentary bureau in Ottawa. He previously worked as a digital reporter for CBC Ottawa and a producer for CBC's Power & Politics. He holds a master's degree in journalism and a bachelor's degree in public affairs and policy management, both from Carleton University. He also holds master's degree in arts from Queen's University. He can be reached at darren.major@cbc.ca.\n\nAudience Relations, CBCP.O. Box 500 Station AToronto, ONCanada, M5W 1E6\n\nIt is a priority for CBC to create products that are accessible to all in Canada including people with visual, hearing, motor and cognitive challenges.\n\nClosed Captioning and Described Video is available for many CBC shows offered onCBC Gem.",
        "source_2": "Canadian Prime Minister Justin Trudeau's government has been thrown into fresh disarray with the abrupt departure of his finance minister, Chrystia Freeland.\n\nBy the end of a frenetic Monday, a new finance minister was in place, but Trudeau was facing calls from members of his own Liberal Party to quit.\n\nWithout directly referring to the news, the prime minister told party donors at an event in Ottawa: \"It's obviously been an eventful day. It has not been an easy day.\"\n\nIn her scathing resignation letter - published on the day she was due to deliver an economic statement - Freeland cited disagreements with her long-time ally on how to respond to the threat of tariffs from Donald Trump.\n\nThe US president-elect, who will return to the White House in January, has vowed to impose a levy of 25% on imported Canadian goods unless the shared border is made more secure.\n\nEconomists say the tariffs could have a devastating effect on Canada's economy.\n\nIn her letter, Freeland accused Trudeau of choosing \"costly political gimmicks\" over addressing the threat posed by Trump's \"aggressive economic nationalism\".\n\nTrump himself later responded to Freeland, posting that her \"behaviour was totally toxic, and not at all conducive to making deals which are good for the very unhappy citizens of Canada\".\n\nFreeland said her decision came after Trudeau told her last week that he no longer wanted her to be the government's top economic adviser.\n\nHer departure blindsided the government, leaving the fate of the scheduled economic update in the air for hours and bringing Trudeau and his shaky minority Liberals to the brink.\n\nIn a further blow, the Liberals lost control of the Cloverdale-Langley City seat in British Columbia, after a by-election win for rival Conservatives. It was the Liberals' third by-election defeat of the year.\n\nFreeland's sudden exit as finance minister earlier in the day \"just makes Canada look quite confused and uncertain\", Chris Sands, director of the Wilson Center's Canada Institute, told the BBC.\n\n\"Trudeau finds himself a little bit alone, not super close to any of his ministers, with the big, talented ones mostly now having left,\" he added.\n\nMr Sands said Trump's win in November's US presidential election has caused a split among US allies, including Canada.\n\n\"Do you respond to Trump by pushing back and standing firm, or do you respond by trying to find a way to avoid conflict?\" he said.\n\nTrudeau has made overtures to Trump, including flying to Mar-a-Lago, the president-elect's Florida estate, last month to dine with the president-elect.\n\nBut Freeland's perspective, said Mr Sands, was closer to that of Mexico - also facing a tariff threat - and Mexican President Claudia Sheinbaum.\n\nMexico has positioned itself under the idea that \"now is the time to say no, to push back, to take a fighting stance\", he said.\n\nMany politicians remember the challenges they faced during Trump's first term in office, he added.\n\n\"He hasn't been inaugurated yet, but people are already reacting as though he was the president and taking serious measures.\"\n\nFreeland, who also served as deputy prime minister, had been Ottawa's lead during the first Trump administration in the successful re-negotiation of the US-Canada-Mexico free trade pact.\n\nIt was \"a really stressful and overwhelming process for Canada\", Mr Sands said.\n\nIn addition to the members of the prime minister's own party who called on him to quit, Canada's three opposition party leaders said on Monday that Trudeau must go.\n\nPierre Poilievre, leader of the opposition Conservative Party of Canada, called for a federal election as soon as possible.\n\n\"Everything is spiralling out of control. We simply cannot go on like this,\" he said.\n\nCanada's next federal election must be held in October, at the latest.\n\nLaura Stephenson, chair of the political science department at Western University, told the BBC that it was not clear that a change in leadership would affect the current US-Canada dynamic.\n\n\"I have no confidence that Trump will react any differently to Poilievre than he does to Trudeau,\" she said.\n\nAfter nine years in power, Trudeau has faced growing calls to resign over concerns he is a drag on his party's fortunes.\n\nThe Liberal leader's approval rate has plummeted from 63% when he was first elected to 28% in June of this year, according to one poll tracker.\n\nOpinion polls also suggest the Liberals could face a devastating loss to the Conservatives if an election was held today.\n\nSome Liberal members of parliament have been pressuring Trudeau for months to step down - eight MPs publicly expressed this sentiment on Monday, Canadian newspaper The Globe and Mail reported.\n\nIn a meeting with his caucus following Freeland's resignation on Monday, Trudeau reportedly heard some of those calls for him to quit directly. Others also expressed their concerns and reservations about his leadership.\n\nTrudeau addressed them by saying he is not immediately stepping down, but that he will reflect on the day's events, according to sources who spoke to Canadian media about the meeting.\n\nTrudeau did not take questions on his way to the fundraiser in Ottawa, but he told the crowd he was \"damn proud\" of his government's accomplishments.\n\nIn brief remarks, he said working for Canadian values was \"at the core of what makes us Liberals\".\n\n\"That's why we show up here, even on the toughest days as a party.\"\n\nTrudeau has defied previous calls to step aside and has said repeatedly that he plans to run in the next federal election.\n\nAlso on Monday, the leaders of Canada's provinces and territories met in Toronto to address Trump's tariff threat.\n\n\"It's chaos right now up in Ottawa\", said Ontario Premier Doug Ford.\n\nFord said the premiers will \"make sure that we tell the world there is stability here, there is certainty here in Canada\".\n\nThe 39-year-old built a makeshift shelter to survive in British Columbia's  wilderness and wrote \"help\" on a rock.\n\nThe dog's owner wrote on TikTok that the bear broke into her home and was eating her dog's food before Scout discovered the intruder.\n\nTrump's volatile trade policy has thrown the world economy into chaos, and put some US prices up.\n\nThere are pressures on both sides to give businesses a reprieve, but the tone remains markedly downbeat.\n\nThe Trump administration raised Canada's tariff from 25% to 35%, while granting Mexico a 90-day pause for higher levies.",
        "source_3": "Canadian Prime Minister Justin Trudeau attends a press conference in Kyiv, Ukraine, on Feb. 24, 2024. (Maxym Marusenko/NurPhoto via Getty Images)\n\nJason Hopkins is a reporter covering immigration issues for the Daily Caller News Foundation.\n\nDAILY CALLER NEWS FOUNDATION—A top official within Canadian Prime Minister Justin Trudeau’s Cabinet abruptly resigned, citing growing policy disagreements on how the country should respond to tariff threats posed byPresident-elect Donald Trumpand his “America First” economic agenda.\n\nFinance Minister Chrystia Freeland officially resigned from Trudeau’s Cabinet on Monday,according toa letter she posted publicly and delivered to the prime minister. Freeland’s letter—which came just hours before she was supposed to deliver an address on border security with the U.S.—marks the latest turmoil to beset Trudeau’s government as he deals with a more adversarial partner in the incoming Trump administration and his Liberal Party remains beleaguered with poor poll numbers.\n\n“On Friday, you told me you no longer want me to serve as your Finance Minister and offered me another position in the cabinet,” Freeland wrote to Trudeau. “Upon reflection, I have concluded that the only honest and viable path is for me to resign from the cabinet.”\n\nThe finance minister said the two had found themselves “at odds” in the past few weeks over how to find the best path forward for the country. However, she appeared to take particular umbrage with how to approach the “aggressive economic nationalism” presented by Trump, who has threatened Canada and Mexico withsweeping tariffsunless both countries do more to stop the flow ofillegal immigrationand illicit drugs.\n\nThe U.S.-Canada border, while never experiencing the level of activity seen annually at the southern border, has witnessed an uptick in activity in recent time. There were more than 23,000 encounters by made Border Patrol agents in fiscal year 2024, more than doubling the 10,000 encounters experienced the previous fiscal year,according toCustoms and Border Protection data.\n\n“Our country today faces a grave challenge,” Freeland wrote. “The incoming administration in the United States is pursuing a policy of aggressive economic nationalism, including a threat of 25 per cent tariffs.”\n\n“We need to take that threat extremely seriously,” she continued. “That means keeping our fiscal powder dry today, so we have the reserves we may need for a coming tariff war.”\n\nTrump, fresh off his electoral landslide victory overVice President Kamala Harrisearlier in November, declaredon social mediathat he would be imposing 25% tariffs on Mexico and Canada unless their governments met his demands onillegal immigrationand other issues. The threat has since set off a series of reactions from both Canadian and Mexican governments.\n\nMexican President Claudia Sheinbaum issueda public letterthat gave her government credit for the drop in migrant encounters along the southern border and blamed the U.S. for the number of guns in Mexico. Sheinbaum also notably warned that theMexican governmentwould have a “response in kind” if Trump moves forward with his threat to slap a 25% tariff on all of her country’s goods.\n\nIn what has been a more diplomatic approach so far, Trudeau reached out to Trump to discuss the situation and later said he “had a good call” with the president-elect. The Liberal Party leadersoon afterward visitedTrump at his Mar-a-Lago residence and detailed what more the Canadian government is doing to bolster border security.\n\nThe Mexican government has already been dealing with the fallout of the tariff threats, with a slate of major international businesses suggesting that theywould cease investmentsin the country until more clarity is given on the situation. Freeland’s resignation appears to show that the tariff threats are also wreaking havoc north of the border, with top officials disagreeing on how to respond.\n\n“That means pushing back against ‘America First’ economic nationalism with a determined effort to fight for capital and investment and the jobs they bring,” Freeland said, speaking on how Canada should deal with Washington, D.C. “That means working in good faith and humility with the Premiers of the provinces and territories of our great and diverse country, and building a true Team Canada response.”\n\nTrudeau, who has served as prime minister of Canada since November 2015, may not be the country’s leader following elections next year. Recentsurveys indicatehis Liberal Party will face a beating at the voting booth in October 2025 against the Conservative Party, led by Member of Parliament Pierre Poilievre. The Conservative Party leader is also viewed by Canadians as better equipped to work with Trump,according toa new Ipsos poll.\n\nIn response to the threat of tariffs from the incoming Trump administration, Poilievrehas calledfor the Canadian government to beef up border security and tighten visa rules on legal immigration.\n\n“What we are seeing is the government of Canada itself is spiraling out of control, right before our eyes and at the very worst time,” Poilievre said during a press conference Monday in reaction to the news, in which he detailed the country’s dire economic situation and political instability of the Trudeau government. “Out of control immigration has led to refugee camps opening in suburban Canada and then we have 500,000 in the country illegally, according to government estimates.”\n\n“We cannot accept this kind of chaos, division, weakness while we’re staring down the barrel of 25% tariff from our biggest trading partner and closest ally, which by the way is headed by a newly elected president with a strong and fresh mandate, a man who can spot weakness from a mile away,” he continued.\n\nOriginally published by the Daily Caller News Foundation\n\nToday, even with President Trump’s victory, leftist elites have their tentacles in every aspect of our government.\n\nThe Daily Signal’s own Tyler O’Neil exposes this leftist cabal in his new book,The Woketopus: The Dark Money Cabal Manipulating the Federal Government.\n\nIn this book, O’Neil reveals how the Left’s NGO apparatus pursues its woke agenda, maneuvering like an octopus by circumventing Congress and entrenching its interests in the federal government.\n\nYou can read the first chapter of this new book for FREE in this eBook,The Woketopus: Chapter One using the secure link below.\n\n© 2025 The Daily Signal Media Group, Inc.  All rights reserved.\n\nWe use cookies on our website. By using our website, you consent to cookies.Learn More."
    }
}