{
    "question": "How might Trump’s lawsuit against the Des Moines Register and pollster J. Ann Selzer under the Iowa Consumer Fraud Act influence future polling practices, media accountability, and public trust in pre-election surveys?",
    "content": {
        "source_1": "President-elect Donald Trump has sued the Des Moines Register and its former highly respected pollster J. Ann Selzer over a surprising poll released three days before the election that had Vice President Kamala Harris leading in the Republican-controlled state.\n\nIt is highly unusual for a politician to take legal action in response to an unfavorable poll.\n\nThe lawsuit, filed Monday in Polk County, Iowa, alleges that the poll, which was about 16 percentage points off from the election result, amounted to “election interference.” It argues that the newspaper and pollster “hoped that the … [poll] would create a false narrative of inevitability for Harris” in the last week of the election campaign, in what Trump’s attorneys claim was a violation of the Iowa Consumer Fraud Act.\n\nLark-Marie Anton, a Des Moines Register spokesperson, said in a statement that while the poll’s findings differed from the election results, the newspaper stands by its reporting. Selzer, who wrote after the election that she was stepping away from election polling, said she has not seen the lawsuit and has no additional comment.\n\n“We have acknowledged that the Selzer/Des Moines Register pre-election poll did not reflect the ultimate margin of President Trump’s Election Day victory in Iowa by releasing the poll’s full demographics, crosstabs, weighted and unweighted data, as well as a technical explanation from pollster Ann Selzer,” Anton said in a statement. “We stand by our reporting on the matter and believe a lawsuit would be without merit.”\n\nTrump had threatened legal action against the Iowa newspaper and pollster days after ABC News agreed to contribute $15 million to Trump’s future presidential library to settle a defamation lawsuit brought by Trump.\n\nThe case stemmed from a televised interview in which ABC News’s star anchor, George Stephanopoulos, said Trump was found “liable for rape,” when a jury actually found him liable for sexual abuse. The settlement raised concerns that Trump might feel more emboldened to legally go after media outlets that have shared coverage he dislikes.",
        "source_2": "Matthew Impelli is a Newsweek staff writer based in New York. His focus is reporting social issues and crime. In January 2023, Matthew traveled to Moscow, Idaho where he reported on the quadruple murders and arrest of Bryan Kohberger. Matthew joined Newsweek in 2019 after graduating from Syracuse University. He also received his master's degree from St. John's University in 2021. You can get in touch with Matthew by emailingm.impelli@newsweek.com. Languages: English.\n\nJon Jackson is a News Editor at Newsweek based in New York. His focus is on reporting on the Ukraine and Russia war. Jon previously worked at The Week, the River Journal, Den of Geek and Maxim. He graduated Summa Cum Laude with honors in journalism and mass communication from New York University. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nPresident-electDonald Trumpis suing an Iowa pollster over a survey released before November's presidential election that showed Vice PresidentKamala Harrisleading in the state.\n\nThe lawsuit, filed on Monday, called the poll from J. Ann Selzer \"brazen election interference.\"\n\nSelzer, her polling firm,The Des Moines Registerand the newspaper's parent company, Gannett, were all named in the suit, which accused them of consumer fraud.\n\nLast month, Trump called for an investigation into Selzer following an announcement she was ending her operation, which came weeks after her final poll dramatically missed the mark in predicting thepresidential electionoutcome.\n\nSelzer, known for her decades of polling work in Iowa, released a survey three days before the election showing Democratic nominee Harris leading Trump by three percentage points—47 percent to 44 percent.\n\n\"A totally Fake poll that caused great distrust and uncertainty at a very critical time. She knew exactly what she was doing,\" Trump wrote in a Truth Social post last month, linking to Selzer's retirement announcement.\n\nHe further alleged \"possible ELECTION FRAUD\" by Selzer andThe Des Moines Register, which sponsored the poll, calling them \"now discredited.\"\n\nOn Monday, Trump announced plans to sue Selzer andThe Des Moines Register.\n\n\"I feel I have to do this. I shouldn't really be the one to do it. It should have been the Justice Department or somebody else, but I have to do it...Costs a lot of money to do it, but we have to straighten out the press,\" Trump said on Monday.\n\n\"In my opinion, it was fraud and it was election interference,\" Trump added.\n\nIn a opinion piece published byThe Des Moines Registerfollowing the election results, Selzer called the polling a \"big mess.\"\n\nIn her announcement, Selzer defended her career and addressed the controversial final poll, noting that the timing of her departure had been planned well in advance.\n\n\"Over a year ago I advised theRegisterI would not renew when my 2024 contract expired with the latest election poll as I transition to other ventures and opportunities,\" she wrote.\n\nIn a statement obtained by Jennifer Jacobs ofCBSNews, aspokesperson forThe Des Moines Registersaid, \"We have acknowledged that the Selzer/Des Moines Register pre-election poll did not reflect the ultimate margin of President Trump's Election Day victory in Iowa by releasing the poll's full demographics, crosstabs, weighted and unweighted data, as well as a technical explanation from pollster Ann Selzer. We stand by our reporting on the matter and believe this lawsuit is without merit.\"\n\nAhead of Trump's presidency, he may look to file similar lawsuits against other media companies. The lawsuit this week comes shortly after Trump settled another lawsuit withABCnews.\n\nUpdate 12/17/24 12:55 p.m. ET: This story has been updated with further information.\n\nMatthew Impelli is a Newsweek staff writer based in New York. His focus is reporting social issues and crime. In January 2023, Matthew traveled to Moscow, Idaho where he reported on the quadruple murders and arrest of Bryan Kohberger. Matthew joined Newsweek in 2019 after graduating from Syracuse University. He also received his master's degree from St. John's University in 2021. You can get in touch with Matthew by emailingm.impelli@newsweek.com. Languages: English.\n\nJon Jackson is a News Editor at Newsweek based in New York. His focus is on reporting on the Ukraine and Russia war. Jon previously worked at The Week, the River Journal, Den of Geek and Maxim. He graduated Summa Cum Laude with honors in journalism and mass communication from New York University. Languages: English.\n\nMatthew Impelli is a Newsweek staff writer based in New York. His focus is reporting social issues and crime. In January 2023, Matthew traveled to Moscow, Idaho where he reported on the quadruple murders and arrest of Bryan Kohberger. Matthew joined Newsweek in 2019 after graduating from Syracuse University. He also received his master's degree from St. John's University in 2021. You can get in touch with Matthew by emailingm.impelli@newsweek.com. Languages: English.\n\nMatthew Impelli is a Newsweek staff writer based in New York. His focus is reporting social issues and crime. In                                    ...Read more",
        "source_3": "On Monday afternoon, President-elect Donald Trump told reporters at a news conference at his Mar-a-Lago Club in South Florida that his team was preparing to file a \"major lawsuit\" against the Des Moines Register and its top pollster, J. Ann Selzer for election interference and fraud over their final polling data in the days before the presidential election.\n\n🚨 JUST IN: President Trump will be SUING media outlets such as the Des Moines register and CBS / 60 Minutes for interfering in the electionGOOD! 🔥60 Minutes infamously chopped and edited Kamala’s answers to make her sound coherent.pic.twitter.com/UbzkIJ4DI4\n\nTrump followed through on his word, asFox Newsreports that his team filed a lawsuit against the Des Moines Register and Selzer overnight in Polk County, Iowa, under the Iowa Consumer Fraud Act and related provisions.\n\nThe lawsuit seeks \"accountability for brazen election interference committed by\" the local paper and Selzer\"in favor of now-defeated former Democrat candidate Kamala Harris through use of aleaked and manipulated Des Moines Register/Mediacom Iowa Poll conducted by Selzer and S&C and published by DMR and Gannett in the Des Moines Register on Nov. 2, 2024.\"\n\nThe lawsuit also targets Gannett, the parent company of the Des Moines Register, which owns USA Today and several other local papers across the US.\n\n\"Contrary to reality and defying credulity, defendants' Harris Poll was published three days before Election Day and purported to show Harris leading President Trump in Iowa by three points; President Trump ultimately won Iowa by over thirteen points,\" the filing stated.\n\nSelzer was once considered the \"gold standard\" of polling, but after Trump swept the state by a 13-point margin, winning the actual vote 56-43%,she later acknowledged her poll was a \"big miss\"and suggested that it might have \"actually energized [d] and activated [d] Republican voters who thought they would likely coast to victory,\" according to ourprevious report.\n\nFollowing thepublic opinion polling blunder, Selzer wrote in a guest column in theDes Moines Registerjust a little more than a week after the election that her days advising the paper's famed Iowa Poll was over, and she would be \"transitioning to other ventures and opportunities.\"\n\nSelzer's exit—and now her legal troubles with Trump's team—reflects abroader shift: trust in mainstream polling has plummeted to historic lows. Those accused of waging an information war on the minds of the people are now being held accountable.\n\n\"The Harris Poll was no 'miss' but rather an attempt to influence the outcome of the 2024 Presidential Election,\" the lawsuit said, adding that \"defendants and their cohorts in theDemocrat Partyhoped that the Harris Poll wouldcreate a false narrative of inevitability for Harrisin the final week of the 2024 Presidential Election.\"\n\nTheera of misinformation and disinformation by the Democratic Party, propped up by fake news, fake polls, and agovernment-sponsored censorship complex(and billionaire-funded: Soros), has infuriated the American people. At the same time, prediction markets likePolymarkethave emerged, which offer one of the best insights into electoral outcomes and signal a new tool in political forecasting.\n\nThe lawsuit noted that Selzer's more than three-decade run in the industry has led to her retirement \"indisgrace from polling less than two weeks after this embarrassing rout.\"\n\nThe lawyers argued that \"left-wing pollstershave attempted toinfluence electoral outcomesthroughmanipulated pollsthat haveunacceptable error ratesand are not grounded in widely accepted polling methodologies.\"\n\nHere's some of our reporting onpollsters oversamplingand attempting to shape outcomes for Harris in the months before the election...\n\nThe lawsuit Monday night comes days after far-left ABC News and its top anchor, George Stephanopoulos,reached a $15 million defamation suit with Trump.\n\nTrump also filed a lawsuit against far-left CBS News, demanding $10 billion in damages over \"deceitful, deceptive manipulation of news\" for the election interference surrounding Harris'questionable interview in October."
    }
}