{
    "question": "How might Olaf Scholz’s loss of the confidence vote and the scheduling of early elections on February 23 shape Germany’s political stability and policy priorities in the coming months?",
    "content": {
        "source_1": "German Chancellor Olaf Scholz speaks during a plenary session at the German Bundestag, where he faces a vote of confidence, Berlin, Germany, on Monday.Markus Schreiber/APhide caption\n\nGerman Chancellor Olaf Scholz has lost a vote of confidence in the German parliament. It is the outcome Scholz had hoped for when he called for the confidence vote last week, analysts say. His aim: to lose this vote now, win fresh elections and come back stronger next time.\n\n\"Politics is not a game,\" Scholz told members of the parliament, the Bundestag, ahead of Monday's vote. As a result of the confidence motion's defeat, President Frank-Walter Steinmeier will dissolve the parliament and call for new elections in late February.\n\nIn the Bundestag, 394 members voted no, 207 voted yes and 116 abstained. For the vote of confidence to have been successful, it would have required 367 yes votes.\n\nScholz's fractious three-party coalition government collapsed in early November, when the chancellor fired his finance minister in a dispute over how to revitalize Germany's stagnant economy. \"He has broken my trust too often,\" Scholz said of Finance Minister Christian Lindner, the head of the Free Democratic Party (FDP), one of three parties in the governing coalition Scholz led since December 2021.\n\nThat left the remaining two coalition partners without a majority in parliament.\n\nLindner also spoke ahead of Monday's vote, and blamed the coalition's downfall on its inability to come up with solutions to boost the country's faltering economy, which in turn alienated voters.\n\nIn Germany, a motion for a vote of confidence is a rarely used, double-edged constitutional tool that chancellors reach for to manage politically challenging times. (Many other countries refer to this constitutional tool as a no-confidence vote.) Unlike in certain countries with roots in the British parliamentary system, the goal sometimes can be not to win but to lose such a vote.\n\nWhile a successful vote can strengthen and even repair fractures within a coalition, a lost vote automatically triggers new elections that can — if the gamble pays off — hand the chancellor's party a win in parliamentary elections that provides new energy and legitimacy for a government's agenda.\n\nNow that Scholz has lost Monday's confidence vote, he hopes to win the February elections and form a new coalition under his renewed leadership.\n\nScholz has long carried the nicknameScholzomat, because of his perceived robotic presence, one devoid, critics say, of charisma and emotion.\n\nBut he will need more than a newly combative and decisive persona to hold onto power, analysts say.\n\nGermany's governing coalition under Scholz's leadership was formed after his Social Democratic Party (SPD) came in first — but without an outright majority — in the September 2021 federal parliamentary elections. It took 59 days of negotiations to form an unprecedented three-party coalition with Lindner's FDP and the Green Party. The coalition became known as theAmpelkoalition,or traffic light coalition, because of the colors associated with these parties: red, yellow and green.\n\nScholz's 2021 election victory ended a 16-year drought for the SPD. He succeeded Angela Merkel, who governed as chancellor from 2005-2021, at the head of different coalitions led by her center-right Christian Democratic Union.\n\nScholz's traffic-light coalition took over the country during the COVID-19 pandemic and just a couple of months prior to Russia's full-scale invasion of Ukraine. After strong initial approval ratings, Scholz and his government slowly lost the public's goodwill as one crisis after another unfolded, including economic woes due to the pandemic and the war in Ukraine, the renewed conflict in the Middle East and growing concerns over migration.\n\nThese challenges and different political philosophies started fracturing the coalition. Vice Chancellor and Economics Minister Robert Habeck of the Green Party and Finance Minister Lindner with the FDP started to publicly challenge Scholz's authority. The rift within the coalition then reached its crescendo last month, when Scholz asked the German president to dismiss Lindner.\n\nThe disagreements and infighting alarmed many in the public, as the country faced multiple political, economic and foreign policy challenges. As the coalition crumbled, all other FDP-affiliated ministers withdrew, leaving Scholz in charge of a minority government.\n\nThe past three years under theAmpelkoalitionhave hurt Scholz's reputation. Hisapproval ratings are dismaland his often-cautious governing style has not endeared him to the public. However, his coalition partners are similarly unpopular, according to arecent survey conducted by German research institution Wahlen for public broadcaster ZDF.\n\nAfter World War II and the end of Nazi Germany, the new federal republic was formed in 1949. Over the course of 75 years, four chancellors have used a motion for a vote of confidence to try to secure their hold on leadership. Scholz's was the sixth time.\n\nThe first chancellor to call for such a vote was Willy Brandt in 1972. His politics of reconciliation with socialist and communist countries in Eastern Europe, known as Ostpolitik, caused a rift among his SPD-led coalition. As Brandt planned, he lost the vote — but scored a decisive win in the following snap elections and strengthened his mandate to govern.\n\nTen years later, another SPD chancellor, Helmut Schmidt, also called for a vote of confidence. He won that vote. Even so, Schimdt was ousted a short time later.\n\nThat opened the door for CDU politician Helmut Kohl, who took over as chancellor. But without having won an election, Kohl knew he needed the public's support to govern effectively. So he too called for a vote of confidence — the second one of that year, 1982.\n\nHe lost. But thanks to his party's good showing in the election that followed, Kohl was able to stay in power for a total of 16 years.\n\nPrior to Monday's vote, the most recent motions for votes of confidence were issued by Chancellor Gerhardt Schröder in 2001 and 2005. In 2001, he connected his motion for a vote of confidence with a separate vote to authorize Germany's military operation in Afghanistan following the al-Qaida attacks of September 11, 2001, on the United States. He won both votes.\n\nFour years later, he again asked for a vote of confidence after his social reform programs led to his SPD party losing in a state election. He lost the confidence vote, an outcome he intended as he wanted to go back to the voters in the hopes of buttressing his support.\n\nBut things did not go to plan: He lost the subsequent snap elections, a result which marked the beginning of the Merkel era.\n\nNow Scholz is giving voters a chance to create a new carve-up of seats in parliament to allow the formation of a new coalition government — one holding an outright majority and thus better able to govern.\n\nScholz's chances of winning the snap election are slim, analysts say, but not impossible. There'sno clear frontrunner going into February's election at this pointalthough CDU party leader Friedrich Merz, a conservative former businessman, is currently leading in most polls, which show his Christian Democratic Union party with a firm lead going into a winter election season. Ahead of the confidence vote, Merz called Monday \"a day of relief.\"\n\nA potentially unintended consequence of the move toward snap elections is that a right-wing party like the Alternative für Deutschland, or AfD, could win over voters who are disillusioned with Germany's current political dysfunction.\n\nEven though Germany's established parties have said that they would not enter a coalition with the AfD, if voters want change, analysts say they could be forced to consider such a scenario.",
        "source_2": "German Chancellor Olaf Scholz called a confidence vote following the collapse of his coalition government. He has lost the vote, paving the way for elections in February. DW has the latest.\n\nThis blog has now closed. Head toTuesday's updates for the latest on the German election, and catch up below on all the major developments in the confidence vote on Monday, December 16.\n\nPresident Steinmeier is set to formally announce the dissolution of the Bundestag in the coming days.\n\nScholz's government remains a caretaker government. However, new treaties cannot be signed until a new government takes over.\n\nTomorrow, the opposition Christian Democrats are going to launch their party program.\n\nThe party is led by Friedrich Merz, who is widely expected to become the next chancellor.\n\nScholz's Social Democrats also look set to launch their party program in the afternoon.\n\nOlaf Scholz did not show enough leadership during his tenure as German chancellor, the Greens' parliamentary group leader said on Monday.\n\n\"The long tugging and wrangling\" over some legislative projects would have been avoidable \"if our Chancellor Olaf Scholz had shown more leadership,\" Britta Hasselmann said after Monday's vote in the Bundestag.\n\nThe co-chair of the parliamentary group, Katharina Dröge, said the opposition leader Friedrich Merz (CDU) was not ready for the snap election, penciled in for February 23.\n\nAs for policies, Dröge said that the Greens wanted to ensure \"that the 49-euro ticket remains a 49-euro ticket.\"\n\nThe price of the ticket, which allows the holder to use public transport across many parts of Germany without extra charge, isset to increase to €58 in January.\n\nAfter Monday's vote of no confidence, Olaf Scholz is no longer the chancellor of Germany as part of a minority coalition, but he does still act as the head of government.\n\nHowever, both the government and the Bundestag will remain fully functional in terms of global issues in the transition phase until a new government is formed.\n\nWhen Scholz was confirmed as the future chancellor in 2021, his predecessorAngela Merkel, while still in office, took the future German leader to international appointments, for example with US President Joe Biden.\n\nThere will likely be a weeks-long transition phase after the parliamentary elections until a new coalition government is agreed upon.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 video\n\nAccording to the latest polls, Friedrich Merz's CDU holds a lead of more than 10 points over Olaf Scholz's SPD, though the advantage has been narrowing recently.\n\nThe polls suggest Merz's CDU and its Bavarian sister party, the Christian Social Union (CSU), have a 32% share of the vote.\n\nThe far-right Alternative for Germany (AfD), led byAlice Wiedel, is slightly ahead of the SPD, whilethe Greensare in fourth place.\n\nThe mainstream parties have refused to govern with the AfD, but its presence complicates the parliamentary arithmetic, making unwieldy coalitions more likely.\n\nMerz said he wants to see the CDU and the CSU be the strongest force in the Bundestag.\n\n\"We can do that. We are doing well in the polls at the moment,\" he said. \"But not as well as I see and think possible. However, an election campaign comes first from fighting and then from voting.\"\n\nScholz has traveled to Berlin's Bellevue Palace and proposed to German PresidentFrank-Walter Steinmeierthat the Bundestag be dissolved.\n\nThe president, Germany's head of state, will then have 21 days to decide whether to agree and to call a new election within 60 days.\n\nSteinmeier's approval is considered certain and he has already indicated that he agrees with the proposed election date of February 23.\n\nHowever, it is expected that he will wait until after the Christmas holidays to make the decision, particularly as he first wants to hold talks with all parliamentary groups in the Bundestag.\n\nOver the weekend, Steinmeier said he would not be hurried into making a decision.\n\n\"The hectic pace of daily politics and the beat of the media do not now dictate the procedure, but the constitution and its rules do,\" the German president told ARD.\n\nChancellor Olaf Scholz's minority coalition government has lost a confidence vote, paving the way for new elections in February.\n\nSome 394 lawmakers cast their votes against the government, with 207 voting in favor.\n\nAnother 116 abstained, leaving Scholz far short of the majority of 367 needed to win.\n\nThe confidence vote came after the Free Democrats (FDP) left the coalition government with Scholz's center-left Social Democrats (SPD) and the Greens following disputes over the budget.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 video\n\nGermany's Left Partyand the left-wing populistSahra Wagenknecht Alliance (BSW)have accused Chancellor Olaf Scholz (SPD) of failings in economic and foreign policy.\n\nWagenknecht spoke of the \"inglorious end\" of a government that had noticeably worsened people's lives.\n\n\"Three years of decline for our country, and you are asking for a four-year extension,\" said Wagenknecht.\n\nThe co-chair of the Left Party, Sören Pellmann, accused Scholz of having set in motion the \"most violent arms race\" in light of Russia's war of aggression against Ukraine.\n\nGermany must \"invest its way out of the crisis.\" Pellmann said, hitting out at tax rates for top earners: \"This country does not need even richer billionaires.\"\n\nThe head of the far-rightAlternative for Germany (AfD)party, Alice Weidel, criticized Scholz's government for the state of the German economy.\n\n\"Your government was in power for just three years. Germans will have to deal with the damage that you caused in this time,\" she said during the debate in the Bundestag.\n\nWeidel, who is running to become chancellor in next year's election, said that the economy had suffered due to \"massive lacking investment\" in the car industry while \"the chemical industry is fleeing\" due to \"exploding energy costs.\"\n\nShe also had words for the Greens Vice Chancellor Robert Habeck and the CDU's chancellor candidate Friedrich Merz.\n\nWeidel accused Habeck of ruining the country and said that Merz would send Taurus missiles to Ukraine. Whoever votes for Merz \"is voting for war,\" the far-right lawmaker said.\n\nShe also demanded that refugees from the war in Syria be sent home immediately, despite the continued uncertainty in the Middle Eastern country.\n\nIf German lawmakers decide to withdraw their support from Scholz, he will ask PresidentFrank-Walter Steinmeierto dissolve parliament and call for early elections about seven months sooner than planned.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 video\n\nIn his speech before the Bundestag,former Finance Minister Christian Lindnertook the opportunity to attack the economic policies of the German chancellor.\n\nIn particular, the reduction in VAT on foodstuffs proposed by Scholz is unnecessary, the leader of the business-focused Free Democrats said.\n\nSuch a step would cost billions of euros but would not secure or create any jobs, he said.\n\n\"Prince Carnival may hand out candy on Rose Monday, but the Federal Republic of Germany must not be governed like this,\" said Lindner, likening the measure to a German tradition of candy being thrown to crowds from procession floats on the last Monday before Lent.\n\nLindner said Germany was in a worsening economic crisis and called for a political turnaround to prevent further economic decline.\n\n\"We must be honest and tell the citizens: Never in history has a society defended its prosperity, its social security and its sense of ecological responsibility by making less effort, by working less, by coming up with fewer ideas and by being less willing to take entrepreneurial risks,\" said Lindner.\n\nRobert Habeck, Green vice chancellor and economy minister, took the podium shortly after opposition leader Merz called him the \"face of the economic crisis\" in Germany.\n\nHabeck pointed to other countries in Europe that are currently without a government or being governed by shaky coalitions: France, Belgium, Austria, and the Netherlands. He said this highlighted not only that Germany needed to cease navel-gazing, but that \"a new vote is not a guarantee that a new government will quietly and quickly get to work.\"\n\nLike Scholz, he blamed the FDP for \"being part of a government while simultaneously trying to destroy it.\"\n\nHabeck said that Germany needed a government that was \"ready to make compromises,\" which the current coalition did successfully for three years until the FDP decided to sabotage it.\n\nHe then slammed Merz's accusations that the SPD-led coalition had tanked the economy, citing the effects of the war in Ukraine and how the CDU under former ChancellorAngela Merkelhad left Germany reliant on cheap Russian gas.\n\nThe vice chancellor calledMerkels' decisiona \"grand historical mistake.\" Energy prices have soared in Germany as the country moved to pivot away from Russian gas quickly in the aftermath of the invasion of Ukraine.\n\nAlluding mainly tothe far-right Alternative for Germany (AfD), Habeck said that the \"racism\" of the right-wing in Germany was \"the biggest threat\" to the national economy, because it was keeping skilled migrants away.\n\nTheleader of the opposition CDU Friedrich Merzaccused the ruling coalition of hypocrisy. He spoke ahead of a confidence vote over Chancellor Olaf Scholz's government.\n\n\"The chancellor spoke a lot about respect, but it seems as though his respect ends where other political opinions begin,\" he said, before calling it \"shameless\" to have spoken so highly of his accomplishments but so badly of the FDP, who he said helped him achieve all of them.\n\nHe further asked why, if Scholz foresaw so much room for progress, the SPD hadn't accomplished any of it \"in the 22 years of the last 26\" when it was part of Germany's governing coalitions.\n\nMerz went on to criticize the funding of the military, the reaction to record-high inflation and an economic crisis, and Scholz's perceived lack of clarity and outspokenness on global issues over the last several years.\n\n\"You have brought shame on Germany\" in front of the EU and other allies, Merz said.\n\nHe also praised the FDP for what he described as trying to prevent the ruling SPD and Greens from raising taxes.Arguments over the national budgetplayed a major role over the collapse of Scholz's coalition.\n\nReturning to the topic of the economy, Merz also implied that Germans do not work enough, citing neighboring Switzerland as a positive example, where people \"work on average 200 hours more\" a year. The conservative leader said that working more hours was necessary for \"making Germany more competitive.\"\n\nThese statements were met with loud consternation by other lawmakers.\n\nThe beginning of Chancellor Olaf Scholz's speech felt like the official kick-off of the election campaign.\n\nThe political groups in the Bundestag had rallied their troops and coordinated their planned applause for this special session. During Scholz’s address, there was consistent applause only from his SPD group and individual members of the Greens, who form part of his government.\n\nThe business-friendly FDP, most of whose ministers were ousted by Scholz, kept their hands firmly on their desks.\n\nScholz highlighted many of Germany’s current weaknesses. Observers on the visitors’ benches made cynical comments, such as “Wait till he finds out who’s in charge.”\n\nWhen Scholz’s strongest opponent, Friedrich Merz of the CDU, took the stage, the applause came from the other side of the plenary, mostly from the CDU/CSU. Judging by their clapping, many in the FDP still hope to form the next governing coalition with the Conservatives. Small caveat: They will need to get enough votes on February 23rd to make it into parliament first.\n\nDuring his speech in the Bundestag ahead of a confidence motion, Chancellor Olaf Scholz called for the value-added tax (VAT) rate on food products to drop from 7% to 5% amid the country'scost of living crisis.\n\nHe said that he wanted to raise Germany's minimum wage to €15 ($15.75).\n\n\"The world did not end when we introduced the minimum wage or when we raised it to€12,\" he said.\n\nScholz also called for the availability ofdaycare facilitiesto be greater so that more women could work full-time.\n\nHe pointed to Germany's labor shortage, calling for \"more workers\" and \"more productivity.\"\n\nScholz said that there was no way toplug the labor shortage without migration.\n\nHe praised hiscoalition government's citizenship reform, which allowed for dual citizenship and faster naturalization.\n\n\"One in four of us has a migrant background,\" Scholz said. \"We all make up Germany.\"\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 video\n\nChancellor Scholz said Germany needed \"massive investment\" to meet the future, particularly for self-defense.\n\n\"Today a highly armed nuclear power is waging war in Europe just two hours' flight from here. We must invest massively in our security and defense,\" he said, referencingRussia's invasion of Ukraine.\n\nAt the same time, he said, he would never \"send German soldiers into that war,\" and not further inflame the conflict, likely a reference to rival Friedrich Merz's desire to send German Taurus missiles to Ukraine should his CDU emerge victorious in February's vote.\n\nHowever, Scholz said, Germany would remain \"Ukraine's strongest supporter in Europe...supporting Ukrainian sovereignty and ending all the death,\" that has come out of the conflict.",
        "source_3": "German Chancellor Olaf Scholz lost a vote of confidence in parliament on Monday thereby paving the way for early elections in the European Union’s most populous member and biggest economy on 23 February next year.\n\nScholz called the snap vote against the background of a stalled economy and had expected to lose it, but calculated triggering an early election was his best chance of reviving his party’s fading political fortunes and its leftist-led coalition government the BBCreports.\n\nAhead of Monday’s vote, Scholz said it would now be up to voters to “determine the political course of our country”, teeing up what is likely to be a frenetic election campaign.\n\nScholz’s Social Democratic Party (SDP) is trailing heavily in opinion polls as the conservative Christian Democratic Union (CDU) under Friedrich Merz appears to be on course for a return to government.\n\nScholz told lawmakers that the election will determine whether “we, as a strong country, dare to invest strongly in our future; do we have confidence in ourselves and our country, or do we put our future on the line? Do we risk our cohesion and our prosperity by delaying long-overdue investments?”\n\nHis pitch to voters includes pledges to “modernize” Germany’s strict self-imposed rules on running up debt, to increase the national minimum wage and to reduce value-added tax on food, AFPreports.\n\nThe chancellor said Germany is Ukraine’s biggest military supplier in Europe and he wants to keep it that way.\n\nConfidence votes are rare in Germany, a country of 83 million people that prizes stability. This was only the sixth time in its postwar history that a chancellor had called one.\n\nThe last was in 2005, when then-Chancellor Gerhard Schröder engineered an early election that was narrowly won by center-right challenger Angela Merkel."
    }
}