{
    "question": "How might Trump’s call for Adam Schiff to face prison over alleged mortgage fraud, despite a Fannie Mae memo citing possible occupancy misrepresentation without a criminal finding, shape public perceptions of political accountability and the role of federal investigations?",
    "content": {
        "source_1": "President Trump on Tuesdayaccused Sen. Adam Schiff(D-Calif.) of committing mortgage fraud by intentionally misleading lenders about his primary residence being in the suburbs of Washington, rather than California, in order to “get a cheaper mortgage and rip off America.”\n\nSchiff, who led a House impeachment of Trump during the president’s first term and has remained one of his most vocal andforceful political adversariessince joining the Senate,dismissed the president’s claimsas a “baseless attempt at political retribution.”\n\nA spokesperson for Schiff said he has always been transparent about owning two homes, in part to be able to raise his children near him in Washington, and has always followed the law — and advice from House counsel — in arranging his mortgages.\n\nIn making his claims, Trump cited an investigation by the Fannie Mae “Financial Crimes Division” as his source.\n\nA memorandum reviewed by The Times from Fannie Mae investigators to William J. Pulte, the Trump-appointed director of the U.S. Federal Housing Finance Agency, does not accuse Schiff of mortgage fraud. It noted that investigators had been asked by the FHFA inspector general’s office for loan files and “any related investigative or quality control documentation” for Schiff’s homes.\n\nInvestigators said they found that Schiff at various points identified both his home in Potomac, Md., and a Burbank unit he also owns as his primary residence. As a result, they concluded that Schiff and his wife, Eve, “engaged in a sustained pattern of possible occupancy misrepresentation” on their home loans between 2009 and 2020.\n\nThe investigators did not say they had concluded that a crime had been committed, nor did they mention the word “fraud” in the memo.\n\nThe memo was partially redacted to remove Schiff’s addresses and information about his wife. Fannie Mae did not respond to a request for comment.\n\nIn addition to denying any wrongdoing, Schiff also suggested that Trump’s accusation was an effort to distract froma growing controversy— important to many in the president’s MAGA base — over the administration’s failure to disclose more investigative records into child sex abuse by the late financier Jeffrey Epstein, a former acquaintance of Trump’s.\n\nThere has long been rumor of a “client list” of Epstein’s that could expose other powerful men as predators. Trump promised to release such a list as a candidate, and at one point Atty. Gen. Pam Bondi appeared to say such a list was on her desk. However, the administration has since said no such list exists, and Trump has begged his followers to move on.\n\nSchiff drew a direct line between that controversy and Trump’s accusations against him Tuesday.\n\n“This is just Donald Trump’s latest attempt at political retaliation against his perceived enemies. So it is not a surprise, only how weak this false allegation turns out to be,” Schiff wrote on X. “And much as Trump may hope, this smear will not distract from his Epstein files problem.”\n\nA spokesperson for Schiff echoed the senator’s denial of any wrongdoing.\n\nAccording to the spokesperson, Schiff made a decision routine for Congress members from states far from Washington to buy a home in Maryland so he could raise his children nearby. He also maintained a home in California, living there when not in Washington.\n\nThe spokesperson said all of Schiff’s lenders were aware that he intended to live in both as he traveled back and forth from Washington to his district — making neither a vacation home.\n\nRep. Adam Schiff’s role as a chief critic of former President Trump has defined his bid to become the next U.S. senator from California.\n\nTrump’s own post about Schiff, on his social media platform, was thin on details and heavy on insults, calling Schiff “a scam artist” and “crook.”\n\nTrump alleged that Schiff reported his primary residence being in Maryland, when “he must LIVE in CALIFORNIA” as a congressman from the state.\n\nSchiff, a former federal prosecutor, has for years laid out detailed arguments against the president — and for why his actions violated the law and warranted his permanent removal from office. Those have included Trump’s first presidential campaign’s interactions with Russian assets, his pressuring Ukraine to investigate his rival Joe Biden while U.S. military aid was being withheld from the country, and his incitement of the Jan. 6, 2021, insurrection and storming of the U.S. Capitol to prevent the certification of Biden’s 2020 electoral win over him.\n\nSchiff also has criticized the president — and his businesses, family members and political appointees — for their own financial actions.\n\nHe recently sponsored legislation that would restrict the ability of politicians and their family members from getting rich off of digital currencies of their own creation, as Trump and his family have done. He also has repeatedly demanded greater financial transparency from various Trump appointees, accusing them of breaking the law by not filing disclosures of their assets within required time frames.\n\nOthers have accused Trump for years of financial fraud. Last year, a judge in New York ordered Trump to pay $355 million in penalties in a civil fraud case after finding that the president and others in his business empire inflated his wealth to trick banks and insurers. Trump denied any wrongdoing and has appealed the decision.\n\nAll along the way, Trump has attacked Schiff personally, accusing him of peddling hoaxes for political gain and repeatedly suggesting that he should be charged with treason. During a presidential campaign stop in California last year — when Schiff was running for the Senate — Trump called Schiff “one of the sleaziest politicians in history.”\n\nSchiff made mention of Trump’s treason claims in his response to the new allegation of mortgage fraud Tuesday, writing, “Since I led his first impeachment, Trump has repeatedly called for me to be arrested for treason. So in a way, I guess this is a bit of a letdown.”\n\nBefore leaving office, President Biden preemptively pardoned Schiff and the other members of the committee that investigated Trump’s role in the Jan. 6 insurrection, anticipating that Trump would seek to retaliate against them for their work.\n\nSchiff said at the time that hedid not want a pardon. He later dismissedan assertion from Trump that the pardons were “void”as another attempt at intimidation.\n\nSchiff was first elected to the U.S. House of Representatives in 2000. He now splits his time between a two-story home in Potomac, Md., which he bought in 2003, according to property records, and a one-bedroom condo in a shopping area in downtown Burbank, which he bought in 2009.\n\nIn 2023, amid a bruising primary race for his Senate seat,CNN reported on Schiff’s two mortgages, citing experts who said the arrangement did not put Schiff in legal jeopardy — even if it could raise tough political questions.\n\nCNN reported that deed records showed Schiff had designated his Maryland home as his primary residence, including while refinancing his mortgage over the years. In 2020, the outlet reported, Schiff again refinanced his mortgage and indicated that the Maryland home was his second.\n\nCNN also reported that Schiff for years has taken a California homeowner’s tax exemption for his Burbank home, also designating it as his primary address. CNN said that exemption amounted to “roughly $70 in annual savings.” Schiff’s spokesperson confirmed that estimate in annual savings in California, and noted that Schiff did not claim such an exemption in Maryland.",
        "source_2": "Alia Shoaib is a freelance news reporter for Newsweek based between London, UK and Abuja, Nigeria. She primarily reports on U.S. politics and current affairs. Alia joined Newsweek in 2024 from Business Insider, where she reported extensively on U.S. politics, far-right extremism, the war in Ukraine and other global events. She is a graduate of the University of Bristol and City, University of London. You can get in touch with Alia by emailinga.shoaib@newsweek.com. Languages: English and Urdu\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nPresidentDonald Trumphas escalated his attacks on SenatorAdam Schiff, calling for the Democrat to go to prison for alleged mortgage fraud.\n\nIn a Truth Social post on Sunday night, the president accused Schiff of falsifying loan documents, saying the senator was in \"BIG TROUBLE\" and should \"pay the price of prison.\"\n\nNewsweekcontacted Schiff for comment via contact form on his website on Monday.\n\nTrump and Schiff have had an adversarial relationship since the former's first presidency, and Schiff has remained a fierce critic of the president. While serving in the House of Representatives, Schiff took a leading role in inquiries into Russian interference in the 2016 election. He also played a key role in the president's first impeachment in 2019.\n\nTrump's call for Schiff to be imprisoned reflects a broader pattern of the president using his power and influence totarget his political opponents, particularly those involved in past investigations against him.\n\nTrump ramped up his attacks on Schiff last week, alleging in a Truth Social post on July 15 that the Democrat had engaged in a \"sustained pattern of possible Mortgage Fraud,\" which the president said had been uncovered by the Financial Crimes Division of the Federal National Mortgage Association, also known as Fannie Mae.\n\nThe president accused Schiff of improperly declaring a house he owned in Maryland as his primary residence to get a lower mortgage rate.\n\nA spokesperson for Schiff told theLos Angeles Timesthat the senator followed legal advice and was transparent about living between his two homes, one in his home state of California and the other near where he works in Washington, D.C.\n\nA Fannie Mae memo reviewed by the outlet did not accuse Schiff of mortgage fraud or of any crimes, but it noted \"a sustained pattern of possible occupancy misrepresentation\" regarding which home he and his wife listed as their primary residence on mortgage documents.\n\nIn a post on X, Schiff described Trump's accusations as a \"baselessattempt at political retribution.\"\n\nHe added in another post, \"And much as Trump may hope, this smear will not distract from his Epstein files problem.\"\n\nThe president has faced mounting criticism over his administration'sfailure to release recordsabout child sex abuse linked to the late financier and former Trump acquaintanceJeffrey Epstein.\n\nIn his Sunday Truth Social post, Trump also said Schiff had falsely accused his son Donald Trump Jr. of criminal activity during the Russia investigation, adding that Schiff should \"pay the price of prison for a real crime, not one made up by the corrupt accusers.\"\n\nPresident Donald Trump wrote on Truth Social on Sunday: \"Adam 'Shifty' Schiff is in BIG TROUBLE! He falsified Loan Documents. He once said my son would go to prison on a SCAM that Schiff, along with other Crooked Dems, illegally 'manufactured' in order to stage an actual coup. My son did nothing wrong, knew nothing about the fictional story. It was an American Tragedy! Now Shifty should pay the price of prison for a real crime, not one made up by the corrupt accusers!\"\n\nSenator Adam Schiff wrote on X on July 15: \"Since I led his first impeachment, Trump has repeatedly called for me to be arrested for treason. So in a way, I guess this is a bit of a letdown. And this baseless attempt at political retribution won't stop me from holding him accountable.\"\n\nSchiff has not been formally charged with any wrongdoing, and experts say it seems unlikely that Trump's calls for prosecution will lead to formal legal action.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nAlia Shoaib is a freelance news reporter for Newsweek based between London, UK and Abuja, Nigeria. She primarily reports on U.S. politics and current affairs. Alia joined Newsweek in 2024 from Business Insider, where she reported extensively on U.S. politics, far-right extremism, the war in Ukraine and other global events. She is a graduate of the University of Bristol and City, University of London. You can get in touch with Alia by emailinga.shoaib@newsweek.com. Languages: English and Urdu\n\nAlia Shoaib is a freelance news reporter for Newsweek based between London, UK and Abuja, Nigeria. She primarily reports on U.S. politics and current affairs. Alia joined Newsweek in 2024 from Business Insider, where she reported extensively on U.S. politics, far-right extremism, the war in Ukraine and other global events. She is a graduate of the University of Bristol and City, University of London. You can get in touch with Alia by emailinga.shoaib@newsweek.com. Languages: English and Urdu\n\nAlia Shoaib is a freelance news reporter for Newsweek based between London, UK and Abuja, Nigeria. She primarily reports on                                    ...Read more",
        "source_3": "Sen. Adam Schiff, D-Calif., refused to answer repeated questions from Fox News Digital about his alleged mortgage fraud. (Credit: Nicholas Ballasy for Fox News Digital)\n\nPresidentDonald Trumpcalled for California Democrat Sen. Adam Schiff to face jail time while invoking recently declassified documents alleging Obama administration officials \"manufactured and politicized intelligence\" to create the narrative that Russia was attempting to influence the 2016 presidential election.\n\n\"Adam ‘Shifty’ Schiff is in BIG TROUBLE!\" Trump posted to Truth Social Sunday evening. \"He falsified Loan Documents. He once said my son would go to prison on a SCAM that Schiff, along with other Crooked Dems, illegally ‘manufactured’ in order to stage an actual coup.\"\n\n\"My son did nothing wrong, knew nothing about the fictional story,\" he added. \"It was an American Tragedy! Now Shifty should pay the price of prison for a real crime, not one made up by the corrupt accusers!\"\n\nSchiff is under scrutiny after the U.S. Federal Housing Finance Agency (FHFA) sent a letter to the Department of Justice in May sounding the alarm that in \"multiple instances,\"Schiff allegedly\"falsified bank documents and property records to acquire more favorable loan terms, impacting payments from 2003-2019 for a Potomac, Maryland-based property.\"\n\nFEDERAL HOUSING OFFICIAL SUBMITTED SCHIFF CRIMINAL REFERRAL TO DOJ OVER MORTGAGE DOCUMENTS\n\nPresident Donald Trump highlighted 2024 allegations of mortgage fraud against Sen. Adam Schiff, left — claims that Schiff has denied.(Getty Images)\n\nFHFA is an independent federal agency that oversees Fannie Mae, Freddie Mac and the Federal Home Loan Bank System.\n\nSchiff’s office did not respond to Fox News Digital’s request for comment Monday morning.\n\nTrump publicly lambasted Schiff Tuesday over the alleged mortgage fraud, while Fannie Mae's financial crimes investigations concluded last week in a letter to the FHFA that Schiff allegedly engaged in \"a sustained pattern of possible occupancy misrepresentation\" on five Fannie Mae loans, Fox News Digital previously reported.\n\n\"I have always suspected Shifty Adam Schiff was a scam artist,\" Trump posted to Truth Social Tuesday. \"And now I learn that Fannie Mae’s Financial Crimes Division have concluded that Adam Schiff has engaged in a sustained pattern of possible Mortgage Fraud.\"\n\n\"Adam Schiff said that his primary residence was in MARYLAND to get a cheaper mortgage and rip off America, when he must LIVE in CALIFORNIA because he was a Congressman fromCALIFORNIA. I always knew Adam Schiff was a Crook. The FRAUD began with the refinance of his Maryland property on February 6, 2009, and continued through multiple transactions until the Maryland property was correctly designated as a second home on October 13, 2020.\"\n\nSchiff has passed off the allegations as a continuation of Trump's history of slamming the liberal lawmaker.\n\nSen. Adam Schiff is facing scrutiny over his home mortgages in California and Maryland.(Drew Angerer/Getty Images)\n\n\"Since I led his first impeachment, Trump has repeatedly called for me to be arrested for treason,\" Schiff posted to X earlier in July after Trump first accused Schiff of mortgage fraud. \"So in a way, I guess this is a bit of a letdown. And this baseless attempt at political retribution won’t stop me from holding him accountable. Not by a long shot.\"\n\nWATCH: ADAM SCHIFF SILENT AFTER TRUMP ACCUSED HIM OF MORTGAGE FRAUD\n\nTrump and Schiff have long been political foes, which was underscored during Trump's first administration when Schiff served as the lead House manager during the first impeachment trial against Trump in 2020, and when Schiff repeatedly promoted claims that Trump's 2016 campaigncolluded with Russia.\n\nDays after Trump first posted about Schiff's mortgages in Maryland and California, the president's Director of National Intelligence Tulsi Gabbard declassified documents that reportedly show \"overwhelming evidence\" that then-President Barack Obama and his national security team laid the groundwork for what would be the yearslong Trump–Russia collusion probeafter Trump's election win against former Secretary of State Hillary Clinton in 2016.\n\n\"It lays out, these over 100 documents that you're referencing, that I declassified and released, spells out in great detail exactly what happens when you have some of the most powerful people in our country directly leading at the helm, President Obama and his senior-most national security cabinet, James Comey, John Brennan, James Clapper, and Susan Rice and others, essentially making a very intentional decision to create this manufactured, politicized piece of intelligence with the objective of subverting the will of the American people,\" Gabbardtold Fox News' Sean HannityFriday evening.\n\nTulsi Gabbard declassified documents that reportedly show \"overwhelming evidence\" that then-President Barack Obama and his national security team laid the groundwork for what would be the yearslong Trump–Russia collusion probe.(John McDonnell/The Associated Press)\n\nTRUMP ACCUSES 'SCAM ARTIST' SCHIFF OF LYING ABOUT MARYLAND HOME TO COMMIT MORTGAGE FRAUD\n\nShe argued that the goal of Obama and his team was to essentially \"not accept the decision of the American people\" in 2016, and to use this \"manufactured, politicized piece of intelligence\" as a means to enact a \"years-long coup against President Trump.\"\n\nSchiff was an incredibly vocal lawmaker amid the Russian collusion claims, most notably when the House censured him in 2023 over his promotion that Trump's 2016 campaign colluded with Russia. Schiff served in the House representing California from 2001 to 2024, when he was sworn-in as a senator after his successful 2024 campaign to serve in the nation's upper chamber.\n\nSen. Schiff was a vocal lawmaker who promoted the narrative that the 2016 Trump campaign colluded with Russia.(Susan Walsh/The Associated Press)\n\nSchiff served as the ranking member of the House intelligence committee from 2015 to 2019, before becoming the committee's chair from 2019 to 2023. In that role, Schiff was kept up to date on classified materials surrounding the Russian collusion claims.\n\nSchiff advocated in 2018 that Donald Trump Jr., the president's son, face a subpoena amid Special Counsel Robert Mueller's investigation into claims Trump's 2016 campaign colluded with Russia to secure the election, which Trump cited in his latest Truth Social aimed at Schiff. Mueller's investigation, which wrapped up in March 2019, into the Russia claims determined there was no evidence of collusion between the Trump campaign and Russia.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}