{
    "question": "In what ways could the FBI’s limited public communication about the reported drone clusters over New Jersey and nearby states shape public trust, local responses, and policy choices?",
    "content": {
        "source_1": "Lawmaker called for a ‘limited state of emergency’, while 21 mayors asked governor to enact statewide action\n\nThe mysterious reported sightings of drone clusters in the night skies overNew Jerseyand other parts of the US north-east have prompted frustrated outbursts fromCongressmembers, triggering calls for a limited state of emergency to be declared over the region.\n\nJon Bramnick, aRepublicanstate senator in New Jersey, has demanded a ban on all drones until the mystery is solved. ABC’sAction Newsreported that he called for a “limited state of emergency … until the public receives an explanation regarding these multiple sightings”.\n\nConcern about unexplained drone sightings began in mid-November as isolated postings by local residents on social media. The issue has steadily risen up the political food chain, bursting this week on to the stage of state and federal authorities.\n\nOn Wednesday, the governor of New Jersey, Phil Murphy, held abriefing callwith the US homeland security secretary, Alejandro Mayorkas, as well as representatives in Congress and state police to discuss the drone reports. He emphasized there was “no known threat to the public at this time”.\n\nAlso on Wednesday, the House subcommittee on counter-terrorism, law enforcement and intelligenceheld a hearingon the subject. Robert Wheeler, an FBI official in charge of investigating the matter, confirmed to the hearing that the agency still had no explanation for the sightings.\n\nWhen asked whether the public was at risk, Wheeler replied: “Are we concerned there are nefarious intentions that could cause either an actual security or public safety incident? There’s nothing that is known that would lead me to say that, but we just don’t know. And that’s the concerning part of it.”\n\nHe told Congress members that more than 3,000 sightings had been phoned in to a tip line set up by the FBI last week, but so far there had been no breakthrough.\n\nThe admission that the country’s pre-eminent law enforcement agency remains essentially clueless about the mystery underlines the confusion that continues to swirl. It is not known whether a group or individual might be behind the phenomenon, or whether any credible issue even exists – there has been speculation that the flurry of activity might merely amount to confusion over sightings of regular planes or be the product of social media distortions.\n\nSightings have been made in eightNew Jerseycounties. Mayors in 21 towns across the north and center of the state have written a joint letter to Murphy calling for statewide action.\n\nConcerns have focused on drones spotted near the Bedminster golf course of president-elect Donald Trump, as well as sensitive infrastructure including electric transmission sites, rail stations and police departments.\n\nRecently sightings have spread to parts of New York City and over the suburbs of Philadelphia. Nicole Malliotakis, a Republican Congress member representing Staten Island and parts of Brooklyn, told the House hearing that drones had been reported over the Verrazzano-Narrows Bridge, close to US military bases.\n\n“They are flying over sensitive infrastructure, and the fact that we don’t know what they are, or who’s behind them, or what they’re doing is very concerning to me, particularly in a post-Chinese spy-ballon world,” she said, according to a report in the localMorristown Daily Record.\n\nOn Wednesday, the Pentagon responded and addressed the baseless claims from oneRepublican New Jersey congressmanthat the drones were from an “Iranian mothership” lying off the coast of the state.\n\nUS military bosses do not believe the drones or other craft are coming from “a foreign entity or adversary”, the deputy Pentagon press secretary, Sabrina Singh, told reporters.\n\n“There is no Iranian ship off the coast of the United States, and there’s no so-called mothership launching drones towards the United States,” she added.\n\nThe United States Northern Commandalso issued a statement.\n\n“USNORTHCOM conducted a deliberate analysis of the events, in consultation with other military organizations and interagency partners … at this time we have not been requested to assist with these events,” it said.",
        "source_2": "The Federal Aviation Administration continued its drone crackdown Friday, adding 29 cities across New York to the region’s temporary ban of unapproved drones for security concerns, as officials investigate reported drone sightings in the region amid public curiosity about the sightings.\n\nNew York Gov. Kathy Hochulsaidthe “purely precautionary” bans on unapproved drones will affect29 areas in New Yorkfor the next month, many of them “critical infrastructure sites”—adding the ban will work with the new “drone detection system” delivered to the state this week.\n\nThe FAA announced “temporary flight restrictions” Wednesday and Thursday, banning drone flying for unapproved aircraft in23 New Jersey citiesuntil Jan. 17, also expanding the FAA’s earlierrestrictionsover the Picatinny Arsenal and Bedminster.\n\nThe restrictions are for “special security reasons,” the FAA said, and an FAA notice says authorities can take measures to intercept and detain those in violation of the restrictions—including the ability to use “deadly force” on drones identified as threats,multiple outlets reported.\n\nOn Wednesday, Paul objected to a request to immediately push forwarda billfrom Sen. Gary Peters, D-Mich., that would give the Department of Homeland Security and Department of Justice the ability to surveil, track, control and destroy any drone identified as a threat — a  bill that Sen. Chuck Schumer, D-N.Y., tried to expedite by seeking unanimous consent on the Senate floor.\n\nPaulsaidthe government already has protections against drones over critical areas and called the act an intrusion of privacy; he pointed to the Biden Administration’s and federal agencies’ response to the reported drones, saying “there either is a problem or there isn't a problem” and that the Biden Administration should explain.\n\nPresident Bidenspokepublicly for the first time Tuesday at the White House about the reported drones, responding to a reporter with “they’re checking it all out,” but that it’s “nothing nefarious apparently” and poses “so far no sense of danger”—adding that “there are a lot of drones authorized up there,” and he thinks “one started it” and “everybody wanted to get in the deal.”\n\nThe Wright-Patterson Air Force Base spotted “small unmanned aerial systems” that “ranged in sizes and configurations” late Monday and early Tuesday morning, although the “airspace was not affected by the incursions,” a statement shared by Bob Purtiman, the base’s chief of public affairs, said—mere days after spotted drones closed the facilities for several hours.\n\nIn ajoint statement, the Department of Homeland Security, FBI, FAA and Defense Department said they examined the notable leads from the more than 5,000 reported drone sightings and determined “the sightings to date” are a “combination of lawful commercial drones, hobbyist drones, and law enforcement drones, as well as manned fixed-wing aircraft, helicopters, and stars mistakenly reported as drones.”\n\nThe statement added that the agencies have not “identified anything anomalous” and the reported activity does not pose any national security or public safety risk over the airspace in New Jersey and other nearby states.\n\nThe agencies also urged Congress to enact counter-UAS (unmanned aircraft systems) legislation when it reconvenes, saying such a law would “extend and expand existing counter-drone authorities to identify and mitigate any threat that may emerge.”\n\nPresident-elect Donald Trump, before declining to comment if he had received an intelligence briefing,toldreporters Monday the drones aren’t “the enemy”—he claimed the president, the government and the military “know what is happening” but are keeping the public in “suspense.”\n\nHe also said he decided to “cancel” a trip to Bedminster, New Jersey, a region with reported drone activity that is home to one of Trump’s golf clubs.\n\nSecretary of Homeland Security Alejandro Mayorkastold ABC Newson Dec. 15, “there's no question that people are seeing drones,” though some of the recent sightings in New Jersey and other East Coast states might be manned aircraft or duplicate reports.\n\nMayorkas said officials have deployed extra resources to look into the sightings and will let the public know if there is reason for concern—“we are on it,” he said—but so far, there’s no indication of foreign involvement.\n\nIn a similar vein, an unnamed FBI official said in aWhite House briefingfewer than 100 of the agency’s 5,000 tips on drone sightings have been worthy of further investigation, and modeling shows many of the sightings have taken place in the flight paths of major airports, suggesting people could be mistaking planes for drones.\n\nStill, the uptick in reported drone sightings has caused concern across several states, with social mediausersposting videos of lit objects hovering in the sky at night, and state officials asking the federal government for clarity.\n\nThe Wright-Patterson Air Force Base—a base just miles from Dayton, Ohio, that housestechnology and researchfacilities—closed its air operations for nearly four hours from Friday night into Saturday because of “small unmanned aerial systems,” though the facility was not impacted, Purtiman toldmultiplelocal outlets.\n\nNew York Gov. Kathy Hochulsaid Dec. 15federal officials are sending a “drone detection system” to her state, but argued Congress should give the state “the power to deal directly with the drones”—an idea also backed by New Jersey Gov.Phil Murphy, while Sen.Chuck Schumer, D-N.Y.,called forCongress to give local police “more tools.”\n\nHochul previouslysaiddrone activity forced Stewart Airfield north of New York City to close its runways for about an hour the night of Dec. 13, adding: “This has gone too far.”\n\nSen. Andy Kim, D-N.J.,posted several videoson X of alleged drone sightings he recorded while out with police on Dec. 12 at night, and described them doing maneuvers that are uncharacteristic of planes—though heacknowledgedlater that “deeper analysis” indicated most of the sightings were “almost certainly planes.”\n\nConnecticut state Sen. Tony Hwangreleased a statementDec. 13 saying there were “sightings of possible unauthorized drones” in Fairfield, Connecticut, saying the state must be “proactive, not reactive” in getting answers, even if it means “shooting drones down.”\n\nMichael Melham, the mayor of Belleville, New Jersey,told Fox Newsthe state’s Office of Emergency Management urged him to “immediately call the [county] bomb squad” if there is a “downed drone” nearby and that the fire department was “instructed to wear hazmat suits” around any fallen drone, saying it’s unclear if the drones have a “payload.”\n\nThe reports started when New Jersey policeannouncedNov. 19 that officers had witnessed “drone activity” the previous night over Morris County, in the state’s northwest corner, and said they would investigate the activity, noting rumors were “spreading on social media” though there was “no known threat to public safety.”\n\nA New Jersey police chiefdescribed the dronesas the size of a car andbiggerthan the standard drones available for amateur flyers; sightings have been “occurring nightly for the past two weeks beginning just after sunset and lasting well into the early morning hours,” Joseph Orlando, chief of police in Florham Park, New Jersey,saidin a statement on Dec. 4.\n\nGet Forbes Breaking News Text Alerts:We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to(201) 335-0739or sign uphere.\n\nWest is an author and coder. After a period co-founding a video game company, West started flying airplanes and learned about the conspiracies that accompany aircraft, according tohis author biographyon Amazon. Today, he’s built a brand as a go-to name for debunking UFO sightings and conspiracies. Recently, he has argued that the sightings of “drones” in New Jersey are all planes,postingevidence on X and giving explanatoryinterviews to CNN. He advocates for attaching “DTLs” (date, time and location) to online videos of unidentified aircraft, so information can be corroborated. One example of his recent work is an interview with Lucy Biggers,a social media editorat The Free Press, who posted videos of drone sightings that became a widely discussed. Biggerspostedthe interview with West on Wednesday and admitted there is “no doubt that they were planes” on X. West explains in the video how aviation data proves the sightings were airplanes.\n\nPentagon ntagon Press Secretary Major General Pat Ryder responded to more than a dozen questions about drones in briefings onMondayandTuesday, saying the department is “sharing as much information as we can based on what we know.” Ryder said the drones aren’t a threat because they would seemingly have “indicators that would probably provide an initial sense” of “something bigger.” Ryder also compared the drone sightings to seeing a car driving nearby or a common neighborhood occurrence. While “it’s entirely possible” that any random drone observed “could be up to malign activity,” the “vast majority” aren’t, he said. He added that the agency doesn’t “see a connection at this point between” the New Jersey drone sightings and the recent incursions at Wright-Patterson Air Force Base, and called the occasional presence of drones near a base “not necessarily unusual,” whereas a series of sightings at Langley Air Force Base in Virginia in 2023 were “more unusual.” Ryder said deciding if a drone is a domestic threat is “assessed on a case by case basis.” Ryder added that Picatinny Arsenal and Naval Weapons Station Earlereceivedan unspecified “variety of both passive and active sensors in order to detect” drones.\n\nConspiracy theoriesand false recordings of alleged drones have circulated online. Unfounded claims the U.S. government is flying the reported drones—possibly to search for radioactive materials—appears to be gaining traction, thanks to celebrities like Bethenny Frankel posting on TikTok,  Marjorie Taylor Greene, R-Ga.,arguingit’s “in control” and podcaster Joe Roganpromotinga video claiming the drones are secretly detecting radioactive material. Michael Melham, the mayor of Belleville, New Jersey,fanned the theory to Fox 5 New YorkTuesday, saying drones are “all over the place” while federal officials say New Jersey officials “don’t know what we’re talking about.” Another prominent conspiracy theory that’sre-appearedisProject Blue Beam, a decades-old conspiracy that the government will use deceptive tactics—like faking an alien invasion—to dominate society.\n\nTrump firstsuggestedon Dec. 13 without evidence the federal government isn't telling the public everything it knows about the drones and called for them to be shot out of the sky if unidentified. The claim echoes those of politicians like Rep. Nicole Malliotakis, R-N.Y., who said she does not believe the U.S., “with its military capabilities, does not know what these objects are.” In a Truth Socialposton Dec. 14, Trump also knocked former New Jersey Governor Chris Christie over the sightings, posting what appears to be an AI-generated image of Christie surrounded by drones delivering McDonald’s orders.\n\nTrump isn’t the only politician to push for drones to be shot down. Sen. Richard Blumenthal, D-Conn., said the drones should be taken “out of the skies” if needed. Mayorkas told ABC the Department of Homeland Security is “limited in our authorities” to take out the drones. Laws around airspace can be complicated, but generally, it’s also illegal for citizens to take down another person’s drone, the FAA toldNBC News. The FBI’s Newark office and New Jersey State Police issued astatementon Monday night warning people that they should not attempt to bring down the drones with guns or lasers. The authorities said there has been an “increase in pilots of manned aircraft being hit in the eyes with lasers” because people on the ground think they are drones. There are also concerns about “people possibly firing weapons at what they believe to be a (unmanned aircraft system) but could be a manned aircraft.” The law enforcement officials said they are working to track down any illegal drone operators but warned there could be “dangerous and possibly deadly consequences if manned aircraft are targeted mistakenly.”\n\nStates currentlylack the abilityto respond to drone threats, leading some state politicians tocall for federal legislationgiving them greater authority. Hochul is urging Congress to pass the Counter-UAS Authority Security, Safety, and ReauthorizationAct, which would renew the Department of Homeland Security’s ability to track and investigate drones—a power set to expire on Dec. 20—and require it to give state law enforcement the ability to respond to drone threats, which would include the ability to “disrupt control of, disable, damage, or destroy” them. The act was introduce in the House in June by Rep. Mark Green, R-Tenn. Similarly, Murphy and Schumer urged Congress to pass the Safeguarding the Homeland from the Threats Posed by Unmanned Aircraft Systems Act, a bill introduced in the Senate last year that would also give state and local law enforcement power to track, disable and destroy drones under DHS’s supervision. Rep.Chris Smith, R-N.J., said Saturday he is drafting legislation that would give state and local governments authority to bring down drones, asking: “Why can’t we bag at least one of these drones and get to the bottom of it?”\n\nAlmost nothing, New Jersey Assemblywoman Dawn Fantasiasaidon X Dec. 11. Fantasia’s post was a lengthy summary of a legislative meeting with the Department of Homeland Security about the mysterious sightings. She described the government’s investigation strategy, which includes a coordinated effort led by the FBI with state police, the Office of Homeland Security and the U.S. Coast Guard. She described the dozens of nightly sightings as “coordinated”  operations of drones “up to 6 [feet] in diameter” flying for six to seven hours—distances of 15 miles—unrelated to “hobbyists” or the Department of Homeland Security, which “appear to avoid detection by traditional methods (e.g., helicopters, radio frequencies).” They also aren’t related to military operations, the Picatinny Arsenalsaidin a statement to NJ Advance Media on Nov. 24.\n\nMany of the sightings have taken place in New Jersey, but there are also reports from New York, Connecticut, Pennsylvania, Maryland, Virginia, Massachusetts and elsewhere. Drones have reportedly been spotted in at least12 New Jersey counties, including in theairspaceover Naval Weapons Station Earle andabove“critical infrastructure” in Florham Park. There have also beenreportsof unidentified drones around Staten Island in New York City, including near the Verrazzano-Narrows Bridge in New York City,according toMalliotakis. Sightings also occurred aroundPhiladelphia,Virginia Beachand Fairfield, Connecticut, and former Maryland Gov. Larry Hoganposted a video on Xof alleged “large drones” in Davidsonville, in-between Annapolis and Washington, D.C., although some of the lights featured in the video were identified as stars. Further north, Massachusetts Gov. Maura Healeysaidshe is aware of a “growing number of drone sightings” in her state.\n\nOfficials say there’s no indication of security threats. The FBI and DHS released astatementon Dec. 12 saying investigators have “no evidence at this time” of “malicious activity” in New Jersey or a “national security or public safety threat.” The statement adds they have not identified “a foreign nexus” for the drones and will continue the investigation. It also said many of the drone sightings have been “cases of mistaken identity,” confusing drones for lawful, identified aircraft. John Kirby, the White House’s national security communications advisor,reiteratedthe FBI’s statement at a briefing Dec. 12 and said officials “have not been able to...corroborate any of the reported visual sightings.”\n\nNo, according to the Pentagon. Jeff Van Drew, R-NJ,saidin an interview with Fox News on Dec. 11, “Iran launched a mothership, probably about a month ago that contains these drones.” He explained the “mothership” was near the country’s Eastern coastline. In response, Sabrina Singh, the Pentagon’s deputy press secretary, rebuffed the claim. “There is no Iranian ship off the coast of the United States and there’s no so-called mothership launching drones towards the United States,” Singhtold reportersat a briefing on Dec. 11.\n\nOfficials in northeastern states have pleaded with the federal government for details on the drone sightings and argued Congress should give state and local policemore authorityto react to drones. More than 20 mayors across New Jerseysigneda letter on Dec. 9 petitioning for “transparency,” while state Rep. Jon Bramnick called for a “limited state of emergency.” Allfour senatorsrepresenting New York and New Jersey have asked for more federal resources and more information, with Sen. Cory Booker, D-N.J.,arguinga lack of “transparency” has allowed “misinformation” to spread. Murphy saidDec. 10, “it's really frustrating that we don't have more answers as to where they're coming from and why they're doing what they're doing.” He added the drones are “sophisticated” and “go dark” after someone sees them. Federal lawmakers held a hearing on Dec. 10 to discuss the drones, with several representativesexpressingfrustration, including Rep. Chris Smith, R-N.J., who advocated for broader action anddescribedit as “serious.” Rep.Tim Burchett, R-Tenn., wrote the “lack of transparency” from the White House and Pentagon regarding the drones “is more than shameful,” adding: “They don’t trust us, we don’t trust them.”\n\nPolice in Boston say theyarrestedtwo people on Dec. 14 who allegedly flew a drone “dangerously close” to Logan International Airport from an island in Boston Harbor, while a third is believed to have fled by boat. There’s no indication the arrest is related to any of the sightings throughout the Northeast, but it underscores recent worries.\n\nDrones have also been spotted flying over four U.S. Air Force bases in the U.K.,The New York Timesreported on Nov. 27, with the Air Force saying in a statement the drones have not impacted the bases and a Defense Department official saying officials were “continuing to look into it.”\n\nRecreational and commercial drones have surged in popularity, with nearly a millionregisteredby the FAA, leading to growing concerns about unsafe or malicious use. Drones areallowedin New Jersey for personal use and commercial projects, but the state requires pilots to get a certification and follow federal guidelines around the acceptable use of drones. According to FAA rules, recreational drones muststay within viewof the flyer, and are typically only allowed to operate at or below 400 feet in uncontrolled airspace, or with prior permission in controlled areas like around airports. Commercially available drones also typically have a short battery life and often can only last10 minutes to about one hourin the air. If an unknown flyer isn’t following these guidelines, it can be complicated to take the drone down. One example of this came in 2023, when unidentified aircraft were spotted and investigated by the Air Force in 2023 at the Langley Air Force Base in Virginia, theWall Street Journal reported. According to federal laws, the military can only take down drones by military bases if the drones exhibit a clear threat, and spying isn’t one, the Journal notes. TheJournal also reportedtechnological solutions for taking down the Virginia drones, like signal jamming or destructive technology, would have been risky for citizens and planes. After these drone appearances, the Pentagon released a classified new approach to dealing with these issues,Fox News reported.",
        "source_3": "Rep. Jeff Van Drew, R-N.J., addresses concerns over mystery drones flying over multiple New Jersey counties and details what sources have told him about their origins.\n\nLocal officials have not yet asked U.S. Northern Command to intervene amid reports of mysterious drones witnessed flying over New Jersey, according to a military spokesperson.\n\nThe large drone sightings have caused concern and confusion as dozens have been reported and officials are at a loss to explain where they come from. Northern Command confirmed some of the drones have been sighted near U.S. military installations.\n\n\"We are aware and monitoring the reports of unauthorized drone flights in the vicinity of military installations in New Jersey to include Picatinny Arsenal and Naval Weapons Station Earle, and we refer you to those installations for information on any efforts they are may be conducting to ensure the safety and security of their personnel and operations,\" a U.S. Northern Command spokesperson told Fox News Digital.\n\nNEW JERSEY LEADER CALLS FOR LIMITED STATE OF EMERGENCY AS DRONE MYSTERY DEEPENS\n\nA map of drone sightings in New Jersey.(Fox & Friends/Screengrab)\n\nThe spokesperson added that theFBI and local law enforcementare currently investigating the sightings.\n\n\"U.S. Northern Command conducted a deliberate analysis of the events, in consultation with other military organizations and interagency partners, and at this time we have not been requested to assist with these events,\" the spokesperson said.\n\nFBI LEADER SAYS IT'S ‘CONCERNING’ HOW LITTLE HIS AGENCY KNOWS ABOUT MYSTERIOUS DRONES SEEN OVER NEW JERSEY\n\nThe drone was seen over North Jersey on Tuesday.(Nicholas Lordi)\n\nWhite Housepress secretary Karine Jean-Pierre said Tuesday that drones flying over New Jersey were not foreign, adding that President Biden has been made aware of the situation, and the Department of Homeland Security (DHS) and FBI are investigating.\n\nThe Federal Aviation Administration first received reports of drone activity on Nov. 18 in Morris County, which is nearly 2 miles north of Trump National Golf Club Bedminster in Somerset County.\n\nNEW JERSEY DRONE SIGHTINGS: MILITARY ANALYSTS BREAK DOWN NATIONAL SECURITY CONCERNS, DOUBT HOBBYISTS AT PLAY\n\nAuthorities are investigating unusual drone activity in northern New Jersey, including the area of Trump National Golf Club in Bedminster.(Getty Images)\n\nSince then, sightings have occurred a few miles north of Bedminster in Mendham and Parsippany and other places across the Garden State.\n\nOn Monday, New Jersey Gov. Phil Murphy said there were 49 reports of drones on Sunday, mostly in Hunterdon County. The Democratic governor said his numbers also included possible sightings and potentially the same drone being reported more than once.\n\nFederal lawmakers in both parties have expressed concern over the drone sightings and called on national security agencies to make more information available as soon as possible.Fox News Digital's Greg Wehner, Charles Creitz and Morgan Phillips contributed to this report.\n\nChris Pandolfo is a breaking news reporter for Fox News Digital. Send tips to chris.pandolfo@fox.com and follow him on Twitter @ChrisCPandolfo.\n\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}