{
    "question": "In what ways could Matt Gaetz’s move to host a 9 p.m. primetime show on OAN, alongside a co-hosted podcast, shape OAN’s audience and strategy while redefining his post-Congress influence after withdrawing from the attorney general nomination?",
    "content": {
        "source_1": "Former Florida congressman Matt Gaetz will join One America News Network (OAN) as an anchor in January, the network announced Tuesday.\n\n“Matt Gaetz has earned a reputation as a relentless champion of conservative values, taking on entrenched Washington bureaucrats and exposing government overreach,” the network said in a news release. CNN reported Monday that Gaetz was expected to announce he is joining OAN as an anchor.\n\nNews of Gaetz’s move to the network comes less than a month after hewithdrewhis name from consideration to serve as attorney general, after President-elect Donald Trump told him he didn’t have the votes in the Senate.\n\nGaetz, who will host a one-hour political talk show in the primetime slot of 9 p.m. ET on weekday nights, said in a statement that he “couldn’t be more thrilled to join OAN’s forward-thinking team and be part of this revolutionary expansion.”\n\nThe Republican firebrandpreviously announcedhe is not returning to Congress next year.\n\n“I’m still going to be in the fight, but it’s going to be from a new perch. I do not intend to join the 119th Congress,” he told conservative activist Charlie Kirk in an interview last month.\n\nOAN President Charles Herring celebrated the addition of Gaetz to the network in a statement, calling the former congressman “a remarkable talent and a principled leader.”\n\n“His insider access to America’s top policymakers and unwavering dedication to America-first values will bring unparalleled insight and exclusive content to OAN viewers. We’re thrilled to welcome him to the OAN family,” Herring added.\n\nThe addition of Gaetz as an OAN anchor is a big gain for the far-right network, given that most of the channel’s personalities are not well known.\n\nThe network was dealt a significant blow when it wasdroppedby DirecTV in 2022. Other big distributors have been reluctant to carry its programming, and OAN has urged people to stream the network online instead.\n\nOAN has established itself as perhapsthe most extremeof the pro-Trump news outlets.\n\nThelittle-watched networkregularly gives airtime to baseless conspiracy theories that support Trump. The channel evenworked closelywithRussian operativeson a propaganda-style documentary during Trump’s first impeachment in 2019 over allegations he pressured Ukraine to investigate his political rivals.\n\nGaetz’s decision to withdraw his name for attorney general came in the face ofbipartisan pressure, especially as Democrats were pushing for the release of a House Ethics Committee report detailing its investigation into him, including over allegations of sexual misconduct and other alleged crimes.\n\nGaetz, first elected in 2016, has vehemently denied the allegations investigated by the Justice Department and the committee, including the claim that he had sex with a woman in 2017 when she was a minor.\n\nSince resigning from Congress, Gaetz has taken to the celebrity video message platform Cameo, where he sells personalized video messages.\n\n“I served in Congress. Trump nominated me to be US Attorney General (that didn’t work out). Once I fired the House Speaker,” his bio on Cameo says, referring to hisrole in oustingformer House Speaker Kevin McCarthy last year.\n\nThis story was updated Tuesday to reflect OAN’s announcement of Gaetz’s new show.",
        "source_2": "Ewan Palmer is a Newsweek News Reporter based in London, U.K. His focus is reporting on US politics, and Florida news. He joined Newsweek in February 2018 after spending several years working at the International Business Times U.K., where he predominantly reported on crime, politics and current affairs. Prior to this, he worked as a freelance copywriter after graduating from the University of Sunderland in 2010. Languages: English. Email: e.palmer@newsweek.com.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nMatt Gaetz is set tohost his own primetime showon the One America News Network from January.\n\nThe Matt Gaetz Show, a one-hour political talk show, will air every weeknight at 9 p.m. ET from next year, the right-wing news outlet announced on Tuesday.\n\n\"OAN is blazing a trail in media, embracing not just traditional news but the platforms where Americans are going—streaming, apps, podcasts, and social media,\" Gaetz said in a statement, according to OAN.\n\n\"I couldn't be more thrilled to join OAN's forward-thinking team and be part of this revolutionary expansion.\"\n\nOAN added in a statement: \"With Gaetz rounding out OAN's prime-time lineup, the network is poised for a groundbreaking 2025, reaffirming its mission to deliver credible, independent and unfiltered commentary to audiences across the nation.\"\n\nNewsweekcontacted a spokesperson for Gaetz and OAN for comment outside of normal working hours.\n\nGaetz will also co-host a weekly podcast with Dan Ball, host ofReal America With Dan Ball.The network said the podcast will deliver \"fresh perspectives and unfiltered conversations tailored for Millennials, late Gen Z, and early Gen Xers.\"\n\n\"We've been big fans ofMatt Gaetzfrom day one. We admire his leadership and authenticity, and we're confident he'll really connect with our viewers. It's an exciting partnership that's going to take OAN to the next level,\" Ball said in a statement, according to OAN.\n\nThe news comes weeks after the former Florida congressman resigned fromCongressandlater withdrew his nominationto serve as President-electDonald Trump's next attorney general.\n\nAnnouncing his decision, Gaetz cited the \"unfair distraction\" caused by calls for the House Ethics Committee to release a report on its investigation into him. Gaetz has denied all allegations investigated by the panel, including claims of illicit drug use and having sex with a 17-year-old girl while in office.\n\nOn December 5, the House voted 206-198 against a resolution that would have required the House Ethics Committee to release its report on Gaetz. While similar ethics reports have occasionally been released after a member of Congress has resigned, such instances are rare.\n\nGaetz's future had been unclear since he withdrew his nomination to lead theDepartment of Justice. He said in a November 22 appearance on Charlie Kirk's podcast that he had no plans to return to Congress next year.\n\nGaetz's name has been floated as a potential candidate for Florida governor whenRon DeSantis' term ends in 2026, or as apossible replacement for Florida Senator Marco Rubioif he is confirmed as Trump's next secretary of state.\n\nOAN is a staunchly pro-Trump network that frequently broadcast false claims surroundingvoter fraud in the 2020 election.\n\nDominion Voting Systems is suing OAN,its owner Robert Herring Sr., his son Charles Herring, and journalists Chanel Rion and Christina Bobb for promoting the conspiracy theory that Dominion's machines were used to rig the 2020 election in favor ofJoe Biden. All defendants have denied any wrongdoing.\n\nOAN does not currently have a deal with a major television platform. In 2022, both DirecTV and Verizon declined to renew their contracts to broadcast the network.\n\nOAN does not subscribe to Nielsen Media Research, the industry standard for measuring television audiences. However,CNNreported that in 2019 OAN averaged around 14,000 viewers from April to June of that year.\n\nEwan Palmer is a Newsweek News Reporter based in London, U.K. His focus is reporting on US politics, and Florida news. He joined Newsweek in February 2018 after spending several years working at the International Business Times U.K., where he predominantly reported on crime, politics and current affairs. Prior to this, he worked as a freelance copywriter after graduating from the University of Sunderland in 2010. Languages: English. Email: e.palmer@newsweek.com.\n\nEwan Palmer is a Newsweek News Reporter based in London, U.K. His focus is reporting on US politics, and Florida news. He joined Newsweek in February 2018 after spending several years working at the International Business Times U.K., where he predominantly reported on crime, politics and current affairs. Prior to this, he worked as a freelance copywriter after graduating from the University of Sunderland in 2010. Languages: English. Email: e.palmer@newsweek.com.\n\nEwan Palmer is a Newsweek News Reporter based in London, U.K. His focus is reporting on US politics, and Florida                                    ...Read more",
        "source_3": "Many have been wondering what Matt Gaetz’s next move was going to be after being nominated for Attorney General. The powerhouse announced on Tuesday that he will join One America News’s prime-time lineup beginning in January with his brand-new program, “The Matt Gaetz Show.” His show is set to air at 6pm Pacific, 9pm Eastern every weeknight.\n\n“OAN is blazing a trail in media, embracing not just traditional news but the platforms where Americans are going—streaming, apps, podcasts, and social media. I couldn’t be more thrilled to join OAN’s forward-thinking team and be part of this revolutionary expansion,” Gaetz stated.\n\nIn addition to his brand-new talk show, Gaetz will co-host a weekly podcast with Dan Ball, host of “Real America with Dan Ball.” This vibrant new podcast, also launching in January, will deliver fresh perspectives and unfiltered conversations tailored for Millennials, late Gen Z, and early Gen Xers.\n\n“We’ve been big fans of Matt Gaetz from day one. We admire his leadership and authenticity, and we’re confident he’ll really connect with our viewers. It’s an exciting partnership that’s going to take OAN to the next level,” Ball said.\n\nGaetz is a former eight-year member of U.S. Congress. He served as the U.S. representative for Florida’s 1stcongressional district from 2017 until his resignation in 2024.\n\nHis nomination by President-elect Donald Trump to be Attorney General represented the complete promise to end the corruption, politicization, and weaponization of the Department of Justice.\n\nThe Republican has made a lasting impact in Congress, as he single handedly initiated the ouster of former Speaker of the House Kevin McCarthy.\n\nOne America News is proud to announce 'The Matt Gaetz Show' premiering January 2025Click here to join and watch:https://t.co/4C2uH03GVu@mattgaetz@DanNewsManBall@ChanelRion#OAN#New#Breaking#Latestpic.twitter.com/oybKAO5Xzu\n\nStay informed! Receive breaking news blasts directly to your inbox for free. Subscribe here.https://www.oann.com/alerts"
    }
}