{
    "question": "How might Judge Lopez’s decision to reject The Onion’s bid for Infowars on the grounds of a flawed, noncompetitive auction process affect the path forward for a new sale and the prospects of maximizing proceeds for the Sandy Hook families?",
    "content": {
        "source_1": "A bankruptcy judge on Tuesday rejected a bid by The Onion’s parent company to buy Alex Jones’ far-right media empire, including the website Infowars, ruling that the auction process was unfair.\n\nU.S. Bankruptcy Judge Christopher Lopez said after a two-day hearing that The Onion’s parent company, Global Tetrahedron, had not submitted the best bid and was wronglynamed the winnerof an auction last month by a court-appointed trustee.\n\n“I don’t think it’s enough money,” Lopez said in a late-night ruling from the bench in a Houston court. “I’m going to not approve the sale.”\n\nIt was not immediately clear whether there would be a new auction in which The Onion could bid again for Jones’ assets. Lopez said he would leave the decision about what to do next in the hands of the trustee, Christopher Murray, who had overseen the auction.\n\nThe judge said Murray had acted in good faith in running the auction in which The Onion’s parent company initially appeared to prevail, but he said the trustee did not run a transparent process and should have given a rival bidder associated with Jones another chance to improve its bid.\n\n“I think you’ve got to go out and try to get every dollar,” Lopez said. “I think that the process fell down.”\n\nThe ruling dashed, at least for now, Global Tetrahedron’s plans to take over Infowars and radically shift its content from anti-government conspiracy theories to satirical humor. Instead, Jones can continue operating his far-right media business as he has for decades.\n\nJones went live from a studio soon after the ruling and told viewers: “We can celebrate the judge doing the right thing.” He had previouslyreferred to the sale processas “auction fraud” and a “fraudulent sale.”\n\nOnion CEO Ben Collins said ina statement on Xthat the company was \"deeply disappointed\" but would “continue to seek a path towards purchasing InfoWars in the coming weeks.”\n\n“It is part of our larger mission to make a better, funnier internet, regardless of the outcome of this case,” he said.\n\n“We appreciate that the court repeatedly recognized The Onion acted in good faith, but are disappointed that everyone was sent back to the drawing board with no winner, and no clear path forward for any bidder,\" Collins continued.\n\nCollins previously covered disinformation and conspiracy theories for NBC News, a beat that often meant covering Jones.\n\nThe Onion’s parent company had partnered in its bid with families of the victims of the 2012 Sandy Hook school shooting who successfully sued Jones for defamation, winning court judgmentsnow valued at $1.2 billion. Part of the company’s plan for Infowars was to make anti-violence organization Everytown for Gun Safety the exclusive advertiser.\n\nChris Mattei, an attorney for the Connecticut families, said they were also disappointed.\n\n“These families, who have already persevered through countless delays and roadblocks, remain resilient and determined as ever to hold Alex Jones and his corrupt businesses accountable for the harm he has caused,” he said in a statement.\n\n“This decision doesn’t change the fact that, soon, Alex Jones will begin to pay his debt to these families and he will continue doing so for as long as it takes,\" Mattei said.\n\nLast month’s announcement that Global Tetrahedron had been named the winner of the auction shocked the media world and fans of both Jones and The Onion, but that announcement was only a recommendation from the trustee andrequired approval from Lopez, who is overseeing Jones’ bankruptcy case.\n\nThe Global Tetrahedron bid consisted of two components: $1.75 million in cash and a noncash pledge by some of the bankruptcy case creditors — families of the Sandy Hook shooting — to forgo the proceeds they would typically receive from the sale. Some of the families partnered with The Onion in its bid.\n\nMurray said he valued the bid at $7 million in all.\n\nA rival bidder associated with Jones, First United American Cos., offered $3.5 million in cash, or twice as much cash as The Onion’s parent company. First United American is a limited liability company affiliated with Jones’ dietary supplements business, and its bid had Jones’ blessing.\n\nIn court Tuesday, Walter Cicack, a lawyer for First United American, alleged that the second component of the Global Tetrahedron bid consisted of “amorphous, non-cash currency.” He said his client’s all-cash offer should have won.\n\nLopez said a different process could have earned more money for creditors including the Sandy Hook families.\n\n“I don’t even think the $3.5 million is enough,” he said.\n\nAt stake is control ofmany assets from Jones’ company, Free Speech Systems, including the intellectual property associated with Infowars.com, production equipment such as computers and studio lights, and inventory from Jones’ nutritional supplements business.\n\nJones’ assets are being sold off in bankruptcy because he owes $1.2 billion to the families of the victims of the Sandy Hook shooting. Jones falsely and repeatedly told his audience that the shooting was a hoax, and the familiessuccessfully sued himfor defamation and other claims.\n\nIn testimony before the bankruptcy court in Houston, Murray defended the auction process he used. He said his only goal was to maximize the payout going to the unsecured creditors of Jones’ company.\n\n“I’ve conducted an open process. I haven’t excluded anyone from participating,” he said. Asked by a lawyer if he had a bias as to who should win the auction, he responded, “No, no bias.”\n\nThe auction process consisted of a solicitation for sealed, written bids. Murray initially considered a live auction but decided against it. He testified that after he determined Global Tetrahedron’s bid to be higher, he worked with the company and its lawyers to iron out details about the creditors waiving their share of the proceeds.\n\nLopez said in his ruling that he was not bothered by the waiver provision on its own, but he said the other bidder should have been told about it. He also said he was bothered by the ironing-out process afterward, in which he said Murray went through “mental gymnastics.”\n\n“It didn’t even feel like they understood what they understood, speaking of the trustee and the auctioneer,” he said.\n\nJason Goldstein, a lawyer for The Onion’s parent company, said in court that the delay after the conclusion of the auction had been costly.\n\n“My clients have faced this delay with significant additional cost,” he said before the ruling. “They’re still stuck here today without resolution and clarity.”",
        "source_2": "The sale of right-wing conspiracy theorist Alex Jones's Infowars website to parody news platform The Onion has been rejected by a US bankruptcy judge.\n\nAfter a two-day hearing, Judge Christopher Lopez ruled that an auction for Infowars did not result in the best bids possible.\n\nHowever, he rejected Jones' claims that the auction was plagued by \"collusion.\"\n\nThe Onion said the bid was secured with the backing of families of victims of the Sandy Hook Elementary School shooting, who won a $1.5bn (£1.18bn) defamation lawsuit against Jones for spreading false rumours about the massacre.\n\nJudge Lopez said the court-appointed bankruptcy trustee who ran the auction made \"a good-faith error\".\n\nInstead of quickly asking for final offers in the auction they should have encouraged more bidding between The Onion and a company affiliated with Jones' supplement-selling businesses, he said.\n\n\"This should have been opened back up, and it should have been opened back up for everybody,\" Judge Lopez said.\n\nJones celebrated the judge's ruling on Infowars, calling the auction process \"ridiculous\" and \"fraudulent.\"\n\n\"We are deeply disappointed in today's decision,\" Ben Collins, chief executive of The Onion's parent company, Global Tetrahedron, posted on social media.\n\nThe firm will continue its efforts to buy Infowars, he added.\n\nJones was a fringe figure broadcasting in Austin, Texas in the 1990s and later built an audience of millions with a mix of opinion, speculation and outright fabrication.\n\nThe company makes most of its money through an online shop selling vitamins and other products.\n\nThe company's – and Jones's – financial difficulties stem from broadcasts made after the December 2012 attack on Sandy Hook Elementary School in Newtown, Connecticut.\n\nTwenty young children and six school staff were killed in the attack.\n\nAfter the killings, Jones and guests on his broadcasts repeatedly called into question whether the massacre actually occurred, floating conspiracy theories about whether the murders were faked or carried out by government agents.\n\nAt one point Jones called the attack \"a giant hoax\" and in 2015 he said: \"Sandy Hook is a synthetic, completely fake with actors, in my view, manufactured… I knew they had actors there clearly, but I thought they killed some real kids, and it just shows how bold they are, that they clearly used actors.\"\n\nBelievers in the web of conspiracy theories that Jones spun harassed the families of the Sandy Hook victims, in some cases sending them pictures of their dead children or of gravestones and posting their personal information online.\n\nSome travelled to Newtown to \"investigate\", and several people have been arrested in connection with harassment of the victims.\n\nJones later acknowledged that the killings were real and insisted his statements were covered by US free speech protections.\n\nBut relatives of the victims won defamation judgements against Jones and his company over his false statements.\n\nHe declared bankruptcy in 2022 as the Sandy Hook case made its way to court, and in June 2024, a judge ordered the liquidation of Jones's personal assets. This included a multimillion-dollar ranch, other properties, cars, boats and guns, in all totalling around $8.6m according to a court filing.\n\nThe US military is preparing to activate troops as part of Trump's crackdown on street crime.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "A federal judge has rejected the sale ofAlex Jones’ Infowarsto the satirical website The Onion.\n\nThe late Tuesday ruling from U.S. Bankruptcy Judge Christopher Lopez comes after Jones claimed that a recent bankruptcy auction was fraught with illegal collusion.\n\nThe Onion was named the winning bidder last month over a company affiliated with Jones. Lopez's decision means Jones can stay at Infowars inAustin, Texas. The Onion had planned to kick Jones out and relaunch Infowars in January as a parody.\n\nLopez criticized the auction process as flawed and said the outcome \"left a lot of money on the table\" for victims of the 2012 Sandy Hook Elementary School shooting.\n\nTRUMP MAKES VOW TO ANYONE WHO INVESTS $1 BILLION OR MORE IN THE US AS A WAY TO KICK-START THE ECONOMY\n\nInfowars host Alex Jones and a desktop view of the satirical website The Onion.(Getty Images / Getty Images)\n\nA trustee who oversaw the Infowars bankruptcy auction told the judge Tuesday that he picked The Onion's bid for the conspiracy-filled platform because it was far better than the only other proposal he received, from a company affiliated with Alex Jones.\n\nTrustee Christopher Murray testified during the second day of a hearing where a judge is scrutinizing Murray's decision to name the satirical news outlet's offer as the winning bid after a November auction that Jones alleges involved fraud and collusion.\n\nThe Onion offered $1.75 million in cash and other incentives for Infowars' assets in the auction thatconcluded on Nov. 14. First United American Companies, which runs a website in Jones' name that sells nutritional supplements, bid $3.5 million.\n\nGOOGLE PULLS MCDONALD'S NEGATIVE REVIEWS OVER CEO SHOOTING SUSPECT\n\nAlthough The Onion's cash offer was lower than that of First United American, it included a pledge by many of the Sandy Hook families to forgo $750,000 of the auction proceeds due to them and give it to other creditors, providing the other creditors more money than they would receive under First United American's bid.\n\nPedestrians walk by an Onion news rack in San Francisco.(Justin Sullivan/Getty Images / Getty Images)\n\nDuring a broadcast from his Austin studios earlier Tuesday, Jones said: \"I can't imagine the judge would certify this fraud.\"\n\n\"I mean it's head-spinning the stuff they did and what they claimed,\" he said.\n\nThe sale of Infowars is part of Jones' personal bankruptcy case, filed in late 2022 after he was ordered to pay nearly $1.5 billion in defamation lawsuits in Connecticut and Texas filed by relatives of victims of the Sandy Hook Elementary School shooting.\n\nInfoWars founder Alex Jones speaks to the media outside Waterbury Superior Court during his trial in Waterbury, Connecticut, on Sept. 21, 2022.(Joe Buglewicz/Getty Images / Getty Images)\n\nJones repeatedly called the 2012 shooting that killed 20 children and six educators a hoax staged by actors and aimed at increasing gun control. Parents and children of many of the victims testified in court that they were traumatized by Jones' conspiracies and threats from his followers.\n\nThe Infowars host has since acknowledged that the Connecticut school shooting happened. But Jones is appealing the $1.5 billion in judgments citing his free speech rights.\n\nBen Collins, CEO of The Onion, said the company was \"deeply disappointed\" in the judge's decision but \"will continue to seek a resolution that helps the Sandy Hook families receive a positive outcome for the horror they endured.\"\n\n\"We will also continue to seek a path towards purchasing InfoWars in the coming weeks. It is part of our larger mission to make a better, funnier internet, regardless of the outcome of this case,\" Collins said in a statement provided to FOX Business. \"We appreciate that the court repeatedly recognized The Onion acted in good faith, but are disappointed that everyone was sent back to the drawing board with no winner, and no clear path forward for any bidder. And for all of those as upset about this as we are, please know we will continue to seek moments of hope. We are undeterred in our mission to make a funnier world.\"\n\nFOX Business has reached out to Infowars for a response.\n\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\n\nBy clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time."
    }
}