{
    "question": "How might Romania’s decision to annul the first-round presidential vote over alleged Russian interference affect public trust in its democratic institutions and future elections?",
    "content": {
        "source_1": "Here’s what you need to know after an alleged Russian hybrid attack prompted Romania’s Constitutional Court to cancel the presidential election.\n\nBUCHAREST — Scrapping an election between two rounds of voting is a massive step to take, but Romania’s Constitutional Court decided it was essential to protect democracy from foreign attack.\n\nThe court’s move toannul the Romanian presidential electionplunged the country into turmoil, and it’s not clear where the upheaval will end.\n\nHere is POLITICO’s guide to the extraordinary crisis in democracy engulfing one of theEU and NATO’s most importantEastern European member countries.\n\nThis Sunday, Romanians were due to vote in the second-round runoff election for their next president. They had two candidates to pick from: center-right small-town mayor Elena Lasconi; or Călin Georgescu, a far-right independent who wascatapulted from obscurityinto the lead in the first round of voting on Nov. 24.\n\nOn Friday, Romania’s Constitutional Court decided the first round of the election was so badly damaged — by an alleged Russian operation to influence the result — that the whole process needed to be scrapped and started again.\n\nCurrent President Klaus Iohannis has been forced to extend his term, political candidates are trying to regroup and preparing to rerun their expensive campaigns, and millions of voters are wondering whether they can trust the process at all.\n\nNo date has yet been set for the new votes — but that will have to happen soon.\n\nBarely a month ago, Georgescu was almost unheard of inside his own country, with no party backing and a low profile in traditional media.\n\nBut all that changed in the final two weeks before the Nov. 24 first round of the presidential election. Some 25,000 pro-Georgescu TikTok accounts burst into action, in what Romanian analysts say was a coordinated attempt to sway the election in his favor.\n\nPresident Iohannis, who hails from another center-right party, received evidence from the secret intelligence services indicating that both state and nonstate actors had interfered in the election, and named Russia as responsible for a series of aggressive hybrid attacks. The United States upheld findings of Russian involvement.\n\nActing on the intelligence,Iohannis declassified secret filesthat alleged Georgescu had unlawfully benefited from extensive electoral promotion during periods when campaigning was prohibited. The documents alleged his campaign had received foreign financial support, despite the fact he declared he’d spent nothing on it.\n\nThe Constitutional Court was inundated by a surge of requests to annul the election in light of the declassified intelligence reports. On Friday afternoon, the court agreed.\n\nThe information “that this campaign was illegally supported from outside Romania” brought Iohannis to the conclusion that “We are dealing with a matter of national security,” the president said in a televised address Friday evening.\n\nInside Romania, this election was seen asa battle between East and West. In a country where memories of brutal Communist dictatorship are still vivid, the choice for many voters felt existential.\n\nThe pro-EU Lasconi enjoyed support from the centrist traditional parties, while Georgescu was backed by three far-right groups, two of which have recently entered parliament.\n\nHis positions on NATO and the EU — he has been highly critical of Romania’s involvement in both — stoked fears that he would rip up the country’s Western alliances and turn instead toward Moscow. He has praised Russian President Vladimir Putin as a leader and a patriot, and vowed to end all Romanian aid to neighboring Ukraine — which would be a massive step at acritical timefor Kyiv.\n\nEven so, millions of Romanians were attracted to Georgescu’s traditionalist campaign and had been ready to vote for him on Sunday’s runoff against Lasconi. He won more than 2.1 million votes in the first round when competing against seven other main candidates, after parading his belief in traditional family structures and his Romanian Orthodox faith.\n\nGeorgescu now says he’s a victim of a plot by the political elite to keep him out of power and thwart the will of the people, likening his treatment to that of Donald Trump by the establishment in the United States.\n\nEven his main opponent, Lasconi,denounced the court’s decision, saying Romania’s democracy was being “trampled” by the state. Georgescu used the same phrase.\n\nThe risk in the court’s decision is that more Romanian voters may now lose faith in the country’s political system. While central Bucharest were calm Friday evening, there was a heavy police presence on the streets. The contest has attracted public demonstrations from thousands of people in recent days.\n\nGeorgescu said he will file a complaint with Romania’s Supreme Court, but there’s no clear legal route to overturning the Constitutional Court ruling. He has not said yet whether he intends to stand again in another election.\n\nOn Dec. 1, Romanian votersalso elected a new parliament. Next week a broad coalition made up of four parties will form a government that will work on organizing the new presidential election.\n\nThe coalition will name a prime minister to be approved by the incumbent president. Iohannis’ mandate would have ended on Dec. 21 — but he said he will stay in power until his successor is sworn in.\n\nIn the meantime, criminal investigators have launched an inquiry into the cyberattacks on election infrastructure, which were detailed in the declassified intelligence files. This is the third investigation opened by Romanian prosecutors after the general prosecutor launched two others looking at voter corruption, computer system fraud and campaign money-laundering of at least €1 million.\n\nTikTok is also under fire at the EU level, having been summoned to the European Parliament forquestioning over its content moderationduring the presidential primary and with the European Commission recentlyordering it to preserve dataon the Romanian election. TikTok didshut down three influence campaignsafter the first-round poll.\n\nThere are also calls on the Constitutional Court to cancel the parliamentary election, which was sandwiched between the two rounds of the presidential contest. Some parties point to the fact the ballot was held during the same hybrid attacks that triggered Friday’s annulment ruling.\n\nThe German chancellor is increasingly isolated among Europe’s big beasts for refusing to endorse a Brussels plan to suspend EU research ties with Israel.\n\nWhile the U.K.’s low-tariff agreement with America is a Brexit bonus, victory over Europe may not be what Keir Starmer needs.\n\nA Brussels plan to suspend Israel’s participation in the Horizon research program needs to win more backing from  countries.\n\nReza Pahlavi, son of the last shah, is hosting a convention of activists in Munich Saturday to build support for democracy.",
        "source_2": "This is Radio Schuman, your new go-to podcast to spice up your weekday mornings with relevant news, insights, and behind-the-scenes from Brussels and beyond.\n\nFrom the economy to the climate and the EU's role in world affairs, this talk show sheds light on European affairs and the issues that impact on our daily lives as Europeans. Tune in to understand the ins and outs of European politics.\n\nNo agenda, no argument, no bias, No Comment. Get the story without commentary.\n\nDare to imagine the future with business and tech visionaries\n\nEuronews Tech Talks goes beyond discussions to explore the impact of new technologies on our lives. With explanations, engaging Q&As, and lively conversations, the podcast provides valuable insights into the intersection of technology and society.\n\nEurope's water is under increasing pressure. Pollution, droughts, floods are taking their toll on our drinking water, lakes, rivers and coastlines. Join us on a journey around Europe to see why protecting ecosystems matters, how our wastewater can be better managed, and to discover some of the best water solutions.   Video reports, an animated explainer series and live debate - find out why Water Matters, from Euronews.\n\nWe give you the latest climate facts from the world’s leading source, analyse the trends and explain how our planet is changing. We meet the experts on the front line of climate change who explore new strategies to mitigate and adapt.\n\nThis is Radio Schuman, your new go-to podcast to spice up your weekday mornings with relevant news, insights, and behind-the-scenes from Brussels and beyond.\n\nFrom the economy to the climate and the EU's role in world affairs, this talk show sheds light on European affairs and the issues that impact on our daily lives as Europeans. Tune in to understand the ins and outs of European politics.\n\nNo agenda, no argument, no bias, No Comment. Get the story without commentary.\n\nDare to imagine the future with business and tech visionaries\n\nEuronews Tech Talks goes beyond discussions to explore the impact of new technologies on our lives. With explanations, engaging Q&As, and lively conversations, the podcast provides valuable insights into the intersection of technology and society.\n\nEurope's water is under increasing pressure. Pollution, droughts, floods are taking their toll on our drinking water, lakes, rivers and coastlines. Join us on a journey around Europe to see why protecting ecosystems matters, how our wastewater can be better managed, and to discover some of the best water solutions.   Video reports, an animated explainer series and live debate - find out why Water Matters, from Euronews.\n\nWe give you the latest climate facts from the world’s leading source, analyse the trends and explain how our planet is changing. We meet the experts on the front line of climate change who explore new strategies to mitigate and adapt.\n\nThe Romanian presidential run-off between far-right candidate Calin Georgescu and centrist pro-EU Elena Lasconi is now off, after the Constitutional Court (CCR) cancelled the results of the first round of votes and announced entirely new elections will be held instead.\n\nThis dramatic and unprecedented decision comes just as the voting has begun in the diaspora.\n\n\"The electoral process for the election of the president of Romania will be resumed in its entirety, with the government required to set a new date for the election of the president of Romania as well as a new calendar program for carrying out the necessary actions,\" the court said in a statement on Friday.\n\nThe court said the decision to annul the first round was due to procedural issues and the declassification of the secret reports by the Romanian intelligence services showing Russian involvement in influencing voters through an anti-Western propaganda campaign supporting Georgescu.\n\nThe intelligence reports showed several illegal processes in Georgescu’s campaign financing.\n\nThe court previously assessed a request to annul the election's result after Georgescu stunned the political establishment to come first place but decided to press ahead.\n\nFriday's decision leaves the country in an unparalleled political situation with unforeseen consequences. According to initial scenarios, the new election might take place in spring 2025 if the decision on the new vote also means restarting the entire process, including collecting signatures for each candidate from scratch.\n\nThe centre-left Social Democratic party's candidate in the first round and Prime Minister-incumbent Marcel Ciolacu hailed the Bucharest court's decision as the right thing to do.\n\n\"The CCR's decision to cancel the presidential elections is the only correct solution after the declassification of documents from the CSAT meeting, which show that the result of the Romanian vote was flagrantly distorted following Russian intervention,\" Ciolacu said.\n\n\"The authorities' investigations must show who is to blame for the attempt to influence the outcome of the presidential election massively,\" he added.\n\n\"Romanians need clear answers from the authorities based on solid evidence because public trust in state institutions and in the democratic processes that underpin the functioning of the country fundamentally depends on this investigation, Ciolacu concluded.\n\nOther Romanian politicians, including Lasconi, have largely slammed the court's decision, with the liberal candidate calling it \"illegal, immoral and crushes the very essence of democracy.\"\n\n\"Today is the moment when the Romanian state trampled on democracy. God, the Romanian people, truth and the law will prevail and find them guilty of destroying our democracy,\" she said.\n\n\"We have all already seen how Putin laughed at the way the political power in Bucharest managed these elections,\" the USR leader added.\n\nThe leader of the far-right nationalist party AUR George Simion labelled the court's decision a \"coup d'état in full swing\" but rejected the idea of protests at this time.\n\n\"We don't go out into the streets, we don't let ourselves be provoked, this system must fall democratically,\" Simion wrote on Facebook.\n\nGeorgescu, the winner of the presidential election's first round, did not hold a press conference despite the press gathered in front of his house on Friday night.\n\nIn a chilling pre-recorded speech aired on the Realitatea news channel instead, he pilloried the court's ruling as \"a barbaric act done by the oligarch state against democracy.\"\n\n\"The corrupt system in Romania made a pact with the devil. The parties' leaders tremble with fear,\" he said. \"The wave is moving, cannot be stopped, look everywhere, in the whole world, look at what happens in France.\"\n\n\"I don't think we will lose the elections, the Romanian people will go on to vote. Instead of (US President-elect Donald) Trump, they have put Georgescu. The same accusations were directed at Trump.\"\n\n\"I will continue, nothing can stop us. God can never be defeated,\" he concluded.\n\nGeorgescu has been subject to controversy since he surprisingly topped the ballot almost two weeks ago.\n\nThe first round of voting has already faced scrutiny from the court, with two candidates who lost the round filing complaints regarding the lack of transparency of campaign funding and voter deception.\n\nOn Wednesday, bombshell declassified information from Romania's intelligence agencies revealed that Georgescu's win was \"not a natural outcome\" and that a coordinated social media campaign by a \"state actor\" artificially propped up his victory.\n\nGeorgescu ran a successful campaign on the social media platform TikTok. His popularity exploded in the weeks before the vote, with the candidate gaining tens of millions of views days before the first round.\n\nThe documents showed a pre-organised sleeper network suddenly became active on the app two weeks before the election.\n\nRomanian intelligence concluded that the network used methods typical of a state actor in recruiting and coordinating with others through the messaging platform Telegram.\n\nThe documents also found that almost €1 million was spent during the campaign by an individual who supported Georgescu's candidacy, with up to €950 paid for a repost on the app.\n\nGeorgescu claimed he had no campaign budget and was helped through volunteers.\n\nOn Thursday, the European CommissionsentTikTok an \"urgent\" request for information about the platform's role in the elections.\n\n\"We are concerned about mounting indications of coordinated foreign online influence operation targeting ongoing Romanian elections, especially on TikTok,\" said Henna Virkkunen, the Commisison's executive vice-president in charge of digital policy.\n\nTikTok has not responded to Euronews' requests for comment.",
        "source_3": "Something unprecedented just happened in the NATO and EU member country of Romania - a top court on Fridayannulled the first round of the country's presidential election. Essentially there will now be a 'do over' election.\n\nThe Constitutional Court made the decision even as voting is still underway in the diaspora. \"The electoral process for the election of the President of Romaniawill be resumed in its entirety, with the Government required to set a new date for the electionof the President of Romania as well as a new calendar program for carrying out the necessary actions,\" the court said in a statement.\n\nThe court decided \"toannul the entire electoral processfor the election of the President of Romania… to ensure the correctness and legality of the electoral process\" - in a controversial ruling which has simply never happened.\n\nCalin Georgescu, the widely dubbed 'far-right' contender, came out on top in a first round of voting in a 'shock' outcome which left political opponentsclaiming Russian election interference.\n\nApparently the 'smoking gun' is related to mere social media posts on platforms like TikTok. \"The Constitutional Court’s unprecedented decision — which is final — came after President Klaus Iohannisdeclassified intelligence on Wednesday that alleged Russia ran a sprawling campaign comprising thousands of social media accountsto promote Calin Georgescu across platforms likeTikTok and Telegram,\"The Associated Pressdetails.\n\nGeorgescu emerged top of the ballot after the Nov.24 first round vote, despite declaring no campaign spending, and was set to enter a run-off originally scheduled for Sunday against reformist Elena Lasconi of the Save Romania Union party.\n\nContributing to the dossier examined by the court on the alleged Russian election interference included the Romanian Intelligence Service, the Foreign Intelligence Service, the Special Telecommunication Service and the Ministry of Internal Affairs, AP has noted further.\n\nGeorgescu's nationalist rhetoric has proven ultra popular as social media videos featuring him have racked up millions of views. But at least much of this would likely be genuine and organic, given that the vast majority of thepopulation leansultra-conservative.\n\nAlso Romania hasone of the highest church attendance rates in Europe, with the dominant religion being the very traditional Romanian Orthodox Church, which is also in communion with the Russian Orthodox Church.\n\nThis is the wildest thing I’ve ever seen. The EU-NATO establishment is on a putschist spree.https://t.co/IXzvptl8Qg\n\nRussia on Friday vehemently denied that it is interfering in Romania's election. This as Western media is already labelling Georgescu as\"pro-Russian\". Similar controversy has lately engulfed politics in Georgia as well, where pro-EU street protests have continued.\n\n\"The campaign for the Romanian presidential election... isaccompanied by an unprecedented outburst of anti-Russian hysteria,\" Russian foreign ministry spokeswoman Maria Zakharova told the press in response to the reports. \"More and more absurd accusations are being made by local politicians, officials and media representatives...,\" she said. \"We firmly reject all hostile attacks, which we consider absolutely groundless.\"\n\nThe European Commission at the same time says it's closely monitoring the TikTok platform related to Romania's election. NATO and Washington are also watching closely, given a Georgescu victory could have huge implications for the future of Western military bases and units inside Romania, on NATO's so-calledEastern flank:\n\nRomania is a serious military power, which is why the risk thatNATO-skeptic, pro-Russia candidateCălin Georgescu will become its president next Sunday is confounding the alliance.\n\nThe country of 19 million has been a NATO member for two decades, and is thesite of an airbase that is expanding to be the bloc's biggest in Europe. It borders Ukraine; stares across the Black Sea at Russia-occupied Crimea; has sent arms and ammunition to Kyiv; andhostsa U.S. Aegis Ashore missile defense system in Deveselu, in southern Romania, where both Romanian and U.S. forces are based.\n\nBut those international ties are deplored by Georgescu, who hascondemnedthe Deveselu missiles as a national“shame,” campaigned for ending Romanian aid to Ukraine, and called for “Russian wisdom” in shaping foreign policy.\n\nHis rhetoric is similar to Hungary's Viktor Orban or Italy's Meloni...\n\nThis is why they are trying to censor and imprison Călin GeorgescuHe is the first presidential candidate in decades whose priority is the well-being of the Romanian peoplehttps://t.co/LPUtSBtqtipic.twitter.com/6icQRwQvot\n\nBut depending on how convincing the alleged evidence in possession of Romanian intelligence is, this is more likely just another example of European officials screaming 'Russian interference' when a politician emerges who they don't like. It is perhaps the next round of election which will be the most telling. It remains unclear whether the 'evidence' will be made public, or if it will be convincing to the general Romanian public.\n\nThe \"declassified intelligence\" released yesterday by the incumbent Romanian administration relies almost exclusively on an analysis of TikTok, claiming the platform was used to illicitly boost the winning candidate. The next day, Romania's high court annuls the electionpic.twitter.com/X1Cmq3zIU6"
    }
}