{
    "question": "In what ways might Muhammad becoming the most common boys’ name in 2023, alongside growing pop culture influences on baby names, reflect broader demographic and cultural shifts in England and Wales?",
    "content": {
        "source_1": "Noah beaten into second place for boys, while Olivia keeps top slot for girls\n\nMuhammad has become the most popular baby name for boys in England and Wales for the first time, new data from theOffice for National Statistics(ONS) has revealed.\n\nThe name has been among the top 10 names for baby boys since 2016, but has now overtaken the previous favourite, Noah. Oliver was third in the 2023 rankings for England and Wales.\n\nFor baby girls Olivia remained the most popular name for the eighth year in a row, with Amelia and Isla the second and third most popular.\n\nEach year, theONS analyses the latest baby name data, revealing the most popular – and unpopular – names in England and Wales. The rankings were created using the exact spellings of names given at birth registration, meaning similar names with different spellings were counted separately.Three variant spellings of the Arabic name Muhammad made the list of the top 100 baby boys’ names in England and Wales in previous years, but this is the first year that just one spelling of the name has managed to top the list.In 2023 there were 4,661 Muhammads born across England and Wales, up from 4,177 in 2022, while Mohammed came in 28th with 1,601 and Mohammad came 68th with 835.The data shows that Muhammad was the most popular boys’ name in four out of nine regions in England and 63rd most popular in Wales. Meanwhile, Olivia was the most popular girls’ name in five out of nine regions in England and the most popular in Wales. It has been in the top three for girls’ names every year since 2006.\n\nInformation on baby names is collected separately by the Northern Ireland Statistics and Research Agency.It reportedin April that “Noah took the top spot for boys in 2023, after being in the top 3 since 2019. While Isla took the top spot for the girls, after Grace had previously held it for 5 years.”National Records of Scotlandreported earlier this yearthat in 2023 Luca became the most-chosen name for boys for the first time since records began in 1974, overtaking the 2022 leader, Noah. For baby girls, “Isla returned to first place again for the first time since 2021, overtaking Olivia, which has been the most popular name for girls in recent years.”\n\nSpeaking of England and Wales, the ONS’s Greg Ceely said, pop culture continued to influence name choices, with an increase in music artists’ names such as Billie, Lana, Miley and Rihanna for girls and Kendrick and Elton for boys. The summer blockbuster film Barbie, starring Margot Robbie, was also influential, with 215 more baby girls named Margot than in 2022, meaning the name ranked 44th out of the 100 most popular baby girl names.\n\nBut while pop culture seems to influence parents, the royal family seem to be having the opposite effect, with royal names falling in popularity in 2023. George ranked fourth with 3,494 babies being given the name – the first time George has fallen below 4,000 in nearly ten years. William came in 29th and Louis 45th for boys, and Charlotte ranked 23rd for girls.\n\nThe time of year also had an impact for baby girls, with Autumn and Summer increasing in popularity, particularly during their respective seasons; both names were in the top 100. In December the names Holly, Robyn and Joseph were more popular.\n\nOther new entries into the top 100 in England and Wales included Hazel, Lilah, Nevaeh and Raya for girls, and Jax, Enzo and Bodhi for boys.\n\nThis article was amended on 6 December 2024. An earlier version said that ONS baby-names figures were for the UK. The figures cover England and Wales only.",
        "source_2": "Muhammad was the top choice for parents naming their baby boys in England and Wales in 2023, with more than 4,600 children registered with the name.\n\nIt has been among the top 10 names for baby boys since 2016, but has now overtaken the previous favourite, Noah, according to the Office for National Statistics (ONS).\n\nThere is, however, a level of regional variation with Muhammad not appearing in the top 10 for three regions of England.\n\nOther spellings of the name Mohammed and Mohammad also made the top 100 list for England and Wales. The ONS considers each spelling as a separate name, with different variations of Muhammad proving popular in previous years.\n\nOlivia remains the most popular choice for baby girls, followed by Amelia and Isla. These top three have remained unchanged since 2022.\n\nHyphenated names jumped in popularity for girls last year, standing at more than 19,140 names, up from around 12,330 the year before.\n\nNew entries to the top 100 list for girls include Lilah, Raya and Hazel, while Jax, Enzo and Bodhi made it into the top 100 for boys.\n\nThe ONS said on Thursday that pop culture \"continues to influence\" name choices, citing singers Billie Eilish and Lana Del Rey, the Kardashian-Jenner family's children Reign and Saint, and film stars Margot Robbie and Cillian Murphy.\n\nOther music artist names Miley, Rihanna, Kendrick and Elton also saw an increase in 2023. That was likely due to album releases, touring, or high-profile performances by Miley Cyrus, Kendrick Lamar, Elton John, and Rihanna, the ONS said.\n\nDays of the week have been a further source of inspiration for parents, with names such as Sunday and Wednesday rising in popularity last year. The ONS drew a possible link with the Netflix series Wednesday, which was released in late 2022.\n\nAs for the seasons, Autumn ranks 96th in the list and Summer 86th, up 10 places from 2022, but 38 places lower than in 2013.\n\nMeanwhile, royal names were less popular in 2023 - a decline that forms part of an ongoing trend.\n\nGeorge, Archie, Harry and Charlotte have all become less popular in recent years, as have Elizabeth and Charles.\n\nData for 2022's top baby names wasreleased last Mayamid changes to resources.\n\nPublishing dates for 2024's most popular picks have not yet been confirmed.\n\nThe latest ONS list showed Welsh names Mali and Arthur remained popular for babies born in 2024.\n\nNew entrants into the top 100 most popular in England and Wales include Athena and Yahya.\n\nOther most-popular names included Florence, Harper, Theo, Archie and Noah, new data revealed.\n\nNoah previously took top spot in 2023, while this is the seventh time Olivia has been the most popular girl's name.\n\nA practice handed down through generations in Gaelic-speaking communities could be at risk of being lost.",
        "source_3": "Published:15:04 BST, 5 December 2024|Updated:16:28 BST, 5 December 2024\n\nMuhammad was today officially crowned the most popular name for baby boys in England and Wales.\n\nMore than 4,600 boys were given the specific spelling of Muhammad in 2023, according to the Office for National Statistics (ONS) – almost 500 more than in 2022.\n\nIt marked the first time that one spelling of the Islamic name has topped the naming charts, overtaking Noah. Although when the five most common iterations are grouped together, it has been the most common for over a decade, analysis suggests.\n\nData shows that another 3,069 boys were named Mohammed, Mohammad, Muhammed or Mohamed in 2023.\n\nIt means, in total, 7,730 – or one in every 40 – were given the name Muhammad or one of four separate iterations ubiquitous in Islamic culture.\n\nFor comparison, 4,382 boys born in 2023 were called Noah.\n\nOlivia retained the top spot on the list of girl's names for the eighth year in a row, followed by Amelia and Isla.\n\nEach year the ONS analyses the latest baby name data, uncovering trends in how certain names have fallen out of favour or soared in popularity.\n\nAnalysts spotted a rise in the number of parents choosing names like Margot and Cilian, in a trend thought to be inspired by the 'Barbenheimer' phenomenom which saw fans flock to cinemas to watch Margot Robbie in Barbie and Cilian Murphy in Oppenheimer.\n\nThe ONS also pointed to a 'continued increase' in parents opting for names of thereality TVKardashian-Jenner family such as Reign, Saint and Stormi in favour of traditional Royal monikers.\n\nMohammed, a different spelling to the one crowned most popular in 2023, entered the top 100 boys' names for England and Wales 100 years ago, debuting at 91st in 1924.\n\nIts prevalence dropped considerably in the lead up to and duringWW2but began to rise in the 1960s.\n\nThat particular iteration of the name was the only one to appear in theONS' top 100 data from 1924 until Mohammad joined in the early 1980s.\n\nMuhammad, now the most popular of the trio, first broke into the top 100 in the mid-1980s and has seen the fastest growth of all three iterations since.\n\nThe name means ‘praiseworthy’ or ‘commendable’ and stems from the Arabic word ‘hamad’ meaning ‘to praise’ and is shared with the founder of Islam, the prophet Muhammad.\n\nIncreasing sizes of Muslim communities across the UK fuelled by immigration, as well as the popularity of sporting figures such asMo Farah,Mohamed SalahandMuhammad Aliare likely to have sparked the increase.\n\nThe ONS only provides statistics based on the exact spelling and do not group names, as some groupings are subjective and not straightforward.\n\nFor example, if multiple spelling were grouped under one umbrella name, Theodore (8th in 2023, 2,666) and Theo (11th in 2023, 2,489) would also be above Noah.\n\nMore than thirty different iterations, including hyphenated names, were registered by the ONS in 2023.\n\nOther spellings listed in the ONS report for 2023 include: Mohamad, Muhamad, Muhamed, Mohummed, Mohammod. Hyphenated variations include Muhammmad-Ibrahim and Muhammad-Musa.\n\nWhen counting the five most popular, however, stats show Muhammad has been the most common name since 2011.\n\nJust 3,495 boys were named after the founder of Islam in 1996. This had doubled by 2007, reflecting the surge in the UK's Muslim community.\n\nIn terms of crude numbers, the name peaked in 2013 (8,333).\n\nYet it makes up a bigger share of boys now (2.6 per cent) than ever before because of plunging birth rates – partly fuelled by women choosing to focus on their careers and couples waiting to have children until later in life.\n\nThe number of Noahs, meanwhile, slid from 4,586 to 4,382. Oliver, which ranked third, also saw a slight drop in prevalence.\n\nThe biggest gainer in the top 15 list of boy names was Luca, which jumped from 12th last year with 2,625 namings to 7th this year with 3,195.\n\nHenry, too, jumped from 13th (2,624) last year to 10th (2,490).\n\nOf the top 100 names given to boys, Bodhi saw the highest one year leap. It jumped from 637th to 100th.\n\nNew entries to the top 100 baby names include Hazel, Lilah, Autumn, Nevaeh and Raya for girls, as well as Jax, Enzo and Bodhi for boys.\n\nOn the girls' side, 2,906 babies were called in Olivia in 2023. This was down on 3,289 the previous year.\n\nAva fell from 4th place in 2022 (2,293) to 6th this time around with 2,050 namings, while Willow jumped into the top 10, placing ninth with 1,833 namings.\n\nThe only four-digit rankings leap across eithergendercame from Nova, which took 81st, having sat in 1,128th spot last year.\n\nElsewhere in the world of celebrity, the ONS data showed Hollywood still holds a massive sway over Brits' naming habits.\n\nWith the releases of box office smash hitsOppenheimerand Barbie last summer, Robbie in particular saw a major boost to namesakes in England and Wales, nearly doubling between February and July 2023.\n\nCillian also saw a bump from just 12 namings in April to 31 in October – three months after the release ofChristopher Nolan's atomic bomb epic.\n\nMusicians also have a proven track record of influencing the names of our children.\n\nLast year was the year of Rita and Dua in certain parts of the UK.\n\nThis time around, nine-timeGrammyaward winnerBillie Eilishsaw her biggest gain in years, following on from writing the title song forMargot Robbie's Barbie flick, a major US tour and collaboration with Apple Films and a starring role in her first TV project.\n\nThough the name choices for A-list celebrities such asKim Kardashianrank relatively low on the frequency scale, their popularity appears to still be growing.\n\nKim gave birth to North in 2013, Saint in 2015,Chicagoin 2018 and Psalm-West in 2019 while with ex-husbandKanye West.\n\nHer sister Kourtney gave birth to her daughter Reign in 2014 and the name's popularity has rocketed since.\n\nDespite general enthusiasm and support for theRoyal Familyholding steady since the Queen's death in September 2022, there seem to be less namesakes of the world's most famous family in England and Wales.\n\nGeorge and Archie, sons ofPrince Williamand his brother theDuke of Sussex, have both seen sharp drop-offs in terms of their popularities, with George falling below 4,000 in 2023 for the first time in nearly ten years.\n\nCamilla (63), after the Queen Consort, has remained largely flat over the same time period as have Lilibet (33)\n\nNames are becoming more creative, and not just down to the calling children the namesake of a famous celebrity.\n\nIvy-Rose was the most popular hyphenated name in 2023, which earned the spot of 224th with 208 recordings.\n\nIsla-Rose followed in 337th place with 128 namings, while Ava-Mae (114 namings) and Lily-Rose (111 namings), potentially inspired Lily-Rose Depp, followed.\n\nOn the boy side, Tommy-Lee is the highest-ranking hyphenated name but does not appear until number 439 with just 90 namings.\n\nArlo-James with 44 namings and Abdul-Hadi with 37 names follow in 754th and 857th place, respectively.\n\nThe data also show huge spikes around certain namings at certain times of the year.\n\nPoppy leapt from 132 in September to 222 in November around Remembrance Sunday, while Summer almost quadrupled between April and October and Holly nearly tripled from November to December.\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nWe are no longer accepting comments on this article."
    }
}