{
    "question": "How might the FBI’s warning that Android-to-iPhone texts aren’t secure, issued amid the ongoing Salt Typhoon telecom breach, shape Americans’ messaging habits and the policy debates ahead of the Senate’s Dec. 11 meeting?",
    "content": {
        "source_1": "Officials from the FBI and the Cybersecurity and Infrastructure Security Agency say the major Chinese hack began in late spring, and they are strongly urging Americans to use encrypted communications.\n\nCISA, the FBI, the National Security Agency, and partner agencies in New Zealand, Australia and Canada also released a joint alert on Tuesday warning that Chinese hackers were targeting “major global telecommunications providers.” | Kiichiro Sato/AP\n\nThe federal government began investigating a major Chinese breach of global telecommunications systems in the spring, officials said Tuesday, and warned that the intrusion is “ongoing” and likely larger in scale than previously understood.\n\nThe hack wasfirst announced publiclyin October and has been attributed by U.S. agencies to a Chinese government-linked hacking group known as Salt Typhoon. The effort targeted dozens of telecom companies in the U.S. and globally to gain access toU.S. political leadersandnational security data.\n\nThe timeline of the hacking effort, as well as the scope of the intrusion, was not previously disclosed.\n\nJeff Greene, executive assistant director of cybersecurity at the Cybersecurity and Infrastructure Security Agency, and a senior FBI official said Tuesday that while agencies started cooperating on their investigations of Salt Typhoon’s activities in early October, the effort was first detected in “late spring and early summer.” He also warned that the breach is “ongoing” and that there was much law enforcement still did not know.\n\n“We cannot say with certainty that the adversary has been evicted,” Greene said. “We’re on top of tracking them down … but we cannot with confidence say that we know everything, nor would our partners.”\n\nGreene strongly urged Americans to “use your encrypted communications where you have it,” adding that “we definitely need to do that, kind of look at what it means long-term, how we secure our networks.” As many as80 telecommunications companiesand internet service providers, including AT&T, Verizon and T-Mobile, are believed to have been infiltrated in the hack.\n\nEarlier on Tuesday, CISA, the FBI, the National Security Agency, and partner agencies in New Zealand, Australia and Canadareleased a joint alertwarning that Chinese hackers were targeting “major global telecommunications providers.” Officials declined to comment on specifics, but acknowledged that “there were servers used in various countries to facilitate this activity by the Chinese.”\n\nThe United Kingdom did not sign on to the alert, making it the only nation in the Five Eyes intelligence-sharing group to be omitted. Greene attributed this to each country having “different considerations and timelines.” A spokesperson for the U.K.’s National Cyber Security Centre said Tuesday that the agency “support[s] our international partners issuing this advisory to help improve the collective resilience of telecommunications infrastructure,” and that the U.K. has a separate approach to mitigating cyber risks to its telecom providers.\n\nThe officials from the FBI and CISA noted in their briefing that there were three groups of victims in the hack. The first group was an undisclosed number of victims, mostly in the “Capital Region,” according to the officials, who were impacted by stolen call records from telecom companies. The second group — a small number of political or government-linked individuals, all of whom have been notified by officials — had their private communications compromised, according to a senior FBI official who spoke anonymously as a condition of briefing reporters.\n\nWhile the officials did specify how many individuals were targeted,POLITICO previously reportedthat the phones of President-elect Donald Trump and Vice President-elect JD Vance were among those compromised, in both cases prior to the election.\n\nIn addition, the Chinese hackers also accessed and copied U.S. court orders, which the FBI official said were attained through the Communications Assistance for Law Enforcement statute program. This program allows law enforcement and intelligence agencies to submit court orders around intelligence collection from telecom providers.\n\nWhen pressed on whether hackers were able to access court orders for intelligence collected under the Foreign Intelligence Surveillance Act — which allows U.S. intelligence agencies to collect data on foreign targets — the FBI official declined to answer directly but acknowledged that “the CALEA environment does include court orders” for FISA investigations.\n\nThe major hacking campaign has been an issue of increasing concern for U.S. lawmakers in recent weeks, with Senate Intelligence Committee ChairMark Warner(D-Va.) describing it as the “most serious breach in our history.”\n\n“Unless you are using a specialized app, any one of us and every one of us today is subject to the review by the Chinese Communist government of any cell phone conversation you have with anyone in America,” Sen.Mike Rounds(R-S.D.), ranking member of the Senate Armed Services Committee’s cyber subcommittee,said during a panelat last month’s Halifax International Security Forum.",
        "source_2": "Republished on December 6 as new cybersecurity regulations are proposed, and with further warnings following the FBI’s encrypted communications push.\n\nTiming is everything. Just asApple’s adoption of RCShad seemed to signal a return to text messaging versus the unstoppable growth of WhatsApp, then along comes a surprising new hurdle to stop that in its tracks. While messaging Android to Android or iPhone to iPhone is secure, messaging from one to the other is not.\n\nNow even the FBI and CISA, the U. S. cyber defense agency, are warning Americans to use responsibly encrypted messaging and phone calls where they can. The backdrop is the Chinese hacking of U. S. networks that is reportedly “ongoing and likely larger in scale than previously understood.” Fully encrypted comms is the best defense against this compromise, and Americans are urged to use that wherever possible.\n\nThe network cyberattacks,attributed to Salt Typhoon, a group associated with China’s Ministry of Public Security, has generated heightened concern as to the vulnerabilities within critical U.S. communication networks. The reality is different. Without fully end-to-end encrypted messaging and calls, there hasalwaysbeen a potential for content to be intercepted. That’s the entire reason Apple, Google and Meta advise its use, highlighting the fact that even they can’t see content.\n\nAccording to a senior FBI official, “within the investigative activity, especially one this significant and this large, the facts will evolve over time… The continued investigation into the PRC targeting commercial telecom infrastructure has revealed a broad and significant cyber espionage campaign.” This campaign, he warned, “identified that PRC affiliated cyber actors have compromised networks of multiple telecom companies to enable multiple activities,” confirming that “the FBI began investigating this activity in late spring and early summer of this year.”\n\nThe FBI official warned that citizens should be “using a cell phone that automatically receives timely operating system updates, responsibly managed encryption and phishing resistant MFA for email, social media and collaboration tool accounts.”\n\nAs reported byPolitico, CISA’s Jeff Greene added to this, “strongly urging Americans to ‘use your encrypted communications where you have it… we definitely need to do that, kind of look at what it means long-term, how we secure our networks’.”\n\nIf any good has come from this viral storm, it’s the light now shining on the lack of security across SMS and basic RCS messaging. That millions of users are now better informed as to the risks such that they can make informed decisions is welcome.\n\nESET’s Jake Moore says “it is well documented that SMS messages are not encrypted and any non encrypted forms of communication can be surveilled by law enforcement or anyone with the right tools, knowledge and software due to the concept of SS7.”\n\nIn terms of what is known about the Salt Typhoon attacks thus far, while the FBI official warned that widespread call and text metadata was stolen in the attack, expansive call and text content was not. But “the actors compromised private communications of a limited number of individuals who are primarily involved in the government or political activities. This would have contained call and text contents.”\n\nThe scale of the hacking campaign and the implications for U.S. critical infrastructure and the security of its networks has created an unsurprising political storm. As reported byReuters,“U.S. government agencies held a classified briefing for all senators on Wednesday on China's alleged efforts known as Salt Typhoon to burrow deep into American telecommunications companies and steal data about U.S. calls.” Following the briefing, “U.S. senators vow[ed] action.”\n\nReutersalso reported that “a Senate Commerce subcommittee will hold a Dec. 11 hearing on Salt Typhoon and how ‘‘security threats pose risks to our communications networks, and review best practices. There is growing concern about the size and scope of the reported Chinese hacking into U.S. telecommunications networks and questions about when companies and the government can assure Americans over the matter.”\n\nDuring Tuesday’s original media briefing, CISA’s Greene reportedly suggested “that Americans should use encrypted apps for all their communications,” (1,2). That means stop sending texts iPhone to Android, albeit iMessages and Google Messages are fully encrypted while on those platforms.\n\nGreene added that “our suggestion, what we have told folks internally, is not new here: encryption is your friend, whether it's on text messaging or if you have the capacity to use encrypted voice communication. Even if the adversary is able to intercept the data, if it is encrypted, it will make it impossible.”\n\nAnalertinto the ongoing telco network hacks jointly issued by FBI, CISA and NSA—as well as other Five Eyes agencies—was released on Tuesday.\n\nThe lack of end-to-end encryption to protect cross-platform RCS, the successor to SMS, is a glaring omission. It was highlighted in Samsung’s recent celebratory PR release on the success of RCS,which included the caveat that only Android to Android messaging is secured. It remains a stark irony that while Google and Apple separately advise Android and iPhone users to rely on end-to-end encryption, when it comes to RCS it’s still missing, with no timeline in sight for a fix.\n\nThe mobile standard setter, GSMA, and Google have saidencryption will be coming to RCS, but there’s no firm date yet. That assurance seemed a response to the backlash post Apple’s update with the media pickup on the security issue. Apple, whose iPhone ecosystem includes ever more fully encryption, has not commented.\n\nThere is an ironic twist to these warnings. AsPC Magcommented, “this push to use end-to-end encryption is ironic since the FBI has long complained that the same technology can stymie their investigations into seized smartphones and online accounts belonging to criminal suspects.”\n\nAccording to additionalReutersreporting, “U.S. Federal Communications Commission Chairwoman Jessica Rosenworcel is proposing that communications service providers be required to submit an annual certification attesting that they have a plan in place to protect against cyberattacks, the agency said in a statement on Thursday. The proposal is in part in response to efforts by an allegedly Beijing-sponsored group of hackers, dubbed ‘Salt Typhoon,’ to burrow deep into American telecommunications companies to steal data about U.S. calls.”\n\nMeanwhile, CISA has assured that an independent review of the Chinese hacking campaign will begin in short order. PerThe Record, a review board “will launch its investigation of an unprecedented Chinese hack of global telecommunications systems later this week, the head of the Cybersecurity and Infrastructure Security Agency said on Wednesday. Speaking to reporters after a classified briefing for all senators on Wednesday about the breach by the state-sponsored group known as Salt Typhoon, CISA Director Jen Easterly said the first meeting of the Cyber Safety Review Board (CSRB) focused on the ongoing breach will take place on Friday.”\n\nEasterly told the media “we wanted to make sure that we had a good understanding of what was happening, in terms of the scope and scale, and, quite frankly, most of the agencies who would be involved in the Cyber Safety Review Board are still involved in the incident response… We wanted to make sure we did it before the holidays, so we could start writing out how we think about the problem, and then ultimately, what are the key recommendations that we need to bring forward to enable us to strengthen the security of the telco networks going forward.”\n\nAhead of any recommendations being made, the FBI’s precise wording is critical, with its emphasis onresponsibleencryption that has been mostly overlooked in reports. Responsible in this context means providing access to user data through lawful requests, including—potentially—content. While this may come across as a subtlety, it is anything but. This rules out many of the largest, best known messaging platforms—such as WhatsApp and Signal, as they cannot provide access to any content absent an endpoint (device) compromise, accessing the data at one end of the end-to-end encryption.\n\nOne can expect recommendations to linger on the right balance between full encryption to protect contents from network vulnerabilities and lawful access. That risks revisiting the debate between big tech and lawmakers around how to breach the encryption enclave without fatally weakening it. It will be heavily resisted, albeit there is a lack of clarity as to which way the new Trump administration will swing on this.\n\nWith ironic timing, Europe’s so-called chat control is back on the table this week. This seeks to solve the unsolvable problem of pushing big tech to monitor content on their platforms for child sexual abuse material (CSAM) in the first instance, albeit once that is enabled, the fears are that other content can be screened as well.\n\nPrivacy experts have railed heavily against this political campaign and European lawmakers and regulators are divided on the issue. Should Europe manage to fuel a collation with enough power to drive this into some form of policy setting, and the US jump onboard post Salt Typhoon with an “end-to-end encrypted, kind of” approach, we will be set for an almighty battle through 2025 and beyond.\n\nNotwithstanding that, my advice remains to use the fully encrypted WhatsApp over RCS for any cross-platform messaging, at least until such a time as RCS adds its own full encryption between iPhones and Androids. Once you step outside Apple’s or Google’s walled gardens, this security protections falls away. With many good secured platforms now readily available, it’s not worth taking the risk. The need for full security has never been greater given the ongoing cyber threat landscape.\n\nESET’s Moore cautions that “it is important to treat any non privacy focused messaging platform with care and they should not be used for private communication or to transfer sensitive data. Encrypted channels offer privacy and security but although Meta-owned WhatsApp may not be everyone’s choice, at least it offers end-to-end encryption as standard. There are lots of other options such as Signal and iMessage but it’s about choices and understanding what level of security is right for individuals.”\n\nThere are other fully encrypted platforms as well—notably Signal, the best of the bunch, albeit with a much smaller install base. Even Facebook Messenger now fully encrypts messaging, making standard SMS/RCS texting even more an outlier. Signal and WhatsApp also enable fully encrypted voice and video calls cross platform, and so they should also be your default choices given this FBI/CISA warning.\n\nMoore, a former police forensics expert, describes end-to-end encryption as “more than a fundamental right—it is a vital necessity for all communication tools and any messaging service that is not secured with this layer of protection must be treated with caution.” Perhaps now such messaging will be seen differently by its users.\n\nIronically, Apple’s iOS 18.2, due this month, will enable iPhone users to change the default messenger on their devices from iMessage. Timing really is everything.",
        "source_3": "ByNIKKI MAIN, US SCIENCE AND TECHNOLOGY REPORTERand AP\n\nPublished:19:40 BST, 4 December 2024|Updated:07:08 BST, 5 December 2024\n\nTheFBIhas issued a warning to Americans about sending regular text messages between Androids and iPhones.\n\nThe agency revealed that exchanges between the two brands leave messages vulnerable to hackers.\n\nInstead, users are advised to use secure, encrypted messaging and phone calls on apps like WhatsApp to prevent third parties fromaccessing conversations.\n\nThe warning comes as Chinese hackers have reportedly hacked several US networks that are 'ongoing and likely larger in scale than previously understood.'\n\nDubbed Salt Typhoon, the cyberespionage campaign surfaced this year when hackers attacked networks of several telecommunications companies.\n\nThe hackers used their accessto target the metadata of a large number of customers, including information on the dates, times and recipients of calls and texts.\n\nThey also succeeded in retrieving the actual audio files of calls and content from texts from a much smaller number of victims.\n\nDespite months of investigation, the true scale ofChina's operation, including the total number of victims or whether the hackers still have some access to information, is currently unknown.\n\nFBI warns iPhone and Android users to use end-to-end encryption to text each other amid hackers accessing their content\n\nJeff Greene, CISA's executive assistant director for cybersecurity, issued the stark warning Tuesday, urging Americans to be vigilant amid the hacking campaign.\n\nHe toldPoliticothat people should'use your encrypted communications where you have it,' adding that 'we definitely need to do that, kind of look at what it means long-term, how we secure our networks.'\n\nEncrypted apps protect user's data by transforming their phone calls and text messages into an unreadable format to prevent dangerous parties from gaining unauthorized access.\n\n'Our suggestion, what we have told folks internally, is not new here: encryption is your friend, whether it's on text messaging or if you have the capacity to use encrypted voice communication,' Greene toldNBC News.\n\n'Even if the adversary is able to intercept the data, if it is encrypted, it will make it impossible.'\n\nSeveral recent high-profile hacking incidents have been linked to China and what officials say is Beijing's effort to steal technical and government secrets while also gaining access to critical infrastructure such as the electrical grid.\n\nIn September, the FBI announced that it had disrupted a vast Chinese hacking operation that involved the installation of malicious software on more than 200,000 consumer devices, including cameras, video recorders and home and office routers.\n\nJeff Greene, CISA's executive assistant director for cybersecurity, issued the stark warning Tuesday, urging Americans to be vigilant amid the hacking campaing\n\nThe devices were then used to create a massive network of infected computers, or botnet, that could then be used to carry out other cyber crimes.\n\nIn October, officials said hackers linked to China targeted the phones of then-presidential candidate Donald Trump and his running mate, Sen. JD Vance, along with people associated with Democratic candidate Vice President Kamala Harris.\n\nChina has rejected accusations from US officials that it engages in cyberespionage directed against Americans.\n\nOn Tuesday, a spokesperson for China's embassy in Washington called the U.S. allegations 'disinformation.'\n\nChina's government 'firmly opposes and combats all kinds of cyber attacks,' spokesperson Liu Pengyu wrote in a statement emailed to The Associated Press. 'The US needs to stop its own cyberattacks against other countries and refrain from using cyber security to smear and slander China.'\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nBy posting your comment you agree to ourhouse rules.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with ourPrivacy Policy.\n\nBrooklyn Beckham and Nicola Peltz reveal their secret vow renewal ceremony officiated by her father Nelson... with David and Victoria still thousands of miles away on yacht"
    }
}