{
    "question": "In what ways could the targeted killing of UnitedHealthcare’s CEO—and the cryptic words reportedly left on the shell casings—shape public interpretations of motive and influence debates about the insurance industry while the investigation remains ongoing?",
    "content": {
        "source_1": "The CEO of UnitedHealthcare was fatally shot in what police said appears to be a \"premeditated, preplanned targeted attack\" outside the New York Hilton hotel in midtown Manhattan on Wednesday morning.\n\nBrian Thompson, 50, was on his way to speak at UnitedHealth Group's investor conference when the gunman approached from behind and \"fired several rounds,\" Police Commissioner Jessica Tisch said at a news conference.\n\nHe was struck at least once in the back and at least once in the right calf, Tisch said, adding that the gunman was \"lying in wait for several minutes.\"\n\n\"Many people passed the suspect, but he appeared to wait for his intended target,\" she said.\n\nSecurity video shows Thompson, dressed in a blue suit, walking down the fairly quiet street. The gunman approaches him from behind and opens fire, it shows.\n\nThompson stumbles forward as a witness runs to safety. The gunman continues to fire as Thompson falls to the ground, the video shows.\n\nChief of Detectives Joseph Kenny said the shooter arrived at the scene about five minutes before the shooting and fired at Thompson’s back.\n\n\"The shooter then walks toward the victim and continues to shoot. It appears that the gun malfunctions as he clears the jam and begins to fire again,\" he said.\n\nThree live 9 mm rounds and three discharged 9 mm shell casings were found at the scene, as well as a cellphone near the scene.\n\nKenny reiterated that the shooting appears to have been a targeted attack.\n\n\"The motive for this murder is currently unknown, but based on the evidence we have so far, it does appear the victim was specifically targeted,\" he told reporters. \"But at this point, we do not know why.\"\n\nThompson, who lives in Minnesota, was pronounced dead at Mount Sinai West.\n\nHis wife, Paulette Thompson, said he had been receiving threats.\n\n\"There had been some threats,\" she told NBC News. \"Basically, I don’t know, a lack of coverage? I don’t know details. I just know that he said there were some people that had been threatening him.\"\n\nShe said police had told her it appeared the shooting was \"a planned attack.\"\n\nThe shooter fled on foot and then on a rental bike, Tisch said. He was last seen in Central Park.As of Wednesday morning, no arrests had been made, police said. Crime Stoppers is offering a $10,000 reward for information.\n\nPolice said the gunman was wearing a black hoodie and black pants and carrying a gray backpack. It is believed he used a firearm with a silencer, a person familiar with the mattertold CNBC.\n\nA food cart vendor near the scene told NBC News that he did not hear any gunshots but saw police vehicles and two helicopters in the area.\n\nUnitedHealth Group, the parent company, was holding its annual investor conference Wednesday morning in New York City but abruptly ended it because of a \"very serious medical situation\" with a team member.\n\nThe company said in a statement that it was \"deeply saddened and shocked.\"\n\n\"Brian was a highly respected colleague and friend to all who worked with him,\" it said. \"Our hearts go out to Brian’s family and all who were close to him.\"\n\nThompson was named CEO of UnitedHealthcare in April 2021, according to his biography page. He joined UnitedHealth Group in 2004.\n\nHe previously was CEO of UnitedHealthcare government programs, including Medicare & Retirement and Community & State. He was also the CEO of UnitedHealthcare Medicare & Retirement.\n\nMinyvonne Burke is a senior breaking news reporter for NBC News.",
        "source_2": "Reporting by Luc Cohen, Amina Niasse in New York, Brendan O'Brien in Chicago; additional reporting by Doyinsola Oladipo, Patrick Wingrove and Michael Erman in New York, Rich McKay in Atlanta, Brad Brooks in Colorado, and Sriparna Roy in Bengaluru; Editing by David Gaffen, Nick Zieminski, Daniel Wallis and Cynthia Osterman\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nKyoko Gasha is a producer for Reuters Video News in New York. In her career at Reuters, she produced daily shows on US stock markets and anchored a weekend show called ‘Reuters Business Weekly’ to talk about weekly news events in the United States for the Japanese audience. She is also an independent documentary filmmaker and a Japanese traditional tea ceremony instructor. A native of Japan, Gasha began her career in Tokyo as a broadcast journalist at TV Tokyo in 1987. In 1991, she was awarded a Fulbright scholarship and attended the mid-career program called Michigan Journalism Fellows at the University of Michigan.  In 2001, Gasha was hired by Reuters as a reporter and moved to New York. In her 36-year career, she has covered a wide range of topics from interviewing Margaret Thatcher to covering 9-11 in New York and The Great Eastern Earthquake in Japan in 2011. She also covered the 1996-1997 hostage crisis in Peru and the 1995 earthquake in Kobe, Japan.  Her documentary films, “Mothers’ Way, Daughters’ Choice” and “311: In The Moment” have received many awards from film festivals worldwide.\n\nReports on the New York federal courts. Previously worked as a correspondent in Venezuela and Argentina.",
        "source_3": "The CEO of insurance giant UnitedHealthcare was gunned down Wednesday outside a luxury Midtown hotel in a “brazen, targeted attack” by a chillingly methodical killer who used a firearm with a silencer, police said.\n\nBrian Thompson, 50, was repeatedly shot by a masked gunman who had been waiting outside the Hilton hotel along Sixth Avenue, where the CEO was hosting an investors’ conference, said NYPD Commissioner Jessica Tisch.\n\n“Many people passed the suspect, but he appeared to wait for his intended target,” she said.\n\nThe cold-blooded gunman — who remained on the loose late Wednesday — could be seen indisturbing surveillance videoobtained by The Post calmly firing multiple gunshots into Thompson at about 6:46 a.m.\n\nThompson stumbled after the first bullet struck, and briefly turned to face the gunman, who coolly pulled back the weapon’s slide with each shot, the video shows.\n\nHe helplessly tried to crawl away as the shooter unleashed a barrage of bullets.\n\nLaw enforcement sources said it appeared the shooter not only used a silencer, but was proficient enough with the gun to smoothly clear it after a jam to continue firing.\n\nThe smoothly efficient execution of Thompson unfolded in full view of shocked witnesses in the heart of Manhattan, one of the most heavily trafficked places on the planet — just hours before and blocks away from thousands of sightseers who lined up to watch the Rockefeller Christmas tree lighting.\n\nBut the killer’s apparently measured actions — including an escape on an e-bike into Central Park, where surveillance camera coverage is spotty — could be undercut by him apparently dropping a key clue: a cellphone.\n\nInvestigators firmly believe a phone found in an alleyway near the Hilton belongs to the gunman, and obtained a search warrant to comb throuh its contents, sources told The Post.\n\nA manhunt was underway for the suspect as the NYPD and CrimeStoppers offered a $10,000 reward for information.\n\nThe motive behind the heinous hit remained unknown, said NYPD Chief of Detectives Joe Kenny. A personal or professional grudge had not been ruled out as of late Wednesday and law enforcement sources said Thompson had received threats.\n\n“But based on the evidence we have so far, it does appear that the victim was specifically targeted,” Kenny said. “But at this point, we do not know why. This does not appear to be a random act of violence.”\n\nThompson was well respected in his field, raking in a salary ofnearly $9.9 million a yearto head the nation’s largest private health insurer, according to the Economic Research Institute.\n\nBut his company also had a controversial history of rejecting claims and faced a Department of Justice antitrust investigation.\n\nThe shooting took place a little more than an hour before UnitedHealth’s investors’ conference was scheduled to begin at the Hilton, police said.\n\nThe gunman walked up to the hotel about five minutes before the shooting, Kenny said.\n\nWitnesses told The Post the suspect had been spotted near the hotel, on Sixth Avenue, milling around. And NYPD officials later released a photo showing the alleged gunman inside a nearby Starbucks.\n\nThe masked suspect nonchalantly bought a bottle of water and two PowerBars inside the Starbucks minutes before the shooting, law enforcement sources said.\n\nWhen Thompson — who had been staying at the nearby Marriott, according to sources — walked up to the hotel, the masked suspect struck, Kenny said.\n\nFollow along with The Post’s live updates on the news surrounding Brian Thompson’s murder.\n\n“The shooter steps onto the sidewalk from behind the car, he ignores numerous other pedestrians, approaches the victim from behind, and shoots him in the back,” Kenny said. “The shooter then walks toward the victim and continues to shoot.”\n\nThe shooter’s weapon appeared to have malfunctioned at that point, but he managed to clear it to continue firing — a sign the suspect is proficient with firearms, Kenny said.\n\nA gunshot startled one witness nearby, who told PIX11 that he saw the armed assassin.\n\n“I hear a shot,” the witness said, according to PIX11. “When I look around, I saw a guy with a gun. He shot three times, then he starts running.”\n\nThompson was struck by bullets at least once each in his back and right calf, Tisch said.\n\nFirst responders arrived and engaged in a desperate attempt to save Thompson with CPR,harrowing video shows.\n\nHe was rushed in critical condition to Mount Sinai West hospital, where he was pronounced dead at 7:12 a.m., police said.\n\nThe suspect was described as a white male wearing a dark jacket, black face mask, and black and white sneakers. Officials said he was carrying a distinctive gray backpack.\n\nKenny said the shooter first ran off through the Ziegfeld alleyway between 54th and 55th streets, then hopped onto an e-bike — a ride captured in another surveillance photo.\n\nThe gunman pedaled up the Avenue of the Americas toward Central Park, and was last seen around 6:48 a.m. biking onto Center Drive, Kenny said.\n\nCops recovered three live 9-millimeter rounds and three discharged shell casings at the scene, the chief said.\n\nThey also collected the cellphone and a water bottle believed to be the one purchased by the suspect in Starbucks, law enforcement sources said.\n\nInvestigators hope they can pull fingerprints from the unspent ammunition, as well as DNA from the water bottle and phone, sources said.\n\nA sweep of surveillance video footage is underway, with police combing feeds near Central Park to trace the gunman’s escape, police said. They’re also pulling video from outside Thompson’s hotel and the Marriott to see if the shooter cased them before the attack, sources said.\n\nBy Wednesday afternoon, the search yielded surveillance video that appears to have captured the gunman leaving the area near the Frederick Douglass Houses on the Upper West Side around 5 a.m., more than an hour before the shooting, sources said.\n\nAnother video showed the shooter leave the park’s west side, sources said.\n\nThe New York Timesobtained surveillance footageshowing a man wearing clothing and a backpack matching the shooter’s distinctive garb walking near the shooting scene around 6:30 a.m. The man in the footage appears to be making a phone call.\n\nKenny said detectives are working with Citi Bike, which puts GPS trackers on its bikes, to find the shooter’s ride.\n\n“We’re looking at his social media,” he said. “We are interviewing employees, we are interviewing family members. We will be speaking to law enforcement in Minnesota.”\n\nThompson leaves behind his wife, Paulette “Pauley” Thompson, 51, and two children in Minnesota.\n\nThefamily had received threats, Paulette Thompsontold NBC News.\n\n“There had been some threats,” she said, according to NBC. “Basically, I don’t know, a lack of coverage? I don’t know details. I just know that he said there were some people that had been threatening him.”\n\nA source confirmed to The Post that United Healthcare informed investigators that Thompson had been the recipient of threats. While this is not uncommon for the CEO of a health care company, investigators are looking at every one of those leads and running them to ground, the source said.\n\nIn a statement to a Minnesota FOX outlet, Paulette Thompson said the senseless killing left the family “shattered.”\n\n“Brian was an incredibly loving, generous, talented man who truly lived life to the fullest and touched so many lives,” the statement reads. “Most importantly, Brian was an incredibly loving father to our two sons and will be greatly missed.”\n\nPolice in Maple Grove, Minnesota, where the Thompsons live, told The Post that they responded to a single report from their home — a “suspicious activity” incident in 2018 that they cleared “with no criminal activity detected.”\n\nThe shooting sent shockwaves through the investors’ conference,where Fortune reportedemotional attendees began to cry.\n\nThe slain CEO was “a stand-up guy, a good dude,” said one investor who had previously dined with Thompson, according to Forbes. “I’ve never met anyone who had anything bad to say about him.”\n\nThompson, who had worked with UnitedHealth for the last 20 years, took the role of CEO in 2021 and was based at its offices in Minnetonka, Minnesota, according to his LinkedIn account.\n\nWhen promoting Thompson, the CEO of UnitedHealth Group, Andrew Witty, praised his commitment to the company, which serves as the largest private health insurer in the US.\n\n“Brian’s experience, relationships, and values make him especially well-suited to help UnitedHealthcare improve how health care works for consumers, physicians, employers, governments, and our other partners, leading to continued and sustained long-term growth,” Witty said at the time.\n\nThe exec lived in a five-bedroom home that he purchased in the North Star State in 2018 for $1 million, according to Zillow.\n\nThompson previously served as the company’s head of government programs, including Medicare and retirement.\n\nThe UnitedHealth Group, which employs more than 100,000 people across America, is ranked fourth in the Fortune 500.\n\n“We are deeply saddened and shocked at the passing of our dear friend and colleague Brian Thompson, the CEO of UnitedHealthcare,” a company statement reads. “Brian was a highly respected colleague and friend to all who worked with him. We are working closely with the New York Police Department and ask for your patience and understanding during this difficult time.”\n\nThompson and the company aren’t without their controversies, or disgruntled customers.\n\nHe had been the subject of a Department of Justice antitrust probe, the Wall Street Journalfirst reportedin February.\n\nProminent pension funds in California later filed a federal lawsuit against Thompson and other UnitedHealthcare executives, accusing them of offloading $117 million in company stock before the DOJ probe became public.\n\nThompson had reaped $15.1 million by dumping the stock, the lawsuit contends.\n\nAnd UnitedHealthcare has developed a reputation for rejecting claims, a practice at least in part because it used an AI model with a 90% error rate to deny health coverage, Ars Technicafirst reported.\n\nMayor Eric Adams sought to reassure New Yorkers that the shooting wasn’t a random act of violence in one of the most visible and highly trafficked places in the country — mere blocks and hours away from the Rockefeller Christmas tree lighting.\n\n“It seemed to have been clearly targeted by an individual, and we will apprehend that individual.”\n\nNYPD Chief of Department Jeffrey Maddrey said the shooting would not affect the Rockefeller Christmas tree lighting later that evening.\n\nGov. Kathy Hochul said in a statement that state police will provide the NYPD with whatever it needs.\n\nMinnesota Gov. Tim Walz offered prayers for Thompson’s family.\n\n“This is horrifying news and a terrible loss for the business and health care community in Minnesota,” he said in a statement.\n\nAdditional reporting by Haley Brown and Larry Celona"
    }
}