{
    "question": "How might the Supreme Court’s decision in the challenge to Tennessee’s 2023 ban on gender transition procedures for minors influence future state laws and access to care across the country?",
    "content": {
        "source_1": "The Court appears likely to uphold bans on gender-affirming care, and may gut the rules barring all forms of sex discrimination in the process.\n\nSupport independent journalism that matters —become a Vox Member today.\n\nThe Supreme Court heard oral arguments Wednesday inUnited States v. Skrmetti, arguably themost important transgender rights case the Court has ever heard. The case asks whether discrimination against transgender people can violate the Constitution — and it appears most of the justices feel it does not. The likely result is that the Court will allow states to ban health procedures that enable gender-affirming care, both for minors and, potentially, adults.\n\nThe argument went terribly for transgender Americans, as many of the justices suggested creating a carveout from the ordinary constitutional rule restricting sex-based discrimination of all kinds. Chief Justice John Roberts, for example, suggested giving the government broad authority to engage in such discrimination in the medical context — a ruling that could also have severe implications for women generally, including cisgender women.\n\nGet the latest developments on the US Supreme Court from senior correspondent Ian Millhiser.\n\nAs Justice Ketanji Brown Jackson said at one point in the argument, “I’m getting kind of nervous” that the Court is going to chip away at one of the “bedrock” principles in US anti-discrimination laws.\n\nSkrmettiinvolves a 2023 Tennessee law that prohibits trans youth from receiving medical treatments, such as puberty blockers and hormone therapy, if those treatments are prescribed to help them transition. Notably, the law is quite explicit that its purpose is to “encourag[e] minors to appreciate their sex” and to prevent young people from becoming “disdainful of their sex.”\n\nAlthough this particular law involves a ban on gender-affirming care for minors, Tennessee’s arguments in favor of the law could also permit the government to prohibit adults from receiving the same treatments.\n\nAt least four justices — Roberts and Justices Clarence Thomas, Samuel Alito, and Brett Kavanaugh — appeared all but certain to vote to uphold Tennessee’s law. Justice Amy Coney Barrett, meanwhile, was a bit less direct in her questioning, but she largely seemed sympathetic to Tennessee’s position. Most notably, Barrett signaled midway through the argument that she was open to Roberts’s call for a medical carveout from the Constitution’s restrictions on sex discrimination.\n\nJustice Neil Gorsuch, a Republican who authored alandmark opinion protecting trans rights in 2020, was silent throughout the argument. That left only the Court’s three Democrats to defend the orthodox approach to laws that discriminate on the basis of sex, which casts a skeptical eye on any law that treats people differently because of their sex assigned at birth.\n\nThe biggest question inSkrmetti, in other words, is likely to behowthe Court finds a way to uphold Tennessee’s law, rather thanwhetherthe Court does so. And it seems fairly likely that the Court’s opinion could fundamentally alter the rules governing sex discrimination by the government.\n\nThe most important thing to understand about Tennessee’s law is that it explicitly draws lines based on a patient’s sex assigned at birth. If a child who is assigned male at birth is prescribed testosterone by their doctor, Tennessee permits that child to receive that treatment. But a child who is assigned female at birth may not.\n\nIndeed, while Matthew Rice, the Tennessee solicitor general defending his state’s law, tried many times to deny that this law classifies based on sex, he eventually admitted that it did after being pressed by Justices Sonia Sotomayor and Jackson.\n\nJackson, for example, asked Rice whether this law would permit a boy who seeks testosterone because he wants to deepen his voice and otherwise enhance his masculinity to receive that treatment, and Rice eventually conceded that, under the specific law at issue in this case, the boy could. Rice then eventually admitted that, if a girl sought the same treatment for the same purpose — to deepen her voice and to make her body appear more masculine — Tennessee’s law would prohibit her from receiving the treatment.\n\nThis matters because, inUnited States v. Virginia(1996), the Supreme Court held that “all gender-based classifications” are subject to “heightened scrutiny,” meaning that the law is treated as presumptively unconstitutional and the state has to prove that its law was not enacted for impermissibly sexist reasons. Some laws survive this heightened scrutiny, if those laws are grounded in real differences between the sexes and not in prejudice or stereotypes. But, underVirginia, any law that draws lines based on sex in any way whatsoever receives this higher level of review from the federal courts.\n\nSignificantly, neither the Biden administration, which argued against Tennessee’s law in the Supreme Court, nor the ACLU, which represents families that want their transgender children to have access to care, asked the Supreme Court to definitively strike down Tennessee’s law right now. Rather, the sole issue before the Court is whether to send the case back down to a federal appeals court that previously refused to apply the heightened scrutiny required byVirginia.\n\nBut many of the justices appeared determined not to applyVirginiato this case. Roberts, for example, warned that there are “medical nuances” in this case that weren’t present inVirginiaor some of the Court’s other previous gender discrimination cases. And he suggested that the courts should take a more deferential approach to state lawmakers in cases involving medicine because judges are not good at making medical judgments.\n\nKavanaugh echoed Roberts’s thinking, suggesting at one point that the Constitution does not take sides on a “medical and policy debate.”\n\nBarrett also appeared sympathetic to Roberts’s approach, asking Chase Strangio, the ACLU lawyer, whether the courts have ever applied heightened scrutiny in a case involving medical judgments.\n\nStrangio had an excellent answer to this question: During the pandemic, several churches and other religious institutions claimed that they had a constitutional right to defy state rules prohibiting too many people from gathering in one place in order to prevent the spread of Covid. The Courteventually split 5-4 in these cases, with five of the Republican justices concluding that the right to freely practice religion overcomes a state’s medical determination that large public gatherings are too dangerous.\n\nBarrett, however, did not appear persuaded, claiming that the Covid cases, in which she ruled with the majority, did not involve “diving deep into the medical evidence.” (Roberts dissented in the Covid cases, so his position in the Covid cases is consistent with the position he seemed to lay out inSkrmetti.)\n\nThomas and Alito’s questions, meanwhile, were consistently hostile to the two lawyers arguing in favor of trans rights. When you add their votes to Roberts, Kavanaugh, and Barrett, that’s a majority likely in favor of Tennessee’s law.\n\nIf the Court adopts Roberts’s approach, which seems likely, that’s not just a devastating blow to transgender youth and their families. It’s also a sea change in the Court’s approach to sex discrimination of all kinds. Again,Virginiaheld that “all” laws that draw lines based on sex must survive heightened scrutiny, even though some laws ultimately clear this hurdle. “All” means all. But now many of the justices seem eager to hold that only some laws that classify people based on sex are presumptively unconstitutional.\n\nIt’s hard to divorce this case from its political context. During his recently victorious presidential campaign, President-elect Donald Trump wentall in on anti-trans rhetoric— spending literally hundreds of millions of dollars on ads that, in the Washington Post’s words, “paint trans people as a menace to society.” Republicans control six of the nine seats on the Supreme Court, so it’s not surprising that a majority of the Republican justices seemed to align with their party’s position on trans rights (the Court’s three Democrats, for that matter, also appear aligned with their own party).\n\nBut, in their apparent eagerness to uphold this Tennessee law, the Court’s Republican majority appears likely not just to strike a blow against trans rights. They also appear poised to do considerable damage to the legal standard governing sex discrimination generally. Perhaps Tennessee could, if this case were sent back down to the lower court, offer a justification for its law that survives heightened scrutiny. But most of the justices appear ready to overruleVirginia’s statement that all sex-based classifications must undergo such scrutiny.\n\nThis is why, near the end of Strangio’s time at the podium, Jackson said she is “suddenly quite worried” about the implications of the Court’s questions.\n\nIf the Court can create a medical carveout to the general rule that all sex discrimination is presumptively unconstitutional, what other carveouts might they create in the future? For that matter, will the Court also create similar carveouts for other forms of discrimination, such as race discrimination? Jackson even went so far as to compare Tennessee’s arguments to Virginia’s unsuccessful defense of its ban on interracial marriage inLoving v. Virginia(1967).\n\nAll of that said, the Court most likely will not hand down an opinion inSkrmettiuntil June 2025, when the Court normally decides the biggest cases of its term. There may be time for voices like Jackson’s to convince some of her colleagues to compromise. But based on Wednesday’s argument,Skrmettiappears likely to not just be a historic blow to transgender Americans, but potentially a similar blow against all people who might experience unconstitutional discrimination.\n\nUnderstand the world with a daily explainer, plus the most compelling stories of the day.",
        "source_2": "During almost two-and-a-half hours of debate on Wednesday, nearly all of the court’s conservative majority expressed skepticism about a challenge to Tennessee’s ban on puberty blockers and hormone therapy for transgender teenagers. Three transgender teens, their families, and a Memphis physician, along with the Biden administration, contend that the law violates the Constitution’s guarantee of equal protection and should be examined with the higher degree of legal scrutiny required in such cases. But Tennessee counters that it is simply exercising its power to regulate the practice of medicine for all youth and is not distinguishing based on a patient’s sex.\n\nSeveral of the court’s conservative justices voiced concerns about whether courts, rather than legislatures, are best suited to make determinations about what they saw as the complicated medical issues underlying the dispute. This idea has become a familiar theme at the court in recent years, including in the landmark 2022 decision overturning the constitutional right to abortion. Justice Brett Kavanaugh in particular on Wednesday wondered aloud whether decisions about issues like gender-affirming care for transgender teens might be best left to the democratic process.\n\nThe court’s decision could have ripple effects beyond Tennessee or even the other 23 states that have similar laws, affecting other protections for transgender people.\n\nU.S. Solicitor General Elizabeth Prelogar urged the justices to focus on the narrow question whether the Tennessee law, known as SB1, draws distinctions based on sex and should therefore be subject to a more stringent review than the one applied by a federal appeals court in Cincinnati, which had upheld the law. But although the court’s three Democratic-appointed justices clearly agreed with her, it was difficult to say whether there were two more votes to join them and send the case back to that court for another look.\n\nRepresenting the Biden administration, Prelogar emphasized that SB1 singles out gender dysphoria as the sole basis to ban access to puberty blockers and hormone therapy, because young people who are not transgender can still have access to those drugs for other medical purposes. Because SB1 prohibits such access only when the drugs are used in a manner that is inconsistent with the sex that a young person was assigned at birth, she explained, it draws lines based on sex. It should therefore be subject to heightened scrutiny, she argued, rather than the more deferential rational-basis review used by the U.S. Court of Appeals for the 6th Circuit in upholding the law.\n\nThe court’s three liberal justices echoed Prelogar’s insistence that SB1 should be subject to heightened scrutiny. Justice Sonia Sotomayor told J. Matthew Rice, Tennessee’s solicitor general, that the law relies on sex to determine who gets medicine. If a child who appears to be gender neutral goes to the doctor seeking medicine to prevent them from growing breasts, Sotomayor said, the doctor has to know whether that child is male or female to know whether SB1 bans the use of drugs.\n\nRice argued that the application of SB1 “turns entirely on medical purpose,” rather than drawing lines based on sex. But Justice Elena Kagan was dubious, telling Rice that the purpose that SB1 bans is treating gender dysphoria. Pointing to medical purpose, she said, is “a dodge” when the medical purpose of SB1 “is utterly and entirely about sex.”\n\nChief Justice John Roberts voiced concern that the case was different from other cases involving heightened scrutiny, which he described as “simple stereotyping” cases – for example, whether men and women should have the same rights on issues like adoption and being able to purchase liquor. This case, he said, involves “quite a distinct type of inquiry” because of the need to review “evolving” medical standards. “We’re not the best situated to address issues like that,” he posited, suggesting that such determinations such instead be left to the legislature.\n\nPrelogar countered that although states have leeway to regulate the practice of medicine, heightened scrutiny should apply when states regulate access to medicine based on a patient’s birth sex. It would “be a pretty remarkable thing,” she said, to say that heightened scrutiny wouldn’t apply in areas of medical regulations.\n\nJustice Samuel Alito observed that medical groups in European countries have more recently been skeptical of the benefits of gender-affirming care for trans teens.\n\nPrelogar pushed back, noting that countries like Sweden, Finland, and Norway had not changed their laws in light of those reports but instead called for more individualized approaches to gender-affirming care. Similarly, she added, there is no outright ban on the use of hormone therapy and puberty blockers in the United Kingdom.\n\nKavanaugh told Prelogar that she had presented “forceful policy arguments,” but that Tennessee and other states with similar laws had also advanced forceful arguments. If the “Constitution doesn’t take sides on how to resolve medical and policy arguments,” he said, why shouldn’t the courts leave these kinds of questions to the democratic process?\n\nPrelogar reiterated that the Biden administration was not asking the Supreme Court “to take options away from the states.” The court could, she assured Kavanaugh, write a “very narrow” opinion holding only that when a state prohibits conduct based on sex, heightened scrutiny applies. The court could then send the case back to the 6th Circuit for another look using that more stringent standard, which would require the state to show that the law is substantially related to an important government interest.\n\nSotomayor was more skeptical about the ceding the issue to the democratic process. Asking Rice about whether a ruling in Tennessee’s favor would also allow states to block gender-affirming care for adults, she observed that transgender people make up just 1% of the population. It’s “very hard to see how the democratic process” will protect them, she contended, just as it didn’t protect women or people of color for a long time.\n\nKavanaugh also wanted to know what a decision indicating that heightened scrutiny applies to SB1 would mean for issues like transgender women in sports and efforts to regulate bathrooms.\n\nPrelogar distinguished the dispute over SB1 from those cases, emphasizing that allowing transgender teens to access medicine “in no way affects the rights of other people.” The Supreme Court, she suggested, could indicate that its ruling does not affect the separate government interest in those cases.\n\nJustice Amy Coney Barrett focused on suggestions that heightened scrutiny is appropriate because SB1 discriminates based on transgender status. She pressed both Prelogar and Chase Strangio, representing the families and who on Wednesday became the first openly transgender lawyer to argue before the court, on whether there is a long history of legal discrimination against transgender people.\n\nPrelogar indicated that even if there was no history of laws discriminating against transgender people, there is a “wealth of evidence” of other kinds of discrimination against them. Strangio pointed to earlier bans on service by transgender people in the military, as well as bans on cross-dressing.\n\nBarrett also emphasized that the court’s resolution of the case would not affect the separate question (which the court declined to review) of whether SB1 violates the fundamental rights of parents to make decisions about their children’s medical care.\n\nJustice Ketanji Brown Jackson drew questioning back to the fundamental role of the court’s authority on equal protection, invokingLoving v. Virginia, the Supreme Court’s 1967 case striking down Virginia’s ban on interracial marriage. In that case, she said, whether you could get married depended on your race even as the law banned interracial marriage for all people, while here access to puberty blockers hinges on a patient’s sex as assigned at birth. She noted that Virginia had also made arguments based in science to defend the ban on interracial marriage, and it contended that the court should defer to the legislature. If the court declines to hold that SB1 should be subject to heightened scrutiny, she said, it would be ignoring “bedrock precedent.”\n\nPrelogar stressed that even if the courts apply heightened scrutiny to laws like SB1, it still leaves “real space” for states to regulate. She pointed to West Virginia’s law regulating gender-affirming care for trans teens, which she described as imposing “precisely tailored guardrails” – for example, requiring two doctors to diagnose gender dysphoria along with a mental health screening and consent from both parents and the patient’s primary-care physician.\n\nAlito countered that even with such guardrails, applying heightened scrutiny would require “lay judges” to make “complicated medical” decisions that would lead to “endless litigation.”\n\nStrangio stressed that the West Virginia law had not faced any challenges, but – particularly with Justice Neil Gorsuch silent throughout the argument – a majority of the justices were not persuaded.\n\nThis article wasoriginally published at Howe on the Court.",
        "source_3": "Jackson repeated a common argument used by transgender activists that has offended many black civil rights proponents.\n\nU.S. Supreme Court Justice Ketanji Brown Jackson argued Wednesday that bans on transgender surgeries for children are similar to bans on interracial marriage.\n\nJackson argued that one of the state bans on child transgender surgeries appeared to depend on an argument of classification that seemed similar to that used by states in the past on interracial marriage. The court ishearing argumentsabout transgender surgeries after the Biden Department of Justice sued Tennessee for banning the practice in March 2023.\n\n'There is absolutely a parallel between any law that says you can't act inconsistent with a protected characteristic.'\n\n\"The question was whether it was discriminatory because it applied to both races and it wasn't necessarily invidious or whatever, but as I read the statute here, asking the case here, the court starts off by saying that Virginia is now one of 16 states which prohibit and punish marriages on the basis of racial classifications,\" said Jackson.\n\n\"And when you look at the structure of that law, it looks in terms of you can't do something that is inconsistent with your own characteristics. It's sort of the same thing,\" she added. \"So it's interesting to me that we now have this different argument, and I wonder whether Virginia could have gotten away with what they did here by just making a classification argument the way that Tennessee is in this case.\"\n\nU.S. Solicitor General Elizabeth Prelogar agreed with the characterization made by Jackson.\n\n\"Yes, I think that's exactly right that there is absolutely a parallel between any law that says you can't act inconsistent with a protected characteristic,\" she responded.\n\nAudio of the comments wascirculatedon social media by supporters of the Tennessee ban.\n\nDemocrats have been struggling to explain their electoral losses across the board, and some have landed on the unpopular issue of transgender child surgeries as part of their problem. Others have scolded Democrats on the issue and demanded that theparty plow full steam aheadinto more extreme transgender policies, despite polling showing most Americans oppose those policies.\n\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox.Sign up here!"
    }
}