{
    "question": "What are the potential consequences for South Korea’s democratic institutions, civil-military relations, and the pending impeachment effort of President Yoon’s brief martial law declaration and parliament’s swift vote to lift it amid a budget standoff?",
    "content": {
        "source_1": "South KoreanPresident Yoon Suk Yeolreversed course on a martial law order early Wednesday, hours after his surprise decree sparked intense political backlash and fierce protests in the nation's capital.\n\nOpposition leaders called the move unconstitutional and vowed to fight back. Parliament passed a motion requiring Yoon to lift his declaration. Photos and videos showed parliamentary staffers emptying fire extinguishers at armed martial law forces as they tried to breach the National Assembly.\n\nHours after his declaration, Yoon's ruling party urged him to drop the declaration, citing the parliamentary vote, and Yoon said he would reverse course. At about 4:30 a.m. local time Wednesday, theCabinet approved a motionto end martial law, Yonhap news agency reported.\n\n\"Democracy is at the foundation of the U.S.-ROK alliance, and we will continue to monitor the situation,\" a White House spokesperson said after Yoon lifted his order, referring to South Korea by the initials of its official name, the Republic of Korea.\n\nThe surprise declaration came as Yoon's People Power Party and the opposition Democratic Party were locked in a political battle over a budget bill.\n\nThe president's party suffered a landslide defeat at a parliamentary election in April, with the opposition capturing nearly two-thirds of the seats.\n\nYoon had said in a late-night television address that he made the declaration \"to protect the free Republic of Korea from the threat ofNorth Korean communist forces, to eradicate the despicable pro-North Korean anti-state forces that are plundering the freedom and happiness of our people, and to protect the free constitutional order.\"\n\nSeoul is a close American ally and trade partner. A U.S. official said President Biden has been briefed on the situation.\n\n\"The U.S. was not notified in advance of this announcement,\" the White House National Security Council said in a statement after martial law was declared. \"We are seriously concerned by the developments we are seeing on the ground.\"\n\n\"The Administration is in contact with the ROK government and is monitoring the situation closely,” the U.S. Defense Department said in a statement.\n\n\"Tanks, armored personnel carriers and soldiers with guns and knives will rule the country,\" Lee Jae-myung, leader of the Democratic Party, which has the majority in parliament, said in a livestream as armed troops took to the streets. \"The economy of the Republic of Korea will collapse irretrievably. My fellow citizens, please come to the National Assembly.\"\n\nYonhap news agency reported that the entrance to the parliament building was blocked. At one point, parliamentary aides sprayed fire extinguishers to prevent helmeted troops from entering.\n\nYoon's declaration marked the first time in more than 40 years that the government has declared martial law. Former dictator Chun Doo-Hwan declared martial law in 1980 after seizing power in a military coup.\n\nIn the intervening years, South Korea has become a leading Asian democracy and commercial powerhouse whose main industries include steel, textiles, consumer electronics, and car manufacturing.\n\nSyd Seiler, a nonresident senior adviser with the Center for Strategic and International Studies Korea Chair, called the declaration a \"back-to-the-future scenario.\"\n\nMany factors led to the law declaration, Seiler said: Yoon's \"sublevel popularity,\" an \"emboldened and uncooperative\" opposition focused on weakening his standing, and the failure ofa budget proposalthat probably was Yoon's one chance \"to regain the upper hand.\"\n\nYoon's critics called for him to step down after his martial law declaration sparked a wave of fury.\n\nThe main opposition Democratic Party said Yoon — who has been in office since 2022 — should step down or face impeachment. A coalition of lawmakers from opposition parties said they planned to propose a bill to impeach Yoon on Wednesday that should be voted on within 72 hours.\n\nSouth Korea's largest union coalition, the Korean Confederation of Trade Unions, said thousands of members would strike until Yoon resigned, and the coalition planned to hold a rally in downtown Seoul.\n\nYoon's chief of staff and more than ten senior secretaries to the president have handed in their resignations, CNNreported, citing the president’s office.\n\nBut South Korea's historical memory of martial law four decades ago could make the backlash against Yoon's declaration even more severe, Seiler said.\n\n\"The No. 1 goal of the opposition is to ensure that all of President Yoon's credentials as democratically elected president are now tarnished,\" he said.\n\nSouth Korea is a major U.S. military and economic partner in Asia, and the U.S. has maintained a large troop presence there since the end of the Korean War in 1953.\n\nSouth Korea hosts one of the largest U.S. overseas military bases, home to about 28,000 troops. The troops act as a deterrent against nuclear-armed North Korea and are there to defend South Korea against any attacks from Pyongyang.\n\nSeiler said it's unlikely the declaration will have any impact on U.S. forces in the country. Historically, the U.S. \"stayed committed through thick and thin\" to its military relationship with South Korea, he said.\n\nThe U.S. has mutual defense agreements in place with South Korea. DuringPresident-elect Donald Trump'sfirst term, he demanded billions of dollars more to extend those agreements.",
        "source_2": "South Korean MPs have begun impeachment proceedings againstPresident Yoon Suk Yeolafter thwarting his shock move to impose martial law\n\nThe president had said martial law was needed to protect the country from \"North Korea's communist forces\" and to \"eliminate anti-state elements\"\n\nThough he cited North Korea, President Yoon's decision was seen as a response todomestic pressure and a series of scandals\n\nLess than two hours after his declaration, MPs forced their way into the National Assembly andvoted to block his decision- some broke through barricades;the parliament's speaker told the BBC he climbed over a wall\n\nAfter the assembly vote, President Yoon announced he wasreversing his martial law decision- MPs will now vote on his impeachment in the coming days\n\nYoon's defence minister Kim Yong-hyun - said to be influential in the president's martial law plan -offered his resignation on Wednesday\n\nAnd a woman who stood before a soldier andgrabbed his gun in parliamentlast nighthas told the BBC why she did it\n\nThis live page is now closed -our latest story is here,or readhow the night unfolded\n\nHow two hours of martial law unfolded in South Korea\n\nEdited by Francesca Gillett and Tinshui Yeung, with Nick Marsh, Jake Kwon, Tessa Wong and Leehyun Choi reporting from Seoul\n\nIt's nearing midnight in South Korea, and we're now closing this live page. Here's the latest:\n\nTo read more,we've got an explainer on what martial law is and why it was declared,as well as a movingaccount from a protester who grabbed a gunpointed at her.\n\nThere's alsoa run-down of how the night unfolded,and our correspondent Laura Bicker has answered the question that everyone's been asking:what was the president thinking?\n\nIt's nearing 24 hours since the shock news from South Korea, but the fallout continues...\n\nTuesday 22:30 (13:30 GMT): In a television address, President Yoon declares martial law.\n\nThe South Korean parliament ceases activity. Police turn up and so do protesters, who clash. Lawmakers enter the National Assembly, some climbing fences to get in.\n\nWednesday 01:00: Just a few hours later, the parliament votes to block martial law.\n\nWednesday morning: Protesters return to the streets of Seoul, demanding Yoon's resignation.\n\nHis top staff offer up their resignations, which need to be approved by Yoon.\n\nWednesday morning: Opposition lawmakers in South Korea put forward a motion to impeach Yoon.\n\nWednesday evening: The defence minister, Kim Yong-hyun, offers to quit, after also facing calls for impeachment.\n\nThe protest march that began at Gwanghwamun with a candlelight vigil seems to have ended, with policemen on the ground confirming to the BBC that demonstrators reached the presidential office at Yongsan district, before dispersing soon after.\n\nEarlier in the evening, a separate protest at the National Assembly also saw demonstrators holding up candles and calling for Yoon to step down.\n\nAfter a dramatic 24 hours that began with Yoon's declaration of martial law, Seoul seems to have calmed down for now - it's almost 11pm here.\n\nBut President Yoon's troubles are far from over - lawmakers earlier today kickstarted a process to try to impeach him.\n\nAn aerial view of a street protest in Seoul earlier\n\nSouth Korea's deputy prime minister has sent a letter to leading figures in the financial world, reassuring them martial law has been lifted, according to the Yonhap news agency.\n\n\"All national systems, including Korea's politics and economy, are operating normally as before,\" the letter says.\n\nIt was reportedly sent to a number of major powers - including the US, Japan and China - and key financial institutions.\n\nThe political crisis in South Korea has impacted financial markets, with the country's currency - the won - reaching a near two-year low, and Korea's Kospi share index down 1.4% today.\n\nA screen in the dealing room of Hana Bank, Seoul, earlier today\n\nAn MP from the South Korean presidentâs party, the People Power Party (PPP), tells the BBC how he flew home immediately from Washington DC after seeing martial law declared in his home country.\n\nSpeaking on the Newshour programme, Kim Gunn says he was \"puzzled\" by the declaration of martial law but insists the country has a \"very vibrant democracy\".\n\nHe agrees that the decision was a bad one to take â \"the declaration was not well co-ordinated or preparedâ¦we must investigate what really happened\" - and he wants answers.\n\nHe says there is a National Assembly conference on Wednesday evening that he will attend, to discuss the tumultuous last 24 hours.\n\nSoldiers inside South Korea's parliament on Tuesday, during the country's short-lived period of martial law\n\nUS State Secretary Antony Blinken says they \"welcome\" President Yoon's withdrawal of martial law.\n\nSpeaking at a Nato press conference in the past hour in Brussels, he adds South Korea is \"one of our closest partners\" and that \"any political disagreement needs to be resolved peacefully\".\n\n\"Korea's been an extraordinary story, an extraordinary success story\" in the past few decades, he adds.\n\n\"This is all very strange,\" 19-year-old Hwang told me at the National Assembly earlier.\n\nHe was watching the news last night and the top story was the protests in the eastern European state of Georgia.\n\nThen, instead of protests overseas, the images on his TV were suddenly of demonstrations in his own country.\n\nOut of the blue, South Korea was under martial law.\n\nLess than 24 hours later, the student was at the assembly to give his backing to the couple of hundred Democratic Party supporters whoâd amassed on the parliament steps.\n\n\"When I saw the presidentâs announcement, I couldnât believe what I was seeing. But now itâs important for me to be here to show that we are against what he tried to do.\"\n\nEarlier we told you about a viral video from last night - when martial law was in place - in which a woman stood defiantly before soldiers at gunpoint.\n\nThe woman in the video, Ahn Gwi-ryeong told the BBC earlier:\"I didn't think... I just knew we had to stop this.\"\n\nWe can now share with you this footage of the incident.\n\nAs we reported earlier, defence minister Kim Yong-hyun hastendered his resignation,saying he accepted full responsibility.\n\nKim has only held the role for a few months, but is said to have been influential in the president's plan to impose martial law.\n\nSeveral Korean media reports say he personally suggested the idea to the president, and gave orders to military commanders to enforce the action on Tuesday evening.\n\nIn his resignation statement, Kim says that all soldiers \"followed the minister's instructions\", and he took \"all responsibility\".\n\nThe protest rally at Gwanghwamun is on the move. Thousands are marching through the streets of downtown Seoul.\n\nTheir final destination seems to be the presidential office in Yongsan district, where they will repeat their calls for Yoon to step down or be impeached.\n\nIt's a noisy, colourful affair, with loud chants of \"arrest Yoon Suk Yeol\", banners calling for the end of his administration with a labour strike, and even a drum troupe accompanied by dancers.\n\nWoo Won-Shik - the speaker of South Korea's National Assembly who played a key role in stopping the president's martial law decision -tells BBC Koreahe rushed to parliament last night \"with the thought that we must protect democracy\".\n\nWhen he arrived at the National Assembly, Woo says police were controlling access to the building, and he was blocked from entering.\n\nAs speaker, Woo says he holds a \"key position\", so he \"went to the back where the National Assembly security was lax, climbed over the wall, and came in\"(something another politician also had to do).\n\nOnce he arrived, Woo says lawmakers were in a rush to start proceedings - he wouldgo on to lead parliament as it voted to reverse martial law,just two and a half hours after it was announced.\n\nOur reporter Tessa Wong sent us this video from the rally at Seoul's main square.\n\nShe says hundreds, if not thousands, of people were there and many were \"very angry\". Now, the crowds are marching to the presidential office - she's still with them and will send us more shortly.\n\nAs night falls in Seoul, thousands of South Koreans are braving freezing temperatures to march to the president's office, reiterating calls for President Yoon to be impeached.\n\nA separate rally held by opposition parties is happening at the National Assembly, AFP news agency reports.\n\nA South Korean opposition politician tells the BBC that \"whether [President Yoon] resigns or not, we are going to impeach him\".\n\nJoon Hyung Kim, a member of the National Assembly for the Rebuilding Korea party, tells the BBC World Service's Newsday that the president is \"the biggest risk in Korea right now\".\n\n\"He has a very divisive nature, his world-view is like, black and white,\" Joon says. \"He considered opposition parties, parliamentary members as anti-state groups. It was turmoil, but we prevailed, and you know, this is power of Korean democracy.\"\n\nThe process for impeaching the president has begun- butas our correspondent writes, might he resign first?\n\nOpposition spokesperson grabs soldier's gun in front of National Assembly\n\nA viral video from last night - when martial law was briefly declared in South Korea - captured a shocking moment: armed soldiers\nentering the National Assembly, and a woman standing defiantly before them at\ngunpoint.\n\n\"I didnât thinkâ¦I just\nknew we had to stop this,\" the defiant woman - Ahn Gwi-ryeong - tells the BBC.\n\nArriving at the National\nAssembly just past 23:00, Ahn -  a 35-year-old spokeswoman for the opposition Democratic Party - recalls turning off office lights to avoid\ndetection, as helicopters circled overhead.\n\nBy the time she reached the main\nbuilding, soldiers were confronting officials, aides, and citizens.\n\nWhen the military began\nadvancing, Ahn stepped forward.\n\n\"Honestly, I was scared at firstâ¦but seeing\nsuch confrontation, I thought, âI canât stay silent.â\"\n\nOvercome with emotion,\nshe says it is \"heartbreaking and frustrating that this is happening\nin 21st Century Korea,\" before breaking down in tears.\n\nAn emotional Ahn Gwi-ryeong speaking to the BBC in Seoul on Wednesday\n\nChun In-Bum, a retired South Korean army lieutenant-general, says he was \"dumbfounded\" as he followed yesterday's events on television.\n\n\"I'm not one to be surprised easily but yesterday was a really scary moment for me,\" he tells the BBC's Radio 4 Today programme - but \"fortunately the democratic system worked\".\n\nAsked about why President Yoon may have chosen to impose martial law, Chun cites \"continuous attacks\" by the opposition which Yoon saw as \"a direct threat to democracy\".\n\n\"But declaring martial law is a bit too much,\" he adds.\n\nOne of the biggest questions on people's minds in Seoul on Wednesday is: what was the president thinking?\n\nIn a late-night address that threw South Koreaâs parliament into chaos and tested the countryâs commitment to democracy, President Yoon Suk Yeol declared he was imposing martial law.\n\nSouth Korea is a stable, prosperous democracy - yet Yoon claimed he was introducing military rule to save the country from dark forces. He called the opposition-controlled National Assembly a \"den of criminals\" that was \"attempting to paralyse\" the government.\n\nHis shock declaration was, in fact, a bid to get the kind of grip on power that has eluded him since he won the presidency in 2022 by the slimmest margin in South Korea's history.\n\nMore from Laura on what President Yoon might have been thinking.\n\nAfter six opposition partiesearlier filed a motion to impeachthe president, they now plan to present it to parliament's plenary session on Thursday, Yonhap news agency reports.\n\nIt will then be voted on Friday 6 or Saturday 7 December, as it must happen within 72 hours of the bill being proposed.\n\nOn Tuesday soldiers turned up to parliament to take control, but protesters then arrived to try and stop them\n\nIn a shock TV speech on Tuesday,President Yoon Suk Yeol decided to impose martial law.Soldiers entered parliament but less than two hours later, angry MPs also forced their way in and voted to block Yoon's move. Yoon reversed his initial decision - he's now facing impeachment proceedings.\n\nMartial law is when a civilian government is replaced by military rule - it's usually temporary in a time of emergency, but can run indefinitely. It can also be accompanied by a suspension of people's normal civil rights.\n\nPresident Yoon said it was to protect the country from \"North Korea's communist forces\", but observers say he was facing his own political troubles and was trying to get a grip on power.\n\nImpeachment is the process of bringing charges against an official for misconduct in office.\n\nPresident Yoon's wife - Yoon Suk Yul -has been involved in a string of controversies, including allegations she broke gift rules by accepting a luxury Dior bag. While this has had an impact on public opinion,it's not Yoon's only problemor the sole reason for his low approval ratings.\n\nAs night falls and the temperature drops to near 0C (32F), hundreds are braving the cold and streaming into Gwanghwamun Square to call for Yoon's impeachment.\n\nA performer on stage strums a guitar passionately and sings. The crowd sways and cheers, holding candles and the flags of unions, community organisations and political groups.\n\nMany are clutching placards reading: \"Accused of rebellion, Yoon Suk Yeol must resign.\"\n\nThe atmosphere is festive and defiant.\n\n\"[With martial law] Yoon attempted to crack down on press freedom, but journalists are here,\" says one union leader on stage, gesturing to reporters standing on the sides.\n\n\"He has also tried to crack down on the unions but now we are going on strike... We will win at the end!\"",
        "source_3": "South Korean Yoon Suk-yeol stunned the world on Tuesday morning by declaring a state of “emergency martial law” because “subversive, anti-state elements” among the opposition are blocking his agenda.\n\nMartial law has not been declared in South Korea since it emerged from military dictatorship in the 1980s.\n\n“I declare martial law to protect the Republic of Korea from the threats of North Korean communist forces, to immediately eradicate the unscrupulous pro-Pyongyang anti-state forces that pillage the freedom and happiness of our people and to protect free constitutional order,” Yoonsaidin an emergency press conference from his office in Seoul.\n\nYoonaccusedthe opposition of “paralyzing the courts in the country by threatening the judges and impeaching prosecutors, and by attempting to remove the Interior Minister, top broadcasting regulator, chief of the Board of Audit and Inspection, and the Defense Minister.”\n\nYoon also said the opposition’s move to cut $2.8 billion from the $483 billion 2025 national budget was a scheme to paralyze his government. The opposition wants todenyextra spending for the presidential office, prosecutors, and police requested in Yoon’s budget.\n\nThe president’s supporters say one reason for these cuts is to undermine court cases against opposition leader Lee Jae-myung, who was convicted of election law violations last month. Yoon referred to the National Assembly, where Lee’s Democratic Party holds 170 out of 300 seats, as a “hotbed of criminals” in his declaration of martial law.\n\nOn Monday, the speaker of parliament froze voting on the budget until December 10.\n\nYoon said on Tuesday that martial law would remain in effect until he could “eradicate such anti-state forces and the culprits of the country’s ruin who have committed evil acts up until now.”\n\n“The declaration of martial law will cause some inconveniences for good citizens who believed in and followed the constitutional values of free people, but we will focus on minimizing such inconveniences,” he said.\n\nYoon said these inconveniences were necessary to “guarantee the people’s freedom, safety and national sustainability against the actions of anti-state forces seeking to overthrow the system.”\n\n“I will wipe out anti-state forces as soon as possible and normalize the country’s operation,” he promised. “Please trust me.”\n\nThe South Korean Defense Ministry announced that key commanders from all of South Korea’s armed forces met to “strengthen emergency preparedness” and discuss implementation of Yoon’s order.\n\nPeople gather in front of the National Assembly in Seoul, South Korea on December 4, 2024, after President Yoon Suk Yeol declared emergency martial law. (JUNG YEON-JE/AFP via Getty)\n\nThe South Korean opposition was, unsurprisingly, opposed to Yoon’s declaration of martial law, but so was Han Dong-hoon, the leader of Yoon’s People Power Party. Han issued a statement on Tuesday that said he would “oppose the declaration of martial law alongside the people.”\n\n“The President’s declaration of martial law is wrong,” Han declared.\n\n“There is no reason to declare martial law. We cannot let the military rule this country,” opposition leader Leesaid.\n\n“President Yoon Seok Yeol has betrayed the people. President Yoon’s illegal declaration of emergency martial law is null and void. From this moment on, Mr. Yoon is no longer the president of South Korea,” he insisted.\n\nLee urged the South Korean military not to obey Yoon’s orders any longer.\n\n“Soldiers, the guns and bayonets you have, the power you have, come from the people. The owners of this country are the people. The one you should obey is not Yoon Suk Yeol but the people,” he said.\n\nSouth Korean mediashowedprotesters attempting to storm the parliament building, which has been locked down under orders from the military.\n\nYoon himself has beenfending offcalls for independent investigations into several scandals involving his wife Kim Keon-hee and top officials from his party. Yoon and Kim are accused of interfering in the party’s choice of candidate for a legislative seat in 2022 at the behest of a powerful supporter named Myung Tae-kyun.\n\nYoon isdownto 25% approval in the polls, slipping again last week after a modest recovery in early November. His People Power Party is polling at 32%, while the opposition Democratic Party (DP) sits at 45%.\n\nThe imposition of martial law was not a complete surprise, as the DPaccusedYoon of plotting to do exactly that in September. The DP said Yoon would impose martial law to prevent the parliament from impeaching him for abuse of power, touching off a storm of angry denials and counter-accusations.\n\nUpdate:Martial law commander Park An-su issued astatementon Tuesday declaring that “all political activities, including those of the National Assembly, local councils, political parties, and political associations, as well as assemblies and demonstrations, are strictly prohibited.”\n\n“All media and publications shall be subject to the control of the Martial Law Command,” Park added.\n\nThe martial law decree alsoorderedall medical personnel who are on strike, or on leave, to “return to their duties within 48 hours and work faithfully.” All strike activity has been banned for the duration of martial law. A significant number of South Korea’s medical personnel have beenon strikesince February due to changes in government policies.\n\nPolice and military forces have been deployed around the South Korean parliament building, where they are clashing with a large group of angry protesters. DP legislators appear to be resisting efforts by security forces to remove them from the building:\n\nReutersreportedthat about 70 opposition legislators have gathered inside the building, and more are attempting to join them. Riot police arepreventingeither lawmakers or members of the public from entering the facility."
    }
}