{
    "question": "How might Walmart’s rollback of DEI measures—including ending its racial equity center, exiting the HRC Corporate Equality Index, shifting to “belonging” language, and removing certain products marketed to children—affect its workplace culture, customer trust, and relationships with suppliers and community partners?",
    "content": {
        "source_1": "Walmart, the nation’s largest private employer, is the latest company to make changes to its diversity, equity and inclusion initiativesunder pressure from a conservative activist.\n\nThe retail giant said it would not renew a racial equity center it created following the 2020 murder of George Floyd and it would no longer participate in anannual benchmark index from LGBTQ+ advocacy groupthe Human Rights Campaign.\n\nRobby Starbuck said he warned Walmart last week he was working on a report about “wokeness.” According to Starbuck, the company then engaged in “productive conversations” to make changes.\n\n\"Removing wokeness from Walmart has both downstream effects on suppliers and it sets the tone for corporate America,\" Starbuck told USA TODAY. \"Changing the normal operating policy at a nearly $1 trillion company is a gargantuan feat that many have tried to achieve but no one until now has actually been able to get done.”\n\nWalmart also committed to monitoring third-party items in the Walmart marketplace for “inappropriate sexual and/or transgender products marketed to children;” reviewing all Pride funding; and no longer using the term LatinX in official communications, Starbuck said.\n\nWalmart said many of the DEI changes were in the works for a few years and were not a result of the conversation with Starbuck. For example, Walmart said it already switched its terminology from DEI to belonging and made changes to its supplier diversity program.\n\n\"We’ve been on a journey and know we aren’t perfect, but every decision comes from a place of wanting to foster a sense of belonging, to open doors to opportunities for all our associates, customers and suppliers and to be a Walmart for everyone,\" the company said in an emailed statement.\n\nAfter themurder of George Floydin 2020 forced a historic reckoning with race in America, businesses pledged to make their workforces and their leadership better reflect the communities they serve.\n\nEmployees of color areunderrepresented at every level of powerin corporate America, according to USA TODAY data investigations. One analysis in 2023 found thatwhite men account for 7 in 10 executive officersin the nation’s largest companies. About 1 in 7 of these companies had executive teams made up only of white men.\n\nBut four years after those 2020 promises, the political landscape has shifted. Though corporate diversity efforts arebroadly supportedby the American public – especially younger Americans – they face growing scrutiny in the courts and in statehouses across the country as right-wing foundations, think tanks and political operatives push “race-neutral” policies.\n\nThe Supreme Court decision in 2023 toban the consideration of race in higher educationonly emboldened attacks on workplace programs.\n\nPublic sentiment has also shifted. Consumer boycotts that slashed sales forced some brands likeBud Light and Targetto retreat from marketing campaigns to the LGBTQ+ community. Major brands likeFordandLowe’shave abandoned initiatives and overhauled teams after pressure from Starbuck.\n\nIn conservative circles, the 2024 election is being viewed as areferendum on DEI. President-elect Donald Trump haspledged to crack downon corporations that do business with the federal government.\n\nMore than 60% of corporate executives surveyed by business research group The Conference Board view today's political climate for corporate DEI as very or extremely challenging, and most expected continued or escalating pushback.\n\nEven so, fewer than 10% of the organizations planned to scale back their DEI commitments over the next three years.\n\nProponents say DEI programs aregood for business, helping companieshire and retain diverse talentand create environments thatboost innovation.\n\nBut business leaders are reluctant to talk about their initiatives. Major corporations including Walmart recently declined to make executives available to USA TODAY to discuss their DEI programs.",
        "source_2": "Walmart will roll back some of its diversity, equity and inclusion initiatives, becoming the latest major company to pull back on inclusivity efforts amid pressure from conservative activists.\n\nWalmart confirmed to several outlets, includingBloombergand theAssociated Press, that it is making broad changes—including no longer giving priority treatment to suppliers based on race and gender, ending racial equity training for staffers and exiting from the LGBTQ rights group Human Rights Campaign’s Corporate Equality Index.\n\nThe supposed changes were firstannounced on Xby prominent anti-DEI conservative pundit, Robby Starbuck, who said the move was in response to the threat of him doing a “story on wokeness” at the company ahead of the key holiday shopping season.\n\nStarbuck claimed he had “productive conversations” with executives at Walmart who promised to implement these changes.\n\nThe company confirmed to Bloomberg that it had held conversations with Starbuck, but claimed it was already reviewing its DEI efforts before that.\n\nAside from changes to its DEI policies, Walmart has also agreed to monitor its online marketplace for listings by third-party sellers that Starbuck describes as “sexual and/or transgender products marketed to children” and remove them if necessary.\n\nThe company also told AP it plans to review grants for Pride events to ensure it was not “financially supporting sexualized content that may be unsuitable for kids.”\n\nGet Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign uphere.\n\nIn his post, Starbuck noted: “I have to give their executives major credit because this will send shockwaves throughout corporate America. This is the biggest win yet for our movement to end wokeness in corporate America.”\n\nBillionaire Elon Musk—who himself is a vocal critic of DEI initiatives and has reshared and responded to Starbuck’s posts previously—praisedthe conservative pundit’s latest announcement. Former Arkansas Governor Mike Huckabee, who is also president-elect Trump’s pick to be the next U.S. ambassador to Israel,also hailedStarbuck calling him “perhaps the most influential person in America restoring our culture & country to sanity.”\n\nStarbuck, who has more than 700,000 followers on X, has emerged as one of the most prominent conservative figurestargeting companies over DEI initiatives. Starbuck scored his first win earlier this year, after his online campaign against Tractor Supply’s DEI policies forced the retailer to reverse course. At the time, thecompany announcedit would stop sponsoring Pride events, stop submitting data to the Human Rights Campaign and withdraw its carbon emission goals. Starbuck would go on to target several other major companies, including Ford, Lowe’s and Harley Davison, who have all since also rolled back their DEI measures.\n\n1.6 million. That’s the total number of workers Walmart hires in the U.S.according to its website. This makes it the biggest American company so far to have rolled back its DEI initiatives.\n\nThe right-wing pundit indicated in an X post that he was not done targeting companies, especially large retailers. Starbuck wrote: “Companies like Amazon and Target should be very nervous that their top competitor dropped woke policies first. I think Target specifically will suffer serious sales problems as a result and Walmart will benefit.”\n\nWalmart, World’s Biggest Retailer, Will Curb Diversity Efforts(Bloomberg)\n\nThe Anti-D.E.I. Agitator That Big Companies Fear Most(New York Times)",
        "source_3": "'The Bottom Line' panelists weigh in as some companies look to distance themselves from politics.\n\nFIRST ON FOX:Walmart is making a slate of changes to itsdiversity, equity and inclusion (DEI)policies, becoming the latest in a growing list of major corporations to halt the so-called \"woke\" initiatives.\n\nAnti-woke activist and filmmaker Robby Starbuck, who has been leading a campaign exposing major corporations' woke policies, said on X on Monday that he warned Walmart executives last week that he would be doing a story on \"wokeness\" at theretail giant.\n\n\"Instead,\" Starbuck shared, \"we had productive conversations to find solutions.\"\n\nWalmart is the latest major company to roll back its DEI policies following activist pressure.(Jakub Porzycki/NurPhoto via Getty Images/File)\n\nStarbuck outlined the changes Walmart agreed to make, including working to remove sexual and transgender products inappropriately marketed toward children and reviewing grants to Pride events to avoid funding sexualized content targeting kids.\n\nWalmart clarified that these changes have been in the works for a few years and were not a result of the conversation with Starbuck.\n\nTOYOTA FOLLOWS GROWING TREND OF COMPANIES HALTING DELI POLICIES AND INITIATIVES\n\nWalmart confirmed toFOX Businessthat it plans to change how it monitors products within its marketplace and reviews the funding of grants.\n\nThe company said some products that violated its policies have been removed, such as chest binders – products designed to flatten the chest – when marketed to children.\n\nThe company also confirmed it will review all grants, especially for community events, to ensure they promote an appropriate environment for children. However, Walmart will continue to support Pride celebrations.\n\nThe company has also decided not to extend the Racial Equity Center it launched in 2020 as a five-year initiative and will ditch the terms \"LatinX\" and even \"DEI\" altogether in official communications. It will instead focus on the term \"belonging\" for all associates and customers.\n\nCATERPILLAR MAKES POLICY CHANGES IN YET ANOTHER CORPORATE DEI ROLLBACK\n\nWalmart also joined an array of companies in recent months –including Fordand John Deere – to end participation in the Human Rights Campaign Corporate Equality Index, which is an annual survey and report used to gauge \"policies, practices and benefits pertinent to lesbian, gay, bisexual, transgender and queer (LGBTQ+) employees.\"\n\nWalmart confirmed it was notified about the Starbuck video last week. Walmart does not generally comment on politics.\n\nA customer shops at a Walmart store.(REUTERS/Daniel Becerril/File)\n\nIn a statement to FOX Business, Walmart said it is \"willing to change alongside our associates and customers who represent all of America.\"\n\n\"We’ve been on a journey and know we aren’t perfect, but every decision comes from a place of wanting to foster a sense of belonging, to open doors to opportunities for all our associates, customers and suppliers and to be a Walmart for everyone,\" the company said.\n\nStarbuck is taking a victory lap over Walmart's announced changes, telling FOX Business, \"Walmart is the single largest employer in the United States. Removing wokeness from Walmart has both downstream effects on suppliers and sets the tone for corporate America.\"\n\n\"Changing normal operating policy at a nearly $1 trillion company is a gargantuan feat that many have tried to achieve but no one until now has actually been able to get done,\" he continued. \"It speaks to the strength and scale of our movement to eliminate wokeness from society and how effective I've been as a megaphone for the concerns of your average consumer.\"\n\nStarbuck added, \"I won't stop until wokeness is a relic of the past.\"\n\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\n\nBy clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time."
    }
}