{
    "question": "What does the gap between a cheaper estimated 10-person Thanksgiving meal and higher planned overall hosting budgets suggest about how Americans are experiencing inflation and holiday spending this year?",
    "content": {
        "source_1": "You may not know it by looking at sticker prices in grocery aisles, but Thanksgiving dinner is more affordable than it has been in years.\n\nThe costs of this year’s holiday feast — estimated at $58.08 for a 10-person gathering, or $5.81 a head — dropped 5% since last year, the lowest level since 2021,according to a nationwide survey of grocery pricesby the American Farm Bureau Federation, which represents millions of U.S. farmers. But the picture improves further when adjusted for inflation.\n\n“If your dollar had the same overall purchasing power as a consumer in 1984 … this would be the least expensive Thanksgiving meal in the 39-year history of the AFBF Thanksgiving survey, other than the outlier of 2020,” the authors wrote.\n\nFor plenty of households, it doesn’t feel that way.\n\nA defining feature of the post-pandemic recovery, and the 2024 election, is the divergence betweenAmericans’ sour views of the economyandits underlying strength. Many shoppers understandably focus on price levels — the dollar value of the things they buy — rather than those purchases’ inflation-adjusted, or “real,” costs. The latter is the true test of affordability, since it reflects an often underappreciated piece of the inflation puzzle: wage inflation.\n\nAnd indeed, while Thanksgiving food prices are up 19% since 2019, according to the AFBF, federal data shows median householdwages growing by about 25%during the same period.\n\nWhat’s more, “the average American also has to work fewer hours to buy the same meal than in previous years,” the report added. “Wages continued to grow faster following the COVID-19 pandemic, even as inflation cooled. Because average wages rose 4% from 2023 to 2024, it took 9% less work time for us to pay for this year’s Thanksgiving dinner.”\n\nOf course, pay gains haven’t boosted all workers evenly, and long-term expenses likehousing costsandchild carecontinue to squeeze families up and down the income spectrum. Whileconsumer confidence has jumpedin recent weeks, it remains below pre-pandemic levels.\n\nStill, the AFBF report said, “even with the decreasing purchasing power of the dollar, some of the goods in our basket are at their long-term lowest prices, even in terms of the ‘current dollar’ price.”\n\nTurkey, for instance, is 6% cheaper than last year, despite bird flu knocking out a portion of turkey inventories. Tighter availability usually drives up prices, but Americans areeating about 1 pound less of turkeyper person each year, reducing demand by more than enough to offset the supply hit.\n\nCertain processed foods that may land on Thanksgiving tables are more expensive. Dinner rolls and cubed stuffing are each selling for 8% more than a year ago. On the flip side, sweet potatoes and whole milk have seen the steepest annual price drops, falling 26% and 14%, respectively. While fresh cranberry prices have climbed 12%, reversing an 18% decline the year before, they remain at their lowest levelsince 2015— and when adjusted for inflation, they’re on par with prices back in 1987, the report said.\n\nThese affordability gains are good news for inflation-weary shoppers, many of whom are increasingly focused on value this year. Major consumer brands have been chasing bargain-hungry customers with price cuts and promotions for months. Some,such as WalmartandTJ Maxx, are seeing greater success than others,like Target.\n\nThe wave of discounting hasbecome more competitiveheading into the holidays, and grocery retailers are no exception. Food eaten at home wasjust 1.1% pricierlast month than the same time last year, compared with the2.6% average run-up in consumer prices overall.\n\nBoth Target and Aldi have rolled out Thanksgiving deals priced lower than last year.Target is offering a $20 Thanksgiving meal for four, including a small turkey, canned vegetables and stovetop stuffing mix.Aldi has a $47 meal package for 10 people, which it’s advertising as lower than its 2019 prices. Walmart is promoting an“inflation-free Thanksgiving”meal of 29 items that can serve eight people for $56. Amazon Fresh is offeringThanksgiving discountson turkey, sides and desserts, feeding six people for less than $5 apiece, plus extra savings for Prime members.\n\nThe flurry of promotions creates plenty of opportunities to comparison shop, experts say.\n\n“I would just advise consumers to take a look at what those meals are comprised of,” said Robin Wenzel, head of Wells Fargo’s Agri-Food Institute. “Don’t be afraid to check out multiple retailers.”\n\nSome Thanksgiving meal packages offer more ingredients, but that could mean preparing more dishes from scratch. Others have fewer items but require less prep work. “Thanksgiving in many families is so personal,” Wenzel said, and the range of offers allows consumers to tailor their grocery shopping to their gatherings.\n\nOne cost-saving strategy is to buy stores’ own “private label” brands, which can save shoppers $17 on a Thanksgiving menu for 10, according to Wells Fargo’s Agri-Food Institute. Experts at Consumer Reports also recommendenrolling in supermarket loyalty and cash-back programsfor extra savings, which often come with conveniences such as virtual coupons within the stores’ apps.\n\nUltimately, how much people pay for Thanksgiving dinner will also depend on geography. Households in the West, the priciest region for the holiday’s groceries, will spend about 18% more on average than those living in the South, where they’re cheapest, the AFBF estimates.\n\nJing Feng is a producer at NBC News covering business and the economy.",
        "source_2": "Reporting by Renee Hickman and Karl Plume in Chicago; Editing by Rod Nickel\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nChicago-based senior commodities correspondent covering agricultural markets, large agribusinesses and the food supply chain and specializing in global trade, farming technology and climate change issues impacting the industry.",
        "source_3": "Stew Leonard's CEO Stew Leonard Jr. joins ‘Cavuto: Coast to Coast’ to discuss the retail earnings report and its mixed reading for average consumers.\n\nStubbornlyhigh inflationis continuing to strain the budgets of American households this Thanksgiving, as a recent report by LendingTree finds that the costs are up 19% from a year ago.\n\nLendingTree's survey found that on average,Thanksgiving dinnerhosts plan to spend $431 on food, drinks and decor for the celebration. That includes an average of $265 for food and drinks, plus an additional $166 on Thanksgiving decor for the festivities. Those Thanksgiving hosts expect an average of 11 guests to attend the holiday party, the same number as last year.\n\nInflation was on the minds of 60% of respondents, who said it has impacted their plans for celebrating the holiday — with 27% saying they'll change food choices, 26% turning to coupons more and 9% declining to host due to costs. Over one-third, 35%, said they may reconsider opening their homes next year because of the cost.\n\nThanksgiving hosts are planning to spend 19% more than they did a year ago to host guests for a dinner party, LendingTree found.(John Moore/Getty Images / Getty Images)\n\n\"What we found is that inflation is still having a really big impact on people's budgets when it comes to their Thanksgiving plans,\" LendingTree chief credit analyst Matt Schulz told FOX Business in an interview about the 19% increase from a year ago. \"Prices aren't rising as much as they have in the last couple of years, but it's still around and it's clearly still an issue that people are wrestling with this Thanksgiving.\"\n\nA turkey in a roasting pan is seen during the preparation of a traditional Thanksgiving holiday meal in San Ramon, California, on Nov. 23, 2019.(Smith Collection/Gado/Getty Images / Getty Images)\n\nGOBBLE UP SAVINGS: SMART TIPS TO CUT COSTS THIS THANKSGIVING\n\nMore than one-third (36%) of potential hosts said that the amount they're planning to spend on Thanksgiving festivities will create a financial strain, while 14% said they regret their decision to host and 34% say they'll usecredit cardsto pay Thanksgiving costs.\n\nWith inflation squeezinghousehold budgets, there is an expectation that guests will help shoulder some of the burden either through chipping in with cash or bringing an item to contribute to the feast. About 6 in 10 potential Thanksgiving hosts said they expect guests to help offset expenses in that way — and 25% say they may reconsider extending an invitation next year if a guest arrives empty-handed.\n\nTURKEY COSTS LESS THIS THANKSGIVING AS PRICES FALL FOR SECOND STRAIGHT YEAR\n\nOver one-third of Thanksgiving hosts said that hosting the gathering will cause them financial strain.(iStock / iStock)\n\n\"That's a big number, and we all have been to parties where somebody shows up with nothing and everybody else brought something. We've all seen that person, nobody wants to be that person,\" Schulz said. \"This survey certainly indicates that that sort of thing tends to not go unnoticed.\"\n\n\"It really just one of those things where it's like, when in doubt, help,\" he said. \"It's something that if you're younger and you're with a group of friends who maybe this is the first time around or something like that, you just may not know better. But when in doubt, if you can bring something, even if it's something small, even if you spend a couple of bucks at the grocery store on the way to the party — every little bit helps.\"\n\nAAA: THANKSGIVING HOLIDAY TRAVELERS TO HIT 80 MILLION THIS YEAR\n\nA majority of Thanksgiving dinner hosts expect guests to bring a dish or otherwise contribute to covering costs, the survey found.(Robert Nickelsberg/Getty Images / Getty Images)\n\nFor Thanksgiving guests who may not have the means to contribute financially to covering some of the expenses or aren't able tobring food, Schulz said that \"helping out doesn't have to cost a lot of money\" and there are other ways to contribute.\n\n\"You can volunteer to show up a little early to help with some of the grunt work that goes into setting up the party, cooking and putting up the decorations. You could volunteer topick up people at the airportif that's an issue,\" he explained. \"There are plenty of things you can do where you can pitch in with a little bit of sweat equity instead of some of your cash, and still be pretty helpful.\"\n\nSchulz noted that one way for consumers to cut back on the cost of their Thanksgiving spending is to not only shop around for the best price, but to make sure if they're using credit cards that they're using the option with the best rewards or taking advantage of travel perks.\n\n\"If you're traveling for Thanksgiving, then a rewards card that may offer you reduced airfare or a free hotel night can really, really be helpful,\" Schulz said.\n\n\"There are cards out there that offer really significant cash back rewards well beyond the 1.5% or 2% you might get with some cards that give you the same return for everything,\" he added. \"So taking the time to think about which card you use when you're making these purchases can really help make a difference in your budget.\"\n\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\n\nBy clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time."
    }
}