{
    "question": "How might the Illinois Supreme Court’s decision to overturn Jussie Smollett’s conviction shape future use of special prosecutors and the handling of cases resolved through agreements to drop charges?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nThe Illinois Supreme Court has overturned actor Jussie Smollett’s conviction on charges that he staged a racist and homophobic attack against himself in 2019 and lied to Chicago police. (AP video by Melissa Perez Winder)\n\nFILE - Jussie Smollett arrives at the BET Awards, June 26, 2022, in Los Angeles. (Photo by Richard Shotwell/Invision/AP, File)\n\nJussie Smollett’s lead defense attorney Nenye Uche speaks to reporters during a news conference Thursday, Nov. 21, 2024, In Chicago, after the Illinois Supreme Court overturned Smollett’s conviction on charges of staging a racist and homophobic attack against himself in 2019 and lying to Chicago police. (Ashlee Rezin/Chicago Sun-Times via AP)\n\nJussie Smollett’s lead defense attorney Nenye Uche speaks to reporters during a news conference Thursday, Nov. 21, 2024, In Chicago, after the Illinois Supreme Court overturned Smollett’s conviction on charges of staging a racist and homophobic attack against himself in 2019 and lying to Chicago police. (Ashlee Rezin/Chicago Sun-Times via AP)\n\nJussie Smollett’s lead defense attorney Nenye Uche speaks to reporters during a news conference Thursday, Nov. 21, 2024, In Chicago, after the Illinois Supreme Court overturned Smollett’s conviction on charges of staging a racist and homophobic attack against himself in 2019 and lying to Chicago police. (Ashlee Rezin/Chicago Sun-Times via AP)\n\nJussie Smollett’s lead defense attorney Nenye Uche speaks to reporters during a news conference Thursday, Nov. 21, 2024, In Chicago, after the Illinois Supreme Court overturned Smollett’s conviction on charges of staging a racist and homophobic attack against himself in 2019 and lying to Chicago police. (Ashlee Rezin/Chicago Sun-Times via AP)\n\nSPRINGFIELD, Ill. (AP) — The Illinois Supreme Court on Thursday overturned actorJussie Smollett’sconviction on charges of staging a racist and homophobic attack against himself in 2019 and lying to Chicago police, saying he should not have been charged a second time after reaching a deal with prosecutors.\n\nThe ruling, which did not address Smollett’s continued claims of innocence, was the latest twist in a yearslong saga. Smollett, who is Black and gay, made headlines around the world after he told police in January 2019 that two men assaulted him in his downtown Chicago neighborhood, spouting slurs, tossing a noose around his neck, and yelling that he was in “MAGA country,” an apparent reference to Donald Trump’s “Make America Great Again” presidential campaign slogan. The report prompted a massive search for suspects by Chicago police before investigators announced that they believed the attack was a hoax.\n\nThestate’s highest court foundthat a special prosecutor should not have been allowed to intervene after Smollett reached a deal with the Cook County state’s attorney in which charges against him were dropped in exchange for him forfeiting his $10,000 bond and performing community service. The dealprompted outragein part because it did not include any condition that Smollett apologize or admit he staged the attack.\n\n“We are aware that this case has generated significant public interest and that many people were dissatisfied with the resolution of the original case and believed it to be unjust,” Justice Elizabeth Rochford wrote in the court’s 5-0 opinion. “Nevertheless, what would be more unjust than the resolution of any one criminal case would be a holding from this court that the state was not bound to honor agreements upon which people have detrimentally relied.”\n\n▶ Stay up to date with the latest U.S. news by signing up to our WhatsApp channel.\n\nSmollett was on the television drama “Empire,” which filmed in Chicago, and prosecutors alleged he staged the attack because he was unhappy with the studio’s response to hate mail he received. Testimony at trial indicated he paid $3,500 to two men whom he knew from “Empire” to carry it out. Smolletttestified that “there was no hoax”and that he was the victim of a hate crime.\n\nSmollett declined to comment Thursday through a publicist. His attorney, Nenye Uche, said Smollett was happy and relieved but also disappointed to have been “dragged through an unfair process.”\n\n“Even though this is over now and Jussie just absolutely wants to move his life forward, people should start asking questions. How did this happen? Why should this even happen? What can we do to make sure this doesn’t happen again?” Uche said at a news conference in Chicago.\n\nThe special prosecutor, former U.S. Attorney Dan Webb, said he disagreed with the court’s ruling while noting that it “has nothing to do with Mr. Smollett’s innocence.”\n\n“The Illinois Supreme Court did not find any error with the overwhelming evidence presented at trial that Mr. Smollett orchestrated a fake hate crime and reported it to the Chicago Police Department as a real hate crime, or the jury’s unanimous verdict that Mr. Smollett was guilty of five counts of felony disorderly conduct,” Webb said.\n\nAfter Cook County State’s Attorney Kim Foxx’s officedroppedthe initial 16 counts of disorderly conduct, the backlash was swift, with then-Mayor Rahm Emanuel calling it “a whitewash of justice.” Webb was appointed special prosecutor and a grand jury restored charges, leading to Smollett’s 2021 conviction onfive counts of disorderly conduct.\n\nSmollett was sentenced to 150 days in jail — six of which he served before he wasfreed pending appeal— and was ordered to pay about $130,000 in restitution. Chicago officials are pursuing reimbursement for that amount in police overtime through a civil case.\n\nFoxx told The Associated Press that she was not surprised that the high court found her handling of the case “proper — if unpopular, proper.” She criticized Webb’s ensuing “legal machinations,” which she said ignored the tenet of prosecutorial discretion and landed the issue in the “same position we were in in March 2019.”\n\n“What they were doing in going to the court to re-prosecute someone because you didn’t like the outcome would have set a horrendous precedent, in which anyone could come in and undermine the work of a prosecutor’s office,” said Foxx, who did not seek a third term this year.\n\nEileen O’Neill Burke, theincoming Cook County state’s attorney, declined to comment.\n\nSmollett, a child actor who appeared in 1992 movie “The Mighty Ducks,” has credited his role as a singer on the hip-hop drama “Empire” for turbocharginghis career. This year, he starred in the movie “The Lost Holliday” with Vivica A. Fox.\n\nIllinois Supreme Court Chief Justice Mary Jane Theis and Justice Joy Cunningham took no part in Thursday’s decision.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "The Illinois Supreme Court has overturned aconviction against actor Jussie Smollett, who prosecutors accused of staging a racist and homophobic attack against himself in 2019 in Chicago.\n\nSmollett, who is black and gay, was convicted of five counts of disorderly conduct in 2021.\n\nHe had claimed two men targeted him in a hate-crime, yelling racial slurs and putting a noose around his neck while he was walking down the street near his apartment.\n\nTwo men testified that the Empire television show star paid them $3,500 (£2,700) to stage the attack.\n\nSmollett was sentenced to 150 days in jail, but served only six days before he was freed pending appeal.\n\nThe state Supreme Court sided with Smollett's attorneys, who argued in their appeal that Smollett should not have been charged by a special prosecutor after the Cook County State Attorney's Office dropped charges in exchange for community service.\n\nThe decision sparked an uproar from many, including Chicago Mayor Rahm Emanuel said who said Smollett was \"let off scot-free, with no sense of accountability for the moral and ethical wrong of his actions\".\n\nA grand jury later re-established the charges after a special prosecutor took on the case.\n\n\"We are aware that this case has generated significant public interest and that many people were dissatisfied with the resolution of the original case and believed it to be unjust,\" the state Supreme Court wrote in its opinion on Thursday.\n\n\"Nevertheless, what would be more unjust than the resolution of any one criminal case would be a holding from this court that the State was not bound to honor agreements upon which people have detrimentally relied.\"\n\nDuring Smollett's trial, prosecutors alleged he staged the attack because he was unhappy with a television studio's response to hate mail he received.\n\nSmollett said the attack was \"no hoax” and that he was the victim of a hate crime in Chicago.\n\nBut the two men he accused of perpetrating the crime - two brothers, one of whom Smollett said he met through the Empire show - said Smollett hired them and paid them with a cheque.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nThe US military is preparing to activate troops as part of Trump's crackdown on street crime.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.",
        "source_3": "Fox News legal editor Kerri Urbahn provides analysis of the 'significant' decision to dismiss the conviction.\n\nThe Illinois Supreme Court on Thursday overturnedJussie Smollett's hate crime hoaxconviction.\n\n\"Today we resolve a question about the State’s responsibility to honor the agreements it makes with defendants,\" the court wrote in documents obtained by Fox News Digital. \"Specifically, we address whether a dismissal of a case by nolle prosequi allows the State to bring a second prosecution when the dismissal was entered as part of an agreement with the defendant and the defendant has performed his part of the bargain. We hold that a second prosecution under these circumstances is a due process violation, and we therefore reverse defendant’s conviction.\"\n\nSmollett, who is Black and gay, reported to Chicago police that he was the victim ofa racist and homophobic attackby two men wearing ski masks in January 2019.\n\nJUSSIE SMOLLETT'S CAREER HAS ‘HIT BOTTOM’ DESPITE MAINTAINING INNOCENCE OVER HATE CRIME HOAX: EXPERT\n\nJussie Smollett's conviction was overturned by the Illinois Supreme Court.(Nuccio DiNuzzo)\n\nCharges against Smollett were originally dropped. After special prosecutor Kim Foxx requested a new inquiry, the \"Empire\" star was convicted on five felony counts and later sentenced to 150 days in county jail. The Illinois Supreme Court decided Thursday that the special prosecutor's decision to retry Smollett on charges violated his rights.\n\n\"Today we resolve a question about the State's responsibility to honor the agreements it makes with defendants,\" Mark Geragos, Smollett's lawyer, told Fox News Digital. \"We hold that a second prosecution under these circumstances is a due process violation, and we therefore reverse defendant's conviction.\"\n\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\n\"This was not a prosecution based on facts, rather it was a vindictive persecution and such a proceeding has no place in our criminal justice system,\" another of Smollett’s attorneys, Nenye Uche, told Fox in a statement. \"Ultimately, we are pleased that the rule of law was the big winner today. We are thankful to the Illinois Supreme Court for restoring order to Illinois’ criminal law jurisprudence.\"\n\nThis booking photo provided by the Cook County Sheriff's Office shows Jussie Smollett.(Cook County Sheriff's Office via AP)\n\n\"We are thankful to the Illinois Supreme Court for restoring order to Illinois’ criminal law jurisprudence.\"\n\nFormer federal prosecutor Neama Rahmani explained the Illinois Supreme Court's decision to overturn Smollett's conviction.\n\n\"Jussie Smollett is Bill Cosby 2.0. Not because of what he did, but because of what the prosecutor did,\" he told Fox News Digital. \"Kim Foxx shockingly agreed to drop the charges against Smollett for staging a hate crime, lying about it, and costing Chicago PD countless hours and hundreds of thousands of dollars.\"\n\n\"By the time a new special prosecutor took over, it was too late because Smollett had already forfeited his bail and performed community service,\" Rahmani added. \"The Illinois Supreme Court held there was an agreement and Smollett lived up to his end.\"\n\n\"This is similar to the Pennsylvania Supreme Court ruling a previous district attorney agreed not to prosecute Cosby. It’s a shame because Smollett has never accepted responsibility for the hoax, and now he will never face real justice. And it’s an example of another soft on crime prosecutor in our nation’s biggest cities.\"\n\nJussie Smollett filed his appeal in February.(AP Photo/Paul Beaty, File)\n\n\"It’s a shame because Smollett has never accepted responsibility for the hoax, and now he will never face real justice. And it’s an example of another soft on crime prosecutor in our nation’s biggest cities.\"\n\nSpecial prosecutor Dan K. Webb, who was appointed to the case by Cook County Judge Michael B. Toomin, emphasized that Smollett is \"not innocent\" in a lengthy statement provided to Fox News Digital.\n\n\"We are disappointed in the Illinois Supreme Court’s decision today to overturn Jussie Smollett’s convictions and sentence, including the award of over $120,000 in restitution to the City of Chicago for its overtime expenses in investigating Mr. Smollett’s fake hate crime,\" the special prosecutor told Fox News Digital in a statement. \"We respectfully disagree with the Court’s factual and legal reasoning which upends long-standing Illinois precedent.  Indeed, the Special Prosecutor’s brief to the Illinois Supreme Court was replete with Illinois case law that would not preclude a second, new prosecution following a dismissal without prejudice vianolle prosequi.  Even the Illinois Supreme Court agreed in its opinion that its holding today was not explicit in earlier Illinois decisions.\"\n\nSpecial prosecutor Dan K. Webb said in a statement that they are \"disappointed in the Illinois Supreme Court’s decision today to overturn Jussie Smollett’s convictions.\"(Photo by Cindy Ord)\n\nToday’s ruling does not change how deeply proud I am of the work my Special Prosecutor’s office accomplished; nor does it undermine the jury’s verdict, and most importantly, it does not clear Jussie Smollett’s name – he is not innocent.\n\n\"Make no mistake – today’s ruling has nothing to do with Mr. Smollett’s innocence. The Illinois Supreme Court did not find any error with the overwhelming evidence presented at trial that Mr. Smollett orchestrated a fake hate crime and reported it to the Chicago Police Department as a real hate crime, or the jury’s unanimous verdict that Mr. Smollett was guilty of five counts of felony disorderly conduct.  In fact, Mr. Smollett did not even challenge the sufficiency of the evidence against him in his appeal to the Illinois Supreme Court.\"\n\nThe statement continued, in part: \"Despite today’s ruling, the City of Chicago remains able to pursue its pending civil lawsuit against Mr. Smollett in order to recoup the over $120,000 in overtime expenses the Chicago Police Department incurred for investigating Mr. Smollett’s fake hate crime.\"\n\n\"I want to provide a special thanks to Deputy Special Prosecutors Sean G. Wieber, Samuel Mendenhall, and the entire team at Winston & Strawn who assisted in this matter, for all of their dedication and efforts over the years.  Today’s ruling does not change how deeply proud I am of the work my Special Prosecutor’s office accomplished; nor does it undermine the jury’s verdict, and most importantly, it does not clear Jussie Smollett’s name – he is not innocent.\"\n\nSmollett was convicted on five of six charges of disorderly conduct.(Nuccio DiNuzzo)\n\nSmollett filed a petition on Feb. 5, requesting the Illinois high court intervene in his ongoing legal drama. The actor's conviction for astaged hate crimewas upheld in December.\n\n\"What should have been a straightforward case has been complicated by the intersection of politics and public outrage,\" Smollett’s attorneys wrote in the February petition.\n\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\n\nJussie Smollett was originally sentenced to 150 days in jail.(Brian Cassella/Chicago Tribune via AP)\n\nThey repeated an argument from previous appeals saying his 2021 trial violated his Fifth Amendment protections against double jeopardy, or being punished twice for the same crime. They said he had already performed community service and forfeited a $10,000 bond as part of a 2019 deal with the Cook County state’s attorney’s office to drop the initial 16 counts of disorderly conduct.\n\nWATCH: CHICAGO'S FORMER TOP COP REACTS TO JUSSIE SMOLLETT HOAX EVIDENCE\n\nSmollett's legal teamargued that the state breached a \"nolle prose agreement,\" or non-prosecution agreement, by indicting him again in the hate crime hoax. In the agreement, Smollett had been told he could perform community service, forfeit his bond, and the case would be dismissed — similar to a deferred prosecution. Instead, a grand jury restored the charges in 2020, and he was later convicted.\n\nIn this courtroom sketch, actor Jussie Smollett stands as a jury finds him guilty on five of six charges he staged a racist, anti-gay attack on himself and lied to police about it.(AP Photo/Cheryl Cook)\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox"
    }
}