{
    "question": "How might the three-way prisoner swap that returned 10 Americans and exchanged Salvadoran and Venezuelan inmates shape future diplomacy and detainee negotiations among the countries involved?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nVenezuela released 10 jailed Americans on Friday in exchange for getting home scores of migrants deported by the United States to El Salvador months ago under the Trump administration’s immigration crackdown, officials said.\n\nCARACAS, Venezuela (AP) — Venezuela on Friday released 10 jailed U.S. citizens and permanent residents in exchange for getting home scores of migrantsdeported by the United Statesto El Salvador months ago under the Trump administration’s immigration crackdown, officials said.\n\nThe complex, three-country arrangement represents a diplomatic achievement for Venezuelan President Nicolás Maduro, helps President Donald Trump in his goal of bringing home Americans jailed abroad and lands Salvadoran President Nayib Bukele a swap thathe proposed months ago.\n\n“Every wrongfully detained American in Venezuela is now free and back in our homeland,” Secretary of State Marco Rubio said in a statement in which he thankedBukele, a Trump ally.\n\nThis photo released by the El Salvador’s presidential press office shows men, who El Salvador’s government identify as Venezuelans who the U.S. government detained and flew to El Salvador months ago, boarding a Venezuelan plane bound for Venezuela at the Oscar Arnulfo Romero International Airport in San Luis Talpa, El Salvador, Friday, July 18, 2025. (El Salvador’s presidential press office via AP)\n\nBukele said El Salvador had handed over all the Venezuelan nationals in its custody. Maduro described Friday as “a day of blessings and good news for Venezuela.” He called it “the perfect day for Venezuela.”\n\nCentral to the deal are more than 250 Venezuelan migrants freed by El Salvador, which in Marchagreed to a $6 millionpayment from the Trump administration to house them in its notorious prison.\n\nThat arrangement drew immediate blowback when Trump invoked an18th century wartime law, the Alien Enemies Act, to quickly remove the men that his administration had accused of belonging to the violentTren de Araguastreet gang,teeing up a legal fightthat reached the U.S. Supreme Court. The administration did not provide evidence to back up those claims.\n\nThe Venezuelans had been held in a mega-prison known asthe Terrorism Confinement Center, or CECOT, which was built to hold alleged gang members in Bukele’s war on the country’s gangs. Human rights groups have documented hundreds of deaths as well ascases of tortureinside its walls.\n\nLawyers have little access to those in the prison, which is heavily guarded, and information has been locked tight, other than heavily produced state propaganda videos showing tattooed men packed behind bars.\n\nPhotos and videos released by El Salvador’s government on Friday showed shackled Venezuelans sitting in a fleet of buses and boarding planes surrounded by officers in riot gear. One man looked up and pointed toward the sky as he climbed aboard a plane, while another made an obscene gesture toward police.\n\nAfter arriving in Venezuela, some of the migrants crossed themselves, cried and hugged one another. They wore face masks and street clothes.\n\nMaduro alleged that some of them were subjected to various forms of abuse at the Salvadoran prison, and one of them even lost a kidney “due to the beatings he received.”\n\nInterior Minister Diosdado Cabello told reporters the men would undergo medical tests and background checks before they can go home.\n\nOne of the men is reportedly Andry Hernández Romero, a makeup artist who fled Venezuela last year and was taken into Immigration and Customs Enforcement custody at a border crossing in San Diego before eventually being flown to El Salvador.\n\nRep. Robert Garcia, D-Calif., posted on social media Friday night: “We have been in touch with Andry Hernández Romero’s legal team and they have confirmed he is out of CECOT and back in Venezuela. We are grateful he is alive and are engaged with both the State Department and his team.”\n\nIn April, Bukele proposed exchanging the Venezuelans for the same number of what he called “political prisoners” held by Maduro. The suggestion provoked a harsh response from Venezuelan authorities, who called his comments “cynical” and referred to Bukele as a “neofascist.”\n\nMigrants deported months ago by the United States to El Salvador under the Trump administration’s immigration crackdown arrive at Simon Bolívar International Airport in Maiquetia, Venezuela, Friday, July 18, 2025. (AP Photo/Ariana Cubillos)\n\nThe State Department office responsible for negotiating the release of American detainees posted a photo Friday evening of the newly released prisoners smiling for the camera inside an airplane bringing them home, some clutching an unfurled American flag.\n\nA plane carrying the freed Americans arrived late Friday evening at Joint Base San Antonio, with some waving flags and rushing to embrace welcomers after they landed.\n\nAmong those released was 37-year-old Lucas Hunter, whose family says he was kidnapped in January by Venezuelan border guards from inside Colombia, where he was vacationing.\n\n“We cannot wait to see him in person and help him recover from the ordeal,” his younger sister Sophie Hunter said.\n\nAn aircraft with a Venezuelan flag taxis on the runway to another area of the Oscar Arnulfo Romero International Airport in San Luis Talpa, El Salvador, Friday, July 18, 2025. (AP Photo/Salvador Melendez)\n\nVenezuelan authorities detained nearly a dozen U.S. citizens in the second half of 2024 and linked them to alleged plots to destabilize the country.\n\n“We have prayed for this day for almost a year. My brother is an innocent man who was used as a political pawn by the Maduro regime,” said a statement from Christian Castaneda, whose brother Wilbert, a Navy SEAL, was arrested in his Caracas hotel room last year.\n\nGlobal Reach, a nonprofit organization that had advocated for his release and that of several other Americans, said Venezuelan officials initially and falsely accused him of being involved in a coup but backed off that claim.\n\nMigrants deported months ago by the United States to El Salvador under the Trump administration’s immigration crackdown arrive at Simon Bolívar International Airport in Maiquetia, Venezuela, Friday, July 18, 2025. (AP Photo/Ariana Cubillos)\n\nThe release of the Venezuelans, meanwhile, is an invaluable win for Maduro as he presses his efforts to assert himself as president despitecredible evidence that he lost reelectionlast year.\n\nLong accused of human rights abuses, Maduro for months has used the migrants’ detention in El Salvador to flip the script on the U.S. government, forcing even some of his strongest political opponents to agree with his condemnation of the migrants’ treatment.\n\nTheir return will allow Maduro to reaffirm support within his shrinking base, while demonstrating that even if the Trump administration and other nationssee him as an illegitimate president, he is still firmly in power.\n\nJust a week ago, the U.S. State Department reiterated its policy of shunning Maduro government officials and recognizing only the National Assembly elected in 2015 as the legitimate government of the country. Signed by Rubio, the cable said U.S. officials are free to meet and have discussions with National Assembly members “but cannot engage with Maduro regime representatives unless cleared by the Department of State.”\n\nThe Americans were among dozens of people, including activists, opposition members and union leaders, that Venezuela’s government took into custody in its brutal campaign tocrack down on dissentin the 11 months since Maduro claimed to win reelection.\n\nBesides the U.S., several other Western nations also do not recognize Maduro’s claim to victory. They instead point to tally sheets collected by theopposition coalitionshowing that its candidate,Edmundo González, won the July 2024 election by a more than a two-to-one margin.\n\nThe dispute over results prompted immediate protests, and the government responded bydetaining more than 2,000 people, mostly poor young men. González fled into exile in Spain to avoid arrest.\n\nMore than 7.7 million Venezuelans have migrated since 2013, when its oil-dependent economy came undone and Maduro became president. Most settled in Latin America and the Caribbean, but after the COVID-19 pandemic, many saw the U.S. as their best chance to improve their living conditions.\n\nDespite the U.S. not recognizing Maduro, the two governments have carried out other recent exchanges.\n\nIn May,Venezuela freed a U.S. Air Force veteranafter about six months in detention. Joseph St. Clair’s family has said the language specialist, who served four tours in Afghanistan, had traveled to South America to seek treatment for post-traumatic stress disorder.\n\nThree months earlier,six other Americanswhom the U.S. government considered wrongfully detained in Venezuela were released after Richard Grenell, Trump’s envoy for special missions, met with Maduro at the presidential palace.\n\nGrenell, during the meeting in Caracas, urged Maduro to take back deported migrants who have committed crimes in the U.S. Hundreds of Venezuelans have since been deported to their home country.\n\nMaduro’s government had accused the Trump administration of “kidnapping” the children by placing them in foster care after their parents were deported.\n\nThis story has been corrected to reflect that the last name of the brother of the Navy SEAL jailed in Venezuela is Castaneda, not Castenada.\n\nTucker reported from Washington and Janetsky from Mexico City. Associated Press writers Matthew Lee and Seung Min Kim in Washington and photographer Salvador Melendez in San Salvador, El Salvador, contributed to this report.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Jesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current affairs and trending news. He has covered current affairs, healthcare, pop culture, and sports. Jesus joined Newsweek's U.S. bureau in 2024, and has previously worked for The Financial Times and served as an international reporter and newsletter editor for El Espectador in Colombia. He graduated with an M.A. in Journalism and Digital Innovation from New York University. Languages: English, Spanish. You can get in touch with Jesus by emailingj.mosquera@newsweek.com\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nPeter Aitken is a Newsweek Politics Editor based in New York. His focus is domestic U.S. politics, but he has experience covering Foreign Affairs, Business and Technology. Peter joined Newsweek in 2024 from Fox News Digital and had previously freelanced at Business Insider. He has interviewed such notable figures as Benjamin Netanyahu, Gen. David H. Petraeus, British Foreign Ministers James Cleverly and Grant Shapps and a ranking member of the Taliban. He graduated from the University of St. Andrews in Scotland, but is New York born and raised. You can get in touch with Peter by emailingp.aitken@newsweek.com. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nAmericans held in Venezuela will be included ina prisoner exchangewith El Salvador, home to the supermax prison known as CECOT where the U.S.has deported hundreds of illegal migrants.\n\nNewsweekunderstands that at least some of the Venezuelan immigrants sent to CECOT in March were on board flights headed to their home country Friday afternoon.\n\n\"Well, there were already rumors that a flight from El Salvador was leaving in a few hours,\" Danielvi Henriquez, sister of one of the deported Venezuelans Wilvenson Guevara Munoz, toldNewsweekFriday.\n\n\"But we realized the plane was headed there. It landed, and they confirmed that there would indeed be an exchange — political prisoners here for our innocent Venezuelans in El Salvador.\"\n\nNewsweekreached out to the U.S. State Department for comment by email on Friday afternoon. Secretary of State Marco Rubio later confirmed the release of 10 Americans from Venezuela.\n\nRelations between the U.S. and Venezuela have been strained for some time, with El Salvador becoming somewhat a bridge between the two nations when it comes to deportations and prisoners. Venezuela has been reluctant to take back nationals deported by the U.S., with CECOTtaking many Venezuelans instead.\n\nEl Salvador will send 238 Venezuelans held in the prison to Caracas in exchange for five U.S. citizens and five permanent U.S. residents to U.S. custody, according to Reuters, which cited two U.S. government officials.\n\nExact figures remain in flux, but one of the officials told the outlet that the numbers appear to be close to expectation.\n\nThe Trump administration has paid El Salvador $6 million to detain 300 migrants under a deal justified by the Alien Enemies Act in the Terrorism Confinement Center, better known as the CECOT maximum security facility.\n\nMany of the families and attorneys of Venezuelans sent by the U.S. to CECOT have denied the alleged gang ties the Trump administration has given as reason for the immigrants' deportations, with multiple reports in the months since the initial March 15 flights suggesting Venezuelans with no criminal records were on board.\n\nEl Salvador previously had a reputation as one of the most dangerous countries in the world, but El Salvador PresidentNayib Bukeleopened the prison and cracked down on criminal activity.\n\nBukele has faced significant criticized for the sweeping measures implemented even as the country closed out 2024 with a record-low 114 homicides. His popularity has soared in his country as a result of the change in fortunes.\n\nThe Salvadoran leader later said on X that the operation was a result of \"months of negotiations with a tyrannical regime.\"\n\nThe Venezuelan government confirmed the swap, stating 252 nationals has been returned from El Salvador at a \"high price\". Its statement also accused El Salvador of human rights violations at CECOT.\n\nIn June, the U.S. State Department issued warnings around American citizens being detained in Venezuela, sayingmore U.S. citizens were being held therethan in any other country.\n\nA State Department spokesperson toldNewsweekat the time that PresidentDonald Trumpand Secretary of StateMarco Rubiowere committed to bringing all Americans unjustly detained overseas home, but factors such as a lack of U.S. embassy or poor diplomatic relations can make the work of State Department officials difficult.\n\nU.S. Secretary of State Marco Rubio, on X:\"Thanks to POTUS's leadership, ten Americans who were detained in Venezuela are on their way to freedom. I want to thank my team at the State Department & especially President Nayib Bukele for helping secure an agreement for the release of all of our American detainees, plus the release of Venezuelan political prisoners.\"\n\nAaron Reichlin-Melnick, senior fellow at the American Immigration Council, on X:\"The Trump admin has consistently claimed that it had no control over the fate of the Venezuelan men it was paying El Salvador to imprison without trial. Today's prisoner swap shows that was a lie. The United States, as El Salvador told the UN, has always maintained custody.\"\n\nLindsay Toczylowski, an immigration attorney representing some of the Venezuelans in CECOT, on X:\"We are closely following media reports about a prisoner swap, but have no confirmation yet. If reports are true, this is proof the Trump admin was lying in court and publicly about the custody of these men and who was in charge of their fates since the day they disappeared them.\"\n\nSalvadoran President Nayib Bukele, on X:\"As was offered to the Venezuelan regime back in April, we carried out this exchange in return for a considerable number of Venezuelan political prisoners, people that regime had kept in its prisons for years, as well as all the American citizens it was holding as hostages.\"\n\nThe Venezuelan government, in a statement Frida afternoon: \"The Government of the Bolivarian Republic of Venezuela announces with satisfaction that it has achieved the release of the 252 Venezuelan citizens who were being held captive and subjected to enforced disappearance in a concentration camp known as CECOT, in the Republic of El Salvador.\n\n\"Venezuela has paid a high price to secure the freedom of these compatriots, through an exchange with the authorities of the United States of America of a group of U.S. citizens who were at the disposal of the justice system, for their proven involvement in serious crimes against the peace, independence, and security of the Nation.\n\n\"The President of the Republic, Nicolás Maduro Moros, always willing to protect the lives and integrity of these Venezuelans subjected to serious human rights violations, did not hesitate to carry out this exchange and thus rescue these Venezuelan migrants kidnapped in El Salvador due to the actions of the most extremist sectors of the Venezuelan right.\"\n\nMore details on which nationals will be released or swapped were yet to be released Friday afternoon.\n\nUpdate: 7/18/25, 12:56 p.m. ET: This article was updated with new information and remarks.\n\nUpdate: 7/18/25, 1:22 p.m. ET: This article was updated with new information and remarks.\n\nUpdate: 7/18/25, 4:23 p.m. ET: This article was updated with new information and remarks.\n\nJesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current affairs and trending news. He has covered current affairs, healthcare, pop culture, and sports. Jesus joined Newsweek's U.S. bureau in 2024, and has previously worked for The Financial Times and served as an international reporter and newsletter editor for El Espectador in Colombia. He graduated with an M.A. in Journalism and Digital Innovation from New York University. Languages: English, Spanish. You can get in touch with Jesus by emailingj.mosquera@newsweek.com\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nPeter Aitken is a Newsweek Politics Editor based in New York. His focus is domestic U.S. politics, but he has experience covering Foreign Affairs, Business and Technology. Peter joined Newsweek in 2024 from Fox News Digital and had previously freelanced at Business Insider. He has interviewed such notable figures as Benjamin Netanyahu, Gen. David H. Petraeus, British Foreign Ministers James Cleverly and Grant Shapps and a ranking member of the Taliban. He graduated from the University of St. Andrews in Scotland, but is New York born and raised. You can get in touch with Peter by emailingp.aitken@newsweek.com. Languages: English.\n\nJesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current affairs and trending news. He has covered current affairs, healthcare, pop culture, and sports. Jesus joined Newsweek's U.S. bureau in 2024, and has previously worked for The Financial Times and served as an international reporter and newsletter editor for El Espectador in Colombia. He graduated with an M.A. in Journalism and Digital Innovation from New York University. Languages: English, Spanish. You can get in touch with Jesus by emailingj.mosquera@newsweek.com\n\nJesus is a Newsweek reporter based in New York. Originally from Bogotá, Colombia, his focus is reporting on politics, current                                    ...Read more",
        "source_3": "Former ATF special agent Bernard Zapor evaluates the Trump administration’s crusade against criminal gangs on ‘Fox Report.’\n\nTen Americans are returning to the U.S. after being released from custody in Venezuela, theSecretary of Statesaid on Friday.\n\n\"Thanks toPresident [Donald] Trump’sleadership and commitment to the American people, the United States welcomes home ten Americans who were detained in Venezuela,\" Secretary of State Marco Rubio said in a statement. \"Until today, more Americans were wrongfully held in Venezuela than any other country in the world. It is unacceptable that Venezuelan regime representatives arrested and jailed U.S. nationals under highly questionable circumstances and without proper due process. Every wrongfully detained American in Venezuela is now free and back in our homeland.\"\n\nRubio also thanked the State Department, inter-agency partners, and El Salvador President Nayib Bukele.\n\n\"Our commitment to the American people is clear: we will safeguard the well-being of U.S. nationals both at home and abroad and not rest until all Americans being held hostage or unjustly detained around the world are brought home,\" he added.\n\nTRUMP'S TREASURY DEPARTMENT TARGETS DANGEROUS VENEZUELAN PRISON GANG WITH SANCTIONS ON 6 TOP LEADERS\n\nVenezuelans who the U.S. government detained and flew to El Salvador several months ago board a plane Friday bound for Venezuela at the Oscar Arnulfo Romero International Airport in San Luis Talpa, El Salvador.(El Salvador's presidential press office via AP)\n\nHe said the U.S. also welcomes the \"release ofVenezuelanpolitical prisoners and detainees that were also released from Venezuelan prisons. The Trump Administration continues to support the restoration of democracy in Venezuela. The regime’s use of unjust detention as a tool of political repression must end. We reiterate our call for the unconditional release of remaining unjustly and arbitrarily detained political prisoners and foreign nationals.\"\n\nThe release is part of a prisoner swap in which Bukele agreed to release hundreds of Venezuelans being held in a maximum-security prison in Tecoluca, El Salvador, in return for Salvadoran prisoners being held in Venezuela.\n\nRUBIO RECALLS TOP US DIPLOMAT FROM COLOMBIA AFTER 'BASELESS' STATEMENTS FROM OFFICIALS\n\nSecretary of State Marco Rubio announced the return of 10 Americans from Venezuela on Friday.(Kevin Dietsch/Getty Images)\n\nThe U.S. sent the Venezuelans to El Salvador in March through the 1798 Alien Enemies Act to deport alleged Tren de Aragua members without going through immigration procedures. Many of the deportees’ families and lawyers denied the gang connections.\n\n\"Today, we have handed over all the Venezuelan nationals detained in our country, accused of being part of the criminal organization Tren de Aragua (TDA),\" Bukele said. \"Many of them face multiple charges of murder, robbery, rape, and other serious crimes.\"\n\nBukele added that the \"operation is the result of months of negotiations with a tyrannical regime that had long refused to release one of its most valuable bargaining chips: its hostages. However, thanks to the tireless efforts of many officials from both the United States and El Salvador, and above all, thanks to Almighty God, it was achieved. In this, as in other matters, I remind you: patience and trust.\"\n\nThe swap comes months after U.S. Air Force veteran Joseph St. Clair's was released from Venezuelan custody after being held there for around six months.(Courtesy of the St. Clair family)\n\nThe Special Presidential Envoy for Hostage Affairs posted a photo of the hostages on social media along with the message: Ten Americans are are their way home from detention in Venezuela! Thanks to @POTUS @SecRubio @usembassyve @aboehler and many others for your support bringing Americans home.\"\n\nChristian Casteneda, whose brother Wilbert, a Navy SEAL, was arrested in a Caracas hotel room last year, said in a statement: \"We have prayed for this day for almost a year. My brother is an innocent man who was used as a political pawn by the Maduro regime.\"\n\nLucas Hunter, whose family said he was kidnapped by Venezuelan border guards in January, was also among the 10 Americans released.\n\n\"We cannot wait to see him in person and help him recover from the ordeal,\" his younger sister Sophie Hunter said in a statement.\n\nThis comes months after U.S. Air Force veteran Joseph St. Clair's wasreleased from Venezuelan custody in Mayafter being held there for around six months.\n\nThe Associated Press and Reuters contributed to this report.\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox"
    }
}