{
    "question": "In what ways could Comcast’s decision to spin off MSNBC, CNBC, and other cable networks into a $7 billion company—while retaining NBC, Peacock, and its studios—shape the strategy and sustainability of those news channels amid cord-cutting and recent ratings declines?",
    "content": {
        "source_1": "When NBC launched MSNBC in 1996, the network was marketed with the slogan “It’s Time to Get Connected,” a line that acknowledged the emergence of the internet as a game-changing force in the media. Microsoft, then a minority partner in the channel, made web culture part of its programming.\n\nNow, MSNBC is being upended by the very technology it first embraced, with streaming video now accounting for nearly half of all TV viewing, according to Nielsen. The decline of pay TV has culminated in Comcast placing MSNBC — along with sister networks such as CNBC and E! — in a spinoff company that will essentially be a repository for its cable outlets.\n\nThe plan, formally announced Wednesday, means MSNBC will be owned by a separate entity from its parent NBC News, ending what has at times been a tense relationship.\n\nComcast is creating a new company, comprising nearly all of NBCUniversal’s current cable networks with the exception of Bravo, home of the ‘Real Housewives.’\n\nNothing changes right away, however. The spinoff, valued at $7 billion, isn’t expected to be completed for about a year. And NBC News will  continue to provide news-gathering services to MSNBC after the spinoff.\n\nNonetheless, the deal raises questions about the future of liberal-slanted MSNBC, which has at times beat its more down-the-middle rival CNN in ratings for major events such as election night.\n\nNBCUniversal Group Chairman Mark Lazarus, who will oversee the new spun-off company, told MSNBC staff Wednesday that he was unsure what the arrangement would mean for the channel’s name and logo, which incorporates the recognizable multicolored NBC peacock.\n\nAfter all, NBC considered changing the MSNBC moniker after it bought out Microsoft’s share of the network in 2005. (Microsoft was the “MS” in MSNBC.) But the plan was rejected because the name was already part of TV news culture.\n\nChanging the name MSNBC now would require a massive promotional campaign. Its audience of habit-bound older viewers — the median age is over 70 — may be reluctant to trust a brand they don’t recognize.\n\nThe spinoff could also increase pressure on talent salaries, which are under scrutiny across all TV news organizations that are facing shrinking audiences.\n\nThe proposed spinoff of Comcast cable channels provides a snapshot of the winners and losers as the cable industry faces increased turbulence.\n\nIn 2021, NBCUniversal signed its star host RachelMaddowto a massive deal paying her a reported $30 million a year. Maddow reduced her MSNBC workload to one day a week in a deal that also has her working on film, documentary and podcast projects for the parent company. How that arrangement would work under the new structure is one of the issues the new company will face.\n\nIn its early years, MSNBC served as a training ground for NBC News talent.Brian WilliamsandLester Holtboth spent hundreds of hours handling breaking news coverage on cable before they were promoted to the anchor chair at “NBC Nightly News.” Correspondents such asSavannah Guthriefrequently appeared on the channel, honing the skills that eventually brought her to NBC’s “Today.”\n\nMSNBC also gave viewers a sense that NBC News was always on, giving it an advantage over its broadcast network competitors CBS and ABC. But it long was unable to overcome the advantage CNN had as the go-to utility for cable news.\n\nEventually, MSNBC followed the model set by  cable news ratings leader Fox News, which succeeded by adding conservative opinion to the mix. Keith Olbermann became the first prime-time star on MSNBC in 2008 by publicly taking on Bill O’Reilly, who was then the signature Fox News host.\n\nWhile the scuffling got attention, the push into liberal political commentary caused tensions among the more traditional-minded journalists at NBC News.\n\n“Being a maverick always ruffles some feathers, and MSNBC was always being a maverick,” said veteran TV news producer Jonathan Wald, who was a senior executive at the network.\n\nThe cable news channel’s rap-lyric-quoting law expert’s stock is rising as historic Trump indictments drive viewership.\n\nBut the formula worked. The network  became only more popular after Donald Trump emerged as a viable Republican presidential candidate in 2015 and disrupted the accepted norms in presidential politics. Once Trump  got elected, MSNBC became home base for viewers opposed to his policies and behavior.\n\nMaddow became a break-out star in prime time. The national shock of Trump created personalities out of Republicans who opposed him, such as Nicolle Wallace, the former White House communications director under George W. Bush.\n\nAs MSNBC’s reputation as a destination for progressive viewers became more pronounced, its fans rejected the more neutral approach of NBC News journalists such as Chuck Todd and Andrea Mitchell, who also appeared on the channel.\n\nTodd’s program, “Meet the Press Daily,”was moved off MSNBCin 2022. Mitchell, a midday anchor on MSNBC for 16 years, isreturning to duties as a correspondentfor NBC News at the end of this year.\n\nEarlier this year, MSNBC hosts blasted NBC News management on air when it attempted to hire former Republican National Committee Chair Ronna McDaniel.The unprecedented public rebukeresulted in NBC News management scrapping the deal.\n\nMeanwhile, MSNBC’s function as a 24-hour service became redundant at NBC News once the network launched NBC News Now, a free streaming news channel.\n\nBut Lazarus, a respected veteran inside NBCUniversal, tried to keep an optimistic tone when addressing staff, according to one attendee at the meeting at the network’s Rockefeller Center headquarters in New York. He said the new corporation will be committed to investment in the network.\n\n“I completely empathize with people who think this would be a bittersweet thing,” Lazarus said. “I think it’s exciting because very few times in life you get to have the opportunity to be part of what I’ll call a ‘well-funded startup.’”",
        "source_2": "Weeks after floating a huge trial balloon, Comcast followed through this morning, announcing plans to spin off most of its linear cable networks into a separate company, including such stalwarts as CNBC, MSNBC, USA Network and SyFy.\n\nIt’s the first tangible action among media executives who exulted in the days after the election about a more relaxed regulatory and M&A regime under the imminent Trump Administration. More importantly, the Comcast announcement likely will set off other spinoffs, mergers, and other deal-making as traditional Hollywood continues to undergo a wrenching transformation to better meet the media and entertainment future.\n\nThe resulting SpinCo, as it’s being called for now, would create a company with a more focused makeup, and really crummy long-term prospects, given the continued cord-cutting that has sent cable subscriptions plummeting. It also may become the fulcrum for a roll-up of other cable networks.\n\nEven CNBC’s own media reporter, Julia Boorstin, noted, “the smaller company can be more acquisitive” in dealmaking with other media companies that are also seeking to offload their cable offerings. The larger Comcast, she and others suggested, couldn’t afford to do such a roll-up because of the negative impacts on its share price, a concern the smaller company wouldn’t face.\n\nBoorstin also mentioned analyst speculation that the spinoff may lead to other shifts in Comcast’s remaining structure, possibly including the rest of the NBCUniversal entertainment operations as well as its Universal theme parks.\n\nMacquarie senior media-tech analyst Tim Nollen wrote after the trial balloon that a cable spinoff probably helps Comcast share prices, clearing out an underperforming unit that is dragging on results. But he questioned whether investors would invest in in a pure-play SpinCo in a troubled, declining sector without the cross-platform synergies possible as part of Comcast.\n\nWall Street investors are already betting on the spinoff’s potential impacts on other media companies too.\n\nWarner Bros. Discovery shares jumped 5 percent in early trading after the news broke. Paramount Global, already amid a restructuring ahead of its takeover by David Ellison’s Skydance Entertainment, jumped a little more than 1 percent.\n\nDisney, already up 17 percent since election day, and sector champion Netflix, up 15 percent over the same period, also saw their shares rise slightly. Expect at least the three traditional Hollywood studios to consider whether they too need their own spinoff or perhaps a deal with Comcast’s SpinCo.\n\nDisney is already planning to launch a standalone subscription streaming service featuring all of ESPN next year that may be a precursor to a spinoff of the sports giant. It’s also been sunsetting lesser cable networks in the year since signing a ground-breaking carriage deal with Charter that makes streaming service Disney+ available free to customers with Charter’s most popular tier.\n\nIn a lengthy analysis posted a few weeks ago, MoffettNathanson senior analyst Robert Fishman suggested that media companies need a handful of key assets to thrive in the looming post-Peak TV, post-Streaming Wars era: “We see these assets as: a scaled streaming service (both in the U.S. and globally), a free AVOD platform, top-tier sports rights, a U.S. broadcast network, and film and television studios.”\n\nPointedly not among those assets: traditional linear cable networks.\n\nThe nets are mired on the cable box, their content largely also available on direct-to-consumer streaming services such as Peacock, which Comcast is keeping. The cable nets’ revenue models are built on advertising and carriage fees, both declining alongside those shrinking audiences. And cable distributors, including Comcast, are more focused on higher-growth broadband and wireless opportunities.\n\nFishman’s top candidate for a tie-up would merge Fox and WBD. Fox has a broadcast network, strong sports rights including the NFL, and the hugely popular Tubi ad-supported free streaming service. WBD has major film and TV production studios, and streaming services led by Max that collectively have 110 million global subscribers.\n\nThat merger idea doesn’t suggest what might happen to the two companies’ all-news linear channels, Fox News and CNN, or other notable cable holdings, such as Discovery Networks. Fox News has been thumping both CNN and MSNBC in ratings since election day, though CNN’s CEO Mark Thompson has been focusing on shifting CNN to an online-first operation less tied to cable.\n\nComcast executives said they expect their cable spinoff to be completed within a year, and did not anticipate regulatory roadblocks. Less clear is how the company manages to extricate its cable operations from the units Comcast plans to retain. For instance, how will NBC News be separated from CNBC and MSNBC operations? And ad sales may also face some complicated disentangling.",
        "source_3": "National Review staff writer Caroline Downey and Oakland Corps adviser Lucy Caldwell joined 'MediaBuzz' to discuss why the former presidential candidate has faced scrutiny from the media and other critics.\n\nComcast’s cable networks, which include MSNBC and CNBC, make a heckuva lot of money.\n\nAs the Wall Street Journal first reported, the communications giant confirmed yesterday it’s spinning off almost all its cable properties, including USA, E!, Oxygen, Syfy and Golf Channel, which generated $7 billion in revenue in the latest 12-month period.\n\nStaying with the mother ship are the NBC television network, the Peacock streaming service and Bravo, plus sports, movies and theme parks.\n\nHACKER OBTAINS HOUSE ETHICS TESTIMONY ON MATT GAETZ AS TRUMP MAKES CALLS FOR AG NOMINEE\n\nPrognosticators have warned for years that cable news is plagued by aging audiences.(iStock)\n\nBeyond the financial questions – whether the smaller cable units have to seek a larger partner – is an unmistakable implication: that all-news channels have a questionable future.\n\nWith CNN having done a round of layoffs last year and expected to impose deeper cuts under its new boss, cable staffers, including top anchors, are nervous about their hazy future.\n\nPrognosticators have warned for years that cable news is plagued by aging audiences – although Fox’s ratings have never been higher – and, along with newspapers, are being eclipsed by newfangled digital media.\n\nThe shift was on display during the presidential campaign,when Donald Trumpand Kamala Harris made plenty of news on podcasts and by courting social media influencers. No question such disruptors shook up the campaign, helping to break the monopoly of the corporate media and giving a platform to new, more freewheeling voices.\n\nMEDIA LIBERALS SAVAGE KAMALA AS TRUMP PICKS EXPERIENCED HARD-LINERS\n\nInthe Free Press,author and former CIA analyst Martin Gurri argues:\n\n\"The campaign saw the news media, as an institution, take a giant leap toward irrelevance — and ultimate extinction. From the New York Times to CBS News, the grand old brands of the industry gambled what shreds of trust remained in them — 31% by one measure — to exert influence on behalf ofDemocratic candidatesand progressive positions. They lost the public’s trust, yet failed to move the needle.\"\n\nCiting a new term, Gurri says that \"coverage of the election felt like postjournalism on acid. Joe Biden received extravagant praise as a wise, experienced leader until he became a political liability. Then, overnight, the media pack tore him apart for being too old and infirm, memory-holing the fact that they had spent the past three years assailing anyone who questioned the lie that he was ‘sharp as a tack.’\n\nA side-by-side of Kamala Harris and President-elect Donald Trump.(Getty Images)\n\n\"Attacks on Trump were so bizarrely strident, and at the same time so ritualized, that they attained the aspect of parody if not wit. My favorite election story was The Atlantic’s ‘Trump Is Speaking Like Hitler, Stalin and Mussolini.’ Not long after its publication, the three-headed super-totalitarian could be found cooking French fries at a McDonald’sin Pennsylvania.\"\n\nHe also points to Washington Post conservative columnist-turned-Trump-hater Jennifer Rubin, who tweeted: \"It is 1933. Hitler is in power.\"\n\nTRUMP, DEFYING MEDIA PREDICTIONS, MAINLY PICKS SEASONED CAPITOL HILL VETERANS SUCH AS MARCO RUBIO\n\nAll this \"went beyond the old joke about rearranging the deck chairs on the Titanic: It was fighting noisily over the best seats in the house, while an entire industry burned to the ground.\n\nI have to blow the whistle on the overheated rhetoric. While it’s fashionable to dismiss the \"legacy media,\" they aren’t headed for extinction or burning to the ground.\n\nIn this photo illustration, a girl looks at the CNN website on her laptop as she awaits the 2024 US election vote count between Donald Trump and Kamala Harris.(Faisal Bashir/SOPA Images/LightRocket via Getty Images)\n\nFor all their flaws and bias, they do this thing called reporting. Most of the disclosures about the most controversial Trump nominees have come from big news organizations. And the most important moments of the campaign, the two debates and key interviews, have played out on television.\n\nThe rise of Substack has provided journalists and others with an independent platform, and it has doubled down on politics while outlets likeMeta’s Facebookand Instagram are minimizing such content.\n\n\"There’s a desperate need for a quality platform with trusted voices, where honest-to-God political discussion, debate, disagreement can happen without it either disappearing into the ether or taking place on a platform where there’s constant knife fights and flame wars,\" co-founder Hamish McKenzie toldthe New York Times.\n\nThe biggest stars have earned millions of dollars in subscription revenue. The Times says these include data guru Nate Silver and the Bulwark, the conservative, anti-Trump site. The Bulwark says it raked in about $6 million in annual revenue from Substack. Silver says he’s making more money than at ABC.\n\nBut Substack,which Elon Muskonce tried to buy, is not profitable, since the company only takes a 10% cut of earnings. Musk temporarily refused to allow Substack links on X.\n\nHowever this all shakes out, it’s a strong platform for disaffected or laid-off journalists, as well as unknowns who build a following with their specialties.\n\nThe Comcast move telegraphs how much the media landscape has changed. But those who predict doom for the traditional media are missing the mark; all of America isn’t constantly online.\n\nHoward Kurtz is the host of FOX News Channel'sMediaBuzz(Sundays 11 AM-12PM/ET). Based in Washington, D.C., he joined the network in 2013 and regularly appears onSpecial Report with Bret BaierandThe Story with Martha MacCallumamong other programs.\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}