{
    "question": "How might the viral image linking Kamala Harris’s 2024 wins to states without photo ID requirements—and the subsequent media coverage and fact-checks—shape public perceptions of election integrity and the push for or against future voter ID policies?",
    "content": {
        "source_1": "Our only agenda is to publish the truth so you can be an informed participant in democracy.We need your help.\n\nClaims that Vice President Kamala Harris alone won states that do not require voter ID are wrong. President-elect Donald Trump won in such states, too, and both candidates prevailed in states with a mix of identification laws.\n\nAlthough Vice President Kamala Harris failed in her bid to become president, some social media posts cast doubt on the legitimacy of her success in the states she did win over President-elect Donald Trump.\n\n\"Kamala Harris only won the states that don’t require voter ID,\" a Nov. 10 Instagrampostsaid. \"Ironic.\"\n\nIn a Nov. 11 Instagrampost, actor Steve Hanks said, \"Kamala lost every state that requires voter ID. Kamala won every state that does not require voter ID. I’m going to say that again: Kamala did not win a single state that requires voter ID, but every state that does not require voter ID, Kamala won. See why they don’t want voter ID? You can’t cheat with voter ID.\"\n\nThis post was flagged as part of Meta’s efforts to combat false news and misinformation on its News Feed. (Read more about ourpartnership with Meta, which owns Facebook, Instagram and Threads.)\n\nLet’s cut to the chase: Trump alone won in states that have strict voter ID requirements, as defined by the National Conference of State Legislatures, but he also won in states with looser laws. And claims that Harris exclusively won states without voter ID requirements flatten the nuances of the voter ID debate, ignoring state and federal laws to verify voters’ identity before they can vote in person or mail a ballot.\n\nVoter ID laws across the country are not one-size-fits-all.\n\nAccording to the National Conference of State Legislatures, 36 statesrequest or require votersto show some form of ID at the polls. The remaining 14 states and Washington, D.C., require no form of identification to vote at the polls butuse other methods to verify voters’ identities, such as matching voters’ signatures or asking voters for personal information. And federal lawrequires first-time voters to show IDwhen requesting mail ballots, while some states have additional ID requirements for voters mailing in ballots.\n\nAs we’vereported, among the 36 states that do request or require some form of identification to vote in person, the laws vary widely as to whether they are strictly applied or whether a photo ID or another form of identification is accepted.\n\nTen of those states have strict photo ID laws. Voters who lack acceptable photo IDs must vote a provisional ballot and take additional steps to verify their identity after Election Day for their ballot to be counted.\n\nThree of those states accept other forms of identification. In Arizona, for example, a recent utility bill or bank statement is acceptable as ID.\n\nIn the other 23 states, voters without acceptable identification can cast a regular ballot without having to act further after Election Day. That means a voter without proper identification may sign an affidavit or poll workers may vouch for a voter’s identity.\n\nAs for mail ballots, states have different laws and procedures for verifying the identity of voters who don’t vote in person. In 22 states, voters applying for a mail ballot must show ID, provide an ID number, such as from a driver’s license, or obtain a witness or notary signature, according to theVoting Rights Lab, an organization tracking state election laws and proposed legislation. In 21 other states, voters requesting mail ballots must verify their identity using personal information, such as date of birth. The remaining seven states and Washington, D.C., have universal mail voting, so ballots are automatically sent to voters ahead of every election, without voters needing to request them.\n\nElection officials in every stateuse signature verificationto validate the identities of voters who cast mail ballots, the National Vote at Home Institute said.\n\nComparing states Harris, Trump won and voter ID laws\n\nNext, let’s comparethe states Harris and Trump wonwith their voter identification laws.\n\nHarris won: California, Colorado, Connecticut, Delaware, Hawaii, Illinois, Maine, Maryland, Massachusetts, Minnesota, , New Hampshire, New Jersey, New Mexico, New York, Rhode Island,  Vermont, Virginia, and Washington, D.C. and Washington state.\n\nSome of the states Harris won don’t require documents to vote. Oregon, for example,mails a ballotto registered voters before Election Day, but it verifies voters’ identities when they register usingan acceptable form of identificationincluding a driver’s license, valid photo ID or Social Security number.\n\nBut other states Harris won do ask for identification: Washington, Colorado, Connecticut. Delaware, New Hampshire and Rhode Island.\n\nIn Washington state, identification is requested but the state holds all elections by mail, \"so this provision impacts few voters,\" the National Conference of State Legislatures said. Colorado similarly holds elections by mail and requests ID, so its law affects in-person Election Day voters.\n\nPhoto ID is requested in Rhode Island, according to the group, and if voters don’t have one, they must vote on a provisional ballot and then election officials match their signatures against the signatures on record.\n\nPhoto ID isn’t required in Connecticut, but identification is requested. If it’s not presented, voters must give their name, date of birth and address and sign under penalty of making a false statement.\n\nIn New Hampshire, a voter without identification must sign a challenged voter affidavit. After the election, a mailing is sent and the voter must sign and return it or risk a voter fraud investigation.\n\nThe National Conference of State Legislatures slots states into five categories in its analysis of voter ID laws across the country: strict photo ID, strict non-photo ID, photo ID requested, ID requested; photo not required, and no document required to vote.\n\nTrump alone won states with strict voter ID laws, but he also won states in which photo ID and non-photo ID are requested, and two states in which no documents are required.\n\nAlthough efforts to tighten identification requirements for voting have been underway for about two decades, they accelerated after the 2020 election, when Republican lawmakers sympathetic to Trump’s false claims of voter fraudpushed for tighter voter ID requirementsto combat fraud. So, it’s unsurprising that states that have stricter laws voted for the Republican presidential candidate.\n\nNational experts, meanwhile, have said such fraud isisolated and rare.Democrats and voting rights advocates have criticized some state voter ID laws, particularly ones with narrow lists of acceptable types of ID, as overly burdensome.\n\nThe Instagram post said, \"Every state that does not require voter ID, Kamala won.\"\n\nIt’s not true that only Trump won states with voter ID laws while Harris won every state without.\n\nTrump won the nine states that the National Conference of State Legislatures says have strict photo ID laws, and he won the three states the group says have strict non-photo ID laws.\n\nHe also won 11 of the states in which photo ID is requested; Harris won one such state.\n\nTrump and Harris each won six states in which some form of identification is requested.\n\nAnd Trump won two of the states the conference classifies as not requiring documents to vote; Harris won 12 such states.\n\nBut these classifications are shorthand for a variety of voter ID requirements and verifications process across the country, including verifying voters’ identities when they register to vote in states in which they automatically receive a mail ballot. Social media posts lumping Harris with states that purportedly don’t require identification and Trump with those that do lose that nuance.\n\nPolitiFact,No ID required to vote? That’s not the case for most voters, March 20, 2024\n\nPolitiFact,As extremes shape voter ID debate, the rules keep getting stricter, Aug. 9, 2021\n\nOregon Secretary of State,Voting in Oregon, visited Nov. 12, 2024\n\nThe New York Times,Presidential Election Results: Trump Wins, visited Nov. 11, 2024\n\nNational Conference of State Legislatures,Voter ID laws, visited Nov. 11, 2024\n\nIn a world of wild talk and fake news, help us stand up for the facts.\n\nDistrict of Columbia1800 I Street NWWashington, DC20006\n\nFlorida801 3rd St. SSt. Petersburg, FL33701727-821-9494",
        "source_2": "Social media users suggest falsely that she won every state in which voters do not need identification.\n\nDonald Trump won the 2024 election, but that has not stopped right-wing media outlets and social media users from making misleading claims about election integrity.\n\nLast Thursday, Newsmax host Carl Higbieaireda map showing the states that Vice President Kamala Harris won and highlighted that nearly all of them do not require voters to present identification. “I find it funny that almost all the states that Harris won don’t require photo ID,” Higbie said. “Wow, wow. It’s almost like where it’s easier to cheat, the cheaters win. I never would have thought,” Shawn Farash, a right-wing internet podcaster who joined Higbie on-air, reacted. “I never would have thought.”\n\nOn Sunday, Elon Musktweeted outan image of the Newsmaxmap. “Must be a coincidence,” he wrote, along with an eye-roll emoji. “Dear President-elect Trump,” Hollywood actor James Woodsalso tweetedwith the image. “We need government issued FREE photo ID required for all federal elections. This must be enacted, or we will be right back in the socialist hell you just saved us from.”\n\nThe Newsmax map shows Harris winning two states that require photo ID, New Hampshire and Rhode Island. That has not stopped social media users from claiming that Harris won only states with no voter ID laws, nor from saying that she won every state with no photo ID. Neither claim is true.\n\n“Harris won the states with no voter ID requirements,” one X user, Dennis Michael Lynch—a self-described “unapologetic truth teller”—tweeted Sundaywith the Newsmax map. “Democrats won every NO ID REQUIRED state,” another X usertweeted withthe image. “Democrats win the States without Voter ID,”tweeted anotherX user, “Publius,” to his more than 60,000 followers.\n\nIn reality, Harris won some states that do require photo ID, and Trump won some that did not.\n\nIn total, 26 states do notrequire a photo ID in orderto vote. Of those, 15 do not require any ID and 11 require some form of non-photo identification. Harris won 13 of the 15 states that have no ID requirement, and won four of the 11 states that require non-photo identification. Meanwhile, Trump won two of the 15 states that require no ID whatsoever—Nevada and Pennsylvania—and won seven of the 11 states that accept non-photo IDs, including Arizona, Iowa, and West Virginia.\n\nIf you have a claim you would like to see us fact check, please send us an email atfactcheck@thedispatch.com. If you would like to suggest a correction to this piece or any otherDispatcharticle, please emailcorrections@thedispatch.com.\n\nPeter Gattuso is a  fact check reporter for The Dispatch, based in Washington, D.C. Prior to joining the company in 2024, he interned at The Dispatch, National Review, the Cato Institute, and the Competitive Enterprise Institute. When Peter is not fact-checking, he is probably watching baseball, listening to music on vinyl records, or discussing the Jones Act.",
        "source_3": "Of the 19 states won by Vice President Kamala Harris during the 2024 presidential election, 18 of them don’t require voters to show photo identification to vote, according to a National Conference of State Legislatures (NCSL) review of laws in effect as of April 2024.\n\nThirty-six of the 50 states in the U.S. require voters to provide some form of identification to cast a ballot,accordingto the NCSL. Of these, 12 do not require a photo ID.\n\nOf the 19 statesHarriswon, 12 — California, Oregon, New Mexico, Minnesota, Illinois, Maine, Vermont, Massachusetts, New York, New Jersey, Hawaii and Maryland — require no document to vote, according to the NCSL.\n\nThe Conference lists five of the other seven states Harris won as states where ID is requested, but “photo not required.” Those states are Colorado, Washington, Delaware, Connecticut and Virginia.\n\nColoradoand Washington hold all elections by mail, so their limited ID laws only affect in-person voters, according to the Conference.\n\nIn many states, voters without ID may sign an affidavit affirming their identity before being allowed to cast a provisional ballot. They would often need to return with photo ID to allow their provisional ballot to be cast. In Delaware, Connecticut and Virginia, however, voters may sign such an affidavit and cast a regular ballot, according to the Conference.\n\nNew Hampshire, which Harris also won, has a similar provision allowing voters with no ID to cast a normal ballot; however, they have a more intense follow-up process to protect against fraud. A New Hampshire voter without an ID must sign a “challenged voter affidavit” before they can cast a ballot.\n\n“After the election a mailing is sent and the voter must sign and return it; if it is not returned, the voter will be investigated for voter fraud,” according to the Conference.(RELATED: Court Orders Swing State To Release List Of Over 200,000 Registered Voters Who Did Not Provide Proof Of Citizenship)\n\nRhode Island is the only state Harris won in which a voter without an ID cannot cast a regular ballot. A Rhode Island voter with no ID can cast a provisional ballot, at which point election officials will match their signature to a signature on record, according to the Conference.\n\nThe only states in which no ID is required to vote that Harris lost are Nevada and Pennsylvania. Donald Trump also emerged victorious in Iowa, Oklahoma, Kentucky and Utah, states that merely request an ID to vote, though it is not required.\n\nPennsylvania enacted a strict voter ID law in 2012, but the state’s supreme court struck it down.\n\nDuring the 2024 election, Nevada voterssaid yesto the state’s Question 7, which would require the state’s voters to present photo ID to cast a ballot.\n\nEditor’s note: This report has been updated to reflect the date of the NCSL review and to note states not requiring voter ID that Donald Trump won."
    }
}