{
    "question": "What are the practical and legal implications of the Texas federal judge’s decision to block the Biden administration’s overtime pay rule (raising the salary threshold from nearly $35,000 to nearly $44,000), and how could a potential appeal and uncertainty over whether Trump will defend the rule shape outcomes for workers and employers?",
    "content": {
        "source_1": "On Friday a federal judge in Texas struck down a new rule from the Biden administration aimed atextending overtime protections to millions of workers.\n\nJudge Sean D. Jordan of the U.S. District Court for the Eastern District of Texasruledthat the Labor Department went beyond its authority in issuing the regulation earlier this year. He granted summary judgment to the state of Texas, which had sued to stop the rule from taking effect.\n\nThe overtime rule is one of the furthest-reaching economic reforms that President Joe Biden has pursued unilaterally through the federal rulemaking process. It would dramatically expand the share of workers who are entitled to time-and-a-half pay when they work more than 40 hours in a week.\n\nBut thanks to court battles like the one in Texas, the regulation’sfuture was in doubteven beforeDonald Trump, who has broadly promised to undo Biden’s agenda, won the presidential election.\n\nJordan, who Trump nominated to the bench in 2019 during his first term in the White House, had temporarily blocked the overtime rule from moving forward in Texas in June. His latest order halts the regulation across the country, leaving the current, stricter overtime rules intact.\n\nA Labor Department spokesperson did not immediately comment on the agency’s plans for the rule.\n\nThe agency can appeal Jordan’s order in hopes of keeping the rule alive, but defending it will ultimately fall to the incoming Trump administration. A Trump campaign spokesperson had declined to say where Trump stands on the Biden rule when HuffPost asked in September.\n\nMost hourly workers are entitled to time-and-a-half pay when they work extra hours, but the rules are different for workers paid on salary. Biden is trying to raise what’s known as the overtime salary threshold, the level below which most salaried workers are automatically guaranteed overtime pay.\n\nTrump had set the threshold at just $35,568 during his first term. Biden’s rule would push it to $58,656 next year, so that the threshold covers an estimated 4 million additional workers. The threshold would have been indexed to rise with inflation after that.\n\nLeading employer groups had come out strongly against the Biden rule, just as they did when former President Barack Obama tried to expand overtime protections to more workers. After all, raising the salary threshold would raise workers’ pay, and thus employers’ labor costs.\n\nFor two decades, HuffPost has been fearless, unflinching, and relentless in pursuit of the truth. Support our mission to keep us around for the next 20 — we can't do this without you.\n\nWe remain committed to providing you with the unflinching, fact-based journalism everyone deserves.\n\nThank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever.We hope you will join us once again.\n\nWe remain committed to providing you with the unflinching, fact-based journalism everyone deserves.\n\nThank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever.We hope you will join us once again.\n\nThe Associated Builders and Contractors, which represents the construction industry, was among the groups cheering Jordan’s decision to strike down the rule. It said workers would have lost out on the “flexibility” afforded to managers and others on salary who are exempted from the law.\n\n“This would have disrupted the construction industry, specifically harming small businesses, restricting employee workplace flexibility in setting schedules and hours, and hurting career advancement opportunities,” Ben Brubeck, the group’s vice president for regulatory and labor affairs, said in a statement.\n\nBy entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to ourTerms of ServiceandPrivacy Policy.",
        "source_2": "A federal judge in Texas entirely eliminated a rule from President Joe Biden’s administration that expanded overtime protections for workers by requiring employers to pay overtime premiums to more salaried people,multipleoutletsreported, eliminating one of the highest-profile Labor Department rules enacted during the Biden administration.\n\nJudge Sean D. Jordan in the U.S. District Court for the Eastern District of Texas—who was appointed by President-elect Donald Trump in his first term—said the Labor Department went beyond its authority when implementing the rule.\n\nThe rule had the potential to make about 4 million more salaried workers eligible for overtime pay, the Labor Department said.\n\nThefirst phase of the rulewent into effect on July 1 and raised the salary threshold to be eligible for overtime from around $35,000 to almost $44,000, and the next increase—which would have gone into effect next year—would have raised it to nearly $59,000.\n\nThe law alsomandatedthat, beginning on July 1, 2027, the minimum threshold for overtime would increase every three years.\n\nReutersreported the threshold for overtime eligibility will now revert back to $35,500, which is what it was set at in 2019 under Trump.\n\nGet Forbes Breaking News Text Alerts:We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to(201) 335-0739or sign uphere.\n\n“The 2024 Rule impacts millions of employees in every facet of the economy, as well as state and local governments, and will impose billions in costs to employers. And considering the volume and variety of the trade organizations’ members who are entitled to relief, it would be impractical, if not impossible, to fashion party-tailored relief here,” Jordan wrote in the ruling declaring the entire rule be vacated.\n\nThe rule was one of Biden’s most notable labor-focused efforts during his time in office, though it faced legal challenges in Texas and District of Columbia federal courts, according toBloomberg. The Texas argument that Jordan ruled in favor of Friday was brought by the state of Texas and businesses, arguing the rule “injures them by forcing them to pay overtime to newly nonexempt employees or limit the hours that those employees work, thereby foregoing their services.” Biden had made raising the threshold for people eligible for overtime pay a project of his when he was vice president under President Barack Obama,announcing in 2016the administration intended to increase it from around $23,000 to nearly $47,500. That met legal challenges, though, and the threshold stayed at $23,000 until Trump raised it in 2019. At the time this rule was passed, Acting Labor Secretary Julie Su said in apress releasethat it would “restore the promise to workers that if you work more than 40 hours in a week, you should be paid more for that time.”\n\nIf the Labor Department appeals. Reuters reported the department can try to get the rule reinstated, but the Trump administration may opt not to. Trump has not yet named who he will nominate to lead the Labor Department.",
        "source_3": "Employers and workers may not realize it, but they just dodged a bullet.\n\nThey can thank a federal judge in Texas who just tossed out a Biden administration rule that tried to raise the salary threshold for overtime pay by 65%, from $35,568 to $58,656 per year (a range that includes about 12 million workers). That new threshold would have exceeded the earnings of more than 70% of workers in lower-cost states such as Arkansas, Mississippi, South Dakota and West Virginia.\n\nThe same thing happened in 2017, when a federal judge in Texas tossed out a virtually identical overtime rule from the Obama administration. In each case, the court ruled that the Department of Labor overstepped its authority by violating Congress’ intent for overtime exemptions to be based on workers’ duties — not just their salaries.\n\nThis is an obvious relief for employers, which were facing the prospect of having to increase millions of workers’ pay by as much as 65%.\n\nIt’s a less obvious relief for workers and consumers. That’s because, despite the Biden administration’s promotion of the rule as raising pay fpr millions of workers, the rule’s costly mandates would have unleashed a host of unintended consequences.\n\nThe overtime salary threshold is the minimum amount employers must pay their salaried employees for them to be exempt from overtime rules. Overtime rules require employers to pay workers 1.5 times their usual pay for any hours over 40 that they work in a week. (Employees must also, first and foremost, meet a duties test — performing sufficiently self-directed work — to be considered exempt from overtime pay.)\n\nThe Department of Labor estimated that its rule — which was established in April and went into effect with a partial increase in the threshold to $43,888 on July 1 — would affect over 4 million workers, either increasing their base salaries or providing added overtime pay.\n\nBut businesses aren’t bottomless money pits. Just as a family facing a 65% increase in their rent or mortgage would have to make significant changes in their spending, employers facing large payroll cost increases were preparing for significant changes to their operations.\n\nThe most obvious change would be for employers to raise their prices to cover higher payroll costs. But with inflation having significantly squeezed families’ budgets, employers may have avoided price increases by eliminating jobs, automating job functions and shifting more work to salaried employees. A study of recent changes to overtime rules in the U.S. found a 3-to-1 ratio of employment losses to income gains and an increase in inequality.\n\nAnother unintended consequence of more mandated overtime would be employers keeping total compensation costs constant by reducing workers’ hours or eliminating workplace benefits such as health insurance or retirement contributions.\n\nAnd many employers would have responded to the rule by converting millions of workers from salaried employees into hourly employees. That could have resulted in smaller, less consistent paychecks because workers’ hours often vary from week to week, and whereas a salaried employee would still receive a full paycheck in cases of having to leave early to pick up a sick child, an hourly employee would get a smaller paycheck.\n\nMoreover, hourly employees often lack the autonomy and flexibility of salaried employees because complying with overtime laws requires that employers closely track and restrict workers’ hours.\n\nThat usually means prohibiting remote work — which can’t be easily tracked — and prohibiting autonomy, like choosing to come in early or leave late, and prohibiting co-workers from switching shifts because that could require overtime pay.\n\nWhile invalidating this rule prevents a host of unintended consequences, it doesn’t solve two problems: Workers’ pay has failed to keep pace with inflation in recent years, and government policies are imposing barriers to work and rising wages.\n\nInstead of costly new regulations, policymakers should allow new apprenticeship programs to begin, allow successful welfare-to-workforce programs to expand and allow workers to choose the type of work that works best for them.\n\nRachel Greszler is a senior research fellow in workforce and public finance at the Roe Institute for Economic Policy Studies at The Heritage Foundation.\n\nCopyright © 2025 The Washington Times, LLC.Click\n                            here for reprint permission.\n\nPope Leo should tell Catholics: Marry young, have many children\n\nTrump’s TikTok delays undermine his China hawks while Intel controversy grows"
    }
}