{
    "question": "What are the potential implications for U.S. media and communications policy of President-elect Donald Trump appointing Brendan Carr—who has criticized perceived anti-conservative bias—to lead the FCC?",
    "content": {
        "source_1": "President-elect Donald Trump’s pick for chairman of the Federal Communications Commission, Brendan Carr, wasted no time in stating his priorities on Sunday night. Just one hour after thanking the president for the appointment, Carr wrote on X, “We must dismantle the censorship cartel and restore free speech rights for everyday Americans.”\n\nCarr and Trump’s powerful ally Elon Musk immediately replied with one word of affirmation: “Based.”\n\nThe comments from Carr, whowrote the chapteron the FCC in the conservative blueprint Project 2025, signaled that it won’t be business-as-usual at the country’s communications regulatory agency. Past chairs of the agency, both Republicans and Democrats, have emphasized broadband internet deployment and wireless spectrum policy. Carr didn’t mention those issues on Sunday night.\n\nInstead, he took aim at technology companies for “censorship;” promised to hold broadcast TV and radio stations accountable; and pledged to end the FCC’s promotion of diversity, equity, and inclusion efforts.\n\nCarr was very clearly channeling the president-elect, who raised all three topics on the campaign trail, often in misleading ways.\n\nTrump appointed Carr to the FCC in 2017. Carr is now the senior Republican at the agency, which meant he was widely expected to get the chairman appointment.\n\nHe also has a close relationship with Musk (some of it has been visible in their interactions on X) and has accused Democrats of waging “regulatory lawfare” against Musk’s Starlink satellite internet service.\n\nAs chairman, Carr may be able to steer generous federal subsidies to Starlink. When Politicopublished a storytitled “the DC bureaucrat who could deliver billions to Elon Musk” last month, Carr told the outlet that he would be an even-handed regulator.\n\nMusk celebrated Carr’s appointment on X on Sunday night. Both men talk in much the same way about free speech rights, reflecting widespread concerns on the right about online censorship. (Trump called Carr “a warrior for Free Speech” in the press release about his appointment.)\n\nClaims of conservative censorship erupted several years ago as a result of content moderation decisions by social media platforms like Facebook and Twitter. Officials at the platforms said they were acting in good faith to reduce some of the toxicity – like election lies and Covid pandemic conspiracy theories – that turned off many users. Conservatives charged that the platforms were unfairly silencing their views – factoring into Musk’s decision to buy Twitter and turn it into X.\n\nCarr advanced this belief in a recent letter to the CEOs of Meta, Alphabet, Microsoft, and Apple. He predicted that the Trump administration and Congress “will take broad ranging actions to restore” Americans’ First Amendment rights, “and those actions can include both a review of your companies’ activities as well as third-party organizations and groups that have acted to curtail those rights.”\n\nThe letter singled out NewsGuard, a startup that rates the reliability of news websites. NewsGuard said Carr was ill-informed: “Every statement in the letter about NewsGuard is false, citing unreliable sources.”\n\nThese battles are sure to continue once Carr becomes chairman, but they may be more in words than deeds. The FCC does not have any meaningful oversight of tech platforms like Google, and it would probably take an act of Congress to change that.\n\nIn his Project 2025 chapter, Carr laid out an agenda for the federal agency under a future Trump administration.  The agency’s top priorities, he wrote, should be “reining in Big Tech, promoting national security, unleashing economic prosperity, and ensuring FCC accountability and good governance.”\n\nIn the chapter, Carr also asserted that the Chinese social media platform TikTok “poses a serious and unacceptable risk to America’s national security” and should be banned. Carr’s years-long crusade against TikTok paralleled Trump’s calls, although Trump reversed his position on TikTok earlier this year.\n\nCarr has also supportedthe rollbackof net neutrality rules and called for “legislation that scraps” Section 230 of the Communications Decency Act, which gives immunity to tech platforms that moderate user-generated content.\n\n“Congress should do so by ensuring that Internet companies no longer have carte blanche to censor protected speech while maintaining their Section 230 protections,” he wrote in Project 2025.\n\nThe FCC does have jurisdiction over local TV and radio licenses. During his reelection campaign, Trump called for every major American TV news network to be punished, often because of interview questions he disliked or programming he detested. He repeatedly said that certain licenses should be revoked – usually while misstating how the licensing process actually works.\n\nThe FCC grants eight-year license terms and hasn’t denied any license renewal in decades. But Carr indicated earlier this month that he would take Trump’s complaints seriously. And he wrote on X Sunday night that “broadcast media have had the privilege of using a scarce and valuable public resource — our airwaves. In turn, they are required by law to operate in the public interest.” As chairman, he added, “the FCC will enforce this public interest obligation.”\n\nHistorically, the FCC has enforced this obligation by having stations file pro forma quarterly reports. Stations typically identify their local news coverage or public affairs programming.\n\nThe media reform group Free Press, which opposes Carr, said in a statement that “Carr doesn’t care about protecting the public interest; he got this job because he will carry out Trump and Musk’s personal vendettas.”\n\nHis appointment was met with praise by others, however. Gigi Sohn, a lawyer who worked for the FCC under Democratic chairman Tom Wheeler, wrote on X, “We may not agree on everything (or much of anything!), but he is highly qualified and a good guy.”\n\nMost of all, he is aligning with Trump’s stated concerns. The FCC chairman during Trump’s first term in office, Ajit Pai, had a very different set of priorities. Upon departing the FCC, Pai cited accomplishments like “narrowing the digital divide” and “advancing American leadership in 5G.” Similarly, the current chair Jessica Rosenworcel, a Democrat, has emphasized what she called the “homework gap,” referring to students who can’t get online.",
        "source_2": "US President-elect Donald Trump has named \"big tech\" critic Brendan Carr to lead the US communications regulator, after he takes office in January 2025.\n\nCarr has attacked what he sees as the censorship of conservative viewpoints by top social media firms other than X, a site owned by his ally and fellow Trump backer, Elon Musk.\n\nHe authored a chapter of Project 2025 - a \"wish list\" for a second Trump presidency by the conservative Heritage Foundation. Trump has distanced himself from the document.\n\nAnnouncing Carr's promotion to chairman of the Federal Communications Commission (FCC), an agency on which he has served for years, Trump called him a \"warrior for free speech\".\n\nThe president-elect also said his appointee had \"fought against the regulatory lawfare that has stifled Americans’ freedoms, and held back our economy\".\n\nWriting on X, Carr said he was \"humbled and honoured\" to take the role, and would set about his plan to \"dismantle the censorship cartel\".\n\nTrump's top team is now largely in place ahead of his inauguration on 20 January, although some roles - including Carr's - will require approval from members of the US Senate.\n\nCertain picks have proven contentious and may face obstacles.\n\nCarr already served as the senior Republican of the FCC, an independent agency overseen by Congress that regulates TV, radio and broadband internet access.\n\nHe has been nominated for his previous roles by both Trump, during his first presidency, and Joe Biden, the current president.\n\nCarr is a lawyer by training. A long-time establishment Republican, in recent years he has embraced Trump's priorities and emerged as a supporter of regulation of big tech.\n\nHis chapter in Project 2025 makes a range of policy proposals - including \"reining in\" firms including Google and Facebook with transparency rules, improving rural broadband, and toughening up the stance to TikTok, which has a Chinese parent company.\n\nDuring the campaign, Trump has previously vowed to strip the licenses of TV channels that he considered to be biased.\n\nNorth America correspondent Anthony Zurcher makes sense of the presidential election in his twice weekly US Election Unspun newsletter. Readers in the UK cansign up here. Those outside the UK cansign up here.\n\nThe BBC’s Nomia Iqbal speaks to voters in Philadelphia, where the tech billionaire campaigned for the president and even gave away a few $1m cheques.\n\nThe former US president says he has no regrets over his late withdrawal in the contest against Donald Trump.\n\nAged just 10 when his father first became president, he's now well over six feet tall, and goes to New York University.\n\nThe US president spoke about his plans for the second Trump administration, as well as criticising the 'corrupt establishment'.\n\nWatch the historic moment when the 45th president is returned to power as he takes the oath of office.\n\nElon Musk, Mark Zuckerberg and Jeff Bezos were among those invited inside the Capitol for Donald Trump's swearing in.\n\nThousands of people joined in on demonstrations as the United States prepares to inaugurate its new president.\n\nThe outgoing US president warned against power in the hands of the wealthy, the threat of the tech industry and climate change.\n\nTrump's pick for US attorney general was pressed on claims of election fraud and pardons for January 6 rioters.\n\nDonald Trump's defence secretary nominee was asked about his stance on women in combat and his alleged excessive drinking.\n\nHarris, who Trump defeated in the 2024 election, presided over the event as required by the US Constitution.\n\nAmong the allies the president-elect has chosen to join his administration are contentious figures, including among fellow Republicans.\n\nThe president-elect has nominated RFK to lead the Department of Health and Human Services.\n\nThe suspect used an “improvised incendiary device” to start the fire in Portland, Oregon, ahead of the US election.\n\nA week after losing the election, Kamala Harris's team are still appealing for funds.\n\nRepublicans have won control of both chambers of Congress, yielding Trump limited congressional oversight for at least 2 years.\n\nThe president and president-elect shook hands as part of a long-standing tradition signifying the transfer of power.\n\nGiven all the things they’ve said about each other, Joe Biden and Donald Trump’s meeting could be really awkward.\n\n'I think Putin believes that he knows how to play Trump', says Trump's former adviser John Bolton.\n\nThe Russian president says he was impressed by Trump's reaction to the first assassination attempt against him.\n\nThe accused says his attorneys were not answering his questions and that they were \"a million miles apart\".\n\nJoe Biden's son directs expletive-filled accusations at the Hollywood actor for his part in the former president quitting the campaign.\n\nThe BBC’s Nomia Iqbal speaks to voters in Philadelphia, where the tech billionaire campaigned for the president and even gave away a few $1m cheques.\n\nTasked with reducing government spending and cutting jobs, the agency has faced legal challenges.\n\nThe former US president says he has no regrets over his late withdrawal in the contest against Donald Trump.",
        "source_3": "Former Trump White House chief of Staff Reince Priebus told ABC's \"Good Morning America\" on Wednesday that former President Trump has a \"massive\" mandate to enact his agenda.\n\nPresident-elect Trumpannounced on Sunday that he has picked Brendan Carr to serve as Chairman of the Federal Communications Commission (FCC) starting in January.\n\nCarr, who is currently the senior Republican member of the FCC, was first nominated to the commission by Trump in 2017. In a statement released on Sunday night, Trump commended Carr and noted that he had \"been confirmed unanimously by the United States Senate three times.\"\n\n\"His current term runs through 2029 and, because of his great work, I will now be designating him as permanent Chairman,\" Trump wrote.\n\nThe Republican leader went on to call Carr \"a warrior for Free Speech\" who has \"fought against the regulatory Lawfare that has stifled Americans’ Freedoms, and held back our Economy.\"\n\nTRUMP APPOINTS TULSI GABBARD AS DIRECTOR OF NATIONAL INTELLIGENCE: 'FEARLESS SPIRIT'\n\nTrump commended Brendan Carr's \"great work\" in a statement on Sunday evening.(Getty Images)\n\n\"He will end the regulatory onslaught that has been crippling America’s Job Creators and Innovators, and ensure that the FCC delivers for rural America,\" Trump added.\n\n\"Congratulations to Chairman Brendan Carr on a job well done,\" the president-elect's statement concluded. \"Lead us into a great future, Brendan!\"\n\nIn an X post on Sunday, Carr thanked Trump and wrote that he is \"humbled and honored to serve as Chairman of the FCC.\"\n\nCarr recently made national headlines after he ripped the \"Saturday Night Live\" cast forplatforming Kamala Harrisas a guest without inviting Trump, which violates FCC rules.\n\nHERE ARE THE MOST TALKED-ABOUT CANDIDATES FOR TOP POSTS IN TRUMP'S ADMINISTRATION\n\nCommissioner of the Federal Communications Commission Brendan Carr speaks during the 2024 Conservative Political Action Conference (CPAC) in National Harbor, Maryland, United States on February 24, 2024.(Celal Gunes/Anadolu via Getty Images)\n\n\"NBC has structured this in a way that's plainly designed to evade the FCC's rules,\" the official said shortly after the episode aired. \"We're talking 50 hours before Election Day starts, without any notice to other candidates, as far as I can tell.\"\n\nCarr latertold Fox News Digitalthat the Harris appearance \"[made] clear that [\"SNL\"] wanted to weigh-in in favor of one candidate before the election.\"\n\n\"That's exactly why, for decades, we've had an equal time rule on the book, is to prevent that,\" the Republican explained. \"Because remember, broadcasters are placed in a special position of trust. They're not just like any other person with a soapbox on the corner. They have a license from the federal government that obligates them to operate in the public interest.\"\n\nBrendan Carr, commissioner at the Federal Communications Commission (FCC), speaks during a Senate Commerce, Science and Transportation Committee hearing in Washington, D.C., U.S., on Wednesday, June 24, 2020.(Alex Wong/Getty Images/Bloomberg via Getty Images)\n\nEarlier in November, the Fraternal Order of Police (FOP)urged Trumpto appoint Carr as the next FCC chairman, calling him a \"great partner to the men and women in law enforcement.\"\n\n\"Commissioner Carr has more than 20 years of private and public sector expertise in communications and technology policy as well as a deep institutional knowledge of the FCC,\" Patrick Yoes, national president of the FOP, wrote in a letter. \"He would make an outstanding FCC Chairman who will ensure the United States continues to lead the world in telecommunications advancements and innovations.\"\n\nFox News Digital's Emma Colton and Eric Revell contributed to this report.\n\nAndrea Margolis is a lifestyle writer for Fox News Digital and Fox Business. Readers can follow her on X at@andreamargsor send story tips toandrea.margolis@fox.com.\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox"
    }
}