{
    "question": "How should the boundaries of protected political speech be evaluated in the Trump and Harris ads described, given the “actual malice” standard for defamation, the need to prove falsity, and the FCC’s lack of a pre-approval role in political advertising?",
    "content": {
        "source_1": "We've all seen alotof political ads lately. But in battleground states, it's a tsunami. Jack Levis is an independent voter in Bucks County, Pennsylvania, which makes him one of the most desirable voters on the planet: \"Emails, texts, phone calls, it's in my news feed, it's in social media. In the last two days, I counted, I had 30 spam emails in there all about the election,\" he said. \"It's unbelievable.\"\n\nNot to mention TV and radio commercials. \"Come on, it's everywhere!\" he laughed. \"Are you kidding me? Ad after ad after ad!\"\n\nErica Franklin Fowler, co-director of theWesleyan Media Project, which tracks campaign advertising, and co-author of\"Political Advertising in the United States,\"says she actually enjoys watching political ads. But, she adds, \"I will first apologize to all of the residents of battleground states, because I feel their pain.\"\n\nAsked if political ads actually convince anybody, Fowler said, \"Political advertising does not have the sort of massive influence that sometimes citizens think that it does. Political advertising really only matters at the margin. That doesn't mean the margin doesn't matter, right? The margin in this competitive election cycle is going to be the difference between making it into the White House and not.\"\n\nAnd what about negative versus positive messages? \"There's no doubt that negativity is more memorable,\" she said. \"It is more emotion-provoking.\"\n\nWe may hate those attack ads, but Fowler says the positive ones don't say much. \"Citizens hate negativity,\" Fowler said. \"Negative ads tend to be more policy-based, more issue-focused, and those details actually are very important for citizens who don't otherwise pay a lot of attention to politics.\"\n\nIt used to be that we all saw the same ads. In 1964, Lyndon Johnson's \"Daisy\" commercial implied that his opponent, Barry Goldwater, would launch a nuclear war; and in 1988, George W. Bush's infamous \"Willie Horton\" ad made his opponent, Michael Dukakis, look dangerously soft on crime.\n\nBut these days, you and I won't see thesamemessages. It's not just three TV channels anymore. According to Tiffany Rolfe, chief creative officer at the ad agencyR/GA, \"Everything has become a media channel, in a way.\"\n\nShe says that targeting ads towardsindividualvoters, by location or demographic details, through social media has become an incredibly precise science. \"The way they can target is, I think, mind-blowing,\" she said. \"Like, some of these are one-to-one ads.\"\n\nSome ads and memes on social media were created not by the candidates, but by their supporters. For example, Taylor Swift posted a picture of herself as a \"childless cat lady\" in support of Kamala Harris; the post was then reposted and reshared. \"You have people now that have access to creative tools that can put an AI version of Trump on a lion,\" she noted.\n\nSo, both candidates are now using all their fans as ad agencies? \"Yeah, I mean, that's our competition out there!\" Rolfe laughed.\n\nMichael Waldman, president and CEO of the nonpartisanBrennan Center for Justice, said, \"People make their own videos. People do memes. People make their own ads. That's a good thing. That's more participation. What's a problem is when some very wealthy individual or interest puts tens of millions of dollars into these ads that are sometimes manipulative, and we don't know they're doing it.\"\n\nSpending on political ads this year has broken all records: about $16 billion, according toOpenSecrets. And Waldman's concern is not knowing where all that money is comingfrom: \"This is now a Wild West of front groups and hidden spenders reaching people on their phones, targeted very directly to somebody's likes and dislikes,\" he said.\n\nIn 2010 the Supreme Court handed down the Citizens United decision. That and subsequent cases removed all limits on what corporations and billionaires can spend on political campaigns. \"It struck down a century of campaign finance law,\" Waldman said. \"Now, politicians know who's giving; the donors know who's giving. The only people who don't know who's giving is the taxpayers.\"\n\nHe said there was legislation that came very close to enactment in the last Congress that would require the disclosure of who gave the money. \"That would make a big difference,\" Waldman said.\n\nCould it happen? \"Voters really care about this – Democrats, Independents, Republicans really care about it,\" Waldman said. \"When people get mad enough, when people get organized enough, throughout history, our country has acted to improve our political system, and it can happen again.\"\n\nThe segmented messages, the ad targeting and the secret funding may all be new, but if you ask Tiffany Rolfe, some things will never change: \"At the end of the day, it's not just the policies or the product features. It really is, like,Is this person for me? Do I like this person? Do I believe them?And I think, no matter what, that will not change.\"\n\nAs for Pennsylvania voter Jack Levis, there was one question left: Has he voted? \"Mailing it today,\" he replied. \"So, it's decided!\"\n\nStory produced by Gabriel Falcon. Editor: Remington Korper.\n\nDavid Pogue is a six-time Emmy winner for his stories on \"CBS Sunday Morning,\" where he's been a correspondent since 2002. Pogue hosts the CBS News podcast \"Unsung Science.\" He's also a New York Times bestselling author, a five-time TED speaker, and host of 20 NOVA science specials on PBS. For 13 years, he wrote a New York Times tech column every week - and for 10 years, a Scientific American column every month.",
        "source_2": "According toAdImpact, an advertising analytics firm that tracks political advertising, projects a record $10.2 billion will be spent across all races in 2024. This would be an over 13% increase from the $9.02 billion spent in the 2020 elections. With polls indicating a very close Presidential election, the biggest benefactors of this ad spending largesse are the local television stations in seven swing states: Pennsylvania, Michigan, Wisconsin, Georgia, North Carolina, Arizona and Nevada.\n\nA recent AdImpact report found that Democrats have spent $1.1 billion in television ads along with future reservations since Vice President Kamala Harris announced her presidential candidacy in July. At the same time, Republicans have spent $400 million. In the seven swing states alone, through October 8, $1 billion have been spent on Presidential campaign ads, on local TV stations, accounting for 79% of total television dollars. Looking ahead, the seven states will garner 88% of all future reservations with TV ad spend through Election Day.\n\nPreviously, from Super Tuesday (March 5) through July 21, $2.1 billion had been spent on the elections, with 74% of ad dollars being spent in the seven states. During that time the Democrats outspent the Republicans by a margin of $1.3 billion to $768 million.\n\nPrior to Super Tuesday, over $400 million had been spent on political ads. A large majority ($312 million) went to Republican candidates, $79 million from Democrats with $8.6 million from Independents. There were 14 candidates that spent at least $500,000 in political ads.\n\nAdImpact found from July 22 to October 8, Democrats had outspent Republicans in all seven swing states. Pennsylvania, the largest of the seven states with 19 electoral votes, also led in political ad spend at $279.3 million ($159.1 million spent by Democrats). In fact, Pennsylvania accounted for 21% of all aired Presidential TV ad spend. Michigan was second at $203.7 million, followed by Georgia at $144.8 million and Wisconsin at $127.7 million.\n\nSince Super Tuesday, AdImpact has tabulated 253 different broadcast TV political ads for President that aired 904,000 times. Among the top issues addressed by the Harris ads are taxation, healthcare, housing, abortion and crime. For the Trump campaign, the top political messages cover inflation, economy, housing, immigration and crime. Since Harris entered the race, the campaign has aired 138,000 more television ads than the Trump campaign.\n\nDigidayreports, the Harris campaign has also been outspending the Trump campaign on digital platforms. In one week, the Harris campaign spent $4.5 million on Meta’s platforms with another $700,000 for Vice Presidential candidate Time Walz. In contrast, the Trump campaign spent $517,000.BBC Verifysays the Harris Facebook page has 300+ ads targeting Pennsylvania voters while Trump has only 22.\n\nControl of Congress is also up for grabs. For the Senate, more than $2 billion in political ad dollars have or will be spent on local television. Looking at future reservations from October 11, there are seven swing states that will receive more than 82% of the total. Once again, Pennsylvania leads with $75.6 million. in reserved ad dollars ($45.6 million to be spent by the Republican candidate). In Ohio there are $68.4 million in reserved ad dollars. For the competitive Senate race in Montana there are $51.5 million in reserved ad dollars. The remaining Senate swing states are; Michigan ($33.6 million), Wisconsin ($30.8 million), Arizona ($29.0 million) and Nevada ($25.1 million).\n\nFor the House of Representatives, AdImpact reports $933 million in total ad spend and future reservations. Elections deemed as toss-ups account for $625 million of the total. Michigan’s seventh Congressional District has been the costliest in ad spending and reservations at $34 million. The average ad spend and future reservations in the 26 toss-up districts is $24 million.\n\nPolitical advertising is going beyond television and digital media.The New York Timesreports on Sunday, October 13, the Democratic National Committee had spent six figures on flyover ads over four NFL stadiums located in swing states; Green Bay, Las Vegas, Philadelphia and Carolina (Charlotte). The ads promoted Kamala Harris. Green Bay, Las Vegas and Carolina were also playing teams from other swing states (Arizona, Pittsburgh and Atlanta, respectively). As a result, among swing states, only Michigan (Detroit) was left out.\n\nIn an email, Tim Kay, VP of political strategy atAmpersandnoted, “Since the early 2000s, elections have focused on eight to ten swing states. Now, hyper-partisanship has narrowed that scope to less than 3% of registered voters in seven swing states. This is driving the tremendous ad spend on broadcast because television is still considered the best way to persuade an electorate. However, advertisers must consider that high saturation levels on the Designated Market Area (DMA) level does not have the same effectiveness in October as it may have in July. The increase in spend may create high clutter and oversaturation, resulting in low engagement and wasted ad dollars.\n\nThe remaining pool of voters are tuned out or not receiving mainstream political information making them hard to reach on local news. This is why political campaigns are migrating to cable, CTV, digital and fly-over banners. Nielsen Mediapoints outhow consumers are watching several channels beyond broadcast. At this point in the political cycle, campaigns need to expand networks to reach additional voters on networks relevant to them. With Congress and The White House on the line, political campaigns need to spend but must do it differently to reach that sliver of voters who ultimately will make the difference.”\n\nBIA Advisory Servicesalso released a political spending analysis which reported for the 2024 political cycle, $11.1 billion will be spent on advertising. This is an increase of 15.5% from the 2020 cycle and +24% over the 2022 midterm elections. BIA projects ad spend growth across most media channels including broadcast television, digital television, broadcast radio and OTT/CTV.\n\nOnce again, broadcast TV at $4.6 billion, will account for the largest amount of political ad dollars (when digital TV is included the figure is $4.9 billion). PC/Laptop is forecast to be $1.3 billion. With the continuation of cord-cutting, political ad dollars for cable television will be the only medium that will be lower than in 2020, by $183 million, totaling $1.1 billion. The largest growth will be from CTV which will increase from $74 million in 2020 to $1 billion in 2024. Broadcast radio is projected to grow by +16% reaching $536 million.\n\nWith a close election, television groups with local stations in swing states are benefiting from the increase and have been revising revenue forecasts upward. For example, Sinclair Broadcastingrecently increasedits political ad spending forecast for calendar year 2024. In August, Sinclair’s range had been from $385 million to $410 million, one month later the forecast increased to between $442 million and $469 million.",
        "source_3": "Gov. Ron DeSantis, R-Fla., discussed Amendment 4 in Florida during a press conference in Winter Garden, Fla., on Tuesday.\n\nA Florida judgeextended a temporary restraining order until after the election that blocks the state government from threatening to take legal action against television stations over pro-abortion ads.\n\nFloridians Protecting Freedom, the group behind the Amendment 4 Right to Abortion Initiative to enshrine abortion in the state constitution, which is on the ballot on Election Day, filed a lawsuit earlier this month against Florida Surgeon General Joseph Ladapo and former health department counsel John Wilson, following threats from the Florida Department of Health to TV stations overabortion ads aired.\n\nIn its letter, the health department stated the advertisements were \"false\" and \"dangerous\" and requested the ads be removed within 24 hours, or it would proceed with legal measures.\n\nDESANTIS CAMPAIGNS AGAINST HIGH-STAKES ABORTION MEASURE ON FLORIDA BALLOT: ‘BAIT AND SWITCH' LEGISLATION\n\nDistrict Judge Mark E. Walker initially granted the plaintiff's request for a temporary restraining order. The order was set to expire on Tuesday, but Walker extended it until Nov. 12 – one week after the election.\n\nAmendment 4's language states, \"No law shall prohibit, penalize, delay, or restrict abortion before viability or when necessary to protect the patient's health, as determined by the patient's healthcare provider.\"(Chandan Khanna/AFP via Getty Images)\n\n\"…this Court concludes that Plaintiff continues to have standing for the same reasons articulated in the temporary restraining order and that good cause exists to extend the temporary restraining order, because this Court requires additional time to review the arguments for and against the motion for preliminary injunction and to draft an Order on the motion,\" Walker wrote in the order.\n\nDESANTIS ADMIN BLOCKED FROM THREATENING TV STATIONS OVER PRO-ABORTION ADS\n\n\"While this case isn’t over, this second ruling is once again a critical victory for every Floridian who believes in democracy and the sanctity ofthe First Amendment,\" Lauren Brenzel, the group's campaign director, said in a statement. \"Once again, the court has affirmed what we’ve known all along: the government cannot silence the truth about Florida’s extreme abortion ban. It’s a deadly ban that puts women’s lives at risk. This ruling continues to remind us that Floridians will not back down in the face of government intimidation.\"\n\nThe order will expire on Nov. 12 or when the court enters an order on the plaintiff's motion for preliminary injunction.\n\nFloridians Protecting Freedom launched its suit against Florida Surgeon General Joseph Ladapo, left, and former general counsel to the Florida Department of Health John Wilson.(Joe Cavaretta/Sun Sentinel/Tribune News Service via Getty Images)\n\nAmendment 4's language states, \"No law shall prohibit, penalize, delay, or restrict abortion before viability or when necessary to protect the patient's health, as determined by the patient's healthcare provider.\"\n\nLEGENDARY NFL COACH TONY DUNGY SPEAKS OUT AGAINST LEGALIZING ABORTION IN FLORIDA\n\nIn its initial filing, Floridians Protecting Freedom argued that the state government's legal threats were a violation of Floridians Protecting Freedom's First Amendment right to runpolitical advertisementsin support of the proposed amendment.\n\nGov. Ron DeSantis spoke about Amendment 4 at the Grove Bible Chapel in Winter Garden, Florida, on Oct. 22, 2024.(WOFL)\n\nFlorida Gov. Ron DeSantiscalled the measure a \"bait and switch\" during a press conference in Winter Garden, days after the initial order was issued.\n\nFormer President Trump previously calledFlorida's proposed amendment \"radical\" in an interview with Fox News, but said he also believes Florida's six-week abortion restriction is too short.\n\nFox News Digital's Sarah Rumpf-Whitten contributed to this report.\n\nHaley Chi-Sing is a politics writer for Fox News Digital. You can reach her at @haleychising on X.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}