{
    "question": "What are the potential implications for democratic norms and public trust when the AP calls a race, one candidate claims victory and seeks Senate orientation access, and the other withholds concession pending the count of outstanding ballots?",
    "content": {
        "source_1": "Find this story in your account’s‘Saved for Later’section.\n\nRepublicans are set to take control of both chambers of Congress in January as President-electDonald Trumpreturns to the White House. But the extent of the party’s power in the U.S. Senate was unclear for weeks following the election due to the outstanding race in Pennsylvania. Initially, Democratic senator Bob Casey held off from conceding to his Republican challengerDave McCormickciting outstanding ballots, though several news outlets called the race in McCormick’s favor. But on November 21, Casey announced that he had called McCormick to officially concede after Pennsylvania completed its initial round of counting in its statewide recount. Here’s where the race stands.\n\nOn November 7, theAssociated Presscalled the race in favor of McCormick while other major news outlets like the New YorkTimesand CNN had yet to declare a winner. (The frequently reliableDecision Desk, however, has also deemed McCormick victorious.) Despite the AP’s call, Casey, the three-term senator, held off on conceding, citing the slim margin between him and McCormick and has been adamant about waiting for every vote to be counted.\n\n“Pennsylvania is where our democratic process was born. We must allow that process to play out and ensure that every vote that is eligible to be counted will be counted,” Caseysaidfollowing the AP’s call.\n\nInitially, the Casey campaign pointed to astatementfrom Al Schmidt, the state’s secretary of state, who said on November 7 that there were an estimated 100,000 ballots remaining to be processed. In addition to Election Day votes, the outstanding votes include provisional, military, and overseas ballots. In a November 11 press release, the campaign noted that provisional ballots “broke overwhelmingly” forJohn Fettermanin 2022 at a larger margin than Casey currently needs to overtake McCormick. Fetterman would later go on to win his Senate seat over his Republican challengerMehmet Oz.\n\nAccording toofficial state-election returns, McCormick leads Casey by a little more than 16,000 votes, a difference of less than a percentage point. The slim figure was enough to trigger a statewide recount of the race after Casey did not waive his right to the process. Notably, McCormick’s 2022 primary race against Oz also fell into recount territory, though it was not enough to change the results in his favor. Historically, recounts rarely change the outcomes in races, per a study fromFairVote.\n\nWith the tight margin, the campaigns have begun to fight over the few outstanding ballots remaining. On November 8, thePhiladelphiaInquirerreported that the McCormick campaign had filed a lawsuit seeking to challenge tens of thousands of provisional ballots from Philadelphia, a traditionally blue city, as well as a request for a Republican observer for the processing of those ballots. The judge denied McCormick’s observer request, prompting his team to pull the other lawsuit, which it could later refile, perWHYY.\n\nThe McCormick campaign has also filed multiple lawsuits intended to block the counting of undated mail ballots after Philadelphia, Bucks, Montgomery, and Centre county officials decided to accept them despite a series of court rulings that barred their counting, per theInquirer.On Friday, McCormickofficiallysued Philadelphia’s Board of Commissioners following their move. On Monday, the Pennsylvania Supreme Courtruledthat ballots with date errors should not be counted in the race.\n\nWhile Casey awaited the complete vote tally, McCormick declared victory and began making the rounds in cable interviews as Pennsylvania’s new senator-elect. “This election and the incredible mandate that President Trump has and the support that I have is a recognition that we need to shake things up. No incrementalism. We need to bring about real change,” he said in an interview withFox Newson November 10.\n\nMcCormick also attended orientation events in Washington for new members of the Senate after he was initially not extended an invitation owing to his race not being called. Many of his Republican colleagues denounced the lack of an invite as a partisan snub from outgoing Senate majority leaderChuck Schumer. “Dave McCormick is the senator-elect and Senator Schumer’s move to not allow him to participate in orientation this week is disgusting. They did the same thing to me after I beat a Democrat in 2018. We have to fight this!” Florida senatorRick Scottwrote onsocial mediaSunday. “AP called it. Dave won, Casey must concede NOW.”\n\nFor weeks, Casey appeared determined to hold out until the very last vote, despite his narrowing path to victory. On Thursday, the senator issued a statement officially conceding the race to McCormick. “This race was one of the closest in our Commonwealth’s history, decided by less than a quarter of a point. I am grateful to the thousands of people who worked to make sure  that every eligible vote cast could be counted, including election officials in all 67 counties,” hesaid.\n\nBy submitting your email, you agree to ourTermsandPrivacy Noticeand to receive email correspondence from us.",
        "source_2": "Sen. Bob Casey, D-Pa., hasn’t conceded the Pennsylvania Senate race, despiteThe Associated Pressand other news organizations calling it for his Republican challenger Dave McCormick. As of Monday, Nov. 11, McCormick was up by approximately 40,000 votes with a little over 100,000 ballots left to be counted.\n\n“There are more than 100,000 ballots left to be counted – including tens of thousands of provisional ballots in counties favorable to Senator Casey,” a member of Casey’s campaign said.\n\nDownload the SAN app today to stay up-to-date with Unbiased. Straight Facts™.\n\nMcCormick declared victory andfiled a lawsuitto allow Republican poll watchers to more easily challenge any uncounted provisional ballots they believe were cast improperly.\n\nMcCormick indicated he was already looking forward to his first week in Washington, D.C., and getting to work.\n\n“So we have leadership elections in Washington, for the leadership of the Senate. Dean and I had a talk with President Trump yesterday, there’s a huge agenda that he’s putting forward,”McCormick told supportersduring his victory speech.\n\nDespite McCormick’s win being called, Senate Majority Leader Chuck Schumer hasn’t invited him to the new senators orientation. Republican lawmakers are now calling him out.\n\nSen. John Thune, R-S.D., who’s acandidate for majority leader, called it unacceptable.\n\nDave McCormick is the new senator for Pennsylvania. The idea that Schumer would not allow him to participate in Senate orientation is beyond unacceptable.The voters of Pennsylvania have spoken. Looking forward to having Dave’s strong voice in the Senate Republican Conference.\n\nSen. Marco Rubio, R-Fla., asked, “What happened to all the demands that our leaders accept the outcome of the elections?”\n\nSchumer is not allowing@DaveMcCormickPAto participate in Senate orientation this week because Casey refuses to concede the race. What happened to all the demands that our leaders accept the outcome of the elections?\n\nSen. Mike Lee, R-Utah, said he’d personally escort McCormick into the Capitol.\n\nI’m willing to personally escort@DaveMcCormickPAinto the Capitol for new-senator orientationI’d like to see how they’d keep him out if he literally walked into “the room where it happens”https://t.co/6grLl0eUcf\n\nMcCormick isn’t the only one who hasn’t been invited. Rep. Ruben Gallego, D-Ariz., who is currently leading the Arizona Senate race over Republican candidate Kari Lake, hasn’t been invited either. Gallego was up by about 70,000 votes as of Monday, Nov. 11, but the AP had not called him the winner.\n\nSen. Bob Casey, D-Pa., has yet to concede the Pennsylvania Senate race, despitethe APand other news organizations calling it for his Republican challenger Dave McCormick. As of Monday afternoon, McCormick was up by approximately 40,000 votes with a little over 100,000 ballots left to be counted.\n\nA member of Casey’s campaign said,“There are more than 100,000 ballots left to be counted – including tens of thousands of provisional ballots in counties favorable to Senator Casey.”\n\nMcCormick declared victory andfiled a lawsuitto allow Republican poll watchers to more easily challenge any uncounted provisional ballots they believe were cast improperly.\n\nMcCormick indicated he was already looking forward to his first week in DC and getting to work.\n\nMcCormick “So we have leadership elections in Washington, for the leadership of the Senate. Dean and I had a talk with president Trump yesterday, there’s a huge agenda that he’s putting forward.”\n\nBut not so fast says Senate Majority Leader Chuck Schumer who has not invited McCormick to the new Senators orientation.\n\nSen. John Thune, R-S.D., who’s acandidate for majority leader, called it unacceptable.\n\nSen. Marco Rubio, R-Fla., asked, “What happened to all the demands that our leaders accept the outcome of the elections?”\n\nSen. Mike Lee, R-Utah, said he’d personally escort McCormick into the Capitol.\n\nMcCormick isn’t the only one who hasn’t been invited. Rep. Ruben Gallego, D-Ariz., who is currently leading the Arizona Senate race over Republican candidate Kari Lake, hasn’t been invited either. Gallego was up by about 70,000 votes as of Monday afternoon, but the AP had not called him the winner.\n\nNo summary available because of a lack of coverage.\n\n'Petty politics': Republicans melt down over Democratic leader's disruptive move\n\nSchumer withholds Senate orientation invite from McCormick\n\nNo summary available because of a lack of coverage.\n\nMcCormick not invited to Senate orientation as race against Casey declared ‘too close to call’\n\nChuck Schumer grilled for not inviting Dave McCormick to Senate orientation\n\nNo summary available because of a lack of coverage.\n\nRepublicans offer to escort Dave McCormick to Senate orientation in defiance of Schumer\n\nChuck Schumer won’t allow Dave McCormick at Senate orientation, citing outstanding PA ballots\n\nDave McCormick plans to attend Senate orientation without Schumer invite\n\nSchumer refuses to allow Dave McCormick at Senate orientation though he is projected by AP as winner\n\nSchumer Says No Senate Orientation for McCormick Until Race Decided\n\nGOP Senators Rally Behind Newly Elected McCormick As Schumer Refuses To Invite Him To Orientation\n\nPA Republican Dave McCormick will attend Senate orientation Tuesday despite Schumer’s attempt to block him\n\nSchumer Refuses to Allow McCormick to Show Up for Orientation. Here's What GOP Senators Propose.\n\nRepublicans Vow To ‘Escort’ McCormick Into the Senate As Schumer Declines To Invite Him to Orientation\n\nSchumer Refuses to Let McCormick Attend Senate Orientation Despite Winning Senate Race › American Greatness\n\nSenator-Elect McCormick Rebukes Schumer, Will Attend Orientation Despite Efforts To Block Him\n\nSchumer Bans Dave McCormick from Attending Orientation\n\nSchumer Blasted by Republicans for Not Allowing Dave McCormick to Attend Senate Orientation\n\nChuck Schumer won’t allow Dave McCormick at Senate orientation, citing outstanding PA ballots\n\nSchumer Blasted by Republicans for Not Allowing Dave McCormick to Attend Senate Orientation\n\nSchumer is Not Allowing GOP Pennsylvania Senator-Elect Dave McCormick Into Senate Orientation Because Democrat Bob Casey Refuses to Concede\n\nChuck Schumer Threatens Democracy, Won't Let Senator-Elect McCormick Attend Orientation\n\nSchumer Refuses To Let Senator-Elect Dave McCormick Into Senate Orientation Because Dem Bob Casey Won’t Concede\n\n'Petty politics': Republicans melt down over Democratic leader's disruptive move\n\nNEWS HEADLINES: Schumer Refuses To Let Republican Senator-Elect Dave McCormick Into Senate Orientation! * 100PercentFedUp.com * by Joshua C. – U-S-NEWS.COM\n\nSchumer Blasted by Republicans for Not Allowing Dave McCormick to Attend Senate Orientation – Conservative Angle\n\nSchumer Refusing To Let Senator-Elect Dave McCormick Attend Orientation\n\nSchumer withholds Senate orientation invite from McCormick – STAY INFORMED, STAY ENGAGED\n\nSchumer Blasted by Republicans for Not Allowing Dave McCormick to Attend Senate Orientation\n\nPennsylvania Senate Leader Battle Heats Up Over Orientation Access\n\nPathetic!! Democrat Senator Chuck Schumer Refuses To Let PA Republican Winner Dave McCormick Attend Orientation – Here's What GOP Senators Propose",
        "source_3": "Fox News’ Madeleine Rivera reports on post-election developments in the Senate, and ‘Fox & Friends’ co-hosts react.\n\nDemocratSen. Bob Casey Jr.still refuses to concede his race against Republican Dave McCormick, even though The Associated Press and other media outlets have called the race in McCormick's favor.\n\nIn a new video message, the three-term incumbent Casey said the democratic process \"will play out\" once all the votes are counted. As of early Tuesday afternoon, McCormick was leading Casey by 34,561 votes, according to Pennsylvania's election results website.\n\n\"My priority has always been standing up for the people of Pennsylvania. Across our commonwealth, close to 7 million people cast their votes in a free and fair election. Our county election officials will finish counting those votes, just like they do in every election,\" Casey said.\n\nPA SEN-ELECT MCCORMICK THANKS CASEY FAMILY FOR DECADES OF SERVICE AS DEMOCRAT DECLINES TO CONCEDE\n\nSenator Bob Casey (D- PA) addresses supporters before former President Barack Obama speaks during a campaign rally for statewide Democratic candidates on Sept. 21, 2018 in Philadelphia.(Mark Makela/Getty Images)\n\n\"The American democratic process wasborn in Pennsylvania, and that process will play out. I want to thank the election workers across our commonwealth who have been working diligently over this weekend. Their work will ensure Pennsylvanians' voices are heard.\"\n\nMcCormick was leading by more than 30,000 votes when the AP called the race at 4:09 p.m. on Thursday. Though there were an estimated 91,000 votes still outstanding at that time, the AP asserted that there were not enough in areas supporting Casey for him to make up the difference.\n\nThe McCormick campaign did not immediately respond to a request for comment.\n\nPHILLY FIREFIGHTERS UNION BACKS MCCORMICK IN ‘FIVE-ALARM FIRE’ FOR DEMS\n\nRepublican Pennsylvania Senate candidate David McCormick arrives to speak with his wife Dina Powell during an election night watch party on Wednesday, Nov. 6, 2024 in Pittsburgh.(AP Photo/Gene J. Puskar)\n\nMcCormick declared victory in Pittsburgh on Friday, thanking Casey and his family for their decades of service to the commonwealth.\n\nMcCormick said that Casey and his namesake father – a pro-life moderate who served as governor in the 1980s and 1990s – deserve a lot of respect for \"serving …. with honor.\"The younger Caseyhas served three terms since defeating conservative Sen. Rick Santorum in 2006.\n\nA POLITICAL REALIGNMENT IN PA: DESPITE RECENT DEM WINS, THE GOP IS GAINING MOMENTUM, ANALYSTS SAY\n\nBob Casey Jr. and Dave McCormick, right.(Getty Images)\n\n\"I want to start with just a message of absolute gratitude: Gratitude to be standing here in this beautiful day in a city that's meant so much to my family. My dad went to college at Pitt. We had some of the most formative years of our lives here. Three of our girls were born here,\" McCormick said.\n\nMcCormick will attend new senator orientation in the nation's capital this week.  Senate Majority LeaderChuck Schumer, D-N.Y., initially said McCormick was not welcome at the orientation due to there still being votes left to be counted, even though the AP had already projected him as the winner. Schumer eventually relented, saying Tuesday morning that the Republican is invited to participate.\n\nFox News Digital's Danielle Wallace and Kelley Phares contributed to this report.\n\nChris Pandolfo is a breaking news reporter for Fox News Digital. Send tips to chris.pandolfo@fox.com and follow him on Twitter @ChrisCPandolfo.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}