{
    "question": "How might granting ICE access to Medicaid enrollee data and developing an IRS system to share taxpayer information influence immigration enforcement outcomes, privacy protections and legal standards, and the willingness of people to seek medical care or file taxes?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nSpecial needs teacher Deja Nebula sets up an art installation displaying names and faces of people who have been detained, deported, or sent to offshore camps during ICE raids in Southern California, at Olvera Street Plaza in Los Angeles, on Thursday, July 3, 2025. (AP Photo/Damian Dovarganes)\n\nWASHINGTON (AP) — Immigration and Customs Enforcement officials will be given access to the personal data of the nation’s 79 million Medicaid enrollees, including home addresses and ethnicities, to track down immigrants who may not be living legally in the United States, according to an agreement obtained by The Associated Press.\n\nThe information will give ICE officials the ability to find “the location of aliens” across the country, says the agreement signed Monday between the Centers for Medicare and Medicaid Services and the Department of Homeland Security. The agreement has not been announced publicly.\n\nThe extraordinary disclosure of millions of such personal health data to deportation officials is the latest escalation in the Trump administration’s immigration crackdown, which has repeatedly tested legal boundaries in its effort to arrest3,000 people daily.\n\nPeople shout at federal immigration agents during a raid in the agriculture area of Camarillo, Calif., July 10, 2025. (AP Photo/Michael Owen Baker)\n\nLawmakers and some CMS officials have challenged the legality of deportation officials’ access to some states’ Medicaid enrollee data. It’s a move, first reported by the AP last month, that Health and Human Services officials said was aimed at rooting out people enrolled in the program improperly.\n\nBut the latest data-sharing agreement makes clear what ICE officials intend to do with the health data.\n\nResidents gather during a community vigil on Monday, June 30, 2025, to stand in solidarity with an immigrant family after ICE agents detained Rosalina Luna Vargas on Saturday, June 28, in front of her children, in Pasadena, Calif. (AP Photo/Damian Dovarganes)\n\n“ICE will use the CMS data to allow ICE to receive identity and location information on aliens identified by ICE,” the agreement says.\n\nSuch disclosures, even if not acted upon, could cause widespread alarm among people seeking emergency medical help for themselves or their children. Other efforts to crack down on illegal immigration have made schools, churches, courthouses and other everyday places feel perilous to immigrants and even U.S. citizens who fear getting caught up in a raid.\n\nHHS spokesman Andrew Nixon would not respond to the latest agreement. It is unclear, though, whether Homeland Security has yet accessed the information. The department’s assistant secretary, Tricia McLaughlin, said in an emailed statement that the two agencies “are exploring an initiative to ensure that illegal aliens are not receiving Medicaid benefits that are meant for law-abiding Americans.”\n\nThe database will reveal to ICE officials the names, addresses, birth dates, ethnic and racial information, as well as Social Security numbers for all people enrolled in Medicaid. The state and federally funded program provides health care coverage program for the poorest of people, including millions of children.\n\nThe agreement does not allow ICE officials to download the data. Instead, they will be allowed to access it for a limited period from 9 a.m. to 5 p.m., Monday through Friday, until Sept. 9.\n\n“They are trying to turn us into immigration agents,” said a CMS official did not have permission to speak to the media and insisted on anonymity.\n\nImmigrants who are not living in the U.S. legally, as well as some lawfully present immigrants, are not allowed to enroll in the Medicaid program that provides nearly-free coverage for health services. Medicaid is a jointly funded program between states and the federal government.\n\nBut federal law requires all states to offer emergency Medicaid, a temporary coverage that pays only for lifesaving services in emergency rooms to anyone, including non-U.S. citizens. Emergency Medicaid is often used by immigrants, including those who are lawfully present and those who are not.\n\nMany people sign up for emergency Medicaid in their most desperate moments, said Hannah Katch, a previous adviser at CMS during the Biden administration.\n\n“It’s unthinkable that CMS would violate the trust of Medicaid enrollees in this way,” Katch said. She said the personally identifiable information of enrollees has not been historically shared outside of the agency unless for law enforcement purposes to investigate waste, fraud or abuse of the program.\n\nTrump officials last month demanded that the federal health agency’s staffers release personally identifiable information on millions of Medicaid enrollees from seven states that permit non-U.S. citizens to enroll in their full Medicaid programs.\n\nThe states launched these programs during the Biden administration and said they would not bill the federal government to cover the health care costs of those immigrants. All the states — California, New York, Washington, Oregon, Illinois, Minnesota and Colorado — have Democratic governors.\n\nThat data sharing with DHS officials prompted widespread backlash from lawmakers and governors. Twenty states have since sued over the move, alleging itviolated federal health privacy laws.\n\nCMS officials previously fought and failed to stop the data sharing that is now at the center of the lawsuits. On Monday, CMS officials were once again debating whether they should provide DHS access, citing concerns about the ongoing litigation.\n\nIn an email chain obtained by the AP called “Hold DHS Access — URGENT,” CMS chief legal officer Rujul H. Desai said they should first ask the Department of Justice to appeal to the White House directly for a “pause” on the information sharing. In a response the next day, HHS lawyer Lena Amanti Yueh said that the Justice Department was “comfortable with CMS proceeding with providing DHS access.”\n\nDozens of members of Congress, including Democratic Sen. Adam Schiff of California, sent letters last month to DHS and HHS officials demanding that the information-sharing stop.\n\n“The massive transfer of the personal data of millions of Medicaid recipients should alarm every American. This massive violation of our privacy laws must be halted immediately,” Schiff said in response to AP’s description of the new, expanded agreement. “It will harm families across the nation and only cause more citizens to forego lifesaving access to health care.”\n\nThe new agreement makes clear that DHS will use the data to identify, for deportation purposes, people who in the country illegally. But HHS officials have repeatedly maintained that it would be used primarily as a cost-saving measure, to investigate whether non-U.S. citizens were improperly accessing Medicaid benefits.\n\n“HHS acted entirely within its legal authority – and in full compliance with all applicable laws – to ensure that Medicaid benefits are reserved for individuals who are lawfully entitled to receive them,” Nixon said in a statement responding to the lawsuits last month.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "The system being built by the IRS would allow ICE to request and obtain taxpayer data much more easily.\n\nICE, according to ProPublica, has already requested the addresses of 7.3 million taxpayers.\n\nThe White House has defended the system as enabling the deportation of “criminal illegal aliens,” while critics say it's ripe for abuse.\n\nThe Internal Revenue Service (IRS) is developing a system that would provide federal immigration authorities with on-demand access to sensitive taxpayer information. The system, first reported byProPublica, is stirring concern among IRS employees and civil liberties advocates, while some Trump administration officials defend its development as necessary for deporting “criminal illegal aliens.”\n\nThe unnamed system is intended to help immigration agents withdeportation ordersby providing them with up-to-date addresses and telephone numbers of targeted individuals. One agent, who spoke with ProPublica on condition of anonymity, said deportations by Immigration and Customs Enforcement (ICE) have been hampered by outdated address information.\n\nDownload the SAN app today to stay up-to-date with Unbiased. Straight Facts™.\n\nCurrently, law enforcement agencies seeking information from theIRSmust provide the target’s full legal name and address, as well as an explanation of why the request is related to a criminal investigation. A former IRS official told ProPublica that such requests rarely involve more than a dozen individuals.\n\nUnder the new system, ICE –– which has already demanded the addresses of 7.3 million taxpayers, according to ProPublica –– would allegedly be required to provide names, previous addresses, evidence of immigration removal orders, the criminal statutes being used to investigate targets and the tax period from which the data is sought.However, a former senior IRS official told ProPublica that there’s “no way ICE has 7 million real criminal investigations.”\n\n“That’s a fantasy,” the former official said, describing the request as both “unprecedented” and “a big data dump.”\n\nIf the system finds a match following a request, the tax files of targeted individuals, which include addresses from the most recent tax period, would be handed over to ICE. The response would also include “a record of names rejected for lack of required information and names for which it could not make a match,” ProPublica reported.Such checks would also no longer require approval from IRS officials, who currently must consider the legality of each request before releasing taxpayer data.An IRS engineer told ProPublica that if the program is implemented as designed, “it’s extremely likely that incorrect addresses will be given to DHS and individuals will be wrongly targeted.”\n\nWhite House spokesperson Abigail Jackson said opposition to the new system was akin to turning “a blind eye to criminal illegal aliens present in the United States.”\n\n“This isn’t a surveillance system… It’s part of President Trump’s promise to carry out the mass deportation of criminal illegal aliens — the promise that the American people elected him on and he is committed to fulfilling,” Jackson told ProPublica.\n\nLast month, however, an ICE attorney proposed an alteration to new data requests to include anyone “associated with criminal activities which may include United States citizens or lawful permanent residents.” The proposal, detailed in a document obtained by ProPublica, raises questions over whether the system could be used totarget lawful citizens.\n\nThe IRS' development of a system providing on-demand taxpayer data access to immigration authorities raises concerns over privacy, oversight and the scope of its use in deportation efforts.\n\nPlans to allow Immigration and Customs Enforcement access to IRS taxpayer records have raised concerns among IRS employees and civil liberties advocates about potential violations of personal privacy.\n\nThe new proposal could diminish existing safeguards, as the system may bypass the current requirement for official approval on each data request.\n\nWhile White House officials claim the system targets \"criminal illegal aliens,\" documentation obtained by ProPublica indicates the program could potentially be used to investigate United States citizens and lawful residents.\n\nThe Trump administration is compiling an unprecedented amount of personal data on a broad swath of Americans as it attempts to enhance immigration enforcement. The effort gathers information on citizens and non-citizens alike, and some lawmakers and civil liberties advocates say it violates privacy laws. Much of the data – ranging from tax information to…\n\nMelanie Krause, the Internal Revenue Service’s (IRS) acting commissioner, announced to staff Tuesday, April 8, that she is stepping down from her position, according to multiple reports. Her decision comes one day after the IRS and the Department of Homeland Security (DHS) reached an agreement to share immigrants’ tax data with immigration authorities. Krause’s resignation…\n\nThe Internal Revenue Service (IRS) reached a deal with Homeland Security officials to share sensitive taxpayer data with federal immigration authorities, departing from its long-standing policy of maintaining confidentiality. According to The New York Times, a redacted version of the deal states U.S. Immigration and Customs Enforcement (ICE) officials can ask the IRS for information…\n\nThe Internal Revenue Service (IRS) and Immigration and Customs Enforcement (ICE) are nearing a data-sharing agreement, The Washington Post reports. Under the draft agreement, ICE could provide the IRS with names and addresses of immigrants suspected of living in the country illegally, to cross-check against confidential taxpayer databases. The IRS would verify if immigration officials…\n\nThe Trump administration is compiling an unprecedented amount of personal data on a broad swath of Americans as it attempts to enhance immigration enforcement. The effort gathers information on citizens and non-citizens alike, and some lawmakers and civil liberties advocates say it violates privacy laws. Much of the data – ranging from tax information to…\n\nMelanie Krause, the Internal Revenue Service’s (IRS) acting commissioner, announced to staff Tuesday, April 8, that she is stepping down from her position, according to multiple reports. Her decision comes one day after the IRS and the Department of Homeland Security (DHS) reached an agreement to share immigrants’ tax data with immigration authorities. Krause’s resignation…\n\nThe Internal Revenue Service (IRS) reached a deal with Homeland Security officials to share sensitive taxpayer data with federal immigration authorities, departing from its long-standing policy of maintaining confidentiality. According to The New York Times, a redacted version of the deal states U.S. Immigration and Customs Enforcement (ICE) officials can ask the IRS for information…\n\nThe Internal Revenue Service (IRS) and Immigration and Customs Enforcement (ICE) are nearing a data-sharing agreement, The Washington Post reports. Under the draft agreement, ICE could provide the IRS with names and addresses of immigrants suspected of living in the country illegally, to cross-check against confidential taxpayer databases. The IRS would verify if immigration officials…",
        "source_3": "Fox News host Will Cain gives his take on the impact of the Trump administration's immigration and border enforcement policies on 'The Will Cain Show.'\n\nImmigration and Customs Enforcement(ICE) was recently granted access to Medicaid enrollee data, aiding officers tasked with fulfilling the Trump administration's objective of tracking down and deporting illegal immigrants.\n\nMedicaid, which uses taxpayer dollars to providehealth insuranceto low-income adults and children, has more than 71 million enrollees as of March 2025.\n\nThe information shared with ICE will include home addresses and ethnicities, according to a report from The Associated Press.\n\nThe agreement, brokered between the Centers for Medicare and Medicaid Services (CMS) and theDepartment of Homeland Security(DHS), was signed Monday, according to the report.\n\nCALIFORNIA SUES TRUMP ADMIN AGAIN, THIS TIME OVER MEDICAID DATA TRANSFER TO DHS\n\nThe Department of Homeland Security will have access to Medicaid enrollee data, according to the report.(AP Newsroom)\n\nThough the true number of illegal immigrants on Medicaid is unknown, about 1.4 million people currently on Medicaid do not meet citizenship and immigration status requirements for Medicaid enrollment, according to a document from the Congressional Budget Office.\n\nDHS assistant secretary Tricia McLaughlin told Fox News Digital the initiative will ensure illegal immigrants do not receive taxpayer-funded health benefits.\n\n\"President Trump consistently promised to protect Medicaid for eligible beneficiaries,\" McLaughlin wrote in a statement. \"To keep that promise after Joe Biden flooded our country with tens of millions of illegal aliens CMS and DHS are exploring an initiative to ensure that illegal aliens are not receiving Medicaid benefits that are meant for law-abiding Americans.\"\n\nImmigration and Customs Enforcement (ICE) agents look over lists of names and their hearing times and locations inside the Federal Plaza courthouse before making arrests on June 27, 2025 in New York.(BRYAN R. SMITH/AFP via Getty Images)\n\nCONGRESSMAN CALLS ON NOEM, DR. OZ WITH PLAN TO 'SWIFTLY REMOVE' 1.4 MILLION ILLEGAL MIGRANTS ON MEDICAID\n\nThe deal was signed weeks after California and 19 other states sued theTrump administrationfor transferring Medicaid data to the DHS.\n\n\"The U.S. Department of Health and Human Services (HHS)’s Centers for Medicare & Medicaid Services (CMS) handed over a trove of individuals’ protected health data obtained from States,including California,Illinois, and Washington, to other federal agencies, including the Department of Homeland Security (DHS),\" according to court documents. \"Millions of individuals’ health information was transferred without their consent, and in violation of federal law.\"\n\nResidents surround federal and Border Patrol agents who plan their escape after an immigrant raid on Atlantic Blvd. in Bell, Califonia on June 19, 2025.(Genaro Molina/Los Angeles Times via Getty Images)\n\nBLUE STATE GOP LAWMAKERS URGE MAJOR HEALTHCARE CHANGE FOR ILLEGAL IMMIGRANTS\n\nThe lawsuit claims the public’s sensitive health data can only be used for purposes that Congress has authorized, accusing the Trump administration of violating federal laws including the Administrative Procedure Act (APA) and the Health Insurance Portability and Accountability Act (HIPAA).\n\nThe Associated Press and Fox News Digital's Danielle Wallace contributed to this report.\n\nAlexandra Koch is a Fox News Digital journalist who covers breaking news, with a focus on high-impact events that shape national conversation and influence government response.\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox"
    }
}