{
    "question": "In what ways could the reported slavery-themed text messages sent to Black Americans after Election Day, and the FBI’s investigation, affect feelings of safety, civic participation, and trust in institutions?",
    "content": {
        "source_1": "CHICAGO (CBS)-- A federal investigation is under way after racist text messages were sent to Black people all across the country—including some in Illinois.\n\nThere werea number of variations of the messages using similar language, telling the recipient they had been \"selected for cotton picking\" or to become \"a slave.\" All of the texts included instructions, times and dates to \"be ready\" and references to being picked up in a van. Some included the recipient's name or general location, according to people who received the texts and screenshots reviewed by CBS News.\n\nThe Illinois Attorney General's office responded Friday to the disturbing, racist text messages, calling them offensive. CBS News Chicago also heard from universities in Illinois that were targeted.\n\nDavid Williams received a message reading: \"Greetings, David. You've been selected to pick cotton at the nearest plantation in Atlanta.\" Sherika Mallory's daughter received a similar text.\n\n\"They had a lot of slavery messages in there about her picking cotton, and they were going to come pick her up in a black truck, and she had a plantation letter and a  plantation number,\" said Mallory.\n\nBlack students at several colleges, including Eastern Illinois University, have reported receiving the anonymous texts.\n\nThe university condemned the messages, saying in a statement in part, \"There is no reason to believe these messages originated locally or are connected in any way to EIU or any member of the EIU community.\"\n\n\"We're reminding the students to be safe; to take all threats seriously,\" said Teresa Haley a former president of the NAACP Illinois State Conference and Springfield Branch.\n\nHaley said college students have reached out after receiving the racist texts.\n\n\"I think they are trying to remind us that racism is well and alive today,\" she said.\n\nSome of the messages were sent through TextNow, which offers free phone numbers. In a statement, the service said it shut down accounts as soon as it became aware.\n\n\"I felt, scared, sad, kind of shaken by it,\" said Devereaux Adams, who received a racist text message. \"If this was not during the election, I probably would've laughed it off. But I don't know, it hit me different.\"\n\nAnyone who lives in Illinois and received one of the racist text message is urged by the Illinois Attorney General to contact law enforcement, or the Help Stop Hate hotline at877-458-4283 or 877-458-HATE,or file a complaint with the AG's office.\n\nA CBS News team was able to reach one of the people who sent one of the texts from a Fort Wayne, Indiana area code. That person said, \"The message was a prank,\" before abruptly ending the call.\n\nCharlie De Mar is an Emmy Award-winning reporter for CBS2.",
        "source_2": "Authorities are investigating racist text messages sent to black Americans across the country telling them to report to a plantation \"to pick cotton\".\n\nBlack Americans, including school and college students, were among the recipients in states including Alabama, North Carolina, Virginia, New York and Pennsylvania.\n\n“The FBI is aware of the offensive and racist text messages sent to individuals around the country and is in contact with the Justice Department and other federal authorities on the matter,” the agency said.\n\nThe messages appear to have started on Wednesday, the day after election day. Some of the messages mentioned the Trump campaign – which strongly denied any connection.\n\nSteven Cheung, a campaign spokesman, said: “The campaign has absolutely nothing to do with these text messages.”\n\nThe source of the anonymous messages and the total number sent are unclear.\n\nA 42-year-old mother in Indiana sent a copy of the texts her high-school-aged daughter received to the BBC.\n\nThe messages said that the daughter had \"been selected to become a slave at your nearest plantation\" and would be \"picked up in a white van\" and \"searched thoroughly once you’ve reached your destination\".\n\nThe woman, who asked to remain anonymous for her safety, called the messages “extremely, extremely alarming” and made her feel \"really vulnerable\".\n\n“It’s because of America’s history, but the timing is specific to the day after the election,” she said. “This had to be a strategised effort.”\n\nAnother recipient, Hailey Welch,told a University of Alabama student newspaperthat several students on the campus had also received the messages.\n\n“At first I thought it was a joke, but everyone else was getting them. People were texting, posting on their stories, saying they got them,” Ms Welch told The Crimson White. “I was just stressed out, and I was scared because I didn’t know what was happening.”\n\nThe wording of the messages varied but generally instructed recipients to report to a “plantation” or wait to be picked up in a van, and referred to “slave” labour.\n\nThe texts were sent from numbers with area codes in at least 25 different states, according to CBS News, the BBC's partner network in the US.\n\nTextNow, a mobile provider that allows people to create phone numbers for free, said it found one or more of its accounts were used to send text messages \"in violation of its terms of service\". The company disabled the accounts within an hour of discovering the misuse, it said in a statement.\n\n\"We do not condone the use of our service to send harassing or spam messages and will work with the authorities to prevent these individuals from doing so in the future,\" it said.\n\nCivil rights group NAACP condemned the messages saying they were a consequence of President-elect Trump’s election.\n\n\"These actions are not normal, ” said the group's chief executive Derrick Johnson. “These messages represent an alarming increase in vile and abhorrent rhetoric from racist groups across the country, who now feel emboldened to spread hate and stoke the flames of fear that many of us are feeling after Tuesday's election results.”\n\nJessica Rosenworcel, chairwoman of the Federal Communications Commission, which is also investigating the messages, said: \"These messages are unacceptable. We take this type of targeting very seriously.”\n\nIn several states, top law enforcement officials said they were aware of the messages and encouraged residents to report them to the authorities if they received them.\n\nThe office of Nevada’s attorney general said it was working to “probe into the source of what appear to be robotext messages”.\n\nIn a statement, Louisiana Attorney General Liz Murrill said Louisiana Bureau of Investigation officers had traced some of the messages to a virtual private network – a method of masking the origins of electronic communications – based in Poland.\n\nMurrill said investigators “have found no original source - meaning they could have originated from any bad actor state in the region or the world”.\n\nThe Indiana mother responded to reports the messages could have originated abroad, telling the BBC: “It doesn't make it any safer or better that it could have been foreign.”\n\nThe US president is set to meet with Russian President Putin in Alaska concerning a potential ceasefire.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nThe US military is preparing to activate troops as part of Trump's crackdown on street crime.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.",
        "source_3": "WASHINGTON — Racist text messages invoking slavery raised alarm across the country this week after they were sent to Black men, women and students, including middle schoolers, prompting inquiries by the FBI and other agencies.\n\nThe messages, sent anonymously, were reported in several states, including New York, Alabama, California, Ohio, Pennsylvania and Tennessee. They generally used a similar tone but varied in wording.\n\nSome instructed the recipient to show up at an address at a particular time “with your belongings,” while others didn’t include a location. Some of them mentioned the incoming presidential administration.\n\nIt wasn’t yet clear who was behind the messages and there was no comprehensive list of where they were sent, but high school and college students were among the recipients.\n\nThe FBI said it was in touch with the Justice Department on the messages, and the Federal Communications Commission said it was investigating the texts “alongside federal and state law enforcement.” The Ohio Attorney General’s office also said it was looking into the matter.\n\nTasha Dunham of Lodi, California, said her 16-year-old daughter showed her one of the messages Wednesday evening before her basketball practice.\n\nThe text not only used her daughter’s name, but it directed her to report to a “plantation” in North Carolina, where Dunham said they’ve never lived. When they looked up the address, it was the location of a museum.\n\n“It was very disturbing,” Dunham said. “Everybody’s just trying to figure out what does this all mean for me? So, I definitely had a lot of fear and concern.”\n\nHer daughter initially thought it was a prank, but emotions are high following Tuesday’s presidential election. Dunham and her family thought it could be more nefarious and reported it to local law enforcement.\n\n“I wasn’t in slavery. My mother wasn’t in slavery. But we’re a couple of generations away. So, when you think about how brutal and awful slavery was for our people, it’s awful and concerning,” Dunham said.\n\nAbout six middle school students in Montgomery County, Pennsylvania, received the messages too, said Megan Shafer, acting superintendent of the Lower Merion School District.\n\n“The racist nature of these text messages is extremely disturbing, made even more so by the fact that children have been targeted,” she wrote in a letter to parents.\n\nStudents at some major universities, including Clemson in South Carolina and the University of Alabama, said they received the messages. The Clemson Police Department said in a statement that it had been notified of the “deplorable racially motivated text and email messages” and encouraged anyone who received one to report it.\n\nFisk University, a historically Black university in Nashville, Tennessee, issued a statement calling the messages that targeted some of its students “deeply unsettling.” It urged calm and assured students that the texts likely were from bots or malicious actors with “no real intentions or credibility.”\n\nMissouri NAACP President Nimrod Chapel said Black students who are members of the organization’s Missouri State University chapter received texts citing Trump’s win and calling them out by name as being “selected to pick cotton” next Tuesday. Chapel said police in the southeastern Missouri city of Springfield, home of the university, have been notified.\n\n“It points to a well-organized and resourced group that has decided to target Americans on our home soil based on the color of our skin,” Chapel said in a statement.\n\nNick Ludlum, a senior vice president for the wireless industry trade group CTIA, said: “Wireless providers are aware of these threatening spam messages and are aggressively working to block them and the numbers that they are coming from.”\n\nDavid Brody, director of the Digital Justice Initiative at The Lawyers’ Committee for Civil Rights Under Law, said that they aren’t sure who is behind the messages but estimated they had been sent to more than 10 states, including most Southern states, Maryland, Oklahoma and even the District of Columbia. The district’s Metropolitan Police force said in a statement that its intelligence unit was investigating the origins of the message.\n\nBrody said a number of civil rights laws can be applied to hate-related incidents. The leaders of several other civil rights organizations condemned the messages, including Margaret Huang, president and CEO of the Southern Poverty Law Center, who said, “Hate speech has no place in the South or our nation.”\n\n“The threat - and the mention of slavery in 2024 - is not only deeply disturbing, but perpetuates a legacy of evil that dates back to before the Jim Crow era, and now seeks to prevent Black Americans from enjoying the same freedom to pursue life, liberty, and happiness,” said NAACP President and CEO Derrick Johnson. “These actions are not normal. And we refuse to let them be normalized.”\n\nAssociated Press reporter Summer Ballentine contributed to this report from Jefferson City, Missouri.\n\nThe Associated Press receives support from several private foundations to enhance its explanatory coverage of elections and democracy. See more about AP’s democracy initiative here. The AP is solely responsible for all content.\n\nPope Leo should tell Catholics: Marry young, have many children\n\nTrump’s TikTok delays undermine his China hawks while Intel controversy grows"
    }
}