{
    "question": "How might Newsom’s plan to convene a special session and boost the attorney general’s resources influence California’s ability to defend its policy agenda against anticipated challenges from the incoming Trump administration?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nFILE - California Gov. Gavin Newsom speaks during a press conference in Los Angeles, Wednesday, Sept. 25, 2024. (AP Photo/Eric Thayer, File)\n\nSACRAMENTO, Calif. (AP) — California Gov. Gavin Newsom plans to meet with the Biden administration this week to discuss zero-emission vehicles and disaster relief — issues that have been targeted in the past byPresident-elect Donald Trump.\n\nThe Democratic governor is leaving for Washington on Monday and will return home Wednesday, his office said. Newsom will also meet with California’s congressional delegation.\n\nHe is seeking federal approval for state climate rules, a $5.2 billion reimbursement for emergency funding during the COVID-19 pandemic and updates to the state’s Medicaid program, along with other priorities.\n\nThe trip comes days after Newsom called for state lawmakers toconvene a special sessionin December to protect California’s liberal policies ahead of Trump’s return to office in January.\n\nTrump then criticized the governor on social media, calling out the high cost of living in California and the state’s homelessness crisis. He said Newsom was “stopping all of the GREAT things that can be done to ‘Make California Great Again.’”\n\nCalifornia won against most of the Trump administration’s legal challenges over the state’s environmental and other progressive policies during the Republican’s first term, said Thad Kousser, a political science professor at the University of California San Diego.\n\n“The question is: Has Donald Trump changed the legal playing field so much through the court appointments of his first term that he’ll be able to win on policies in his second term?” he said.\n\n▶ Stay up to date with the latest U.S. news by signing up to our WhatsApp channel.\n\nAs president, Trump appointedmore than 230 federal judges, including three justices to the U.S. Supreme Court.\n\nThe Trump administration in 2019revoked California’s abilityto enforce its own tailpipe emissions standards. President Joe Biden laterrestored the state’s authority, which wasupheld in federal court.\n\nThe U.S. Environmental Protection Agency typically sets standards for emissions from passenger cars, trucks and other vehicles, but California has historically been granted waivers to impose its own, stricter standards.\n\nCalifornia has eight climate rules awaiting waivers from the EPA. They include measures to require all new cars sold in the state bezero-emissionby 2035, transition away fromdiesel-powered trains, and update emission standards for pollutants from heavy-duty vehicles.\n\nGil Cisneros, who was elected to represent Los Angeles County in the U.S. House of Representatives, said in an email that his fellow Democrats have a responsibility to protect key policies even if Republicans retain control of the House.\n\n“If Donald Trump follows through with such promises as eliminating the Affordable Care Act, mass deportations, raising tariffs ... it is beholden on us to communicate to the American people and convince them how his policies will hurt the economy and their pocket book,” Cisneros said. “That is how we will be better able to resist him.”\n\nIn remarks to Fox 11 in Los Angeles, Democratic Sen.-elect Adam Schiff said he was ready to work with Trump to bring down costs and strengthen the economy.\n\nBut “should he move to try to take away the rights and freedoms of Californians, should he move to try to tear down the guardrails of our democracy, as before, he will meet a vigorous opponent in me,” Schiff said. “I will do whatever is necessary to protect the rights and freedoms of my constituents.”\n\nTrumpresoundingly defeatedVice President Kamala Harris, a former California prosecutor, in the battle for the nation’s top job. Newsom has become a foil for Trump over the years, and he was a prominent advocate for Biden’s — and then Harris’ — campaign.\n\nAssociated Press writer Michael R. Blood in Los Angeles contributed.\n\nAustin is a corps member for the Associated Press/Report for America Statehouse News Initiative.Report for Americais a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues. Follow Austin on Twitter: @sophieadanna\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Khaleda Rahman is Newsweek's National Correspondent based in London, UK. Her focus is reporting on education and national news. Khaleda joined Newsweek in 2019 and had previously worked at the MailOnline in London, New York and Sydney. She is a graduate of University College London. Languages: English. You can get in touch with Khaleda by emailingk.rahman@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nCalifornia GovernorGavin Newsom's defiant message to President-electDonald Trumphas gone viral on social media.\n\nTrump's victory in Tuesday's election means Newsom, a Democrat who may haveambitions on the national stage, is once again poised to be a leading figure in his party's resistance campaign against Trump's presidential agenda.\n\n\"I want our president to succeed,\" Newsom said in a video posted on X, formerlyTwitter, on Saturday. \"And our job, my job, is not to wake up every single day and get a crowbar and try to put it in the spokes of the wheel of the Trump administration.\"\n\n\"I'm not naive either, and we're pragmatic, and we will stand firm,\" he added.\n\nI revere this country. The institutions. The Presidency. I want our nation to succeed.But I'm not naive.Donald Trump has a playbook. They wrote it out for us. 922 pages. With 270 specific points he has publicly supported.If our American values and freedoms are attacked,...pic.twitter.com/vL9oqq6yvG\n\nIn the post, which has since received more than 8 million views and 100,000 likes, Newsom referencedProject 2025, the Heritage Foundation's mandate for the nextRepublicanadministration, calling it the president-elect's \"playbook\" and \"to-do list.\"\n\n\"They wrote it out for us. 922 pages. With 270 specific points he has publicly supported,\" Newsom wrote in the video's caption. \"If our American values and freedoms are attacked, we will not stand idly by.\"\n\nNewsweekcontacted Newsom's office and representatives for Trump for comment via email.\n\nFollowing Trump's electoral victory, Newsom called for California lawmakers toconvene a special sessionto safeguard the state's progressive policies ahead of the Republican's second term in the White House.\n\nOn Thursday, Newsom's office said he wanted lawmakers to give the California attorney general's office more funding to \"pursue robust affirmative litigation against any unlawful actions by the incoming Trump Administration, as well as defend against federal lawsuits aimed at undermining California's laws and policies.\"\n\nNewsom and lawmakers are ready to \"Trump-proof\" California's state laws, his office told the Associated Press.\n\nIn a Friday post on Truth Social, the president-elect called the Democrat \"Governor Gavin Newscum.\" He accused Newsom of \"trying to KILL\" California and \"using the term 'Trump-Proof' as a way of stopping all of the GREAT things that can be done to 'Make California Great Again.'\"\n\nOther governors and attorneys general from blue states are likewisepreparing to counter Trump's proposals, including his plan to launch the biggest deportation program in the nation's history.\n\nMassachusetts Governor Maura Healey said her state would \"absolutely not\" assist the Trump administration with mass deportations, while New Jersey Governor Phil Murphy spoke of fighting \"to the death\" against proposals that counter his state's values.\n\nIn New York, Governor Kathy Hochul has convened a task force to develop strategies to protect New Yorkers in key areas that \"are most likely to face threats from the Trump administration,\" including immigration, reproductive rights and civil rights.\n\n\"It's Democratic governors who are once again the last line of defense for our rights and values,\" Meghan Meehan-Draper, the executive director of the Democratic Governors Association, said in a statement after Trump's win.\n\nShe also said: \"As we brace for the potential for the same lawlessness and extremism that Donald Trump repeatedly promised to bring to the White House again, Americans can look to Democratic governors to continue standing up for fundamental freedoms and our democracy.\"\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nKhaleda Rahman is Newsweek's National Correspondent based in London, UK. Her focus is reporting on education and national news. Khaleda joined Newsweek in 2019 and had previously worked at the MailOnline in London, New York and Sydney. She is a graduate of University College London. Languages: English. You can get in touch with Khaleda by emailingk.rahman@newsweek.com\n\nKhaleda Rahman is Newsweek's National Correspondent based in London, UK. Her focus is reporting on education and national news. Khaleda joined Newsweek in 2019 and had previously worked at the MailOnline in London, New York and Sydney. She is a graduate of University College London. Languages: English. You can get in touch with Khaleda by emailingk.rahman@newsweek.com\n\nKhaleda Rahman is Newsweek's National Correspondent based in London, UK. Her focus is reporting on education and national news. Khaleda                                    ...Read more",
        "source_3": "'Fox News Saturday Night' host Jimmy Failla and guests react to Bill and Hillary Clinton’s ongoing efforts to support Kamala Harris along the campaign trail.\n\nCalifornia Gov.Gavin Newsomis headed to Washington this week to meet with President Biden after calling for a special session of state lawmakers to \"Trump-Proof\" the state’s progressive policies.\n\nA spokesperson for Newsom’s office said the Democratic governor is traveling toWashington, D.C.for a series of meetings with the Biden-Harris administration and the California congressional delegation.\n\n\"Building on the progress made sincePresident Bidentook office, the Governor will advocate for key priorities that advance the health and well-being of all Californians — including disaster funding, the approval of state healthcare initiatives aimed at improving access to health and mental healthcare for Californians, and crucial climate and clean air efforts,\" Newsom’s spokesperson said, without giving a specific timeframe for the meetings.\n\nNewsom, who has been at odds with the former president, wrote after Trump’s election night victory that California was \"ready to fight.\"\n\nGovernor Gavin Newsom speaks at a press conference where he signs legislation related to oversight of oil and gas wells, and community protections on Wednesday, Sept. 25, 2024 in Los Angeles.(Jason Armond/Los Angeles Times via Getty Images)\n\nHERE ARE THE DEMOCRATS WHO MAY EVENTUALLY RUN FOR PRESIDENT IN 2028\n\n\"Whether it be our fundamental civil rights, reproductive freedom, or climate action — we refuse to turn back the clock and allow our values and laws to be attacked,\" Newsom said.\n\nThose comments came a day after Newsom said he \"will seek to work with the incoming president.\"\n\nPresident Trump, right, speaks to California Gov. Gavin Newsom at Sacramento McClellan Airport in McClellan Park, California on Sept. 14, 2020.(BRENDAN SMIALOWSKI/AFP via Getty Images)\n\nDuring Trump’s first term, the Newsom administration filed more than 100 lawsuits against the Trump administration. The governor is now asking state lawmakers to earmark more funds for the California Department of Justice and other state agencies with additional resources to mount legal challenges.\n\nMORE THAN 40% OF CALIFORNIANS VOTED FOR TRUMP, STATE ‘NOT AS LIBERAL AS NEWSOM’ THINKS, SAYS EXPERT\n\nNewsom’s office said the special session of state lawmakers, slated for Monday, Dec. 2, will focus on safeguarding \"civil rights, reproductive freedom, climate action, and immigrant families.\"\n\nCalifornia Gov. Gavin Newsom, right, speaks as state Senator Anthony Portantino, D-Burbank, left, and California Attorney General Rob Bonta, center, look on during a press conference on Feb. 1, 2023 in Sacramento, California.(Justin Sullivan/Getty Images)\n\nTrump has balked at Newsom’s call for a special session, writing on his Truth Social platform Friday that Newsom was supposedly \"trying to KILL our Nation’s beautiful California.\"\n\n\"He is using the term ‘Trump-Proof’ as a way of stopping all of the GREAT things that can be done to ‘Make California Great Again,’ but I just overwhelmingly won the Election,\" Trump said.\n\nFox News Digital’s Jamie Joseph contributed to this report.\n\nBradford Betz is a Fox News Digital breaking reporter covering crime,political issues,and much more.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}