{
    "question": "How might the post-election interest among some American women in adopting South Korea’s 4B movement—rejecting dating, sex, marriage, and childbirth with men—shape U.S. conversations about gender, politics, and personal autonomy, and what social or political consequences could follow?",
    "content": {
        "source_1": "In the hours and days since it became clear that Donald Trump would be re-elected president of the United States, there’s been asurge of interestin the US for 4B.\n\nYoung liberal women across TikTok and Instagram are discussing and sharing information about the South Korean feminist movement, in which straight women refuse to marry, have children, date or have sex with men.\n\nRelated articleAfter two presidential losses, women wonder what it will take to shatter the glass ceiling\n\nThese women say they are enraged and fed up after a majority of their male counterparts voted for a candidate who was found liable forsexual abuseand whose appointment of three conservative Supreme Court justicesled to the overturningof nationalabortion rightsprotections.\n\nIn response, they say they’re swearing off men — and they’re encouraging others around the country to join them.\n\n“We have pandered and begged for men’s safety and done all the things that we were supposed to, and they still hate us,” Ashli Pollard, a 36-year-old in St. Louis, told CNN.\n\n“So if you’re going to hate us, then we’re going to do what we want.”\n\n4B is a shorthand for the four Korean words bihon, bichulsan, biyeonae and bisekseu, which translate to no marriage, no childbirth, no dating and no sex with men.\n\nThe 4B movement emerged in South Korea around 2015 or 2016, per Ju Hui Judy Han, an assistant professor in gender studies at the University of California, Los Angeles. Mostly popular among young women in their 20s, she described it as a fringe offshoot of #MeToo and other feminist movements that arose in response to stark gender inequality in the country.\n\nIn 2016, a woman wasbrutally killednear a Seoul subway station — the perpetratorreportedly saidhe killed her because he felt ignored by women. The incident prompted a national reckoning around how women are treated in the country, expanding to include conversations around femicide,revenge pornanddigital sex crimes.\n\nFeminism and the gender divide have beenhot button issuesin South Korea. Women in the country are paid aboutone-third lessthan men, according todatafrom the Organisation for Economic Co-operation and Development — the highest wage gap among OECD nations. And despite being one of the world’s most advanced economies, women there arescarcelyrepresented in senior and managerial roles.\n\nThe 4B movement was decentralized and existed in various iterations online and offline, making it difficult to assess its true size and scale. Over the years, the movement has diminished and splintered over disagreements about the role of queer and trans women, according to Han. But she says 4B and other South Korean feminist movements drew attention to gender inequality in the country and emphasized collective action.\n\nRelated articleEscape the corset: How South Koreans are pushing back against beauty standards\n\n“It’s not a very widespread movement, but the sentiments behind it I think a lot of people empathize with,” Han says.\n\n“When there is such widespread violence against women, there is such systemic discrimination and inequality, when there’s so much that make marriage, childbirth and child rearing …  difficult, why and how could anyone imagine getting married and giving birth?”\n\nThough South Korea’s 4B movement mostly faded from media headlines in recent years, the US election has renewed interest.\n\n“A lot of us — straight or not, queer or not, whether you’re in a marriage or not — are going to be in the same boat, dealing with an oppressive and violent institutions,” Han says. “And we see each other.”\n\nIt’s far too early to tell whether the 4B movement might seriously catch on in the US. But so far, at least, it’s generated a lot of online discussion among young women.\n\nSome women are discovering the movement anew and are vowing to join. Others who are already married or partnered up say they plan to protest in other ways, such as boycotting male-owned businesses or refusing to do emotional labor for men.\n\nPollard says she learned about South Korea’s 4B movement a few years ago, inspiring her to “examine what a life looks like without centering men so deeply.” Since 2022, she says she hasn’t dated or slept with men and has realized that she’s better off on her own. She has the resources to support herself without marriage, and she plans to have a child alone.\n\nHer decision to disengage from men wasn’t necessarily an act of vengeance, she says. Rather, it was about putting herself first. Now that other women around the country have taken an interest in 4B, she says she wants them to realize that they have other options.\n\n“You push people far enough and they’re done,” she says. “How will that affect politics? We’ll see … but I think that women and their joy is going to be something that can’t really be overlooked anymore. Women are choosing themselves in droves.”\n\nAlexa Vargas, a 26-year-old from Boston, says she stopped engaging with men a few years ago after a series of unhealthy relationships that included abuse and assault, and it wasn’t until earlier this year that she realized there was a movement and language that aligned with her actions. Though she says that “men need a wake-up call,” her decision is more about herself and other women.\n\n“I don’t know if men are going to change their ways. I don’t know how this is going to pan out,” she says. “My goal in life and in this movement is to protect young women and girls.”\n\nWomen who have been talking about 4B online say the way some men have responded to their posts are already proving their point.\n\nAbby K.,a 27-year-old from Florida,recently broke up with her boyfriend over dismissive comments he made about Trump’s history of sexual abuse. When she posted a video about that and her decision to join the 4B movement, she says men flooded her DMs with death threats and hateful comments about her appearance.\n\n“It doesn’t exactly entice you to re-enter the dating pool,” she adds.\n\nIn Han’s view, the 4B movement is unlikely to become mainstream in the US.\n\nShe says it relies too heavily on the gender binary and that those inspired to join it as a result of the election are overlooking the fact that plenty of women voted for Trump, too. (Though Vice President Kamala Harris maintained an edge with women,exit pollsindicate that her lead was smaller than President Joe Biden’s or former Secretary of State Hillary Clinton’s during their respective presidential campaigns.)\n\nHadia Khanani, a 24-year-old from Florida, also has reservations about 4B in the US. Though she hasn’t engaged with men romantically for several years in an effort to prioritize herself, she wants women to dig deeper and examine their own role in upholding patriarchy. She also worries about the consequences of further isolating men.\n\n“The conversation online has been centered around sleeping with men and dating men, obviously to protect yourself, but I just feel like misogyny and patriarchy is much deeper than that,” she says. “I think a lot of it is rooted in the way that men are raised in society.”\n\nEven if large numbers of women don’t adopt the strict tenets of 4B, those who are taking part for now hope the recent conversations around it lead women to think about themselves and their circumstances differently.\n\n“I don’t ever expect everyone in America to hold hands and agree not to date men,” Abby K. says. “I could definitely see it fueling change in some way.”\n\nHan predicts that American interest in the 4B movement will subside quickly. Still, she hopes that the recent discourse around it will help women understand that they aren’t alone in their struggles and build solidarity with others around the world.\n\n“I think a lot of American women are … trying to find ways to seek empowerment and find a way to survive,” Han says. “And I hope what they find is not necessarily a particular movement like the 4B movement, but a recognition that struggles for reproductive justice and gender equality are certainly not just American concerns.”\n\nCNN’s Leda Joy Abkenari contributed to this report.",
        "source_2": "FollowingDonald Trump’s election victory, a South Korean feminist movement called the “4B Movement” is resonating with Americanwomen on TikTok. The movement’s principles, which include rejecting dating, marriage, sex and childbirth with men, have sparked conversations about gender dynamics in the U.S. amid concerns about women’s rights.\n\nInspired by years of activism in South Korea, the“4B Movement”— shorthand for the “Four Nos” — advocates for complete independence from men as a protest against societal expectations.\n\nSince Trump’s 2024 victory, many women in the U.S. have adopted these ideals. Many cite a sense of solidarity and frustration with what they see as setbacks to women’s rights under his leadership.\n\nDownload the SAN app today to stay up-to-date with Unbiased. Straight Facts™.\n\nOnTikTok, hashtags like #4BMovement and #4BNos have gathered millions of views. Many women are sharing their personal stories and decisions to “opt-out” of relationships with men.\n\nInfluential users whose videos on the topic have gone viral, say the movement provides a sense of control in an environment where they feel their rights are increasingly under threat.\n\nThe “4B Movement” emerged inSouth Koreaas a reaction to social issues such as the country’s gender wage gap, high rates of workplace harassment and limited protections for women. In recent years, it has influenced everything from birth rates to marriage trends. Advocates say opting out of traditional roles is a form of resistance to gender inequality.\n\nCritics of the movement argue that it could deepen social divisions. They’ve called it an “extreme response” that risks fueling a so-called “gender war.”\n\nYet for supporters, the decision to join 4B isn’t simply aTikTok trend, it’s a call for meaningful change and a rejection of societal pressures.\n\nWhile it’s unclear if the 4B Movement will have lasting effects in the U.S., it’s clear the ideas it represents are resonating with many women post-election. As more women turn to social media to share their views, the movement’s popularity shows no signs of slowing down.\n\nIN 4-11 B-C-E… ARISTOPHANES WROTE THE GREEK COMEDY LYSISTRATA… ABOUT A GROUP OF WOMEN USING AN UNCONVENTIONAL METHOD TO END THE PELOPONNESIAN WAR: WITHHOLDING SEX FROM ALL MEN IN THE LAND. FOR CENTURIES, IT HAS BEEN PERFORMED ON STAGE AND SHOWN ON FILM… STUDIED IN SCHOOLS AND GILDED AS ONE OF THE EARLIEST NARRATIVES ON FEMALE EMPOWERMENT.\n\nNOW… A NEW MOVEMENT IS MAKING IT OVER TO THE STATES FROM SOUTH KOREA… INSPIRED BY THIS SAME STORY.\n\n“You will never control your own bodies, you will never be the leader of a global empire. Not gonna happen sweetie. Your body, our choice”\n\n“I feel like I’m in a different world today… this is so heartbreaking..\n\nA SIGNIFICANT PORTION OF AMERICAN WOMEN ARE NOT HAPPY WITH THE RESULTS OF THE 2024 ELECTION… AND UNCERTAIN OF WHAT IT MEANS FOR THEIR FUTURE. IN PROTEST… THEY ARE JOINING A MOVEMENT.\n\nIT’S CALLED THE “4B MOVEMENT”… IT BEGAN IN SOUTH KOREA AND ENCOURAGES WOMEN TO “OPT OUT” OF MEN ENTIRELY.\n\nITS FOUR PRINCIPLES ARE NO DATING, NO MARRIAGE, NO SEXUAL RELATIONSHIPS, AND NO CHILDBIRTH WITH MEN. AND THEY IDEA IS GAINING TRACTION ON SOCIAL MEDIA.\n\nSEVERAL TIKTOK USERS ARE COMMITTING TO THE PLEDGE, AND ENCOURAGING OTHER WOMEN TO DO THE SAME. SOME ARE ALSO SHAVING THEIR HEADS IN PROTEST. VIDEOS ON THE MOVEMENT HAVE BEEN VIEWED MILLIONS OF TIMES… BUT IT REMAINS TO BE SEEN IF THIS COULD SNOWBALL INTO AFFECTING THE AMERICAN BIRTH RATE.\n\nTHE 4B MOVEMENT HAS TAPPED INTO FRUSTRATIONS THAT ARE NOT UNIQUE TO SOUTH KOREA. WOMEN IN BOTH COUNTRIES REPORT FACING A GENDER WAGE GAP, WORKPLACE HARASSMENT, AND DISCRIMINATION.\n\nIN FACT, SOUTH KOREA HAS ONE OF THE LARGEST GENDER WAGE GAPS AMONG DEVELOPED NATIONS, AND MANY 4B ADVOCATES VIEW OPTING OUT OF TRADITIONAL RELATIONSHIPS WITH MEN AS A WAY TO REJECT A SYSTEM THEY FEEL OPPRESSES THEM.\n\nIN SOUTH KOREA… THE MOVEMENT HAS BEEN CREDITED WITH REDUCING BIRTH RATES AND CHALLENGING TRADITIONAL FAMILY STRUCTURES. CRITICS ARGUE THAT IT COULD CONTRIBUTE TO A “GENDER WAR,” BUT SUPPORTERS SAY IT’S ABOUT FINDING SAFETY AND INDEPENDENCE.\n\nFOR MORE UNBIASED UPDATES AND STRAIGHT FACTS… DOWNLOAD THE STRAIGHT ARROW NEWS APP OR VISIT SAN DOT COM.\n\nNo summary available because of a lack of coverage.\n\nWhat Is the 4B Movement? Some Women Are Swearing Off Men\n\nWhat is the 4B movement? And why is it rising after Trump's 2024 election win?\n\nWhat is the 4B movement and why are women discussing it after Trump’s election win?\n\nNo sex, no babies: What is the 4B movement sweeping internet after Donald Trump's win in 2024 US elections\n\nTrump win spurs interest in 4B, fringe South Korean movement to swear off men\n\nThe radical 'femcel' movement urging women to give up men forever\n\nWhat is the 4B movement? Why some are calling for a South Korean-inspired trend after Trump's victory\n\nFeminist celibacy movement 4B is trending in the US after Trump's win\n\n'4B' movement picks up steam in U.S. after election\n\nThe 4B Movement On TikTok Is About Women Swearing Off Men\n\n“A world without men”: the “4b” movement, this feminist movement that American women want to join after Donald Trump's victory\n\nWhat Is the 4B Movement, and Why Are American Women Opting In?\n\nAfter Trump's Victory, the 4B Movement Is Spreading Across TikTok – WorldNL Magazine\n\nWhat is the 4B movement? Women practice no-sex in a quest to regain rights post-election\n\n4B Movement: Anti-Misogyny Protest Calling on Women to Swear Off Sex Sees Massive Spike in Google Searches After Trump Election\n\nNo summary available because of a lack of coverage.\n\nWhat is 4B? South Korean protest movement hits US after Donald Trump win\n\nKorea's 4B movement attracts American women after Trump wins. What is it?\n\nWhat is the 4B movement? Interest spikes after Trump win\n\nWhat is the 4B movement? TikTok trend calls for women to boycott men\n\nWhat is the 4B movement? Why interest in the South Korean protest is picking up\n\nWhat is the 4B movement? Interest spikes after Trump win\n\nWhat is the 4B movement? Interest spikes after Trump win\n\nWhat is the 4B movement? Interest spikes after Trump win\n\nNo summary available because of a lack of coverage.\n\n‘4B’ movement: Liberal women launch sex strike after Trump win\n\nWhy American women are threatening a sex strike after Trump’s win\n\nNo dating, no marriage, no babies with men who voted for Trump: What is '4B' movement?\n\nLiberal women going on sex strike over Trump victory\n\nLeft-wing feminists VOW abstinence after Trump's win\n\n‘Delete Your Dating Apps’: Liberal Women Vow Four-Year Sex Strike To Protest Trump's Victory\n\nLiberal Women All Over America Are Going on a Nationwide Sex Strike to Punish Men for Voting for Trump\n\nLiberal Women All Over America Are Going on a Nationwide Sex Strike to Punish Men for Voting for Trump\n\nLiberal Women All Over America Are Going on a Nationwide Sex Strike to Punish Men for Voting for Trump – 🔔 The Liberty Daily\n\nLiberal Women All Over America Are Going On A Nationwide Sex Strike To Punish Men For Voting For Trump\n\nLiberal women go on sex strike over Trump's victory\n\nWomen are now going on a sex strike in the US – this is what it's all about\n\n'No Dating, No Sex': US Women Are Protesting Trump's Victory With South Korea's 4B Movement\n\nInterest spikes in South Korea's radical 4B movement that bans dating, sex and childbirth after Donald Trump's election win\n\nLiberals Go On A S*X Strike Over Trump Using 4B Movement | Redacted w Natali and Clayton Morris\n\nThe Tiktok trend after Trump: Women go on sex strike\n\nWhat is South Korea’s 4B movement, and why is it trending in the US?\n\n4B Movement Explained: The Feminist Movement Gaining Ground After Trump's Win\n\nLiberal Women All Over America Are Going on a Nationwide Sex Strike to Punish Men for Voting for Trump\n\nAfter Trump's Win, Some American Women Consider 'Boycotting' Men, Births 'Boycott Men' 4B Movement – Global Upfront Newspapers\n\nWhat is South Korea’s 4B movement? Interest spikes after US election\n\nAfter Trump's Victory, the 4B Movement Is Spreading Across TikTok\n\nWhy are US women backing the ‘4B’ movement to swear off men after Trump’s election victory?\n\nAfter Trump's Victory, the 4B Movement Is Spreading…\n\nWhat Is The 4B Movement & Why Is It All Over TikTok?\n\nThe 4B movement explained: Why some women are boycotting men entirely\n\nWhat is the 4B movement? Interest spikes after Trump win – Jaun News English\n\nUnique Protest: No Dating, No Sex, No Babies With Men Who Voted For Donald Trump – odishabytes\n\nWhat is South Korea’s 4B movement? Interest spikes after US election – Daily news Update\n\nAfter Trump's Victory, the 4B Motion Is Spreading Throughout TikTok\n\nWhat Is The “4B” Movement? Women Are Vowing To Withhold Sex From Men For The Next 4 Years After Donald Trump Win\n\nLiberal Women All Over America Are Going on a Nationwide Sex Strike to Punish Men for Voting for Trump\n\nWomen All Over America Are Going On A Nationwide Sex Strike To Punish Men For Voting For Trump\n\nUS Women Join 4B Movement To Stop Having Sex With Men In Protest Of Trump's Win. Others Blame Racism, Cultural Resentment For Harris' Loss. Others Call For The Killing/Death Of Trump – I Get Talk",
        "source_3": "Liberal women are withholding sex from men and shaving their heads to protest President-elect Donald Trump’s landslide victory over Kamala Harris.\n\nThe demonstration was inspired by South Korea’s “4B” movement against gender-based violence where some women in that country have vowed to follow the four “no’s” — no sex, no dating or marriage and no having children with men.\n\nThe trend took off in the US on TikTok after Trump’s win Tuesday, with many women posting about their refusal to engage with men romantically or sexually over the next four years, citing dwindling abortion access across the nation and an increase in young male Republican voters.\n\n“As a woman, my bodily autonomy matters, and this is my way to exercise sovereignty over that,”said a TikTokker, who encouraged other women to “delete their dating apps” in solidarity.\n\n“If you need someone to cuddle or give you a kiss, I bet you one of your girlfriends would do it, and you don’t even need to be gay. It’s OK to have a lot of platonic love for the next four years,” she said.\n\nOther users have taken to the platform toencourage womento “take it a step further” and “collectively get hysterectomies,” while some said they are“breaking up with their Republican boyfriends”in the wake of the election.\n\n“F–k being skinny, f–k being hot, f–k being all the things that the patriarchy wants us to be, ’cause clearly they don’t give a s–t about us,” said one user who began haphazardly shaving her full head of hair on camera.\n\n“Stop dating men, stop having sex with men, stop talking to men, divorce your husbands, leave your f–king boyfriends, leave them,” she said.\n\nExit polls support the premise that young men have become overwhelmingly conservative in the past four years — while women ages 18 to 29 went overwhelmingly left, in part because of concerns over reproductive rights.\n\nYoung women supported Harris over Trump by 18 points, while young men backed the president-elect by 14 points,according to Tufts University Tisch College research.\n\nIn South Korea, the “4B” movement — which stands for the four vows that begin with “bi” (“no” in English) — was an offshoot of national protests against the “spycam” epidemic, where women were often unknowingly filmed during sex or while in the bathroom without their consent.\n\nSouth Korean leaders became worried over the “4B” movement when it allegedly began having an effect on the country’s birth rates after launching in 2017 and picking up momentum in 2019.\n\nIn 2021, the country’s president, Yoon Suk-yeo, said feminist movements were “blocking healthy relationships” between men and women in the nation,Chosun reported.\n\nFor three years in a row, the country has recorded the lowest fertility rate in the world, with women of reproductive age having less than one child on average, according to the New York Times.\n\nIn the US, only 25% of men between the ages of 18 and 29 identify as politically liberal, while 40% of women in the same age group do,according to a recent Gallup poll.\n\nExperts say the US political gender divide has led to Gen Z dating woes, as many young men embrace the ideologies of popular podcasters such as Joe Rogan, the Nelk Boys, and Adin Ross — all of whom were thanked for helping to get the president-elect to victory by UFC CEO Dana White during Trump’s Wednesday victory speech at Mar-a-Lago.\n\nSome people have opposed the movement, poking fun at those who have modified their appearances in solidarity and called for extreme measures of divorce.\n\n” ‘Join the Republican Party, keep your hair’: Never thought I’d have to say that,”one user saidin reaction to the movement."
    }
}