{
    "question": "In what ways might President-elect Donald Trump’s selection of his campaign manager, Susie Wiles, as the first female chief of staff shape the management style and priorities of his incoming administration?",
    "content": {
        "source_1": "On one hand, Susie Wiles is the generous neighbour who brings you casseroles and sends you flowers when you’re in the hospital. On the other, she’s a ruthless political operator who was the mastermind behind getting Donald Trump back to the White House.Alex Hannafordtalks to those who know her to find out how she became one of the few people who can handle her boss...\n\nOn her Twitter/X profile, she wears a blouse and cardigan, drop earrings, and a gold necklace, her grey hair perfectly set. But Susie Wiles’ “Golden Girl”, grandmotherly image belies the role that consumes her. Wilesis one of the most powerful players in Republican politics, who ranDonald Trump’s campaign for re-electionand who has just become his nextchief of staff.\n\nIn his statement on Thursday evening Trump said that Wiles “just helped me achieve one of the greatest political victories in American history” and “is tough, smart, innovative, and is universally admired and respected”.\n\n“It is a well deserved honour to have Susie as the first-ever female chief of staff in United States history,” he continued. “I have no doubt that she will make our country proud.”\n\nWiles, 67, is the first woman to be appointed White House chief of staff and in his victory speech in Florida the President-elect Donald Trump mentioned her previously little-known name seven times.\n\n“Let me also express my tremendous appreciation for Susie and Chris —the job you did. Come, Susie,” Trump said. “Susie likes to stay in the back, let me tell you. We call her the ice maiden”, he joked, adding. “She is not in the background (anymore).”\n\nAruthless political operator, for the past 12 months her focus has been on absolute victory. And on Thursday evening, Trump confirmed her as his White Housenew chief of staff.\n\nThe Hillpolitical newspaper called her “the most powerful Republican you don’t know”;The New York Timesdescribed her as “perhaps the most significant voice inside Mr Trump’s third presidential campaign”.\n\nBut who is she, and what makes this cake-baking, bird-watching 66-year-old grandmother tick?\n\nWiles has worked in Republican politics since the late 1970s and went on to become a campaign scheduler onRonald Reagan’s 1980 presidential bid, and later in his administration. In her late twenties, she moved from New Jersey, where she was born and raised, to Jacksonville, Florida, with her then-husband, Lanny, an “advance man” who handled publicity for candidates during political campaigns.\n\nWhen the couple had their two daughters, Katie and Caroline, she took some time out to raise them but then went full-throttle back into the game – eventually running Trump’s Florida operations in his first bid to become president. Many attribute him winning the state by 1.2 percentage points over his rivalHillary Clintonto Wiles.\n\nChoosing to stay in Florida instead of heading to the White House, Wiles focussed her efforts a couple of years later, on helping the Trump-anointed Ron DeSantis in his campaign to succeed Rick Scott as governor. Their relationship soured, with him blaming her for leaks and despite her denials, it is thought he was behind her ousting from the team. She officially left for health reasons in September 2019, but one friend of Wiles told me she was “really down at that point – at the very bottom”, and that leaving presented an existential crisis for her.\n\nBut then, in 2020, she got a call from Trump. He wanted her back on his team. And not only that, he wanted her to head it up.\n\nWiles’s father,Pat Summerall, was a professional football player and later a well-known sports broadcaster. Peter Schorsch, publisher ofFlorida Politics, who has known Wiles for a decade and considers her a friend, says Summerall would reach tens of millions of people each Sunday with his broadcasts and was such a voice of authority that he thinks some of that ability to take control; to command an audience, rubbed off on Wiles. Another former colleague and friend agreed that her gift as a “people person” was probably inherited from her dad but that her warm personality came from her mother, Katherine Jacobs, “who was a wonderful woman”.\n\nHowever, it wasn’t all apple pie and roses. Summerall was an alcoholic and, after divorcing Katherine, was estranged from Wiles and her two siblings, Jay and Kyle, for some time. But, as an adult, Wiles left the door open for him to reconcile, and Summerall credited her with eventually helping get him into rehab for his addiction.\n\nIn 2017, Wiles and Lanny separated. Schorsch described it as a “quiet divorce between two prominent people” but he thinks it had the effect of freeing Wiles up to focus on her political career in her sixties, “to where she can be devoted to whoever her principal is at the time; undistracted when working on a candidate”.\n\nHer soft edges however aren’t enough to hide a reputation for being a rottweiler, unafraid of baring her teeth. As a political operative, “Susie does not f*** around,” Schorsch says. “There is no other way to say it. It’s not that she’s hard, it’s not that she’s mean, but if you try to promote yourself or if you flimflam or you’re not honest about something, Susie will knife you herself.” It’s perhaps a trait her new boss is particularly fond of.\n\nSchorsch recalls an instance when she oversaw the DeSantis campaign and a consultant who was brought in chose to speak to the media when they were told not to: “Susie immediately cut this person off and it took years for them to repair that relationship.”\n\nI don’t want to say she’s made a deal with the devil, but she knows what Trump’s about\n\nBut he says she also possesses this “southern grandmotherly kindness”. For example, he says, she knew the names of the volunteer working tirelessly for the campaign in a far-off county, and she takes care of the people working with her. “She’s very good at offering familial advice to a lot of her young staffers.” He recalls one such staffer had just had a baby and Wiles emphasised the importance of taking time off. “There’s an emphasis on making sure the people working for her are taking care of their home lives too.”\n\nSchorsch says she’d very much fit into the kind of decorum and stagecraft that is a hallmark of British politics. Unlike her boss maybe “she just respects so much of the institutional stuff, the discipline of it all, while at the same time being a very savvy operator”.\n\nIt was a savvy “Team Trump” that recruited Wiles to the campaign. By taking all the “craziness” that surrounds Trump and adding what Schorsch calls a “disciplined ground game”, it seemed to be the sleight of hand helped Trump along to victory. Schorsch noted how Mar-a-Lago became “so much more disciplined since Susie became the chief gatekeeper.”\n\nWhat’s more, he thinks that Wiles sees no need to rein in Trump’s worst excesses. “It’s a much more pragmatic ‘let Trump be Trump’ philosophy: he says certain things to the Maga crowd, but he also offers an incredible tax policy to the billionaire crowd, and they like that. I don’t want to say she’s made a deal with the devil, but she knows what Trump’s about.”\n\nIt’s this ability to think two things at once and instinct to know what people want that makes her such a smart operator. John Delaney hired Wiles when he ran a successful campaign to become mayor of Jacksonville back in 1995, after which she became his chief of staff.\n\n“Four weeks into the campaign she kind of transformed the thinking and the messaging,” he says. And there are certain Trumpian elements to her too – in terms of her ability to connect with a crowd and give them exactly what they want. “She is an absolutely brilliant political savant with incredible instincts about what the public thinks; what can fly,” Delaney says.\n\nDelaney says Wiles wants to help the people she works for reach the goals they are aiming for, even if she doesn’t always agree entirely with their politics. “She has no ego. She’s very much a behind-the-scenes person.” But despite friends and colleagues being willing to talk about her and her ability to do a difficult job, she remains an enigma and fiercely guards her personal life. Even members of the Trump campaign are reluctant to talk about her.\n\nAs for working for Trump, Wiles might not always agree with his delivery, his choice of words or even his political stance on an issue, but Delaney says politics is about what people can overlook in one candidate and what theycan’toverlook in another. In that way, she’s very much like the voters who might have held their noses at the ballot box; “dyed in the wool” Republicans who may not have loved their candidate, but who got over the line.\n\nDelaney doubts that Wiles’ politics always chime with Trump’s. “She would be what I’d call left on LGBT+ issues. And I can’t believe she would necessarily agree naturally with Donald Trump on immigration, but that’s more me speculating.”\n\nDelaney agrees with Schorsch that, political career aside, Wiles is a sweet, good-natured person. “If she lived in your neighbourhood and you were sick, she’d bring over a casserole,” he says. “If you needed an electrician to be let into your house, she’d figure out how to do that. And if you were in the hospital, she’d visit and send you flowers. She’s just a really nice person.”\n\nWhen Wiles is at home, he says she likes to tend her garden and she enjoys cooking. She’s known to be an avid birdwatcher, too, although as one person who knows her told me, “I doubt she’s doing much birdwatching at the moment.”\n\n“And she’s crazy about her girls and her grandkids,” Delaney says. She’s not flashy, doesn’t splurge on five-star hotels, and he says as a practising Episcopalian she’s a “church-every-Sunday person and prays frequently”.\n\nNate Monroe, a columnist for theFlorida Times-Unionnewspaper who has known Wiles in his capacity as a journalist for a decade, says her critics would say that sweet, personable demeanour “masks a very, very calculating, hard-charging operator. As much as she is very well thought of, she is equally feared. And she is a dangerous person to cross.”\n\nIn January, Monroe penned a devastating editorial, castigating DeSantis for his presidential campaign and pointing out personal traits which ensure he “always chooses cruelty over kindness, dog whistles over empathy, divisiveness over grace”. Just to ensure the knife was well and truly twisted, Monroe added: “Who was it that Trump called out during his victory speech [in Iowa], that diminutive figure standing at the periphery of his entourage on stage? Susie Wiles, the adviser DeSantis cast out, is one of Trump’s most trusted confidantes. Oops.”\n\nMonroe says those familiar with Wiles knew that by cutting her out of his inner circle – and humiliating her in the process – DeSantis would eventually get his comeuppance. He also says Wiles is “almost allergic to drama” – which may sound illogical – comical, even – when you consider who her boss is. But Monroe has another take. Perhaps it’s a good fit. Perhaps, in Susie Wiles, Donald Trump has found a calm, steady hand.\n\nJoin thought-provoking conversations, follow other Independent readers and see their replies",
        "source_2": "The new team entrusted with delivering Donald Trump's agenda is in place, featuring several contentious picks.\n\nAhead of his return to the White House on 20 January 2025, he appointed Fox News host and military veteran Pete Hegseth as defence secretary and vaccine sceptic Robert F Kennedy Jr as health secretary—both confirmed by the Senate.\n\nMarco Rubio is the secretary of state, while billionaire supporter Elon Musk is advising on mass layoffs, contract terminations, and a drastic federal government downsizing.\n\nFlorida SenatorRubio, 53,was confirmed as US secretary of state just hours after Trump was sworn into office.\n\nHe is now serving as the top US diplomat when representing the country overseas, and also the president's main adviser on foreign affairs.\n\nRubio, who is the first Latino person to hold the post in US history, takes a hawkish view of China. He opposed Trump in the 2016 Republican primary but has since mended fences.\n\nHegseth, a military veteran and Fox News host with no prior political experience,  was confirmed as defence secretary less than a week after Trump's inauguration.\n\nHis appointment was highly anticipated amid ongoing wars in Ukraine and Gaza. \"Nobody fights harder for the troops,\" Trump said of Hegseth.\n\nAfter Hegseth's nomination it emerged that he was investigated in 2017 for an alleged sexual assault. He was never arrested or charged and denies the allegation.\n\nHis lawyer confirmed he paid a woman that year to stay silent about a separate assault claim he feared could cost him his Fox job—an accusation he also denies.\n\nTrump's first pick for attorney general, former Florida Congressman Matt Gaetz,withdrew after a weekof controversy over a congressional investigation into sexual misconduct and drug allegations against him, which he denied.\n\nSix hours later, Trump named former Florida Attorney General Pam Bondi as his replacement. \"Pam was a prosecutor for nearly 20 years, tough on violent criminals, and made Florida's streets safe,\" he wrote.\n\nBondi previously served on Trump's Opioid and Drug Abuse Commission and was part of his defence team during his first impeachment trial.\n\nBurgum, the former governor of North Dakota, leads the Department of the Interior, which is responsible for the management and conservation of federal lands and natural resources.\n\nA software entrepreneur who sold his small company to Microsoft in 2001, Burgum briefly ran in the 2024 Republican primary before dropping out, endorsing Trump and quickly impressing him with his low-drama persona and sizeable wealth.\n\nRFK Jr, as he is known, is an environmental lawyer, vaccine sceptic and the nephew of former President John F Kennedy. He recently added leading the Department of Health and Human Services to his resume.\n\nDespite having no medical qualifications, Kennedy, 70, now has broad remit over US federal health agencies - including those that oversee approval of vaccines and pharmaceuticals.\n\nKennedy has endorsed a number of health claims that are not backed by scientific evidence, including many on vaccines, which have concerned many medical experts.\n\nTrump has nominated Makary to lead the Food and Drug Administration, the organisation responsible for the safety of prescription drugs and vaccines .\n\nTrump announced in his nomination that Dr Makary would be ideal to \"course-correct and refocus the Agency\".\n\nThe Johns Hopkins University professor is an author, surgeon and trained cancer specialist. He spoke to conservative media outlets during the Covid-19 pandemic, questioning the need for masks and expressing concerns over the Covid vaccine among young children, which research showed helped prevent severe illness.\n\nFormer Georgia congressman Doug Collins leads the US Department of Veterans' Affairs.\n\nCollins was a Trump loyalist when he served in Congress from 2013-21 and an outspoken advocate for the president during both impeachment hearings.\n\nAn Iraq war veteran who now serves as a chaplain in the US Air Force Reserve, Collins left Congress for an unsuccessful bid for the Senate in his home state of Georgia.\n\nFormer South Dakota Governor Noem is in a key role in the administration, overseeing US security, including its borders, cyber-threats, terrorism and emergency response.\n\nThe agency has a $62bn (£48bn) budget and employs thousands of people. It incorporates a wide variety of agencies under its umbrella, ranging from Customs and Border Protection to the Federal Emergency Management Agency.\n\nThe former congressman and Fox Business host leads the Department of Transportation.\n\nHe is in charge of aviation, automotive, rail, transit and other transportation policies at a department with an annual budget of roughly $110bn.\n\nIn the role, the secretary can expect to face a number of safety-related aviation issues, including a series of deadly plane crashes in the US in the early months of 2025.\n\nOil and gas industry executive Wright leads the Department of Energy, where he is expected to fulfil Trump's campaign promise to \"drill, baby, drill\" and maximise US energy production.\n\nWright, the founder-CEO of Liberty Energy, has called climate activists alarmist and likened Democrats' push for renewables to Soviet-style communism.\n\nIn a video posted to his LinkedIn profile last year, he said: \"There is no climate crisis, and we're not in the midst of an energy transition either.\"\n\nLutnick was the co-chair of Trump's transition team.\n\nTrump said Lutnick, as a member of the cabinet, would spearhead the administration's \"tariff and trade agenda\".\n\nThe billionaire and former CEO of the investment firm Cantor Fitzgerald is overseeing 50,000 employees tasked with growing the economy and creating jobs, among other goals.\n\nWorld Wrestling Entertainment (WWE) co-founder and Trump transition co-chair, McMahon, was picked for education secretary.\n\nA long-time Trump ally, McMahon led the Small Business Administration during Trump's first presidency and donated millions of dollars to his presidential campaign.\n\nTrump has promised to shut down the education department - a job McMahon could be tasked with if she wins Senate confirmation.\n\n\"I wholeheartedly support and agree with this mission,\" she said during her confirmation hearing.\n\nScott Bessent leads the Treasury Department, a post with wide oversight of tax policy, public debt, international finance and sanctions.\n\nA Wall Street financierwho once worked for liberal billionaire George Soros, Bessent was an early backer of Trump's 2024 bid and brings a relatively conventional resume to the role.\n\nOn the campaign trail, Bessent told voters that Trump would usher in a \"new golden age with de-regulation, low-cost energy, [and] low taxes\".\n\n\"[He] has long been a strong advocate of the America First Agenda,\" Trump said about his pick.\n\nChavez-DeRemer has been selected by Trump to lead the US Department of Labor - which oversees worker health and safety and workforce laws and administers unemployment and workers compensation.\n\nChavez-DeRemer had been serving in the US Congress since 2023 but lost her re-election bid in Oregon in the November election, despite winning strong trade union support.\n\nTurner, an NFL veteran and motivational speaker, leads the US Department of Housing and Urban Development (Hud), which aims to address the country's housing needs.\n\nTypically, Hud enforces laws, prevents discrimination and provides assistance to those in need, through both low-income housing and helping Americans avoid foreclosure.\n\nTurner served as the executive director of the White House Opportunity and Revitalization Council during Trump's first term.\n\nRollins grew up on a farm, but her most recent job was as co-founder and head of the America First Policy Institute, a think tank to promote Trump's public policy agenda.\n\nRollins graduated from the Texas A&M University with a degree in agriculture development and later obtained her law degree from the same university.\n\nAs agriculture secretary, she oversees farm subsidies, federal nutrition programmes, meat inspections and other facets of the country's agricultural industry.\n\nOutside the 15 department heads who make up the core of the cabinet, there are several other roles that are often given cabinet-rank, like the FBI director and the head of the Environment Protection Agency (EPA). Some of them require Senate approval, but others do not.\n\nTrump tapped close ally and billionaire entrepreneur Elon Musk to lead what he has termed a Department of Government Efficiency.  It is not a cabinet-level department or agency approved by Congress, but it does include paid staff with access to various government agencies.\n\nKnown as Doge - a nod to a cryptocurrency promoted by Musk - it serves in an advisory capacity to \"dismantle government bureaucracy, slash excess regulations, cut wasteful expenditures and restructure federal agencies\", Trump said.\n\nMusk, the world's richest man, has proven to be one of Trump's most controversial picks as he has suggested massive cuts to the federal workforce and government funding.\n\nThe BBC’s Nomia Iqbal speaks to voters in Philadelphia, where the tech billionaire campaigned for the president and even gave away a few $1m cheques.\n\nThe former US president says he has no regrets over his late withdrawal in the contest against Donald Trump.\n\nAged just 10 when his father first became president, he's now well over six feet tall, and goes to New York University.\n\nThe US president spoke about his plans for the second Trump administration, as well as criticising the 'corrupt establishment'.\n\nWatch the historic moment when the 45th president is returned to power as he takes the oath of office.\n\nElon Musk, Mark Zuckerberg and Jeff Bezos were among those invited inside the Capitol for Donald Trump's swearing in.\n\nThousands of people joined in on demonstrations as the United States prepares to inaugurate its new president.\n\nThe outgoing US president warned against power in the hands of the wealthy, the threat of the tech industry and climate change.\n\nTrump's pick for US attorney general was pressed on claims of election fraud and pardons for January 6 rioters.\n\nDonald Trump's defence secretary nominee was asked about his stance on women in combat and his alleged excessive drinking.\n\nHarris, who Trump defeated in the 2024 election, presided over the event as required by the US Constitution.\n\nAmong the allies the president-elect has chosen to join his administration are contentious figures, including among fellow Republicans.\n\nThe president-elect has nominated RFK to lead the Department of Health and Human Services.\n\nThe suspect used an “improvised incendiary device” to start the fire in Portland, Oregon, ahead of the US election.\n\nA week after losing the election, Kamala Harris's team are still appealing for funds.\n\nRepublicans have won control of both chambers of Congress, yielding Trump limited congressional oversight for at least 2 years.\n\nThe president and president-elect shook hands as part of a long-standing tradition signifying the transfer of power.\n\nGiven all the things they’ve said about each other, Joe Biden and Donald Trump’s meeting could be really awkward.\n\n'I think Putin believes that he knows how to play Trump', says Trump's former adviser John Bolton.\n\nThe Russian president says he was impressed by Trump's reaction to the first assassination attempt against him.\n\nThe accused says his attorneys were not answering his questions and that they were \"a million miles apart\".\n\nJoe Biden's son directs expletive-filled accusations at the Hollywood actor for his part in the former president quitting the campaign.\n\nThe BBC’s Nomia Iqbal speaks to voters in Philadelphia, where the tech billionaire campaigned for the president and even gave away a few $1m cheques.\n\nTasked with reducing government spending and cutting jobs, the agency has faced legal challenges.\n\nThe former US president says he has no regrets over his late withdrawal in the contest against Donald Trump.",
        "source_3": "President-elect Donald Trump has named his campaign manager, Susie Wiles, to serve as his White House chief of staff. Wiles is the first known appointee for President Trump’s second term, and will serve as the first female chief of staff.\n\nSusan Wiles tapped for Trump Chief of Staffpic.twitter.com/E7LqM0DiQD\n\nWiles, nicknamed the “ice maiden,” is a longtime GOP campaign manager consultant,who ranthe 2010 successful gubernatorial campaign of Rick Scott (R-FL) and the 2012 presidential campaign of former John Huntsman (R-UT), and assisted Ron DeSantis (R-FL) in his gubernatorial campaign in 2018. Wiles also ran the Trump campaign’s successful operations in Florida in both 2016 and 2020.\n\n“Susie is tough, smart, innovative, and is universally admired and respected. Susie will continue to work tirelessly to Make America Great Again,” Trump announced in his statement. “It is a well deserved honor to have Susie as the first-ever female Chief of Staff in United States history. I have no doubt that she will make our country proud.”\n\nMason is a contributor atThe American Conservativeand a senior editor at theAmerican Postliberal.\n\nYour support helps us continue our mission of providing thoughtful, independent journalism. With your contribution, we can maintain our commitment to principled reporting on the issues that matter most."
    }
}