{
    "question": "In what ways could the reported shifts and turnout surges among minority voter blocs in swing states reshape party strategies and coalitions in future elections?",
    "content": {
        "source_1": "In a rebuke of the Biden administration’s handling of Israel’s brutal bombing campaign of Gaza and Lebanon, the city of Dearborn, Michigan, has broken in favor of Donald Trump, with 39.6 percent of votes cast.\n\nDearborn is the largest majority Arab American city in the country, and as of11:35 p.m. ESTTrump had 46.8 percent of the vote compared to 27.8 percent of the vote for Harris and 22 percent for Green Party Candidate Jill Stein.In 2020, Joe Biden won the city with a 74.2 percent of the vote, compared to 24.2 percent for Trump.\n\nOver the past year, there were concerns that Democrats wouldlose groundwith the state’s Arab American and Muslim populations due to the Biden administration’ssupport of Israel’s brutal war on Gazaover the past year. In Dearborn, those concerns appear to have some merit and show that Democrats should not have dismissed Arab American and Muslim voters. The Harris campaign refused to have an Arab speaker at theDemocratic National Conventionin August, and just last week, the party sent Bill Clinton to the state, where he drew ahuge backlashfor saying Israel was “forced” by Hamas to kill civilians in Gaza. *\n\nStein made inroads in the city, holding acampaign eventthere in September and supporting an immediate cease-fire in the war, saying, “We do not need and will not tolerate genocide in Gaza.”\n\nOverall in Michigan, the Associated PressshowsHarris trailing with 1,408,266 votes, or 45.9 percent compared to Trump’s 1,604,225 votes, or 52.3 percent.\n\n*This piece has been corrected to note that Muslim speakers were not missing at the DNC\n\nTexas elected Julie Johnson to replace Representative Colin Allred on Tuesday, marking the first time that the Lone Star State has chosen an openly LGBTQ person to represent it in Congress.\n\nThe Democrat won Texas’s 32nd Congressional District by a landslide, pulling more than 60 percent of the vote against Republican Darrell Day, reportedThe Dallas Morning News. She will represent parts of Collin, Dallas, and Denton Counties.\n\nBut Johnson’s win isn’t just a local victory for LGBTQ Texans—it’s also a regional one. Johnson’s election makes her the first queer representative in Washington from the South, according to Austin-basedKUT News.\n\n“Tonight, Team Julie made history,” Johnson wrote in apostafter the results were called. “I am incredibly honored and humbled that you have elected me to be your Representative for the 32nd district. Together, we have shattered barriers and proven that representation matters.”\n\n“This is just the beginning of the work ahead, but tonight, let’s celebrate this historic moment and our progress together,” Johnson wrote, thanking the “countless individuals” who “fought for equality and inclusion.”\n\n“Rest assured, I am committed to continuing this journey with the same passion and dedication, and I will not rest until we achieve our shared goals,” she added.\n\nKamala Harris has secured victory in the integral blue dot of Nebraska, bringing her one step closer to her 270 to win.\n\nHarris won the single electoral vote from Nebraska’s 2nd congressional district, the Associated Press called Tuesday evening.\n\nThe blue dot was important to Harris’s campaign, and she now has 210 electoral college votes to Trump’s 230 votes, as both candidates race toward the 270 votes needed for victory. Trump has already pulled off a victory in the battleground states of North Carolina. Results in the other battleground states have yet to be announced.\n\nOmaha has been a pain in Republicans’ sides throughout the election cycle. Nebraska is one of only two states with a split electoral vote system, giving those living in the state’s largest city a special role in determining the presidential election. That’s why MAGAsought to change the stateto a winner-take-all system earlier this year.\n\nWhile Harris and Tim Walz, who is from the state, won the district’sone electoral vote, Trump will take Nebraska’s remaining four.\n\nDemocrats were perhaps buoyed to go to the polls thanks to Nebraska’s two abortion-related, and slightly confusingly worded, ballot questions. Also perhaps aiding in Harris’s victory, thousands of Nebraska’s former felons, many of whom live in or near Omaha, wereenfranchisedless than three weeks before the election.\n\nAs results continue to trickle in, Walz should take a second to celebrate his home state win.\n\nRepublicans have taken control of the U.S. Senate, according to theAssociated Press.\n\nRepublicans held 51 seats Tuesday night and Democrats held 42. There are still seven seats to be called.\n\nAhead of the election, several GOP contenders found themselvesstrugglingin states where the top of the ticket, Donald Trump, saw considerable enthusiasm.\n\nRepublican senators found themselves met by aggressive opponents. In Nebraska, Senator Deb Fischer found a tough contender in independent candidate Dan Osborn. Meanwhile, Texas Democratic candidate Colin Allred appeared to gain traction ahead of the election in his race against Republican Senator Ted Cruz.\n\nAnd Republican challengers seemed to falter against Democratic incumbents. In Arizona, Kari Lake previously trailed Democratic Representative Rueben Gallego by multiple points, even as Kamala Harris and Trump found themselves tied. Ohio’s Democratic Senator Sherrod Brown held a lead against Bernie Moreno. And in Montana, Republican challenger Tim Sheehy held only a slim four-point lead over Senator John Tester, even though Trump led Harris by 17 points in the Treasure State.\n\nBrown lost his seat. Gallego and Tester’s races have not yet been called.\n\nRepublican Senator Deb Fischer won her re-election Tuesday night, dashing Democratic votes that independent Dan Osborn would successfully oust her from office.\n\nFischer won against the former leader 51.5-48.5 percent, with 72 percent reporting, according to the Associated Press.\n\nOsborn, who led 500 workers at his Kellogg’s plant through a three-month strike to end a two-tiered benefits system and stop plant closings, led an impressive campaign against Fsicher, who has held the Senate seat since 2013. The Democratic Party did not field a candidate in the race, but given Osborn’s political views, his win was expected to be a serious setback for the GOP.\n\nWith Fischer’s victory, Republicans have secured control of the Senate. They currently have 51 seats to Democrats’ 42 seats, with seven seats still remaining to be called.\n\nOsborn refused to seek an endorsement from any political party including the Democrats, citing his desire not to be beholden to the money or special interests behind them. “I want to be clear that I’m an independent,” Osborn told theNebraska Examinerin May. “I want to stay true to who I am.”\n\nStill, his pro-labor stances were expected to have him caucusing with the Democrats similar to Independent Senator Bernie Sanders.\n\n“I hadn’t been a very political person until corporate greed came knocking on my door a few years ago, when I was president of my local union, and we went out on strike, at a time where the company was making record profits,” Osborn toldSemaforin September.\n\nWith Fischer’s victory, Democrats’ hopes to retake the Senate comes to a sad end.\n\nMissouri overturned a total abortion ban Tuesday, with the majority of the state voting to enshrine abortion protections in the state constitution.\n\nRoughly 53.2 percent of the state voted in favor of Amendment 3, achieving the simple majority necessary to protect reproductive freedom in Missouri, including an individual’s decision to have an abortion up to the point of viability.\n\nFetal viability typically occurs during the second trimester, between 23 and 24 weeks of pregnancy, but the ballot measure has a different definition for the developmental stage. Instead, it describes fetal viability as “the point in pregnancy when, in the good faith judgment of a treating health care professional” there is a “significant likelihood of the fetus’s sustained survival outside the uterus without the application of extraordinary medical measures.”\n\nThe measure, called theRight to Reproductive Freedom Initiative, solidifies that the government has no role in a person’s “fundamental right to reproductive freedom,” including but not limited to prenatal care, childbirth, postpartum care, birth control, abortion care, miscarriage care, and respectful birthing conditions. It undoes the Show-Me State’s total abortion ban, which took effect one hour after the Supreme Court overturnedRoe v. Wadein 2022.\n\n“The right to reproductive freedom shall not be denied, interfered with, delayed, or otherwise restricted unless the Government demonstrates that such action is justified by a compelling governmental interest achieved by the least restrictive means,” the ballot measure read in part. “Any denial, interference, delay, or restriction of the right to reproductive freedom shall be presumed invalid.”\n\nGovernmental interest was specified as compelling only if it had the limited effect of “improving or maintaining the health of a person seeking care” and was consistent with “widely accepted” evidence-based medicine and does not “infringe on that person’s autonomous decision-making.”\n\nMissouri is one of10 statesthat have placed abortion on the ballot this year—the most to appear in a single year in U.S. history.\n\nDemocratic state Senator John Mannion has defeated Republican Representative Brandon Williams, marking an important victory for New York Democrats in the states 22nd congressional district.\n\nMannion earned 53.9 percent of the vote with 84 percent reporting.\n\nFor months ahead of the election, Williams was the only House Republican whose seat “leaned Democrat,”accordingto Cook Political Report, making it an essential marker for Democrats as they attempted to retake the House. Williams narrowly won the seat by fewer than 3,000 votes during the 2022 midterm elections, when Republicans flipped four seats across the state.\n\nLike many pro-Trump Republicans, Williams has attempted to paint his opponent as weak on crime, spending nearly $3 million on attack ads with help from the National Republican Congressional Committee and the Congressional Leadership Fund,accordingtoThe New York Times.\n\nDespite Republican spending, Mannion appeared to have a sizable lead ahead of Election Day. One Democratic PAC called the 314 Action Fund canceled a $600,000 ad and mailer blitz effort for Mannion because he didn’t appear to need the extra boost,accordingto Syracuse.com.\n\nAn anti-abortion, Trump-endorsed Republican propelled byMitch McConnellandcryptocurrency PAC dollarshas won the Ohio Senate election—flipping a key seat for Republicans.\n\nRepublican Bernie Moreno beat incumbent Democratic Senator Sherrod Brown 50.5 percent to 46.1 percent according to the Associated Press, which called the race on Tuesday evening, with 91 percent of votes counted.\n\nThis is a much-needed win for Republicans,  who now hold a nine-seat majority in the Senate, with 11 votes still remaining to be called.\n\nThanks to dark money, the only Democratic senator in the state was finally unseated after first being elected in 2007. The race hadgarnered more ad spendingthan any other Senate race in history with nearly $500 million spent between the two candidates.\n\nOn the Republican side, Defend American Jobs, a super PAC tied to the cryptocurrency industryspent over$40 million to support Bernie Moreno. While the Senate Leadership Fund, a super PAC affiliated with  Senate Minority Leader Mitch McConnell spentover $160 millionfor Moreno, more than any other Republican Senate candidate this year.\n\nTheir investment made up for the fact that Moreno continued to flaunt his extremist MAGA views on the campaign trail, rallying against “wokeness” and bashing reproductive rights.\n\n“You know the left has a lot of single-issue voters,”Moreno saidback in September. “Sadly, by the way, there’s a lot of suburban women, a lot of suburban women that are like, ‘Listen, abortion’s it! If I can’t have an abortion in this country whenever I want, I will vote for anybody else!’\n\n“It’s a little crazy, by the way, but, especially for women that are past 50. I’m thinking to myself, ‘I don’t think that’s an issue for you,’” Moreno continued.\n\nMoreno also made headlines for allegedlylying about his business dealingsand for appearing ona gay hookup app, despite his anti-LGBTQ+ record.\n\nThe Colombian immigrant Moreno later went on to copy Trump’s playbook and spread racist rumors about Haitian immigrants in Springfield, Ohio.. In September, Moreno wrote that thousands of “illegal Haitians” were “sucking up social services and even reportedly killing and eating pets.”\n\n“We need to deport illegals, not invite them to wreak havoc on our communities,”he added.\n\nThe MAGA Republican won out as Trump won the state, as he did in 2016 and 2020.\n\nDonald Trump has won North Carolina, securing 50.8 percent of the vote over Vice President Kamala Harris.\n\nIt’s the third time in a row that the Tar Heel State has sided with the MAGA leader since he entered national politics in 2016. That year, Trump convinced North Carolinians to turn out en masse for him, winning by a margin of nearly four percent, with more than 177,000 votes over Hillary Clinton.But that level of support crumbled after Trump spent four years in office, after which he won the swing state by just 1.3 percent over President Joe Biden.\n\nThe outcome in North Carolina brings Trump to 230 electoral votes. He needs just 40 votes more to return to the White House.\n\nElon Musk says his America PAC isn’t going anywhere after Election Day.\n\nAt the end of an X Space event Tuesday evening, Musk told his fans that his political action committee will “keep going after this election.”\n\nMusk added that he is already “preparing for the midterms and any intermediate elections, as well as looking at elections at the district attorney level.”\n\nThe billionaire has already donated nearly $119 million of his own money to the PAC.\n\nAmerica PAC spent more than $19 million this election boosting Republicans in over a dozen House races around the country. Some of the races where Musk spent big, such as New York’s 17th district and New Jersey’s 7th district, could go his way—but for the most part Musk’s investments so far are a mixed bag. What he did succeed in, however, is dominating the airwaves and majorly sucking up to Donald Trump throughout the past several months. The PAC has spent a whopping $152 million to attempt to elect Trump as president.\n\nWhile leading the America PAC, which essentially ran Trump’s ground game, Musk faced many struggles and legal challenges, mostly propelled by his sketchy actions. These included adata-scraping operation,a glitchy app,poor treatment of door knockers, and of course,his $1 million bribesto swing state voters.\n\nMusk’sfrightening QAnon turn, coupled with his willingness to spend, unfortunately means his PAC will be something to watch going forward.",
        "source_2": "According to Fox News andCBS, Donald Trump is nowprojectedto win the crucial battleground state of Pennsylvania, and with it the presidency. As victory looks increasingly assured, a few trends stand out from results in the Keystone State.\n\nTrump’s campaign promised that his appeal among Hispanic voters would boost him in Philadelphia and the smaller line of cities across eastern Pennsylvania — Lancaster, Reading, Allentown, Bethlehem, Easton, and Hazelton. Kamala Harris’s campaign team thought the group would turn out for Democrats, as it had done in previous years, spurred on perhaps by the widespread media coverage ofan offensive jokeabout Puerto Rico told by a comedian during a Trump rally at Madison Square Garden.\n\nIt appears that Trump had the better argument. Northampton County (home to Easton and most of Bethlehem), which had voted for Trump in 2016 and Joe Biden in 2020, appears to decisively favour Trump in 2024. Next door Lehigh County — home to Allentown — went to Harris, but by five percentage points less than Biden managed in 2020. In Berks County, where Reading is the county seat, Trump did five points better. In Luzerne County, containing Hazelton, he looks set to improve by three or four percentage points.\n\nIn short, his appeal to Hispanic Pennsylvanians has clearly succeeded.\n\nThe other much-studied bellwether county besides Northampton wasErie County, a jurisdiction Trump carried in 2016 and lost in 2020. This time, he has won with a slim margin. One surprise appears to have come in Centre County — home of Penn State University, a blue dot in a red field — a place Trump never won. Tonight, he leads by four percentage points with 83% of votes in.\n\nAll this looks to be a continuation of the political realignment that Trump has ushered into the region since 2016. But what of the elephant in the room: Philadelphia and its four suburban counties? The GOP nominee had fared worse than typical Republicans in the suburbs in 2016, and the trend continued in 2020. In 2024, though, he has stemmed these losses. Trump looks to have lost Chester, Delaware, and Montgomery Counties, but by about the same amount as in 2020, possibly by slightly less. The fourth suburban county, Bucks, is on course to go red.\n\nPhiladelphia has always been a mixed tale for Trump. No Republican has won the Democratic stronghold since 1932, but Trump did better there in 2016 than Mitt Romney had in 2012, taking 15.32% of the vote where Romney had 13.97%. In 2020, while doing worse in the rest of the state,Trump improved in Philly, taking 17.86%. This time around, Democrats crowed that Philadelphia would give the party the votes it needed to win. “Voter turnout is extremely high,” Philadelphia Democratic Party ChairmanRobert Brady told the press. “I’ve been doing elections for 50 years chair and I’ve been chairman for 40 years and now it’s the highest we’ve ever seen for this point.”\n\nWith 89% of the vote reporting, Trump appears to have defied Brady’s boast, taking over 20% of the vote. The old way for Democrats to win Pennsylvania was to run up a big majority in the major cities of Philadelphia and Pittsburgh and hope it was enough to beat the Republican totals in the rest of the state. But Philadelphia’s centrality to Democratic plans is not what it was. It has become the party of the suburbs and now looks to more reliable turnout from those regions than from the city.\n\nRepublicans are also reassessing how to win in Pennsylvania, and Trump has shown the path forward for them. Someone unafraid to campaign in Democratic strongholds such as North Philadelphia, Reading, and Allentown can win enough votes there to make the difference statewide.\n\nTrump has been working since 2016 to realign America’s voting blocs, shifting the Republican Party to a multi-ethnic coalition of workers and small businesspeople. That message resounded tonight in Pennsylvania — or at least in enough of it to make the difference in the national race.\n\nKyle Samminis the managing editor ofBroad + Liberty.Follow him on Twitter at @KyleSammin.\n\nWe welcome applications to contribute to UnHerd – please fill out the form below including examples of your previously published work.Pleaseclick hereto submit your pitch.\n\nPleaseclick hereto view our media pack for more information on advertising and partnership opportunities with UnHerd.",
        "source_3": "Republicanscould see a boostin Pennsylvania from a demographic rarely seen at the polls: the Amish.\n\nThe state’s famed “Pennsylvania Dutch” registered to vote in “unprecedented numbers” in response to a January federal raid on a local raw milk farm in Bird in Hand, Pa., a source familiar with the situation told The Post.\n\nThe Pennsylvania Department of Agriculture stormed Amos Miller’s farm Jan. 4 after reports of illnesses in children linked to raw dairy products purchased there, according to the local media outletLancaster Farming.\n\nThe Amish community saw the move as an overzealous reach by the government and was planning to vote for GOP presidential candidate Donald Trump, whose party favors less government intervention.\n\n“That was the impetus for them to say, ‘We need to participate,’ ” the source said of local Amish voters. “This is about neighbors helping neighbors.”\n\nFollow The Post’s live updates on the 2024 election for the latest reactions, news and more\n\nThe Amish community rallied around Miller, who cited his religious beliefs as a reason for not adhering to Food and Drug Administration guidelines.\n\n“If you think about Amish people and their connection to nature, I mean, some of these people work in the fields barefoot to be closer to the earth,” the source told The Post.\n\nActual numbers of Amish voters were unclear as of Tuesday night, though horse-and-buggy rigs were seen at polling locations in photographs from the region."
    }
}