{
    "question": "How might the machine malfunctions, absentee ballot reprocessing, and bomb threats reported across several swing states on Election Day shape public confidence in the 2024 results and the likelihood of extended counts or legal challenges?",
    "content": {
        "source_1": "FILE - Voting equipment at the Allegheny County Election Division Elections warehouse in Pittsburgh is prepared to be moved to polling sites throughout Allegheny County, Thursday, Nov. 3, 2022. (AP Photo/Gene J. Puskar, File)\n\nAll election equipment used by Pennsylvania counties—ranging from ballot-marking devices used for some in-person voting to machines that tabulate mail and absentee ballots—is put through a pre-election stress test known as logic and accuracy testing.\n\nStill, things can break down unexpectedly at the most inopportune moment—like voting machines on Election Day.\n\nIn Pennsylvania, there are multiple backups in place so voters can cast a ballot if there are issues with the voting machines.\n\nAccording to Jeff Greenburg, a 13-year election director veteran who is now a senior advisor on election administration for The Committee of Seventy, a nonpartisan organization focusing on engagement and public policy advocacy, counties typically have roving technicians respond if issues arise. He said they are dispatched as quickly as possible once the issue is reported.\n\nTypically, reports go from the precinct to the county election office. If the issue cannot be resolved or if legal action is required, the county solicitor and Board of Elections will determine if any further steps are required.\n\n“If there is a significant enough impact on the voting location, the BOE could petition the county courts to extend hours,” Greenburg said.\n\nEach county election office has a process in place to disseminate important information on Election Day. This can be through the county’s website, social media accounts or through local news outlets.\n\n“People should only rely on trusted sources for this information,” Greenburg said. “Whether it’s through the county’s web site or social media accounts, or through local media outlets.”\n\nCounties also have emergency paper ballots if machines cannot be repaired or replaced on Election Day.\n\nEva Weyrich, Juniata County’s director of elections, said the county only uses paper ballots and each polling place has one machine tabulator.\n\nEven if something goes wrong with the tabulator, voters will still be able to fill out their ballots while a technician travels to the precinct to fix the issue.\n\nWeyrich said the county has never had a machine go down for the whole day.\n\nJuniata County prefers the hand-marked paper ballot system, according to Weyrich.\n\n“We can always go back and hand-count the ballots to verify that the machine was accurate,” Weyrich said.\n\nForty-seven counties have voters fill in ballots by hand. The other 27 have voting machines that print paper ballots with the voter’s selections that can also be audited after an election.\n\nKeystone senior community editor Patrick Berkery contributed to this report.\n\nThe Associated Press is an independent global news organization dedicated to factual reporting.\n\nDemocrats are pushing those who live in Philadelphia and the surrounding counties and voted by mail to check the status of their mail-in ballots and...\n\nPA House Democrats were able to pull off the unthinkable and hold onto the PA House by a 102-101 majority following Tuesday’s election results.  It...\n\nThe Associated Press called the race Thursday, though Casey did not concede. With votes still being counted, McCormick led Casey by about 31,000...\n\nOur newsletter readers shared their thoughts on the outcome of the pivotal 2024 presidential election. Because we live in a democracy, we had an...\n\nHarris delivered her remarks at Howard University, her alma mater and one of the country's most prominent historically Black schools, in the same...\n\nPennsylvania Republicans swept the three statewide row offices and defeated longtime Democratic incumbents across the board.\n\nWe talked to an expert about the rise in anxiety during the 2024 election season, and what to do about it.\n\nDonald Trump was elected the 47th president of the United States on Wednesday, an extraordinary comeback for a former president who refused to accept defeat four years ago, sparked a violent insurrection at the U.S. Capitol, was convicted of felony charges and survived two assassination attempts.",
        "source_2": "The City of Milwaukee restarted the processing about 31,000 absentee ballots after an election observer brought to officials' attention that doors covering on-off switches on some of the machines that are used to tally those votes had not been properly closed, the city's top election official said.\n\nMilwaukee Election Commission Executive Director Paulina Gutiérrez Tuesday evening said the decision to begin recounting those ballots was made out of an “abundance of caution\" and in consultation with Democrats and Republicans.\n\n“I know for a fact that these machines are highly secure, there was no tampering,” she said. “We were able to confirm that.”\n\nGutiérrez did not know why the doors had not been properly closed, which caused seals on those doors to become loose.\n\nShe and other city officials declined to name the senior election official who had not properly closed the doors.\n\nThe unsealed doors cover the on-off button, meaning if the machine had been tampered with it would be turned off, she said. The machines were not turned off, she said.\n\nA turned-off machine “is a very apparent thing that we would all see here in this public sphere,” Gutiérrez said.\n\nThe city ultimately delivered its absentee ballot results on thumb drives to the Milwaukee County Courthouseabout 3:24 a.m. Wednesday. The county uploaded those results to itselection night websiteabout 4:30 a.m.\n\nThe Republican National Committee in a statement accused the city of counting its absentee ballots in \"insecure conditions.\"\n\n\"This is an unacceptable example of incompetent election administration in a key swing state: voters deserve better and we are unambiguously calling on Milwaukee's officials to do their jobs and count ballots quickly and effectively,\" RNC Chairman Michael Whatley and Co-Chair Lara Trump said in the statement. \"Anything less undermines voter confidence.\"\n\nIn Wisconsin, municipalities cannot start counting their absentee ballots until 7 a.m. on Election Day. A bipartisan bill that would have allowed ballot processing to begin the day before was killed in the Republican-controlled state Senate.\n\nGutiérrez responded to the RNC by saying the city's central count is \"one of the most secure operations.\"\n\n\"We have been fully transparent. We brought Democrats and Republicans together to help us make sure that this is secure,\" she said.\n\nDemocratic Party of Wisconsin Communications Director Joe Oslund said the party is \"confident the city will ensure every vote is counted.\"\n\nEven before the error was discovered, city officials were estimating final absentee ballot results wouldn't be released until the early morning hours.\n\nStill, Gutiérrez said the reprocessing of some 31,000 absentee ballots through the machines was going more quickly than the first time around because the ballots were now flatter and election workers were “in their flow.”\n\n(This story has been updated with new information.)",
        "source_3": "Published:19:24 BST, 5 November 2024|Updated:01:42 BST, 6 November 2024\n\nTheFBIsays fake 'Russian bomb threats' have been made to polling places in several states as Americans cast their ballots inone of the closest elections in U.S. history.\n\nPolling places inswing statesof Georgia,MichiganandWisconsinwere targeted in the plot by the Russians.\n\nBut none of the threats have been 'determined to be credible thus far,' the FBI said in a statement on Election Day.\n\n'The FBI is aware of bomb threats to polling locations in several states, many of which appear to originate from Russian email domains.'\n\nRepublican Georgia Secretary of State Brad Raffensperger gives an update on Election Day in Atlanta, Georgia, USA, 5 November 2024\n\nAfter an early morning bomb scare in Atlanta, Georgia, shuttered two polling locations, another round of threats came in the evening halting voting and prompting evacuations.\n\nPolice have responded to Tucker-Reid H. Cofer Library due to a bomb threat on Tuesday evening.\n\nDeKalb County had evacuations at seven different locations - five of them polling stations. Officials there are requesting extensions in voting times and saying those in line there will be allowed to vote.\n\nPolice have done multiple bomb sweeps at different areas as threatening calls have come in.\n\nGeorgia Secretary of State Brad Raffensperger said earlier Tuesday that Russians were involved in the threats, particularly one that shuttered a school and polling location in nearby Fulton County south of Atlanta.\n\n'Georgia is not going to be intimidated. Russia just decided they picked on the wrong Georgia,” Raffensperger said Tuesday. 'They need to pick on the other one in the Black Sea because we’re no going to be intimidated, but we’re just excited about where we are right now.'\n\nThe Arizona Secretary of State's office similarly confirmed Tuesday that 'foreign enemies' like Russia were involved in unsubstantiated bomb threats made in the northern part of the state.\n\nBrad Raffensperger, Georgia Secretary of State, said Russians carried out a phony bomb threat at a polling location on Election Day\n\nCitizens participate in early voting at a Dekalb County advance polling location in Atlanta\n\nFulton County School Police also received threats at a school that was also polling place around 8:15 am ET on Tuesday morning.\n\nFeldwood Elementary School in south Fulton was cleared by authorities and no evidence of a bomb was found.\n\nRaffensperger said: 'We've heard some threats that were of Russian origin. It was a bomb threat.'\n\nHe said that his team did not think that they were 'viable' threats.\n\n'But in the interest of public safety you always check that out,' Raffensperger continued.\n\n'They're not our friends,' the Georgia official said of the Russians. 'They're up to mischief it seems and they don't want us to have a smooth, fair and accurate election.'\n\n'And they think they can make us fight amongst ourselves.'\n\nUltimately the phony bomb threat will not have an impact on the result of the election, authorities confirmed.\n\nDuring a press conference Tuesday afternoon Fulton County Election Director Nadine Williams said that five locations received threats, but only two were evacuated.\n\nShe said the whole disruption lasted less than an hour.\n\nThe impacted polling locations will now stay open later than the expected 7 pm ET closing time.\n\nA family casts their ballots at the Fulton County Ponce de Leon Library voting precinct on Election Day in Atlanta, Georgia\n\nLocal election officials said that the location likely will remain open an additional 30 minutes until around 7:30 pm local time.\n\n'Election integrity is among the FBI’s highest priorities,' the FBI statement continued.\n\n'We will continue to work closely with our state and local law enforcement partners to respond to any threats to our elections and to protect our communities as Americans exercise their right to vote.'\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nBy posting your comment you agree to ourhouse rules.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with ourPrivacy Policy."
    }
}