{
    "question": "What are the implications of nearly half of Gen Z reporting they’ve lied about their vote—alongside notable rates across parties and genders—for interpersonal trust and the accuracy of opinion polling?",
    "content": {
        "source_1": "Half of Gen Z voters — and 1 in 4 U.S. voters overall — have lied to people close to them about who they're voting for, according to the latestAxios Vibes surveyby The Harris Poll.\n\nWhy it matters:Voters 18-27 who came of age during the hyper-polarized Trump era appear to be among the most sensitive to perceived pressure and judgment from friends or loved ones.\n\nBy the numbers:58% of overall voters surveyed say who they're voting for is a private matter.\n\nZoom in:Gerzema says the survey captures two concurrent trends.\n\nBetween the lines:The findings raise big questions about the limits and future of polling, which relies on voters giving responses reflecting their real-life political behavior.\n\nThe other side:In the Vibes survey, men (30%) were nearly twice as likely to say they lied about how they voted as women (17%).\n\nThe big picture:Less than a week from the election, the economy/inflation/wages is still the top category on which voters say they choose candidates. That outranks abortion/reproductive rights about 2 to 1, with border/immigration the third-biggest concern.\n\nGiven the optionto identify their two top issues at stake, Democrats said women's/abortion rights (49%), followed by the economy/inflation (42%). Protecting democracy followed (33%).\n\nWhat we're watching:40% of voters said they planned to wait until Election Day to vote, just in case something changes — with another 8% saying it will probably be a \"gut decision\" in the voting booth.\n\nMethodology: The findings in this Axios Vibes survey by The Harris Poll are based on a nationally representative sample of 2,129 U.S. adults conducted online Oct. 22-24, 2024, among which 1,858 identified were registered voters.",
        "source_2": "As the U.S. presidential election looms, some Gen Zers might be walking around as a liar, liar, (with their) pants on fire.\n\nSo findsAxiosin its poll of more than 1,800 registered voters, conducted by the Harris Poll between October 22 and 24. Almost a quarter (23%) of respondents across generations say they have lied to someone close to them about who they’re voting for, but that number is highest among Gen Z—at 48%. The number of fibbers decreases as respondents age, at 38% of millennials, 17% of Gen Xers, and 6% of boomers.\n\nA veil of secrecy shrouds what has been deemed one of the closest elections in modern history. More than half (58%) of respondents say their vote is a private matter.\n\n“There’s a new privacy emerging here, where it’s far more convenient to either lie or not talk about it,” John Gerzema, CEO of the Harris Poll, told Axios, pointing to prevalent polarization, a fear of post-election unrest, and younger generation’s desire to not engage in in-person conflict.\n\nLying tends to crop up when there’s someone to lie to. In other words, mixed company and increased polarization might increase the likelihood that someone feels like they need to bluff. A third of respondents say they’re not close to family members because of their different political beliefs. That increases to 47% of millennials and 44% of Gen Zers.\n\nDespite some young adults staying secretive, many vocally oppose those who disagree with them. True to Gen Zers’ reputation,a TikTok trendhas cropped up where voters joke that they’re “canceling out” their family members’ votes.\n\nMen are almost twice as likely to lie about their vote than women, at 30% and 17%, respectively. It’s unclear who they’re lying to and why.\n\nBut at the same time, a widely reported gender gap in younger generations is at play. While the verdict is still out, data from Gallup covered by theFinancial Timesfound that men in the U.S., Germany, and South Korea are becoming increasingly conservative. Women, on the other hand, are becoming more liberal—by a gap of 30 percentage points in the U.S.\n\nPointing to the impact of #MeToo as women spoke out against long-standing abuse and sexism, theTimes’John Burn-Murdoch notes there’s a “clear progressive-vs-conservative divide on sexual harassment.” Young women are also more liberal than men when it comes to their stance on immigration and racial justice, Burn-Murdoch adds.\n\nWhile much has been said about polarization in a two-party system, Republicans have actually moved further right than Democrats have to the left, according to a separateGallup surveyof Congress members. In this cycle,abortion rightsare a key part of the ballot after the overturn of Roe v. Wade—which was passed in the 1970s. That’s all to say, women are likely moving left as their politicians and male peers move to the right at an unprecedented pace.\n\nEven with the gender divide, there is at least one thing Gen Zers can agree on: From both sides, young people want their government to address critical issues, like climate change, economic inequality, and democracy’s future. They feel a sense of fatalism at their politicians’ failure to do so, according totwo studiesfrom UC Berkeley researchers.\n\nThe most junior working generation is also the least likely to talk to coworkers about politics and most likely to feel uncomfortable doing so out of all generations, according toGallup.\n\nIt’s perhaps surprising given Gen Z’s reputation of being a moreradicaland vocal generation, but not unexplainable.\n\n“It could be that younger workers are newer to the workforce and less comfortable speaking freely,” Katelyn Hedrick, a co-author of the Gallup analysis, toldFortune.\n\n“They are getting acclimated, forming relationships with people in the organization, and wanting to build a strong career brand which may make them more hesitant to speak about politics at work.”\n\nBoomers are at the top of the corporate ladder, which might be why they’re the least likely to lie to someone about their beliefs. By nature of their seniority and just age, they might be more honest. They’re running the room, after all.\n\n© 2025 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of ourTerms of UseandPrivacy Policy|CA Notice at Collection and Privacy Notice|Do Not Sell/Share My Personal InformationFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.",
        "source_3": "Nearly half ofGeneration Zvoters said they have lied to friends and family about who they have or will vote forin the presidential election.\n\nThe latestAxios-Harris Pollsurveyfound that 48% of voters between the ages of 18 and 27 have lied about their votes. Comparatively, nearly 1 in 4 voters said they have lied overall. Millennial voters were the second most likely age group to lie, with 38%. Only 6% of baby boomers and older said they have lied about their vote.\n\nGen Z voters began to vote in presidential elections starting in 2016 when the highly polarizing former President Donald Trump first ran.\n\nThe poll found that 44% of Gen Z citizens and 47% of millennials said they weren’t close to some family members because of opposing political beliefs.\n\n“There’s a new privacy emerging here, where it’s far more convenient to either lie or not talk about it,” said John Gerzema, CEO of The Harris Poll.\n\nGerzema suggested that since young people in the United States have been raised on smartphones and social media, they lack the proper social skills to address conflict or differing opinions. Therefore, they may just turn to social apps where they can remain anonymous to vent or express political views in an effort to avoid awkward encounters in person.\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nVoters who admitted to lying didn’t tend to be of one political affiliation or the other: 27% of Democrats, 24% of Republicans, and 20% of independents admitted they had lied about their votes."
    }
}