{
    "question": "How might the gap between low measured support for political violence and widespread expectations of election-related unrest shape voter behavior and trust, and what strategies could help de-escalate tensions and correct misperceptions?",
    "content": {
        "source_1": "Researchers have identified two groups more likely to endorse political violence. They aren’t who you think.\n\nEven beforetwo peopleattempted toassassinate former President Donald Trump, national security experts and law enforcement were warning that the United Statesneeded a planto contend with the possibility of political violence on Election Day.\n\nNow, in the final weeks of the campaign, researchers have just publishednew findingsabout the social lives of people who are likely to endorse using political violence, and be willing to use it themselves.\n\nThe results, based on a nationally representative survey of more than 8,000 Americans, may seem counterintuitive. Basically, people open to the idea that political violence is justified tend to exist at opposite ends of the social spectrum. Those who report having no strong personal or work connections were 2.4 times more likely to say political violence is justifiable than people who said they have 1–4 close relationships. That’s not necessarily surprising, given the recent history ofmass shootersandpolitically motivated assailantswho’ve beendescribed by their broader networks as loners.\n\nWhat’s weird, though, is that people with lots of close connections were also a little more likely to endorse political violence. People who said they had 50 or more strong relationships were 1.2 times more likely to endorse political violence.\n\nAnd here’s where it gets a little concerning: The people with no social connections weren’t on average any more likely to say they would be willing to personally commit political violence, even if they believed it was justified. But the people with lots of close relationships? They were 1.5 times more likely than the others to say they’d be willing to be violent for a political cause themselves.\n\nWhat’s going on with those super socially connected people? Julia Schleimer, the researcher who led the study, told Vox over email that, compared to the people with just a few close connections, the 50+ cohort tended to be white, higher in income, slightly more educated, and older. But that’s also true of the demographic in the middle (which reported 10–49 social connections) and they weren’t especially open to the idea of political violence.\n\nIn other words, there were no demographic factors about the group that jumped out to the researchers.\n\n“One limitation of this study is that we don’t have details on the nature or characteristics of people’s social networks, which likely matters a great deal and is an area for future study,” Schleimer said. Butpriorstudies“give us reason to expect that people with very large social networks may be at greater risk for political violence, if those networks are characterized by antisocial norms, outgroup contempt, and extreme views.” That’s particularly true, she said, when the social networks are homogenous. Sometimes those groups form in person, but increasingly, they also develop online, like the Proud Boys and other far-right groupswho organized in the days after Donald Trump’s 2020 election lossandstormed the Capitol on January 6.\n\nThis research, done by University of California Davis’sViolence Prevention Research Programbuilds on data published earlier this year aboutAmericans’ beliefs in political violence. The good news from the earlier work is that a vast majority of Americans are opposed to political violence under any circumstances. The more worrying news? A small proportion of Americans are open to the idea that political violence is sometimes justified.\n\n“I personally think that large-scale political violence is really, really unlikely. I feel more sanguine about that prediction, given our 2024 data,” Dr. Garen Wintemute, director of the program,told Voxthis summer. “But sporadic outbreaks, particularly if the battleground states remain really close — is it possible? Sure. Might there be attempts to intimidate election officials? Absolutely.”\n\nThe Violence Prevention Research Program applies a public health approach to issues like gun violence and political violence — meaning they look for interventions that can try to discourage them from happening. The new findings, Schleimer said, suggest that it’s important to develop approaches that target both those who are very lonely and those who are deeply connected, in, for example, extremist ideological groups. For the lonely, social skills training, community centers, cultural activities and more open and accessible cities can all be helpful. And both groups benefit from anti-violence messages from influentialpublic figuresand onsocial media. For the socially connected people, having a trusted figure who can support them as they begin opening up to different perspectives and challenging the beliefs of their ideology can be especially helpful.\n\nThe ideas sound really simple, but the researchers’ previous work suggests that getting someone to reject political violence is perhaps easier than you might think. “For the would-be combatants, a big number would switch if their family asked them not to, or friends, or even some media sources,” Wintemute told Vox. “We can create a climate of nonacceptance for political violence. And in doing that, we can expect that it will work.” Their findings are encouraging, in that respect. But reaching every person who might be open to political violence, in a highly divided country, with this many guns? That’s the tricky part.\n\nThe lessons liberals should take away from their election defeat — and a closer look at where they should go next. From senior correspondent Eric Levitz.",
        "source_2": "This story is part of a series on electoral violence worldwide. Read the full packagehere.\n\nAmericans are living through an extraordinary era of political violence. For years, political violence has been on the rise across the political spectrum—not just according to anecdotal examples but also based on rigorous long-term studies of a representative sample of U.S. citizens. Indeed, support for political violence has now become “normal,” at least when people are asked about the use of violence to achieve political goals that they also endorse.\n\nViolent populism, meaning the violent mass support for a political leader, party, political ideology, or mass movement, on both the right and left pose a grave threat to modern democracy in the United States.\n\nAmericans are living through an extraordinary era of political violence. For years, political violence has been on the rise across the political spectrum—not just according to anecdotal examples but also based on rigorous long-term studies of a representative sample of U.S. citizens. Indeed, support for political violence has now become “normal,” at least when people are asked about the use of violence to achieve political goals that they also endorse.\n\nViolent populism, meaning the violent mass support for a political leader, party, political ideology, or mass movement, on both the right and left pose a grave threat to modern democracy in the United States.\n\nTo understand public attitudes, the University of Chicago’s Project on Security and Threats (CPOST) has conducted quarterly nationally representative surveys of support for political violence and confidence in democracy since June 2021, fielded by NORC, previously known as the National Opinion Research Center. These surveys show that political violence is supported by determined minorities on both the right and the left and at disturbingly high and stable levels.\n\nThey also show that large fractions of Americans see the nation’s politics as broken and are deeply distrustful of the value of elections to solve problems. They see the leading political candidates for the presidency as dangers to democracy and believe political conspiracy theories about the malicious and corrupt behavior of the federal government. In other words, support for political violence is now squarely in the mainstream of Americans’ thinking and a normalized tool to achieve political goals when peaceful means fail.\n\nThe most distressing development in the past year has been a spate of assassination attempts and politically motivated mass shootings. In July, a gunman tried to shoot former U.S. President Donald Trump at a campaign rally and ended up killing a civilian and wounding three others, including Trump himself; the gunman was killed by a Secret Service counter-sniper. In September, another man was arrested for attempting to assassinate Trump in West Palm Beach, Florida.\n\nThe United States has also seen multiple attempts to assassinate or severely harm leaders across the political spectrum. In October 2022, a man broke into U.S. House Speaker Nancy Pelosi’s home with the intention of interrogating and harming her; she was not home, and the home invader later attacked her husband. In June 2023, an individual was arrested while surveilling the Washington, D.C., home of former president Barack Obama with weapons in his van. In June 2022, an individual was arrested for plotting to kill conservative Supreme Court Justice Brett Kavanaugh.\n\nBy any count, the number of these events has grown since 2018 and appears to be higher than at any time since the rash of high-level political assassinations and attempts in the 1960s and early 1980s. Indeed, the last nearly fatal attempt to assassinate a sitting U.S. president was against Ronald Reagan in 1981, more than 40 years ago.\n\nAnd it is not only political leaders and their families being targeted. Over the past six years, the United States has witnessed a number of mass shootings targeted at ethnic groups, such as Jews at the Tree of Life synagogue in October 2018; Hispanics at a Walmart in El Paso, Texas, in August 2019; and African Americans at Tops Friendly Markets in Buffalo, New York, in May 2022. All three aforementioned attacks were motivated by the right-wing “great replacement theory,” which originated in France but has influenced white supremacists around the world. The theory’s core idea is that elites are conspiring to deliberately replace the white population with nonwhite people—and the attacks were meant to punish and deter this outcome, as all three shooters explained in their manifestos.\n\nThe United States has also witnessed multiple instances of violent protests from both the right and the left.\n\nDuring the summer of 2020, the George Floyd protests were overwhelmingly peaceful, but there were some instances of violence, including looting and attacks on police stations and vehicles, for the purpose of compelling local political leaders to “defund the police,” a goal associated with the left. These instances ofpolitical violenceoccurred in over100 major cities, including Minneapolis, Portland, New York City, and Chicago.\n\nOn Jan. 6, 2021, around2,000 Trump supportersstormed the U.S. Capitol—breaking through barricades, fighting Capitol and Washington, D.C., police, and ultimately hunting U.S. lawmakers inside the building—all in an effort to prevent the peaceful transfer of power to Joe Biden, who was president-elect at the time.\n\nIn the wake of the escalation in the Israeli-Palestinian conflict after Oct. 7, 2023, hundreds of pro-Palestine and pro-Israelprotestsoccurred in many U.S. cities and on college campuses in the fall and again in the spring of 2024. And almost immediately, anti-Jewish and anti-Muslim incidents of violence and intimidation rose.\n\nThere is also the threat of domestic terrorism. According tostatisticscollected by the FBI and Department of Homeland Security, incidents of groups and individuals carrying out attacks of domestic terrorism increased by 357 percent between 2013 and 2021. This includes violence for ideologies across the political spectrum. While anti-government militias, white supremacists, and likeminded extremistsconductedabout 49 percent of all attacks and plots in 2021, violent incidents by anarchists, anti-fascists, and likeminded extremists rose from 23 percent in 2020 to 40 percent in 2021, according to the Center for Strategic and International Studies.\n\nThere has also been a rise in threats prosecuted by the Justice Department to members of Congress—targeting both Republicans and Democrats—for years. To understand more clearly whether the recent rise of political violence incidents is a real phenomenon rather than a product of a human tendency to exaggerate a handful of salient events, CPOST studied every threat prosecuted by the Justice Department to members of Congress from 2001 to 2023. It found that theannual number of threatsincreased fivefold starting in 2017—the first year of Trump’s presidency—andstayedconsistently at that annual high every year through 2023. Targets were roughly half Republicans and half Democrats, as the graphic below shows for the most recent years.\n\nWhat’s going on in the United States? The first step in understanding major upswings in political violence is knowing what the public thinks. As scholars have long demonstrated, well-functioning democracies and peaceful resolution of political disputes turns on more than the mechanics of electoral politics. They also hinge critically on public support for norms of restraint in the use of force and confidence in the ability of elections to settle disputes fairly. Historically, the more public support for violence, the more common and dangerous actual violence becomes—even in countries considered to be mature democracies.\n\nThe news on this front is not comforting. Scholars have long known that public commitment to democratic norms—particularly, confidence in the legitimacy of elections and restraint in the use of violence to settle political disputes beyond the ballot box—are crucial foundations for a constitutional government and to constrain elites who might seek to weaponize institutions for their private concerns. But CPOST’s surveys show that public support of democratic norms is not as high as we would like to imagine and support for the use of force to achieve political goals is at worrying levels—moving well beyond a tiny fringe, with significant minorities supporting violence for causes on both the right and left. Hence, it is no wonder that would-be lone wolves and flash mobs think that their acts of political violence enjoy a mantel of legitimacy.\n\nThe good news is that 75 percent of Americans surveyed still abhor political violence. Political leaders at all levels of government, community leaders, scholars, and the media all need to lean into the 75 percent, empowering them to speak up against political violence wherever it comes from. The United States’ political leaders and media figures have an especially powerful role to play. The goal should not be to dampen political enthusiasm, which is so critical for political campaigns. Rather, the goal should be to redirect political anger away from violence and toward voting. Americans should absolutely “fight” for their political future. However, that must mean electoral competition as the venue for nonviolent confrontation and not letting that competition transform into physical violence.\n\nIn the United States, the next national election is always only two years away—and all political leaders and media figures have a responsibility to stand up vigorously for these norms that truly safeguard our democracy.\n\nRobert A. Papeis a professor at the University of Chicago and the director of the Chicago Project on Security and Threats. His publications includeDying to Win: The Strategic Logic of Suicide Terrorism,Cutting the Fuse: The Explosion of Global Suicide Terrorism and How to Stop It, and numerous other peer-reviewed articles on terrorism.\n\nCommenting is a benefit of aForeign Policysubscription.\n\nJoin the conversation on this and other recentForeign Policyarticles when you subscribe now.\n\nPlease follow ourcomment guidelines, stay on topic, and be civil, courteous, and respectful of others’ beliefs.\n\nI agree to abide by FP’scomment guidelines. (Required)\n\nThe default username below has been generated using the first name and last initial on your FP subscriber account. Usernames may be updated at any time and must not contain inappropriate or offensive language.\n\nI agree to abide by FP’scomment guidelines. (Required)",
        "source_3": "Published:14:03 BST, 3 November 2024|Updated:15:32 BST, 3 November 2024\n\nFights have broken out at polling stations and election workers have gone through active shooter drills.\n\nThere have been threats to blow up political offices and ballot boxes have been set on fire.\n\nBefore what could be the closest presidential election in history, staff trusted with overseeing the vote on Tuesday are already facing chaos and bracing for violence.\n\nWith memories of 2020 resurfacing, many have taken extra precautions to turn local precincts into fortresses and extra cops are being deployed nationwide on November 5.\n\nThe aftermath could also be fraught with friction, with some state officials warning the result could take days to be finalized in some of the sevenbattleground states.\n\nRazor-thin margins betweenDonald TrumpandKamala Harrisin the polls show the result could depend on just a few thousand votes.\n\nAccording to an exhaustive DailyMail.com poll, the concerns are justified.\n\nA Trump supporter, left, gets into a confrontation with a Harris fan outside an event for Tim Walz in Bristol Township, Pennsylvania, last week.\n\nIn the survey of 1,003 likely voters, conducted with J.L. Partners, more than 25 percent think there will be rioting whether Harris or Trump wins, and 10 percent fear there will be a civil war.\n\nJust over one in five (22 percent) think a Democratic victory would lead to a repeat of January 6, and 21 percent think election sites or Democratic officials will be targeted by direct attacks.\n\nHarris voters are more likely to believe that rioting will take place, while Republicans are split on whether the election will be run fairly.\n\nIf Donald Trump wins the Electoral College narrowly however, Americans think there is a higher chance of 'violence on the streets' in the forms of furious protests.\n\nAmong the former president's former supporters, 13 percent think there would be a civil war if Republicans were defeated.\n\nWith Harris supporters, nine percent believed there would be an all-out nationwide conflict if they are victorious.\n\nA similar number of Trump (18 percent) and Harris (16 percent) voters would back resorting to violence if they thought the election was unfair.\n\nFraud allegations across the country four years ago caused chaos in the closest states such as Pennsylvania, Georgia and Arizona.\n\nElection workers received death threats and were faced with armed Trump supporters at polling locations.\n\nThe situation was unprecedented and has forced state governments to invest in resources such as more voting machines and safety.\n\nWith the country still divided in its support for two candidates who have vastly different visions for the country, there are still concerns of a repeat.\n\nPennsylvania, arguably the most important state in the race, has already been at the center of fraud allegations that have made their way to the Supreme Court.\n\nIn the Keystone State, Edward Dieri Jr. was charged with threatening to blow up a Republican office in Montgomery County.\n\nJeffrey Michael Kelly was arrested in Arizona on October 23 for allegedly shooting a Democratic campaign office three times.\n\nHe was also accused of putting signs outside his home with razor blades and a bag of a white powder attached.\n\nIn San Antonio, Texas a man allegedly attacked a poll worker who asked him twice to remove his MAGA hat.\n\nPolitical clothing is banned from polling places in many states, including Texas.\n\nAuthorities working to put out a fire at a ballot box in Vancouver, WA started early Monday morning. It was one of two fires set at two ballot boxes in two separate states early Monday\n\nIn Oregon and Washington, the FBI and police are still hunting for an arsonist who set three ballot boxes alight.\n\nA Democratic congressman predicted last Thursday there 'may be blood' if Harris wins.\n\nRep. Steve Cohen, D-Tenn, told NewsNation's Dan Abrams that he believes the Democratic candidate will win both the Electoral College and the popular vote.\n\nBut he warned that he believes Trump will 'stop at nothing' if the vice presidentis declared the winner.\n\nRep. Cohen told Abrams said he expects Harris to get at least 5 million more votes than Trump.\n\n'But I think Trump won't stop at anything. It will be in courts, it will be in litigation, it will be telling people again to go to theCapitolif you want to have a country and fight like hell,' he continued.\n\n'I mean, we're going to have - there may be blood and there's some concern.'\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nBy posting your comment you agree to ourhouse rules.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with ourPrivacy Policy."
    }
}