{
    "question": "In what ways could the mixed polling on which candidate is trusted on the economy—including views on inflation, taxes, and housing—shape voter perceptions and campaign strategies in the final stretch of the race?",
    "content": {
        "source_1": "Poll shows more voters support US vice-president’s tax and housing policies compared with the Republican nominee\n\nDonald Trumphas lost his advantage overKamala Harrison who is best qualified to manage theeconomy, new polls suggest.\n\nWith millions of voters already casting early ballots for the presidency ahead ofelectionday on 5 November, a freshAssociated Press/NORC pollsays Harris, the Democratic nominee, has taken a slight lead when it comes to some key economic questions that concern middle-class voters.\n\nThe finding consolidates a trend from the the same poll last month, which showed Harris hadalmost closeda previously large deficit with Trump, the former US president and Republican nominee, on who could best handle economic issues.\n\nTheeconomy consistently tops voters’ priority list.\n\nThe latest poll asked more detailed questions than the previous survey, concluding that 46% prefer Harris’s policies on taxes for the middle class, compared to 35% for Trump. The US vice-president also has a slight edge on the cost of housing, while voters are evenly split on which of the pair has the better policies on the prices of groceries and petrol, and creating jobs or addressing unemployment.\n\nThe boost to Harris comes even as a majority of voters, 62%, believe the economy is in poor condition, compared with 38% who say the opposite. The outlook is more positive than in October last year, when nearly three in four people said the economy was in poor shape.\n\nThe Trump campaign has long sought to make inflation and rising living costs a focal point of its critique of Joe Biden’s presidency. Harris, since replacing Biden as the Democrats’ nominee in July, has launched a counteroffensive that involves putting proposals for an “opportunity economy” at the heart of her campaign message – including a pledge to give first-time buyers $25,000 towards a down payment on a new home.\n\nThe Republican House speaker, Mike Johnson, stressed economic themes in aCNN interviewon Sunday in which he rebutted suggestions that voters were primarily concerned with Trump’s increasingly erratic campaign rhetoric and actions, including shutting down audience questions at a town hall in order toshuffle aimlessly to music for 39 minutes.\n\n“The big question – and the one thatKamala Harrishas not been able to answer – is: are you better off now than under the Trump administration, four years ago?” Johnson said. “No one can answer that question with a yes.”\n\nThe Harris campaign hasdeployed Bill Clintonto sell the vice-president’s economic message, with a particular focus on rural andBlack voters. Clinton’s role as an economic messenger is partly a product of his successful 1992 presidential campaign, which was distinctive largely because of its focus on economic issues, as summarised by the famous phrase “It’s the economy, stupid,” coined by its chief strategist James Carville.\n\nAt a rally last Friday in Wilmington inNorth Carolina– a key battleground state where the two candidates are neck and neck – the former Democratic president said Harris’s economic proposals would ease circumstances for the majority. “She wants to help the middle class and working people with lower incomes work their way into the middle class,”Clinton said.\n\nClinton has also offered a nuanced view of the state of the contemporary economy, acknowledging inflation under the Biden administration but explaining why it occurred.At the Democratic national conventionin August, he said the US had created 51m jobs since the end of the cold war, and that 50m of them had come under Democratic administrations.\n\n“I swear I checked this three times. Even I couldn’t believe it,” he said. “What’s the score? Democrats 50, Republicans one.”",
        "source_2": "Reporting by Andrea Shalal; Editing by Heather Timmons and Deepa Babington\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nVladimir Putin is set to become the first Russian president to visit Alaska, a territory Moscow sold to the U.S. in 1867 for $7.2 million, assuming a summit with U.S. President Donald Trump goes ahead there on Friday as planned.\n\nReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.\n\nAccess unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.\n\nBrowse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.\n\nScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.\n\nAll quotes delayed a minimum of 15 minutes.See here for a complete list of exchanges and delays.",
        "source_3": "As the presidential election reaches its final days, Donald Trump maintains a wide lead over Kamala Harris on the key issues of the economy and inflation.\n\nEfforts by Harris and Democrats to cut into Trump’s advantage on the economy have largely failed,new pollingfrom ABC News and Ipsos indicates.\n\nForty-five percent of registered voters say they trust Trump more on the economy, including 33 percent who say they strongly trust Trump more. Just 37 percent say they trust Harris more, with only 21 percent saying they strongly trust Harris.\n\nThese numbers have been essentially unchanged for at least two months. This indicates that voters have largely made up their minds on which candidate is better on the economy.\n\nOn the issue of inflation, the numbers are very similar. Thirty-six percent of registered voters say they trust Harris on inflation, while 44 percent say they trust Trump more. Those numbers are also basically unchanged from surveys a month ago and two months ago.\n\nHarris has argued that Trump’s tariff proposals would raise consumer prices but the public has largely rejected this view. In poll after poll, Trump is favored on the economy, inflation, tariffs, and trade.Ninety percent of voters say the economy will be very important to their vote this year."
    }
}