{
    "question": "In what ways might the linked ballot drop box arsons in Washington and Oregon affect perceptions of election security and voter participation, and what measures could mitigate those effects?",
    "content": {
        "source_1": "Updated on:  October 30, 2024 / 8:15 PM EDT/ CBS News\n\nWashington —Ballot drop boxeswere set on fire in two states, Washington and Oregon, just a week ahead ofElection Day, as authorities were already on high alert for the possibility of violent incidents driven by claims of election fraud — including the sabotage of ballot drop boxes.\n\nTwo ballot boxes wentup in flamesearly Monday morning in Portland and Vancouver, which is just about 10 miles from Portland, just over the border. While most of the ballots in the Portland box were recovered, hundreds were thought to be lost in the Vancouver incident.\n\nClark County Auditor Greg Kimsey told CBS News Tuesday evening that about 475 damaged ballots were recovered from thedrop boxin Vancouver. Kimsey said that for the \"vast majority\" of those ballots, officers were confident they would be able to identify the voters. After the wet ballots dry out, officials will be better equipped to assess the damage.\n\nKimsey believes it is possible that other ballots were completely destroyed by the fire.\n\n\"I don't know how many exactly, but I suspect there were because there was a fair amount of ash at the bottom of the ballot drop box,\" he told CBS News.\n\nIn Portland, three ballots out of hundreds were damaged, Multnomah County Elections Director Tim Scott told reporters, after suppression devices inside the ballot box almost immediately extinguished the flames ignited by an incendiary device. Washington election officials noted that fire suppression devices in the Vancouver box didn't appear to work as well.\n\nThe state and the counties keep track of every ballot sent and received, so they can tell whether someone's got lost or destroyed, says CBS News election law contributor David Becker. Voters who returned ballots to the dropbox located at the Fisher's Landing C-Tran Transit Center in Vancouver between Saturday at 11 a.m. and Monday at 3 a.m. PT have been advised by Kimsey to check their ballot's status online atvotewa.gov, where they can see whether their ballot has been received.\n\n\"I'm very saddened by this incident,\" Kimsey said in a statement, calling it \"an attack on American democracy.\"\n\nIf any of the voters Clark County election officials can identity have not already requested a new ballot, officials will automatically send them one to their address, Kimsey said. They will try to email, call or text them as well to inform them of the situation.\n\nIn Portland, authorities were able to clearly read the names of the voters and were reaching out directly to the voters, Scott said. The undamaged ballots were set to be processed on Monday, and voters who cast their ballots between Saturday at 3:30 p.m. and Monday at 3 a.m. PT could call tocheck on the statusof their ballot.\n\n\"We have multiple systems and security measures in place to ensure your ballot is safe,\" Scott said in a statement. \"Your Elections team is working hard to make sure that everyvotecounts.\"\n\nThe words \"free Gaza\" were found marked on the casings of the incendiary devices used to burn both ballot boxes, a law enforcement source confirmed to CBS News on Wednesday.\n\nThe devices have been sent to an FBI laboratory in Huntsville, Alabama, for analysis, the source said.\n\nInvestigators believe the arson may be linked to a similar incendiary device that was found near a ballot box in Vancouver on Oct. 8, the source added.\n\nAuthorities have identified the suspect's vehicle, and the FBI is leading the investigation into the vehicle.\n\nThe FBI said in a statement Monday that the agency is coordinating with federal, state and local partners to \"actively investigate the two incidents\" and \"determine who is responsible.\"\n\nFederal investigators believe the suspect vehicle is a dark gray 2001 to 2004 Volvo sedan. Complicating the investigation, according to Portland police, is that the car had no front license plate and the back license plate is unreadable from surveillance images.\n\nLocal authorities said incidents such as these are targeted and intentional, while noting that the investigation is ongoing.\n\nAccording to a federalbulletinpublished by the Department of Homeland Security on Monday, some online users on platforms frequented by domestic violent extremists have \"encouraged violence against ideological opponents related to the use of mail-in voting,\" along with promoting \"methods of sabotaging ballot drop boxes.\"\n\nIn Clark County, where the Washington incident occurred, officials will assign ballot box observers to watch all of the county's ballot drop boxes 24 hours a day, in addition to increasing patrols around the boxes through Election Day. Election officials will also begin picking up the ballots at drop boxes more frequently. In Portland, election officials also plan to implement increased security measures and additional patrols.\n\n— Elli Fitzgerald and Pat Milton contributed reporting.\n\nKaia Hubbard is a politics reporter for CBS News Digital, based in Washington, D.C.",
        "source_2": "James Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics in Texas, as well as other general news across the United States. James joined Newsweek in July 2022 from LBC, and previously worked for the Daily Express. He is a graduate of Oxford University. Languages: English. Twitter: @JBickertonUK. You can get in touch with James by emailing j.bickerton@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nOver the past week, two ballot drop boxes and one USPS mailbox have been torched inthree separate incidentsin Arizona, Oregon and Washington.\n\nEarly on October 28, arson attackstargeted two ballot drop boxessituated in Vancouver, Washington, and Portland, Oregon. This followed an incident on October 24 when a free-standing mailbox at a U.S. Postal Office in Phoenix, Arizona,was set on fire.\n\nThe attacks come at a time of heightened tensions ahead of the 2024 presidential election on November 5 and follow on from the contested 2020 presidential poll.\n\nDonald Trump is continuing to insist the 2020 contest was rigged against him, though this has been repeatedly dismissed in the courts and byindependent election experts.\n\nOver the past few months, Trump hastargeted mail-in votingin particular with unsubstantiated allegations of vote rigging, branding it \"corrupt\" during events in Michigan and Pennsylvania. However, Trump's team has also encouraged his supporters to vote early, and earlier this monthcalled for some restrictionson early voting and absentee ballots to be lifted in areas of North Carolina badly hit by Hurricane Helene.\n\nNewsweekhas provided a summary of the attacks below along with a map showing their locations, with the Washington and Oregon incidents appearing as one circle due to their close proximity.\n\nThe Phoenix Police Department said it was called shortly after1:00 a.m. local timeon October 24 to a mailbox that had been set on fire at 3900 North 7th Avenue.\n\nTogether with the Phoenix Fire Department's Arson Investigation Taskforce police investigated the blaze, securing the scene and studying relevant CCTV footage.\n\nPolice later arrested 35-year-old Dieter Klofkorn in relation to the incident. According to a statement released by Phoenix police Klofkorn \"admitted to committing the arson\" but denied his actions were politically motivated, saying he wanted to be arrested. The suspect was booked into jail \"on one felony count of Arson of Property.\"\n\nInitially, Phoenix police said 20 ballots had been damaged in the blaze, though Arizona's Secretary of State's Office later reduced this figure to five, according toABCNews.\n\nResponding to the incident on X Phoenix Mayor Kate Gallego said: \"There is zero tolerance for criminal activity in our community, and we are working collaboratively with every level of government to bring the perpetrator to justice.\"\n\nAt around 3:30 a.m. local time on Monday, the Portland Police Bureau was alerted to a fire at a Multnomah County ballot box situated in the 1000 block of S.E. Morrison Street.\n\nIn a statement, Multnomah County said the fire was caused by an \"incendiary device\" and that it was being investigated by the Police Bureau's Explosive Disposal Unit.\n\nMultnomah County said that fire suppressant protected most of the ballots, with only three being damaged. These three will be contacted \"via unique identifiers on their ballot envelopes\" so they can receive replacements.\n\nIn a statement, Oregon Secretary of State LaVonne Griffin-Valade said: \"Make no mistake, an attack on a ballot box is an attack on our democracy and completely unacceptable. Whatever the motivation behind this incident, there is no justification for any attempt to disenfranchise voters.\"\n\nJust hours after the Oregon incident, a ballot box wastorched in Vancouver, Washington, a small town around 10 miles from Portland.\n\nThe incident took place by Fisher's Landing Transit Center with officials saying the blaze began at around 4 a.m., destroying several hundred ballots.\n\nAccording to Clark County Auditor Greg Kimsey, the box was fitted with a fire suppression system but unlike in Portland it \"doesn't appear it worked very well.\"\n\nAt a press conference on Monday, police said they believe the Oregon and Washington arson attacks are connected, and noted they are \"very similar\" to a failed attempt to burn another Vancouver ballot drop box which occurred on October 8.\n\nIn a statement, Washington Secretary of State Steven Hobbs, who is responsible for overseeing the state's elections, said: \"We take the safety of our election workers seriously and will not tolerate threats or acts of violence that seek to undermine the democratic process.\"\n\nPolice said they are seeking a dark-colored Volvo S60, of model year 2001-2004, in connection with the Oregon and Washington attacks. Patrols have been stepped up around ballot box sites to deter further incidents.\n\nJames Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics in Texas, as well as other general news across the United States. James joined Newsweek in July 2022 from LBC, and previously worked for the Daily Express. He is a graduate of Oxford University. Languages: English. Twitter: @JBickertonUK. You can get in touch with James by emailing j.bickerton@newsweek.com\n\nJames Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics in Texas, as well as other general news across the United States. James joined Newsweek in July 2022 from LBC, and previously worked for the Daily Express. He is a graduate of Oxford University. Languages: English. Twitter: @JBickertonUK. You can get in touch with James by emailing j.bickerton@newsweek.com\n\nJames Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics                                    ...Read more",
        "source_3": "“Free Gaza” was found marked on incendiary devices used to burn ballot drop boxes in Washington state earlier this week, according to news reports, suggesting for the first time that the arson may have had a political motive.\n\nAs Breitbart Newsreported, hundreds of ballots cast by voters were destroyed in the attack on the ballot drop boxes:\n\nHundreds of ballots in Washington state were potentially damaged after authorities reported that a Vancouver ballot drop box was burned in a Monday morning arson.\n\nHundreds of ballots were inside the box at the time of the fire, though it is not immediately clear how many may have been damaged, Clark County Auditor Greg Kimsey said.\n\nInvestigators told the local station that the incident is believed to be connected to another drop box arson incident in Portland, Oregon.\n\nABC NewsreportedTuesday that “Free Gaza” markings had been found on incendiary devices linked to the fires:\n\nBallot boxes in Oregon and Washington were set on fire with incendiary devices early Monday in what authorities believe are connected incidents, police said.\n\nThe devices used in the arson incidents carried markings with the expression “Free Gaza,” two sources familiar with the ongoing investigation told ABC News.\n\nThe sources said the incendiary device used in the first arson, back on Oct. 8, had “Free Gaza” and “Free Palestine” on it. The two subsequent devices, set off in the early hours of Monday morning in Vancouver, Washington and nearby Portland, Oregon, carried the slogan “Free Gaza.”\n\nIt is unclear whether the devices were meant to convey that message, or to distract from the true motive in the fires.\n\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News and the host ofBreitbart News Sundayon Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m. ET (4 p.m. to 7 p.m. PT). He is the author ofThe Agenda: What Trump Should Do in His First 100 Days, available for pre-order on Amazon. He is also the author ofThe Trumpian Virtues: The Lessons and Legacy of Donald Trump’s Presidency, now available on Audible. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. Follow him on Twitter at@joelpollak."
    }
}