{
    "question": "In what ways could the Supreme Court’s handling of the Pennsylvania provisional ballot dispute and Virginia’s voter-roll removals influence voter access, election administration, and public trust in the 2024 election?",
    "content": {
        "source_1": "Republicans asked the US Supreme Court on Monday to step into a fight over provisional ballots in the presidential battleground state of Pennsylvania, bringing a second potentially significant voting case to the high court within days of the election.\n\nThe Republican National Committee urged the justices to block a state court ruling that allows people to vote provisionally when election officials identify problems with their mail ballots – specifically, when they fail to put them into a “secrecy” envelope before sending them off in the mail.\n\nRelated articleVirginia asks US Supreme Court to permit voter roll purge aimed at suspected noncitizens\n\nThose ballots, because they are missing the secrecy sleeve, are referred to as “naked ballots.”\n\n“This case is of paramount public importance, potentially affecting tens of thousands of votes in a state which many anticipate could be decisive in control of the U.S. Senate or even the 2024 presidential election,” the RNC said in its appeal.\n\nThe case arrived hours afterVirginia asked the Supreme Courtto allow the state to continue a program to remove suspected noncitizens from the voter rolls. Both cases are likely to be handled with remarkable speed – by Supreme Court standards – and could yield orders within days.\n\nThe RNC asked the Supreme Court to decide the Pennsylvania case by Friday.\n\nRepublicans claimed in their emergency appeal that Pennsylvania’s highest court usurped power reserved to the state legislature byallowing voters to cast provisional ballotsafter their mail-in ballots were tossed out.\n\n“When the legislature says that certain ballots canneverbe counted, a state court cannot blue-pencil that clear command intoalways,” the RNC wrote.\n\nThe state Supreme Court, the party said, effectively allowed voters to fix or “cure” defective ballots, “a process everyone agrees the General Assembly has deliberately chosen not to create.”\n\nUS Supreme Court Justice Samuel Alito, who handles emergency cases arising from Pennsylvania and other mid-Atlantic states, requested a response in the case by Wednesday afternoon.\n\nThe initial lawsuit was filed by two voters in Butler County, north of Pittsburgh, who initially submitted mail-in ballots. But they didn’t enclose their ballots in the secrecy sleeve before placing them in an outer mailing envelope. A machine scanner identified that problem and the voters received an automated message alerting them that their vote would not be counted.\n\nThe voters then showed up at their precincts during the state’s primary election and attempted to cast provisional ballots but learned those votes wouldn’t be counted, either. County election officials said state law barred them from voting because they had already submitted a mail-in ballot, even though that first ballot was deemed defective.\n\nRelated articleGOP’s aggressive court strategy sets the stage to cast doubt on the 2024 results\n\nPennsylvania’s top court sided with the voters, ruling that election officials were correct to toss the mail-in ballots but “erred in refusing to count” their provisional ballots. Pennsylvania law, the state’s high court ruled, requires that provisional ballots “be counted if there were no other ballots attributable to the electors. There were none.”\n\nInitially a dispute between the voters and Butler County, both the Republican National Committee and the Democratic National Committee intervened. Democrats sided with the voters, while Republicans backed the county.\n\nIt is the Republican Party that has appealed the state court’s decision to the US Supreme Court.\n\nThough the latest appeal has added another election case to the Supreme Court’s docket, it’s not clear that any of the pending appeals will have a dramatic effect on the outcome of the race between former President Donald Trump and Vice President Kamala Harris.\n\nIn the Pennsylvania case, it’s unclear how many ballots the dispute will affect.\n\nNew York University law professor Richard Pildes, in a recent blog post, offered a back-of-the-envelopeestimate that the case may affectbetween 400 and 4,000 ballots. However, his analysis focused on the secrecy envelope issue.\n\nBoth the RNC and its opponent in the case, the American Civil Liberties Union of Pennsylvania, are interpreting the ruling to apply to other technical defects on a mail-in ballot, such as a missing signature or date, that would prompt the ballot’s disqualification.\n\nThe party is asking the high court to pause the state court’s ruling or, alternatively, to separate the provisional ballots so they can be challenged after the election.\n\nRepublicans are partly relying on a legal theory known as the independent state legislature doctrine, which suggests that the US Constitution gives state legislatures virtually unchecked power to set election rules.\n\nThe Supreme Court grappled with and ultimately declined to embrace that conservative-backed theory in a case last year involving North Carolina’s congressional maps.\n\nBut while the 6-3 opinion from Chief Justice John Roberts didn’t go as far as some Republicans had hoped, it also didn’t close the door on the US Supreme Court reviewing future state high court rulings dealing exclusively with state election laws.\n\nThis story has been updated with additional details.",
        "source_2": "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nVirginia appealed to the U.S.Supreme Courton Monday to allow the state to remove around 1,600 registered voters it alleges are noncitizens.\n\nThe federal appeals court upheld a judge's order that restored these voters' registrations, ruling that the state's removal program was unlawfully implemented.\n\nIn August,an executive order was issued by Gov. Glenn Youngkin, aRepublican, mandating daily data checks to identify noncitizens on voter rolls.\n\nYoungkin insists that the program is a necessary measure to prevent noncitizens from voting in the upcoming November election.\n\nU.S. District Judge Patricia Giles ruled on Friday that the effort violated federal law,as it took place during a 90-day \"quiet period.\"\n\nThe quiet period is mandated to avoid the risk of mistakenly removing legitimate voters just before the election.\n\nThe U.S. Justice Department, along with several advocacy groups, challenged the executive order earlier this month, arguing that the governor's systematic approach could lead to disenfranchising eligible voters.\n\nIn a ruling Sunday, the 4th U.S. Circuit Court of Appeals backed Judge Giles' initial decision, finding that Virginia's data-matching efforts did not sufficiently prove that those removed were indeed noncitizens.\n\nThe court's opinion, written by Judge Toby Heytens—a Biden appointee—and joined by Chief Judge Albert Diaz and Judge Stephanie Thacker, both Obama appointees, emphasized that while states have the right to remove noncitizens from the rolls, the process must be individualized and not based on bulk data transfers from the DMV.\n\nThe appeals court also rejected the state's claim that the judge's order was forcing Virginia to restore noncitizens to its voter rolls.\n\nThe court pointed to the fact that citizens' registrations could be erroneously canceled due to ticking the wrong box on DMV forms.\n\nUnder Youngkin's program, the DMV data was cross-referenced daily with voter rolls to identify noncitizens\n\nState officials said that any flagged voter received a notice and had two weeks to contest the disqualification.\n\nThose who returned forms affirming their citizenship retained their registration.\n\nIn a similar case inAlabama, a federal judge last week ordered the state to reinstate over 3,200 voters who were purged as noncitizens.\n\nTestimony revealed that approximately 2,000 of those purged were, in fact, legal citizens.\n\nThe program was launched by Republican Secretary of State Wes Allen in August, originally touted by Allen as a way to begin the \"process\" of removing \"noncitizens registered to vote in Alabama.\"\n\nTheDepartment of Justiceand a coalition of immigration and voting rights groups sued, arguing that the program systematically removed names during the 90 day quiet period.\n\nThis article includes reporting from The Associated Press\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.",
        "source_3": "Republicans on Monday asked the U.S. Supreme Court to halt Pennsylvania’s attempt to count provisional ballots, in a filing that could impact thousands of votes in the critical swing state.\n\nThe Republican National Committee intervened in a lawsuit brought against Butler County, Pennsylvania, by voters who did not have provisional ballots counted for lack of a proper envelope.\n\nThe RNC, which is the applicant at the high court for a stay of the Pennsylvania Supreme Court’s decision, said the state’s highest court ignored state law in its ruling, greenlighting the counting of provisional ballots. The state court ruled a provisional ballot must be counted if the individual had cast his or her mail-in ballot on time.\n\nA provisional ballot is cast if there is a technical issue with a mail-in ballot, such as a lack of signature or date or envelope error.\n\nThe filing argues that the decision creates a curing problem for the mail-in ballots.\n\n“This case is of paramount public importance, potentially affecting tens of thousands of votes in a State which many anticipate could be decisive in control of the U.S. Senate or even the 2024 Presidential Election,” the filing read.\n\nIf the justices refuse to halt the Pennsylvania court’s decision, then the challengers requested that the high court at least issue an order for the provisional ballots to be sequestered for future judicial review.\n\nThe request comes the same day that Virginia asked the justices to allow the state to purge noncitzens from its voter rolls after the Justice Department contested the removal so soon before Election Day.\n\n• Alex Swoyer can be reached ataswoyer@washingtontimes.com.\n\nCopyright © 2025 The Washington Times, LLC.Click\n                            here for reprint permission.\n\nPope Leo should tell Catholics: Marry young, have many children\n\nTrump’s TikTok delays undermine his China hawks while Intel controversy grows"
    }
}