{
    "question": "How might both the ruling party and the pro-Western opposition claiming victory in Georgia’s parliamentary elections impact public trust and perceptions of legitimacy, and what steps could help resolve the dispute?",
    "content": {
        "source_1": "Opposition leaders have decried the voting as rigged.\n\nTBILISI, Georgia — A critical nationwide vote that saw Georgia’s ruling party claim a landslide victory was overshadowed by political violence and irregularities, the Western election monitoring mission in the South Caucasus country warned.\n\nAt a press conference in Tbilisi on Sunday, Pascal Allizard, a French senator and special coordinator for the Organization for Security and Cooperation in Europe (OSCE), said that vote buying and “imbalances in financial resources, a divisive campaign atmosphere and recent legislative amendments were of significant concern throughout this election process.”\n\nAccording to Antonio López-Istúriz White, the head of the European Parliament delegation, “during the electoral campaign, the ruling party used anti-Western and hostile rhetoric, targeting Georgia’s democratic partners, in particular the European Union, its politicians and diplomats, promoted Russian disinformation, manipulation and conspiracy theories.”\n\n“We express deep concern about the democratic backsliding in Georgia. The conduct of yesterday’s election is unfortunately evidence to that effect. We fear that the climate of hatred and intimidation we witnessed on the Election day could seriously undermine the political process in Georgia,” he added, alleging “a sophisticated, widespread and well-orchestrated scheme” had been at play.\n\nThe joint OSCE, European Parliament, Parliamentary Assembly of the Council of Europe and the NATO Parliamentary Assembly mission deployed around 500 monitors across the country.\n\nResults published by Georgia’s Central Election Committee show the governing Georgian Dream party took 53 percent of the vote, while the united opposition coalition attracted 38 percent. Bidzina Ivanishvili, the chairman of Georgian Dream, told POLITICO at a jubilant election night rally that the result was a “big victory” for his party.\n\nGeorgian Dream had vowed toban opposition partiesand bar their MPs from taking up their seats if it received a significant enough majority.\n\nOpposition parties have moved to dismiss the result of the election amid widespread reports of ballot stuffing, vote buying and intimidation. Tina Bokuchava, one of the leaders of the opposition coalition, said she and her allies would not accept the results of a “stolen election.”\n\n“Elections were stolen. Power has been usurped, this is a coup. Georgian Dream will have to admit the victory of opposition,” said Coalition for Change leader Nika Gvaramia.\n\nTwo foreign election observers who spoke to POLITICO on condition of anonymity said they had personally witnessed irregularities in the counting and physical violence at polling stations.\n\n“Reports of irregularities in Georgian elections give rise to grave concern,” said Margus Tsahkna, foreign minister of Estonia in a message posted online. “Closely following the evaluations of international and local observers.”\n\nThe opposition will need to present strong evidence of violations if they are to contest results and call for demonstrations, said Kornely Kakachia, head of Georgian Institute of Politics.\n\n“The protest may not gain traction unless opposition presents evidence of violations. If they prove violations were systematic, it will be supported by general public.”\n\nOpposition leaders will meet later on Sunday evening with the pro-Western president, Salome Zourabichvili, who has declared that victory belonged to the opposition “despite attempts to rig elections.” Protests are expected, raising the prospect of a resumption of a long-running demonstration movement that saw police violently crack down on activists on the streets over the summer.\n\nGeorgia, which was awarded EU candidate status in December, has seen its application to join the blocsuspended amid warnings of backsliding on human rights. Georgian Dream has introduced a package of Russian-style legislation in recent months that brands Western-funded NGOs and media outlets as “foreign agents” and imposes sweeping restrictions on the LGBTQ+ community.\n\nThe United States imposed sanctions on Georgian Dream politicians and police officers it says were responsible for repressions and violence against peaceful protesters in the wake of the introduction of the new laws.\n\nMoscow is hoping pro-European Moldovans living abroad don’t go out to vote in September’s elections, the country’s national security chief told POLITICO.\n\nBackroom deals, embassy contacts and brown liquor built a booming export trade. Now, the lobbyist who saw it all says the U.S. president’s dalliances with Vladimir Putin are an incoming “asteroid” for the industry.\n\n“The low percentage of consistent support for democracy is truly worrying,” warns NGO chief.\n\nFrench President Emmanuel Macron announced the move ahead of a call with the U.K. and Germany.",
        "source_2": "This is Radio Schuman, your new go-to podcast to spice up your weekday mornings with relevant news, insights, and behind-the-scenes from Brussels and beyond.\n\nFrom the economy to the climate and the EU's role in world affairs, this talk show sheds light on European affairs and the issues that impact on our daily lives as Europeans. Tune in to understand the ins and outs of European politics.\n\nNo agenda, no argument, no bias, No Comment. Get the story without commentary.\n\nDare to imagine the future with business and tech visionaries\n\nEuronews Tech Talks goes beyond discussions to explore the impact of new technologies on our lives. With explanations, engaging Q&As, and lively conversations, the podcast provides valuable insights into the intersection of technology and society.\n\nEurope's water is under increasing pressure. Pollution, droughts, floods are taking their toll on our drinking water, lakes, rivers and coastlines. Join us on a journey around Europe to see why protecting ecosystems matters, how our wastewater can be better managed, and to discover some of the best water solutions.   Video reports, an animated explainer series and live debate - find out why Water Matters, from Euronews.\n\nWe give you the latest climate facts from the world’s leading source, analyse the trends and explain how our planet is changing. We meet the experts on the front line of climate change who explore new strategies to mitigate and adapt.\n\nThis is Radio Schuman, your new go-to podcast to spice up your weekday mornings with relevant news, insights, and behind-the-scenes from Brussels and beyond.\n\nFrom the economy to the climate and the EU's role in world affairs, this talk show sheds light on European affairs and the issues that impact on our daily lives as Europeans. Tune in to understand the ins and outs of European politics.\n\nNo agenda, no argument, no bias, No Comment. Get the story without commentary.\n\nDare to imagine the future with business and tech visionaries\n\nEuronews Tech Talks goes beyond discussions to explore the impact of new technologies on our lives. With explanations, engaging Q&As, and lively conversations, the podcast provides valuable insights into the intersection of technology and society.\n\nEurope's water is under increasing pressure. Pollution, droughts, floods are taking their toll on our drinking water, lakes, rivers and coastlines. Join us on a journey around Europe to see why protecting ecosystems matters, how our wastewater can be better managed, and to discover some of the best water solutions.   Video reports, an animated explainer series and live debate - find out why Water Matters, from Euronews.\n\nWe give you the latest climate facts from the world’s leading source, analyse the trends and explain how our planet is changing. We meet the experts on the front line of climate change who explore new strategies to mitigate and adapt.\n\nThe European Union has urged the Georgian authorities to \"swiftly, transparently and independently\" investigate reported irregularities in the parliamentary elections on Saturday. The closely watched poll saw the ruling party, Georgian Dream, win a majority of seats with 54% of all votes, followed at a distance by several opposition parties.\n\nAjoint observation missionled by the Organization for Security and Co-operation in Europe (OSCE) said the elections were \"well organised and orderly\" but found a \"tense environment\" and \"widespread reports of pressure on voters\", including cases of intimidation, coercion and vote-buying that \"compromised\" the secrecy of the vote.\n\n\"Those irregularities must be clarified and addressed. That is a necessary step to re-building trust in the electoral process,\" the European Commission and High Representative Josep Borrell said in a joint statement, stressing the need for \"constructive and inclusive dialogue across the political spectrum.\"\n\nPrime Minister Irakli Kobakhidze sought to minimise the accusations, tellingthe BBCthe elections were \"in line with legal principles\" and that \"irregularities happen everywhere, in every country.\" By contrast, President Salome Zourabichvili,denounceda \"total falsification\" of the votes under Russian influence and called on citizens to protest.\n\nEU-Georgia relations have severely deteriorated under Kobakhidze's rule, derailing the country's long-held aspirations to join the bloc.\n\nBrussels has censured Georgian Dream for introducing legislation that weakens the country's democracy and emulates Russian authoritarianism. Ahighly controversial lawthat creates a public register of foreign-funded media outlets and NGOs prompted EU leaders to freeze Georgia's accession process. The ruling party's threat to outlaw its main opponents and a new billcurbing LGBT rightsfuelled further criticism.\n\n\"The EU calls on Georgia to adopt democratic, comprehensive and sustainable reforms, in line with the core principles of European integration,\" the joint statement said.\n\n\"In this context, the EU recalls that any legislation that undermines the fundamental rights and freedoms of Georgian citizens and runs counter to the values and principles upon which the EU is founded must be repealed.\"\n\nCharles Michel, the president of the European Council, usedsimilar languageto urge the Georgian authorities to \"seriously\" address the irregularities. Michel said EU leaders would \"set the next steps in our relations with Georgia\" when they meet next week in Budapest and discuss the latest developments.\n\nHowever, it is unclear if the 27 heads of state and government will manage to close ranks and build a united front.\n\nThe summit's co-host, Prime Minister Viktor Orbán, was the first to congratulate Kobakhidze and Georgian Dream for their \"overwhelming victory\". Shortly after, Orbán's office announced he would travel to Georgia to meet with the prime minister.\n\nDiplomats in Brussels have grown exasperated with Orbán's free-wheeling diplomacy, whichtriggered a boycottagainst the country's presidency. Still, all leaders, including Charles Michel and Ursula von der Leyen, are expected to attend the Budapest summit.\n\nOrbán's trip to Tbilisi \"takes place exclusively in the framework of bilateral relations between Hungary and Georgia,\" a European Commission spokesperson said on Monday. \"Prime Minister Orbán has not received any mandate from the EU Council to visit Tbilisi.\"",
        "source_3": "Leaders of several opposition parties in Georgia have said they will not recognize the results of this weekend's national parliamentary vote. According to the officialresults, the ruling Georgian Dream party received almost 54% of the vote, while various opposition forces attracted between 11% and 3%.\n\nGeorgian Dream party chairman Mamuka Mdinaradze has claimed the party is likely to win at least 90 of the national chamber’s 150 seats, up from the 74 it won in the last election. The party will then be able to form the next government since a simple 76-strong majority is needed in Georgia to pick the next prime minister and cabinet.\n\nTina Bokuchava, who heads the pro-Western Unity-National Movement (UNM) party, has accused the nation’s central election committee of doing Georgian Dream’s bidding and of“stealing the European future”of Georgia.\n\n“We do not accept the stolen election results and are not going to recognize [them],”she stated at a news briefing following the vote. Bokuchava claimed that victory in fact“belonged”to the opposition, which supposedly had received a“mandate of trust”from the people.\n\nAccording to official results, the UNM received just over 10% of the votes. Bokuchava still maintained that her party would“fight like never before for the return of our European future and will not come to terms with the stolen election results.”She later announced that her party will not join the new parliament.\n\nBokuchava also said on Sunday that she’d already met with Georgia’s Western-leaning president Salome Zourabichvili, describing the meeting as“very important.”According to media in Georgia, the president has met with representatives of several opposition groups on Sunday, including the UNM and ‘Strong Georgia.’\n\nThe leader of the ‘Coalition for Changes’ party has also declared that his group will not recognize the election results. Nika Gvaramia, who also briefly served as the nation’s justice minister in 2008, accused the Georgian Dream of“usurping power”and of staging what he called a“constitutional coup.”\n\nGvaramia has also vowed that his political rivals“will be held accountable for this under Georgian law,”adding that Georgian Dream would have to“acknowledge the opposition victory”before that. His party was a member of a coalition that received 11% of the votes. ‘Coalition for Changes’ also announced that they do not intend to participate in parliamentary activities.\n\nSalome Zourabichvili has claimed that the vote was won by what she called“European Georgia,”and despite alleged“attempts to rig elections.”\n\nGeorgian Dream’s Mdinaradze responded to the president’s statements by calling her an“agent”of the opposition radicals.“Georgia no longer has a president. Georgia has an agent, a leader of the radical opposition… the main coordinator,”the politician stated on Sunday.\n\n© Autonomous Nonprofit Organization “TV-Novosti”, 2005–2025. All rights reserved.\n\nThis website uses cookies. Read RTPrivacy policyto find out more."
    }
}