{
    "question": "In what ways might the updated wording in Directive 5240.01—along with the Pentagon’s denial that it authorizes lethal force against citizens—shape public understanding of the military’s role around elections, and what communication approaches could reduce confusion about the limits on defense intelligence support to civilian authorities?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nFILE - The seal of the Department of Defense is seen on the podium at the Pentagon, Sept. 27, 2022, in Washington. The Pentagon says the U.S. is sending an additional “few thousand” troops to the Middle East to bolster security and to be prepared to defend Israel if necessary. (AP Photo/Alex Brandon, File)\n\nWASHINGTON (AP) — In a rare move, the Pentagon strongly pushed back Thursday against misinformation spread on social media that falsely suggests U.S. troops have been authorized to use force against American citizens during the election.\n\nThe misinformation — spread online by former Trump administration national security adviser Michael Flynn andformer presidential candidate Robert F. Kennedy Jr., among others — suggests that a Defense Department policy revision released in late September was timed to interfere with the Nov. 5 presidential election.\n\nUse of force by federal troops on U.S. soil against U.S. civilians is against the law — except in cases of self-defense — and is outlined in the Posse Comitatus Act.\n\nKennedy, who ended his presidential bid andbacked Republican former President Donald Trump, tweeted the false narrative to his 4 million followers. It falsely claims that President Joe Biden and Vice President Kamala Harris, the Democratic nominee, pushed through a Defense Department directive allowing lethal force against Americans who protest government policies.\n\nThe revision in question is Department of Defense Directive 5240.01, and it does not allow troops to use force on U.S. citizens. The timing of its release was not related to the election, Pentagon spokeswoman Sue Gough said.\n\n“The policies concerning the use of force by DOD addressed in DoDD 5240.01 are not new, and do not authorize the DOD to use lethal force against U.S. citizens or people located inside the United States, contrary to rumors and rhetoric circulating on social media,” Gough said in a statement to The Associated Press.\n\nThe Pentagon regularly updates its directives. This update was intended to align the language on use of force from other policies into 5240.01, which only applies to defense intelligence personnel.\n\nIt describes what sort of support those personnel can provide to civilian law enforcement in situations where a confrontation or lethal use of force is likely.\n\nDefense intelligence personnel can provide intelligence, analysis, training, equipment and even weapons to civilian authorities. But they are still restricted from using force themselves in those situations.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Ellie Cook is a Newsweek security and defense reporter based in London, U.K. Her work focuses largely on the Russia-Ukraine war, the U.S. military, weapons systems and emerging technology. She joined Newsweek in January 2023, having previously worked as a reporter at the Daily Express, and is a graduate of International Journalism at City, University of London. Languages: English, Spanish.You can reach Ellie via email ate.cook@newsweek.com.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nThePentagonhas denied claims running rampant online around an updated Defense Department (DOD) document outlining how military intelligence can be shared with local and federal authorities, after numerous sources claimed the directive opened the door for the use of force against civilians ahead of the U.S. elections.\n\n\"The policies concerning the use of force by DOD addressed in [the directive] are not new, and do not authorize the DOD to use lethal force against U.S. citizens or people located inside the United States, contrary to rumors and rhetoric circulating on social media,\" Department of Defense spokesperson Sue Gough toldNewsweek.\n\n\"While the paragraph that's been most frequently referenced on social media is new to this directive, it does not reflect any change to DOD's policy regarding the use of lethal force by DOD personnel.\"\n\nThePentagon updated Directive 5240.01,a document setting out how military intelligence could be used by local law enforcement and other U.S. authorities, in late September.\n\nThe Secretary of Defense can approve \"assistance in responding with assets with potential for lethality, or any situation in which it is reasonably foreseeable that providing the requested assistance may involve the use of force that is likely to result in lethal force, including death or serious bodily injury,\" in the official wording of the document.\n\nThe Seattle-based Center for an Informed Public at the University of Washington then noted that \"rumors started to spread between multiple social media platforms and across political communities\" around the directive shortly after the update.\n\nThe claims were shared by on a variety of platforms, including accounts self-described as supporting former PresidentDonald Trump, accounts associated with sharing false information and even prominent political voices. Former independent presidential candidate Robert F. Kennedy, Jr., who has promoted vaccine-related conspiracy theories, said in a post to social media that Directive 5240.01 empowered the Pentagon \"for the first time in history—to use lethal force to kill Americans on U.S. soil who protest government policies.\"\n\nThe directive does not hand over new powers to the military. The directive is actually just a reminder for the Pentagon that if they are backing up law enforcement or police in a scenario where there could be a use of force, this must be greenlit by the Secretary of Defense, said Matthew Savill, the director of military sciences at the London-based Royal United Services Institute (RUSI) think tank.\n\n\"There are still a host of legal protections around domestic activity and this doesn't override anything; it's a statement of policy, not a change in the law,\" Savill toldNewsweek.\n\nThis is not a change of policy, stressed Elizabeth Goitein, co-director of the Liberty and National Security Program at the Brennan Center for Justice, a Washington D.C.-based law and policy institute. Another directive—3025.18—has already been applied to the defense intelligence bodies since the Trump administration, just under a broader umbrella.\n\nThe substance is the \"exact same,\" Goitein said. This has been \"the policy for some time,\" Goitein toldNewsweek. \"They were already subject to it.\"\n\n\"It is not an authorization for any sort of action by defense intelligence components, certainly not an authorization to use lethal force,\" Goitein added. \"It is a procedural restriction on any such operations.\"\n\n\"There are already situations in which the Department of Defense is authorized to provide assistance to civilian law enforcement in situations where there is the potential for lethal force,\" including when the military is deployed under the Insurrection Act, Goitein said. This is not an \"expansion or diminishment\" of current law, Goitein added.\n\nOne account said the directive now \"includes the legal use of lethal force against civilians by the military if directed by DoD [Department of Defense], overriding Posse Comitatus laws that should protect us.\"\n\nHowever, Goitein said: \"The directive is explicit that none of this assistance can be in violation of Posse Comitatus Act.\" She added this act generally bans the federal military getting involved with civilian law enforcement anyway, with few exceptions. One of these is the Insurrection Act, but this directive doesn't in any way expand the Insurrection Act, Goitein said.\n\n\"This directive simply confirms, or simply reiterates, existing Department of Defense policy that the Secretary of Defense has to personally sign off.\"\n\nThe Pentagon updated the directive in late September, around a month and a half before the U.S. election—timing several accounts found suspicious.\n\n\"Speculation about this directive appears to have significant resonance across multiple communities as the November 5 election draws close,\" the Seattle-based Center for an Informed Public at the University of Washington noted in a recent blog entry.\n\n\"The directive simply affirms that this long-standing policy applies to DOD Intelligence Components when they are providing intelligence assistance to civil authorities, including law enforcement,\" Gough toldNewsweek. \"The release was in no way timed in relation to the election or any other event.\"\n\nGoitein said the change coming just ahead of the election is \"probably causing more speculation and concern than it would have if the same update had been issued several months ago.\" She said the timing was \"unfortunate, but not meaningful.\"\n\n\"But without any further context, and without a close reading of the entire directive, you can see how someone would seize on those words, lethal force,\" Goitein added.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nEllie Cook is a Newsweek security and defense reporter based in London, U.K. Her work focuses largely on the Russia-Ukraine war, the U.S. military, weapons systems and emerging technology. She joined Newsweek in January 2023, having previously worked as a reporter at the Daily Express, and is a graduate of International Journalism at City, University of London. Languages: English, Spanish.You can reach Ellie via email ate.cook@newsweek.com.\n\nEllie Cook is a Newsweek security and defense reporter based in London, U.K. Her work focuses largely on the Russia-Ukraine war, the U.S. military, weapons systems and emerging technology. She joined Newsweek in January 2023, having previously worked as a reporter at the Daily Express, and is a graduate of International Journalism at City, University of London. Languages: English, Spanish.You can reach Ellie via email ate.cook@newsweek.com.\n\nEllie Cook is a Newsweek security and defense reporter based in London, U.K. Her work focuses largely on the Russia-Ukraine                                    ...Read more",
        "source_3": "House Speaker Mike Johnson, R-La., tells 'Hannity' why a continuing resolution to fund the government failed.\n\nThe Pentagonreleased an unusual statement Thursday debunking a rumor spread online that falsely claims U.S. troops are authorized to use force against American citizens during the election.\n\nFormer presidential candidate Robert F. Kennedy Jr. and others have spread inaccurate information that suggests a Defense Department policy revision in late September was timed to interfere with the Nov. 5 presidential election.\n\n\"...Biden/Harrishave just pushed through DoD Directive 5240.01 giving the Pentagon power -- for the first time in history -- to use lethal force to kill Americans on U.S. soil who protest government policies,\" Kennedy posted on X to his 4 million followers.\n\nU.S. law prohibits federal troops on American soil from using force against U.S. civilians, except in cases of self-defense as outlined in the Posse Comitatus Act.\n\nUS INVESTIGATING RELEASE OF CLASSIFIED DOCUMENTS ON ISRAEL’S PREPARATIONS FOR POSSIBLE IRAN STRIKE\n\nThe Pentagon in Arlington, Virginia.(STAFF/AFP via Getty Images)\n\nThe cited revision, Department of Defense Directive (DODD) 5240.01, does not allow troops to use force on U.S. citizens. The timing of its release was not related to the election, Pentagon spokeswoman Sue Gough told The Associated Press.\n\n\"The policies concerning the use of force by DOD addressed in DoDD 5240.01 are not new, and do not authorize the DOD to use lethal force against U.S. citizens or people located inside the United States, contrary to rumors and rhetoric circulating on social media,\" Gough said in a statement.\n\nBEWARE THE MOST COMMON TYPES OF ELECTION-RELATED SCAMS\n\nDefense Secretary Lloyd Austin speaks on Oct. 21 in Kyiv, Ukraine.(Vitalii Nosach/Global Images Ukraine via Getty Images)\n\nThe Pentagon regularly updates its directives. This update, which happened on Sept. 27, was intended to align the language on use of force from other policies into 5240.01, which only applies to defense intelligence personnel.\n\n\"Defense Intelligence Components may provide personnel to assist a Federal department or agency, including a Federallaw enforcement agency,or a State or local law enforcement agency when lives are in danger, in response to a request for such assistance,\" it says.\n\nThe directive says the Secretary of Defense must sign off on \"Assistance in responding with assets with potential for lethality, or any situation in which it is reasonably foreseeable that providing the requested assistance may involve the use of force that is likely to result in lethal force, including death or serious bodily injury.\"\n\nFormer presidential candidate Robert F. Kennedy Jr. has spread inaccurate information surrounding the Department of Defense directive.(Rebecca Noble/Getty Images)\n\nDefense intelligence personnel are permitted to supply intelligence, analysis, training, equipment and weapons to civilian authorities. However, they cannot use force themselves.\n\nFox News’ Greg Norman and The Associated Press contributed to this report.\n\nChris Pandolfo is a breaking news reporter for Fox News Digital. Send tips to chris.pandolfo@fox.com and follow him on Twitter @ChrisCPandolfo.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}