{
    "question": "How might the simultaneous allegations against Donald Trump and Doug Emhoff, and the differing levels of media attention they’re receiving, shape voter perceptions of character, credibility, and campaign strategy in the final stretch before the election?",
    "content": {
        "source_1": "Stacey Williams says the ex-president, whose spokesperson denied the allegations, touched her in an unwanted sexual way in 1993, after Epstein introduced them\n\nA former model who says she metDonald Trumpthrough the late sexual abuserJeffrey Epsteinhas accused the former president of groping and sexually touching her in an incident in Trump Tower in 1993, in what she believed was a “twisted game” between the two men.\n\nStacey Williams, who worked as a professional model in the 1990s, said she first met Trump in 1992 at a Christmas party after being introduced to him by Epstein, who she believed was a good friend of the then New York real estate developer. Williams said Epstein was interested in her and the two casually dated for a period of a few months.\n\n“It became very clear then that he and Donald were really, really good friends and spent a lot of time together,” Williams said.\n\nThe alleged groping occurred some months later, in the late winter or early spring of 1993, when Epstein suggested during a walk they were on that he and Williams stop by to visit Trump at Trump Tower. Epstein was later convicted on sex offenses andkilled himself in prisonin 2019.\n\nMoments after they arrived, she alleges, Trump greeted Williams, pulled her toward him and started groping her. She said he put his hands “all over my breasts” as well as her waist and her buttocks. She said she froze because she was “deeply confused” about what was happening. At the same time, she said she believed she saw the two men smiling at each other.\n\nKaroline Leavitt, the press secretary for Donald Trump’s campaign, provided a statement denying the allegations, which said in part: “These accusations, made by a former activist for Barack Obama and announced on a Harris campaign call two weeks before the election, are unequivocally false. It’s obvious this fake story was contrived by the Harris campaign.”\n\nWilliams says that Trump sent her agent a postcard via courier later in 1993, an aerial view of Mar-a-Lago, his Palm Beach residence and resort. She shared it with the Guardian. In his handwriting – using what appears to be his usual black Sharpie – he wrote: “Stacey – Your home away from home. Love Donald”.\n\nWilliams, who is 56 and a native of Pennsylvania, has shared parts of her allegation on social media posts in the past, but revealed details about the alleged encounter on a call on Monday organized by a group called Survivors for Kamala, which supports Democratic presidential nomineeKamala Harris. The Zoom call featured actor Ashley Judd and law professor and academic Anita Hill, among others. Survivors for Kamala also took out an ad in the New York Times this week, signed by 200 survivors of sexual and gender violence, which was meant to serve as a reminder that Trump has been found liable for sexual abuse in a court.\n\nAfter the alleged incident, Williams said that she and Epstein left Trump Tower, and that she began to feel Epstein growing angry at her.\n\n“Jeffrey and I left and he didn’t look at me or speak to me and I felt this seething rage around me, and when we got down to the sidewalk, he looked at me and just berated me, and said: ‘Why did you let him do that?’” she said on the Zoom call.\n\n“He made me feel so disgusting and I remember being so utterly confused,” she said.\n\nShe described how the alleged incident seemed to her to be part of a “twisted game”.\n\n“I felt shame and disgust and as we went our separate ways, I felt this sensation of revisiting it, while the hands were all over me. And I had this horrible pit in my stomach that it was somehow orchestrated. I felt like a piece of meat,” she said in an interview with the Guardian.\n\nShe and Epstein parted ways soon after. Williams said she never had any knowledge of his pattern of sexual abuse, which would later become known. Epstein is now considered one of the worst and most prolific pedophiles in modern history.\n\nThe allegation of groping and unwanted sexual touchingfollows a well-documented pattern of behavior by Trump.\n\nAbout two dozen women have accused the former president, who has been convicted of multiple felonies, of sexual misconduct dating back decades. The allegations have included claims of Trump kissing them without their consent, reaching under their skirts, and, in the case of some beauty pageant contestants, walking in on them in the changing room.\n\nA former model named Amy Dorrisshared allegationsabout Trump similar to what Williams described in an interview with the Guardian in 2020. Trump denied ever having harassed, abused or behaved improperly toward Dorris.\n\nLast year, a jury found Trump liable for sexually abusing the columnist E Jean Carroll in 1996 and awarded her $5m in a judgment.\n\nWilliams’ allegations raise new questions about Trump’s relationship with Epstein.\n\nNo evidence has surfaced that Trump was aware of or involved in Epstein’s misconduct.\n\nBut Trump and Epsteinknew each otherfor decades and were photographed at the same social events in the 1990s and early 2000s, years before Epstein pleaded guilty in Florida in 2008 to state charges of soliciting and procuring a minor for prostitution.\n\n“I’ve known Jeff for 15 years. Terrific guy,” Trump told New York magazine in 2002. “He’s a lot of fun to be with. It is even said that he likes beautiful women as much as I do, and many of them are on the younger side.”\n\nAfter Epstein was arrested on sex-trafficking charges in 2019, Trumptold journalistsin the Oval Office that he “knew him, like everybody in Palm Beach knew him” but that he had a “falling out” with Epstein in the early 2000s.\n\n“I haven’t spoken to him in 15 years,” Trump said. “I was not a fan of his, that I can tell you.”\n\nAsked whether she had considered coming forward in the past, as other women were making allegations against Trump, Williams said she was a person who wanted to avoid negative attention or risk the backlash many other survivors have faced.\n\n“I left the business,” she said. “I disappeared on purpose because I love being anonymous and I love my life of being a private citizen. Then I watched what has happened to women who come out and it is so horrifying and abusive. The thought of doing that, especially as a mother with a child in my house, was just not possible,” she told the Guardian.\n\n“I just chose in my own way – comments on social media to contradict people who said he didn’t do anything,” she said.\n\nLike other survivors, she said, she has processed what happened to her and became more confident about facing an angry backlash, she said.\n\nWilliams spoke about the allegations to at least two friends who spoke to the Guardian. One friend, who asked not to be named, said Williams told her about the alleged incident in 2005 or 2006 during a conversation in which Williams mentioned knowing Epstein, and how he had introduced her to Trump. The friend specifically remembers Williams telling her that she had been groped by Trump. Epstein was not a household name at the time, but the friend would later recall the anecdote when the Epstein scandal erupted.\n\n“What I recall is that it was groping … what we would call feeling someone up,” the friend said.\n\nAlly Gutwillinger, another longtime friend, said Williams told her about the alleged incident in 2015. Gutwillinger remembers the timing because Trump had announced that he was running for president.\n\n“I went to her house sometime in that week and I saw a postcard of Mar-a-Lago and I said: ‘What’s this?’ and she said ‘Turn it over,’” Gutwillinger said. “She said something like: ‘He’s vile, he groped me in Trump Tower.’”",
        "source_2": "Jordan King is a Newsweek reporter based in London, U.K. Her current focus is on religion, health, food safety and population. She has covered the persecution of religions in the global south, fertility and birth rate issues around the world, multiple disease outbreaks in the U.S. and ongoing vaccination discourse. Jordan joined Newsweek in 2024 from The Evening Standard and had previously worked at Metro.co.uk, she has background in international human-interest stories and is a graduate of Kingston University, in London. You can get in touch with Jordan by emailingj.king@newsweek.com. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nDonald Trump's representatives said the former president's latest sexual misconduct accuser, Stacey Williams, used to be an activist forBarack Obama, while denying the allegations against him.\n\nThe former supermodel alleged that Trump groped her body in 1993, after he was introduced to her by the late convicted sex offenderJeffrey Epstein, who she said she was \"seeing\" at the time. She said she had no personal knowledge of any offenses committed by Epstein.\n\nWilliamsdetailed her claims on Mondayin a call with Survivors for Kamala, a cohort of more than 200 survivors of sexual and gender-based violence backing Vice PresidentKamala Harrisin her bid to win the presidential election next month.\n\nTrump's national press secretary for his 2024 campaign, Karoline Leavitt, toldThe Guardian, which first reported the call: \"These accusations, made by a former activist for Barack Obama and announced on a Harris campaign call two weeks before the election, are unequivocally false. It's obvious this fake story was contrived by the Harris campaign.\"\n\nWilliams then went on to talk about the alleged incident onCNN, explaining that she didn't tell anyone about it for 10 years because she \"felt a wave of shame.\"\n\n\"I just couldn't think about it, face it, talk about it for a very long time,\" she continued. \"I put it in a little box inside of me, turned the key, locked it.\"\n\nCNN reported that its journalists spoke to three of Williams' friends to corroborate her story. They said she told them about what allegedly happened with Trump and Epstein in 2006, 2015 and 2016.\n\nWilliams said she had been a Democratic supporter since high school and has worked as a volunteer for the party for decades.\n\nSurvivors4Harris, a partner organization to Survivors for Kamala, declined to comment on the topic of Williams working for Obama.\n\nIt toldNewsweek: \"Survivors for Harris was organized privately by a coalition of sexual and gender-based violence survivors and organizational leaders doing the work on the ground to continue advocating for survivor inclusion.\n\n\"Williams was not directly involved with the planning, organizing, or execution of this Zoom call, and this Zoom call was not an official campaign call. We stand with Stacey and we believe Stacey.\"\n\nNewsweekhas contacted Survivors for Kamala via email for a response on behalf of Williams, as well as the Harris campaign for comment. It has also contacted Obama's team via email.\n\nWilliams worked for Clean Tech for Obama (CT4O) before he was elected on November 4, 2008, according to CT40's End of Project Report, published on November 14, 2008. It raised $1.6 million for the former president's campaign and held multiple events.\n\nThe name Stacey Williams is mentioned multiple times in a list of people who were part of the House Party Outreach Team, Battleground States Directors, Battleground States Coordinators, the Messaging & Media Team, the Battleground States Message Development Team, the Video Projects Team and the National Steering Committee.\n\nSeparately, photo agency Imago references Williams' work for CT4O in a caption on a photograph taken on August 24, 2008.\n\nThe caption reads: \"Stacey WIlliams, a former supermodel, is now following her lifelong passion for organizing by working with Clean Tech for Obama. She returned home to watch the Obamas acceptance speech with her young daughter.\" The photo shows a close-up of Williams' face.\n\nWhenNewsweekcontacted Trump's team for evidence to back up its Obama claim, it sent over a Federal Election Commission document linked to the Obama for America committee with Stacey Williams' name on it.\n\nWilliams told CNN in her interview that she had worked for Clean Tech for Obama, but that she saw this as separate from his campaign. Williams also said she has not spoken with the Harris campaign, according to CNN, which reported that Survivors for Kamala is not officially affiliated with the vice president.\n\nClean Tech for Obama (CT4O) was an organization made up of professionals who aimed to promote Obama's clean energy policies. The group advocated more sustainable energy solutions, which included a reduction in America's reliance on fossil fuels and a shift towards renewable energy.\n\nIts newest version is Clean Energy for Harris (CE4H), which described itself as \"a network of 16,000+ clean energy and climate tech professionals, advocates, and business leaders\" who have a \"commitment to electing Kamala Harris as president of the United States.\"\n\nThe previous version of the group, Clean Energy for Biden (CE4B), raised $3.2 million for the Biden campaign.\n\nNewsweekhas also contacted Harris' team for comment.\n\nUpdate 10/25/24, 6:11 a.m. ET: This article was updated to include information from Williams' CNN interview.\n\nUpdate 10/28/24, 9:40 a.m. ET: This article was updated to include comment from Survivors4Harris.\n\nJordan King is a Newsweek reporter based in London, U.K. Her current focus is on religion, health, food safety and population. She has covered the persecution of religions in the global south, fertility and birth rate issues around the world, multiple disease outbreaks in the U.S. and ongoing vaccination discourse. Jordan joined Newsweek in 2024 from The Evening Standard and had previously worked at Metro.co.uk, she has background in international human-interest stories and is a graduate of Kingston University, in London. You can get in touch with Jordan by emailingj.king@newsweek.com. Languages: English.\n\nJordan King is a Newsweek reporter based in London, U.K. Her current focus is on religion, health, food safety and population. She has covered the persecution of religions in the global south, fertility and birth rate issues around the world, multiple disease outbreaks in the U.S. and ongoing vaccination discourse. Jordan joined Newsweek in 2024 from The Evening Standard and had previously worked at Metro.co.uk, she has background in international human-interest stories and is a graduate of Kingston University, in London. You can get in touch with Jordan by emailingj.king@newsweek.com. Languages: English.\n\nJordan King is a Newsweek reporter based in London, U.K. Her current focus is on religion, health, food safety and                                    ...Read more",
        "source_3": "Published:12:34 BST, 24 October 2024|Updated:16:56 BST, 24 October 2024\n\nDoug Emhoff's ex-girlfriend has spoken exclusively to DailyMail.com claiming that he slapped her in the face so hard she spun around at a 2012 celebrity event inFrance.\n\nThe woman, a successful New York attorney, is remaining anonymous, but decided to speak out after Emhoff,Kamala Harris's husband, denied the claims through a spokesman.\n\nEmhoff's accuser, who DailyMail.com is naming only as 'Jane', initially declined to comment on the record. But Emhoff's denial, and his alleged hypocrisy by claiming to be a feminist in media interviews, finally became too much for her.\n\n'What's frightening for a woman that's been on the other end of it, is watching this completely fabricated persona being portrayed,' Jane said.\n\n'He's being held out to be the antithesis of who he actually is. And that is utterly shocking.'\n\nThe ex-girlfriend of Kamala's husband Doug Emhoff, who DailyMail.com is naming only as 'Jane', alleges that he slapped her in the face so hard she spun around at a 2012 celebrity event in France\n\nThe woman, a successful New York attorney who is remaining anonymous, decided to speak out after Emhoff denied the claims through a spokesman\n\nDoug Emhoff arrives for the amFAR gala dinner in the south of France (right). Jane had booked tickets for the two of them to attend the event the previous month\n\nDailyMail.com broke the storyabout the alleged unprovoked attack on October 2, by reporting accounts from two friends she told immediately after the incident, a third she told in 2018, and documents evidencing her relationship and trip to France with Emhoff.\n\nThe bombshell allegations, which followed DailyMail.com's revelation in August thatEmhoff cheated on his first wifewith his daughter's nanny Najen Naylor, received little or no coverage from politically center-left major news outlets.\n\nEmhoff admitted the affair in a statement in August but his spokesmangave only a short denial of the alleged violence to a politics news site a day after we exclusively reported the slap allegation.\n\nIn a statement to Semafor published October 3, a spokesperson said 'this report is untrue,' and that 'any suggestion that he would or has ever hit a woman is false.'\n\nEmhoff, the Harris campaign, and the White House have failed to respond to DailyMail.com and other outlets' repeated requests for comment.\n\nBut the second gentleman has since continued to brag about his long-held feminist values in softball media interviews arranged by the Harris presidential campaign.\n\n'Every time I see Doug on TV portraying the persona of a perfect spouse and non-toxic man, I wonder if Najen is watching too and feeling as disgusted as I am,' Jane said.\n\nLast week, 'Jane' recounted her story to DailyMail.com – including that Emhoff 'slapped me so hard I spun around,' and that Emhoff told her he was accused by his mistress of causing her to miscarry their baby.\n\nDailyMail.com exclusively broke the story in October about the alleged unprovoked attack in 2012, by reporting accounts from two friends 'Jane' had told immediately after the incident\n\nThe denial by the second gentleman and his alleged hypocrisy by claiming to be a feminist in media interviews convinced the woman to speak out\n\nDailyMail.com has reported that Emhoff impregnated the family's nanny while married to his first wife, allegedly slapped an ex-girlfriend at the Cannes Film Festival and was 'inappropriate' and 'misogynistic' at work\n\nEmhoff and Jane got together in 2012 before he met Harris, who he married in 2014.\n\n'I was living in New York, and Doug was living in Los Angeles,' Jane said. 'I met him on Match.com.\n\n'After work one night I met him for drinks at a hotel near Times Square.'\n\nShe said Emhoff's odd behavior began immediately, when he invited his son Cole to join them about an hour into their first date in March 2012.\n\n'It was an odd request for a first date, but I also felt bad that his son was walking around the city waiting for his dad to finish his Match.com date. So I agreed. In retrospect, it should have been a red flag.'\n\nJane said their relationship consisted of 'an intense few months', with Emhoff discussing marriage and children after just weeks.\n\n'He flew me to Los Angeles in April [2012]. I stayed in his home for a week. The entire time, he was alluding to marriage and having children with me,' she told DailyMail.com.\n\n'He was totally love-bombing me. He grabbed me round the stomach and talked about wanting more babies.'\n\nJane said that less than a month into her relationship she got a lucrative job opportunity in the UK, and Emhoff gave her the impression he was willing to leave his family behind.\n\n'He was really pushing me to pursue it, and he seemed like he was willing to come with me to London,' she said. 'He was ready to uproot, even though he had a family, and he had a child still in junior high school.'\n\nEmhoff has been previously dubbed by Democrats as a 'wife guy' and a 'mensch', a Yiddish term for an honorable, kind man. 'He's being held out to be the antithesis of who he actually is. And that is utterly shocking,' Jane said\n\nA copy of Jane and Emhoff's itinerary shared with DailyMail.com shows a layover flight from Newark, New Jersey to Nice, France on May 22, 2012\n\nEmhoff's first wife and mother of his two kids, Kerstin, had filed to end their marriage three years earlier in June 2009, after splitting with him the month before, according to LA court documents.\n\nBut Jane said she got the impression Emhoff still felt a debt to his ex, and decided to  ask him about it during her LA trip in April 2012.\n\n'We were in Santa Monica. He was driving his fancy car. And so I just straight out asked him: 'I feel like you're on the back foot in the divorce, like you're trying to make up for something?' she said.\n\n'All I did was ask him one question, and he told me the whole story. Without skipping a beat, and staring straight ahead at the road, he tells me he had an affair with his daughter's teacher and that subsequently she claimed that she was pregnant. He's telling me this very casually like it's no big deal.\n\n'He yelled at her. He never said he hit her, but he said he got really angry with her, and she subsequently claimed that whatever he did caused her to lose the pregnancy.\n\n'He said she got a lawyer and was threatening litigation. I was flabbergasted. And I was taken aback by how matter of fact he could talk about it.\n\n'He tried to minimize it. He said there was no proof that the woman had become pregnant. He tried to make it seem like she was scamming him.\n\n'To be honest, I wanted to believe him at the time, because by all appearances this was turning into a serious relationship.\n\n'I had just met both his children, his parents and many people he worked with at Venable. But I did harbor reservations after this.'\n\nThe bombshell allegation of the slap followed DailyMail.com's revelation in August that Emhoff cheated on his first wife Kerstin (right) with his daughter's nanny Najen Naylor. The story about the slap received little or no coverage from politically center-left major news outlets\n\n'Every time I see Doug on TV portraying the persona of a perfect spouse and non-toxic man, I wonder if Najen is watching too and feeling as disgusted as I am,' Jane said. When DailyMail.com approached Naylor she would not comment about her relationship with Emhoff or the baby. 'I'm kind of freaked out right now,' she said\n\nLAPD records obtained by DailyMail.com show that police were called to a house where Naylor was living around the time she was allegedly pregnant in 2009\n\nJane added that Emhoff told her he settled with Naylor for about $80,000, and had her sign an NDA.\n\nLos Angeles Police Department (LAPD) records obtained by DailyMail.com under the California Public Records Act show that police were called to a house where Naylor was living around the time she was allegedly pregnant, at 8:14pm on June 28, 2009.\n\nThe callout was given priority level three, which is a 'life threatening emergency, lights and sirens on'.\n\nLAPD refused to give further information or the names of the individuals involved in the incident, and Najen declined to comment.\n\nHours after DailyMail.com published a story on August 3 revealing claims that Emhoff impregnated his daughter's grade school teacher and part-time nanny, the second gentleman gave a statement to CNN admitting the affair, but not mentioning any pregnancy, miscarriage, or legal agreement.\n\nJane said Emhoff's alleged disclosure to her in April 2012 about his affair gave her pause about their relationship.\n\nBut she had already booked tickets for the two of them to attend the star-studded amfAR gala dinner in the south of France the following month, held alongside Cannes Film Festival.\n\n'I had already planned and paid to go to this event, and he was already invited, so I went ahead and brought him,' she said.\n\nShe described the trip as a 'fairytale' at first. She mingled with A-list celebrities at the May 24 event, dressed in a red ball gown with Emhoff in a dapper tuxedo.\n\nBut she said it turned into a nightmare at around 3am when they joined a long and chaotic line for a taxi outside the Hotel du Cap event venue in Antibes to return to their lodgings in a neighboring town.\n\n'I decided I'm going to go up to the valet and give them 100 bucks, to get out of this line,' Jane said.\n\nA May 17, 2012 email provided by the friends, written by Jane to one of her fellow amfAR attendees, gives the location of the hotel in Nice the couple stayed at that weekend\n\nThe elite charity auction was held at the Hotel du Cap Eden Roc in Antibes, southern France\n\nThe alleged incident purportedly took place after the two attended amfAR's Cinema Against AIDS event at Hotel Du Cap in the South of France in May 2012, where model Heidi Klum and now-disgraced film producer Harvey Weinstein were among the guests\n\n'I put my hand on the valet's shoulder and tell him, with my $100, could you please get me a car as soon as possible.\n\n'As I'm talking to him, Doug got out of the line, comes up, turns me around by my right shoulder. I'm completely caught off guard, I'm not bracing, I'm in four inch heels, wearing a full-length gown and it's between 2-3am.\n\n'He slaps me so hard I spin around, and I'm in utter shock.\n\n'There had been no fight, no argument. It had been a completely fantastic event. I am so furious. The only thing I could think to do was slap him back. I slapped him on one side, and on the other cheek with the other hand.\n\n'In that moment, his mask had dropped and I saw his dark side,' she added.\n\n'All of a sudden the car is there, the valet is ushering me in.\n\n'I intended to go back to the hotel without him. So I was shutting the car door, but he forced his way into the car, which I did not want.\n\n'It's dark. I don't speak French, my friends we're with are off having an amazing time. I'm embarrassed and humiliated that, this amazing experience turned into this violent spectacle.\n\n'I can't believe he just slapped me. I think I said to him in the car, 'What the hell is wrong with you? Why did you do that?' And the only thing I could get out of him was he thought I was hitting on the valet.'\n\nJane said she called a businessman friend in New York from the cab to tell him what just happened. The friend confirmed the call to DailyMail.com.\n\n'This was the first time I saw Doug's ugly side,' Jane said. 'I was in shock. I wanted somebody to know where I was, and what happened. I was freaked out because I thought I knew this person. But I don't, and he's in the car with me.\n\n'I also wanted Doug to see me on the phone telling somebody.'\n\nJane said that less than a month into her relationship she got a lucrative job opportunity in the UK, and Emhoff gave her the impression he was willing to leave his family behind. 'He was really pushing me to pursue it, and he seemed like he was willing to come with me to London,' she said\n\nJane said the next day Emhoff was unapologetic, telling her in a casual manner that they were 'even' and referencing her returned slaps using a tennis metaphor: 'Don't worry about it, you got one across the court and down the line.'\n\nThe New York attorney told DailyMail.com that after the shocking alleged attack, she began to see past behavior by Emhoff in a new light.\n\nAs well as questioning his alleged version of his affair with Naylor, she also recalled a 'weird' incident at their hotel in Nice before the amfAR dinner.\n\n'We went outside and sat on the loungers,' Jane said. 'I'm in a bikini. He wanted to take a picture of me. I didn't think anything of it.\n\n'Later on he sent me a couple of pictures. The picture he took of me did not include my head. I was like, 'Where's my head?' And he was just giggling about it like a pubescent boy.\n\n'It was gross and I felt so humiliated. In retrospect I believe he was intentionally objectifying me to diminish me. That's the kind of person he is.'\n\nEarlier this month, DailyMail.com revealed claims from Emhoff's former colleagues at his ex-law firm Venable thathe was 'misogynistic' and 'inappropriate' with womenat the firm, including bragging to top firm partners that he yelled at a woman and 'put her in her place'.\n\nJane said that the alleged behavior fit with the Emhoff that she knew – but not the one that he presents in media interviews.\n\nShe said that the week after the slapping incident, she told a friend who worked with Emhoff at Venable about it, and the woman responded that Emhoff had a 'bad reputation' with women in the law firm's LA office.\n\nWhen Jane read Emhoff was dating then-California Attorney General Kamala Harris in 2014, the memory of the slap 'all came flooding back'\n\nEmhoff recently sat down for a fawning interview with Jen Psaki during which the former White House Press Secretary told the second gentleman that he had 'reshaped the perception of masculinity'\n\nJane said that long ago she moved on emotionally from Emhoff's alleged violent attack, and she doesn't want to be seen as a 'victim'.\n\n'It was very hurtful at the time. But I am proud of how I responded in real time to this unexpected assault,' the attorney said.\n\n'I had never really wanted to talk about Doug slapping me, to be honest with you, because I was with him for a few months, it was this one moment. And it was enough to wake me up and leave.\n\n'In retrospect, it was the best thing that could possibly have happened, because his mask dropped, and I realized I shouldn't waste another moment with him.'\n\nThe two never spoke after the French trip, Jane said, save for two texts where she requested he paid her money he owed, and he requested a suit he left behind - which she promptly threw in the trash.\n\nBut when she read Emhoff was dating then-California Attorney General Kamala Harris in 2014, it all came flooding back.\n\n'I just got this sinking feeling, like, oh my god, she's engaged to this guy. My first thought was she clearly has not done due diligence on him. And I thought, he's putting the hard sell on her, like he did with me.\n\nJane said she felt compelled to tell her best friend, a female top executive, her story about Emhoff in 2018 after they watched Harris grill Supreme Court Justice Brett Kavanaugh about alleged sexual assault in his 2018 confirmation hearing.\n\nThe friend recounted to DailyMail.com the same story Jane told.\n\nDailyMail.com also obtained a copy of Jane and Emoff's flight itinerary to France, an email to a friend and fellow attendee at the 2012 amfAR gala mentioning Emhoff's attendance, and pictures of the former couple with metadata showing the date and location of the photo.\n\nEmhoff, 59, and movie producer ex-wife Kerstin, 57, ended their 16-year marriage in 2009 when she discovered the affair, the sources said. Their daughter Ella was 10 and son Cole was 15 at the time\n\nA Federal Election Commission record shows Jane and her husband donated thousands of dollars to Joe Biden's 2020 presidential campaign. DailyMail.com redacted the page to preserve Jane's anonymity\n\nFootage obtained by DailyMail.com from the red carpet at the event shows Emhoff walking in the background.\n\nThe material helped confirm key aspects of Jane's story.\n\nJane dismissed any claims that her allegations against Emhoff were politically motivated, adding that she and her husband have been registered Democrats, voted for Joe Biden in the Democratic presidential primary and 2020 election, and donated over $10,000 to Biden's campaigns.\n\nDailyMail.com obtained Federal Election Commission records evidencing the donations, and voter registrations showing the couple's previous registration as Democrats.\n\n'I've recounted the same story for years, and I've been telling this story before he became famous,' she said.\n\nJane added that after reading DailyMail.com's story about Emhoff's affair with his daughter's nanny, she felt 'validated' – but also angry at a lackluster response among some mainstream media.\n\n'I've been telling this story to my friends. And I kept saying, this is a big deal, why doesn't anybody in the media care? And apparently nobody did,' she said.\n\n'Not a single reporter has directly asked Doug about these allegations.\n\n'When some news organizations re-reported your reporting, they even left out the claim that the teacher had become pregnant. I was livid. It's just so clear what's happening. I'm so disgusted.'\n\nJane said she hopes coming forward now, albeit anonymously, will help set the record straight, and prompt a thorough investigation of the POTUS hopeful's husband.\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nWe are no longer accepting comments on this article."
    }
}