{
    "question": "How might the reported CCDH agenda and its STAR proposal, together with Trump’s FEC complaint about UK Labour volunteers campaigning for Harris, shape public perceptions of foreign involvement and online speech regulation in the 2024 race?",
    "content": {
        "source_1": "Allegation references LinkedIn post saying 100 party staffers were headed to US to campaign for Harris\n\nCiting the American revolution while misspelling “Britian”,Donald Trump’s campaign has filed an extraordinary complaint against the UK’s Labour party for what it claims is “interference” in the US presidential election.\n\nThe Trump campaign alleged that in recent weeks, Labour recruited and sent party members to campaign for his opponent,Kamala Harris, in critical battleground states in a bid to influence the 5 Novemberelection.\n\n“When representatives of the British government previously sought to go door-to-door in America, it did not end well for them,” saysa letter from Trump’s legal teamto the Federal Election Commission in Washington.\n\n“This past week marked the 243 anniversary of the surrender of British forces at the Battle of Yorktown, a military victory that ensured that the United States would be politically independent of Great Britian” – an incorrect rendering of “Britain”.\n\nIn response, UK prime ministerKeir Starmer saidthat party officials volunteering for Harris ahead of the US presidential election on 5 November were “doing it in their spare time” rather than in their capacity working for Labour. Speaking to reporters travelling with him to the Commonwealth summit in Samoa, Starmer said: “The Labour party … volunteers, have gone over pretty much every election. They’re doing it in their spare time, they’re doing it as volunteers, they’re staying I think with other volunteers over there.\n\n“That’s what they’ve done in previous elections, that’s what they’re doing in this election and that’s really straightforward.”\n\nHe insisted he had a “good relationship” with the former US president that would not be jeopardised by the complaint.\n\nThe letter goes on to request an immediate investigation into “blatant foreign interference” in the election in the form of “apparent illegal foreign national contributions made by the Labour Party of the United Kingdom” and accepted by Harris’s campaign committee.\n\nIt also refers to areportin the Washington Post that claims advice has been offered between Labour and the Harris campaign, and other reports regarding meetings between senior Labour staff and the Democratic campaign.\n\nThose referenced in the letter include Matthew Doyle, Downing Street director of communications, and Morgan McSweeney, the prime minister’s chief of staff.\n\nThe complaint references a social media post, which appears to have been deleted, in which Sofia Patel, head of operations at Labour, posted on LinkedIn last week that 100 current and former party staffers were headed to the US to campaign for Harris.\n\nThe letter refers to a “volunteer exemption” in US elections which means foreign nationals can volunteer, but the letter states: “They may not be compensated, foreign nationals may not make expenditures, and they may not direct or control activities of US campaigns”.\n\nLast week’s post received a swift backlash from Republicans, with far-right representative Marjorie Taylor Greene writing on X that “foreign nationals are not allowed to be involved in anyway in US elections”.\n\nAnd Elon Musk, the billionaire entrepreneur backing Trump, wrote on X, the social media platform he owns: “This is illegal” – only to delete the post after a community note pointed out there is no law preventing foreigners from participating in unpaid door-knocking.\n\nThe Trump campaign followed up on Tuesday with its legal complaint. Susie Wiles, co-manager of the campaign, said: “In two weeks, Americans will once again reject the oppression of big government that we rejected in 1776. The flailing Harris-Walz campaign is seeking foreign influence to boost its radical message – because they know they can’t win the American people.\n\n“President Trump will return strength to the White House and put America, and our people, first. The Harris campaign’s acceptance and use of this illegal foreign assistance is just another feeble attempt in a long line of anti-American election interference.”\n\nStarmer, the British prime minister, met Trump during a trip to New York last month. Starmer visited Trump Tower, saying he wanted to meet Trump face to face because “I’m a great believer in personal relationships on the world stage”.",
        "source_2": "The British are coming, to meddle in our elections!\n\nIn an explosive leak with ramifications for the upcoming U.S. presidential election, internal documents from theCenter for Countering Digital Hate—whose founder is British political operative Morgan McSweeney, nowadvising the Kamala Harriscampaign—show the group plansin writingto “kill Musk’s Twitter” while strengthening ties with the Biden/Harris administration and Democrats like Senator Amy Klobuchar, who hasintroducedmultiplebills to regulate online “misinformation.” Klobuchar’s office declined repeated requests for comment:\n\nThe documents obtained byThe DisInformation ChronicleandRacketshow CCDH’s hyperfocus on Musk — “Kill Musk’s Twitter” is the first item in thetemplateof its monthly agenda notes dating back to the early months of this year.\n\nTheCenter for Countering Digital Hateis the anti-disinformation activist ally of Prime Minister Keir Starmer’s Labour Party, and a messaging vehicle for Labour’s neoliberal think tank, Labour Together. Both the CCDH and Labour Together were founded by Morgan McSweeney, a Svengali credited with piloting Starmer’s rise to Downing Street, much as Karl Rove is credited with guiding George W. Bush to the White House.\n\nThe CCDH documents carry particular importance because McSweeney’s Labour Together operatives have been teaching election strategy to Kamala Harris and Tim Walz, leadingPoliticoto call Labour and the Democrats “sister parties.” CCDH’s focus on “Kill Musk’s Twitter” also adds to legal questions about the nonprofit’s tax-exempt status as a 501(c)(3) organization.\n\nAccording to the IRS, CCDH could lose its special tax status if “a substantial part of its activities is attempting to influence legislation.” Yet, CCDH’s third item on its annual priority list is “Trigger EU and UK regulatory action” and the group previously employed the firmLot Sixteen to lobby congressional officeson “misinformation” in Washington.\n\nBothThe DisInformation ChronicleandRackethave sent multiple, extensive questions to CCDH’s current CEO Imran Ahmed, another British political operative tied to McSweeney’s Labour Together. Despite repeated requests for comment, Ahmed has refused to respond.\n\nIn the last two months, theWashington PostandPolitico, among others, have run aseriesoffeaturesabout British advisors from Labour Together rescuing the distressed political damsel that is the Harris/Walz campaign.Politicocasts McSweeney as the “election mastermind” who first helped Keir Starmer defeat leftist Jeremy Corbyn to become the head of Labour, all the way to Starmer’s “landslide” win over Conservatives to become Prime Minister this past July, implying that McSweeney and his team can perform a similar miracle for Harris.\n\nMcSweeney is an ascendant figure, having just beenpromoted to Starmer’s Chief of Staffin something of a palace coup after the abruptresignation of longtime Labour fixture Sue Gray. McSweeney is lionized, not just for a Carville-style rightward tilt within the party, but for mastery of fundraising and dark money, havingreportedlypulled a host of new wealthy donors to Labour in the last two years.\n\nAfter 25 years of the “special relationship” being essentially “one-way traffic,” with Washington politicos advising the Brits, the Democrats “now believe they actually have something to learn from Labour,”asPoliticoexplained. Democrats will supposedly learn from Labour’s tactical brilliance. For example, Starmer countered former Conservative PM Rishi Sunak’s accusations of being soft on immigration by promising to “smash the criminal boat gangs” bringing migrants across the English channel.\n\nThe new British government also believes that a Harris defeat would leave Starmer “alone” as the “keeper of the center-left flame” and in “worrying isolation” as “the Grand Atlantic Alliance's last hope.” On top of providing election strategy, over 100 “current and former Labour staffers” have begun knocking on doors for Harris this summer, drawing howls from Trump surrogates such as Sebastian Gorka, who called it a “bloody outrage.”\n\nThe Stateside dispatch of Labour personnel has been depicted in British media as a self-interested gambit to keep America’s war machinery closely aligned with Israel and Ukraine, and billions of American defense dollars flowing in both directions.\n\nHowever, these are only the visible parts of the British invasion. McSweeney’s Labour Together has been operating in the U.S. for several years through CCDH.\n\nThe Starmer/Labour Together formula for regaining power in the U.K. relied heavily on CCDH’s aggressive efforts to deplatform rivals on the Left and Right by lobbing accusations of bigotry, misinformation, and other misdeeds. As reportedinTabletandRacket,one of CCDH’s successesinvolved silencing Starmer’s critics on the left by leading a boycott of advertisers for news sites like the left-leaningCanary,on the grounds that its pro-Palestinian takes were anti-Semitic.\n\nMcSweeney has been praised for convincing Starmer that “he needed to sacrifice party unity to demoralize the far-left faction,”asPoliticoput it.\n\nIn the U.S., a now-defunct CCDH offshoot calledStop Funding Fake Newsled multiple successful boycotts of media figures across the spectrum, fromZero Hedgeduring the BLM riots toThe Federalist.The formula often involved collaborating with a mainstream media outlet to level an accusation of bigotry, followed by a pressure campaign against advertisers to shut off revenue to the target.\n\n“CCDH went directly after us and he worked with Google when they briefly suspended all advertising onZero Hedge, our primary source of revenue then,” recalls Zero Hedge editor Tyler Durden, noting that the boycott came after CCDH workedwith NBCon an article depicting them as racist for claiming damage from BLM riots was under-covered. Similar tactics led to demonetization ofThe Federalist,whose apparent crime was a June 3, 2020 piece called, “The Media Are Lying to You About Everything, Including the Riots.” LikeZero Hedge,The Federalistcriticized mainstream coverage of BLM protests, including callingnot-yet-fired CNNanchor Don Lemon a “not very bright man.”\n\n“NBC News colluded with a foreign left-wing group in an attempt to destroy us because it disagrees with our political commentary and media criticism,”The Federalisteditor Mollie HemingwaytoldThe Wall Street Journalat the time.\n\nMeanwhile, CCDH launched a separate campaign against Substack claiming the company profited from vaccine disinformation. It failed, as the firm “essentially told them to fuck off” when asked to ban contributors like Alex Berenson and Dr. Joseph Mercola from the platform, as a person with ties to the company put it. Berenson’s crime was the headline, “Vaccines don’t stop Covid hospitalizations or deaths,” an article based on aJournal of the American Medical Associationreport. “At Substack, we don’t make moderation decisions based on public pressure,” wrote Substack’s then-PR Director Lulu Meservey. CCDH then quietly “backed off.”\n\nNow, CCDH’s growing Washington office is working on similar plans to “kill” the online presence of Democratic rivals like Musk by attacking X’s advertising revenue, a tactic first perfected in London againstThe Canary. CCDH is also laying the foundation for broader regulatory changes in the direction of platform censorship.\n\n“60 meetings on the Hill,”reads one CCDH task assignmentfrom early 2024. “Meeting with 16 congressional offices over the next two weeks to give updates on the Elon lawsuit,” reads another, referring to Musk’ssince-dismissed lawsuitagainst CCDH accusing it of manipulating data to make a case for proliferation of hate speech on X.\n\nCCDH also held meetings with federal legislators while pushing for “change in USA” toward a censorious proposal it calls the “STAR framework,” which would create an “independent digital regulator” that could “impose consequences for harmful content.” STAR’s core concepts are similar to Europe’s just-institutedDigital Services Actand Britain’s even more stringentOnline Safety Act, which puts thenational media regulator Ofcomin charge of determining fines for uncooperative platforms.\n\nThe latter law has been the basis for Starmer and Ofcom threatening Musk with “strong action” in the wake of this summer’s riots, which the UK claims were fueled by disinformation.\n\nThat the CCDH is pushing STAR in the US is obvious from its agenda notes. Equally clear however is that the group held those meetings while its senior officials wondered if they were violating lobbying laws. “Question on lobbying — if it is anything that Congress could have a vote on, it counts as lobbying,”reads one note from a January meeting. “Question on lobbying. Imran needs that to be checked, and if necessary register a c4 ASAP,” reads a later note in February.\n\nCCDH gained tax-exempt status byregistering as a 501(c)(3) organization in the US in 2021, but the IRS says “an organization will be regarded as attempting to influence legislation if it contacts, or urges the public to contact, members or employees of a legislative body for the purpose of proposing, supporting, or opposing legislation.” In some instances, it appears the group is cognizant of that line.\n\n“Understanding our limitations… as a 501c3,” was another part of discussions last January. Nonetheless, the group repeatedly scheduled multiple meetings with legislators to discuss pushing STAR and other proposals, with Ahmed and others openly talking about pushing for legislation and how CCDH’s work “will help us inchtowards our goal of regulatory action”:\n\nIt’s crucial to understand that CCDH, Labour Together, and Keir Starmer’s Labour Party exist as a single package, with McSweeney at the helm. No political operative in the Western hemisphere is more in demand than Starmer’s “Rasputin,” regularly hailed as agenius. Much like Rove, however, the McSweeney reputation is built more on mudslinging and character assassination than insight into voter needs.Canary-style efforts and boycotts have already begun in the U.S.\n\nMcSweeney’s Labour Together colleague Imran Ahmed opened a CCDH office in DC three years ago and began working with American journaliststo suppress dissent and enforce narrativesfriendly to Democrats and the Biden/Harris administration.\n\nThe CCDH was also a character in theTwitter Files, notably organizing a letter from State Attorneys General to the platform seeking to ban the so-called “Disinformation Dozen” over Covid-related content, a group that included Robert F. Kennedy, Jr.\n\n“I hope you will take decisive action to prevent them from endangering people’s safety any longer,” wrote Imran Ahmed in a July 2020 email to Twitter about “Anti-Vaxx” users.*\n\n“The Disinformation Dozen” report coincided nicely with a Biden administration campaign to beat back American fears of the COVID vaccine and was referenced by White House Press Secretary Jen Psaki in a warning that social media companies should censor the accounts.\n\n“There’s about 12 people who are producing 65% of anti-vaccine misinformation on social media platforms,” Psakiclaimed, citing the CCDH’s work. Three years later the truth finally caught up with Ahmed’s misinformation. In recent months,Forbes,The Independent, andThe Guardianhave all issued corrections to articles on CCDH’s 2021 report noting that Facebook investigatedCCDH’s allegationsand found them baseless and without proven methodology.\n\nAccording to documents provided to both publications along with interviews with CCDH whistleblowers, an invitation-only conference held this past summer in Washington underscores the group’s priorities. Attendees atCCDH’s private event included a slew of liberal groupsnow organizing against Musk including a senior advisor at the White House, a Democratic Party staffer in the office of Congressman Adam Schiff, Biden/Harris State Department officials, Canadian MP Peter Julian (recently tweeted “Boycott all advertisers on Twitter”) and Media Matters for America (a Democratic party-aligned watchdog now locked in a lawsuit with Musk).\n\nThe second annual CCDH priority on the document reads, “Advertising focus.” This likely references the group’s apparent strategy of publishing reports that claim Musk allowed hate to proliferate on X, followed by efforts to drive away the company’s advertisers, as it did with theCanary, later withZero HedgeandThe Federalist,and most recently has aimedat the entire X platform.\n\nFresh from success at destroying theCanaryand the Labour left, Imran Ahmed brought the CCDH campaign to the States in 2021. And the group has continued to operate as it has in the past: a dark money political campaign that dances around legalities while hiding the names of employees and donors. As reported inTablet, U.S. tax records show that Ahmed collected $1.47 million in donations in 2021.\n\nAlthough CCDH does not disclose donors, $1.1 million of that money came from one anonymous donor, meaning almost 75% of CCDH’s funding in their first year. A whistleblower says that CCDH’s management told staff that this initial bolus of funding came from Aleen Keshishian, a Hollywood agent for actor Mark Ruffalo, who promotes Imran Ahmed on X.Keshishian sits on CCDH’s board, and CCDH employees are reminded to treat her nicely.\n\nAnother Keshishian client, the singer and actress Selena Gomez, has also apparently provided secret funding to CCDH, although that donation has not been disclosed publicly until now.\n\nAleen Keshisian did not respond to repeated requests for comment fromThe DisInformation ChronicleandRacket.\n\nSubsequent reports in thisThe DisInformation ChronicleandRacketseries will contain more information about the emerging theme of cooperation between Hollywood figures and censorship advocacy groups like the CCDH.\n\nJournalist Paul Holden, who put together the “U.K. Files” docshere, reported earlier this year thatCCDH’s 2021 submission to the IRSfor tax-exempt status claimed CCDH was operating as a registered charity in the U.K.\n\nNeither Ahmed nor his attorneys responded to questions about his false paperwork filed with the IRS. We thenran the documentspast tax attorney Dean Zerbe, whoauthored the tax codereform that governs American nonprofits. Zerbe said he hoped the IRS would take a “hard look” at CCDH for submitting false information to gain nonprofit status.\n\nMany of CCDH’s current staff remain hidden, but one of Ahmed’s most critical employees is Callum Hood, CCDH’s head of research. Like Ahmed, Hood has never fully disclosed his ties to the Labour Party’s conservatives who sought to drive Corbyn from power. Onhis LinkedIn page, Hood lists the Center for Countering Digital Hate as the only job he has ever held. However, sources in London have provided much of Hood’s background. Like Imran Ahmed, he staffed a member of the Labour Party’s conservative wing.\n\nAccordingto British Parliament records, Hood worked for Labour Party MP Ian Austin. Austin helpedlead the charge against Corbyn’s leadershipand urged voters to back Conservative Boris Johnson. When Johnson became Prime Minister, hethen recommended Austinto the House of Lords.\n\nAustin now goes by the title “Lord Austin of Dudley.”\n\n“This was a political project from the beginning by Labour Together,” Holden says. “It’s extremely disturbing that Imran has influence in the US, considering his key aim is to censor speech he disagrees with.”\n\nNEXT: The DisInformation Chronicle and Racket give an insider’s account of the internal chaos and secret money fueling CCDH, one of the most prominent and respected groups for the Censorship Industrial Complex.\n\n*An earlier version of this story incorrectly identified the quoted letter as referring to the “Disinformation Dozen.” It referred to an earlier group of “Anti-Vaxx” users. Racket and the Disinformation Chronicle apologize for the error.",
        "source_3": "The United Kingdom’s Center for Countering Digital Hate (CCDH) intends to “Kill Musk’s Twitter,” according to internal documents obtained by The DisInformation Chronicle and Matt Taibbi’s “Racket.”\n\nMorgan McSweeney is a British political operative providing advice to Vice President Kamala Harris,accordingto the report. He was a former board member of the CCDH,according toInfluenceWatch. His LinkedInpagesays he served as the organization’s company director until April 2020. McSweeney attended this year’s Democratic National Convention (DNC) to speak with members of Vice President Kamala Harris’ team, Politicoreported.\n\nThe CCDH documents obtained by Chronicle reveal one of the group’s chief priorities was to “Kill Musk’s Twitter,” and thegroupalso intended to meet with Democratic Minnesota Senator Amy Klobuchar’s team. “Kill Musk’s Twitter” is the first order of business in the CCDH’s monthly agenda plans which go back to January 2024, according to screenshots in the report.\n\nSen. Klobuchar’s office did not respond to the Chronicle’s request for comment.\n\nPolitico dubbed the UK’s left-wing Labour Party and the Democrats as “sister parties.” Recently, a Labour Party official announced on LinkedIn that about 100 current and former party staff would campaign on the ground for Harris, the Daily Caller News Foundation (DCNF)reported. The posts have since been deleted.(RELATED: State Department Worked With Fact-Checkers, Academics To Censor Conservative Media, Report Says)\n\nSofia Patel, head of operations for the Labour Party, shared plans via LinkedIn on how to get British left-wing political operatives to the U.S. to help Kamala Harris win the election.pic.twitter.com/am2osqrdVv\n\nMcSweeney was promoted this month to Labour Prime Minister Keir Starmer’s chief of staff, the BBCreported.(RELATED: UN Takes Cues From Orgs That Seek To Censor Conservatives)\n\nThe CCDH targets “disinformation” and is the means of communication for Labour’s think tank, Labour Together, according to the Chronicle. McSweeney was also previously director of Labour Together, according to his LinkedIn page.\n\nOther objectives of the organization include “Trigger EU & UK regulatory action” and “Progress towards change in USA and support for STAR,” according to the documents.\n\nSTAR is a framework for policymakers to adopt for social media regulation,accordingto the CCDH’s site. STAR would create an “independent digital regulator” to enforce online safety mandates,documentsfrom the organization read. The U.K. implemented the Online Safety Act, which faced criticism for potentially jeopardizing privacy, in 2023, WIREDreported.\n\nThe CCDH met with federal legislators while advocating for “change in USA” and pushing STAR, according to the Chronicle.\n\nThe draconian#OnlineSafetyBillbecomes law in the UK.\n\nFrom forcing content takedowns to scanning our messages en-masse, the future of free speech and privacy in Britain needs defending – now more than ever.\n\nRead⤵️https://t.co/ErUE1roDXlpic.twitter.com/dqt3cL4nif\n\n— Big Brother Watch (@BigBrotherWatch)October 26, 2023\n\nThe CCDH planned to meet with 16 congressional office to “give updates on the Elon lawsuit,” according todocumentsobtained by The DisInformation Chronicle. Musk’s lawsuit alleged that the group’s report on X’s management of hate speech included “false and misleading claims,” Tabletreported.(RELATED: Harris Reportedly Bringing In European Socialist To Advise Campaign On Home-Stretch Strategy)\n\nThe lawsuit was thrown out by a federal judge in California, the DCNFreported.\n\nToday a federal court in San Francisco issued a decision in the case X brought against the Center for Countering Digital Hate for illegally obtaining platform data to create misleading research. X disagrees with the court’s decision and plans to appeal."
    }
}