{
    "question": "How might the Senate’s approval of the $9 billion rescissions package—largely from foreign aid and the Corporation for Public Broadcasting—affect Congress’s power of the purse, public media at the local level, and future bipartisan spending negotiations?",
    "content": {
        "source_1": "President Trump’s request to claw back $9 billion in congressionally approved spending passed despite objections from Republicans who said it abdicated the legislative branch’s power of the purse.\n\nCongress approved a White House request to claw back $9 billion for foreign aid and public broadcasting, after Republicans bowed to President Trump in an unusual surrender of congressional spending power.\n\nThe House’s 216-to-213 vote early Friday morning sent the package to Mr. Trump for his signature. Two Republicans, Representatives Brian Fitzpatrick of Pennsylvania and Michael R. Turner of Ohio, opposed the measure.\n\nThe Senate approved the package in a predawn 51-to-48 vote the day before, overcoming the objections of two Republicans, Senators Susan Collins of Maine and Lisa Murkowski of Alaska, who argued that their party was ceding Congress’s constitutional control over federal funding.\n\nThe bulk of the funds targeted — about $8 billion — was for foreign assistance programs. The remaining $1.1 billion was for the Corporation for Public Broadcasting, which finances NPR and PBS.\n\nThe debate on the measure laid bare a simmering fight over Congress’s power of the purse. Since Mr. Trump began his second term, the White House has moved aggressively and at times unilaterally, primarily through the Department of Government Efficiency, to expand the executive branch’s control over federal spending, a power the Constitution gives to the legislative branch.\n\nTop White House officials, led by Russell T. Vought, the budget office director, have sought to rein in the size of the federal government, including by freezing funds appropriated by Congress. It is part of a wider campaign to claim far-reaching powers over federal spending for the president.\n\nThis time, the administration went through a formal process by submitting what is known as a rescissions bill. Those measures are rare and seldom succeed, given how tightly Congress has historically guarded its power over federal spending. The last such package to be enacted was in 1999, under President Bill Clinton.\n\nMr. Trump wasted little time in celebrating, singling out in an all-caps social media post early Friday the cuts to “atrocious NPR and public broadcasting, where billions of dollars a year were wasted.”\n\n“Republicans have tried doing this for 40 years, and failed….but no more,” he added. “This is big!!!”\n\nG.O.P. leaders said the vote was a symbolic victory that underscored the Republican-held Congress’s willingness to cut federal spending they viewed as inappropriate and wasteful.\n\n“I appreciate all the work the administration has done in identifying wasteful spending,” Senator John Thune of South Dakota, the majority leader, said in a speech ahead of the vote. “Now it’s time for the Senate to do its part to cut some of that waste out of the budget. It’s a small but important step toward fiscal sanity that we all should be able to agree is long overdue.”\n\nBut the process left even some Republicans who ultimately voted for the bill uncomfortable. A number of senators said the administration had not provided details about what specific programs would be affected.\n\n“If we find out that some of these programs that we’ve communicated should be out of bounds — that advisers to the president decide they are going to cut anyway,” Senator Thom Tillis of North Carolina, who is retiring, said, “then there will be a reckoning for that.”\n\nAnd even as G.O.P. senators agreed to cancel funding at the White House’s request, 10 of them signeda rare public letterto Mr. Vought demanding that he reverse a decision to withhold roughly $7 billion in congressionally approved funding to their states meant to bolster educational programs including after-school and summer programs.\n\n“The decision to withhold this funding is contrary to President Trump’s goal of returning K-12 education to the states,” the Republicans wrote.\n\nTo win the votes of Republican senators who initially objected, G.O.P. leaders agreed to strip out a $400 million cut that Mr. Trump requested to the President’s Emergency Plan for AIDS Relief, known as PEPFAR. The White House signaled it would not contest the change.\n\nThey also shielded some funding for some specific programs, including aid to Jordan and Egypt; Food for Peace, a program that provides food assistance to other countries; and some global health programs.\n\nAnother holdout, Senator Mike Rounds of South Dakota, who had previously indicated that he would oppose the request because of the cuts to public broadcasting, decided to support the package. He said he had been assured by top Trump administration officials that they would steer unspent funds “to continue grants to tribal radio stations without interruption” for next year.\n\nAhead of the vote, the head of a network of Native radio and television stations privately appealed to Mr. Rounds to oppose the package, saying the deal he had made was unworkable.\n\n“There is currently no clear path for redirecting these funds to tribal broadcasters without significant legislative and administrative changes,” Loris Taylor, the president of Native Public Media, wrote.\n\nThe vote incensed Democrats, who argued that Republicans were ceding Congress’s constitutional powers in the name of cutting a minuscule amount of spending, just weeks after passing their marquee tax bill that would add $4 trillion to federal deficits.\n\nThey warned that it could have dire consequences for future bipartisan negotiations to fund the government. Lawmakers are currently working to negotiate spending levels ahead of a Sept. 30 shutdown deadline.\n\n“We have never, never before seen bipartisan investments slashed through a partisan rescissions package,” Senator Patty Murray of Washington, the top Democrat on the Appropriations Committee, said. “Do not start now. Not when we are working, at this very moment, in a bipartisan way to pass our spending bills. Bipartisanship doesn’t end with any one line being crossed; it erodes. It breaks down bit by bit, until one day there is nothing left.”\n\nThe vote codified a number of executive actions the administration advanced earlier this year togut foreign aid programs, many first undertaken by DOGE.\n\nThe effects on public media are yet to come, but the passage of the bill caused immediate alarm. Katherine Maher, the chief executive of NPR, said in a statement early Friday that the cuts represented “an unwarranted dismantling of beloved local civic institutions, and an act of Congress that disregards the public will.”\n\nNPR and PBS will survive — only a small percentage of their funding comes from the federal government. But thecuts will force many local stations to sharply reduce their programmingand operations as early as this fall. Many public broadcasters receive more than 50 percent of their budgets from the Corporation for Public Broadcasting.\n\nThat means the package could be a death sentence for some stations, which have survived several attempts to choke off funding over the decades. For other broadcasters, it will mean cutting back on local programming.\n\n“We just don’t have a lot of fat to trim elsewhere,” Julie Overgaard, the executive director for South Dakota Public Broadcasting, said in an interview ahead of the vote.\n\n“On the PBS side of things, I can’t just start cherry-picking which national programs I want and only pay for those,” she said. “So it really leaves me and many others with little choice but to look at the local programming that we self-generate.”\n\nBenjamin MullinandMichael Goldcontributed reporting.",
        "source_2": "The US Senate has passed a bill that seeks to cut $9bn (£6.7bn) from funds previously approved for spending by Congress, including cuts to public broadcasting and foreign aid.\n\nThe 51-48 vote happened just before dawn on Thursday, following an hours-long overnight \"vote-a-rama\", as the Republican-led Senate negotiated amendments.\n\nThe bill - a so-called rescissions package that allows Congress to claw back approved funding - is part of a larger effort to reduce federal spending by President Donald Trump.\n\nIt now returns to the House of Representatives, the lower chamber of Congress that had previously passed a version of the bill with $9.4bn in proposed cuts.\n\n\"It's a small but important step toward fiscal sanity that we all should be able to agree is long overdue,\" Senate Majority Leader John Thune said before the final vote.\n\nSenators had previously disagreed over a proposition in the House version of the bill that would have included roughly $400m in cuts to Pepfar, the US-backed HIV/Aids programme.\n\nRepublicans were able to reach a majority after anamendment was made to keep the fundingin the budget.\n\nHowever, dozens of other amendments to maintain international aid spending levels and funding for public broadcasting were rejected.\n\nThe Senate version of the bill approved on Thursday would still cut roughly $8bn from multiple aid programmes, including global health programmes under USAID, the US's main philanthropic arm.\n\nThe bill would also cut more than $1bn from the Corporation for Public Broadcasting, which funds NPR and PBS as well as radio stations on which many rural Americans rely.\n\nSenator Lisa Murkowski, from Alaska, was one of two Republicans who joined all Democrats in voting against the bill, in part due to the cuts to public broadcasting.\n\nIn reaction to the Senate passing the bill, the president of NPR, Katherine Maher, said it was \"essential that its funding be sustained\".\n\nAs recently as Wednesday, people in Alaska had been told to tune into a local radio station that included NPR programming to receive tsunami warning updates after an earthquake struck off the coast, Maher added in her written statement.\n\n\"We call on the House of Representatives to reject this elimination of public media funding, which directly harms their communities and constituents, and could very well place lives at risk,\" she continued.\n\nThe bill will next head to the House for a vote, where its path remains unclear after $400m was reduced from House-proposed spending cuts.\n\nWhen asked about the changes, House Speaker Mike Johnson said: \"We wanted them to pass it unaltered like we did.\"\n\nBoth the House and Senate must agree on a version of the rescissions package  before it expires on Friday, and Republicans lose their chance to cut the funds.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nScientists who analysed fragments that crashed into a roof in Georgia, US, say it likely formed 4.56 billion years ago.\n\nTariffs, oversupply and teetotaling Gen-Zs have all contributed to the downfall of one of America's most iconic liquors.\n\nJen Pawol donated her hat to a baseball museum after her history-making game on Saturday.",
        "source_3": "Fox News senior congressional correspondent Chad Pergram reports on Vice President JD Vance breaking a Senate tie on President Donald Trump's 'clawback' bill as the Senate is expected to vote on the package again.\n\nThough Senate Republicans were successful in their mission to pass PresidentDonald Trump’sclawback package, not every member of the conference was on board.\n\nOnly two Republicans, Sens. Lisa Murkowski, R-Alaska, and Susan Collins, R-Maine, joined with every Senate Democrat to vote against the $9 billion package geared toward clawing back foreign aid and public broadcasting funding.\n\nSENATE GOP BLOWS THROUGH 2ND HURDLE OF THE NIGHT, TEEING UP TRUMP'S CLAWBACK BILL FOR HOURSLONG DEBATE\n\nPresident Donald Trump during a meeting with Salman bin Hamad Al Khalifa, Bahrain's crown prince, not pictured, in the Oval Office of the White House in Washington on July 16, 2025.(Aaron Schwartz/CNP/Bloomberg via Getty Images)\n\nSenate Republicanleaders had hoped that stripping $400 million in cuts to Bush-era international AIDS and HIV prevention funding could win over all the holdouts, both public and private. But the lawmakers who voted against the bill had deeper concerns about the level of transparency during the process and the impact successful rescissions could have on Congress’ power of the purse.\n\nCollins, who chairs the Senate Appropriations Committee, said she agreed with rescissions in general and supports them during the appropriations process, but couldn’t get behind theWhite House’spush because of a lack of clarity from the Office of Management and Budget (OMB) about exactly what would be cut and how.\n\nShe said that \"the sparse text\" sent to lawmakers included little detail and did not give a specific accounting of programs that would be cut to hit the original $9.4 billion target.\n\nTRUMP'S $9 BILLION CLAWBACK PASSES FIRST SENATE TEST, WHILE MORE HURDLES AWAIT\n\nSen. Susan Collins addresses the press at Washington Crossing Inn on November 6, 2022, in Washington Crossing, Pennsylvania.(Mark Makela/Getty Images)\n\n\"For example, there are $2.5 billion in cuts to the Development Assistance account, which covers everything from basic education, to water and sanitation, to food security — but we don't know how those programs will be affected,\" she said.\n\nMurkowski demanded a return to legislating and appeared to warn that lawmakers were just taking marching orders from the White House rather than doing their own work.\n\nBoth Murkowski and Collins were also concerned about the cuts to public broadcasting, particularly to rural radio stations. Both attempted to make changes to the bill during the vote-a-rama. Collins' ultimately decided not to bring her amendment, which would have reduced the total amount of cuts in the bill to north of $6 billion, to the floor. However, Sen. Mark Kelly, D-Ariz., still brought the change for a vote. And Murkowski offered an amendment that would have drastically reduced the cuts to public broadcasting.\n\nThe climactic vote for the bill came hours after tsunami warnings rippled through Alaska, and Murkowski argued that federal warnings were relayed through local public broadcasting.\n\n\"The tsunami warnings are now thankfully canceled, but the warning to the U.S. Senate remains in effect,\" she said. \"Today of all days, we should vote down these misguided cuts to public broadcasting.\"\n\nStill, both attempts to modify the bill failed to pass muster.\n\nTheir decision to go against the package left some scratching their heads. Sen.Ron Johnson, R-Wis., argued that the cuts amounted to less than a tenth of a percent of the federal government’s entire budget.\n\n\"This should be a chip shot, OK? I have faith in [OMB Director] Russ Vought,\" he said. \"I have faith in the Trump administration. They're not going to cut things that are important spending.\"\n\nSENATE GOP AGREE TO STRIP CUTS TO HIV, AIDS PREVENTION PROGRAM FROM TRUMP'S CLAWBACK BILL\n\nSen. Lisa Murkowski, R-Alaska, speaks during a news conference about high gas prices at the U.S. Capitol on May 18, 2022, in Washington.(Drew Angerer/Getty Images)\n\nSen. Eric Schmitt, R-Mo., who is leading the bill in the Senate, rebuked the duo's arguments and said that lawmakers weighing in on the rescissions package was in line with their legislative duties.\n\n\"That's exactly what we're doing,\" the Missouri Republican said. \"I would hope that maybe what this will also do is highlight some of the wasteful spending, so when we get into the appropriations process in the next few months that we would be more keen to be focused on saving people money.\"\n\nTrump’s bill, which would cancel unspent congressionally approved funding, would slash just shy of $8 billion from the U.S. Agency for International Development (USAID), and over $1 billion from the Corporation for Public Broadcasting (CPB), the government-backed funding arm for NPR and PBS.\n\nSome lawmakers, like Sen. Thom Tillis, who earlier this month voted against Trump's \"big, beautiful bill\" over cuts to Medicaid funding, understood where the pair were coming from.\n\nThe North Carolina Republican told Fox News Digital that Collins, in particular, would be leading negotiations for an end-of-year bipartisan funding deal withSenate Democrats, and to vote in favor of canceling congressionally approved funding could hurt her ability to find a solution to keep the government funded.\n\n\"I don't think people really understand the value of your word and your consistency and your living up to commitments and how important that is to getting things done,\" Tillis said. \"And this, I think, that's what Susan's looking at, I think Murkowski is as well, and I respect them for that.\"\n\nAlex Miller is a writer for Fox News Digital covering the U.S. Senate.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}