{
    "question": "How might implementing the bipartisan panel’s recommended reforms—shifting focus from financial crime investigations, adding overhead surveillance at outdoor events, improving joint communications with local police, and bringing in outside leadership—reshape the Secret Service’s protective mission and culture, and what challenges could arise in meeting the March deadline?",
    "content": {
        "source_1": "An independent, bipartisan review identified “numerous mistakes” by the Secret Service and “specific failures and breakdowns” that enabled the assassination attempt that injured former President Donald Trump in Butler, Pennsylvania, in July.\n\nThe panel, made up of four former senior law enforcement and government officials, also warned of another catastrophic security lapse if the Secret Service does not immediately undertake “fundamental reform.”\n\n“The Secret Service has become bureaucratic, complacent, and static,” the panel wrote in a letter to Homeland Security Secretary Alejandro Mayorkas, who oversees the organization.\n\n“The Secret Service as an agency requires fundamental reform to carry out its mission,\" the members added. \"Without that reform, the Independent Review Panel believes another Butler can and will happen again.”\n\nIn an interview with NBC News, acting Secret Service Director Ronald Rowe said he was still processing the review but has already begun reforming the agency.\n\n\"We have not been sitting back waiting for reports like this to come out,\" Rowe said. \"Following the horrific events of July 13, we’ve already started to make not only operational changes, but policy changes, and to ensure that we don’t have another mission failure like July 13.\"\n\nFor more on this story, tune in to NBC Nightly News with Lester Holt tonight at 6:30pm ET/5:30pm CT or check your local listings.\n\nRowe acknowledged that his agents are being stretched to the limits.\n\n\"We are redlining our people. We are asking them to do extraordinary things right now,\" he said. \"They’re spending long hours at work, away from their families, but they are meeting this moment right now, and so I’m pushing myself to make sure that I’m advocating for them.\"\n\nThe panel conducted 58 multihour interviews of individuals from the Secret Service, federal, state and local law enforcement, and reviewed more than 7,000 documents, according to its report. The panel members and staff also traveled to Butler where they surveyed the site of the assassination attempt.\n\nThe group said it identified “deep flaws in the Secret Service, including some that appear to be systemic or cultural,” including a “lack of critical thinking among Secret Service personnel” and agents’ unwillingness to “speak up” regarding potential threats.\n\nThe new report reflects much of what was previously reported about the Secret Service’s failures before and during the July 13 rally. No personnel from the Secret Service or any other federal, state or local law enforcement agency, for example, were specifically tasked with securing the roof of the building from which the gunman fired at Trump.\n\nMitigating the line of sight from the building to the stage with physical barriers if needed should have been a standard operating procedure for the Secret Service and “represents a critical security failure,\" the review said.\n\nTrump’s Secret Service detail did additional advance work prior to the rally, including a countersniper advance, specifically because the leader and assistant leader of Trump’s personal detail had been read in on intelligence “related to a long-range threat against former President Trump by a foreign actor, though not specific to the Butler rally.\n\nThe Trump campaign later said that Trump had been briefed by U.S. intelligence officials on “real and specific threats” from Iran to assassinate him.\n\nThomas Matthew Crooks’ \"method of attempted assassination embodied the very sort of threat which the intelligence warned against” the report concluded.\n\nIn a footnote, the report notes that “the panel has encountered some evidence that Trump Campaign staff expressed resistance regarding the placement of certain heavy equipment and/or vehicles at the site,” which could have been used to mitigate the line of sight risk.\n\nThe report said it was ultimately the responsibility of the Secret Service to ensure appropriate mitigations are in place and “escalate areas of difference between campaign staff and the service to their proper resolution.”\n\nTwo hours before the assassination attempt, Crooks was able to operate a drone at the rally site at 3:51 p.m. for approximately 11 minutes. His drone went undetected because the Secret Service’s system to counter drones had a technical issue and was inoperative for many hours. In the end, the system did not start working more than a half-hour after Crooks used the drone.\n\nThe report also describes the failure of Secret Service or local law enforcement officials to find Crooks, despite him being first identified as suspicious more than 90 minutes before he opened fire on Trump.\n\nCrooks was first identified by a local countersniper team member about to go off duty. He sent a text to other countersnipers warning that Crooks had snuck into a parking lot that was intended to be off limits and had been blocked off by physical barriers.\n\nMost importantly, the leadership of Trump’s Secret Service detail was never informed of a person acting suspiciously in the crowd before the former president took the stage, or in the minutes after Crooks had positioned himself on the roof of the building and was preparing to shoot.\n\nIt was only at 6:09 p.m., four minutes after Trump began to speak, that a Pennsylvania state trooper stationed with the Secret Service in the security room conveyed verbally that Crooks was the suspicious individual who had been ranging the stage and was now on the roof of a building.\n\nThe Secret Service’s security room did not have a direct view of the rally stage and “did not have an operating Incident Command System for the centralized reporting and tracking of events and issues that arose.”\n\nThe panel recommended a series of reforms to be implemented by the Secret Service as soon as possible, such as overhead surveillance for outdoor events, additional training and the establishment of central communications hub for large events. The panel also recommended that all participating law enforcement agencies be included.\n\nPerhaps most surprisingly, the panel did not find a lack of funding to be an underlying factor in the failures of the Secret Service. The agency’sbudget almost doubled over the last decade, jumping from around $1.8 billion in fiscal 2014 to more than $3 billion, according to government filings.\n\nDuring the same period, agencywide staffing rose by almost 25%, with more than 8,100 personnel. They include roughly 3,200 special agents and 1,300 uniformed officers, according tothe agency’s website.\n\nThe report concludes that the agency’s failures go beyond spending. “Even an unlimited budget would not, by itself, remediate many of the failures of July 13,” it said.\n\nSarah Fitzpatrick is a senior investigative producer and story editor for NBC News. She previously worked for CBS News and \"60 Minutes.\"\n\nI am NBC News’ Senior Homeland Security Correspondent.",
        "source_2": "Our Standards:The Thomson Reuters Trust Principles., opens new tab\n\nU.S. President Donald Trump said on Monday that both Ukraine and Russia would have to cede land to each other to end the war and that his talks with Russian President Vladimir Putin would be aimed at taking the temperature on a possible deal.\n\nReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.\n\nAccess unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.\n\nBrowse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.\n\nScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.\n\nAll quotes delayed a minimum of 15 minutes.See here for a complete list of exchanges and delays.",
        "source_3": "Trump 2024 campaign senior adviser Danielle Alvarez joined 'Fox & Friends First' to discuss her take on Harris' sit-down interview with Fox News' Bret Baier and Trump's bid to win over more Latino voters.\n\nA bipartisan panel condemned the Secret Service handling offormer President Trump's rallyin Butler, Pennsylvania on Thursday, saying the agency needs \"fundamental\" changes to be effective.\n\nThe panel, made up of former senior law enforcement and government officials, warned that if there are not extensive reforms at the Secret Service, then \"another Butler can and will happen again.\"\n\nButler, Pennsylvania, was the site of the first assassination attempt against Trump this year. The Secret Service faced heavy criticism for negligence and sluggish reaction speed.\n\n\"The Secret Service as an agency requires fundamental reform to carry out its mission,\" the panel wrote in a letter to Homeland Security Secretary Alejandro Mayorkas. \"Without that reform, the Independent Review Panel believes another Butler can and will happen again.\"\n\nCOPS NAB MAN ALLEGEDLY CARRYING ILLEGAL GUNS NEAR TRUMP'S COACHELLA RALLY; SUSPECT SAYS HE BACKS EX-PRESIDENT\n\nAn independent review panel says the Secret Service needs extensive reforms in order to be effective.(AP Photo/Evan Vucci)\n\nThe panel's review highlighted key issues both within the Secret Service and specifically regarding the July 13 assassination attempt. The agency had poor communications both internally and with local law enforcement, the panel said. Agents on the ground also had no plan to secure key buildings around the rally venue.\n\n\"The failure to secure a complex of buildings, portions of which were within approximately 130 yards of the protectee and containing numerous positions carrying high-angle line of sight risk, represents a critical security failure,\" the report said.\n\n\"Relying on a general understanding that ‘the locals have that area covered’ is simply not good enough and, in fact, at Butler this attitude contributed to the security failure,\" it continued.\n\nAn independent panel says the Secret Service failed to ensure the complex of buildings near Trump's rally in Butler was secure.(Fox Flight Team )\n\nThe panel also noted a breakdown in communications. There were two command posts at the Butler rally, one for local law enforcement and another for the Secret Service.\n\nSecret Service agents also had to switch radio channels due to an event for First Lady Jill Biden in Pittsburgh. The first lady's Secret Service team's communications could be heard at the Butler rally at the time.\n\nDrone footage shows the sight line the Trump shooter used to open fire at the rally in Butler, Pennsylvania.(Fox News)\n\nThe panel ultimately recommended that the Secret Service bring in outside leadership, as well as de-emphasize its role in investigating financial crimes.\n\n\"In the Panel’s opinion, it is simply unacceptable for the Service to have anything less than a paramount focus on its protective mission, particularly while that protective mission function is presently suboptimal,\" the report said.\n\nActing Secret Service Director Ronald Rowe respond to the report in a Thursday statement.\n\n\"We respect the work of the Independent Review Panel and will carefully examine the report and recommendations released today,\" Rowe said. \"However, we are not waiting to act. We have already significantly improved our readiness, operational and organizational communications and implemented enhanced protective operations for the former president and other protectees.\"\n\nThe panel members were Mark Filip, deputy attorney general under President George W. Bush; David Mitchell, who served in numerous state and local law enforcement roles in Maryland and Delaware; Janet Napolitano, homeland security secretary under President Barack Obama; and Frances Fragos Townsend, Bush's assistant for homeland security and counterterrorism.\n\nAnders Hagstrom is a reporter with Fox News Digital covering national politics and major breaking news events. Send tips to Anders.Hagstrom@Fox.com, or on Twitter: @Hagstrom_Anders.\n\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}