{
    "question": "What are the practical and political implications of FEMA warning it cannot make it through hurricane season when the Disaster Relief Fund is low, given that migrant shelter aid comes from a separate account and Congress must approve additional disaster funding?",
    "content": {
        "source_1": "As the U.S. Southeast recovered from Hurricane Helene's destruction in early October 2024, rumors spread on the internet that Homeland Security Secretary Alejandro Mayorkas said the Federal Emergency Management Agency was running out of money for its relief programs even before hurricane season was over.\n\nSome internet users furtherclaimedthat victims of Hurricane Helene would receive only $750 because, according to them, FEMA had already spent more than $1 billion on shelter and services for undocumented immigrants (archived):\n\nMayorkas complains \"FEMA does not have the funds to make it through the season.\" [Vice President] Kamala [Harris] announces victims of Hurricane Helene will get only $750. Meanwhile, FEMA spent over $1 BILLION in taxpayer dollars on providing housing and services to illegal aliens.\n\nThis X post had received more than 318,000 views and 4,300 likes as of this writing. \"How is this not an impeachable offense?\" oneX user asked in response.\n\nOther postsclaimedthat the $750 was in fact just a loan, which recipients had one year to repay lest FEMA seize their property (archived):\n\nOn Oct. 7, 2024, former U.S. President Donald Trumpsharedthese rumors on his Truth Social account. He added that \"billions of dollars were going to foreign countries\" while the government abandoned North Carolina (archived):\n\nWhile it's trueMayorkas warned that FEMAwas running out of funds for disaster relief, the realities of how the agency is funded and how it deploys its funding are much more complicated than online rumor-mongers claim. FEMA, like other U.S. government agencies, obtains its funding through an appropriations process in the U.S. Congress, which means it cannot simply reallocate funds authorized for one program to another.\n\nOn Oct. 2, Mayorkas told reporters FEMA's purse was close to empty and expressed concern for the agency's ability to help victims of any more natural disasters, especially as hurricane season hadn't ended. \"We are meeting the immediate needs with the money that we have. We are expecting another hurricane hitting,\"he said. \"FEMA does not have the funds to make it through the season.\"\n\nFor the full year 2024, the U.S. Congress appropriated $20.26 billion for the Disaster Relief Fund, according to HR 2882, also know as theFurther Consolidated Appropriations Act of 2024. The DRF is the fund from which FEMA draws disaster assistance in case of destructive events such as Hurricane Helene (emphasis ours):\n\nFor necessary expenses in carrying out the Robert T. Stafford Disaster Relief and Emergency Assistance Act (42 U.S.C. 5121 et seq.),$20,261,000,000, to remain available until expended: Provided, That such amount shall be for major disastersdeclared pursuant to the Robert T. Stafford Disaster Relief and Emergency Assistance Act (42 U.S.C. 5121 et seq.) and is designated by the Congress as being for disaster relief pursuant to section 251(b)(2)(D) of the Balanced Budget and Emergency Deficit Control Act of 1985.\n\nHowever the country faced20 so-called \"billion-dollar disasters\"as of early October 2024, including Hurricane Helene. In comparison, the average from 2014 to 2023 was about17 such events per year(up from12 a year between 2010 and 2019). Because of this increase in major disasters, the funding provided for FEMA's DRF was insufficient, and the program required additional funding. This is what Mayorkas was referring to in his statement.\n\nDue to this state of affairs, FEMA implemented so-calledImmediate Needs Fundingguidance, whereby the agency covers, in particular, \"lifesaving and life-sustaining activities,\" but holds off on any other new obligations. Still, this was not enough, and the both the Department of Homeland Security andU.S. President Joe Biden said they would request supplemental fundsto cover the rest of the hurricane season. This was especially significant asFlorida braced for Hurricane Milton.\n\nOn Sept. 25, 2024, however, Congress passed astopgap billto extend funding for the rest of the year. The bill apportioned $20 billion to DHS, and added that the agency could use the money for disaster relief:\n\nSec. 134. Amounts made available by section 101 to the Department of Homeland Security under the heading \"Federal Emergency Management Agency—Disaster Relief Fund\" may be apportioned up to the rate for operations necessary to carry out response and recovery activities under the Robert T. Stafford Disaster Relief and Emergency Assistance Act (42 U.S.C. 5121 et seq.).\n\nRegardless of legislative developments, FEMA clarified that it did have sufficient funding to cover the cost of Hurricane Helene. It elaborated on the topic on apage the agency set up to dispel unfounded rumors:\n\nFEMA has enough money right now for immediate response and recovery needs. If you were affected by Helene, do not hesitate to apply for disaster assistance as there is a variety of help available for different needs.\n\nFurther, the claim that Hurricane Helene victims would receive \"only $750\" is false. In an Oct. 3 speech, U.S. Vice President Kamala Harris said the following: \"And the federal relief and assistance that we have been providing has included FEMA providing $750 for folks who need immediate needs being met, such as food, baby formula and the like. And you can apply now,\"\n\nHarris was referring to a specific type of assistance (Serious Needs Assistance) FEMA offers to help victims pay for urgent supplies such as groceries and medications in the immediate aftermath of a disaster. However, that $750 was by no means the only assistance the agency could provide victims of Hurricane Helene. The agency's rumor-busting page read:\n\nOne type of assistance that is often approved quickly after you apply is Serious Needs Assistance, which is $750 to help pay for essential items like food, water, baby formula, breastfeeding supplies, medication and other emergency supplies. There are other forms of assistance that you may qualify to receive once you apply for disaster assistance. As your application continues to be reviewed, you may still receive additional forms of assistance for other needs such as support for temporary housing and home repair costs.\n\nThe claim that FEMA assistance is only a loan is also false. On a differentmyth-debunking pageon its website, FEMA clarified that FEMA disaster assistance need not be repaid. FEMA grants are designed for immediate relief. For longer-term recovery, FEMA may refer those affected by disasters tolow-interest loans from the U.S. Small Business Administration. Though it is a different agency, the SBA lends the money through FEMA. Nor is the money reserved solely for small-business owners, as the loans can also support home repairs, personal property replacement, vehicles and other necessities for individuals and small businesses after a disaster.\n\nSeparately, Congress has appropriated a total of$640.9 million for shelter and other services to noncitizen migrant arrivalsin 2024, down from$780 million in 2023. FEMA distributes this support to nonfederal organizations in localities that welcome migrants across the country. It does this through itsShelter and Food program for people at risk of homelessness, outside of disaster situations. Over two years, support for migrants totaled $1.42 billion, about 7% of the total appropriated for the DRF in 2024 alone.\n\nThe appropriations process in the U.S. Congress is a legislative one. Funding resolutions must first go through subcommittees. FEMA is the purview of theEconomic Development, Public Buildings and Emergency Management subcommittee, part of the House Committee on Transportation and Infrastructure. In October 2024, the subcommittee's chair was Republican Rep. Scott Perry of Pennsylvania.\n\nAccording to theCongressional Research Service, the appropriations process starts with the White House, which each year submits an annual budget to Congress, while each agency and department share \"detailed budget justifications\" to each committee. Subcommittees then hold hearings, draft bills, send them to the full committee. At any point of the process, members can propose amendments. Then the House votes on the bills and sent them to the Senate. Like any other bill, the Senate can decide to \"filibuster\" the bills — that is, to start debates on them unless and until 60 senators vote to pass them.\n\nOnce Congress appropriates the funds, agencies and departments may not spend less than what they receive, nor can they spend more than they receive, aside from few exceptions. They also cannot spend the funds for any other purpose than the one for which they received them. In other words, given that Congress appropriated $1.42 billion for services and shelter to noncitizen migrants, FEMA did not have the authorization to reallocate that amount to disaster relief, or vice versa.\n\n2010-2019: A Landmark Decade of U.S. Billion-Dollar Weather and Climate Disasters | NOAA Climate.Gov. 8 Jan. 2020, http://www.climate.gov/news-features/blogs/beyond-data/2010-2019-landmark-decade-us-billion-dollar-weather-and-climate.\n\n2023: A Historic Year of U.S. Billion-Dollar Weather and Climate Disasters | NOAA Climate.Gov. 8 Jan. 2024, http://www.climate.gov/news-features/blogs/beyond-data/2023-historic-year-us-billion-dollar-weather-and-climate-disasters.\n\nCiscomani, Juan. Further Consolidated Appropriations Act, 2024. HR 2882, 15 Nov. 2023, https://www.congress.gov/bill/118th-congress/house-bill/2882/text.\n\nCole, Tom. Continuing Appropriations and Extensions Act, 2025. HR 9747, 26 Sept. 2024, https://www.congress.gov/bill/118th-congress/house-bill/9747/text.\n\nDepartment of Homeland Security Announces $380 Million in Additional Funding to Communities Receiving Migrants | Homeland Security. https://www.dhs.gov/news/2024/08/28/department-homeland-security-announces-380-million-additional-funding-communities. Accessed 4 Oct. 2024.\n\nEconomic Development, Public Buildings and Emergency Management | Transportation and Infrastructure Committee. https://transportation.house.gov/subcommittees/subcommittee/?ID=107419. Accessed 4 Oct. 2024.\n\nEmergency Food and Shelter Program | FEMA.Gov. 26 June 2023, https://www.fema.gov/grants/emergency-food-and-shelter-program.\n\nFiscal Year 2024 Awards | FEMA.Gov. 3 Sept. 2024, https://www.fema.gov/grants/preparedness/shelter-services-program/fy24-awards.\n\nHolder, Dave. 'Billion Dollar Disasters: 19 So Far in 2024'. WeatherNation, 11 Aug. 2024, https://www.weathernationtv.com/news/billion-dollar-disasters-19-so-far-in-2024.\n\nHurricane Helene: Rumor Response | FEMA.Gov. 4 Oct. 2024, https://www.fema.gov/disaster/current/hurricane-helene/rumor-response.\n\nImmediate Needs Funding FAQ. FEMA, Aug. 2024, https://www.fema.gov/sites/default/files/documents/fema_ocfo-inf-faq.pdf.\n\nLerman, David. 'Biden Floats Recess Action on Helene Supplemental'. Roll Call, 30 Sept. 2024, https://rollcall.com/2024/09/30/biden-floats-recess-action-on-helene-supplemental/.\n\n'Mayorkas Warns FEMA Doesn't Have Enough Funding to Last through Hurricane Season'. AP News, 2 Oct. 2024, https://apnews.com/article/hurricane-helene-congress-fema-funding-5be4f18e00ce2b509d6830410cf2c1cb.\n\nSaturno, James, and Megan Lynch. The Appropriations Process: A Brief Overview. Congressional Research Service, 17 May 2023, https://crsreports.congress.gov/product/pdf/R/R47106.\n\nSubcommittees | Transportation and Infrastructure Committee. https://transportation.house.gov/subcommittees/subcommittee/. Accessed 4 Oct. 2024.\n\nAnna Rascouët-Paz is based in Brooklyn, fluent in numerous languages and specializes in science and economic topics.",
        "source_2": "Billal Rahman is an immigration reporter based in London, U.K. He specializes in immigration policy and border security. He has uncovered allegations of misconduct among border agents under investigation and exposed claims of abuse at ICE-run detention centers in the U.S. He joined Newsweek in 2024 from The Independent. He has covered the British Post Office scandal and the conflict between Israel and Hamas. Originally from Glasgow, he studied Journalism in Edinburgh and then worked for STV News before moving to London in 2022. You can contact Billal at b.rahman@newsweek.com.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nFormer PresidentDonald Trump's campaign doubled down Friday on claims that the Federal Emergency Management Agency (FEMA) hadrun out of money to helpthose hit byHurricane Helenebecause ofthe Biden administration's spending on services for migrants.\n\nThe concerns about FEMA's cash flow came after Homeland Security SecretaryAlejandro Mayorkassaid on Wednesday that the agency would struggle for funding for the rest of the hurricane season.\n\nRepublicans, including Texas GovernorGreg Abbott, then claimed that over $640 million had been spent by FEMA on migrants when it could have been used to plug the funding gap.\n\nStephen Miller, a Trump surrogate and the mastermind behind his immigration policy, said onFox Newsthat FEMA spending money on migrants is \"the gravest betrayal this country has ever seen.\"FoxNews contributor Tammy Bruce also reiterated the claims in a social media post.\n\nFurther claims were made that FEMA was actively taking supplies and donations from volunteers and other organizations trying to help.\n\nTheDepartment of Homeland Securityand FEMA havedenied the claims.\n\nThe idea thatFEMA funding had run lowbecause of spending on immigrants began on X, with the Trump campaign making the same claim toNewsweekFriday.\n\n\"FEMA has run out of money for the rest of hurricane season becauseKamala Harrisused the funds for free giveaways to illegal immigrants. This is inexcusable and yet another example of Kamala Harris putting Americans LAST!\" Karoline Leavitt, Trump Campaign National Press Secretary, said in an emailed statement.\n\nNewsweekhas contacted the Harris campaign for comment in response to the allegations made by the Trump campaign.\n\nThe $650 million cited byRepublicansrefers to the Shelter and Services Program (SSP), which had a budget of that amount for Fiscal Year 2024, which ended on September 30.\n\nSSP allocates funds to migrant support groups, nonprofits, and state and local governments to distribute to those in need of shelter, food or medical care.\n\nWhile thefunds are distributed by FEMA, they do not come from the agency's budget.\n\nTheDHS Appropriations Act 2024shows that the money is from the U.S. Customs and Border Protection (CBP) budget, which is then given to FEMA to hand out, \"helping to facilitate the safe, orderly, and humane release of asylum seekers and families\".\n\nCBP influences where the cash is spent, with a requirement to send operational data to FEMA on a quarterly basis. This data helps guide FEMA on where to allocate the funds, particularly to shelters that support CBP's border security mission.\n\nThe first wave of funding for 2024 came in April, with $259.13 million allocated. Another round was announced late August.\n\nPrevious recipients of those funds include counties such as Pima County in Arizona, which received $21.8 million, as well as smaller church ministry organizations with grants around $10,000.\n\nStates along the border and elsewhere have previously seen grants. In the last round, over 30 Texas organizations and local governments were given cash.\n\nMayorkas said there was enough money available for FEMA to meet the needs ofthe communities impacted by Hurricane Helene, as he suggested that another storm would lead to problems.\n\n\"We are meeting the immediate needs with the money that we have,\"Mayorkas told reporterson Air Force One. \"We are expecting another hurricane hitting. We do not have the funds. FEMA does not have the funds to make it through the season and what is imminent.\"\n\nA spokesperson for DHS later toldNewsweekthat the claims made by the GOP were \"completely false\".\n\nFEMA was forced to set up a page to address rumors surrounding its response to Hurricane Helene, which haskilled at least 200 peopleand devastated large swaths of rural Georgia and North Carolina.\n\nAddressing claims thatFEMA doesnot have enough moneyto help with the aftermath of the storm, the page reads: \"FEMA has enough money right now for immediate response and recovery needs. If you were affected by Helene, do not hesitate to apply for disaster assistance, as there is a variety of help available for different needs.\"\n\nFor the new financial year, which began Oct. 1, FEMA laid out a need for $33.1 billion.Congressthen approved a temporary stopgap of $20 billion as it sought to stop a government shutdown before going into recess.\n\nThat money does not meet the needs of the Disaster Relief Fund (DRF), which lawmakers reportedly removed additional funding for in an attempt to get the stopgap through.\n\nThe DRF mostly covers costs of previous emergencies, including flooding and wildfires. FEMA also has the option to ask for emergency funding from the White House to deal with the aftermath of disasters like the hurricane.\n\n\"As FEMA Administrator Deanne Criswell has said, she has the full authority to spend against the President's budget, but we're not out of hurricane season yet, so we need to keep a close eye on it,\" Jaclyn Rothenberg, a spokesperson for FEMA, toldNewsweekThursday afternoon. \"We may need to go back into immediate needs funding and we will be watching it closely.\"\n\nThe agency alsoset up another page, seeking to make it clear that it was not confiscating or taking commodities, supplies or resources in any of the states affected by the storm.\n\n\"FEMA is continuing to work with our federal family and state and local partners in the impacted areas to effectively bring in life-saving resources to the people and communities who need it most,\" Rothenberg said Friday afternoon.\n\nAddressingconcerns raised by X owner Elon Musk, who posted that his Starlink hardware was being blocked by FEMA, the agency said it had provided several terminals across North Carolina for crucial communication.\n\n\"These units are supporting state and local municipalities, Urban Search and Rescue and disaster coordination,\" Rothenberg added. \"Starlink units have been sent to multiple states in support of Hurricane Helene response efforts.\"\n\nThe Biden administration had already disbursed over $10 million in \"flexible and upfront\" assistance to the states affected, FEMA said in apress release.\n\nThe federal relief agency had shipped over 8.8 million meals, more than 7.4 million liters of water, 150 generators, and more than 225,000 tarps to the storm zone, it said.\n\nCrews were also helping to restore powerand set up satellite internet links for those without service.\n\nOver 1,600 interactions with people and animals, including rescues and evacuations, had also taken place with federal assistance.\n\nPresidentJoe Bidenalso said his administration would cover 100 percent of the costs for the first 180 days in Florida, Georgia, and North Carolina.\n\nDo you have a story Newsweek should be covering? Do you have any questions about this story? Contact LiveNews@newsweek.com\n\nUpdate 10/04/24: This article has been updated to amend Tammy Bruce's title and add additional information from Jaclyn Rothenberg.\n\nBillal Rahman is an immigration reporter based in London, U.K. He specializes in immigration policy and border security. He has uncovered allegations of misconduct among border agents under investigation and exposed claims of abuse at ICE-run detention centers in the U.S. He joined Newsweek in 2024 from The Independent. He has covered the British Post Office scandal and the conflict between Israel and Hamas. Originally from Glasgow, he studied Journalism in Edinburgh and then worked for STV News before moving to London in 2022. You can contact Billal at b.rahman@newsweek.com.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nBillal Rahman is an immigration reporter based in London, U.K. He specializes in immigration policy and border security. He has uncovered allegations of misconduct among border agents under investigation and exposed claims of abuse at ICE-run detention centers in the U.S. He joined Newsweek in 2024 from The Independent. He has covered the British Post Office scandal and the conflict between Israel and Hamas. Originally from Glasgow, he studied Journalism in Edinburgh and then worked for STV News before moving to London in 2022. You can contact Billal at b.rahman@newsweek.com.\n\nBillal Rahman is an immigration reporter based in London, U.K. He specializes in immigration policy and border security. He has                                    ...Read more",
        "source_3": "Americans were rightly angered by the announcement by Homeland Security Secretary Alejandro Mayorkas on Wednesday that the Federal Emergency Management Agency “[does] not have the funds” to make it through the hurricane season, particularly in light of the over $600 million it spent on “migrant services” this past fiscal year.\n\nIn fact, the Shelter and Services Program administered by FEMA in partnership with the U.S. Customs and Border Patrol has spent more than $1 billion on noncitizen migrant resettlement and other services over the past two years, according toFEMA’s website.\n\n/2 The Shelter and Services Program is designed to exclusively provide shelter and services to illegal aliens.\n\nOver $1 BILLION in taxpayer dollars have been allocated between FY2023 and FY2024.pic.twitter.com/2JksdA2U1D\n\n— America First Legal (@America1stLegal)September 30, 2024\n\nMayorkastoldreporters Wednesday, “We are meeting the immediate needs with the money that we have” in the aftermath of Hurricane Helene.\n\n“We are expecting another hurricane hitting,” he added. “We do not have the funds. FEMA does not have the funds to make it through the season and what — what is imminent.”\n\nTexas Gov. Greg Abbott said the solution is simple, “Mayorkas and FEMA — immediately stop spending money on illegal immigration resettlement and redirect those funds to areas hit by the hurricane. Put Americans first.”\n\nMayorkas and FEMA — immediately stop spending money on illegal immigration resettlement and redirect those funds to areas hit by the hurricane.\n\nDonald Trump Jr., son of the former president, responded on X, “So FEMA is almost out of money to help with Federal Emergencies (you know the FE in FEMA) because they spent almost $1,000,000,000 helping illegal immigrants over the last two years. Got it, but probably tough to explain to those not getting the help they need in GA and NC!”\n\nSo FEMA is almost out of money to help with Federal Emergencies (you know the FE in FEMA) because they spent almost $1,000,000,000 helping illegal immigrants over the last two years.\n\nGot it, but probably tough to explain to those not getting the help they need in GA and NC!https://t.co/4n3DqWGiVM\n\n— Donald Trump Jr. (@DonaldJTrumpJr)October 3, 2024\n\nNewsweekdid note that the, at least, $640 million spent on migrant care makes up a fairly small part of FEMA’s overall annual budget of approximately$30 billion.\n\nHowever, Florida GOP congressman and U.S. Army combat veteran Cory Mills argued the federal government’s response to the hurricane thus far has also been hampered by a lack of personnel on the ground.\n\n“That’s really one of the missing pieces, which is the federal piece. Let’s go ahead and point out the obvious, which is that FEMA had utilized a large majority of the personnel who should be here taking care of this to be sent and [instead] repurposed, if you will, for immigration resettlement, when we need to be focused on Americans,” hetoldFox News on Wednesday.\n\nMayorkasargued Thursday that the federal government’s hurricane response has been strong.\n\nA White House reporter noted, “The sentiment, according to my colleagues on the ground, from people is that the federal government is not doing enough to help. Where are they? Where is the help? What is your message to those people?”\n\n“I would say the following, that we are there, and we will continue to be there, and we will reach the most difficult-to-access locations. We are relentless in our efforts to ensure the safety and the security of all,” Mayorkas said.\n\nWorthless DHS Mayorkas, says “We are expecting another hurricane hitting. We do not have the funds. FEMA does not have the funds to make it through the season and what — what is imminent.”\n\nFEMA spent $941M on resettling criminal illegal aliens, over desperate Americans in dire…pic.twitter.com/jBb7JLbSGO\n\nThat FEMA funds and personnel have been diverted to deal with a Biden-Harris created border crisis is unacceptable and reason enough to replace the current administration next month.\n\nWe are committed to truth and accuracy in all of our journalism.Read our editorial standards.\n\nAdvertise with The Western Journal and reach millions of highly engaged readers, while supporting our work.Advertise Today.\n\nEmail has been sent towith a login link. Simply click this link to login. You will not need your password.\n\nIf you don't see the email immediately, please check your spam and mark it as not spam. If you entered an incorrect email,restart your login."
    }
}