{
    "question": "In what ways could releasing half of the California National Guard from Los Angeles, based on a cited decrease in lawlessness, influence public safety, community trust, and future deployment decisions?",
    "content": {
        "source_1": "FILE - California National Guard are positioned at the Federal Building, June 10, 2025, in downtown Los Angeles.Eric Thayer/APhide caption\n\nLOS ANGELES — The Pentagon said Tuesday it is ending the deployment of 2,000 National Guard troops in Los Angeles, accounting for nearly half of the soldiers sent to the city to deal with protests over the Trump administration's immigration crackdown.\n\nRoughly 4,000 National Guard soldiers and 700 Marines have been in the city since early June. It wasn't immediately clear what prompted the 60-day deployment to end suddenly, nor was it immediately clear how long the rest of the troops would stay in the region.\n\nIn late June, the top military commander in charge of troops deployed to LA had asked Defense Secretary Pete Hegseth for 200 of them to be returned to wildfire fighting duty amid warnings from California Gov. Gavin Newsom that the Guard was understaffed as California entered peak wildfire season.\n\nThe end of the deployment comes a week after federal authorities and National Guard troops arrived at MacArthur Park with guns and horses in an operation that ended abruptly. Although the U.S. Department of Homeland Security wouldn't explain the purpose of the operation or whether anyone had been arrested, local officials said it seemed designed to sow fear.\n\n\"Thanks to our troops who stepped up to answer the call, the lawlessness in Los Angeles is subsiding,\" Chief Pentagon spokesman Sean Parnell said in a statement in announcing the decision.\n\nOn June 8, thousands of protesters took to the streets in response to Trump's deployment of the Guard, blocking off a major freeway as law enforcement used tear gas, rubber bullets and flash bangs to control the crowd. Photos captured several Waymo robotaxis set on fire.\n\nA day later, police officers used flash bangs and shot projectiles as they pushed protesters through Little Tokyo, where bystanders and restaurant workers rushed to get out of their way.\n\nFILE - A California National Guardsmen stands to protect federal buildings, June 10, 2025, in Los Angeles.Damian Dovarganes/APhide caption\n\nMayor Karen Bass set a curfew in place for about a week that she said had successfully protected businesses and helped restore order. Demonstrations in the city and the region in recent weeks have been largely small impromptu protests around arrests.\n\n\"This happened because the people of Los Angeles stood united and stood strong. We organized peaceful protests, we came together at rallies, we took the Trump administration to court — all of this led to today's retreat,\" she said in a statement, adding that \"We will not stop making our voices heard until this ends, not just here in LA, but throughout our country.\"\n\nBass said in a press conference that the National Guard's primary mission has been to guard two buildings that \"frankly didn't need to be guarded.\"\n\n\"I am hoping that this experiment with the lives of people ends here,\" she said.\n\nOn Tuesday afternoon, there was no visible military presence outside the federal complex downtown that had been the center of early protests and where National Guard troops first stood guard before the Marines were assigned to protect federal buildings. Hundreds of the soldiers have been accompanying agents on immigration operations.\n\nPresident Donald Trump ordered the deployment against the wishes of Newsom, who sued to stop it.\n\nNewsom argued that Trump violated the law when he deployed the California National Guard troops despite his opposition. He also argued that the National Guard troops were likely violating the Posse Comitatus Act, which prohibits troops from conducting civilian law enforcement on U.S. soil.\n\nNewsom won an early victory in the case after a federal judge ruled the Guard deployment was illegal and exceeded Trump's authority. But an appeals court tossed that order, and control of the troops remained with the federal government. The federal court is set to hear arguments next month on whether the troops are violating the Posse Comitatus Act.\n\nThe deployment of National Guard troops was for 60 days, though Defense Secretary Pete Hegseth had the discretion to shorten or extend it \"to flexibly respond to the evolving situation on the ground,\" the Trump administration's lawyers wrote in a June 23 filing in the legal case.\n\nFollowing the Pentagon's decision Tuesday, Newsom said in a statement that the National Guard's deployment to Los Angeles County has pulled troops away from their families and civilian work \"to serve as political pawns for the President.\"\n\nHe added that the remaining troops \"continue without a mission, without direction and without any hopes of returning to help their communities.\"\n\n\"We call on Trump and the Department of Defense to end this theater and send everyone home now,\" he said.",
        "source_2": "Gabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nCalifornia's Democratic GovernorGavin Newsomis speaking out after the Trump administration announced the partial withdrawal of National Guard troops from Los Angeles.\n\nChiefPentagonSpokesman Sean Parnell on Tuesday confirmed that approximately 2,000 of the 4,000 California National Guard troops deployed in the region would begin demobilizing.\n\nIn a pointed statement following Tuesday's announcement, Newsom criticized the move as politically motivated.\n\n\"The National Guard's deployment to Los Angeles has pulled troops away from their families and civilian lives to serve as political pawns for the President,\" Newsom said in a statement. \"While nearly 2,000 of them are starting to demobilize, the remaining guardsmembers continue without a mission, without direction and without any hopes of returning to help their communities. We call on Trump and the Department of Defense to end this theater and send everyone home now.\"\n\nNewsweekhas reached out to Newsom's office via email on Tuesday afternoon for comment.\n\nProtests broke out in Los Angeles in early Juneafter severalICEraids throughout the city.\n\nThe National Guard deployment, which also included 700 active-duty Marines, was initiated in early June and originally scheduled to last 60 days. The troops were assigned to safeguard federal buildings and support immigration agents during the wave of protests.\n\nNewsom had strongly opposed the federal move from the outset, filing a lawsuit to block the deployment. Although a district court initially ruled that PresidentDonald Trump's actions were unlawful due to Newsom's opposition, a federal appeals court later allowed the administration to maintain control of the troops while the legal battle continues.\n\nThe political standoff over the Guard deployments also highlighted national tensions between federal immigration enforcement and state emergency management priorities during California's peak fire season.\n\nNewsom and state officials have repeatedly insistedthat the deployment leaves wildfire response teams critically shorthanded, with California National Guard fire crews reportedlyoperating at just 40 percent capacity.\n\nEarlier this month, the U.S. Northern Command announced a move to release approximately 150 firefighters from the \"Federal Protection\" pursuit in Los Angeles.\n\nReacting to that decision, Newsom took a swipe at Trump, saying, \".@realDonaldTrumpcaved. Our firefighters are finally returning to fight wildfires. Better late than never. Now — send the rest home. Nearly 5,000 soldiers — including police, paramedics, and first responders — are still sitting idle in L.A. for nothing.\"\n\nParnell said in a statement in announcing the decision,\"Thanks to our troops who stepped up to answer the call, the lawlessness in Los Angeles is subsiding.\"\n\nNewsom, in a releaseforwarded by his office toNewsweek,earlier this month:\"These men and women signed up to serve — not to be Trump's political props. Letting a few of them return to fight fires is a step in the right direction, but thousands of soldiers are still being blocked from their real work as police officers, paramedics, summer school teachers, and public servants. It's time to send them all home.\"\n\nLos Angeles Mayor Karen Bass, a Democrat, on X Tuesday night:\"Nearly half troops are, at last, retreating from LA. The Trump Administration's cruel raids on our community have been a blow to the economy of Los Angeles -- the second largest American city, the largest city in world's 4th largest economy. This has to end. Stop the raids.\"\n\nIt remains unclear how long the remaining personnel will stay in the region.\n\nUpdate 7/15/25, 11:34 p.m. ET: This article has been updated with comment from Bass.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he                                    ...Read more",
        "source_3": "California National Guard members guard the entrance to a federal building in downtown Los Angeles on June 10, 2025.\n\n(The Center Square) —The Trump administration released half of the California National Guard members recently called to Los Angeles, citing “subsiding” lawlessness.\n\nLos Angeles Mayor Karen Bass called the release a “retreat,” citing the impact of protests in the city and the city’s lawsuits against the Trump administration.\n\nAfter days of unmitigated rioting in Los Angeles against increased federal immigration raids, President Donald Trump federalized anddeployed4,000 National Guard members and 700 U.S. Marines to primarily guard federal property in the city.\n\nWhile a federal district court initially ruled against the Trump administration’s deployment and ordered the National Guard members transferred back to Gov. Gavin Newsom’s command, the U.S. Court of Appeals for the 9th Circuitultimatelysided with the Trump administration.\n\n“Thanks to our troops who stepped up to answer the call, the lawlessness in Los Angeles is subsiding,\" U.S. Pentagon spokesman Sean Parnell said Tuesday. “As such, the Secretary has ordered the release of 2,000 California National Guardsmen from the federal protection mission.\"\n\nBass pointed to the release as the product of the city’s more peaceful protests in recent weeks and its legal challenges against the Trump administration.\n\n“This happened because the people of Los Angeles stood united and stood strong,” said Bass. “We organized peaceful protests, we came together at rallies, we took the Trump administration to court — all of this led to today’s retreat.”\n\n“My message today to Angelenos is clear — I will never stop fighting for this city,” continued Bass. “We will not stop making our voices heard until this ends, not just here in LA, but throughout our country.”\n\nIn one case, U.S. District Judge Maame Ewusi-Mensah Frimpong issued a ruling last Friday placing some limits on federal immigration operations, including requiring “reasonable suspicion that the person to be stopped is within the United States in violation of U.S. immigration law.” The Trump administration filed an appeal with the 9th Circuit court."
    }
}