{
    "question": "How might Israel’s strikes on Damascus and its demand that the Syrian government withdraw forces from fighting near Druze communities in southern Syria shape the immediate humanitarian situation and the risk of wider escalation?",
    "content": {
        "source_1": "Syria announced a cease-fire after deadly sectarian clashes in Sweida, near the Israeli border, and Israeli airstrikes on Damascus, the capital.\n\nSyriaannounced a cease-fire deal on Saturdayafter nearly a week of sectarian fighting that drew in Syrian government forces and the Israeli military.\n\nOn Monday, Syria said it had evacuated hundreds of Bedouin tribal families from the province of Sweida, in southern Syria, and deployed its security forces across the territory.\n\nMilitias formed by members of the Druse religious minority and Bedouin tribes in Syria have been clashing in Sweida, a strategically important province on the border with Jordan and near Israel. Syrian government forces have also been involved in the conflict.\n\nIsrael, which has close relations with its own Druse minority and has pledged to protect the group in Syria, conducted airstrikes against government targets in the capital, Damascus, on Wednesday. It threatened to escalate the attacks unless government troops withdrew from Sweida.\n\nMore than 1,100 people have been killed in the fighting, according to the Syrian Observatory for Human Rights, a Britain-based war monitoring group, which noted that sporadic clashes were continuing.\n\nSyria’s new president, Ahmed al-Shara, has promised to protect the country’s diverse religious and ethnic minorities after he led a rebel movement thatoverthrew the longtime dictator Bashar al-Assadin December. But those promises have been repeatedly tested by waves of sectarian unrest.\n\nThe latest fighting started on July 13, when members of an armed Bedouin tribe attacked and robbed a Druse man along Sweida’s main highway,according to the Syrian Observatory for Human Rights.\n\nThat incident prompted an exchange of attacks and kidnappings between the Druse militias that control Sweida province and armed Bedouin groups there, some of which are seen as pro-government.\n\nAs the unrest escalated, the Syrian government deployed military forces to quell the conflict, Syrian officials said. Many in the Druse militia groups thought that the government forces were coming to aid the Bedouins and to attack the Druse, according to Druse militia leaders.\n\nIn response, Druse militias mobilized to repel the government forces and battled with them, Druse militia leaders said.\n\nIsrael entered the fighting, targeting Syrian government forces, tanks, military equipment and roads leading to Sweida.\n\nThe Syrian government said on July 19 that the cease-fire deal would allow it to redeploy its forces to Sweida. That suggested that an understanding may have been reached to allow those forces to operate without fear of more Israeli airstrikes.\n\nThe U.S. special envoy to Syria, Thomas J. Barrack Jr., called the truce a “breakthrough.” He called on armed groups in Syria, including Bedouins and Druse, to lay down their weapons.\n\nFighting has continued sporadically in some areas. The Syrian Observatory for Human Rights, a Britain-based war monitor, said the cease-fire was violated the same day it was announced by armed groups from outside Sweida attacking the Druse-majority city.\n\nThe Druse, a religious minority,make up about 3 percent of Syria’s population. During the country’s long civil war, the Druse formed several militias to defend themselves against the Assad government, as well as against some Islamist rebel groups.\n\nThere are about one million Druse worldwide, with more than half living in Syria. Most of the rest are spread across Lebanon and Israel, as well as the Golan Heights, which Israel captured from Syria in the 1960s.\n\nIn Syria, after a rebel coalition toppled the Assad family’s rule, the country’s new leadership began negotiating with Druse leaders, seeking to absorb their militias into the new government’s national army to secure its authority over the entire country.\n\nBut Druse militia leaders have remained skeptical of Syria’s new president,Ahmed al-Shara, and his pledge to protect the rights of the country’s diverse religious and ethnic minorities. Mr. al-Shara and many in his cohort were part of an Islamist rebel group, dominated by members of Syria’s Sunni Muslim majority and once linked to Al Qaeda.\n\nClosed to outsiders and often misunderstood, the Druse faith emerged in the 11th century as an offshoot of Ismailism, a branch of Shiite Islam.\n\nThough Druse share historical roots with Islam, they do not identify as Muslim. Their monotheistic religion blends elements of Greek philosophy, Hinduism and Neoplatonism, with sacred texts accessible only to a select few. That mysticism has long drawn both fascination and suspicion, leading some Islamic clerics to label the Druse as heretics.\n\nThe Druse traditionally pledge loyalty to the state they reside in — a principle rooted in their religious doctrine, which prioritizes pragmatism and self-preservation. In Israel and the Israeli-controlled Golan Heights, where the Druse number around 145,000 in total, Druse men are conscripted into the Israeli military, and many serve in high-ranking positions.\n\nIsrael has two main reasons for intervening in southern Syria.\n\nFirst, Israeli leaders have sought to prevent Iran-backed militias or hostile Islamist militants from entrenching themselves in southern Syria near the Israeli border. In recent months, Israel has effectively established a security zone in Sweida, declaring it a demilitarized area off-limits to Syrian forces and enforcing that with a bombing campaign.\n\nSecond, Israel has pledged to protect the Druse in Syria to assuage the concerns of Israel’s own Druse minority.\n\nBy taking actions to protect the Druse, Israel hopes to strengthen a potential ally against hostile groups near the Israeli border, particularly the part of the Golan Heights inside Syria, according to experts on Israeli-Syrian relations.\n\nMany Druse leaders in Syria have said they do not want Israel to intervene on their behalf, opposing the notion of foreign intervention.\n\nOne notable exception is the Druse cleric Hikmat al-Hijri, who appealed last week for support from President Trump and Prime Minister Benjamin Netanyahu of Israel. Mr. Hijri is a vocal critic of the new leadership in Damascus.\n\nOne of the biggest challenges for Mr. al-Shara’s new government has been controlling waves of sectarian violence, which could easily spiral into a wider civil conflict again. The clashes this week were the third major surge of violence involving Syrian minorities since the Assad regime collapsed.\n\nIn early March, armed groups who had served in Mr. al-Assad’s security forces ambushed the new government’s forces on the Syrian coast, setting off days of sectarian violence that killed more than 1,600 people,mostly from the minority Alawite sect, according to the Syrian Observatory for Human Rights. In May, more than 39 people, mostly from the Druse minority, were killed over two days ina wave of violence near Damascus.\n\nSyrian officials have said that the latest round of fighting in Sweida underscores the need for the central government to control the province.\n\nPatrick Kingsley,Raja AbdulrahimandEuan Wardcontributed reporting.\n\nChristina Goldbaum is the Afghanistan and Pakistan bureau chief for The Times, leading the coverage of the region.",
        "source_2": "Reporting by Khalil Ashawi in Damascus, Maya Gebeily, Yamam al-Shaar and Laila Bassam in Beirut, Steven Scheer and Crispian Balmer, Charlotte Greenfield, Emily Rose in Jerusalem, Tala Ramadan, Ahmed Elimam, Elwely Elwelly in Dubai, Nayera Abdallah, Siyabonga Sishi in Majdal Shams, Jonathan Spicer in Istanbul, Daphne Psaledakis, Trevor Hunnicutt, Katharine Jackson in Washington, and Michelle Nichols in New York; Writing by Maya Gebeily, Tom Perry, Andy Sullivan and James Oliphant; Editing by Andrew Cawthorne, Ros Russell, David Gregorio, Daniel Wallis and Diane Craft\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab",
        "source_3": "Fox News Flash top headlines are here. Check out what's clicking on Foxnews.com.\n\nIsrael announcedon Wednesday that its forces struck near the entrance of the Syrian Defense Ministry’s headquarters in Damascus.\n\n\"The IDF continues to monitor developments and the regime's actions against Druze civilians in southern Syria. In accordance with directives from the political echelon, the IDF is striking in the area and remains prepared for various scenarios,\" the Israel Defense Forces (IDF) wrote on X.\n\nAn Israeli military official said on Wednesday that while the Syrian regime has claimed it is acting to restore order, what is happening on the ground tells a \"very different story.\" The official added that the more the regime intervenes \"the worse it gets.\"\n\nIsraeli Prime MinisterBenjamin Netanyahualso put out a statement saying that his country's forces were \"acting to save our Druze brothers and eliminate the regime's gangs\" and warning Druze in Israel not to go into Syria.\n\n\"I have one request of you: You are citizens of Israel. Do not cross the border,\" Netanyahu said on Wednesday. \"You are endangering your lives; you could be killed, you could be kidnapped, and you are harming the IDF’s efforts. Therefore, I ask you, return to your homes, let the IDF do its work.\"\n\nIsrael is acting in defense of the Druze minority in southern Syria, which has been involved in violent clashes recently.(Reuters)\n\nWHY SYRIA PLAYS A KEY ROLE IN TRUMP’S PLANS FOR MIDDLE EAST PEACE\n\nThe southernSyrian city of Sweidahas become a flashpoint in recent days as the country’s leaders clash with armed Druze groups. Syria’s Defense Ministry claimed its forces acted after militias in Sweida violated a ceasefire agreement reached on Tuesday.\n\nSyria’s Defense Ministry reportedly said in a statement that its forces were continuing to fire in Sweida \"while adhering to rules of engagement,\" including preventing harm, according to theAssociated Press.\n\nIsrael has threatened to increase its involvement in Syria and vowed to protect the Druze religious minority, which began as a 10th-century offshoot of Ismailism, a branch of Shiite Islam, the Associated Press reported. Most of the world’s Druze population lives in Syria, with the rest predominantly in Israel and Lebanon.\n\n\"And I raise the question: What else needs to happen for the international community to make its voice heard? What else needs to happen? What are we still waiting for?,\" Israel's Minister of Foreign Affairs Gideon Sa'ar said on Wednesday. \"Our interests in Syria are known, limited and clear. First of all, to maintain the status quo in the southern Syrian region, which is also close to our border. And to prevent the development of threats against Israel in this area. The second thing - to prevent harm to the Druze community, with which we have a bold and strong relationship - with the Druze citizens here in Israel.\"\n\nSyrian security forces walk together along a street, after clashes between Syrian government troops and local Druze fighters resumed in the southern Druze city of Sweida early on Wednesday, collapsing a ceasefire announced just hours earlier that aimed to put an end to days of deadly sectarian bloodshed, in Sweida, Syria July 16, 2025.(REUTERS/Karam al-Masri)\n\nTRUMP’S PUSH FOR ISRAEL-SYRIA PEACE GETS MAJOR BACKING AS ACTIVIST BRINGS MESSAGE TO JERUSALEM\n\nThe Druze are a prominent minority in Israel, where members of the community hold key military positions. In 2015, Col. Ghassan Alian, who is Druze, became the first non-Jewish commander of the Golani Brigade. Additionally, unlike other minorities in Israel, Druze males are not exempt from conscripted military service.\n\n\"Israel is committed to preventing harm to the Druze in Syria due to the deep brotherhood alliance with our Druze citizens in Israel, and their familial and historical connection to the Druze in Syria – and we are acting to prevent the Syrian regime from harming them, and to ensure the demilitarization of the area adjacent to our border with Syria,\" a joint statement by Netanyahu and Israeli Defense Minister Israel Katz read.\n\nSecurity forces loyal to the interim Syrian government ride in the back of a vehicle moving along a road in Syria's western city of Latakia on March 9, 2025.(OMAR HAJ KADOUR/AFP via Getty Images)\n\nThe latest unrest in Syria began with kidnappings and attacks between the Sunni Bedouin tribes andDruze armed factionsin the southern part of the country, according to the Associated Press. Syrian regime forces operating to restore order have also clashed with the Druze and have reportedly been carrying out extrajudicial killings and looting and burning civilian homes.\n\nIn March, Syria’s al Qaeda-linked regime killed members of the Alawite and Christian communities. Former Syrian President Bashar Assad, whose regime was toppled in December by Ahmed al-Sharaa and his group, Hayat Tahrir al-Sham — a U.S.-designated terror organization, is a member of the Alawite community.\n\nRachel Wolf is a breaking news writer for Fox News Digital and FOX Business.\n\nFox News' Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.\"\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}