{
    "question": "In what ways could the court’s decision on the states’ lawsuit over the Trump administration’s withholding of $6.8 billion in K-12 funding influence the affected programs and the balance of power between Congress and the executive branch over appropriated funds?",
    "content": {
        "source_1": "Providers say after-school programs and other services for the coming school year are threatened without the federal money, which was abruptly withheld.\n\nA coalition of 24 states and the District of Columbia sued the Trump administration on Monday over$6.8 billionin education funding that the administration has withheld a few weeks before the start of the school year.\n\nThe withheld money includes about 14 percent of all federal funding for elementary and secondary education across the country. It helps pay for free or low-cost after-school programs that give students a place to go while their parents work. It also covers training to improve the effectiveness of teachers and help for children learning English.\n\nAttorneys general from 22 states signed onto the lawsuit, along with the governors of Pennsylvania and Kentucky. All are Democrats.\n\nThe lawsuit accuses the Trump administration of holding back the money illegally. The U.S. Constitution gives Congress the power of the purse, and the Impoundment Control Act of 1974 says that a president cannot unilaterally refuse to spend money that Congress has appropriated.\n\nThe lawsuit asks a federal judge in Rhode Island to order the release of the money, which was supposed to be sent to states on July 1.\n\nThe Department of Education notified state education agencies on June 30 that it was holding the money back while it conducted a review. The Trump administration has sought to slash federal spending and align the budget with the president’s political priorities.\n\nWe are having trouble retrieving the article content.\n\nThank you for your patience while we verify access. If you are in Reader mode please exit andlog intoyour Times account, orsubscribefor all of The Times.\n\nThank you for your patience while we verify access.",
        "source_2": "Reporting by Nate Raymond in Boston and Daniel Wiessner in Albany, New York, Editing by Alexia Garamfalvi and David Gregorio\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nNate Raymond reports on the federal judiciary and litigation. He can be reached at nate.raymond@thomsonreuters.com.\n\nDan Wiessner (@danwiessner) reports on labor and employment and immigration law, including litigation and policy making. He can be reached at daniel.wiessner@thomsonreuters.com.",
        "source_3": "Democratic-led states filed alawsuiton Monday challenging theTrump administration’s decision to withhold about$6.8 billionin federal funding for K-12 schools in thereconciliation bill.\n\nGovernors and attorneys from 24 states and Washington, D.C., sued in federal court in Providence,Rhode Island, arguing that theDepartment of Educationand theOffice of Management and Budgetthrew K-12 schools nationwide into a panic by unconstitutionally freezing funds.\n\nIn the newly passedOne Big, Beautiful Bill Act, sixeducationalprograms previously approved by Congress had their federal funding cut. These programs are the education of migrant farm workers and their children, recruitment and training of teachers, English proficiency learning, academic enrichment, after-school and summer programs, and adult literacy and job-readiness skills.\n\nAccording to the lawsuit, the government was legally required to release the funding to states on July 1. However, the Education Department notified states a day before that it would not be issuing grant awards for the six programs by the deadline. The department cited changes in administration as its reason.\n\nThe federal government said it paused the funds to review where they are going, adding that the priorities do not align with the administration’s goals.\n\n“The federal government cannot use our children’s classrooms to advance its assault on immigrant and working families,” New York Attorney GeneralLetitia Jamessaid. “This illegal and unjustified funding freeze will be devastating for students and families nationwide, especially for those who rely on these programs for childcare or to learn English. Congress allocated these funds and the law requires they be delivered. We will not allow this administration to rewrite the rules to punish the communities it doesn’t like.”\n\nThere is no timeline yet for when or if the government will release the funds for the programs.\n\nAnOMB spokesman at the timecited an “ongoing programmatic review” of education funding, and said initial findings showed what he believes to be a misuse of grant funds to “subsidize a radical leftwing agenda.”\n\nPreviously, OMB raised objections to the use of the grant money to support immigrant students with scholarships, and for lessons that involvedLGBTthemes.\n\nThe lawsuit alleges that the effects of the pause have already been immediate. Summer programs have already been canceled or put at risk, and classes for teacher development or English learning have been halted or downgraded. The states say they had no time to make up the funding gap, due to a lack of warning about the funding freeze.\n\nIn the lawsuit, the states say that the administration violated the Constitution by disregarding Congress’s spending authority and ran afoul of federal administrative law by freezing funds with no explicit reason.\n\nStates continued by saying that the Trump administration has failed to abide by the procedures of the Impoundment Control Act, which bars the executive branch from withholding appropriated funds unless certain steps are followed.\n\nThis lawsuit echoes others that Democratic-led states have filed in response to theGOPmegabill’s freezing or terminating federal program funding.\n\nLAWLER PRESSES TRUMP TO UNFREEZE $6 BILLION IN AFTER-SCHOOL FUNDS\n\nThe states are seeking a preliminary injunction, and for the judge to compel the federal government to unfreeze the funding.\n\nThe states involved in the lawsuit are: Arizona, California, Colorado, Connecticut, Delaware, Hawaii, Illinois, Maine, Massachusetts, Michigan, Minnesota, Nevada, New Jersey, New Mexico, New York, North Carolina, Oregon, Rhode Island, Vermont, Washington, Kentucky, Pennsylvania, and Washington, D.C."
    }
}