{
    "question": "How might June’s 2.7% inflation reading, with increases in some indexes and declines in others, shape consumer and business decisions and the Federal Reserve’s approach to rate cuts in the months ahead?",
    "content": {
        "source_1": "US inflation heated back up in June, rising to its highest level in four months, as price increases —including those fromtariffs— packed a bigger punch.\n\nConsumer prices rose 0.3% last month, pushing the annual inflation rate higher to 2.7%, the highest since February, according to the latest Consumer Price Index data released Tuesday by the Bureau of Labor Statistics.\n\nTuesday’s data came right in line with economists’ forecasts for the headline CPI to rise from the0.1% monthly and 2.4% annual increases reported in May.\n\nThey expected higher gas prices would help lift the overall index (which was the case) and anticipated that a broader suite of goods would show the effect of businesses passing along higher import costs to consumers (which was also the case).\n\n“Tariffs are starting to bite,” Heather Long, chief economist at Navy Federal Credit Union, told CNN in an interview. “It wasn’t as bad as expected, but you can see it in the data.”\n\nExcluding gas and food, which tend to be quite volatile, core CPI came in below expectations by rising 0.2% from May and 2.9% for the 12 months ended in June. However, that’san acceleration from 0.1% and 2.8%, respectively, the month before.\n\nStocks were mixed Tuesday morning. The Dow was down 250 points, or 0.5%. Meanwhile, the S&P 500 was mostly flat and the tech-heavy Nasdaq rose 0.65%.\n\n“While it’s a relief to see Tuesday’s CPI in line with expectations, it still showed that inflation was hotter in June than it was in May,” Skyler Weinand, chief investment officer at Regan Capital, said in an email.\n\nIn recent months, President Donald Trump has enacteda sweeping trade policyof tacking steep tariffs on most goods that come into America.\n\nThe sheer breadth of the tariffs as well as the fits-and-starts approach to their implementation has roiled markets and caused heightened uncertainty among businesses and consumers as tohow much prices would move higher.\n\nHowever, inflation has remained relatively tame in recent months due to a variety of factors, including ongoing disinflation trends in housing and other key services, falling gas and travel prices (in part due toweakened demandfrom uncertainty), and businesses loading up on pre-tariff inventories.\n\nEconomists cautioned that the tariff-related price hikeswouldn’t come quickly nor in one fell swoopand would likely start to hit consumers more as the year went on.\n\n“It’s really been an inventory story,” Long said. “Businesses have done an excellent job of managing inventory, particularly the large retailers heading into April” when the bulk of the tariff hikes were put into place.\n\nThe larger retailers were carrying about three months’ worth of extra inventory, Long said.\n\n“And so, you do the math in your head and you’re thinking, ‘OK, this summer, right?’” she said. “They’re eventually going to run out of inventory or run down their inventory and have to bring in more items with the tariff costs.”\n\nOn a relatively scattered basis, some items with high exposure to tariffs (the United States imports about 80% of toys from China, for example) have become more expensive, both private sector and federal reports such as CPI have shown.\n\nIn May, for example, the CPI report showed very few widespread impacts from higher tariffs; however, prices were on the rise for a smattering of goods — such as toys, appliances, sporting goods and tools — typically imported or heavily reliant upon imported materials and components.\n\nMonthly economic data can be quite volatile, and economists frequently caution that it’s important to take a longer view. However, some of the pricing trends seen in May also showed up in June and, in some cases, in a bigger way.\n\nCommodities excluding food and gas:This index strips out the oft-volatile food and energy categories and is being closely scrutinized in the wake of higher tariffs. Prices rose 0.2% in June after being flat in May.\n\nApparel:Trump’s tariffs wereexpected to raise the cost of most clothing, but the hardest hit items were expected to be some of the most basic (cheap T-shirts, socks, sneakers and undies). Overall apparel prices nudged up just 0.4% in June after declining in May and April.\n\nAppliances:Prices here leapt 1.9% in June after rising 0.7% in April and 0.6% in May. It was the highest monthly jump in appliance prices since August 2020, when homebound Americans upped their purchases of home goods during the Covid pandemic. Last month, the Trump administration extended the 50% tariffs on steel and aluminum to “derivative products,”including consumer appliances such as dryers, washing machines, refrigerators, ovens and garbage disposals.\n\nComputers, peripherals and smart home assistants:Prices heated up in this category for the third-consecutive month, rising 1.4%, the highest monthly increase since January 2024. While Trump gave a reprieve for tech giants,exempting somesmartphones, computers and electronics from tariffs, those products and parts are still exposed to the higher base tariff on Chinese imports. (Notably, Trump also has promised to levy higher tariffs on semiconductors, the chips that power scores of everyday items.)\n\nSporting goods:The pace of price hikes accelerated here, with the index rising 1.4% in June, up from 0.3% in May. The June increase is the largest in 18 months.\n\nTools, hardware and supplies:During much of 2023 and 2024, prices fell for this category. In June, prices rose 0.7%, marking the fifth-straight month of increases.\n\nToys:For the second month in a row, prices rose by 1.4%, a back-to-back jump only seen during periods of abnormally high inflation (2022, 1980). And more price hikes could be coming down the pike,Hasbro CEO told CNN’s Audie Cornishthis week.\n\nVideo equipment:Prices surged a record 4.5% in June after rising 1% in May in this category that typically has seen more deflation than inflation since 1998, when the BLS started tracking it.\n\nWindows and floor coverings and other linens:After rising 0.3% from May to April, prices in this category surged 4.2% higher in June, a record-high increase (BLS started tracking this category in early 1999). The US textile industry has shrunk considerably in recent decades, resulting in a high reliance on imported linens.\n\nThe June CPI was expected to be a “turning point” where steep tariffs would make an even bigger mark within the inflation data.\n\nHowever, the extent to which tariffs could drive inflation higher and how long that may last, remains an open question.\n\n“We do have to bear in mind that goods are still only 25% of the core CPI, and so it takes a pretty meaningful increase in those goods prices to really lead to a spike in core inflation,” Sarah House, senior economist at Wells Fargo, told CNN earlier this week.\n\nThe price increases seen on the goods side have been kept in check by disinflation (slower price increases) or deflation (outright price declines) in other components of the CPI — dynamics both long in swing prior to tariffs andothers attributed to tariff-related fallout.\n\nRelated articleAmericans could pay more for these items from Mexico and the EU if Trump makes good on his latest tariff threats\n\n“I think you’re still seeing, in many ways, the long tail of the pandemic in the services numbers — things like auto insurance continuing to subside on trend as vehicle price inflation has cooled off” as well as housing-related price hikes, House said. “And in some ways, the recent inflation numbers have captured some of the downside effects on demand, for example, the drop in oil prices and the drop in travel services.”\n\nEconomists such a Navy Federal Credit Union’s Long cautioned that the tariff-related impacts remain early days.\n\n“This feels like inning No. 1, the early stages of what will likely be more and more items showing that price increase,” she said.\n\nShe noted how prices on coffee and oranges — categories already hit hard by climate-related impacts and also expected to feel added price pressure from tariffs — spiked in June. Trump’s latesttariff threats on Canada and Mexicocould reignite fears of higher food prices, she added.\n\n“You don’t buy a new washing machine every week, but you do buy fruits and vegetables,” she said.\n\nTrump on Tuesday cheered that consumer prices were low and White House officials downplayed the effect of tariffs on overall inflation. Trump urged for the Federal Reserve to cut interest rates “now!”\n\n“I think one thing that Wall Street, a lot of economists, (the) market in general, got wrong early on was that tariffs were going to cause a substantial price level rise, which just hasn’t happened,” US Treasury Secretary Scott Bessent said in an interview on Bloomberg prior to the CPI’s release Tuesday morning.\n\nHowever, while the June CPI data “screams” that Fed officials will likely take a “wait and see” approach on further rate cuts when they meet later this month, there is some growing pressure for easing later this year, said Long, the Navy Federal Credit Union economist Long said.\n\n“There is strain on the middle-class consumer right now and middle-class families: The housing market is frozen … the job market is frozen outside of a handful of sectors like healthcare,” she said. “And it would be really helpful to the overall economy to see the Federal Reserve take a little bit of pressure off in September. I know it’s a hard call looking at this data, but just from the middle-class perspective, some relief in September would be really helpful.”\n\nThe CPI report is the first of two major pieces of inflation data due out this week. On Wednesday morning, the BLS will release the Producer Price Index, which is expected to show acontinued pickup in wholesale-level inflation.\n\nCNN’s John Towfighi and Elisabeth Buchwald contributed to this report.",
        "source_2": "Shane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nPresidentDonald Trumpresponded to the acceleration of consumer price inflation with a renewal of his demand for the Federal Reserve to cut interest rates immediately.\n\nInflation rose to 2.7 percent year-on-year in June, the highest reading since February, according to the U.S. Bureau of Labor Statistics. May's annual inflation rate was 2.4 percent.\n\n\"Consumer Prices LOW. Bring down the Fed Rate, NOW!!!\" Trump posted to his Truth Social platform on Tuesday, July 15, after the data was released.\n\nThe acceleration in the CPI reading is bad news for Trump and his allies, who are pushing for a rate cut to stimulate the economy and slash borrowing costs.\n\nBut the Fed's Board of Governors has so far resisted cutting rates to see how Trump's tariffs affect prices, concerned that summer would see a spike in inflation.\n\nIts target range is currently 4.25 percent to 4.50 percent after it was last cut by 25 basis points in December 2024. The Fed has a dual mandate to maintain full employment and stable prices.\n\nTrump has pointed to relatively low inflation and good employment numbers as reasons to cut sooner, saying the Fed has been too late to act and is holding back the American economy from an economic boom.\n\nA slowdown in the rate of inflation would have strengthened Trump's case for cutting rates. But the number ticking up will bolster the Fed's concerns about the inflationary risks of a cut.\n\nThe headline CPI inflation reading for June was primarily driven higher by increases in shelter, energy, and food costs during the month.\n\n\"Indexes that increased over the month include household furnishings and operations, medical care, recreation, apparel, and personal care,\" the BLS said in its release.\n\n\"The indexes for used cars and trucks, new vehicles, and airline fares were among the major indexes that decreased in June.\"\n\n\"Overall as expected but the expectation was more inflation,\" Jason Furman, a Harvard economics professor and top economic adviser to former PresidentBarack Obama, posted on X (formerlyTwitter) about the latest CPI data. \"And I expect even more inflation.\"\n\n\"The timing of the tariff impact has been a bit slower than I might have thought but it is clearly coming through, firms burning off pre-tariff inventories, and more tariffs kicking in,\" Furman said.\n\nCore inflation, which excludes volatile food and energy costs, and is preferred by many economists, posted a slight increase, up 2.9 percent in June from a year earlier after May's reading of 2.8 percent.\n\n\"Every month since President Trump took office, core inflation—the best measure of inflation—has beat or matched expectations,\" White House Press Secretary Karoline Leavitt said.\n\n\"The data proves that President Trump is stabilizing inflation and the Panicans continue to be wrong about tariffs raising prices.\"\n\nTrump has sharply criticized Fed Chair Jerome Powell over interest rates, nicknaming him \"Too Late\" and questioning his competence and intelligence, even calling for him to resign.\n\nThe Fed's independence—its ability to set monetary policy without political influence—is a pillar of the modern American economy.\n\n\"Our Fed Rate is AT LEAST 3 Points too high,\" Trump said in a July 9 post on Truth Social.\n\n\"'Too Late' is costing the U.S. 360 Billion Dollars a Point, PER YEAR, in refinancing costs. No Inflation, COMPANIES POURING INTO AMERICA. 'The hottest Country in the World!' LOWER THE RATE!!!\"\n\nBut there are signs that prices are due to rise further in the coming months.\n\nSome companies have said they have or plan to raise prices as a result of the tariffs, includingWalmart, the world's largest retailer.\n\nAutomaker Mitsubishi announced in June that it would be increasing prices by an average of 2.1 percent in response to the duties, and Nike stated that it would implement \"surgical\" price hikes to offset tariff costs.\n\nBut many companies have been able to postpone or avoid price increases, after building up their stockpiles of goods this spring to get ahead of the duties.\n\nOther companies may have refrained from lifting prices while they wait to see whether the U.S. is able to reach trade deals with other countries that lower the duties.\n\nTrump has been sending letters to U.S. trading partners with whom he has been unable to negotiate a new trade deal during the monthslong pause in his reciprocal tariffs, informing them of the higher rates they will now face starting August 1.\n\nThis article includes reporting by The Associated Press.\n\nUpdate 7/15/25, 10:30 a.m. ET: This article was updated with comments by Trump and the White House.\n\nUpdate 7/15/25, 10:12 a.m. ET: This article was updated with additional information.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check                                    ...Read more",
        "source_3": "US inflation ticked up in June in a possible sign that President Trump’s tariffs are starting to sting.\n\nThe Consumer Price Index rose 2.7% in June from the year before, matching economists’ expectations but coming in above theprevious month’s 2.4% reading, the Bureau of Labor Statistics said Tuesday.\n\nCore CPI, which excludes volatile food and energy prices, gained 2.9% from a year earlier, above the previous month.\n\nOn a month-to-month basis, headline inflation rose 0.3%, in line with forecasts but above the previous month’s 0.1% jump.\n\n“While it’s a relief to see Tuesday’s CPI in-line with expectations, it still showed that inflation was hotter in June than it was in May,” Skyler Weinand, chief investment officer at Regan Capital, said in a note Tuesday.\n\n“We are now even further from the Fed’s 2% target, which means the Fed is in no position to cut interest rates until at least September.”\n\nTrump has put Chair Jerome Powell on blast for not slashing interest rates, and a growing number of officials havejoined in the call for a rate cutas soon as July.\n\nBut policymakers are still widely expected to stick to the target 4.25% to 4.5% range after their meeting later this month, according to CME FedWatch, which tracks Fed Funds futures prices.\n\nConsumer prices, prior to June’s reading, had mostly been trending downward since January, shrugging off fears that tariffs could reheat inflation and slow economic growth.\n\nThe indexes for used cars and trucks and new vehicles saw some of the most substantial declines in June, according to the Bureau of Labor Statistics.\n\nThat came as a surprise for economists, who were calling for upticks in the auto prices— one of the sectors that is hardest hit by tariffs.\n\nApparel prices, however, are also heavily influenced by tariffs, and jumped 0.4% in June.\n\nHousehold furnishings, another tariff-sensitive sector, rose 1%.\n\nShelter prices ticked up just 0.2%, but they were the main contributor to the month’s overall increase, according to the Bureau of Labor Statistics. The index rose 3.8% from the year before.\n\nFood prices rose 0.3% for the month with gains in both food at home and dining out. The sector rose 3% from a year earlier.\n\nEnergy prices, meanwhile, reversed a 1% decline from the month before, rising 0.9% in June. The sector is still down from the year before.\n\nMedical care services grew 0.6% and transportation services inched up 0.2%.\n\nAirline fares fell 0.1% in June. It was one of the main sectors to fall last month as persistent economic uncertainty around Trump’s trade war and geopolitical tensions fueled a dip in travel demand.\n\nAnalysts have cautioned that it will take time for tariffs to fully work their way through the economy – which could mean a longer “wait-and-see” approach from the Fed.\n\n“If it’s true that inflation is staying in check, then the Fed can go ahead and cut interest rates – potentially as early as September – but if subsequent reports show a different story, then the Fed is going to have to stay on hold even longer,” Chris Zaccarelli, chief investment officer at Northlight Asset Management, said in a note Tuesday."
    }
}