{
    "question": "What does the debate across the political spectrum over the themes in James Gunn’s new Superman suggest about the relationship between the filmmaker’s intent, audience interpretation, and the cultural role of superhero blockbusters?",
    "content": {
        "source_1": "When filmmakerJames Gunncalled his newSupermanfilman immigrant story, critics accused him of politicizing Superman. But you can’t politicize the truth. Superman has been an “illegal alien” for 87 years—a fact we helped America remember when we launched our2013 campaign, Superman Is an Immigrant.Of course, we couldn’t have predicted Donald Trump—the man DC Comicsliterally usedas their model to reboot Lex Luthor in 1986—waging war on the very immigrants Superman represents. In 2000, Luthor became president in the comics, complete with an anti-alien agenda. No one imagined the real President Trump would follow the same playbook.Superman entered America without papers, a baby refugee fleeing a dying planet. Like countless immigrants before him, he changed his name from the foreign-sounding (in his case, Hebrew)Kal-Elto the anglicized Clark Kent. He learned new customs, balanced his heritage with his adopted culture, and used his unique abilities to serve the nation that initially feared him.This isn’t subtext—it’s text. Superman’s creators, Jerry Siegel and Joe Shuster, were children of Jewish immigrants who understood displacement intimately. In 1938, as Hitler rose to power, they created a hero who embodied their American dream: someone who could protect the vulnerable because he knew what it meant to be cast aside. Superman’s very essence springs from being what he called “a universal outsider.” This outsider status isn’t incidental to his heroism; it’s the source of it. Those who have known rejection become champions of acceptance. Those who have felt powerless fight for the defenseless.Today, that outsider would be deported. In fact, without birthright citizenship, Superman would never have existed at all. Jerry Siegel and Joe Shuster, born in Cleveland to Jewish immigrant parents, would have been stripped of citizenship and deported to Nazi-controlled Europe—to face certain death in countries they’d never known.No Jerry and Joe means no Superman. No Superman means no superhero genre. The children of immigrants who followed their lead—creating Batman, Captain America, Spider-Man, and at least 90 percent of all iconic superheroes—would have met the same fate. The modern mythology that defines American popular culture worldwide: all erased.Superman endures because he represents something larger than politics: the American paradox itself. We are a nation built by the displaced—willing immigrants and unwilling slaves, refugees and dreamers, all orphaned from somewhere else. Superman, the ultimate orphan, transforms this shared wound into purpose, proving that our greatest strength comes not from where we’re born, but from what we choose to become.In 2013, our campaign sparked a national conversation through a simple selfie challenge: Americans sharing their family immigration stories while declaring “Superman Is an Immigrant.” Critics inadvertently amplified our message—every time they said the phrase to mock it, they reinforced the undeniable truth of it.As Gunn’s film opens and Trump’s deportation machine accelerates, that truth feels more urgent than ever. Superman returns to theaters just days after America’s final Fourth of July before its 250th birthday. The question isn’t whether we’ll continue celebrating our independence, but whether we’ll remember what made us super in the first place.At Monday’s premiere, Gunnsaid, “This is a movie about kindness, and I think that’s something everyone can relate to.” But media on the right, in fact, does not seem able to relate to this message of kindness. OnFox News, Jesse Watters joked under a “Superwoke” chyron that Superman’s cape reads “MS-13” and questioned whether he is “from Uganda.” The conservative outletOutkickargued that America doesn’t have “to be ‘kind’ just because a fictional character from another planet brought some good to a fictional Earth,” and that “America is desperate for apolitical entertainment.”\n\nAccusations of “politicizing” Superman come laughably late. Since 1938, Superman has defined “the American Way” through action. In 1940, while the isolationist America First movement preached neutrality, Superman took on Adolf Hitler. In 1949, he spoke directly to schoolchildren: “If you hear anybody talk against a schoolmate because of his religion, race, or national origin—don’t wait: tell him THAT KIND OF TALK IS UN-AMERICAN.” He promoted vaccines, helping fund the polio vaccine. He exposed the Ku Klux Klan’s secrets on national radio. When a gunman opens fire on immigrants, blaming them for stealing his job, Superman blocks every bullet. He stood between peaceful protesters and riot police after Ferguson. After the murder of George Floyd, he declared: “Dreams save us. Dreams lift us up and transform us. And on my soul, I swear… until my dream of a world where dignity, honor and justice becomes the reality we all share — I’ll never stop fighting. Ever.”\n\nSuperman is America’s conscience wearing a cape—and that terrifies critics because they’re supporting a real-life supervillain.\n\nOur greatest superpower as a nation has always been our ability to welcome the stranger and watch them soar. Like Superman himself, America draws its strength not from what it was born with, but from what it chooses to become—a place where the orphaned can find home, where the powerless can discover their power, where those who flee dying worlds can help build new ones.In choosing fear over hope, walls over welcome, we don’t just betray Superman’s legacy—we abort our own future. The real superheroes have always been immigrants. It’s time we started acting like we believe it.Andrew Slack is a narrative strategist who co-founded theHarry Potter Alliance, mobilizing over a million fans worldwide for social justice. He writes about how ancient and modern myths shape democracy and is working on a book exploring mythology’s role in American civic life.Jose Antonio Vargas is a Pulitzer Prize-winning journalist, Emmy-nominated filmmaker, and founder of the immigrant storytelling non-profitDefine American. An updated edition of his memoir,Dear America: Notes of an Undocumented Citizen, for 2025 is now available.\n\nSign up for THR news straight to your inbox every day",
        "source_2": "Whether “Superman,” DC’s new blockbuster that made a splash at the box office this weekend, serves as a metaphor for Middle East unrest has animated political figures on the right and left—from Ben Shapiro to Hasan Piker—despite the director denying any direct reference.\n\nLeft- and right-wing “Superman” viewers have debated whether the conflict between fictional nations Boravia and Jarhanpur, in which Superman stops the more powerful Boravia from invading the poorer and largely defenseless Jarhanpur, is a metaphor for Israel and Gaza.\n\nHasan Piker, a left-wing Twitch streamer and YouTuber some tout as the left’s answer to Joe Rogan,suggested Sunday nightthat Boravia could be an analogue for Israel, noting the fictional country is depicted as a military power and ally of the United States, while comparing its attempted takeover of Jarhanpur to Israel’s military campaign in Gaza.\n\nPiker objected toan earlier videoby conservative commentatorBen Shapiro, who said the conflict portrayed in the movie does not compare to Israel and Gaza because it “does not match up to the facts” and can only be seen that way by those with “left-wing brain.”\n\nShapiro said he does not think the movie has a political agenda, denying other theories the movie is pro-immigration, or offers commentary on Russia and Ukraine, saying these interpretations are caused by “politics on the brain.”\n\nConservative YouTuberTim Poolalso disagreed that the movie was a metaphor for the conflict in Gaza, pointing out the two countries are portrayed in the movie as a wealthier Eastern European nation and a poorer South Asian nation.\n\nWriter-director James Gunn has denied the movie is about the Israeli-Palestinian conflict, though he has admitted it has political undertones. “When I wrote this the Middle Eastern conflict wasn’t happening. So I tried to do little things to move it away from that, but it doesn’t have anything to do with the Middle East,” Gunn toldComicbook.com. Gunn said the movie depicts an “invasion by a much more powerful country run by a despot into a country that’s problematic in terms of its political history, but has totally no defense against the other country,” which he said “really is fictional.” Gunn admitted the movie is “about politics,” but said the movie is largely about morality and kindness. Gunn told previously sparked controversy after tellingThe Sunday TimesSuperman is an “immigrant that came from other places,” stating “Superman is the story of America.”\n\nFilm critic G. Allen Johnson wrote in theSan Francisco Chronicleit is “chilling how many scenes reflect current reality,” calling the Boravia-Jarhanpur conflict “very reminiscent of the Israel-Hamas conflict.” William Bibbiani, a critic forThe Wrap, said Gunn may have written a fictional conflict between made-up nations for the film, but “but we know he’s talking about” the war in Gaza.Mashablecritic Siddhant Adlakha said the movie has “unavoidable parallels” to Israel-Hamas.\n\n“Superman” has beenbranded as “woke”by some conservative critics over Gunn’s immigration comments. A Fox News chyron that aired last week called the movie “Superwoke,” as guest Kellyanne Conway said people “don’t go to the movie theater to be lectured to and to have somebody throw their ideology onto us.” Superman, however, has long been described by fans and critics as an immigrant. Central to his story is his birth on the dying planet Krypton and his arrival as an outsider to Kansas, and the creators of the comic, Jerry Siegel and Joe Shuster, are children of European Jewish immigrants. Frank Miller, a comic book artist who has written Superman comics, said in 2019 he aimed to “portray Superman as the ultimate immigrant” in his comic series, “Superman: Year One.”\n\n“Superman” had a bigopening weekend, grossing $122 million at the domestic box office and $217 million worldwide. The movie’s success is a win for DC Studios, which has not had a box office hit in years. The studio faced back-to-back flops with “Shazam! Fury of the Gods,” “The Flash” and “Blue Beetle,” as well as the critically panned “Aquaman and the Lost Kingdom,” which had a moderate box office performance. “Superman” received positive reviews, scoring an 83% onRotten Tomatoes, making it one of DC’s better-reviewed films in recent years. “Superman” continues a hot streak for thesummer box office, which has seen consecutive hits including “Jurassic World: Rebirth,” “F1” and “How To Train Your Dragon.”\n\nSuperman’s An Immigrant? Director James Gunn Faces Right-Wing Backlash For Claim(Forbes)\n\n‘Superman’ Makes Huge $22.5 Million Debut—Can It Revive The DC Film Franchise?(Forbes)",
        "source_3": "“Superman” director and DC Studios co-head James Gunn is facing backlash for calling the Man of Steel “an immigrant that came from other places” in a new interview.\n\nAhead of the release of Warner Bros.’superhero rebooton July 11, Gunn, 58,told The Sunday Times of Londonthat “‘Superman’ is the story of America… An immigrant that came from other places and populated the country.”\n\nThe “Guardians of the Galaxy,” the director added: “But for me it is mostly a story that says basic human kindness is a value and is something we have lost.”\n\nClark Kent is, of course, not human. Named Kal-El, he’s an alien from planet Krypton who lands on Earth as a baby and is adopted by a couple in Smallville, Kansas.\n\nIn the new movie, the iconic red cape is donned by 32-year-old actor David Corenswet.\n\nGunn said that some audience members who watch the action movie through a political lens could have a negative reaction to it. Driving home that point, the Sunday Times’ headline is: “Some people will take offense at my new ‘Superman.'”\n\n“Yes, it plays differently,” Gunn said. “But it’s about human kindness and obviously there will be jerks out there who are just not kind and will take it as offensive just because it is about kindness. But screw them.”\n\nSeveral media personalities bristled at Gunn’s remarks.\n\n“He’s creating a moat of woke, enlightened opinion around him. He’s got a woke shield,” said Fox News’ Greg Gutfeld, with a graphic on the screen that read “Superwoke.”\n\nKellyanne Conway said, “We don’t go to the movie theater to be lectured to and to have somebody throw their ideology onto us.”\n\nThe cast stood by Gunn’s interview onMonday’s red carpet in Los Angeles.\n\n“My reaction to [the backlash] is that it is exactly what the movie is about,” Sean Gunn, James Gunn’s brother who plays Maxwell Lord,told Variety.\n\n“We support our people, you know? We love our immigrants. Yes, Superman is an immigrant, and yes, the people that we support in this country are immigrants and if you don’t like that, you’re not American. People who say no to immigrants are against the American way,” he added.\n\nNathan Fillion, who plays the Green Lantern, put it more succinctly.\n\n“Aw, somebody needs a hug,” the actor said. “Just a movie, guys.”"
    }
}