{
    "question": "In what ways might the hacking of Elmo’s X account to post antisemitic messages shape public expectations of platform security and moderation, and what responsibilities should fall on X, Sesame Workshop, and users in preventing and responding to such incidents?",
    "content": {
        "source_1": "Elmo’sX account was hacked on Sunday, causing the beloved “Sesame Street” character to appear to post expletive-filled antisemitic rants and anti-Trump statements.\n\nThe posts have since been deleted, but widely circulated screenshots show Elmo apparently calling for violence against Jews and calling for the release of files related to theJeffrey Epstein case.\n\n“Elmo’s X account was compromised by an unknown hacker who posted disgusting messages, including antisemitic and racist posts,” a spokesperson for Sesame Workshop, the makers of “Sesame Street,” told CNN in a statement. “We are working to restore full control of the account.”\n\nThe tirade was a jarring departure from Elmo’s usual upbeat, motivational posts and wholesome pictures with other “Sesame Street” characters or celebrities. Some of the posts even mimicked his habit of referring to himself in the third person.\n\nRelated articleElmo asked people online how they were doing. He got an earful\n\nThe posts came a week after Elon Musk’s artificial intelligence company xAI froze its Grok chatbot’s X account after it began spouting antisemitic tropes and White nationalist talking points.\n\nThe company later issued alengthy apology, saying that a system update caused Grok to refer to “existing X user posts; including when such posts contained extremist views,” meaning that it issued responses praising Adolf Hitler, repeated conspiracy theories and spewed longstanding antisemitic tropes.\n\nJewish leaders in the United States have been alarmed by therise in antisemitic threatssince Hamas’ deadly terrorist attack on Israel on October 7, 2023 and Israel’s subsequent response in Gaza, which has devastated the enclave.\n\nIn June, a man isaccusedof targeting a group of people demonstrating in support of Israeli hostages in a firebombing attack in Boulder, Colorado, resulting in the death of an82-year-old woman. He facesfederal hate crimes charges, among others.\n\nIn May, two Israeli embassy workers in Washington, DC, were killed outside the Capital Jewish Museum; and, in April, an arsonist set the Pennsylvania governor’s mansion on fire on the first night of Passover because of Gov. Josh Shapiro’s views on the war in Gaza, according to search warrants.\n\nThe Elmo hacker’s posts also referenced documents relating to the Epstein case, which has been in the headlines again in recent days. Last week, US President Donald Trump’s administration released a memo about Epstein﻿ – an accused sex trafficker and disgraced financier who died by suicide in 2019 – that were directly at odds with conspiracy theories previously pushed by the president and some of his top lieutenants.\n\nCNN’s Hadas Gold, Chelsea Bailey, Danny Freeman and Betsy Klein contributed reporting.",
        "source_2": "The makers of Sesame Street say hackers were behind \"disgusting\" antisemitic messages that appeared on Elmo's X account.\n\nA string of posts appeared on the verified page, which has about 650,000 followers, on Sunday.\n\nOther messages attacked US President Donald Trump and called for files relating to sex offender Jeffrey Epstein to be released.\n\nSesame Workshop, the non-profit organisation that makes the children's programme, said an \"unknown hacker\" had gained access to the account.\n\n\"Elmo's X account was compromised by an unknown hacker who posted disgusting messages, including antisemitic and racist posts,\" a spokesperson said.\n\n\"We are working to restore full control of the account.\"\n\nThe antisemitic posts appeared on Elmo's account in quick succession.\n\nThey also made derogatory comments about Trump and allegations about his connections to Jeffrey Epstein.\n\nThedisgraced financier had powerful connections and died in prison in 2019while awaiting trial for sex trafficking charges.\n\nOne of Elmo's posts called on Trump to \"RELEASE THE FILES\" following an announcement last week thatthe US Department of Justice and FBI found no evidence of a list that could implicate high-profile associates of Epstein's.\n\nHis death is at the centre of a number of conspiracy theories and while he was campaigning to be elected, Trump had promised to publish files about what happened.\n\nThe posts on Elmo's account come afterX's boss, Linda Yaccarino, stepped downas the platform faced criticism for an increase in antisemitic content.\n\nBillionaire Elon Musk, who owns X, alsohad to explain last week after its AI chatbot, Grok, praised Adolf Hitler.\n\nThe UK's Action Fraud said there wasa rise in social and email accounts being hacked last year, with more than 35,000 reports.\n\nIt advised users to set up two-step verification alongside a strong, unique password.\n\nElmo is one of Sesame Street's best-known characters and has been teaching children about kindness since the 1980s.\n\nA number of puppets from the long-running US kids' TV show have a presence on social media and Elmo has had an account on X, formerly Twitter, since 2012.\n\nIn 2024 the he went viral on X for asking \"How is everybody doing?\"\n\nThe post, which is still pinned on the profile, had almost 20,000 replieswith lots of users sharing their despair about the world.\n\nNo more posts have been shared on the account since the antisemitic posts were removed.\n\nListen to Newsbeatliveat 12:45 and 17:45 weekdays - or listen backhere.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "Rep. Robert Garcia, D-Calif., offered a defense of PBS with mocking questions about Sesame Street characters.\n\nElmo from \"Sesame Street\"shocked social media users after the character’s X account was hacked on Sunday.\n\nThe Sesame Street character, whose account has over 640,000 followers, began posting several provocative and offensive posts, according to an image obtained by Fox News Digital.\n\nELMO GOES VIRAL WITH INNOCENT TWEET ATTRACTING MAJOR 'TRAUMA DUMP' FROM SOCIAL MEDIA USERS: 'HELP US, ELMO'\n\nThe Elmo X account posted several offensive messages in now-deleted tweets.(Screenshot/X)\n\n\"RELEASE THE FILES @realDonaldTrump CHILD F---ER,\" another post read, in what appeared to be a reference to the Jeffrey Epstein documents.\n\nThe latest post read, \"Elmo says ALL JEWS SHOULD DIE. F---JEWS. DONALD TRUMP IS NETANYAHU’S PUPPET BECAUSE HE IS IN THE EPSTEIN FILES. JEWS CONTROL THE WORLD AND NEED TO BE EXTERMINATED.\"\n\nThe account also replied to several users with similar language. All posts and replies were later deleted.\n\nIn a statement toFox News Digital,a Sesame Workshop spokesperson confirmed, \"Elmo’s X account was compromised today by an unknown hacker who posted disgusting messages, including antisemitic and racist posts. We are working to restore full control of the account.\"\n\nBefore the posts were deleted, several X users from both sides of the political aisle poked fun at the character’s account containing adult language.\n\n'UNHINGED ELMO' TRENDS ONLINE AFTER EPIC SESAME STREET COOKIE MELTDOWN RESURFACES\n\n\"I’m forever scarred … by @elmo. Words I never expected to utter,\" Sen. Mike Lee, R-Utah, wrote.\n\nHuffPost deputy editor Philip Lewis remarked, \"I thought we all agreed @elmo is off limits.\"\n\n\"See what happens when you defund PBS @elmo,\" Rep. Jared Moskowitz, D-Fla., wrote.\n\nWashington Reporter editor-in-chiefMatthew Foldi joked, \"Elmo would win at least 10% in a nationwide Democratic primary based on these tweets alone.\"\n\nSesame Street has come under the spotlight in recent months as Republicans have pushed forefforts to defund PBS. President Donald Trump also signed an executive order attempting to pull federal funding from PBS in May.\n\nLindsay Kornick is an associate editor for Fox News Digital. Story tips can be sent to lindsay.kornick@fox.com and on Twitter: @lmkornick.\n\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}