{
    "question": "In what ways could Judge Frimpong’s temporary restraining order—requiring reasonable suspicion, documentation of stops, and agent training—shape ICE operations and community trust in Los Angeles and the surrounding counties while litigation proceeds?",
    "content": {
        "source_1": "Federal agents and National Guard troops confront protesters outside the downtown Los Angeles federal building on June 8. In a lawsuit challenging the Trump administration's immigration crackdown in Los Angeles, the ACLU alleged that people at the facility have been held in deplorable conditions and denied access to lawyers.Tayfun Coskun/Anadolu via Getty Imageshide caption\n\nA federal judge in Los Angeles ordered the Trump administration to stop carrying out immigration sweeps in which she said federal agents have been indiscriminately arresting people across southern California without reasonable suspicion that they're in the country illegally.\n\nSince early June, agents from Immigration and Customs Enforcement, the Border Patrol and other federal agencies have been roving Los Angeles and surrounding counties arresting thousands of people in what civil rights lawyers characterized in a lawsuit last week as an unconstitutional and \"extraordinary campaign of targeting people based on nothing more than the color of their skin.\"\n\nInher order, Judge Maame Ewusi-Mensah Frimpong, of the U.S. District Court for the Central District of California, said there is \"a mountain of evidence\" to support the claim that agents are arresting people solely based on their race, accents, or the work they're engaged in, in violation of the Fourth Amendment's protection against unreasonable government seizure.\n\n\"The seizures at issue occurred unlawfully,\" Frimpong wrote.\n\nShe issued two temporary restraining orders — one prohibiting immigration agents from stopping people without reasonable suspicion that they're in the country illegally, and the other requiring agents to give people they arrest immediate access to lawyers. The orders, which apply to Los Angeles and six surrounding counties, are temporary while the case moves forward. But they could severely restrict the Trump administration's ability to continue carrying out the raids that have sown fear and terror in immigrant and Latino neighborhoods since they started on June 6.\n\n\"It's an extraordinary victory,\" said Mark Rosenbaum, a senior lawyer with Public Counsel, one of the legal advocacy groups that filed the suit. \"It is a complete repudiation of the racial profiling tactics and the denial of access to lawyers that the administration has utilized, and it means that the rule of law is back in Los Angeles.\"\n\nIn a statement, Department of Homeland Security spokeswoman Tricia McLaughlin criticized the ruling.\n\n\"A district judge is undermining the will of the American people,\" McLaughlin said. \"America's brave men and women are removing murderers, MS-13 gang members, pedophiles, rapists — truly the worst of the worst from Golden State communities. Law and order will prevail.\"\n\nBut the ruling is the latest potential roadblock for President Trump as he escalates his immigration crackdown byfocusing on large, Democratic-run citieswhose leaders he's accused of trying to sabotage his efforts to carry out his mass deportation plans.\n\nIt came a little more than a week after Public Counsel, the American Civil Liberties Union and other groups filed an emergencyclass action lawsuitalleging that ICE and Border Patrol agents are engaged in widespread racial profiling, arresting people they encounter in public solely because they have brown skin or because they're doing work often done by immigrants.\n\nSince early June, agents have repeatedly raided known hubs for Latino workers, including car washes, day laborer gathering spots, and street vendor corners. They've also pulled people who appear to be Latino out of their cars, and picked them up from bus stops and on sidewalks. They've arrested immigrants without legal status and U.S. citizens alike. Many of the arrestshave been filmedby bystanders and posted to social media.\n\nIn a sworn declaration, the lead plaintiff in the lawsuit, Pedro Vasquez Perdomo, said that on June 18, he and co-workers were sitting at a bus stop waiting for their ride to a construction job when armed, masked agents in plain clothes poured out of several unmarked cars and ran toward them. Vasquez Perdomo said he was afraid and tried to move away. The men grabbed and handcuffed him before ever asking for his identification, he said. He was arrested, detained for three weeks, and while now released, is facing deportation.\n\nHe said he was never told why he was being arrested or informed of any warrant against him.\n\n\"I think that I was arrested that day at the bus stop because of how I look,\" he said. \"I was sitting with other workers and we all look Hispanic and were wearing construction work clothes.\"\n\nIn a hearing at a downtown federal courthouse on Thursday, ACLU attorney Mohammad Tajsar argued that pressure to drive up immigration arrests has led agents to disregard legal and constitutional limits on their authority. In order to stop someone in public and arrest them without a warrant, an immigration agent mustat least have \"reasonable suspicion\"that they're in the country illegally. Federal courts have ruled a person's appearance alone is not enough.\n\nBut Tajsar pointed Judge Frimpong to numerous videos of recent immigration raids, press reports, and sworn declarations from Vasquez Perdomo and other people swept up that he said prove federal agents are detaining people who look Latino on the assumption that they're immigrants, even though they know nothing else about them.\n\n\"They're engaging in roving patrols in which they're stopping people first and asking questions later,\" Tajsar said. \"They're not going to admit this, but the evidence is clear. They're looking at race.\"\n\nSean Skedzielewski, an attorney for the U.S. Justice Department, denied that.\n\n\"There's no documented evidence of agents deciding to ignore the law or just pick people up because of race,\" he told the judge. \"That kind of conduct is just not happening.\"\n\nSkedzielewski said agents out on patrol are instead trained to consider \"the totality of circumstances,\" which can include considering someone's appearance along with other factors like the location of a stop, their workplace, or whether a person gets nervous when encountering an agent.\n\n\"What might seem like an arbitrary stop that comes out of nowhere,\" he said, \"agents are performing work in the field all the time before these interactions occur. Prior surveillance of the area, of that person, of their interactions – that the person being stopped might be totally unaware of – are informing the agents' decisions to approach in the first place.\"\n\nJudge Frimpong said during Thursday's hearing that she was skeptical of the government's general assurances that immigration agents are not stopping and arresting people arbitrarily.\n\n\"What they are considering should be things that give them reasonable suspicion that this person does not have status, and I'm not seeing that,\" the judge said. She said the government could have been more convincing by explaining the specific reasons that agents arrested Vasquez Perdomo or several other plaintiffs in the case. But it chose not to do that.\n\nIn their own declarations, four other plaintiffs, including U.S. citizens, described similar encounters with hard-charging agents who they said detained or arrested them before asking any questions.\n\nWhether immigration agents will scale back their aggressive tactics in response to the judge's order is unclear. Attorneys for the civil rights groups have said it will be the government's responsibility to ensure its agents are following the law and the Constitution as they continue their immigration enforcement operations. But lawyers also said they'll aggressively enforce the judge's order in court if they think the government is failing to comply.",
        "source_2": "James Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics in Texas, as well as other general news across the United States. James joined Newsweek in July 2022 from LBC, and previously worked for the Daily Express. He is a graduate of Oxford University. Languages: English. Twitter: @JBickertonUK. You can get in touch with James by emailing j.bickerton@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nPresidentDonald Trump's administration suffered a blow on Friday when a federal judge concluded that federal agents had been \"unlawfully\" arresting suspected illegal migrants in Los Angeles and six surrounding counties.\n\nJudge Maame Ewusi-Mensah Frimpong, of the U.S. District Court for the Central District of California, imposed two temporary restraining orders banning law enforcement from detaining suspected illegal migrants in the area without reasonable suspicion and insisting those arrested must have access to legal counsel.\n\nDepartment of Homeland Security Assistant Secretary Tricia McLaughlin toldNewsweekin a statement:\"A district judge is undermining the will of the American people.\"\n\nThe Trump administration has launched amajor crackdowntargeting suspected illegal immigrants, with a surge in U.S. Immigration and Customs Enforcement (ICE) raids across the country.\n\nIn early June anti-ICE demonstrations in Los Angeles turned violent, withvehicles torchedand rocks thrown at police. In response Trump ordered the deployment of 4,000 California National Guard soldiers and 700 Marinesagainst the wishesof California GovernorGavin Newsom.\n\nOn Friday Judge Frimpong concluded there was \"a mountain of evidence\" that federal agents had been arresting people solely based on characteristics such as race, employment and accent, which she termed a violation of the Fourth Amendment that prohibits unreasonable seizures by the government.\n\nReferring to some arrests in Los Angeles and the six counties Frimpong said: \"The seizures at issue occurred unlawfully.\"\n\nTwo temporary restraining orders were issued by the judge banning federal agents in Los Angeles and surrounding counties from making arrests without reasonable suspicion those detained were in the country illegally, and requiring arrestees to get swift access to lawyers.\n\nPedro Vasquez Perdomo, the lead plaintiff in the case, said that on June 18 he and other Hispanic workers were arrested while sitting at a bus stop on their way to a construction job. Perdomo said he wasn't told why he had been arrested or if there was a warrant out for him.\n\nIn a statement sent toNewsweek,Department of Homeland Security Assistant Secretary Tricia McLaughlin said:\"A district judge is undermining the will of the American people. America's brave men and women are removing murderers, MS-13 gang members, pedophiles, rapists—truly the worst of the worst from Golden State communities. Law and order will prevail.\"\n\nGovernor Gavin Newsomwelcomed the verdict on X writing: \"Justice prevailed today.\n\n\"The court's decision puts a temporary stop to federal immigration officials violating people's rights and racial profiling. California stands with the law and the Constitution — and I call on the Trump Administration to do the same.\"\n\nDemocratic California State Senator Sasha Renée Pérez said:\"The court's ruling today is a powerful statement against the Trump Administration. As we have suspected, the federal government's attorneys did not produce any compelling evidence that their cruel and aggressive immigration enforcement is anything more than racial profiling.\n\n\"Under questioning, they told the judge they look for people based on their race, their type of clothing and even their facial expressions. This is appalling to hear, but not surprising. We know this reckless federal witch-hunt is about creating terror in vulnerable communities and scoring political points.\"\n\nBill Essayli, U.S. Attorney for the Central District of California, wrote on X, formerly Twitter:\"We strongly disagree with the allegations in the lawsuit and maintain that our agents have never detained individuals without proper legal justification. Our federal agents will continue to enforce the law and abide by the U.S. Constitution.\"\n\nMohammad Tajsar, a senior staff attorney at the American Civil Liberties Union Foundation of Southern California, commented:\"While it does not take a federal judge to recognize that marauding bands of masked, rifle-toting goons have been violating ordinary people's rights throughout Southern California, we are hopeful that today's ruling will be a step toward accountability for the federal government's flagrant lawlessness that we have all been witnessing.\"\n\nAnnie Lai, who runs the Immigrant and Racial Justice Solidary Clinic at the UC Irvine School of Law, said:\"Today's ruling has been made possible by everyday people standing up for the idea that the Constitution is still the law of the land, and applies to all of us. Our communities are strong not in spite of their diversity but because of it. While this is only one step in what will undoubtedly be a long fight, it is an important one.\"\n\nIt remains to be seen whether the Trump administration will be able to get Friday's ruling overturned and whether it will have any impact on law enforcement outside of Los Angeles and the surrounding counties that were detailed in the case.\n\nUpdate 7/12/25, 9:49 a.m. ET: This story has been updated with a statement from Department of Homeland Security Assistant Secretary Tricia McLaughlin.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nJames Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics in Texas, as well as other general news across the United States. James joined Newsweek in July 2022 from LBC, and previously worked for the Daily Express. He is a graduate of Oxford University. Languages: English. Twitter: @JBickertonUK. You can get in touch with James by emailing j.bickerton@newsweek.com\n\nJames Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics in Texas, as well as other general news across the United States. James joined Newsweek in July 2022 from LBC, and previously worked for the Daily Express. He is a graduate of Oxford University. Languages: English. Twitter: @JBickertonUK. You can get in touch with James by emailing j.bickerton@newsweek.com\n\nJames Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics                                    ...Read more",
        "source_3": "Gregory Bovino, U.S. Border Patrol Chief for the El Centro Sector, discusses several immigration topics on ‘The Ingraham Angle.’\n\nA federal judge in Los Angeles late Friday issued a sweeping temporary restraining order (TRO) against Immigration and Customs Enforcement (ICE), ruling that the agency likely violated constitutional protections through its immigration enforcementpractices in California.\n\nIn a 53-page order issued Friday, U.S. District Judge Maame Ewusi-Mensah Frimpong, a Biden appointee, barred ICE from conducting detentive stops in the Central District of California unless agents have \"reasonable suspicion\" that a person is in the country unlawfully.\n\nFrimpong's rulingexplicitly prohibits ICEfrom relying solely on race or ethnicity, speaking Spanish or English with an accent, location, or type of work when forming suspicion, citing the Fourth Amendment.\n\nThe order also requires ICE to keep and turn over detailed records of each stop and agents' reasoning for them, develop official guidance for determining \"reasonable suspicion,\" and implement mandatory training for agents.\n\nTRUMP ADMINISTRATION SUES LOS ANGELES OVER SANCTUARY POLICIES THAT 'IMPEDE' ICE OPERATIONS\n\nProtesters appeared to attempt to gain access to a U.S. Immigration and Customs Enforcement black van amid protests in San Francisco.(United States Immigration and Customs Enforcement via X)\n\nFrimpong presided over a hearing Thursday where she considered granting the request that will have major implications for immigration enforcement inCalifornia, a state that has become a focal point in President Donald Trump's aggressive deportation plans.\n\nThe judge heard arguments about whether to grant the TRO against ICE over allegations the agency is violating constitutional rights during its immigration arrests.\n\nFrimpong said during the hearing on Thursday that she was leaning toward granting the TRO Friday.\n\n\"I think it’s important for the court not to burden otherwise lawful law enforcement activities,\" the judge said.\n\nThe case was initially brought in June as a routine petition from three detainees, but it has ballooned into a weighty lawsuit challenging the way ICE operates.\n\nDHS Secretary Kristi Noem testifies before the House Appropriations Homeland Security Subcommittee hearing May 6; ICE agents.(Reuters/Kevin Lamarque and Christopher Dilts/Bloomberg via Getty Images)\n\nLos Angeles Mayor Karen Bass praised the federal court’s decision to issue a temporary restraining order halting what she described as \"unconstitutional and reckless raids conducted under the Trump Administration.\"\n\n\"Today, the Court ruled in favor of the United States Constitution, of American values and decency — this is an important step toward restoring safety, security and defending the rights of all Angelenos,\" Bass shared in a statement.\n\nBass characterized the federal actions as aggressive and harmful and reaffirmed Los Angeles’ commitment to protecting its residents' rights.\n\n\"Los Angeles has been under assault by the Trump Administration as masked men grab people off the street, chase working people through parking lots and march through children’s summer camps. We went to court against the administration because we will never accept these outrageous and un-American acts as normal,\" she continued.\n\nImmigration rights groups and local governments, including the cities ofLos Angeles, Santa Monica, Culver, and West Hollywood, have all intervened in the case and Democrat-led states have filed an amicus brief in support of them.\n\nThe plaintiffs alleged in court papers that ICE is \"indiscriminately\" arresting people with \"brown skin\" at Home Depots, car washes, farms and more. Authorities made the arrests with no \"reasonable suspicion\" and sometimes mistakenly apprehended U.S. citizens in the process, all in violation of the Fourth Amendment, attorneys wrote.\n\nThe plaintiffs argued the Trump administration gave ICE an unrealistic quota of 3,000 arrests per day, causing officers to feel pressured to blow past legal requirements to achieve those numbers.\n\nMeanwhile, the Trump administration is disputing the allegations and denies wrongdoing.\n\nImmigration and Customs Enforcement agents clash with protesters in San Francisco July 8.(U.S. Immigration and Customs Enforcement via X)\n\nU.S. Attorney Bill Essayli responded to the ruling and vehemently opposed the allegations in the lawsuit.\n\n\"We strongly disagree with the allegations in the lawsuit and maintain that our agents have never detained individuals without proper legal justification,\" Essayli wrote in a post on X.\n\n\"Our federal agents will continue to enforce the law and abide by the U.S. Constitution.\"\n\nDepartment of Justiceattorneys wrote that immigration arrests, of which there have been nearly 3,000 across California since early June, have been carried out legally.\n\n\"Their request that immigration authorities be enjoined from relying on certain factors like occupation and location flies in the face of established law requiring immigration officials to consider the totality of the circumstances, including things like occupation and location,\" the attorneys wrote.The plaintiffs have also asked the judge to expand visitor access to a short-term detention facility in downtown Los Angeles.\n\nThe facility became the site of protests and unrest in early June, leading to authorities temporarily abandoning the building. The plaintiffs allege that detainees' access to lawyers has been hindered while in the facility, in violation of the Fifth Amendment.\n\nFrimpong’s order reinforces their Fifth Amendment claim, requiring ICE to ensure immediate legal access for detainees. The temporary restraining order will remain in effect pending further litigation.\n\nThe White House did not immediately respond to Fox News Digital's request for comment.\n\nAshley Oliver is a reporter for Fox News Digital and FOX Business, covering the Justice Department and legal affairs. Email story tips toashley.oliver@fox.com.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}