{
    "question": "How might the newly implemented tariffs, which raise the average U.S. tariff rate to its highest in nearly a century, affect American jobs, consumer prices, and global supply chains in the coming months?",
    "content": {
        "source_1": "PresidentDonald Trump's higher tariff rates of 10% to 50% ondozens of trading partnerskicked in on Aug. 7, testing his strategy for shrinking U.S. trade deficits without massive disruptions to global supply chains, higher inflation, and stiff retaliation from trading partners.\n\nU.S. Customs and Border Protection agency began collecting the higher tariffs at 12:01 a.m. ET after weeks of suspense over Trump's final tariff rates and frantic negotiations with major trading partners that sought to lower them.\n\nGoods loaded onto U.S.-bound vessels and in transit before the midnight deadline can enter at lower prior tariff rates before Oct. 5, according to a CBPnotice to shippersissued this week. Imports from many countries had previously been subject to a baseline 10% import duty after Trump paused higher rates announced in early April.\n\nBut since then, Trump has frequently modified his tariff plan, slapping some countries with much higher rates, including 50% for goods fromBrazil, 39% from Switzerland, 35% fromCanadaand 25% from India. He announced on Aug. 6 aseparate, 25% tariffon Indian goods to be imposed in 21 days over the South Asian country's purchases of Russian oil.\n\n\"RECIPROCAL TARIFFS TAKE EFFECT AT MIDNIGHT TONIGHT!,\" Trump said on Truth Social just ahead of the deadline. \"BILLIONS OF DOLLARS, LARGELY FROM COUNTRIES THAT HAVE TAKEN ADVANTAGE OF THE UNITED STATES FOR MANY YEARS, LAUGHING ALL THE WAY, WILL START FLOWING INTO THE USA. THE ONLY THING THAT CAN STOP AMERICA'S GREATNESS WOULD BE A RADICAL LEFT COURT THAT WANTS TO SEE OUR COUNTRY FAIL!\"\n\nEight major trading partners accounting for about 40% of U.S. trade flows have reached framework deals for trade and investment concessions to Trump, including the European Union, Japan, and South Korea, reducing their base tariff rates to 15%.\n\nBritain won a 10% rate, while Vietnam, Indonesia, Pakistan, and the Philippines secured rate reductions to 19% or 20%.\n\n\"For those countries, it's less-bad news,\" said William Reinsch, a senior fellow and trade expert at the Center for Strategic and International Studies in Washington.\n\n\"There'll be some supply chain rearrangement. There'll be a new equilibrium. Prices here will go up, but it'll take a while for that to show up in a major way,\" Reinsch said.\n\nCountries with punishingly high duties, such as India and Canada, \"will continue to scramble around trying to fix this,\" he added.\n\nTrump's order has specified that any goods determined to have been transshipped from a third country to evade higher U.S. tariffs will be subject to an additional 40% import duty, but his administration has released few details on how these goods would be identified or the provision enforced.\n\nTrump's July 31tariff orderimposed duties above 10% on 67 trading partners, while the rate was kept at 10% for those not listed. These import taxes are one part of a multilayered tariff strategy that includes national security-based sectoral tariffs onsemiconductors,pharmaceuticals, autos, steel, aluminum, copper, lumber, and other goods.\n\nTrump said on Aug. 6 that the microchip duties could reach 100%.\n\nChina is on a separate tariff track and will face a potential tariff increase on Aug. 12 unless Trump approves an extension of a prior truce after talks last week in Sweden. He has said he may impose additional tariffs on China's purchases of Russian oil as he seeks to pressure Moscow into ending its war in Ukraine.\n\nTrump has touted the vast increase in federal revenues from his import tax collections, which are ultimately paid by companies importing the goods and consumers of end products.\n\nThe higher rates will add to the total, which reached a record $27 billion in June. U.S. Treasury Secretary Scott Bessent has said that U.S. tariff revenues could top $300 billion a year.\n\nThe move will drive average U.S. tariff rates to around 20%, the highest in a century and up from 2.5% when Trump took office in January, the Atlantic Institute estimates.Commerce Department datareleased last week showed more evidence that tariffs began driving up U.S. prices in June, including for home furnishings and durable household equipment, recreational goods, and motor vehicles.\n\nCosts from Trump's tariff war are mounting for a wide swath of companies, including bellwethers Caterpillar, Marriott, Molson Coors, and Yum Brands. All told, global companies that have reported earnings so far this quarter are looking at a hit of around $15 billion to profits in 2025, Reuters'global tariff trackershows.\n\n(Reporting by David Lawder and Andrea Shalal; Editing by Lincoln Feast)",
        "source_2": "US President Donald Trump's sweeping new tariffs on more than 90 countries around the world have come into effect.\n\nMoments before his deadline passed for countries to negotiate US trade deals, Trump posted on his Truth Social platform that billions of dollars were now flowing into his country as a result of his import taxes.\n\nTrump is using tariffs to encourage jobs and manufacturing industries to return to America, among other political goals.\n\nSeparately on Wednesday, he threatened to raise the tariff on imports from India to 50%, unless that country stopped buying Russian oil. He also threatened a 100% tariff on foreign-made computer chips, to push tech firms to invest more in the US.\n\nTrump's trade policies have been broadly aimed at reshaping the global trading system, which he sees as treating the US unfairly. One of his key pledges as he returned to the White House in January was to cut the trade deficit - the shortfall between what America buys and what it sells.\n\nHis tariffs work by charging US importers a tax on goods they buy from other countries. Those importers may pass some or all of the extra cost on to customers.\n\nTrump has also been accused of throwing the global economy into turmoil in recent months, though markets have recently been more stable.\n\nThe overall average US tariff rate is at its highest in almost a century, thanks to a range of other industry-specific taxes affecting products such as vehicles and steel.\n\nThe duties that came into effect on Thursday were first announced in April. Many were later paused amid market turbulence, and to give other countries time to strike new trade deals with the US.\n\nA patchwork of rates were set for different countries - and were adjusted over time by Trump, who ultimately set a negotiating deadline of 7 August.\n\nExport-dependent economies in South East Asia are among the hardest-hit.\n\nManufacturing-focused Laos and Myanmar face some of the highest levies at 40%. Some experts said Trump appears to have targeted countries with close trade ties with China.\n\nBut after more than four months of uncertainty, markets in Asia seemed to take the news in their stride on Thursday.\n\nMajor share indexes in Japan, Hong Kong, South Korea and mainland China were a little higher, while markets in India and Australia were lower.\n\nThe latest set of tariffs will offer countries some stability after months of chaos, said economist Bert Hofman from the National University of Singapore.\n\n\"This is supposed to be it,\" he said. \"Now you can start to analyse the impact of the tariffs.\"\n\nSome major economies - including theUK,JapanandSouth Korea- reached agreements to ensure goods exported to the US would face a lower tariff rate than Trump threatened in April.\n\nTheEuropean Unionhas also struck a framework deal with Washington, in which Brussels has accepted a 15% tariff on goods from the trading bloc.\n\nSwitzerland has said it will hold an extraordinary meeting on Thursday after its officials were unable to reach a deal with the US.\n\nAt 39%, the tariff rate on Swiss goods is one of the highest imposed by the US, and threatens to hit the country's economy hard.\n\nTaiwan, a key Washington ally in Asia, was handed a 20% tariff. Its president Lai Ching-te said the rate was \"temporary\" and that talks with the US were ongoing.\n\nOther tariffs unveiled by Trump after he returned to the White House in January have been aimed at the US's top three trading partners - China, Canada and Mexico - with a variety of political goals in mind.\n\nLast week, he boosted the tariff rate on Canada from 25% to 35%, saying the country had \"failed to cooperate\" in curbing the flow of fentanyl and other drugs across the US border. Canada insists it is cracking down on drug gangs.\n\nBut most Canadian exports to the US will dodge the import tax due to an existing trade treaty, the United States-Mexico-Canada Agreement (USMCA).\n\nHigher tariffs on Mexico were paused for another 90 days as negotiations continue to strike a trade deal.\n\nMeanwhile, the US and China have held a series of talks in a bid to agree an extension to a 90-day tariffs pause due to expire on 12 August.\n\nSome of Trump's recent tariff moves have been bound up with a separate effort to end Russia's war in Ukraine.\n\nHe has threatened to impose \"secondary tariffs\" aimed at Moscow's trading partners if a ceasefire with Ukraine is not agreed by Friday, although it is unclear whether positive noises following talks between Washington and Moscow and apotential meeting between Trump and Putinwill affect this.\n\nIn the interim, Trump threatened on Wednesday to raise the tariff rate on Indian goods to 50% from 27 August, as he pushes the world's third largest importer of energy to stop buying oil from Russia.\n\nDelhi called the move \"unfair, unjustified and unreasonable\" and vowed to protect its national interests.\n\nThe move marked a \"sharp change\" in Trump's approach to Moscow that could spark concerns among other countries in talks with the US, said market analyst Farhan Badami from financial services firm eToro.\n\n\"There is the possibility here that India is only the first target that Trump intends to punish for maintaining trade relations with Russia,\" Mr Badami said.\n\nAlso on Wednesday, Trump said he would impose a 100% tariff on foreign-made semiconductors.\n\nThat threat came as tech firm Apple announced a new $100bn (£75bn) US investment after coming under pressure from the White House to move more production to the US.\n\nMajor chipmakers that have made significant investments in the US appear to be able to dodge the new tariff. Government officials in Taiwan and South Korea have said in separate statements that TSMC, SK Hynix, and Samsung would be exempt from the new levy.\n\nThe White House did not immediately respond to a BBC request for clarification.\n\nThe BBC has also contacted SK Hynix and Samsung. TSMC declined to comment.\n\nDoes your US business import to India?Get in touch.\n\nFollow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weeklyUS Politics Unspunnewsletter. Readers in the UK cansign up here. Those outside the UK cansign up here.\n\nThe crash in the disputed Scarborough Shoal rendered a Chinese warship \"unseaworthy\", Manila said.\n\nWatch: Chinese ships collide while pursuing Philippine boat\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".\n\nAt least 15 people have died and dozens more are missing after flash floods hit Gansu province, local authorities say.",
        "source_3": "PresidentTrumpbegan levying higher import taxes on dozens of countries Thursday, just as the economic fallout of his monthslong tariff threats has begun to create visible damage for the U.S. economy.\n\nJust after midnight, goods from more than 60 countries and the European Union became subject to tariff rates of 10% or higher. Products from the EU, Japan and South Korea are taxed at 15%, while imports from Taiwan, Vietnam and Bangladesh are taxed at 20%.Trumpalso expects the EU, Japan and South Korea to invest hundreds of billions of dollars in the U.S.\n\n“I think the growth is going to be unprecedented,”Trumpsaid Wednesday afternoon. He added that the U.S. was “taking in hundreds of billions of dollars in tariffs,” but he couldn’t provide a specific figure for revenues because “we don’t even know what the final number is” regarding tariff rates.\n\nDespite the uncertainty, the TrumpWhite Houseis confident that the onset of his broad tariffs will provide clarity about the path of the world’s largest economy. Now that companies understand the direction the U.S. is headed, the administration believes they can ramp up new investments and jump-start hiring in ways that can rebalance the U.S. economy as a manufacturing power.\n\nBut so far, there are signs of self-inflicted wounds to America as companies and consumers alike brace for the impact of new taxes. What the data has shown is a U.S. economy that changed in April with Trump’s initial rollout of tariffs, an event that led to market drama, a negotiating period andTrump’sultimate decision to start his universal tariffs on Thursday.\n\nEconomic reports show that hiring began to stall, inflationary pressures crept upward and home values in key markets started to decline after April, said John Silvia, CEO of Dynamic Economic Strategy.\n\nPHOTOS: Trump's broad tariffs go into effect, just as economic pain is surfacing\n\n“A less productive economy requires fewer workers,” Silvia said in an analysis note. “But there is more, the higher tariff prices lower workers’ real wages. The economy has become less productive, and firms cannot pay the same real wages as before. Actions have consequences.”\n\nEven then, the ultimate transformations of the tariffs are unknown and could play out over months, if not years. Many economists say the risk is that the American economy is steadily eroded rather than collapsing instantly.\n\n“We all want it to be made for television where it’s this explosion — it’s not like that,” said Brad Jensen, a professor at Georgetown University. “It’s going to be fine sand in the gears and slow things down.”\n\nTrumphas promoted the tariffs as a way to reduce the persistent trade deficit. But importers sought to avoid the taxes by importing more goods before the taxes went into effect. As a result, the $582.7 billion trade imbalance for the first half of the year was 38% higher than in 2024. Total construction spending has dropped 2.9% over the past year.\n\nThe lead-up to Thursday fit the slapdash nature ofTrump’stariffs, which have been variously rolled out, walked back, delayed, increased, imposed by letter and frantically renegotiated. The process has been so muddled that officials for key trade partners were unclear at the start of the week whether the tariffs would begin Thursday or Friday. The language of the July 31 order to delay the start of tariffs from Aug. 1 only said the higher tax rates would start in seven days.\n\nTrumpon Wednesday announced additional 25% tariffs to be imposed on India for its buying of Russian oil, bringing its total import taxes to 50%.\n\nA top body of Indian exporters said Thursday the latest U.S. tariffs will impact nearly 55% of the country’s outbound shipments to America and force exporters to lose their long-standing clients.\n\n“Absorbing this sudden cost escalation is simply not viable. Margins are already thin,” S.C. Ralhan, president of the Federation of Indian Export Organizations, said in a statement.\n\nThe Swiss executive branch, the Federal Council, was expected to hold an extraordinary meeting Thursday afternoon after President Karin Keller-Sutter and other top Swiss officials returned from a hastily arranged trip to Washington in a failed bid to avert steep 39% U.S. tariffs on Swiss goods.\n\nImport taxes are still coming on pharmaceutical drugs andTrumpannounced 100% tariffs on computer chips. That could leave the U.S. economy in a place of suspended animation as it awaits the impact.\n\nThe president’s use of a 1977 law to declare an economic emergency to impose the tariffs is also under challenge. The impending ruling from last week’s hearing before a U.S. appeals court could causeTrumpto find other legal justifications if judges say he exceeded his authority.\n\nEven people who worked withTrumpduring his first term are skeptical that things will go smoothly for the economy, such as Paul Ryan, the former Republican House speaker, who has emerged as a Trump critic.\n\n“There’s no sort of rationale for this other than the president wanting to raise tariffs based upon his whims, his opinions,” Ryan told CNBC on Wednesday. “I think choppy waters are ahead because I think they’re going to have some legal challenges.”\n\nStill, the stock market has been solid during the recent tariff drama, with the S&P 500 index climbing more than 25% from its April low. The market’s rebound and the income tax cuts in Trump’s tax and spending measures signed into law on July 4 have given theWhite Houseconfidence that economic growth is bound to accelerate in the coming months.\n\nAs of now,Trumpstill foresees an economic boom while the rest of the world and American voters wait nervously.\n\n“There’s one person who can afford to be cavalier about the uncertainty that he’s creating, and that’sDonald Trump,” said Rachel West, a senior fellow at The Century Foundation who worked in the BidenWhite Houseon labor policy. “The rest of Americans are already paying the price for that uncertainty.”\n\nPope Leo should tell Catholics: Marry young, have many children\n\nTrump’s TikTok delays undermine his China hawks while Intel controversy grows"
    }
}