{
    "question": "How might Mahmoud Khalil’s $20 million lawsuit affect future government approaches to campus protest–related immigration enforcement and protections for political speech?",
    "content": {
        "source_1": "Mahmoud Khalil filed a claim against the Trump administration for $20 million, alleging he was falsely imprisoned and maliciously prosecuted as the government sought to deport him over his prominent role in a campus protests. NBC News’ Danny Cevallos details Khalil’s claims.July 10, 2025",
        "source_2": "Gabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nThe Trump administration is rejecting claims made by Palestinian-American activist Mahmoud Khalil, who is seeking $20 million in damages from the federal government for what he describes as a politically motivated attempt to silence him.\n\nIn a newly filed civil claim, Khalil,now free on bail and back home in New York,accuses theDepartment of Homeland Security, U.S. Immigration and Customs Enforcement, and the State Department of false imprisonment, malicious prosecution, and defamation—including being wrongly branded an antisemite—after his arrest and detention in March.\n\nIn response to the filing, the Department of Homeland Security pushed back aggressively.\n\n\"Khalil's claim is absurd,\" DHS spokesperson Tricia McLaughlin said in an emailed statement to the Associated Press. She accused Khalil of engaging in \"hateful behavior and rhetoric\" that DHS says threatened Jewish students.\n\nThe State Department, meanwhile, said its actions regarding Khalil were lawful and appropriate.\n\nNewsweekhas reached out to Khalil's legal representatives via email on Thursday afternoon for comment.\n\nThe Trump administration publicly hailed Khalil's arrest, vowing to deport him along with others involved in protests against Israel that it labeled as \"pro-terrorist, anti-Semitic, anti-American activity.\"\n\nKhalil worked as a mediator between pro-Palestinian protesters and Columbia University leadership following the outbreak of the conflict between Israel andHamasin October 2023. The Trump administration said his actions went against U.S. foreign policy,using this as grounds to detain him and seek his deportation.\n\nHis casemarked the beginning of a nationwide sweep byICEtargeting pro-Palestinian students with visas and green cards, using the same foreign policy argument outlined by the Secretary of State, that their actions were in support of Hamas and antisemitic.\n\nSecretary of StateMarco Rubiosaid in an April memo thatKhalil's campus activities were\"otherwise lawful,\" but noted that Khalil's deportation is necessary to avoid undermining U.S. foreign policy.\n\nHis release came after Khalil and his legal team appealed ajudge's June 13 decisionthat he could remain in ICE detention in Louisiana based on the Trump administration's arguments that he had committed fraud on his green card application.\n\nKhalil, a 30-year-old Columbia University graduate student, told AP the lawsuit is about holding those in power accountable.\n\n\"They are abusing their power because they think they are untouchable,\" he said. \"Unless they feel there is some sort of accountability, it will continue to go unchecked.\"\n\nThe legal claim, filed under the Federal Tort Claims Act, marks a significant step toward potential civil litigation and comes as Khalil's deportation case continues in immigration court.\n\nFor Khalil, the trauma is deeply personal. On a recent afternoon, he sat in his Manhattan apartment cradling his 10-week-old son, Deen, recallingthe night he spent in a cold Louisiana immigration jail awaiting news of the baby's birth back in New York.\n\n\"I cannot describe the pain of that night,\" Khalil said, looking down at his infant son. \"This is something I will never forgive.\"\n\nKhali has been a vocal advocate for Palestinian rights and was prominently involved in campus protests criticizing U.S. policy toward Israel. He believes that his arrest on March 8 and subsequent detention was a direct result of that activism.\n\nHis claim accuses federal officials of detaining him under false pretenses and launching a smear campaign to discredit his advocacy. Despite facing no criminal charges and having no links to terrorist groups, Khalil says he was portrayed as a threat for his political beliefs.\n\nKhalil has said he hopes the case sparks broader scrutiny of what he views as a Trump-era effort to punish dissent, particularly from Palestinian and Muslim voices.\n\nAlongside the lawsuit, Khalil alsofiledfor another preliminary injunction to stop the government from detaining or deporting him. This was filed as part of his original case which challenged his detention being heard in U.S. District Court in New Jersey.\n\nFollowing that filing, which was a second attempt, Judge Michael Farbiarz ordered that Khalil give more details on why he was trying again, and ordered the government to submit his response.\n\nKhalil told the AP,\"This isn't just about me. It's about setting a precedent. We need to show that abusing the immigration system for political retribution is not acceptable in a democracy.I'm not going to be quiet just because they tried to lock me up. That's not how this works.\"\n\nSamah Sisay, Staff Attorney at the Center for Constitutional Rights, in a press release shared withNewsweek:\"The Trump administration's unconstitutional targeting of Mr. Khalil led to severe harms that he continues to navigate, including financial loss, reputational damage, and emotional distress. Mr. Khalil will never get back the three months stolen from him while in immigration detention, including his child's birth and first months of life. The government must take accountability for their unlawful actions and compensate Mr. Khalil for his suffering.\"\n\nRubio told reporters in March that the U.S. can deny visas for \"virtually any reason,\"\"If you tell us, when you apply, 'Hi, I'm trying to get into the United States on a student visa, I am a big supporter of Hamas, a murderous, barbaric group that kidnaps children, that rapes teenage girls, that takes hostages, that allows them to die in captivity, that returns more bodies than live hostages.'\"\n\n\"If you tell us that you are in favor of a group like this, and if you tell us, when you apply for your visa, and by the way, 'I intend to come to your country as a student and rile up all kinds of anti-Jewish student, antisemitic activities, I intend to shut down your universities.\"\n\nRubio continued,\"If you told us all these things when you applied for a visa, we would deny your visa. I hope we would. If you actually end up doing that, once you're in this country on such a visa, we will revoke it.\"\n\nJudge Farbiarz, in his response to Khalil's injunction filing Thursday: \"Federal practice does not generally allow for multiple bites at the apple.\"\n\nKhalil said that if a financial settlement is reached, he intends to share it with others whom he believes were similarly targeted in the administration's \"failed\" attempt to suppress pro-Palestinian speech.\n\nAlternatively, he said he would be willing to accept an official apology and meaningful changes to deportation policies.\n\nThis article includes reporting by the Associated Press.\n\nUpdate: 7/10/25, 4:18 p.m. ET: This article was updated with new information and remarks.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he                                    ...Read more",
        "source_3": "A college graduate student accused of pro-Hamas activism is seeking millions from the Trump administration weeks after being released from an immigration detention center.\n\nMahmoud Khalil — a Syrian-born Palestinian activist who became the face of anti-Israel demonstrations that rocked Columbia University’s campus throughout 2024 — is suing the Trump administration for $20 million for his arrest and months-long detention by federal immigration authorities,according tothe Associated Press (AP). Khalil’s lawyers filed his claim Thursday, alleging he was falsely imprisoned, maliciously prosecuted and wrongly labeled as an anti-semite as the Trump administration sought to remove him from the country.(RELATED: One Of El Salvador’s ‘Most Wanted’ Nabbed In America’s Heartland)\n\n“I cannot describe the pain of that night,” Khalil said to the AP, speaking of his time in Immigration and Customs Enforcement (ICE) custody. “This is something I will never forgive.”\n\nKhalil reportedly plans to share any settlement money with other anti-Israel activists who’ve been targeted by the Trump administration. He also says he’d accept a formal apology and reforms to the White House’s deportation policies in lieu of a multi-million dollar settlement.\n\nNEW YORK, NEW YORK – JUNE 22: Palestinian activist Mahmoud Khalil, who was released from ICE detention, and his wife Noor Abdalla speak at a rally on the steps of Cathedral of St. John the Divine in Manhattan on June 22, 2025 in New York City. (Photo by Spencer Platt/Getty Images)\n\nThe lawsuit targets ICE, the Department of Homeland Security (DHS) and also the State Department.\n\nThe Trump administration — which has long argued that Khalil fomented the harassment of Jews on campusand conductedpro-Hamas activities — ripped his claims in response to the newly filed lawsuit.\n\n“Mahmoud Khalil’s claim that DHS officials branded him as an antisemite and terrorized him and his family is absurd,” Assistant DHS Secretary Tricia McLaughlin stated to the Daily Caller News Foundation. “It was Khalil who terrorized Jewish students on campus.”\n\n“He ‘branded’ himself as antisemite through his own hateful behavior and rhetoric,” McLaughlin said, adding that it’s a privilege to be granted a visa to live and study in the U.S. “The Trump Administration acted well within its statutory and constitutional authority to detain Khalil, as it does with any alien who advocates for violence, glorifies and supports terrorists, harasses Jews, and damages property.”\n\nAmid the Israel-Hamas war, major U.S. universities in 2024 becameoverrunwith leftist student protesters sympathetic to the Palestinian cause. Largely at the center of these student protests was Columbia University in New York City, which at one point was rocked with protests so violent that university officialswere forcedto call the New York Police Department to make arrests.\n\nKhalil — a graduate student living in the country on a non-immigrant student visa at the time of these events — positioned himself early on as the protest movement’s leader, speaking to media outlets and servingas an intermediarybetween Columbia and the demands of campus activists.\n\nIn a March lawsuit, nine American and Israeli Oct. 7 victims accused Khalil and other defendants of coordinating their efforts with Hamas since 2023,according toReuters. Khalil’s attorneys have maintained that he is not connected to the terrorist organization.\n\nICE agentsarrestedKhalil at his university home on March 8, becomingthe first of manyalleged pro-Hamas actors at U.S. universities to be detained. The Syrian-born activist was swiftly flown to an immigration detention center in Louisiana where he remained as a challenge to his arrest played out in court.\n\nHowever, Khalil scored a major victory when a New Jersey federal judgeorderedICE to release him from the Louisiana detention center in June, allowing him to walk free as his court case continues on.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contactlicensing@dailycallernewsfoundation.org."
    }
}