{
    "question": "In what ways might the Secret Service’s decision to suspend, rather than dismiss, six agents after the Butler rally attack influence perceptions of accountability, the agency’s reform efforts, and public trust?",
    "content": {
        "source_1": "Then-Republican candidate Trump is taken off the stage following an assassination attempt at a campaign event at Butler Farm Show Inc. in Butler, Pennsylvania, in July  2024. Photo: Rebecca Droke/AFP via Getty Images\n\nSix U.S. Secret Service agents were suspended in relation to their conduct concerning the assassination attempt on PresidentTrumpat a rally in Butler, Pennsylvania, last year,ABC Newsfirst reported Wednesday.\n\nThe big picture:USSS deputy director Matt Quinn toldCBS Newsthe personnel were placed on leave over operational failures in the July 13, 2024, rally shooting and that the suspensions varied from 10 to 42 days as they were disciplined in accordance with a federally mandated process.\n\nZoom out:Kimberly Cheatle resignedas Secret Service director following mounting bipartisan criticism and calls to step down after the Trump rally shooting that she described as the \"most significant operational failure of the Secret Service in decades.\"\n\nWhat they're saying:\"Given the shocking security failures that day, this is the absolute bare minimum,\" said Rep. Anna Paulina Luna (R-Fla.), who serves on the House Oversight Committee, in apostto X.\n\nEditor's note: This article has been updated with new details throughout.",
        "source_2": "The US Secret Service issued suspensions for six personnel over failings at one of Donald Trump's rallies last year, during which a gunman attempted to assassinate the Republican, an official has confirmed.\n\nThe gathering in Butler, Pennsylvania, when Matthew Crooks fired at Trump and killed another attendee, was an \"operational failure\", according to a Secret Service report released on Thursday - days before marking one year since the incident.\n\nOne of Crooks's bullets grazed the ear of Trump, who was then rushed to safety. The attacker was shot dead.\n\nIt is not clear when the staff suspensions were formally issued, and US media reports differ on whether or not they have already been served.\n\nThe staff were given penalties ranging from 10 to 42 days of leave without pay or benefits, the agency said.\n\n\"Secret Service is totally accountable for Butler,\" Matt Quinn, the service's deputy director, told the BBC's US partner CBS News. \"Butler was an operational failure and we are focused today on ensuring that it never happens again.\"\n\nQuinn, who was appointed to his role in May this year, added that he was \"laser-focused on fixing the root cause of the problem\", but the organisation would not \"fire our way out of this\".\n\nHe told CBS a number of improvements had already been made, involving military-grade drones and improved mobile command posts that could now be used by agents in the field.\n\nThe identities of the suspended staff and their roles on the day of the attack have not been disclosed.\n\nAmong the reforms the Secret Service said it has implemented are \"clear lines\" of accountability, improved information sharing with local law enforcement partners and the creation of an Aviation and Airspace Security division that is \"dedicated to maintaining the agency's critical aerial monitoring capabilities\".\n\nIn excerpts of a Fox News interview that will air on Saturday, Trump said that the US Secret Service \"had a bad day\" in Butler, but is \"satisfied\" with the investigation into the shooting.\n\n\"There were mistakes made. And that shouldn't have happened,\" Trump said in the interview.\n\nThe news comes just days before the anniversary of the attack on 13 July 2024. Rally attendee Corey Comperatore was killed and two other people injured.\n\nThe incident prompted the resignation of the service's then-director, Kimberly Cheatle.\n\nThe Secret Service has been under intense scrutiny for the last 12 months, and has faced sharp criticism from the US Congress.\n\nLast September, a 94-page Senate report found that security failures and lack of communication within the US Secret Service \"directly contributed\" to the incident, and that many issues remained unaddressed two months later.\n\nThe attack was also described as preventable in another report, published in December, by a House of Representatives taskforce. That paper identified the main lapse as being a failure to secure the rooftop from which Crooks opened fire.\n\nTrump, who was successfully re-elected in November, was provided with heightened security in the aftermath of the attack - ensuring that he received protection at a level above what is typical for a presidential candidate.\n\nIn September, he was again rushed to safety by Secret Service agents after a second would-be gunman lurked in bushes at Trump's golf course in Florida. The FBI described this, too, as an apparent assassination attempt.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nScientists who analysed fragments that crashed into a roof in Georgia, US, say it likely formed 4.56 billion years ago.\n\nTariffs, oversupply and teetotaling Gen-Zs have all contributed to the downfall of one of America's most iconic liquors.\n\nJen Pawol donated her hat to a baseball museum after her history-making game on Saturday.",
        "source_3": "Corey Comperatore's widow Helen sits down with Fox News correspondent Alexis McAdams.\n\nSix Secret Service agents were suspended without pay following a gunman's attempt to take PresidentDonald Trump'slife at a Pennsylvania rally last July, the agency confirmed to Fox News.\n\nThe suspensions affected supervisors and line-level agents, and ranged from 10 to 42 days without pay.\n\nThe disciplinary action took place in February, the Secret Service said, which confirmed the news because a Senate report on the failures in Butler, Pennsylvania, is set to be released any day.\n\nNo agents were fired, as the Secret Service told Fox News that the entire agency failed, rather than individuals.\n\nTRUMP DIRECTS SECRET SERVICE TO GIVE HIM ‘EVERY BIT OF INFORMATION’ ABOUT HIS ATTEMPTED ASSASSINS: REPORT\n\nRepublican candidate Donald Trump is seen with blood on his face surrounded by Secret Service agents as he is taken off the stage at a campaign event at Butler Farm Show Inc. in Butler, Pennsylvania, July 13, 2024.(Rebecca Droke/AFP via Getty Images)\n\nMatt Quinn, the agency's deputy director,told CBS Newson Wednesday that they \"weren't going to fire [their] way out of this,\" but did say they are \"laser focused on fixing the root cause of the problem.\"\n\nQuinn told the outlet that those who were suspended were placed in restricted roles with less responsibility once they returned to the job. He said the disciplinary actions were in accordance with a federally mandated process.\n\nThe agency faced heavy criticism following the security failure, which allowed gunman Thomas Crooks to open fire on the rally's stage inButler, Pennsylvania,on July 13, 2024.\n\nCorey Comperatore, a50-year-old firefighter, father and husbandattending the rally, was killed while Trump's ear was grazed by a bullet and two other men were injured by gunfire.\n\nThomas Matthew Crooks appeared to be armed and ready on a nearby roof at President Donald Trump's July 2024 rally in Butler, Pennsylvania.(Anna Moneymaker/Getty Images, left, Iron Clad USA, middle, Butler Township Police Department, to right, Fox News, bottom right. )\n\nFOX NATION REVEALS NEVER-BEFORE-SEEN FOOTAGE FROM TRUMP ASSASSINATION ATTEMPT IN BUTLER\n\n\"Secret Service is totally accountable for Butler,\" Quinn said to CBS. \"Butler was an operational failure and we are focused today on ensuring that it never happens again.\"\n\nHe also said the agency is focusing on the \"root cause\" of the operational failure and fixing \"the deficiencies that put us in that situation.\"\n\nSince the Butler rally, Quinn said the Secret Service has introduced a new fleet of military-grade drones and mobile command posts to improve radio communications with local law enforcement.\n\nPresident Donald Trump surrounded by U.S. Secret Service agents following an assassination attempt at his campaign rally in Butler, Pennsylvania, on July 13, 2024.(AP Photo/Evan Vucci)\n\nThe agency faced more criticism weeks later when a second assassination attempt on Trump took place in West Palm Beach, Florida. Though it was stopped, then-Secret Service Director Kimberly Cheatle resigned and the agency underwent several investigations andcongressional hearings.\n\nA bipartisan House task force released a 180-page report in December stating that the incident in Butler was \"preventable,\" citing \"preexisting\" leadership and training issues that \"created an environment\" where security failures were possible.\n\nIn the report, lawmakers also pointed out that the Secret Service did not coordinate or plan well with local law enforcement.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}