{
    "question": "How might the initial flooding and contested accounts of conditions at “Alligator Alcatraz” influence decisions about its operation and oversight?",
    "content": {
        "source_1": "Cuban reggaeton artist Leamsy La Figura, arrested last week in Miami-Dade on assault charges, was transferred to South Florida's new immigration detention facility known asAlligator Alcatrazin the Everglades, the singer confirmed in a phone call.\n\nHe and other detainees claim they are enduring inhumane conditions at the site, including lack of access to water, inadequate food and denial of religious rights.\n\nAlligator Alcatraz was built in a matter of days on ararely used municipal airportlocated about 50 miles west of the City of Miami. The first group of detainees arrived at the center on July 3, according to state Attorney GeneralJames Uthmeier.\n\nLa Figura, whose real name is Leamsy Isquierdo, was charged with aggravated assault with a deadly weapon and battery. He was initially held at theTurner Guilford Knight Correctional Center(TGK) before being transferred toAlligator Alcatraz.\n\nIn a phone call from inside the facility, La Figura described what he called horrific conditions.\n\n\"I am Leamsy La Figura. We've been here at Alcatraz since Friday. There's over 400 people here. There's no water to take a bath, it's been four days since I've taken a bath,\" he said.\n\nHe claimed the food at the immigration facility is scarce and unsanitary.\n\n\"They only brought a meal once a day and it had maggots. They never take off the lights for 24 hours. The mosquitoes are as big as elephants,\" La Figura said.\n\nOther detainees echoed La Figura's concerns, alleging violations of their basic rights.\n\n\"They're not respecting our human rights,\" one man said during the same call. \"We're human beings; we're not dogs. We're like rats in an experiment.\"\n\n\"I don't know their motive for doing this, if it's a form of torture. A lot of us have our residency documents and we don't understand why we're here,\" he added.\n\nA third detainee, who said he is Colombian, described deteriorating mental health and lack of access to necessary medical care.\n\n\"I'm on the edge of losing my mind. I've gone three days without taking my medicine,\" he said. \"It's impossible to sleep with this white light that's on all day.\"\n\n\"They took the Bible I had and they said here there is no right to religion. And my Bible is the one thing that keeps my faith, and now I'm losing my faith,\" he said.\n\nLa Figura's girlfriend said the couple shares a 4-year-old daughter.\n\nOn Tuesday, state officials responded to the allegations made by detainees at the facility, saying they are \"completely false.\"\n\n\"The reporting on the conditions in the facility is completely false. The facility meets all required standards and is in good working order,\" said Stephanie Hartman, director of communications for the Florida Division of Emergency Management.\n\nFDEM was the engine behind Alligator Alcatraz, using the state's emergency management tools and funding to build, staff and operate the detention facility.\n\nThe detention has faced intense criticism over human rights,environmental impact, oversight andthe legality of commandeering protected Everglades land.\n\nAnna McAllister joined the CBS 4 team as a reporter in December 2022 and is ecstatic to be back in South Florida.",
        "source_2": "Kate Plummer is a Newsweek reporter based in London, U.K. Her focus is on U.S. politics and national affairs, and she is particularly interested in the impact of social policy decisions on people as well as the finances of political campaigns, corruption, foreign policy, democratic processes and more. Prior to joining Newsweek, she covered U.K. politics extensively. Kate joined Newsweek in 2023 fromThe Independentand has also been published in multiple publications includingThe Timesand theDaily Mail. She has a B.A. in History from the University of Oxford and an M.A. in Magazine Journalism from City, University of London.\n\nYou can get in touch with Kate by emailingk.plummer@newsweek.com, or by following her on X at @kateeplummer.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nThe new migrant detention centerdubbed \"Alligator Alcatraz\"faced minor flooding within a day of it opening.\n\nPresidentDonald Trumpvisited the center in the Everglades, Florida, on Tuesday to mark its opening.\n\nAfter he left, a storm caused about an inch and a half of rain to fall on the facility, according to estimates from the National Weather Service in Miami.\n\nA good lil storm passed over us here at 'Alligator Alcatraz.’Here's what it looks & sounds like inside one of these tents.The state says the sites here are rated to withstand a category two hurricane (~120mph winds).pic.twitter.com/6SyY1hAvkK\n\nSince taking office in January, the second Trump administration has overseen a major immigration crackdown. The president has pledged sweeping crackdowns on border security, expanded deportation operations and an end to federal benefits for undocumented immigrants.\n\nTrump has vowed to deportupward of 11 million peoplefrom the country, meaning deportation facilities need to be expanded.\n\nThe new center, the brainchild of Florida Attorney General James Uthmeier, who dubbed it \"Alligator Alcatraz,\" is at the Dade-Collier Training and Transition Airport, a39-square-mile sitenear Big Cypress National Preserve that has a 10,000-foot asphalt runway and it is expected to hold 3,000 migrants.\n\nThe Trump administration said alligators and other animals will be in the surrounding wetlands to stop people from escaping.\n\nThe center has been criticized by environmentalists who are concerned about the damage to surrounding wildlife, as well as immigrant rights groups.\n\nThe rainstorm caused water to seep into the site and onto electrical cables on the floors, according to video posted online by Spectrum News reporter Jason Delgado.\n\nThe footage also showed puddles of water surrounding flagpoles inside the facility.\n\nThe Department of Homeland Security, on X, formerly Twitter, on Monday:\"We are working on cost-effective and innovative ways to deliver on the American people's mandate for mass deportations. Alligator Alcatraz will expand facilities and bed space in just days, thanks to our partnership with Florida.\"\n\nHomeland Security Secretary Kristi Noem, in a statement:\"Under President Trump's leadership, we are working at turbo speed to deliver cost-effective and innovative ways to deliver on the American people's mandate for mass deportations of criminal illegal aliens.\"\n\nKevin Guthrie, executive director of the Florida Division of Emergency Management, told reporters:\"For those people that don't think we're taking that into consideration, this is Florida, by the way. We have a hurricane plan.\"\n\nThe new facility will cost some $450 million a year to run, according to Homeland Security Secretary Kristi Noem.\n\nMeanwhile, two environmental charities havefiled a lawsuitto try to block the facility from opening.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nKate Plummer is a Newsweek reporter based in London, U.K. Her focus is on U.S. politics and national affairs, and she is particularly interested in the impact of social policy decisions on people as well as the finances of political campaigns, corruption, foreign policy, democratic processes and more. Prior to joining Newsweek, she covered U.K. politics extensively. Kate joined Newsweek in 2023 fromThe Independentand has also been published in multiple publications includingThe Timesand theDaily Mail. She has a B.A. in History from the University of Oxford and an M.A. in Magazine Journalism from City, University of London.\n\nYou can get in touch with Kate by emailingk.plummer@newsweek.com, or by following her on X at @kateeplummer.\n\nKate Plummer is a Newsweek reporter based in London, U.K. Her focus is on U.S. politics and national affairs, and she is particularly interested in the impact of social policy decisions on people as well as the finances of political campaigns, corruption, foreign policy, democratic processes and more. Prior to joining Newsweek, she covered U.K. politics extensively. Kate joined Newsweek in 2023 fromThe Independentand has also been published in multiple publications includingThe Timesand theDaily Mail. She has a B.A. in History from the University of Oxford and an M.A. in Magazine Journalism from City, University of London.\n\nYou can get in touch with Kate by emailingk.plummer@newsweek.com, or by following her on X at @kateeplummer.\n\nKate Plummer is a Newsweek reporter based in London, U.K. Her focus is on U.S. politics and national affairs, and                                    ...Read more",
        "source_3": "OCHOPEE, Fla. (CBS12) —The Department of Homeland Security (DHS) is denying reports of improper living conditions for detainees at Alligator Alcatraz after reports of a hospitalization surfaced.\n\nReports this weekhave claimed that the detainees at the detention facility in the Florida Everglades are surrounded by toilets that don't flush, temperatures ranging from freezing to sweltering, little to no access to showers, less confidential calls with an attorney, and even a hospitalization, according to theMiami Herald.\n\nHowever, DHS took to X to debunk those claims, stating that the detainees are properly cared for.\n\nFurthermore, the Assistant Secretary of the Department of Homeland Security,Tricia McLaughlin, said on X that no detainees at Alligator Alcatraz have been hospitalized. She continued to state that one was transported but was returned to the detention center in an hour and a half.\n\nSee also:Allegations of poor conditions at Alligator Alcatraz prompt inquiries to Florida officials\n\nAccording to our news partners at CBS News Miami, one of the detainees living in poor conditions at the detention center is Cuban reggaeton artist Leamsy La Figura, who was arrested in Miami-Dade County for assault. He claims there’s no water to shower, the lights stay on all day, and the food is limited and sometimes spoiled.\n\nIn a phone call to CBS News Miami, La Figura described the conditions he and the other detainees are facing.\n\n\"I am Leamsy La Figura. We've been here at Alcatraz since Friday. There's over 400 people here. There's no water to take a bath, it's been four days since I've taken a bath,\" he said.\n\nThe facility is run by the state of Florida. CBS News Miami has reached out to the Florida Department of Emergency Management (FDEM) for comment on the alleged conditions.\n\nAdditionally, CBS News Miami said that Mayor Daniella Levine Cava of Miami-Dade isasking for accessto the detention facility due to concerns over reported deaths and dangerous conditions at immigration centers across the state.\n\nMayor Levine Cava has said that a total of five people have died while in immigration custody in Florida so far.\n\nFind more ways to stay up to date with your latest local news.Sign up for our newsletterto get the day's top headlines delivered right to your inbox.Subscribe to our YouTube channelfor the biggest stories and can't miss video."
    }
}