{
    "question": "How can officials reconcile reports of timely NWS warnings with the lack of evacuation at high-risk sites like Camp Mystic, and what changes to forecasting, staffing and coordination, communication practices, and flood-control infrastructure should be prioritized to prevent similar tragedies?",
    "content": {
        "source_1": "The Texas rains hadn’t even slowed before the debate began about why forecasts had underestimated thedevastating flooding over Independence Dayweekend.\n\nLocal and state officials, social media users and even the meteorology community raised questions. What were the National Weather Service forecasts? Why is it so hard to know where rain will fall? Did staff reductions at the weather service and other budget cuts by the Trump administration contribute to the catastrophe? What role did weather balloons play in the storm forecasts?\n\nAnswers to some of these questions and many others may never be adequately answered, especially for the families of dozens of children swept away by floodwaters.\n\nAt least 81 people died between July 4 and 6 and dozens more were injured or remain missing, state officials said. On a weekend when families often celebrate with cookouts and fireworks, these families, overwhelmed with grief, were providing DNA samples so a state laboratory could rapidly identify victims.\n\nA series of circumstances,colliding at the worst possible location and time, caused the tremendous flooding, several meteorologists told USA TODAY. During a July 6 news conference, Texas state officials said there would bemuch to discuss in the weeksahead.\n\nA few things are known, including how difficult it remains to pinpoint where thunderstorms will drop their heaviest rain, what the weather service said and when, and staffing levels at two local forecast offices.\n\nThe horrific tragedy arrived amid a maelstrom already brewing over the weather service, its parent agency and the Trump administration’s budget cuts.\n\nIt’s “clear that many people are allowing their desire to score political points to color their insights and opinions on this tragedy,\" Alan Gerard, who retired earlier this year from theNational Severe Storms Laboratory,wrote in his Substack blog on July 6.\n\n“The National Weather Service office did everything they should do from everything I can tell,” said Jeff Masters, co-founder of Weather Underground, a commercial forecasting agency, and a former hurricane scientist with the NOAA Hurricane Hunters.\n\nDespite the recent cuts to the National Oceanic and Atmospheric Administration, the weather service performed well in the Texas tragedy and the recent deadly flooding in Kentucky, Masters said. “It reminds us how important it is to have talented, experienced people at a well-funded National Weather Service.”\n\n“But we are pushing our luck,\" he noted,\" if we think the cuts at NOAA won’t cause a breakdown in our ability to get people out of harm’s way in the future.”\n\nAlthough the warnings arrived less than 24 hours before the flooding started, long-time weather service veterans and regional experts say that's not all that unusual in this region. It's a known shortcoming of the localized rain models forecasters use. They can't yet pinpoint exactly where intense rain might fall and when in an individual community.\n\nOne expert, Texas State Climatologist John Nielsen-Gammon, said it appears the weather service employees in Austin/San Antonio did what they could, based on the available information.\n\n\"From what I saw, the warnings were pretty timely,\" said Nielsen-Gammon, a meteorology professor at Texas A&M University.\n\nThe weather service office first advised on July 1 and 2 that a very moist air mass was moving in that would increase rain chances across south-central Texas with heavy rain at times that could lead to minor local flooding.An early morning forecast on July 3 by the weather service's Weather Prediction Center said the region should expect “unseasonably moist” air that could bring 1 to 2 inches of rain an hour and lead to flooding, with approaching storms tapping into abundant tropical moisture.\n\nAs the day progressed, a clearer picture emerged of how weather systems were interacting above Texas to form storms. An “urgent” flood watch at 1:18 p.m. on July 3 warned heavy rain, with isolated amounts of 5 to 7 inches, could cause flash flooding and “excessive” runoff that could flood rivers and streams. The watch covered eight counties, including Kerr and Bandera, where some of the heaviest flooding occurred.\n\nBy 7:02 p.m., the weather prediction center warned that leftover bits of Tropical Storm Barry, near-record moisture and an unstable atmosphere meant any storms that formed could be self-sustaining, with a potential for rain rates of more than 3 inches an hour, and they could rain over the same area again and again. It stated: “Considerable flash flooding this evening is possible.\"\n\nAt 1:14 a.m. on July 4, the weather service issued a \"Flash Flood Warning\" for central Kerr County and northwestern Bandera County. Almost simultaneously, water flow began increasing dramatically on the Guadalupe River at Hunt, Texas.\n\n\"This pleasing stream had a flow rate of 53 gallons per second at midnight on July 4,\" said Nielsen-Gammon. At 3 a.m., it was flowing at 264 gallons per second. Between 3 a.m. and 3:30 a.m., the water flow jumped to 125,000 gallons per second. Within four hours of the initial rise, the river level jumped 21.8 feet and was flowing at 900,000 gallons per second.\n\nPresident Donald Trump campaigned on cutting the federal bureaucracy and reducing the budget. His administration, including the Office of Management and Budget and the Department of Governmental Efficiency, has been mission-focused on doing so.\n\nThe sweeping cuts left many federal offices short-staffed and demoralized,according to recent retirees.\n\nMany remaining employees, including those who declined to speak on the record for fear of retribution, say employees still fear more jobs will be lost in a reduction in force. Federal agencies were required to prepare a plan for making further reductions, but a federal judge in California ruled in May that the job cuts could not move forward.\n\nThe weather service office in Austin/San Antonio oversees much of the Hill Country area where the flooding took place. Of the 26 staff positions in that office, six are vacant at the moment, including two senior members, said Victor Murphy, a recently retired weather service meteorologist in Texas. One of those is the warning coordination meteorologist who oversees emergency warnings and works with local officials on communicating around such events.\n\nDid the cuts play any role in the recent tragedy? Murphy wondered out loud. \"I don’t know…The fact is that the office had record flooding two days in a row.”\n\nThe San Angelo, Texas, office is down four positions, including a staff forecaster, a lead hydrologist and its meteorologist in charge, said Tom Fahy,legislative director for the National Weather ServiceEmployees Organization.\n\nWeather service forecasters often become \"an easy target for people's wrath,\" when people are looking for someone to blame, Fahy said.\n\n“The real blame is the Trump Administration budget cuts to NWS and FEMA that cut off coordination planning with local emergency management officials,” he said. “Even during Trump's first term, NWS managers would plan, practice and train their combined teams for increased cooperation. All that ended when Trump was inaugurated in 2025.”\n\nTrump said July 6 that he doesn’t think the federal government needs to rehire weather service meteorologists in the wake of catastrophic Texas flooding.\n\n“I would think not,” Trump told reporters when asked about rehiring weather forecasters, adding that flooding “happened in seconds. Nobody expected it.”\n\nWhen asked if he would investigate whether the cuts left key vacancies in the weather service or emergency coordination, Trump said he \"wouldn't blame (former President Joe) Biden for it either. I would just say this is a 100-year catastrophe, and it's just so horrible for all.\"\n\nAt a news conference on July 5, Nim Kidd, chief of the Texas Division of Emergency Management, said: \"The original forecast that we received on Wednesday from the National Weather Service predicted 3 to 6 inches of rain in the Concho valley and 4 to 8 inches in the Hill Country.\"\n\n\"The amount of rain that fell in this specific location was never in any of those forecasts,\" Kidd said.\n\nRainfall estimates in these extreme rainfall events have fallen short before, frustrating emergency managers, forecasters and even members of Congress, who approved measures in 2021 and 2022 to improve rainfall modeling and estimates of maximum possible precipitation within any given time frame.\n\nAs the weather service looked at their computers on July 3, the models they use for forecasting thunderstorms wouldn't come together with a consensus on where the greatest rain would fall, according to their discussions. Many showed the potential for extreme rainfall somewhere in central Texas, while others showed almost nothing happening, Nielsen-Gammon said. \"Where it was going to develop would depend on the details of the individual thunderstorms that popped up.\"\n\nPinpointing localized extreme rain remains \"a very difficult challenge,\" Gerard said. Any time you have this type of environment, there’s going to be a chance that local areas are going to get more rain than anticipated.\"\n\nRainfall in a storm is “controlled by very small-scale processes that are happening within the storm,” said Gerard, now CEO of weather consulting company Balanced Weather. “We don’t have the resolution of modeling to be able to forecast that yet.”\n\nThe storms laboratory is working to develop higher resolution modeling, he said, but it's on the chopping block in the president's proposed budget.\n\nWeather balloon launches measure moisture up through the atmosphere to help predict how much is available for rain. The better the data, the better the outcome, said Murphy, the recently retired Texas meteorologist. \"You find out from a sounding what’s up 20,000, 30,000, or 40,000 feet. The only way to measure that is with a balloon.”\n\nHowever, staffing shortages at local weather service offices across the United States have forced the limiting or cancellation of numerous weather balloon launches. Of 11 locations in Texas and surrounding states that were launching in the early spring, only six of the sites now launch balloons on any given morning, Murphy said.\n\nThere was only one weather balloon launch within 200 miles of the flooded area, Nielsen-Gammon said.\n\nHowever, that one weather balloon proved its worth, the experts said, providing essential information that helped weather service forecasters see the increased chances for rain.\n\nLaunched remotely from an automated site in Del Rio, Texas, Murphy said it's \"the only one of its kind in the region.”\n\nBut the federal cutbacks and rising number of climate disasters mean the public is likely to blame someone for every botched forecast and missed opportunity to warn ‒ whether deservedly or not.\n\nOn July 7, White House Press Secretary Karoline Leavitt defended the president and the weather service’s performance.\n\n“Blaming President Trump for these floods is a depraved lie and it serves no purpose during this time of national mourning,\" Leavitt said. \"The National Weather Service did its job.\"\n\nContributing: Zac Anderson and Joey Garrison, USA TODAY\n\nDinah Voyles Pulver, a national correspondent for USA TODAY, writes about climate change, violent weather and other news. Reach her at dpulver@usatoday.com or @dinahvp on Bluesky or X or dinahvp.77 on Signal.",
        "source_2": "Khaleda Rahman is Newsweek's National Correspondent based in London, UK. Her focus is reporting on education and national news. Khaleda joined Newsweek in 2019 and had previously worked at the MailOnline in London, New York and Sydney. She is a graduate of University College London. Languages: English. You can get in touch with Khaleda by emailingk.rahman@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nCatastrophic flooding in Texas has sparked fresh scrutiny about the Trump administration's cuts to the National Oceanic and Atmospheric Administration (NOAA) and National Weather Service (NWS).\n\nSeveral experts have said that NWS did a \"solid\" job in warning about the flooding, but questions remain about how many people they reached and whether critical vacancies at forecast offices were a factor.\n\nThe NWS said in a statement toNewsweekthat flash flood warnings had been issued on Thursday night and in the early hours on Friday, giving \"preliminary lead times of more than three hours before warning criteria were met.\"\n\nWhite House spokesperson Abigail Jackson toldNewsweekthat \"false claims about the NWS have been repeatedly debunked by meteorologists, experts, and other public reporting.\"\n\nAt least 82 people, including children at summer camps, died after floodwaters surged through Texas Hill Country, a central part of the state that is prone to flash floods, starting on Friday. Many are still missing, and officials have said the death toll is sure to rise.\n\nWith a massive search effort underway, some have raised questions about whether cuts to the NWS played a role in the tragedy after it was reported that the two NWS offices mostly closely involved in forecasting and warning about the flooding along the Guadalupe River—Austin-San Antonio and San Angelo—are missing key staff.\n\nThe NWS said last month thatit would be hiring new meteorologists and specialiststo \"stabilize\" operations after the Trump administration's job cuts.NBCNews reported in May that the NWS was scrambling to reassign staffers internally and fill more than 150 positions to cover critical roles. The Associated Press earlier reported that nearly half of NWS offices had vacancy rates of 20 percent or more, with some locations facing even more severe staffing shortages.\n\nSome Texas officials suggested that forecasts from the NWS underestimated the rainfall.\n\nTexas Emergency Management Chief W. Nim Kidd said during a news conference on Friday that the \"original forecast that we received on Wednesday from the National Weather Service predicted 3 to 6 inches of rain in the Concho Valley and 4 to 8 inches of rain in the Hill Country.\n\n\"The amount of rain that fell in this specific location was never in any of those forecasts, nonetheless.\"\n\nDalton Rice, the city manager for Kerrville, said the storm \"dumped more rain than what was forecast.\"\n\nRepresentativeJoaquin Castro, a Texas Democrat, said onCNN'sState of the Unionon Sunday that an investigation should be carried out to determine if the job cuts played a role in people in the flood zone not being prepared.\n\nBut PresidentDonald Trumprejected the idea of an investigation into whether his administration's cuts to the NWS left key vacancies.\n\nTom Fahy, the legislative director for the NWS employees' union, told CNN that he thinks the forecast offices had \"adequate staffing and resources.\" But he said the Austin-San Antonio office is missing a warning coordination meteorologist, who serves as a crucial link between forecasters and emergency managers.\n\nJason Runyen, a meteorologist with the NWS, told AP that the NWS office in New Braunfels, which delivers forecasts for Austin, San Antonio and the surrounding areas, had extra staff on duty during the storms. While it usually has two forecasters on duty during clear weather, they had up to five during the storms, Runyen said.\n\nAlan Gerard, former director of the analysis and understanding branch at the National Severe Storms Laboratory of the NOAA, wrote in a Substack post that \"just as what I have been able to see about this event shows me the NWS did a solid job, similarly there is little evidence that any of the recent cuts to NOAA/NWS negatively impacted services for this event, regardless of what may be being said on social media.\"\n\nHouston-based meteorologist Matt Lanza wrote in a Substack post that there was \"absolutely nothing\" to suggest that current staffing or budget issues at the NOAA or NWS played a role.\n\nThe NWS saidin a statement toNewsweekthat it is \"heartbroken by the tragic loss of life in Kerr County. On July 3, the NWS office in Austin/San Antonio, TX conducted forecast briefings for emergency management in the morning and issued a Flood Watch in the early afternoon. Flash Flood Warnings were issued on the night of July 3 and in the early morning of July 4, giving preliminary lead times of more than three hours before warning criteria were met.\n\n\"The National Weather Service remains committed to our mission to serve the American public through our forecasts and decision support services.\"\n\nWhite House spokesperson Abigail Jackson toldNewsweek:\"False claims about the NWS have been repeatedly debunked by meteorologists, experts, and other public reporting. The NWS did their job, even issuing a flood watch more than 12 hours in advance. The Trump Administration is grateful to the first responders who sprang into action to save hundreds lives during this catastrophe, and will continue to help the great state of Texas in their recovery efforts.\"\n\nRepresentative Joaquin Castro, a Texas Democrat, on CNN:\"I don't think it's helpful to have missing key personnel from the National Weather Service not in place to help prevent these tragedies.\"\n\nHouston-based meteorologist Matt Lanza,in a Substack post:\"In this particular case, we have seen absolutely nothing to suggest that current staffing or budget issues within NOAA and the NWS played any role at all in this event. Anyone using this event to claim that is being dishonest. There are many places you can go with expressing thoughts on the current and proposed cuts. We've been very vocal about them here. But this is not the right event for those takes.\"\n\nAvery Tomasco, a meteorologist atCBSAustin, on X:\"All I'll say is this. The National Weather Service issued a flood watch for Kerr County more than 12 hours ahead of the catastrophic flood. A flash flood warning was issued for Hunt & Ingram 3 HOURS before the Guadalupe started to climb. They did their job and they did it well.\"\n\nJohn Morales, a Florida-based meteorologist, wrote on Xthat the cuts \"did not impact the warning process, but may have impacted coordination.\"\n\nPresident Donald Trump told reporters, after being asked on Sunday if he thinks the government needs to hire back meteorologists whose jobs were cut:\"I would think not. This was a thing that happened in seconds. Nobody expected it. Nobody saw it. Very talented people are there, they didn't see it. It's, I guess they said, once in 100 years. They've never seen anything like this.\"\n\nLast week, the Trump administration released a proposed 2026 budget for the NOAA, which calls for funding cuts. The cuts, if implemented, would not take effect until the next fiscal year begins on October 1, 2025.\n\nMeanwhile, multiple local, state and federal agencies are continuing to search for survivors in Texas. Trump said he would likely visit the flood zone on Friday.\n\nUpdate 7/7/25, 10:56 a.m. ET: This article was updated with comment from White House spokesperson Abigail Jackson.\n\nKhaleda Rahman is Newsweek's National Correspondent based in London, UK. Her focus is reporting on education and national news. Khaleda joined Newsweek in 2019 and had previously worked at the MailOnline in London, New York and Sydney. She is a graduate of University College London. Languages: English. You can get in touch with Khaleda by emailingk.rahman@newsweek.com\n\nKhaleda Rahman is Newsweek's National Correspondent based in London, UK. Her focus is reporting on education and national news. Khaleda joined Newsweek in 2019 and had previously worked at the MailOnline in London, New York and Sydney. She is a graduate of University College London. Languages: English. You can get in touch with Khaleda by emailingk.rahman@newsweek.com\n\nKhaleda Rahman is Newsweek's National Correspondent based in London, UK. Her focus is reporting on education and national news. Khaleda                                    ...Read more",
        "source_3": "Flooding is nothing new to the Hill Country region of Texas, where, in 1987, heavy rains caused the Guadalupe River to swell and spill over, stranding more than 30 people who needed to be rescued — and killing 10 teens from the Pot O’ Gold Christian Camp.\n\nIn the decades since, local officials have sought public and private grants to prevent future flooding tragedies, according to reports — raising questions about how Friday’s devastating storm surge along the Guadalupe took so many lives.\n\nA $1 million grant approved in 2017 funded the upgrade of high-water detection systems along the Guadalupe River, and paid for the installation of 10 new gauges.\n\nThree years ago, PepsiCo and Frito-Lay awarded a $1.2 million grant to the Guadalupe-Blanco River Authority, or the GBRA, which strives to conserve and protect the water resources of the Guadalupe River Basin.\n\nThe GBRA was established by the Texas Legislature in 1933.\n\nTwo 60-year-old Goff Bayou radial gates, which regulated periodic flooding and high tides, were replaced with the grant.\n\n“The structure’s resiliency to withstand extreme weather conditions and climate variability will be enhanced,”the companies boastedin a news release.\n\nOfficials have also been restoring area wetlands as a way to enhance natural flood management, and money has been spent on improved investments in drainage systems and other flood control infrastructure.\n\nBut the efforts apparently failed to prevent Friday’s deadly floods, in which 43 people, including 15 children, were killed when the Guadalupe again surged over its banks.\n\nTexas officials pointed fingers at the National Weather Service, which they said issued forecasts earlier in the week downplaying the impending storm and its severity.\n\n“The original forecast that we received Wednesday from the National Weather Service predicted 3 to 6 inches of rain in the Concho Valley and 4 to 8 inches in the Hill Country,” offered Texas Emergency Management Chief W. Nim Kiddat a news conference Friday.\n\n“The amount of rain that fell at this specific location was never in any of those forecasts,” Kidd added.\n\nBut in a statement toNBC News, the NWS said it was “heartbroken by the tragic loss of life in Kerr County,” and added it had issued flash flood warnings the night of July 3 and then again the morning of July 4.\n\nTom Fahy, legislative director for the National Weather Service Employees Organization, said local NWS were adequately staffed and “issued timely forecasts and warnings leading up to the storm.”"
    }
}