{
    "question": "How might the IRS’s decision to permit houses of worship to endorse political candidates while retaining tax-exempt status influence the relationship between faith communities, campaign activity, and public trust in elections?",
    "content": {
        "source_1": "A local resident leaves a church after voting in an election in Cumming, Iowa.Charlie Neibergall/APhide caption\n\nIn a break with decades of tradition, the Internal Revenue Service says it will allow houses of worship to endorse candidates for political office without losing their tax-exempt status.\n\nThe surprise announcement came in acourt documentfiled on Monday.\n\nSince 1954, a provision in the tax code called the Johnson Amendment says that churches and other nonprofit organizations could lose their tax-exempt status if they participate in, or intervene in \"any political campaign on behalf of (or in opposition to) any candidate for public office.\"\n\nThe National Religious Broadcasters and several churches sued the IRS over the rule, arguing that it infringes on their First Amendment rights to the freedom of speech and the free exercise of religion.\n\nThe IRS rarely enforced the rule. During President Trump's first term,he promised to\"get rid of and totally destroy the Johnson Amendment and allow our representatives of faith to speak freely and without fear of retribution.\"\n\nIn Monday's court filing, the IRS didn't go that far. But it did say that when a house of worship \"in good faith speaks to its congregation, through its customary channels of communication on matters of faith in connection with religious services, concerning electoral politics viewed through the lens of religious faith\" it neither participates nor intervenes in a political campaign.\n\nRather, the IRS compared religious institutions' endorsement of candidates to a \"family discussion.\"\n\n\"Thus, communications from a house of worship to its congregation in connection with religious services through its usual channels of communication on matters of faith do not run afoul of the Johnson Amendment as properly interpreted.\"\n\nThe IRS has rarely punished houses of worship for endorsements during religious services, though the agency has investigated churches over alleged Johnson Amendment violations. In April, Robert Jeffress, pastor of First Baptist Church in Dallas,told RNSthat his church spent \"hundreds of thousands of dollars\" during an IRS investigation.\n\n\"The case was ultimately resolved in our favor,\" he said. Jeffress also said he'd been with Trump during a meeting where several pastors also spoke about being investigated over alleged Johnson Amendment violations. During his first term in office, Trump signed an executive order designed to give churches more leeway under IRS rules.\n\nStill, only one church has ever lost its tax exemption over politics. In 1992, a church in New York took out ads opposing Bill Clinton,leading to the lossof its tax exemption.\n\nThe federal court filing is part of a proposed settlement of alawsuit filedby the National Religious Broadcasters and a pair of Texas churches that sought to overturn the Johnson Amendment.\n\nThose groups argued that some nonprofit newspapers and other publications have been allowed to endorse candidates without running afoul of the IRS, while IRS rules barred churches and other nonprofits from doing the same.\n\n\"Plaintiffs believe that nonprofit newspapers have a clear constitutional right to make such endorsements or statements,\" wrote lawyers for the plaintiffs in a complaint filed last August in the U.S. District Court of the Eastern District of Texas, Tyler Division. \"Plaintiffs simply contend that they should also have the same freedom of speech.\"\n\nThe NRB declined to comment about the proposed settlement. A spokesperson said the group was waiting to see if the judge approves the settlement.\n\nThe proposed settlement would bar the IRS from requiring Sand Springs Church in Athens, Texas, and First Baptist Church in Waskom, Texas, from having to abide by the Johnson Amendment, both now and in the future. Both parties would pay their own legal bills. Neither side would be allowed to appeal.\n\nThe plaintiffs also asked the court to rule that the Johnson Amendment's ban on political speech by nonprofits is unconstitutional.\n\nBut according to Sam Brunson, a professor at Loyola University Chicago's law school and an expert on tax law, the IRS' legal agreement ultimately may not change much about how the Johnson Amendment already functions in practice.\n\n\"This doesn't really represent a change in the 70 years that the Johnson Amendment has been law,\" he said. \"It's been enforced once against a church, and you see a lot of cases of churches trying to jump in and get their exemptions revoked so that they can challenge the constitutionality. And up until now, the IRS hasn't been willing to do that.\"\n\nEven so, Brunson said the legal filing — while narrowly tailored to the plaintiffs in question — may give other religious groups confidence that public endorsements won't result in a challenge to their tax-exempt status.\n\nChristian legal groups have long sought to overturn the Johnson Amendment. For years Alliance Defending Freedom, one such group, organized \"pulpit freedom\" Sundays designed to have preachers violate IRS rules by endorsing candidates from the pulpit. But those efforts were futile and the ADF no longer runs Pulpit Sunday initiatives.\n\nAmericans United for Separation of Church and State urged the judge in the case to reject the settlement.\n\n\"Weakening this law would undermine houses of worship and nonprofits by transforming them into political action committees, flooding our elections with even more dark money,\" Americans United said in a statement.\n\nAmericans — including religious Americans — generally take a dim view of political endorsements in the pulpit.\n\nAccording to an analysis of 2023 polling provided to RNS by the Public Religion Research Institute, majorities of all major religious groups oppose allowing places of worship to endorse political candidates while retaining their tax-exempt status. That includes white evangelicals (62%) as well as Black Protestants (59%), white mainline or nonevangelical Protestants (77%), white Catholics (79%), Hispanic Catholics (78%), Hispanic Protestants (72%) and Jewish Americans (77%).\n\nResearchers noted opposition to the idea among white evangelicals remains virtually unchanged since 2017, when they last polled on the topic.\n\nA2019 surveyby Pew Research found that 76% of Americans and 70% of Christians say clergy should not endorse candidates from the pulpit, though evangelicals (62%) and Black Protestants (55%) are less likely to disapprove. Nearly two-thirds of Americans wanted churches to stay out of politics.\n\nThis story was produced through a collaboration between NPR and Religion News Service.",
        "source_2": "The Internal Revenue Service has agreed to allow church officials to make statements supporting political candidates.\n\nThe Johnson Amendment, in place since 1954, restricts tax-exempt organizations such as churches from endorsing or opposing political candidates.\n\nThere has been longstanding political discussion over the Johnson Amendment. President Trump has previously advocated for its repeal.\n\nThe Internal Revenue Service will now allow church officials to make statements in support of political candidates. The agency filed a jointcourt filingwith an organization suing them in order to strike a deal.\n\nNational Religious Broadcasters (NRB) is an Evangelical media group that filed suit against the IRS over theJohnson Amendment.\n\nThe NRBfiled suitin August 2024 over the Johnson Amendment, which has been in place since 1954. It was named after then-senator and future President Lyndon B. Johnson.\n\nThat amendment to the U.S. tax code prohibits tax-exempt organizations, like churches, from endorsing or opposing any political candidate.\n\nDownload the SAN app today to stay up-to-date with Unbiased. Straight Facts™.\n\nThe NRB and its fellow plaintiffs argued that the amendment violates their First Amendment rights, including freedom of speech and freedom of religion.\n\n“For too long, churches have been instructed to remain silent on pressing matters of conscience and conviction during election season or risk their 501(c)(3) status,” NRB President & CEO Troy A. Miller said in astatement.“We believe that all nonprofits should have the constitutional right to freely express their point of view on candidates, elections, and issues on the ballot.”\n\nThe two sides have now filed a joint court filing, aiming to bring the suit to a close.\n\nThe plaintiffs had originally asked the courts to rule that all nonprofits, religious or not, were free to endorse political candidates.\n\nInstead, according to the new filing, the IRS agreed to carve outs only for houses of worship. They compared political discussion in houses of worship to “a family discussion concerning candidates.”\n\n“Communications from a house of worship to its congregation in connection with religious services through its usual channels of communication on matters of faith do not run afoul of the Johnson Amendment as properly interpreted,” the IRS said in the filing.\n\nThe Johnson Amendment first came into play when Johnson ran for reelection in Texas in 1954. His campaign wasbeing attackedby nonprofit groups like the Facts Forum and the Committee for Constitutional Government, who were using tactics similar to Sen. Joseph McCarthy, the man behind theRed Scare.\n\nThe concern is that politicians could use nonprofits as a way to funnel campaign money tax-free.\n\n“This court filing is deeply concerning, furthering an assault on the bedrock principle that charitable organizations must remain nonpartisan in law, fact, and purpose in order to serve their missions and communities,” saidDiane Yentel, Pres. and CEO of the National Council of Nonprofits, which represents around 30,000 groups. “This action – long sought by President Trump – is not about religion or free speech, but about radically altering campaign finance laws.”\n\nPresident Trump hassaid in the pasthe’d like to completely get rid of the Johnson Amendment. He has also endorsed placing theTen Commandmentsin schools andmade over $1.3 millionselling his own Bibles last year.\n\nHe’s also received support from evangelical leaders on the campaign trail, like Billy Graham’s son,Franklin Graham,andLiberty University President Jerry Falwell, Jr. That’s partly because the IRS hasrarely enforcedthe Johnson Amendment to begin with.Earlier this year, two Republican congressmenintroduced billsin the House and Senate to fully repeal the Johnson Amendment. Both are currently sitting on different committees.\n\nTHE I-R-S SAYS CHURCH OFFICIALS CAN ENDORSE POLITICAL CANDIDATES WITHOUT LOSING TAX-EXEMPT STATUS.\n\nTHE I-R-S FILED A JOINT COURT FILING WITH NATIONAL RELIGIOUS BROADCASTERS, AN EVANGELICAL MEDIA GROUP.\n\nTHAT GROUP HAD FILED A LAWSUIT AGAINST THE I-R-S OVER THE 19-54 JOHNSON AMENDMENT.\n\nTHAT AMENDMENT PROHIBITS TAX-EXEMPT ORGANIZATIONS – LIKE CHURCHES – FROM ENDORSING POLITICAL CANDIDATES.\n\nTHE NATIONAL RELIGIOUS BROADCASTERS AND FELLOW PLAINTIFFS CLAIMED THE AMENDMENT VIOLATED THEIR FIRST AMENDMENT RIGHTS.\n\nTHE AGREEMENT IN THE COURT FILING KEEPS THE JOHNSON AMENDMENT IN PLACE,.. BUT CARVES AN EXEMPTION FOR HOUSES OF WORSHIP.\n\nTHE DECISION HAS BROUGHT SOME CONCERNS OVER USING NONPROFITS TO FUNNEL CAMPAIGN MONEY TAX-FREE.\n\nDIANE YENTEL, PRESIDENT AND C-E-O OF THE NATIONAL COUNCIL OF NONPROFITS SAID QUOTE, “THIS ACTION – LONG SOUGHT BY PRESIDENT TRUMP – IS NOT ABOUT RELIGION OR FREE SPEECH, BUT ABOUT RADICALLY ALTERING CAMPAIGN FINANCE LAWS.”\n\nPRESIDENT TRUMP HAS SAID HE’D LIKE TO REPEAL THE JOHNSON AMENDMENT ALTOGETHER.\n\nChanges in the Internal Revenue Service’s interpretation of the Johnson Amendment will allow church officials to make political endorsements, raising questions about the intersection of religious freedom, tax law and political activity among nonprofit organizations.\n\nThe IRS's agreement to allow church officials to endorse political candidates challenges longstanding restrictions on political activity by religious organizations and could affect the nature of religious influence in public elections.\n\nPlaintiffs like the National Religious Broadcasters argue that restrictions on political speech by churches infringe on freedom of speech and religion, highlighting ongoing debates about constitutional rights and their application to tax-exempt organizations.\n\nAltering enforcement of the Johnson Amendment has provoked concerns, as expressed by the National Council of Nonprofits, about preserving the nonpartisan status of charitable organizations and preventing potential misuse of tax-exempt status in political campaigns.\n\nSynthesized coverage insights across39media outlets\n\nMultiple surveys highlighted in the articles indicate that a substantial majority of Americans oppose political endorsements from houses of worship. According to a 2019 Pew Research Center survey, 76% of Americans, including 70% of Christians, believe clergy should not endorse political candidates from the pulpit. Among various religious groups, opposition ranges from 62% to nearly 80%.\n\nHistorically, American churches were deeply involved in political and social movements before the Johnson Amendment, notably in the abolition and civil rights eras. The Amendment aimed to formalize the distinction between political and charitable/religious activity. Few direct legal challenges succeeded in overturning it, but recent decades have seen renewed activism to change or clarify its scope.\n\nCritics of the IRS's shift, such as Americans United for Separation of Church and State, argue that this reinterpretation threatens to turn religious entities into partisan political actors and sources of \"dark money\" in elections. They warn that the new policy could undermine public trust in both charitable organizations and the electoral process.\n\n'Time to recruit some churches': Experts blast new rules on pulpit politics\n\nPastors Who Endorse Political Candidates Shouldn't Lose Tax-exempt Status, IRS and Evangelical Media Group Say in Joint Court Filing – Bucks County Beacon\n\nPastors who endorse political candidates shouldn't lose tax-exempt status, IRS says in filing\n\nPastors who endorse political candidates shouldn’t lose tax-exempt status, IRS says in filing\n\nIRS says churches whose pastors endorse candidates from pulpit shouldn't lose tax-exempt status\n\nPastors who endorse political candidates shouldn't lose tax-exempt status, IRS says in filing\n\nIRS says churches can endorse candidates from the pulpit\n\nPastors who endorse political candidates shouldn't lose tax-exempt status, IRS says in filing\n\nPastors Who Endorse Political Candidates Shouldn't Lose Tax-Exempt Status, IRS Says in Filing\n\nPastors who endorse political candidates shouldn't lose tax-exempt status, IRS says in filing\n\nPastors who endorse political candidates shouldn't lose tax-exempt status, IRS says in filing\n\nPastors who endorse political candidates shouldn't lose tax-exempt status, IRS says in filing\n\nPastors who endorse political candidates shouldn't lose tax-exempt status, IRS says in filing\n\nPastors who endorse political candidates shouldn't lose tax-exempt status, IRS says in filing\n\nIRS says churches can endorse political candidates to congregations\n\nIRS looks to change 1950s tax rule for pastors who endorse political candidates\n\nPastors who endorse political candidates shouldn't lose tax-exempt status, IRS says in filing\n\nCan Texas churches endorse candidates or post political signs? What the law says\n\nPastors who endorse political candidates shouldn't lose tax-exempt status, IRS says in filing\n\nPastors who endorse political candidates shouldn't lose tax-exempt status, IRS says in filing\n\n‘These are who we vote for,’ Puyallup pastor tells congregation. Did he break federal law?\n\nPastors who endorse political candidates shouldn't lose tax-exempt status, IRS says in filing\n\nPastors who endorse political candidates shouldn't lose tax-exempt status, IRS says in filing\n\nPastors who endorse political candidates shouldn't lose tax-exempt …\n\nPastors who endorse political candidates shouldn't lose tax-exempt status, IRS says in filing\n\nIRS says religious institutions may endorse candidates, undoing a longstanding ban – Jewish Telegraphic Agency\n\nPastors who endorse political candidates shouldn't lose tax-exempt status, IRS says in filing\n\nPastors who endorse political candidates shouldn't lose tax-exempt status, IRS says in filing\n\nPastors Who Endorse Political Candidates Shouldn't Lose Tax-Exempt Status, IRS Says in Filing\n\nIRS says churches can endorse political candidates to congregations as nonprofits: court agreement\n\nPastors who endorse political candidates shouldn't lose tax-exempt …\n\n'Time to recruit some churches': Experts blast new rules on pulpit politics\n\nPastors who endorse political candidates shouldn't lose tax-exempt status, IRS says in filing\n\nPastors who endorse political candidates shouldn’t lose tax-exempt status, IRS says in filing\n\nPastors who endorse political candidates shouldn't lose tax-exempt status, IRS says in filing",
        "source_3": "By signing up to our newsletters you agree to the Just the NewsTerms of ServiceandPrivacy Policy\n\nThe decree is being considered largely a formality because the IRS has never enforced the amendment for \"speech concerning electoral politics in the context of worship services.\"\n\nThe IRS says churches and other houses of worship can endorse political candidates to congregations while maintaining their tax-exempt nonprofit status.\n\nThe agency made the statement in aconsent judgment filedin a Texas federal court Monday with the National Religious Broadcasters and Intercessors for America, Sand Springs Church and First Baptist Church Waskom.\n\nThe plaintiffs sued over the Johnson Amendment that requires \"certain organizations, including churches, to refrain from participating or intervening in campaigns for public office as a condition for their non-profit, tax-exempt status.\"\n\n\"When a house of worship in good faith speaks to its congregation, through its customary channels of communication on matters of faith in connection with religious services, concerning electoral politics viewed through the lens of religious faith, it neither 'participate[s]' nor 'intervene[s]' in a 'political campaign,' within the ordinary meaning of those words,\" the IRS wrote.\n\nThe decree is being considered largely a formality because the IRS has not enforced the amendment for \"speech concerning electoral politics in the context of worship services.\"\n\nThe agency has for years been wary of punishing religious leaders for political statements made during worship. But the experts said this was the first time the IRS had formally said such statements are explicitly legal, not just tolerated,according to The New York Times.\n\nStill, the churches and the Christian broadcasters group claimed the amendment violated their First Amendment rights to freedom of speech and free exercise of religion, their Fifth Amendment rights to due process of law and equal protection under the law, and the Religious Freedom Restoration Act, according to the court filing.\n\nSaid the IRS: \"Interpreting the Johnson Amendment to reach such communications would create serious tension with the First Amendment’s Establishment Clause\" as it \"would treat religions that do not speak directly to matters of electoral politics more favorably than religions that do so.\""
    }
}