{
    "question": "How might the reported FBI criminal investigations into John Brennan and James Comey related to the 2016 Trump–Russia probe, amid unclear scope and limited official comment, shape public trust and congressional oversight of intelligence and law enforcement institutions?",
    "content": {
        "source_1": "The FBI has reportedly opened criminal investigations into former FBI DirectorJames Comeyand former CIA DirectorJohn Brennan, Fox News reported on Tuesday night.\n\nSources at the Department of Justice told Fox News that the two men are being investigated in connection with a previous probe centering on potential connections between PresidentDonald Trump’s2016 campaign and the Russian government.\n\nFormer CIA Director John Brennan and former FBI Director James Comey are under criminal investigation for potential wrongdoing related to the Trump–Russia probe, including allegedly making false statements to Congress, Justice Department sources told Fox News Digital.\n\nCIA Director John Ratcliffe referred evidence of wrongdoing by Brennan to FBI Director Kash Patel for potential prosecution, DOJ sources told Fox News Digital.\n\nThe sources said that the referral was received and told Fox News Digital that a criminal investigation into Brennan was opened and is underway. DOJ sources declined to provide further details. It is unclear, at this point, if the investigation spans beyond his alleged false statements to Congress.\n\nAs for Comey, DOJ sources told Fox News Digital that an investigation into the former director is underway, but could not share details of what specifically is being probed.\n\nNeither Brennan nor Comey responded to Fox News for comment.\n\nTrumpfired Comey in 2017 after the president reportedly demanded “loyalty” from the director. In May, Comey made news by posting a photo of seashells on a beach arranged to say “86 47.” Some conservatives insisted that “86,” which restaurant and bar workers understand to meanejecting a patron out of an establishment, was a call for the death of the 47th president. Comeydeniedthat he meant Trump any harm.\n\nMike is a Mediaite senior editor who covers the news in primetime.Follow him on Bluesky.",
        "source_2": "Reporting by Kanishka Singh, Jasper Ward and Andrew Goudsward in Washington; Additional reporting by Jonathan Landay. Editing by Noeleen Walder and Stephen Coates\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab",
        "source_3": "EXCLUSIVE:Former CIA DirectorJohn Brennanand former FBI Director James Comey are under criminal investigation for potential wrongdoing related to the Trump–Russia probe, including allegedly making false statements to Congress, Justice Department sources told Fox News Digital.\n\nCIA Director John Ratcliffe referred evidence of wrongdoing by Brennan to FBI DirectorKash Patelfor potential prosecution, DOJ sources told Fox News Digital.\n\nThe sources said that the referral was received and told Fox News Digital that a criminal investigation into Brennan was opened and is underway. DOJ sources declined to provide further details. It is unclear, at this point, if the investigation spans beyond his alleged false statements to Congress.\n\nAs for Comey, DOJ sources told Fox News Digital that an investigation into the former director is underway, but could not share details of what specifically is being probed.\n\nEX-OBAMA INTEL BOSS WANTED ANTI-TRUMP DOSSIER INCLUDED IN 'ATYPICAL' 2016 ASSESSMENT DESPITE PUSHBACK\n\nThe Department of Justice has opened criminal investigations into former CIA Director John Brennan and former FBI Director James Comey for potential wrongdoing related to the Trump-Russia probe, Fox News Digital has learned.(Getty; Reuters)\n\nThe full scope of the criminal investigations into Brennan and Comey is unclear, but two sources described the FBI's view of the duo's interactions as a \"conspiracy,\" which could open up a wide range of potential prosecutorial options.\n\nNeither Brennan nor Comey immediately responded to Fox News Digital’s request for comment.\n\nThe Brennan investigation comes after Ratcliffe last week declassified a \"lessons learned\" review of the creation of the 2017 Intelligence Community Assessment (ICA). The 2017 ICA alleged Russia sought to influence the 2016 presidential election to help then-candidateDonald Trump. But the review found that the process of the ICA's creation was rushed with \"procedural anomalies,\" and that officials diverted from intelligence standards.\n\nWHITE HOUSE WANTS OBAMA INTEL OFFICIALS 'HELD ACCOUNTABLE' FOR ROLE PEDDLING 2016 RUSSIA HOAX\n\nFBI Director Kash Patel during his confirmation hearing in January 2025.(Anna Moneymaker/Getty Images)\n\nIt also determined that the \"decision by agency heads to include the Steele Dossier in the ICA ran counter to fundamental tradecraft principles and ultimately undermined the credibility of a key judgment.\"\n\nThe dossier — an anti-Trump document filled with unverified and wholly inaccurate claims that was commissioned by Fusion GPS and paid for by Democrat presidential candidate Hillary Clinton's campaign and the DNC — has been widely discredited. Last week's review marks the first time careerCIAofficials have acknowledged politicization of the process by which the ICA was written, particularly by Obama-era political appointees.\n\nRecords declassified as part of that review further revealed that Brennan did, in fact, push for the dossier to be included in the 2017 ICA.\n\nBrennan testified to the House Judiciary Committee in May 2023, however, that he did not believe the dossier should be included in that intelligence product.\n\nCOMEY SAYS MCCABE LIED, CONFIRMS HE KICK-STARTED PROBE THAT LED TO HIS FIRING\n\nCIA Director John Ratcliffe during his confirmation hearing at the Senate Intelligence Committee on January 15, 2025, in Washington.(Andrew Harnik/Getty Images)\n\nRatcliffe was not surprised by the review's findings, a source familiar told Fox News Digital, given the director's long history of criticizing Brennan's politicization of intelligence. But Ratcliffe was compelled to refer aspects of Brennan’s involvement to the FBI for review of possible criminality, the source said.\n\nThe source was unable to share the sensitive details of Ratcliffe’s criminal referral to the FBI with Fox News Digital, but said that Brennan \"violated the public’s trust and should be held accountable for it.\"\n\nThe false statements portion of the probe stems from a newly declassified email sent to Brennan by the former deputy CIA director in December 2016. That message said that including the dossier in the ICA in any capacity jeopardized \"the credibility of the entire paper.\"\n\nFISA REPORT DROPS: 7 TAKEAWAYS FROM DOJ WATCHDOG'S REVIEW OF RUSSIA PROBE\n\nFormer CIA Director John Brennan arrives to meet with Speaker of the House Nancy Pelosi, D-Calif., about the situation in Iran, at the Capitol in Washington, Tuesday, May 21, 2019.(J. Scott Applewhite/AP Photo)\n\n\"Despite these objections, Brennan showed a preference for narrative consistency over analytical soundness,\" the new CIA review states. \"When confronted with specific flaws in the Dossier by the two mission center leaders – one with extensive operational experience and the other with a strong analytic background – he appeared more swayed by the Dossier's general conformity with existing theories than by legitimate tradecraft concerns.\"\n\nThe review added: \"Brennan ultimately formalized his position in writing, stating that ‘my bottomline is that I believe that the information warrants inclusion in the report.’\"\n\nBut Brennan testified the opposite in front of Congress in May 2023.\n\n\"The CIA was very much opposed to having any reference or inclusion of the Steele dossier in the Intelligence Community Assessment,\" Brennan testified before the House committee, according to the transcript of his deposition reviewed by Fox News Digital. \"And so they sent over a copy of the dossier to say that this was going to be separate from the rest of that assessment.\"\n\nFLASHBACK: NEWLY DECLASSIFIED INTEL DOCUMENT NOTED STEELE DOSSIER CLAIMS HAD 'LIMITED CORROBORATION'\n\nFormer Director of the U.S. Central Intelligence Agency (CIA) John Brennan testifies before the House Permanent Select Committee on Intelligence on Capitol Hill, May 23, 2017 in Washington, DC.(Alex Wong/Getty Images)\n\nCIA officials at the time of its creation pushed back against the FBI, which sought to include the dossier, arguing that the dossier should not be included in the assessment, and casting it as simply \"internet rumor.\"\n\nUltimately, Steele’s reporting was not included in the body of the final ICA prepared for then-PresidentBarack Obama, but instead detailed in this footnote, \"largely at the insistence of FBI’s senior leadership,\" according to a review by the Justice Department inspector general, and later, the Senate Intelligence Committee.\n\nBut back in June 2020, Ratcliffe, while serving as director of national intelligence, declassified a footnote of the 2017 ICA, which revealed that the reporting of Trump dossier author Christopher Steele had only \"limited corroboration\" regarding whether then-President-elect Trump \"knowingly worked with Russian officials to bolster his chances of beating\" Hillary Clinton and other claims.\n\nFLASHBACK: DNI DECLASSIFIES BRENNAN NOTES, CIA MEMO ON HILLARY CLINTON 'STIRRING UP' SCANDAL BETWEEN TRUMP, RUSSIA\n\nThe footnote, also known as \"Annex A\" of the 2017 ICA, exclusively obtained by Fox News Digital in June 2020, spanned less than two pages and detailed reporting by Steele, the former British spy who authored the unverified anti-Trump dossier — a document that helped serve as the basis for controversial Foreign Intelligence Surveillance Act (FISA) warrants obtained against former Trump campaign aide Carter Page.\n\nSteele’s reporting, at the time, was commissioned by opposition research firmFusion GPSand funded by the Clinton campaign and the Democratic National Committee (DNC) through law firm Perkins Coie.\n\nThe footnote made clear the internal concerns officials had over that document.\n\nEx-British spy Christopher Steele.( Tolga Akmen/AFP via Getty Images)\n\n\"An FBI source (Steele) using both identified and unidentified subsources, volunteered highly politically sensitive information from the summer to the fall of 2016 on Russian influence efforts aimed at the US presidential election,\" the annex read. \"We have only limited corroboration of the source’s reporting in this case and did not use it to reach the analytic conclusions of the CIA/FBI/NSA assessment.\"\n\n\"The source collected this information on behalf of private clients and was not compensated for it by the FBI,\" it continued.\n\nBut the annex notes that Steele's reporting was \"not developed by the layered subsource network.\"\n\n\"The FBI source caveated that, although similar to previously provided reporting in terms of content, the source was unable to vouch for the additional information's sourcing and accuracy,\" the annex states. \"Hence this information is not included in this product.\"\n\nFBI IGNORED 'CLEAR WARNING SIGN' OF CLINTON-LED EFFORT TO 'MANIPULATE' BUREAU FOR 'POLITICAL PURPOSES'\n\nJustice Department Inspector General Michael Horowitz also reviewed the inclusion of Steele’s reporting in the ICA during his review of alleged misconduct related to the Foreign Intelligence Surveillance Act, or FISA.\n\nHis report, released in late 2019, found that there were \"significant inaccuracies and omissions\" in FISA warrants for former Trump campaign aide Page. Those warrants relied heavily on Steele’s reporting, despitethe FBInot having had specific information corroborating allegations against Page that were included in Steele’s reporting.\n\nMeanwhile, Fox News Digital exclusively reported in October 2020 that Brennan briefed former President Obama and administration officials on intelligence that then-Democrat nominee former Secretary of State Clinton was stirring up a plan to tie Trump to Russia.\n\nRatcliffe, as director of national intelligence, declassified Brennan’s handwritten notes memorializing that meeting, which were exclusively obtained by Fox News Digital in October 2020.\n\nThen-Democratic presidential nominee former Secretary of State Hillary Clinton speaks as then-Republican presidential nominee Donald Trump listens during the town hall debate at Washington University on October 9, 2016 in St Louis, Missouri.(Rick Wilking-Pool/Getty Images)\n\nOn July 28, 2016, Brennan briefed Obama on a plan from one of Clinton's campaign foreign policy advisors \"to vilify Donald Trump by stirring up a scandal claiming interference by the Russian security service.\"\n\nComey, then-Vice President Joe Biden, former Attorney General Loretta Lynch and former Director of National Intelligence James Clapper were in the Brennan-Obama briefing.\n\nFLASHBACK: DECLASSIFIED TRUMP-RUSSIA PROBE DOCS TO DATE: WHAT TO KNOW\n\nAfter that briefing, the CIA properly forwarded that information through a Counterintelligence Operational Lead (CIOL) to Comey and then-Deputy Assistant Director of Counterintelligence Peter Strzok, with the subject line: \"Crossfire Hurricane.\"\n\nFox News Digital exclusively obtained and reported on the CIOL in October 2020, which stated: \"The following information is provided for the exclusive use of your bureau for background investigative action or lead purposes as appropriate.\"\n\n\"Per FBI verbal request, CIA provides the below examples of information the CROSSFIRE HURRICANE fusion cell has gleaned to date,\" the memo continued. \"An exchange (REDACTED) discussing US presidential candidate Hillary Clinton’s approval of a plan concerning US presidential candidate Donald Trump and Russian hackers hampering US elections as a means of distracting the public from her use of a private email server.\"\n\nThe FBI on July 31, 2016, opened a counterintelligence investigation into whether candidate Trump and members of his campaign were colluding or coordinating with Russia to influence the 2016 campaign. That investigation was referred to inside the bureau as \"Crossfire Hurricane.\"\n\nIn this May 29, 2019, file photo, Special counsel Robert Mueller speaks at the Department of Justice in Washington, about the Russia investigation.(Carolyn Kaster/AP Photo)\n\nFormer Special Counsel Robert Mueller was appointed to take over the FBI’s original \"Crossfire Hurricane\" investigation. After nearly two years, Mueller’s investigation, which concluded in March 2019, yielded no evidence of criminal conspiracy or coordination between the Trump campaign and Russian officials during the 2016 presidential election.\n\nShortly after, John Durham was appointed as special counsel to investigate the origins of the \"Crossfire Hurricane\" probe.\n\nDurham found that the FBI \"failed to act\" on a \"clear warning sign\" that the bureau was the \"target\" of a Clinton-led effort to \"manipulate or influence the law enforcement process for political purposes\" ahead of the 2016 presidential election.\n\n\"The aforementioned facts reflect a rather startling and inexplicable failure to adequately consider and incorporate the Clinton Plan intelligence into the FBI’s investigative decision-making in the Crossfire Hurricane investigation,\" Durham’s report states.\n\nSpecial Counsel John Durham indicated the Department of Justice and FBI \"failed to uphold their mission of strict fidelity to the law\" when it launched the Trump-Russia investigation.(Ron Sachs/Consolidated News Pictures/Getty Images)\n\n\"Indeed, had the FBI opened the Crossfire Hurricane investigation as an assessment and, in turn, gathered and analyzed data in concert with the information from the Clinton Plan intelligence, it is likely that the information received would have been examined, at a minimum, with a more critical eye,\" the report continued.\n\nDurham, in his report, said the FBI \"failed to act on what should have been—when combined with other incontrovertible facts— a clear warning sign that the FBI might then be the target of an effort to manipulate or influence the law enforcement process for political purposes during the 2016 presidential election.\"\n\nMeanwhile, the White House wants the Obama-era intelligence officials to be held accountable.\n\n\"President Trump was right — again,\" White House press secretaryKaroline Leavittsaid in a statement to Fox News Digital. \"Those who engaged in this political scandal must be held accountable for the fraud they committed against President Trump and the lies they told to the American people.\"\n\nBrooke Singman is a political correspondent and reporter for Fox News Digital, Fox News Channel and FOX Business."
    }
}