{
    "question": "What are the potential short- and long-term effects on immigrant communities, public safety, and local–federal relations when an immigration raid with National Guard support takes place in a public park like MacArthur Park?",
    "content": {
        "source_1": "Defense officials said that 90 armed troops were involved in the operation.\n\nHeavily armed federal border agents and U.S. troops descended upon MacArthur Park inLos Angeleson Monday afternoon as part of an immigration raid that appeared to turn up mostly empty.\n\nThe operation, which included 90 armed troops and 17 military Humvees, displaced a summer day camp, according to Los Angeles Mayor Karen Bass, who said the only point of the operations appeared to be \"a political agenda of provoking fear and terror.\"\n\n\"To me, this is another example of the administration ratcheting up chaos by deploying what looked like a military operation in an American city,\" Bass said.\n\nAccording to a post on X by the Defense Department, U.S. military personnel were on the ground to ensure the safety of federal agents.\n\n“We will protect federal law enforcement and assist by establishing a security perimeter,” DOD wrote.\n\nCalifornia Gov. Gavin Newsom, speaking at a news conference to discuss recovery from the wildfires that devastated the city earlier this year, called the operation \"theater.\"\n\n“What a disgrace, what's happening in MacArthur Park. What theater. On the six-month anniversary, after all, of these fires -- that's the message from the polluted heart of the President of the United States, the polluted heart of [White House Deputy Chief of Staff] Stephen Miller,” Newsom said.\n\nIt was not immediately clear who or what was targeted. Bass posted a video of agents, some on horseback, moving in what she called a \"skirmish line\" across the mostly empty park.\n\nThe mayor said she didn't believe anyone was detained, \"but then again, I don't think the goal is to detain. I think the goal is to spread fear. I think that's what it is. It's to terrorize Angelenos. It's to say to immigrants that are in our city of immigrants that they need to stay home, they shouldn't go to work, they shouldn't go to school, because we're coming after you.\"\n\nHours after the raid, federal authorities wouldn't say why they were at the park or what they were looking for, or if any arrests were made.\n\nDefense officials had said the troops were deployed to set up a security perimeter to protect federal law enforcement officials against potentially hostile crowds.\n\nAll of the troops involved in the operation were activated members of the California National Guard.\n\nThe operation included some 17 Humvees, four military cargo trucks and two military ambulances, officials said.\n\nThe armed troops were told in advance of the raid that they could defend themselves and federal employees if needed. If  a person was a threat, the troops could detain the individual briefly before handing them off to law enforcement, officials said.\n\nEarlier this summer, Trump deployed some 4,700 troops to California under a law known as Title 10, which allows the use of military forces to protect federal personnel and federal property.",
        "source_2": "Billal Rahman is an immigration reporter based in London, U.K. He specializes in immigration policy and border security. He has uncovered allegations of misconduct among border agents under investigation and exposed claims of abuse at ICE-run detention centers in the U.S. He joined Newsweek in 2024 from The Independent. He has covered the British Post Office scandal and the conflict between Israel and Hamas. Originally from Glasgow, he studied Journalism in Edinburgh and then worked for STV News before moving to London in 2022. You can contact Billal at b.rahman@newsweek.com.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nFederal authorities descended on a park where children were playing in California on Monday to conduct enforcement operations.\n\nDozens of federal agents in tactical gear, heavily armed and dressed in military-style uniforms, staged what seemed to be an immigration enforcement action, drawing swift condemnation from Los Angeles MayorKaren Bass, who rushed to the scene in response.\n\n\"What I saw in the park today looked like a city under siege, under armed occupation,\" said Mayor Bass, who told reporters there were children in the park attending a day camp.\n\n\"We don't comment on ongoing enforcement operations,\" a seniorDepartment of Homeland Security(DHS) official toldNewsweek.\n\nRoughly 100 federal immigration enforcement agents, including Border Patrol and other law enforcement officers in armored vehicles, gathered along the perimeter of MacArthur Park in Los Angeles' Westlake area in a show of force as the region marks six months since the Eaton and Palisades fires began. The area is often called the \"Ellis Island of the West Coast\" for its role as a community hub in a largely immigrant neighborhood of Los Angeles.\n\nThe park was left nearly deserted after word of a possible raid spread through the community.\n\nBass said she stopped her car on the way to City Hall to watch as officers on horseback and soldiers in tactical gear passed by a playground, while children at a summer day camp were hurried indoors.\n\nAccording toFox11, officials said the show of force shuttered children's programming and caused widespread confusion.\n\nIn response, protesters rallied at the park, with activists using megaphones to alert bystanders about the operation.\n\nBass said that when she arrived, she demanded to speak with the official in charge of the operation. She was given a phone and was told by Border Patrol El Centro sector chief Gregory Bovino that he intended to remove the federal agents from the area.\n\nHowever, Bovino toldFox News: \"I don't work for Karen Bass. Better get used to us now, 'cause this is going to be normal very soon. We will go anywhere, anytime we want in Los Angeles.\"\n\nCalifornia GovernorGavin Newsom, Mayor Bass, and SenatorAlex Padillaall condemned the move, saying that it prioritized intimidation over emergency aid Los Angeles needs.\n\nAt a press conference after the incident, Bass said she spoke with children who had been guided indoors when federal personnel arrived. One 8-year-old boy, she said, spontaneously shared that he was scared ofICEagents.\n\nPresidentDonald Trump's administration is pushing forward with plans to carry out what they described as the largest mass deportation operation in U.S. history and has conducted numerous ICE raids. Although these are being conducted under federal legal authority, protests have erupted amid reports of mistreatment of migrants and aggressive tactics deployed by federal immigration agents.\n\nTrump deployed National Guard troops on June 7 to suppress protests at federal buildings and during immigration raids, mobilizing approximately 4,000 National Guard members and 700 Marines in total. The troops remain in California even though it has now been more than three weeks since the last major demonstration took place in downtown Los Angeles.\n\nBovino wrote on X:\"We may well go back to MacArthur Park or other places in and around Los Angeles. Illegal aliens had the opportunity to self deport, now we'll help things along a bit.\n\nGovernor Newsom wrote in a post on X:\"On the 6 month anniversary of the LA wildfires Donald Trump decided to send troops on horseback to round people up on soccer fields instead of delivering what LA actually needs — the emergency aid that he continues to play games with. What a disgrace.\"\n\nMayor Bass said in a post on X:\"Minutes before, there were more than 20 kids playing — then, the MILITARY comes through. The SECOND I heard about this, I went to the park to speak to the person in charge to tell them it needed to end NOW. Absolutely outrageous.\"\n\nSenator Padilla wrote on X:\"Armored vehicles. Tactical gear. Military-grade weapons. All for the show. This isn't security—it's intimidation. And it has no place in our communities.\"\n\nUpdate 08/08/25, 09:43 a.m. ET. This article was updated with comment from a senior Department of Homeland Security official.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nBillal Rahman is an immigration reporter based in London, U.K. He specializes in immigration policy and border security. He has uncovered allegations of misconduct among border agents under investigation and exposed claims of abuse at ICE-run detention centers in the U.S. He joined Newsweek in 2024 from The Independent. He has covered the British Post Office scandal and the conflict between Israel and Hamas. Originally from Glasgow, he studied Journalism in Edinburgh and then worked for STV News before moving to London in 2022. You can contact Billal at b.rahman@newsweek.com.\n\nBillal Rahman is an immigration reporter based in London, U.K. He specializes in immigration policy and border security. He has uncovered allegations of misconduct among border agents under investigation and exposed claims of abuse at ICE-run detention centers in the U.S. He joined Newsweek in 2024 from The Independent. He has covered the British Post Office scandal and the conflict between Israel and Hamas. Originally from Glasgow, he studied Journalism in Edinburgh and then worked for STV News before moving to London in 2022. You can contact Billal at b.rahman@newsweek.com.\n\nBillal Rahman is an immigration reporter based in London, U.K. He specializes in immigration policy and border security. He has                                    ...Read more",
        "source_3": "Fox News' Jonathan Hunt provides updates on the attack on a police officer in Alvarado, Texas, and the attack on an ICE facility in Portland, Oregon. Border czar Tom Homan discusses the Trump administration's investment in immigration enforcement.\n\nFederal agents, accompanied by members of the National Guard, conducted an immigration raid inLos Angeleson Monday, prompting Mayor Karen Bass to heavily criticize the move, calling it \"outrageous\" and \"un-American.\"\n\nThe operation targeted an area near MacArthur Park, an area with a large immigrant population, in the city's Westlake neighborhood, which is heavily Hispanic and has a heavy MS-13 influence.\n\nU.S. Border Patrol agents were seen on horseback in the park and law enforcement and military-looking vehicles were stationed in the area.Fox Los Angelesreported that no arrests were made.\n\nLA-AREA MAYORS PLEAD WITH TRUMP ADMIN TO STOP ICE IMMIGRATION ARRESTS\n\nFederal agents ride on horseback at MacArthur Park, on Monday in Los Angeles. Their uniforms read \"Police U.S. Border Patrol,\" and \"HSI,\" which stands for Homeland Security Investigations.(Damian Dovarganes/AP Photo)\n\nBass, who has been a vocal opponent of immigration raids in the city, appeared at the scene and demanded to speak with ICE leadership.\n\n\"They need to leave, and they need to leave right now. They need to leave because this is unacceptable!\" Bass said at the scene.\n\nBorder PatrolChief Gregory Bovino told Fox News that he was the official on the phone with Bass, who demanded the raid be stopped.\n\n\"I don’t work for Karen Bass,\" Bovino said. \"Better get used to us now, because this is going to be normal very soon. We will go anywhere, anytime we want in Los Angeles.\"\n\nBass later vented on X, saying more than 20 kids were playing in the park before authorities showed up.\n\n\"Minutes before, there were more than 20 kids playing — then, the MILITARY comes through,\" she wrote. \"The SECOND I heard about this, I went to the park to speak to the person in charge to tell them it needed to end NOW.\"\n\n\"There is no plan other than fear, chaos, and politics,\" she added. \"Home Depot one day, a car wash the next, armed vehicles and what looked like mounted military units in a park the next day.\"\n\n\"What happened to the criminals, the drug dealers, the violent individuals?\" she asked. \"Who were in the park today were children. It was their summer day camp. Those kids now have no activities. They were ushered inside so that they didn’t get exposed to the troops that were walking in formation across their playground area.\"\n\nBass said she later met some of the children who were at the park at the time of the raid.\n\nProtesters began showing up in the area, with reports of a tire on a federal vehicle being slashed and objects thrown at vehicles.\n\nLos Angeles Mayor Karen Bass stands in front of a U.S. Border Patrol federal agent at MacArthur Park on Monday in Los Angeles.(Damian Dovarganes/AP Photo)\n\nCalifornia Gov. Gavin Newsom called Monday's events at MacArthur Park a \"message from the polluted heart\" of President Donald Trump.\n\n\"I want folks to know that we have your back,\" Newsom said at a press conference where he joined local and federal leaders to recognize six-month anniversary of Los Angeles wildfires. \"We'll continue to come back and do what we can to protect our diverse communities, to protect the spirit that defines the best of this city and out state and to push back against this cruelty that is being perpetuated by the president of the United States.\"\n\nBass has called for the Trump administration to end immigration enforcement in her city, calling the operations \"inhumane.\"\n\n\"What is happening in Los Angeles is not normal. It is not normal to send in the National Guard without a request from the governor,\" she wrote Sunday on X. \"It is not normal to conduct indiscriminate raids on our immigrant population. Let LA return to normal. Get the National Guard out.\"\n\nANTI-ICE RIOTS REVEAL THE LEFT HAS LEARNED NOTHING. IT'S JUST HANDED TRUMP A GIFT\n\nFederal agents stage at MacArthur Park on Monday in Los Angeles.(Damian Dovarganes/AP Photo)\n\nFox News Digital has reached out to Bass' office and U.S. Immigration and Customs Enforcement (ICE).\n\nA senior DHS official told Fox News Digital: \"We don't comment on ongoing enforcement operations.\"\n\nOpponents of the raids have accused federal agents of using heavy tactics to takeillegal immigrantsinto custody.\n\nCommunity leaders reported incidents of ICE appearing at elementary school graduations, disrupting the legitimate immigration processes at various courthouses, and aggressively raiding workplaces and locations like Home Depot, Fox Los Angeles reported.\n\nThe operations, perceived as arbitrary and invasive, sparked outrage among opponents, resulting in various large-scale demonstrations across Los Angeles County.\n\nA person holds a sign in front of federal agents at MacArthur Park on Monday in Los Angeles.(Damian Dovarganes/AP Photo)\n\nIn June, protesters rioted and clashed with authorities for several days amid outrage over immigration raids in the region. PresidentDonald Trumpfederalized the National Guard and ordered the deployment of Marines to the city, leading to heavy criticism from local and state officials, including California Gov. Gavin Newsom.\n\nLouis Casiano is a reporter for Fox News Digital. Story tips can be sent tolouis.casiano@fox.com.\n\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}