{
    "question": "What outcomes—intended and unintended—might the privately funded Music City Loop between downtown Nashville and the airport have for congestion, environmental risk, equity of access, and public oversight?",
    "content": {
        "source_1": "State leaders fast-tracked plans by Elon Musk’s company for a tunnel to Nashville’s airport, ignoring the city’s concerns.\n\nElon Musk, the world’s richest man, already faces backlash over his company’s giant supercomputer project in Memphis. Now, another project under his business empire has angered residents in Tennessee’s capital, where state officials cleared the way on Thursday for a 10-mile tunnel to be dug under Nashville.\n\nThe project bythe Boring Company, Mr. Musk’s private tunneling venture, would connect downtown Nashville and the city’s airport. Gov. Bill Lee, a Republican, and other state leaders announced it this week, with little input from local lawmakers and residents, who raised objections to its fast-tracked approval.\n\nMr. Musk’s tunnel, built for vehicles sold by one of his other companies, Tesla, is the latest point of tension between the Republican leaders who dominate state government and a majority of residents and officials in the largely liberal city.\n\n“It is shameful and it is disrespectful that you all have made this decision without us,” State Senator Charlane Oliver, who represents part of Nashville, said at a hearing of a state commission that unanimously approved the use of state land for the project.\n\nConstruction on what is being billed as the Music City Loop is expected to begin in the coming days. Officials hope it would reduce the downtown-to-airport commute, typically at least 15 minutes in regular traffic, to as few as eight minutes. The loop would be used by Tesla cars owned and operated by the Boring Company.\n\nWe are having trouble retrieving the article content.\n\nThank you for your patience while we verify access. If you are in Reader mode please exit andlog intoyour Times account, orsubscribefor all of The Times.\n\nThank you for your patience while we verify access.",
        "source_2": "It's official. Elon Musk's The Boring Company plans to build a high-speed tunnel from Nashville International Airport to downtown.\n\n\"Nashville was selected by The Boring Company for its rapid growth, strong economic potential and dedication to embracing smart, forward-looking infrastructure,\" state officials said in a statement. \"The Music City Loop will remove thousands of vehicles from surface roads each day, easing traffic congestion while creating numerous job opportunities for Tennesseans.\"\n\nTop leaders in business and politics across Tennessee convened at BNA on July 28 to announce the \"major economic development\" project that's been in the works for some time. The tunnel will cover approximately 10 miles from Nashville's city center to Tennessee's largest airport once complete.\n\nThose involved in the deal included Gov. Bill Lee, Tennessee Chamber of Commerce and Industry, Nashville Area Chamber of Commerce, Nashville International Airport, Nashville Music City Center and Greater Nashville Hospitality Association.\n\n\"They could have taken their next underground loop anywhere, but they saw something unique about Tennessee,\" Lee said. \"The best part of all of it is it’s 100% privately funded. There will be no cost to Tennessee taxpayers.\"\n\nConstruction is slated to begin immediately and is expected to be operational by the fall of 2026 at the earliest.\n\nHowever, Tennessee Democratic representatives objected to the deal. They argued a for-profit business, especially one of Musk's, should not be entertained.\n\n\"Musk's track record and all of this isn't about solving traffic, it's about privatizing infrastructure,\" said Rep. Aftyn Behn, D-Nashville. \"It's a continuum of Governor Lee's agenda of privatizing every last public good we have.\"\n\nThe Boring Co. recently received theTSA Gold Standard Award, the highest safety and security rating available from the U.S. Department of Homeland Security, and U.S. Department of Transportation Secretary said he is confident in the safety of the project. He also said his agency will streamline the process for necessary permits while also ensuring the safety of the project.\n\n\"At DOT, we don't play favoritism,” Sean Duffy, U.S. Department of Transportation Secretary said in the release. \"The quality of the deal the governor has struck and the innovation that's happening here, that's why I'm excited.\"\n\nBoring Co. officials said there will be no road closures or impacts from construction.\n\n\"Compact tunnels reduce excavation volume and cost,\" the company said. \"Minimal vibration/noise ensures disruption-free operation during urban tunneling.\"\n\nThe tunnel will reduce the commute between downtown Nashville and the airport to an eight-to-10-minute ride with Tesla vehicles shuttling passengers back and forth. President and CEO of The Boring Co. Steve Davis said construction will begin “as soon as possible” with the goal of completing the project in about a year.\n\n“We started to look for another place where we should go, and there were really only two requirements: The system had to be useful, and the community had to be welcoming,” Davis said.\n\nThe Boring Co. plans to start with the downtown-to-BNA track and then expand to additional stops across Nashville.\n\nNotably, Nashville Mayor Freddie O'Connell was not in attendance Monday.\n\n\"We are aware of the state's conversations with The Boring Company, and we have a number of operational questions to understand the potential impacts on Metro and Nashvillians,\" O'Connell said.\n\nDuring Monday's announcement, officials touted the fact that the project will be \"entirely privately funded,\" with The Boring Co. incurring all associated costs. They did not share a total cost estimate for the project or details on any incentives or public goods The Boring Co. for selecting Tennessee as its next site.\n\n\"That's determined by The Boring Co.,\" Lee said. \"They determine their own business model, what the costs are going to be, but the most important thing is it's not going to cost the state.\"\n\nProject leaders said the tunnel will follow along state routes, though an exact path is yet to be determined.\n\nMusk founded The Boring Co. in 2017 to specialize in constructing underground tunnels that work to streamline and enhance traditional transportation systems.\n\n“To solve the problem of soul-destroying traffic, transportation networks need to match our 3D cities,” the company website states. “Tunneling enables an economical layered transportation network that can be expanded over time.”\n\nThe Texas-based company has finished three tunnel projects in Las Vegas: the Vegas Loop, the Las Vegas Convention Center Loop and the Resorts World Connector.\n\nThe Vegas Convention Center Loop, originally a 1.7-mile track, cost roughly $47 million.\n\n“It’s fun. It’s quick. It’s convenient,” Steve Hill, president and CEO of the Las Vegas Convention and Visitor Authority, said. \"It’s just being driven around in a Tesla.\"\n\nAs reports of the incoming tunnel announcement circulated through Nashville over the last week, politicians,locals and tourists alike voiced strong feelings.\n\nSome tourists like Martin Cooper, applauded the idea for its convenience and potential to reduce traffic congestion to and from BNA.\n\n\"Less traffic accidents. Safer. Less congestion. I like what he (Musk) is doing,\" Cooper said.\n\nOthers, like downtown resident Darold Rise, expressed concerns about private property being disrupted for construction and Musk's company.\n\n\"How much private property do we need to tear up to do that?\" Rise asked. \"Is it all for progress? Or is he (Musk) making another billion dollars and ruining another Tennessee city?\"\n\nAdditionally, Tennessee state Sen. Heidi Campbell (D-Nashville) who serves on the Transportation and Safety Committee said she supports public transit improvements, but not from Musk.\n\n\"If Nashville really wants to lead, we should be investing in public transit that serves everyone,\" Campbell said. \"Not building vanity projects for billionaires that sidestep regulation and extract value from our communities without putting anything meaningful back.\"\n\nThis marks the latest instance of longstanding contentions surrounding Nashville International Airport. Earlier this month, Tennessee Attorney General Jonathan Skrmetti petitioned the state Supreme Court to accept arguments over a 2023 law that would transfer control over Metro Nashville Airport Authority from the city to the state.\n\nIn a trial court and the Tennessee Court of Appeals, Metro Nashville attorneys claimed the law was unconstitutional and unfairly targets local government.\n\nMusk’s tunnel venture comes nearly eight years after then-Mayor Megan Barry proposed her own tunnel that would run under Music City. A light rail system and three-stop downtown tunnel were a small part of Barry's sweeping $5.2 billiontransit plan that she pushed for in 2017.\n\nUltimately, the plan was put to a vote on local ballots, andNashvillians resoundingly rejected it.\n\nThe tunnel alone was set to cost $900 million, but no specific price tag came on the light rail running from downtown Nashville to BNA.\n\nProject leaderstold The Tennessean at the timethat going underground downtown was necessary to avoid \"complicated right-of-way acquisitions.\"\n\nNeither Musk's nor Barry's proposed tunnels have anything to do with theexisting network of 50-year-old tunnels downtown. Those belong to District Energy System and are filled with pipes to power air conditioning, heating and heating water.\n\nThey will not be disrupted by the incoming Boring Company tunnel.\n\nKeith Sharon and Austin Hornbostel contributed reporting to this story.\n\nHadley Hitson covers business news for The Tennessean. She can be reached athhitson@gannett.com. To support her work,subscribe to The Tennessean.\n\nStuart Dyos covers the automotive industry in Middle Tennessee and beyond.He can be reached atsdyos@gannett.com. To support his work,subscribe to The Tennessean.",
        "source_3": "The project will be similar to one already in use in Las Vegas.\n\nTennessee Governor Bill Lee announced Monday that the state would be partnering with Elon Musk’s Boring Company to build an underground tunnel connecting the Nashville airport to the city’s downtown.\n\nThe project will be called the “Music City Loop” and will connect Nashville International Airport to the heart of the city’s entertainment district via an underground tunnel. Using electric vehicles, the trip will take about eight minutes,accordingto the Boring Company.\n\nDuring a press conference at the airport, Lee said that the project would be 100% privately funded with “no cost to taxpayers.” He said that it was brought to Nashville because it is the “most dynamic city in the country” and that it would lead to less congestion on the roads.\n\n“Tennessee continues to lead the nation in finding innovative solutions to infrastructure challenges,” Lee said. “By leveraging the innovation of private sector companies like The Boring Company, we’re exploring possibilities we couldn’t achieve on our own as a state. This partnership represents the kind of forward-thinking, fiscally responsible approach that will define the future of transportation in Tennessee.”\n\nThe loop will be built under state-owned roads, and construction is projected to begin in the fall of 2026, pending approvals.\n\nSecretary of Transportation Sean Duffy was also present at the announcement, saying that he was “thrilled about this project.”\n\nDuffy said that the project would help reduce congestion on the roads, which has become worse in recent years as Tennessee has seen an influx of new residents. He said that the congestion was a “product of your own success” because people were attracted to the politics of Tennessee.\n\nBoring Company President Steve Davis said at a press conference that the rock below Tennessee was really difficult to drill through, but that his engineers would be able to figure it out. He also said that the company would start consideration of potential places to expand the tunnel.\n\nThe decision to bring a tunnel to Nashville was celebrated by Tennessee GOP Senators Marsha Blackburn and Bill Hagerty.\n\n“As Nashville International Airport continues to set passenger records and our city experiences an economic boom, the Boring Company’s investment in the Music City Loop will help ease growing pains and address transportation challenges at zero cost to Tennessee taxpayers,” Blackburn said. “The Boring Company could not have picked a better new home for this state-of-the-art tunneling technology than Nashville, and I look forward to seeing the tremendous impact this investment will have on our city and its residents.”\n\nYour information could be the missing piece to an important story. Submit your tip today and make a difference."
    }
}