{
    "question": "In what ways might Mamdani’s pledge to shift the tax burden toward “richer and whiter neighborhoods,” along with the uneven media attention to that phrasing, shape public understanding of his tax plan and its implications for the mayoral race?",
    "content": {
        "source_1": "When Zohran Mamdani launched his mayoral campaign for New York City last year, many wrote off his chances.\n\nHe's a South Asian Muslim Democratic socialist. He faced resistance from his own party's establishment. EvenThe New York Timeseditorial board told voters not to support the 33-year-old.\n\nAnd even though Mamdani tried hard to keep affordability at the center of his campaign, others tried to define his identity with unsubstantiated claims that he would promote Islamic law, that he supports terrorism and that he's an antisemite.\n\n\"There are a lot of concerns based on a caricature of myself,\" Mamdani said onMorning Edition. \"I don't blame New Yorkers for having that caricature because they've had to deal with more than $30 million of spending that paints me in that manner — that smears and slanders me, that artificially lengthens the color and the length of my beard, that calls me a monster.\"\n\nBut for the most part New Yorkers didn't fall for it. Mamdani is now the Democratic candidate after getting the most votes in the primary last week. He is one step closer to becoming mayor of the nation's largest city.\n\nOn Monday, NPR's Leila Fadel sat down with Mamdani in New York City to discuss the lessons his victory holds for his party and how he plans to implement his policies if he becomes mayor despite skepticism about their feasibility.\n\nMamdani clarified remarks he made on NBC News'Meet the Pressabout billionaires, saying, \"I think the better question is whether working people have the right to exist, because what we've seen in this city is that more and more working people are being pushed out.\"\n\nAsked about his proposals, like free public transit and expanded childcare, he acknowledged that many of his ideas would need state-level support, particularly from Gov. Kathy Hochul, who has voiced skepticism and so far has not endorsed him. But he remained optimistic, citing his success in launching New York City's first fare-free bus pilot as evidence that progressive reform is achievable.\n\nThis interview has been lightly edited for length and clarity.\n\nLeila Fadel:Let's talk about your policies, because one of the criticisms that your detractors have is that it sounds great to have free childcare and free buses and groceries that you can afford. But a lot of what you're promising is out of the mayor's hand. It's something that will have to happen at the state level. It will have to happen with other actors. So how, how can you actually fulfill any of these promises?\n\nZohran Mamdani:Any mayor that has an ambition that meets the scale of the crisis of the people that they're seeking to represent will have to work with Albany. And the reason that I put forward this agenda is not only because it's urgent, but because it's feasible. I say that to you as an assembly member who won the first fare free bus pilot in New York City, who saw that in making buses free. It wasn't simply about economic relief. It's also about public safety, the fact that assaults on bus drivers went down by 38.9% through this pilot, the fact that we actually saw an increase in riders who had previously been driving a car or taking a taxi, reducing congestion around those same routes. These are the reasons why we pursue this agenda.\n\nFadel:The way that you say you're going to pay for these programs is by increasing the corporate taxes on corporations and then also an income tax on anybody who makes over a million dollars, right?\n\nFadel:So again, that's a non-starter for Gov. Kathy Hochul, she said that. So how are you going to pay for it?\n\nMamdani: I've appreciated my conversations with the governor, and one thing that I really appreciate about our current governor, Kathy Hochul, is she is laser focused on affordability. And what we've seen is that these policies I'm speaking to you about, they are not just policies that people are voting for, incidentally, while they're voting for me, they're voting for this platform.\n\nFadel:But again, what makes you confident about the coalition building when you're hearing the governor say it's a non-starter, she hasn't also endorsed you yet, as these other leaders within your party have not done?\n\nMamdani: The experience that I've had. Over this campaign, there was a time when many of the ideas we were putting forward were considered to be distinct to our campaign, and yet, as we built it, more and more candidates started to embrace those same policies, and I am confident of seeing that happen across the political spectrum. Even Andrew Cuomo, in his own transportation plan, said that he wanted to explore making buses free. That was a recognition of the popularity of that as a proposal.\n\nFadel:You made some waves this weekend when you said that you didn't believe that billionaires had the right to exist. What does that mean?\n\nMamdani:I was speaking about the stark nature of income inequality in this city and in this country, and ultimately, I think the better question is whether working people have the right to exist, because what we've seen in this city is that more and more working people are being pushed out. The vision that I'm speaking about, it's a vision that I want everyone to enjoy and benefit from, including billionaires. Though my taxes that I'm proposing are ones that would be on the top 1% of New Yorkers, on the most profitable corporations, it's not taxes that will detract from their life. It's, in fact, taxes that will benefit everyone across the city, including those who are being taxed. And ultimately, this is not an interest in taxation in and of itself. It's an interest in finding revenue to pay for something that will transform life in the city.\n\nFadel:So you weren't proposing that your policies would ultimately lead to a New York with no billionaires?\n\nFadel:You are going to have what looks like a tough race in November. You already have people like billionaire Bill Ackman saying he'll give hundreds of millions of dollars to anybody who runs against you.\n\nMamdani:I think he also said some nice things, nice things about me as well.\n\nMamdani:I think he said that I was smart, which I appreciated. Thank you, Bill.\n\nFadel:Well, okay, but he also doesn't want you to be mayor of New York City, you know, and there are other corporations, wealthy New Yorkers, who feel the same way, and there are some people who fear your candidacy. You have support among some Jewish voters, and you have some Jewish voters who are extremely skeptical of you and afraid of your candidacy.\n\nMamdani: My job is to lead this entire city. My job is to address those very concerns that New Yorkers may have, be it for whatever basis. My commitment is now to have meetings with New Yorkers who may be concerned. Maybe it's, you know, a business leader who is worried about the impact of my tax proposals, and I get to share the fact that these are proposals that will make it easier for them to attract and retain talent. If I can speak with a Jewish New Yorker who's concerned about the issue of antisemitism, and I can share the fact that this is a real crisis that we have to tackle, and one that I'm committed to doing so through increased funding for actually preventing hate crimes across the city, and make it clear time and again that my commitment is to protect Jewish New Yorkers and that I will live up to that commitment through my actions. And that's what these next many months are about.\n\nFadel:You know, the thing that was very clear in the weeks before and the days after the primary was this barrage of racist, anti-Muslim attacks on you, equating you to a terrorist, saying you're a danger to the safety of Americans, especially Jewish Americans. I'm going to repeat some of the attacks, not because I think they're okay to say, but I want listeners to understand what's being said. And it's not just from the right wing and Republicans in office. It's also from other influential figures. Deborah Messing ofWill & Graceposted online that you sided with terrorists and you celebrated 9/11. You were nine when that happened. Republican Rep. Nancy Mace posted a picture of you in your Eid outfit and wrote, \"After 9/11 we said, \"Never Forget.\" I think we sadly have forgotten.\" Republican Rep. Andy Ogles called you \"little Muhammad,\" and said you need to be deported, and is calling for your denaturalization. Were you prepared for this level of bigotry?\n\nMamdani:It's unsurprising, and yet it's still deeply saddening. As many Muslims in this country know, to exist in public life is to have to deal with this kind of slander at a different scale, and it's part of why so many have thought that the safest place to live is in the shadows, and so much of my hope for this campaign was to bring the margins of our city into the mainstream. It's been very difficult to see just how much of this hatred has been normalized. And as you've said, it's, it's not just Republican Congress people. It's an actress from a show that I used to watch as a kid. I think that ultimately my responsibility is to show that our vision for this city, it's a vision that is universal. It's a vision that wants to recognize the belonging of each and every New Yorker, and it's in stark contrast to this exclusionary vision that we see from so many, one that seeks to distract people from an inability to take care of working people by designating the enemies as the other. One of the most difficult parts of this, however, have been that the threats that have been made on my life and on people that I love are ones that fundamentally transform how you can live.\n\nMamdani:It has. The fact that I now have to have security at all times. It's a different way of engaging with the world. But my responsibility is to showcase that this is but a drop in the bucket of how people actually feel in the city. Just a few days after I received a number of death threats and someone who said that he was going to blow up my car, which was news to me, because I don't own a car. I walked the length of Manhattan to speak to New Yorkers. And I did it because I think, though, the way that we defeat this bigotry is by showcasing just how small of a minority it actually represents.\n\nThe digital version of this interview was edited and produced by Majd Al-Waheidi. Video edited by Courtney Theophin and Nick Michael.",
        "source_2": "James Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics in Texas, as well as other general news across the United States. James joined Newsweek in July 2022 from LBC, and previously worked for the Daily Express. He is a graduate of Oxford University. Languages: English. Twitter: @JBickertonUK. You can get in touch with James by emailing j.bickerton@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nNew York City's Democratic mayoral candidate Zohran Mamdani has said he wants to \"shift the tax burden\" to \"richer and whiter neighborhoods\" if he secures election in November.\n\nA housing policy document on Mamdani's official website includes a pledge to \"shift the tax burden from overtaxed homeowners in the outer boroughs to more expensive homes in richer and whiter neighborhoods.\"\n\nNewsweekcontacted the Mamdani campaign for comment via email on Friday outside of regular office hours.\n\nMamdani's proposal has already sparked a backlash with one conservative commentator branding him racist and urging New Yorkers to support incumbent Mayor Eric Adams instead, who is running in November as an independent.\n\nThe New York mayoral election campaign has already turned bitter with severalRepublicanssuggesting Mamdani, a naturalized U.S. citizen who was born in Uganda, should bestripped of his American citizenshipand deported.\n\nMamdani's official campaign website features a policy memo under the title \"Supporting homeowners and ending deed theft.\"\n\nThe document says that if elected his administration will \"Shift the tax burden from overtaxed homeowners in the outer boroughs to more expensive homes in richer and whiter neighborhoods.\"\n\nIt adds: \"The property tax system is unbalanced because assessment levels are artificially capped, so homeowners in expensive neighborhoods pay less than their fair share. The Mayor can fix this by pushing class assessment percentages down for everyone and adjusting rates up, effectively lowering tax payments for homeowners in neighborhoods like Jamaica and Brownsville while raising the amount paid in the most expensive Brooklyn brownstones.\"\n\nThe document asserts that currently New York City taxes \"family homes in Black and Latino neighborhoods like Jamaica, Brownsville, and Tremont more than it does in wealthier neighborhoods of the city.\"\n\nOn Tuesday Mamdani, who began the campaign as a rank outsider, defeated former New York State governorAndrew Cuomotosecure the 2025 Democratic nominationfor the New York mayoralty.\n\nMamdani, a democratic socialist, is running on a platform that includes a number of radical reforms such as creating city-owned grocery stores, offering free childcare to all New Yorkers with children aged between six weeks and five years and imposing a 2 percent tax on all residents earning more than $1 million annually.\n\nOn Thursday bookmaker Star Sports was offeringodds of 1/4 (80 percent)on Mamdani winning this year's New York mayoral election, ahead of Adams in second place on 7/2 (22.2 percent).\n\nOn XEric Daugherty, assistant news director for conservative leaning publicationFlorida's Voice, said: \"WTF? Zohran Mamdani supports taxing 'whiter neighborhoods\" in New York City higher than other boroughs.\n\n\"This Ugandan is not only a radical Muslim socialist but a RACIST. NYC, please reject this psycho and choose Eric Adams instead.\"\n\nThe conservativeRight Angle News Networkon X shared a screenshot from Mamdani's policy memo referring to \"whiter neighborhoods\" adding: \"BREAKING - A proposal by NYC Democrat mayoral candidate Zohran Mamdani to shift tax burdens to \"Whiter neighborhoods\" has resurfaced.\"\n\nThe New York Mayoral election will take place on November 4, with the winner expected to assume office in January.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nJames Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics in Texas, as well as other general news across the United States. James joined Newsweek in July 2022 from LBC, and previously worked for the Daily Express. He is a graduate of Oxford University. Languages: English. Twitter: @JBickertonUK. You can get in touch with James by emailing j.bickerton@newsweek.com\n\nJames Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics in Texas, as well as other general news across the United States. James joined Newsweek in July 2022 from LBC, and previously worked for the Daily Express. He is a graduate of Oxford University. Languages: English. Twitter: @JBickertonUK. You can get in touch with James by emailing j.bickerton@newsweek.com\n\nJames Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is on covering news and politics                                    ...Read more",
        "source_3": "Rep. Laura Gillen, D-N.Y., reacts to Democratic socialist Zohran Mamdani winning New York City’s mayoral primary race.\n\nSocialist Zohran Mamdani, the presumptive Democratic nominee for New York City mayor, is facing criticism over a campaign policy document that explicitly calls for shifting the city’s tax burden onto \"richer and whiter neighborhoods.\"\n\nMamdani caused a political earthquake in this week’s primary, trouncing former New York Gov.Andrew Cuomoin a stunning upset, all but securing his place on the November ballot. Housing affordability has been a central pillar of his campaign.\n\nApolicy documenttitled \"Stop the Squeeze on NYC Homeowners\" from Mamdani’s mayoral campaign website argues that the city’s current property tax system disproportionately benefits wealthy, White homeowners, particularly in Manhattan and affluent areas of Brooklyn, by allowing them to pay far less in taxes due to outdated assessment caps.\n\nZohran Mamdani speaking and a leafy neighborhood.(Theodore Parisienne for New York Daily News ;Beata Zawrzel/NurPhoto via Getty Images)\n\nCITY-RUN GROCERY STORES, DEFUNDING POLICE, SAFE INJECTION SITES: WHAT TO KNOW ABOUT NYC'S NEXT POTENTIAL MAYOR\n\nIn contrast, Black, Latino and immigrant homeowners in neighborhoods like Brownsville and Jamaica in the outer borough of Queens are overburdened and at higher risk of foreclosure.\n\n\"Shift the tax burden from overtaxed homeowners in the outer boroughs to more expensive homes in richer and whiter neighborhoods,\" the proposal reads. \"The property tax system is unbalanced because assessment levels are artificially capped, so homeowners in expensive neighborhoods pay less than their fair share.\"\n\nThe proposal would reduce the taxable portion of assessed property values citywide, and offset that by raising actual tax rates in wealthier areas. The result: lower tax bills for lower-income neighborhoods and higher ones for affluent areas — which the campaign describes as \"richer and whiter.\"\n\nThe racial component of the policy position has come in for criticism online, with broadcaster Mark Levinsharing a New York Poststory about the proposal and writing \"Oh, and Mamdani is racist, too.\"\n\nPolitical commentator Eric Daugherty also brandished it as explicitly \"racist\" on X, while the New York Post editorial board also slammed the proposal as \"pure racism.\"\n\nFox News Digital reached out to Mamdani’s campaign for comment but did not immediately receive a response.\n\nThe campaign document also highlights racial disparities in deed theft and \"tangled titles,\" which are situations where someone lives in a home they believe they own — often through inheritance — but their name is not on the deed, creating legal uncertainty about ownership.\n\nThe document states that predominantly Black neighborhoods face these challenges at much higher rates than White neighborhoods.\n\nTo address this, Mamdani is proposing a $10 million \"Tangled Title Fund\" to help city residents hire lawyers and clear legal titles so they can secure full homeownership rights and benefits.\n\nREPUBLICANS USE MAMDANI BOMBSHELL VICTORY OVER CUOMO AS AMMUNITION TO BLAST DEMOCRATS AS EXTREMISTS\n\nMamdani is a member of theDemocratic Socialists of America, whose preamble discusses a way to \"end white supremacy and racial oppression because its destruction is in the interest of all workers, including white workers.\"\n\nOverall, the housing document frames the city’s housing inequities as structurally racist and economically unjust.\n\nThe document also claims that the city’s tax lien sale system is exploitative and racist. When a homeowner falls behind on property taxes under the system, the city sells that debt to a private trust of Wall Street-backed investors, usually at a discount. instead of collecting the debt directly.\n\n\"The tax lien sale has been particularly harmful to Black, brown, and working-class homeowners, leading many homeowners to lose their home to foreclosure, or forcing them to sell below market value in order to pay off their accumulating debts,\" the document reads. \"The city is six times more likely to sell a tax lien in a Black neighborhood than a white neighborhood. This policy is extracting wealth from Black, brown, and working-class communities and stripping New Yorkers of their homes.\"\n\nZohran Mamdani, New York City mayoral candidate, speaks during an election night event in New York on June 25, 2025.(Christian Monterrosa/Bloomberg via Getty Images)\n\nMamdani said he will end the system on his first day in office and create a new tax collection system that provides \"additional opportunities\" for homeowners to enter into payment plans, pay down their debt and stay in their homes.\n\nThe Queens assemblyman wants to build 200,000 new publicly-subsidized affordable homes and immediately freeze rents for the city’s 2.4 million stabilized tenants. His proposals call for multi-year rent freezes and massive investment inpublic housing. Critics argue his proposals could worsen existing problems in the rental market,\n\nFox News' Madison Colombo contributed to this report.\n\nMichael Dorgan is a writer for Fox News Digital and Fox Business.\n\nYou can send tips to michael.dorgan@fox.com and follow him on Twitter @M_Dorgan.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}