{
    "question": "How might the Pentagon’s pause in some military aid to Ukraine influence Russia’s war calculus and reshape Ukraine’s push for weapons cooperation with EU partners?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nRussian forces overnight struck Kharkiv and the region with Shahed drones, one person was killed and four injured in the region, according to administration head Oleh Syniehubov. A car shop, a residential buildings, and other civilian infrastructure were damaged in Kharkiv.\n\nA manufacturer demonstrates a Ukrainian made drone at a Ukraine Defense Innovations exhibition for military clients on an undisclosed location in Ukraine, Friday, April 11, 2025. (AP Photo/Efrem Lukatsky, File)\n\nUkrainian-made fixed-wing Besomar 3210 drone interceptors are handed over to the Armed Forces by Kozytskyi Charity Foundation in an undisclosed location in the Lviv region, western Ukraine, Friday, Feb. 21, 2025. (AP Photo/Mykola Tys, File)\n\nA manufacturer demonstrates a Ukrainian made unmanned ground vehicle at a Ukraine Defense Innovations exhibition for military clients on an undisclosed location in Ukraine, Friday, April 11, 2025. (AP Photo/Efrem Lukatsky, File)\n\nIn this photo provided by the Ukrainian Emergency Service, emergency services personnel work to extinguish a fire following a Russian attack in Donetsk region, Ukraine, Wednesday, July 2, 2025. (Ukrainian Emergency Service via AP)\n\nIn this photo provided by the Ukrainian Emergency Service, emergency services personnel work to extinguish a fire following a Russian attack in Donetsk region, Ukraine, Wednesday, July 2, 2025. (Ukrainian Emergency Service via AP)\n\nKYIV, Ukraine (AP) — Ukraine is forging ahead with early plans for joint weapons production with some international allies, top officials said, while warning Wednesday of potential consequences of the U.S. decision tohalt some arms shipmentspromised to help Kyiv fight off Russia’s invasion.\n\n“Any delay or hesitation in supporting Ukraine’s defense capabilities will only encourage the aggressor to continue war and terror, not seek peace,” Ukraine’s Foreign Ministry said.\n\nArenewed Russian pushto capture more land has put Ukraine’s short-handed defenses under severe strain in theall-out warlaunched by Moscow nearly 3½ years ago. Russian missiles and drones arebattering Ukrainian cities. U.S.-led diplomaticefforts to find a peace settlementhave stalled.\n\nUkraine’s Defense Ministry said it hadn’t received any official U.S. notification of a suspension or revision of agreed arms delivery schedules. Officials have requested a phone call with their U.S. counterparts to verify the status of specific items in the pipeline, it said in a statement.\n\nAs Washington — Ukraine’s biggest military backer — has distanced itself from Ukraine’s war efforts under President Donald Trump, a bigger onus has fallen on European countries.\n\nFrench President Emmanuel Macron and Russian President Vladimir Putin on Tuesday held their first direct telephone call in almost three years. Macron’s office said that during their two-hour conversation, the French leader underlined France’s “unwavering support for Ukraine’s sovereignty and territorial integrity” and called for a ceasefire.\n\nWashington’s decision could remove some of the most formidable weapons in Ukraine’s battlefield arsenal, including some air defense missiles, precision-guided artillery and other weapons,according to AP sources.\n\nThe U.S. decision should prompt European Union countries to spend more on developing Ukraine’s defense industry, Danish Defense Minister Troels Lund Poulsen said.\n\n“It just underlines the need for Europe to do more, and also to invest more in Ukraine,” Lund Poulsen told reporters. “We could do even more, to give them a stronger way of fighting back.”\n\nDenmark on Tuesday took over the EU’s rotating presidency for six months. It is already investing directly in Ukraine’s defense industry, which can produce arms and ammunition more quickly and cheaply than elsewhere in Europe.\n\nDenmark is also allowing companies from Ukraine to set up shop in Denmark and manufacture military equipment on safer ground. Lund Poulsen said the first companies could start work as soon as September, and he urged European partners to follow suit.\n\nUkrainian President Volodymyr Zelenskyy in his daily address on Tuesday evening said officials are preparing with a sense of urgency for upcoming meetings with EU countries and other partners to talk about cooperation in weapons manufacturing.\n\nDefense Minister Rustem Umerov announced that draft legislation on joint weapons production with allies is expected to be put to a vote in the Ukrainian parliament later this month. The proposed laws were shown to national defense companies on Tuesday, Umerov said.\n\nThe program includes plans to create a special legal and tax framework to help Ukrainian defense manufacturers scale up and modernize production, including building new facilities at home and abroad, according to Umerov.\n\nEarlier this week, German Foreign Minister Johann Wadephul said during a visit to Kyiv that Germany aims to help Ukraine manufacture more weapons more quickly. He was accompanied on the trip by German defense industry representatives.\n\nThe U.S. is halting some weapons deliveries to Ukraine out of concern that its own stockpiles have declined too far, officials said Tuesday. Certain munitions were longer-term commitmentspromised to Ukraineunder the Biden administration, though the Defense Department didn’t provide details on what specific weapons were being held back.\n\nThe details on the weapons in some of the paused deliveries were confirmed by a U.S. official and former national security official familiar with the matter. Both requested anonymity to discuss what is being held up as the Pentagon has yet to provide details. The halt includes some shipments of Patriot missiles, precision-guided GMLRS, Hellfire missiles and Howitzer rounds.\n\nUkraine’s Foreign Ministry summoned the U.S. chargé d’affaires, John Hinkel, on Wednesday to discuss ongoing defense cooperation.\n\nDeputy Foreign Minister Maryana Betsa thanked the U.S. for its continued support, but emphasized the “critical importance” of maintaining previously allocated defense packages, especially for bolstering Ukraine’s air defense.\n\nKremlin spokesman Dmitry Peskov said the Pentagon’s decision will help bring a settlement closer, because “the fewer weapons supplied to Ukraine, the closer the end of the (war) is.”\n\nUnder Trump, there have been no new announcements of U.S. military or weapons aid to Ukraine. Between March and April, the United States allocated no new aid to Ukraine, according to Germany’s Kiel Institute, which tracks such support.\n\nRussia launched its full-scale invasion of its neighbor on Feb. 24, 2022. For the first time since June 2022, European countries surpassed the U.S. in total military aid, totaling 72 billion euros ($85 billion) compared with 65 billion euros ($77 billion) from the U.S., the institute said last month.\n\nAnalysts say Ukraine’s European allies can fill some of the gaps and provide artillery systems. But they don’t possess alternatives to the U.S.-made HIMARS missiles and air defense systems, especially Patriots, which are crucial to help defend Ukrainian cities.\n\nIt’s not clear how much weaponry Ukraine possesses or what its most urgent needs are.\n\nAssociated Press writer Lorne Cook in Copenhagen, Denmark, contributed to this report.\n\nFollow AP’s coverage of the war in Ukraine athttps://apnews.com/hub/russia-ukraine\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "Ellie Cook is a Newsweek security and defense reporter based in London, U.K. Her work focuses largely on the Russia-Ukraine war, the U.S. military, weapons systems and emerging technology. She joined Newsweek in January 2023, having previously worked as a reporter at the Daily Express, and is a graduate of International Journalism at City, University of London. Languages: English, Spanish.You can reach Ellie via email ate.cook@newsweek.com.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nWith U.S. weapons and missile flows stanched at Ukraine's borders, Kyiv is bracing for how it will keep its air defenses firing in the face of intense Russian bombardment and its guns leveled at slowly advancing Russian forces.\n\n\"I hope it's a temporary halt related to the need to make some calculations with regard to American stockpiles,\" said Oleksandr Merezhko, the chair of Ukraine's parliamentary Foreign Affairs Committee.\n\n\"I also hope that those people who have taken this decision fully realize what consequences it might have for Ukraine, including safety of civilian population, if we don't get on time the necessary munitions,\" Merezhko toldNewsweek.\n\nOn Tuesday, the U.S. confirmed it hadpaused the deliveryof some of Ukraine's most in-demand equipment and supplies. Politico first reported that a review of U.S. munitions stockpiles had raised concerns over a dip in the Department of Defense's stockpiles, and that an initial decision to hold back some military aid pledged during the previous administration was made almost a month ago.\n\nThe stoppage applies to aid Ukraine receives both through the Ukraine Security Assistance Initiative (USAI) and through donations pulled fromU.S. militarystocks, according to the report. Under USAI, Washington has been able to buy equipment for Ukraine from American industry players.\n\nThe U.S. has provided about $67 billion in military aid to Ukraine since Russia launched its full-scale invasion of its neighbor in February 2022, the State Department said in a March news release. U.S. forces—and, crucially, the country's stockpiles—have also beenheavily involved in the Middle East, including by intercepting missiles heading for Israel.\n\n\"This decision was made to put America's interests first following a review of our nation's military support and assistance to other countries across the globe,\" White House spokesperson Anna Kelly said. \"The strength of the United States Armed Forces remains unquestioned—just ask Iran.\"\n\nLast month, the U.S.carried out large-scale strikeson several Iranian nuclear sites.\n\nUkraine's Defense Ministry said on Wednesday it had not \"received any official notifications about the suspension or revision of the delivery schedules of the agreed defense assistance.\"\n\nThe delayed weapons include rounds for 155 mm howitzers, more than 100 Hellfire missiles and precision-guided rounds known as GMLRS,NBCNews reported.\n\nThe U.S. has also paused its deliveries of short-range Stinger missiles widely used by Ukraine and dozens of Patriot air defense missiles, vital for protecting major Ukrainian cities from Russia's most advanced weapons. Getting more of the U.S.-made Patriot systems, credited with knocking out Russia's hypersonic missiles, has consistently beenone of Ukraine's top priorities.\n\nRussia has hammered Ukraine with intensive waves of aerial strikes in recent weeks as ceasefire talks have failed to yield any progress toward an agreement. Ukraine's air force said on Tuesday that Kyiv shot down 4,750 air targets in June alone, including almost 100 Kh-101 cruise missiles and 14 short-range ballistic missiles.\n\nAir defense is the primary concern among Ukrainian officials, although Moscow has continued plugging away with small but steady advances along the front lines in the east. Kyiv's Defense Ministry said on Wednesday it had requested more information from the U.S., and that it was \"critically important\" to strengthen its air defense network.\n\n\"Even a partial suspension of U.S. military aid could be critical for Ukraine,\" said Oleksiy Goncharenko, a Ukrainian lawmaker for the country's southern Odesa region.\n\n\"Russia continues to bombard our cities almost every night, drones are shot down over Ukraine, and roughly once a week, Russia carries out massive missile attacks,\" he toldNewsweek. \"In other words, we are being denied the means to defend ourselves.\"\n\n\"I sincerely hope the United States will consider providing air defense support, as we urgently need it, especially to protect our civilians,\" Goncharenko added.\n\n\"Russia will definitely use any delay in providing American military aid to Ukraine and might intensify bombardments of civilian objects,\" Merezhko said.\n\nPatriot missiles are the \"most vulnerable point\" in the aid blockage, Ivan Stupak, a former official with Ukraine's SBU security service, toldNewsweek.\n\nWhen asked about Patriot missiles during theNATOsummit in The Hague last week, U.S. PresidentDonald Trumpsaid Washington was \"going to see if we can make some available.\"\n\n\"They're very hard to get,\" he added. \"We need them, too. We were supplying them to Israel.\"\n\nThe outbreak of fresh violence in the Middle East has used up interceptor missiles of many types, but mainly those fired by the American Terminal High Altitude Area Defense (THAAD) systems, which intercept ballistic missiles, and missiles fired from ships, said Sidharth Kaushal, a research fellow with the British think tank the Royal United Services Institute.\n\nWhile Patriot missiles have occasionally been used in the Middle East, a \"considerable number\" were sent to Ukraine, Kaushal toldNewsweek. But the U.S. has replenished some of its stocks through buying back missiles, diverting shipments from export customers and benefiting from increased production rates for Patriot missiles, he continued.\n\n\"Inventory stockpiles are not critically low,\" Kaushal said. But the demand for Patriots is \"growing significantly,\" not least in the Indo-Pacific, he added.\n\nThe exact number of munitions in the U.S. arsenal is not public knowledge.\n\nFormerPentagonofficial Jim Townsend toldNewsweekthat the Department of Defense has always been concerned about Patriot missile stocks, particularly for use in the Indo-Pacific and against Houthi rebels launching missiles from Yemen. \"We've always been thin on Patriot,\" he said.\n\n\"This is not about stockpiles,\" said retired U.S. Army General Ben Hodges, who formerly headed U.S. Army Europe. \"It's a choice of this administration to placate Russia, at the expense of Ukraine,\" Hodges toldNewsweek.\n\nTrump and his senior officials have appeared unwilling to exert painful pressure on Russia during ceasefire negotiations, despite Trump's clear desire to reach an accord and bring Europe's largest land conflict since World War II to an end.\n\nTrump said last week that it was \"more difficult than people would have any idea\" to secure a deal, adding, \"Vladimir Putin has been more difficult.\" Trump has typically veered away from heaping criticism on the Kremlin leader but has swiped at Ukrainian PresidentVolodymyr Zelensky.\n\nWhile Russian missiles and drones rain down across Ukraine, the Russian army is \"still grinding forward\" in the east, John Foreman, a former U.K. defense attaché to Moscow and Kyiv, toldNewsweek.\n\nA Russian-appointed official said earlier this week that Russian forces had seized all of the Luhansk region, one of two eastern Ukrainian regions forming the Donbas area, Ukraine's industrial heartland. The claim has not been corroborated by other sources, including Russia's community of influential military bloggers.\n\nRussia says it annexed Luhansk and three other regions in the east in 2022, but the move is not internationally recognized.\n\nMoscow has not established full control over any of the regions it has claimed as annexed. Russia has for many months controlled about 99 percent of Luhansk, according to analysis published by the Institute for the Study of War think tank, but it has struggled to capture the remaining land.\n\nRussia has also contended with shortages of munitions, despite warping its economy by putting it on a teetering war footing. Its advance is costing Moscow dearly, said Daniel Rice, a former aide to Ukraine's commander in chief and the president of American University Kyiv.\n\n\"Firing tens of thousands of artillery shells daily depletes even a massive magazine,\" he toldNewsweek. \"Russia had to solve this bypartnering with North Korea.\"\n\nRussia has received extensive deliveries of shells and short-range ballistic missiles from Pyongyang. Last year, North Korea became the first country not directly involved in Russia's invasion of Ukraine to commit troops to the front line.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nEllie Cook is a Newsweek security and defense reporter based in London, U.K. Her work focuses largely on the Russia-Ukraine war, the U.S. military, weapons systems and emerging technology. She joined Newsweek in January 2023, having previously worked as a reporter at the Daily Express, and is a graduate of International Journalism at City, University of London. Languages: English, Spanish.You can reach Ellie via email ate.cook@newsweek.com.\n\nEllie Cook is a Newsweek security and defense reporter based in London, U.K. Her work focuses largely on the Russia-Ukraine war, the U.S. military, weapons systems and emerging technology. She joined Newsweek in January 2023, having previously worked as a reporter at the Daily Express, and is a graduate of International Journalism at City, University of London. Languages: English, Spanish.You can reach Ellie via email ate.cook@newsweek.com.\n\nEllie Cook is a Newsweek security and defense reporter based in London, U.K. Her work focuses largely on the Russia-Ukraine                                    ...Read more",
        "source_3": "Fox News’ Alex Hogan reports on one of the largest Russian attacks on Ukraine since the war began. Fox News contributor Mike Pompeo also breaks down the Trump administration’s travel ban and discusses the U.S. role in potential peace talks.\n\nThe Pentagon’s decision to halt previously promised air defense systemsto Ukrainewas met with ominous warnings on Wednesday from Washington-based security experts, who warned the move will \"encourage\" and possibly \"escalate\" Russian President Vladimir Putin’s war ambitions.\n\nThe decision was confirmed by Fox News Tuesday night after Under Secretary of Defense for Policy Elbridge Colby assessed that the U.S. possessed dangerously low munitions stockpiles.\n\nHowever, experts are sounding the alarm that the move undermines U.S. and Ukrainian leverage as PresidentDonald Trumplooks to broker a ceasefire deal.\n\nPENTAGON HALTS SOME WEAPONS SHIPMENTS TO UKRAINE OVER CONCERNS ABOUT US STOCKPILES\n\nUkrainian President Volodymyr Zelenskyy stands in front of a Patriot air defense missile system during a visit to a military training area in the German state of Western Pomerania, on Tuesday, June 11, 2024.(Jens Buettner/dpa via AP)\n\n\"The Trump administration is right to put American warfighters first,\" John Hardie, deputy director of the Foundation for Defense of Democracies’ (FDD) Russia Program, said in a statement to Fox News Digital. \"Many of these munitions were not drawn from U.S. stocks but were instead procured specifically for Kyiv under the Ukraine Security Assistance Initiative.\"\n\nU.S. military officials confirmed that the weapons set for shipment to Ukraine were already staged in Poland before thePentagonissued its order to reverse supplies pledged during the Biden administration.\n\n\"By weakening Ukraine's defenses and fueling perceptions that America is tiring of supporting Ukraine, this decision will likelyreinforce Putin'sbeliefthat he has the upper hand,\" Hardie argued. \"This will make him even more intransigent.\"\n\nFox News confirmed with U.S. military officials tracking the shipments that the systems withheld include missile interceptors and 155 mm ammunition shells — defensive equipment slated to be delivered at a time whenRussia hasdrastically ramped up its offensive.\n\nRUSSIA CLAIMS GAINS IN UKRAINE AS US ATTENTION FOCUSES ON IRAN WAR\n\nA steelworker moves a 155 mm M795 artillery projectile during the manufacturing process at the Scranton Army Ammunition Plant in Scranton, Pennsylvania, on Thursday, April 13, 2023.(AP Photo/Matt Rourke)\n\nIn June, Russian forces broke their previous record for the number of drones fired at Ukraine in a single month by levying more than 5,300 drones in a series of mass attacks — up from the previous record set in March when nearly 4,200 drones were launched.\n\n\"Putin has launched an intensified aerial assault, targeting civilians in cities across Ukraine with hundreds of drones and missiles,\" founder and FDD President Clifford May told Fox News Digital. \"Cutting off or even slowing munitions to Ukraine now can only encourage Putin to continue and even escalate this offensive.\n\n\"That cannot be what President Trump wants,\" he added.\n\nUkraineechoed these concernson Wednesday and called the U.S. chief diplomat in Kyiv to meet with Foreign Ministry officials.\n\n\"The Ukrainian side emphasized that any delay or slowing down in supporting Ukraine's defense capabilities would only encourage the aggressor to continue war and terror, rather than seek peace,\" the ministry said following its meeting with John Ginkel, deputy chief of mission at the U.S. Embassy in Kyiv.\n\nNeither the U.S. Embassy nor the Ukrainian Foreign Ministry immediately responded to Fox News Digital’s questions regarding the meeting.\n\nOvernight, Russia launched its largest aerial assault on Ukraine since the war started as fires burned in Kyiv on May 25, 2025.(Reuters/Gleb Garanich)\n\nThe attacks by Russia, which have increased in severity and frequency, have coincided with unsuccessful efforts to secure a ceasefire by the Trump administration, and come as Putin has also amassed some 50,000 troops along Ukraine’s northern border in what some fear could signal plans to launch another ground offensive.\n\nSpecial Envoy to Ukraine Gen. Keith Kellogg did not immediately respond to Fox News Digital’s questions over how the Pentagon’s order will impact the war and ceasefire attempts.\n\nFox News' Jennifer Griffen and Jasmine Baehr contributed to this report.\n\nCaitlin McFall is a Reporter at Fox News Digital covering Politics, U.S. and World news.\n\nFox News' Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.\"\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}