{
    "question": "How might the Wisconsin Supreme Court’s 4-3 decision to invalidate the 1849 abortion law affect abortion access, prosecutorial practices, and the broader legal landscape in the state going forward?",
    "content": {
        "source_1": "After the U.S. Supreme Court overturned Roe v. Wade in 2022, Republican prosecutors in Wisconsin said they intended to enforce the old law.\n\nThe Wisconsin Supreme Court invalidated a state abortion ban that was enacted in 1849 and had been dormant for five decades.\n\nThe decision on Wednesday settles an uncertainty that has surrounded abortion law in the state since June 2022, when the U.S. Supreme Court overturned Roe v. Wade, ending the constitutional right to an abortion nationwide.\n\nIt also reflects the significance of the state’s elections for Supreme Court justices, which have been hotly contested and revolved largely around abortion rights since the fall of Roe.\n\nThecourt ruled 4-3 to strike down the ban, and while the justices are officially nonpartisan, the decision split them along ideological lines. A new justice who had campaigned on her support for abortion rights, Janet Protasiewicz, joined the majority.\n\nThe 1849 state law had said that anyone other than the pregnant woman “who intentionally destroys the life of an unborn child” could face six years in prison and a $10,000 fine. The only exception was for a “therapeutic abortion” to save the life of the pregnant woman.\n\nAfter the U.S. Supreme Court’s decision to overturn Roe returned the regulation of abortion to the states, Gov. Tony Evers and the attorney general, Josh Kaul, both Democrats, sued to invalidate the 1849 ban. They argued that it had been effectively repealed over the years by other abortion regulations, including a law that prohibits abortion after 20 weeks of pregnancy and one that imposes a 24-hour waiting period for abortions.\n\nWe are having trouble retrieving the article content.\n\nThank you for your patience while we verify access. If you are in Reader mode please exit andlog intoyour Times account, orsubscribefor all of The Times.\n\nThank you for your patience while we verify access.",
        "source_2": "Shane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nThe liberal majority on the WisconsinSupreme Courthas struck down an abortion ban in the state that dates back 176 years, ruling 4-3 that it was superseded by a newer state law that criminalizes abortions only after a fetus can survive outside the womb.\n\nState lawmakers adopted the ban in 1849, making it a felony when anyone other than the mother \"intentionally destroys the life of an unborn child.\"\n\n\"We conclude that comprehensive legislation enacted over the last 50 years regulating in detail the 'who, what, where, when, and how' of abortion so thoroughly covers the entire subject of abortion that it was meant as a substitute for the 19th century near-total ban on abortion,\" the ruling states.\n\nJustices said they \"hold that the legislature impliedly repealed\" the old law on abortion, known as s.940.04, so it \"does not ban abortion in the State of Wisconsin.\"\n\nIn his dissenting opinion, Justice Brian Hagedorn said the decision \"does not derive from a neutral application of the law; it does not even pass the smell test.\"\n\n\"Sure, the majority opinion is laden with legal jargon a reader might think reflects a reasoned judicial opinion. Don't be fooled,\" Hagedorn wrote.\n\n\"This is pure policymaking, driven by antagonism toward a law the majority does not like. The end result is that the policies enacted by the people's representatives are gone—scratched out with a giant judicial eraser.\"\n\nThe ban was in effect until 1973, when the U.S. Supreme Court's landmarkRoe v. Wadedecision legalizing abortion nationwide nullified it.\n\nLegislators never officially repealed the ban, however, and conservatives argued that the U.S. Supreme Court's 2022 decision to overturnRoereactivated it.\n\nWisconsin Attorney General Josh Kaul, a Democrat, filed a lawsuit that year arguing that the ban was trumped by abortion restrictions that legislators enacted during the nearly half-century thatRoewas in effect.\n\nKaul specifically cited a 1985 law that essentially permits abortions until viability. Some babies can survive with medical help after 21 weeks of gestation.\n\nSheboygan County District Attorney Joel Urmanski, aRepublican, defended the ban in court, arguing that the 1849 law could co-exist with the newer abortion restrictions, just as different penalties for the same crime co-exist.\n\nDane County Circuit Judge Diane Schlipper ruled in 2023 that the 1849 ban outlaws feticide, which she defined as the killing of a fetus without the mother's consent, but not consensual abortions.\n\nAbortions have been available in the state since that ruling, but the state Supreme Court decision gives providers and patients more certainty that abortions will remain legal in Wisconsin.\n\nUrmanski asked the state Supreme Court to overturn Schlipper's ruling without waiting for a decision from a lower appellate court. It was expected as soon as the justices took the case that they would overturn the ban because of the liberal majority.\n\nWisconsin Democratic GovernorTony Everscalled the ruling \"a win for women and families, a win for health care professionals who want to provide medically accurate care to their patients, and a win for basic freedoms in Wisconsin, but our work is not over.\"\n\nMichelle Velasquez, chief strategy officer at Planned Parenthood of Wisconsin, an abortion rights group, hailed the ruling in a statement as \"an important step forward in ensuring access to abortion in Wisconsin.\"\n\n\"While we celebrate this ruling, there is more to be done,\" Velasquez said. \"We will continue working to protect and expand reproductive freedom in Wisconsin so that everyone who needs comprehensive reproductive health care in our state can get the nonjudgmental and compassionate care they deserve.\n\n\"The Court has yet to decide on our original action, which they accepted last summer, about whether the Wisconsin Constitution protects the right to bodily autonomy, including the explicit right to abortion. We look forward to moving that important case forward.\"\n\nBut Dan Miller, state director of Pro-Life Wisconsin, an anti-abortion group, said his organization \"wholly opposes this egregious ruling overturning Wisconsin's abortion ban from the moment of conception.\"\n\n\"To rule that all of s.940.04 has nothing to do with a consensual, medically induced abortion defies the plain wording and meaning of the statute. It is an extraordinary leap in logic,\" Miller said.\n\n\"Anyone who ruled to overturn s.940.04 should be disbarred. Wisconsinites should be horrified that the highest court in our state is willing to trample the rights of our brothers and sisters in Christ who have not been born yet.\n\n\"If they can make killing babies in the womb legal, who will they target next?\"\n\nMiller added: \"We thank Justices Hagedorn, Bradley and Ziegler for standing up for hope. A hope that all human beings, including those currently in the womb, will enjoy the same rights to life, liberty and the pursuit of happiness that any other citizen of these United State of America now enjoys under the 14th Amendment.\"\n\nThis article includes reporting by The Associated Press.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check                                    ...Read more",
        "source_3": "The ‘Fox News Sunday’ panel discusses the vital Supreme Court race in Wisconsin capturing the attention of the nation and more.\n\nThe Wisconsin Supreme Court's newly elected liberal majority on Wednesdayvoted to strike downa near-total state abortion ban, voting 4-3 to overturn the stringent, 176-year-old law.\n\nThe decision reflected a deeply partisan split, with all four liberal justices voting to invalidate the 1849 abortion law and the three conservative justices dissenting.\n\nIt also crystallized the impact of thestate's Supreme Court electionearlier this year that raked in millions of dollars in donations, the highest amount in U.S. history for a judicial race. It included involvement from then-Trump ally Elon Musk, former President Barack Obama and others.\n\nWriting for the majority, Justice Rebecca Dallet said the law had been superseded by more recent precedent, including a 1985 statute that allowed for abortions up to the point of fetal viability, or around the 20-week mark.\n\nAFTER STINGING ELECTION DEFEATS, DNC EYES RURAL VOTERS AS KEY TO 2026 MIDTERM SUCCESS\n\nProtesters in the Wisconsin Capitol Rotunda during a march supporting the overturning of Wisconsin's near-total ban on abortion in Madison in 2023.(AP Photo/Morry Gash)\n\n\"We conclude that comprehensive legislation enacted over the last 50 years regulating in detail the 'who, what, where, when, and how' of abortion so thoroughly covers the entire subject of abortion that it was meant as a substitute for the 19th century near-total ban on abortion,\" Dallet wrote.\n\n\"Accordingly, we hold that the legislature impliedly repealed [the 1849 ban] to abortion, and that [that law] therefore does not ban abortion in the State of Wisconsin.\"\n\nConservative Justice Annette Ziegler, in a dissent, described the ruling as \"a jaw-dropping exercise of judicial will\" and charged that the liberal justices ruled on the matter based on their personal preferences.\n\nThe 1849 law, and efforts to revive it, came to the fore in Wisconsin in 2022, after the U.S. Supreme Court ruled to overturn Roe v. Wade — effectively snapping back into place the state law that had been dormant for decades.\n\nJUDGES V, TRUMP: HERE ARE THE KEY COURT BATTLES HALTING THE WHITE HOUSE AGENDA\n\nDemonstrators protest outside an event hosted by Circuit Court Judge Brad Schimel, candidate for the Wisconsin Supreme Court, March 25, 2025, in Jefferson, Wis.(Getty Images)\n\nThe Wisconsin law made it a felony for individuals in Wisconsin to perform abortions, including when the health of the woman was at risk, and without exceptions in cases of rape or incest.\n\nThough the law was not enforced by the state in recent years, at least some Republicans had urged the state Supreme Court to keep it in place, prompting opponents to push more urgently for it to be struck down.\n\nThe 4-3 decision puts to rest the possibility that it could be revived.\n\nNINTH CIRCUIT REJECTS TRUMP'S BID TO REINSTATE BIRTHRIGHT CITIZENSHIP ORDER\n\nIt's also the clearest sign to date of the impact that liberals on the bench could have after they regained the court majority in 2023 for the first time in 15 years.\n\nThe closely watched state Supreme Court race in Wisconsin was the most expensive judicial election in U.S. history, attracting more than $100 million in donations and far eclipsing the $56 million spent on the state Supreme Court race just two years earlier, according to figures compiled by the Brennan Center for Justice.\n\nSusan Crawford ultimately beat out conservative candidate Brad Schimel, who was backed by PresidentDonald Trumpand Musk.\n\nElon Musk, CEO of Tesla Inc., wears a cheesehead hat during an America PAC town hall ahead of the Wisconsin Supreme Court election at the KI Convention Center in Green Bay, Wis., March 30, 2025.(Jamie Kelter Davis/Bloomberg)\n\nMusk personally donated $3 million to the Wisconsin Republican Party earlier this year, while his two super PACs spent more than $17 million on Schimel's behalf.\n\nWisconsin Gov. Tony Evers praised the state Supreme Court decision Wednesday, describing it as a win \"for women and families\" and healthcare professionals in the state.\n\n\"Three years ago, the U.S. Supreme Court upended five decades of precedent and threw reproductive freedom in Wisconsin and across our country into chaos,\" Evers said in a statement. \"I promised then to fight like hell to ensure every Wisconsinite has the freedom to consult their family, their faith and their doctor and make the reproductive healthcare decision that is right for them, and I've never stopped.\n\n\"Today, the Wisconsin Supreme Court upheld that basic freedom.\"\n\nBreanne Deppisch is a national politics reporter for Fox News Digital covering the Trump administration, with a focus on the Justice Department, FBI, and other national news.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}