{
    "question": "What are the potential implications of Paramount’s $16 million settlement with President Trump over the “60 Minutes” interview—including the pledge to release transcripts of future presidential-candidate interviews—for journalistic standards, corporate decision-making, and public trust in major news outlets?",
    "content": {
        "source_1": "President Trump had sued over an interview with former Vice President Kamala Harris. The company needs federal approval for a multibillion-dollar sale.\n\nByBenjamin MullinMichael M. GrynbaumLauren HirschandDavid Enrich\n\nParamount said late Tuesday that it had agreed to pay President Trump $16 million to settle his lawsuit over the editing of an interview on the CBS News program “60 Minutes,” an extraordinary concession to a sitting president by a major media organization.\n\nParamount said its payment included Mr. Trump’s legal fees and costs and that the money, minus the legal fees, would be paid to Mr. Trump’s future presidential library.\n\nAs part of the settlement, Paramount said, it agreed to release written transcripts of future “60 Minutes” interviews with presidential candidates. The company said the settlement did not include an apology.\n\nThe deal is the clearest sign yet that Mr. Trump’s ability to intimidate major American institutions extends to the media industry.\n\nMany lawyers had dismissed Mr. Trump’s lawsuit as baseless and believed that CBS would have ultimately prevailed in court, in part because the network did not report anything factually inaccurate, and the First Amendment gives publishers wide leeway to determine how to present information.\n\nBut Shari Redstone, the chair and controlling shareholder of Paramount, told her board that she favoredexploring a settlementwith Mr. Trump. Some executives at the company viewed the president’s lawsuit as a potential hurdle to completinga multibillion-dollar saleof the company to the Hollywood studio Skydance, which requires the Trump administration’s approval.\n\nAfter weeks of negotiations with a mediator, lawyers for Paramount and Mr. Trump worked through the weekend to reach a deal ahead of a court deadline that would have required both sides to begin producing internal documents for discovery, according to two people familiar with the negotiations. Another deadline loomed: Paramount was planning to make changes to its board of directors this week that could have complicated the settlement negotiations.\n\nA spokesman for Mr. Trump’s legal team said in a statement that the settlement was “another win for the American people” delivered by the president, who was holding “the fake news media accountable.”\n\n“CBS and Paramount Global realized the strength of this historic case and had no choice but to settle,” the spokesman said.\n\nThe size of the settlement, $16 million, is the same sum that ABC Newsagreed to payin December to settle a defamation case filed by Mr. Trump against the network and one of its anchors, George Stephanopoulos. Paramount’s board was concerned that paying a higher amount to settle the case could increase the company’s exposure to potential legal actions from shareholders accusing it of bribery.\n\nThe sale of Paramount would end the Redstone family’s decades-long control of CBS News and Paramount Pictures and put them in the hands of David Ellison, the son of Larry Ellison, a tech billionaire who has backed Mr. Trump.\n\nBrendan Carr, the chairman of the Federal Communications Commission,has saidthe president’s lawsuit against Paramount was not linked to the F.C.C.’s review of the company’s merger with Skydance. Paramount has also said the two issues were unrelated.\n\nWithin the CBS newsroom, a prospective settlement was seen as a low moment in the near-century-long history of a network that once housed Walter Cronkite and Edward R. Murrow, whose famed rebuff of McCarthyism in the 1950s was recently depicted on the Broadway stage by George Clooney. “60 Minutes,” which pioneered on-air investigative reporting, recently completed its 51st consecutive season as the country’s most-watched news program.\n\nMr. Trump sued Paramount for $10 billion last year, claiming that “60 Minutes” deceptively edited an interview with former Vice President Kamala Harris in order to interfere with the election.\n\nThetranscript of the interviewshowed that Ms. Harris gave a lengthy answer to a question about Benjamin Netanyahu, Israel’s prime minister. About 21 seconds of that answer aired in a preview of the interview on “Face the Nation,” another CBS News show. A different seven-second part of the answer aired the next day in a prime-time episode of “60 Minutes.”\n\nMr. Trumpsaid in his lawsuitthat CBS’s actions amounted to “news distortion” that was aimed at tipping the scales in favor of the Democratic Party. Paramount disputed that characterization.\n\nEven before its resolution, Mr. Trump’s lawsuit — and Ms. Redstone’s apparent willingness to entertain a settlement — had engulfed CBS News in turmoil. Tensions within the network over how to handle the president’s legal attacks contributed to theresignationof the “60 Minutes” executive producer, Bill Owens; the CBS News president, Wendy McMahon, was laterforced out.\n\nWatching the case with Mr. Trump unfold, many CBS journalists believed the long-term credibility of “60 Minutes” was at stake. Scott Pelley, the veteran “60 Minutes” correspondent,said last monththat any settlement would be “very damaging to CBS, to Paramount, to the reputation of those companies.”\n\nExecutives at CBS and Paramount applied more scrutiny than usualto segments on “60 Minutes” that could be construed as critical of the Trump administration. CBS News has not killed a story because of the pressure, but Mr. Owens, when heresigned in April, said he “would not be allowed” to make independent journalistic decisions. Ms. McMahon said when she left that it had “become clear the company and I do not agree on the path forward.”\n\nMs. Redstone told the board that she was recusing herself from its discussions of how to handle the Trump suit, given that her financial stake in the pending Skydance deal is so much greater than the stakes of other shareholders, whose interests the directors are expected to represent. This spring, she wasdiagnosed with thyroid cancerand has recently been receiving treatment.\n\nEven before her diagnosis, though, she told board members that she wanted the company toexplore a settlementwith Mr. Trump. Ms. Redstone has said she wants to avoid a protracted legal war with the president that could cost hundreds of millions of dollars and jeopardize other divisions that have business with the government.\n\nMs. Redstone has also told confidants that she harbors concerns about the editorial judgment of CBS News. She has acknowledged being troubled by some of her network’s news coverage and on occasion has raised those concerns publicly and spoken to corporate leadership.\n\nSenators like Elizabeth Warren of Massachusetts and Bernie Sanders of Vermont have warned that any payment by Paramount to Mr. Trump could be construed as a bribe, and they said they would consider holding a congressional hearing about it.\n\nThe prospect of being accused of bribery, and perhaps facing legal action because of it, had vexed Paramount’s directors, who had to weigh the corporate benefits of a settlement against the perception that they were greenlighting a deal to secure an unrelated merger.\n\nThe Freedom of the Press Foundation, a First Amendment group, has said it planned to file a lawsuit on behalf of shareholders against Ms. Redstone and the Paramount board in the event of a settlement; the group has retained the prominent litigator Abbe Lowell for its effort.\n\nParamount is planning to make changes to its board on Wednesday. Judith McHale, a long-serving director, is leaving, and the company is planning to add three new directors: Mary Boies, counsel to the law firm Boies Schiller Flexner; Charles E. Ryan, a co-founder of Almaz Capital; and Roanne Sragow Licht, an adjunct professor at Boston University.\n\nBenjamin Mullin reports for The Times on the major companies behind news and entertainment. Contact him securely on Signal at +1 530-961-3223 or atbenjamin.mullin@nytimes.com.\n\nMichael M. Grynbaum is a media correspondent at The Times. He is the author of \"Empire of the Elite,\" a cultural history of Condé Nast magazines.\n\nLauren Hirsch is a Times reporter who covers deals and dealmakers in Wall Street and Washington.\n\nDavid Enrich is a deputy investigations editor for The Times. He writes about law and business.",
        "source_2": "Reporting by Helen Coster and Jack Queen in New York, David Shepardson and Trevor Hunnicutt in Washington, Kanjyik Ghosh and Surbhi Misra in Bengaluru; Editing by Noeleen Walder, Rod Nickel, Kate Mayberry, Chizu Nomiyama, Peter Graff and David Gregorio\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nHelen Coster is a U.S. Presidential Election Correspondent at Reuters, where she writes a mix of spot news, enterprise and analysis stories, with a focus on the Republican Party and conservative media. Prior to 2024 she covered the media industry for Reuters, and was also a Senior Editor on Reuters’ Commentary team. A graduate of Princeton University, she has reported from six countries, including Pakistan, India, and Greece.\n\nJack Queen covers major lawsuits against the Trump administration involving urgent questions of executive power and how their resolution could affect the law and the legal profession in the years to come. Previously, he covered criminal and civil cases against Trump during the interim of his presidential terms, including gavel-to-gavel coverage of his historic hush money trial in New York and his civil fraud trial, which ended in a half-billion-dollar judgment. Jack has also covered high-profile defamation cases including the Dominion Voting Systems' lawsuit against Fox News, which settled for $787 million after intense pretrial litigation. Based in New York, he specializes in breaking news as well as analysis, explainers and other explanatory reporting.",
        "source_3": "Paramount Global and CBS agreedon Tuesday to pay President Trump a sum that could reach north of $30 million to settle thepresident’s election interference lawsuitagainst the network.\n\nTrump will receive $16 million up front. This will cover legal fees, costs of the case, and contributions to his future presidential library or charitable causes, to be determined at Trump’s discretion.\n\nThere is an anticipation that there will be another allocation in the mid-eight figures set aside for advertisements, public service announcements, or other similar transmissions, in support of conservative causes by the network in the future, Fox News Digital has learned.\n\nWith these considerations, CBS would pay well in excess of the $15 million that ABC paid Trump to settle a defamation lawsuit last year. Current Paramount management disputes the additional allocation.\n\nSources close to the situation told Fox News Digital that CBS has agreed toupdate its editorial standardsto install a new mandatory rule.\n\nGoing forward, the network will promptly release full, unedited transcripts of future presidential candidates’ interviews.\n\nPeople involved in the settlement talks have referred to this as the “Trump Rule.”\n\n“With this record settlement, President Donald J. Trump delivers another win for the American people as he, once again, holds the Fake News media accountable for their wrongdoing and deceit. CBS and Paramount Global realized the strength of this historic case and had no choice but to settle. President Trump will always ensure that no one gets away with lying to the American People as he continues on his singular mission to Make America Great Again,” a spokesperson for Trump’s legal team told Fox News Digital.\n\nTrump was seeking $20 billion in his lawsuit against CBS over its handling of a “60 Minutes” interview last year withthen-Vice President Kamala Harris,accusing the network of election interference leading up to the 2024 contest.\n\nCBS is not acknowledging any journalisticwrongdoing with the settlement.\n\n“The settlement will include a release of all claims regarding any CBS reporting through the date of the settlement, including the Texas action and the threatened defamation action,” parent company Paramount said in a statement.\n\nThe lawsuit alleged CBS News deceitfully edited an exchange Harris had with “60 Minutes” correspondent Bill Whitaker, who asked her whyIsraeli Prime Minister Benjamin Netanyahuwasn’t “listening” to the Biden administration.\n\nHarris was widely mocked for the “word salad” answer that aired in a preview clip of the interview on CBS’s “Face the Nation.”\n\nHowever, when the same question aired during a primetime special on the network, Harris had a different, more concise response.\n\nCritics at the time accused CBS News of deceitfully editing Harris’s “word salad” answer to shield the Democratic nominee from further backlash leading up to Election Day.\n\nThe raw transcriptand footage released earlier this year by the FCC showed that both sets of Harris’s comments came from the same response, but CBS News had aired only the first half of her response in the “Face the Nation” preview clip and aired the second half during the primetime special.\n\nCBS News had long denied any wrongdoing and stood by the broadcast and its reporting.\n\nParamount and Trump’s legal team had agreed to mediation designed to help the sides reach a settlement.\n\nIt was widely believed that Paramount Global’scontrolling shareholder,Shari Redstone,wanted to settle the suit ahead of a planned multibillion-dollar merger with Skydance Media in hopes of preventing potential retribution by Trump’s FCC, which has the authority to halt the transaction.\n\n“This lawsuit is completely separate from, and unrelated to, the Skydance transaction and the FCC approval process. We will abide by the legal process to defend our case,” Paramount said in a previous statement on the Skydance transaction.\n\nA Redstone spokesperson did not immediately respond to a request for comment.\n\nTrump confidently declared the case against CBS a “winner” in April.\n\n“They cheated and defrauded the American People at levels never seen before in the Political Arena. Kamala Harris, during Early Voting and,immediately before Election Day,was asked a question, and gave an answer, that was so bad and incompetent that it would have cost her many of the Votes that she ended up getting,” Trump posted on Truth Social ahead of mediation, going on to accuse the newsmagazine of perpetrating a fraud on the American people.\n\nSen. Bernie Sanders (I-Vt.) and eight Democratic colleagues sent a letter to Redstone in May asking her not to settle thelawsuit against CBS News,which they called an “attack on the First Amendment.” They called the potential settlement a “grave mistake” and “a blatant attempt to intimidate the media and those who speak out against him, President Trump.”\n\nThe letter also stated that “presidents do not get to punish or censor the media for criticizing them” in the United States.\n\nEarlier this year, FCC Chair Brendan Carr ordered CBS News to hand over the unedited transcript as part of its probe into whether the network violated the FCC’s “news distortion” policy after a complaint was filed. CBS had refused to release the unedited transcript until the FCC got involved.\n\nTrump’s attorneys amended their lawsuit to include multiple excerpts from the unedited transcript in hopes of bolstering their case that CBS News withheld unflattering exchanges in order to help the Democratic nominee.\n\nThe saga emerged as a distraction inside CBS News, and longtime “60 Minutes” executive producer Bill Owens walked away from the job in April because he wasn’t able to make the “independent decisions” needed for the program to thrive. Owens, who had insisted CBS did nothing wrong with the Harris edit, was vehemently against offering any sort of apology to the president.\n\nThe settlement does not include a statement of regret. No amount will be paid directly or indirectly to Trump personally.\n\nParamount’s annual stockholders meeting is set for 9 a.m. ET Wednesday, July 2.\n\nCBS News president and CEO Wendy McMahon, who is believed to have been against settling with Trump, announced on May 19 that she was stepping down in another stunning move for the embattled company.\n\n“It’s become clear that the company and I do not agree on the path forward. It’s time for me to move on and for this organization to move forward with new leadership,” McMahon told staffers in a memo that was obtained by Fox News Digital.\n\n“60 Minutes” correspondent Scott Pelley previously said a settlement would be “very damaging to CBS, to Paramount, to the reputation of those companies.” Other high-profile CBS journalists, such as Lesley Stahl, were vehemently against a settlement.\n\n“The unanimous view at ‘60 Minutes’ is that there should be no settlement, and no money paid, because the lawsuit is complete bulls–t,” one veteran “60 Minutes” producer told Fox News Digital last month.\n\nABC also settled a defamation lawsuit in December with then-President-elect Trump for $15 million, after anchor George Stephanopoulos repeatedly and incorrectly asserted that Trump had been found “liable for rape” in a civil trial last year.\n\nFox News Digital’s Brooke Singman contributed to this report."
    }
}