{
    "question": "How might UPenn’s agreement to strip Lia Thomas’ titles and ban transgender athletes from women’s sports, following Title IX findings, shape future policy and the experiences of student-athletes at colleges nationwide?",
    "content": {
        "source_1": "WASHINGTON -- The University of Pennsylvania on Tuesday modified a trio of school records set by transgender swimmer Lia Thomas and said it would apologize to female athletes \"disadvantaged\" by her participation on the women's swimming team, part of a resolution of a federal civil rights case.\n\nThe U.S. Education Department and Penn announced the voluntary agreement of the high-profile case that focused on Thomas, who last competed for the Ivy League school in 2022, when she became the first openly transgender athlete to win an NCAA Division I title.\n\nThe department investigated Penn as part of the Trump administration's broader attempt to remove transgender athletes from girls' and women's sports, concluding the university in Philadelphia had violated the rights of female athletes.\n\nUnder the agreement, Penn agreed to restore all individual Division I records and titles to female athletes who lost to Thomas and send a personalized apology letter to each of those swimmers, the Education Department said.\n\nBy Tuesday afternoon, thePenn websiteshowed other athletes holding the school's top times in Thomas' events. The site was annotated with a note that read, \"Competing under eligibility rules in effect at the time, Lia Thomas set program records in the 100, 200 and 500 freestyle during the 2021-22 season.\"\n\n\"While Penn's policies during the 2021-2022 swim season were in accordance with NCAA eligibility rules at the time, we acknowledge that some student-athletes were disadvantaged by these rules,\" Penn President J. Larry Jameson said. \"We recognize this and will apologize to those who experienced a competitive disadvantage or experienced anxiety because of the policies in effect at the time.\"\n\nAs part of the settlement, the university must also announce that it \"will not allow males to compete in female athletic programs\" and it must adopt \"biology-based\" definitions of male and female, the department said.\n\nIn his statement, Jameson said Penn has always been in compliance with NCAA and Title IX rules as they were interpreted at the time, and that the university has never had its own policies around transgender athlete participation. The school has followed changes to eligibility guidelines as they were issued earlier this year, he said. The NCAA changed its participation policy for transgender athletes in February, limiting competition in women's sports to athletes who were assigned female at birth.\n\n\"Our commitment to ensuring a respectful and welcoming environment for all of our students is unwavering,\" Jameson said. \"At the same time, we must comply with federal requirements, including executive orders, and NCAA eligibility rules, so our teams and student-athletes may engage in competitive intercollegiate sports.\"\n\nEducation Secretary Linda McMahon called it a victory for women and girls.\n\n\"The Department commends UPenn for rectifying its past harms against women and girls, and we will continue to fight relentlessly to restore Title IX's proper application and enforce it to the fullest extent of the law,\" McMahon said in a statement.\n\nFormer University of Kentucky swimmer Riley Gaines thanked President Donald Trump on social media and wrote of the settlement, \"Are pigs flying?\" Gaines has said she started her activism against transgender athletes competing in women's sports after sharing a locker room with Thomas at the 2022 NCAA championships.\n\nThe Education Department opened its investigation in February and concluded in April that Penn had violated Title IX, a 1972 law forbidding sex discrimination in education. Such findings have almost always been resolved through voluntary agreements. If Penn had fought the finding, the department could have moved to refer the case to the Justice Department or pursued a separate process to cut the school's federal funding.\n\nIn February, the Education Department asked the NCAA and the National Federation of State High School Associations, or NFSHSA, to restore titles, awards and records it says have been \"misappropriated by biological males competing in female categories.\"\n\nThe most obvious target at the college level was in women's swimming, where Thomas won the national title in the 500-yard freestyle in 2022.\n\nThe NCAA has updated its record books when recruiting and other violations have stripped titles from certain schools, but the organization, like the NFSHSA, has not responded to the federal government's request and did not respond to emails seeking comment Tuesday. It was not clear how either would determine which events had a transgender athlete participating years later.",
        "source_2": "The University of Pennsylvania came to anagreementwith the Trump administration Tuesday that will strip transgender swimmer Lia Thomas of her titles and recognitions and ban trans athletes from women’s sports after the administration alleged the school violated Title IX provisions.\n\nThe university agreed to apologize for violations to Title IX, a civil rights law barring sex-based discrimination in federally funded education programs.\n\nThe University of Pennsylvania will restore titles, records or recognitions “misappropriated by male athletes allowed to compete in female categories,” according to the agreement, which was announced by the Department of Education Tuesday.\n\nThe agreement also says the university must issue a public statement in a prominent location on its main website specifying it will “not allow males to compete in female athletic programs or occupy Penn Athletics female intimate facilities.”\n\nRiley Gaines, an outspoken critic of trans athletes who tied with Thomas for fifth place in a freestyle event at the 2022 NCAA Women's Swimming and Diving Championships, was quoted in the Education Department’s press release saying she hopes the agreement “demonstrates to educational institutions that they will no longer be allowed to trample upon women’s civil rights.”\n\nUniversity of Pennsylvania President J. Larry Jameson said in astatementthe school was in compliance with Title IX and NCAA eligibility rules as Thomas participated in the 2021-2022 swim season, when former President Joe Biden was in office and unsuccessfully attempted toestablish further protectionsfor trans athletes.\n\nThe university will also be required to send personalized apology letters to impacted female swimmers.\n\nGet Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign uphere.\n\nIn addition to winning the 500-yard freestyle championship in the NCAA’s Division I swim championships, she also won 2022 Ivy League women’s titles in the 100, 200 and 500-yard freestyle events.\n\nThomas, who once sought to compete in the Olympics, argued in a lawsuit challenging World Aquatics’ competitive ban against transgender women that the rule was unlawful and discriminatory. The Court of Arbitration for Sport denied Thomas’ request for arbitration with World Aquatics, provoking a response from Thomas, who said, “Blanket bans preventing trans women from competing are discriminatory and deprive us of valuable athletic opportunities that are central to our identities,” according toNBC News.\n\nPresident Donald Trump banned trans athletes from participating in women’s sports at public schools with an executive order signed in February, threatening to remove federal funding from schools if they didn’t comply. Not long after the order was issued, the NCAA barred trans athletes from women’s competitions. Student-athletes assigned male at birth can continue practicing with women’s teams and receive medical care, according to the NCAA rule change. NCAA president Charlie Baker told a Senate committee a few months before the changes that fewer than 10 of the NCAA’s 530,000 student athletes were transgender.\n\nNCAA Bars Transgender Athletes From Women’s Competitions After Trump’s Order Against Trans Participation In Women’s Sports(Forbes)\n\nSimone Biles Tells Riley Gaines She’s ‘Sick’ In Spat Over Trans Softball Champion(Forbes)",
        "source_3": "Transgenderswimming champion Lia Thomaswill be stripped of University of Pennsylvania swimming titles after the Ivy League school bowed to pressure from the Trump administration.\n\nThe university will also issue formal apologies to every biological female competitor who lost out to a transgender competitor following an investigation by the Department of Education’s Office for Civil Rights (OCR).\n\nThe probefound UPenn violated Title IXby “allowing a male to compete in female athletic programs and occupy female-only intimate facilities.”\n\n“Today’s resolution agreement with UPenn is yet another example of the Trump effect in action. Thanks to the leadership of President Trump, UPenn has agreed both to apologize for its past Title IX violations and to ensure that women’s sports are protected at the University for future generations of female athletes,” Secretary of Education Linda McMahon said in a statement.\n\nThe resolution agreement signed by the university will require it to undertake a host of additional actions, including adopting “biology-based definitions for ‘male’ and ‘female’ under Title IX” and issuing a public statement that it will no longer allow biological men to compete in female athletic programs or occupy women-only locker rooms.\n\nThe decision was cheered by athletes who were impacted by the inclusion of trans athletes in women’s sports in recent years.\n\n“As a former UPenn swimmer who had to compete against and share a locker room with a male athlete, I am deeply grateful to the Trump Administration for refusing to back down on protecting women and girls and restoring our rightful accolades. I am also pleased that my alma mater has finally agreed to take not only the lawful path, but the honorable one,” said Paula Scanlan, a former University of Pennsylvania swimmer.\n\nRiley Gaines, a former University of Kentucky swimmer who has been outspoken on the issue, said, “It is my hope that today demonstrates to educational institutions that they will no longer be allowed to trample upon women’s civil rights, and renews hope in every female athlete that their country’s highest leadership will not relent until they have the dignity, safety, and fairness they deserve.”"
    }
}