{
    "question": "How might Hamas’s release of a video showing Evyatar David emaciated and digging his own grave influence public opinion, international pressure, and the dynamics of ongoing hostage and ceasefire negotiations?",
    "content": {
        "source_1": "TEL AVIV — WhenHamas released a video of Evyatar David, he looked so frail and emaciated that his father did not recognize his voice, the Israeli hostage’s brother said Monday.\n\nDavid, now 24, was partying at theNova music festivalin southern Israelon Oct. 7, 2023, when militants kidnapped him and 250 others nationwide during their sweeping terrorist attack in which 1,200 were killed.\n\nHamas prompted furtherinternational outcry this weekendwhen it posted footage of a markedly frail David alongside that of starving Palestinians — suffering from chronic food shortages  under Israel’s military operation and intensified blockade — in what his family sees as an attempt to use him as a propaganda tool.\n\n“It breaks my parents’ hearts,” his older brother, Ilay David, 28, told NBC News on Monday in Tel Aviv about Galia and Avishay David.\n\nHe said he can’t bring himself to watch the video, but his family has likened his brother’s physical condition to images from the Holocaust.  “It looks like pictures we all know from history class 80 years ago,” said David, who before the attack worked as a youth counselor but now is focused full time on bringing his  brother home.\n\nThe hostages were“being kept in a near-death situation,” David said, adding that his brother “can barely speak” and he was so weak that their father couldn’t recognize his voice.\n\nHe added that his brother “needs medical care right now, and if I am not able to speak about him, advocate for him, he may not survive.”\n\nThe widespread starvation now playing out in Gaza has killed at least 170 people, 90 of them children, according to the Palestinian Health Ministry. There are around 20 hostages believed still alive after almost three years in captivity, according the latest Israeli tally.\n\nAmong them is David, who his brother described as a “brilliant guitar player” with the “kindest soul I know.”\n\nIlay David added: “I love him, and he’s my best friend.”\n\nDavid spoke out afterPresident Donald Trump’senvoy to the Middle East,Steve Witkoff,met with families of the hostages on Saturday and emphasized the administration’s commitment to returning those still inside Gaza.\n\nIsraeli Prime Minister Benjamin Netanyahu also spoke “at length” with David’s family on Saturday night, expressing “deep shock” at the recordings released by Hamas, his office said in a statement. He blamed Hamas for “deliberately starving” hostages and Palestinians by “preventing them from receiving aid.”\n\nAlmost 61,000 people have been killed since the start of Israel's military campaign, according to Palestinian health officials. Recent international outcry about widespread malnutrition in the enclave has prompted Israel to pause fighting and let some aid in — but aid agencies say it’s not enough.\n\nDavid’s brother blamed the terrorist group for using “him cynically in their own starvation campaign,” and calling it the “peak of cruelty.”\n\nIlay David said they are “worse than al Qaeda” and “worse than ISIS,” two of the major terrorist groups that have brought misery to the Middle East in recent decades.\n\nEvyatar David “still has faith, still has hope, that’s what holds him sure,” his brother said. “When he comes back — not if he comes back — we’re going to take care of him, support him and he will be greater than before.”\n\nMatt Bradley reported from Tel Aviv and Alexander Smith from London.\n\nMatt Bradley is an international correspondent for NBC News based in Israel.\n\nAlexander Smith is a senior reporter for NBC News Digital based in London.",
        "source_2": "The brother of an Israeli hostage held in the Gaza Strip has told the BBC that a Hamas video showing him emaciated and weak is a \"new form of cruelty\" that has left his parents shattered.\n\nHamas released the footage of Evyatar David, 24, on Saturday, drawing strong condemnation from Israel and Western leaders.\n\n\"He's a human skeleton. He was being starved to the point where he can be dead at any moment, and he suffers a great deal. He barely can't speak, he barely can move,\" David's brother Ilay said in an interview on Monday.\n\nIn the video, Evyatar says: \"I haven't eaten for days... I barely got drinking water.\" He is seen digging what he says will be his own grave.\n\nHostages' families have urged Prime Minister Benjamin Netanyahu to prioritise their release as reports suggest he might be planning to expand the military campaign.\n\nThe footage of Evyatar was released after Palestinian Islamic Jihad published video of another hostage, Rom Braslavski, thin and crying.\n\nBoth men were abducted from the Nova music festival during the Hamas-led attack on southern Israel on 7 October 2023.\n\nThey are among 50 hostages still being held in Gaza, 20 of whom are believed to be alive.\n\nIlay David said his father had barely recognised his son Evyatar's voice on the video and had not been able to sleep. He said his mother cried all day.\n\n\"Seeing those images of my brother as a human skeleton, we understood it's, it's, it's a new kind of cruelty,\" Mr David said. \"It's the lowest you can get.\"\n\nHe called on world leaders to unite to save him and other hostages \"from the cruel, twisted hands of Hamas\".\n\n\"So we have to be so focused on delivering the message, which is, Evyatar is dying, we need to give him medicine, to give him food, proper food, and you need to get this treatment now, or else will die.\"\n\nHamas's armed wing has denied it intentionally starves prisoners, saying hostages eat what their fighters and people in Gaza eat.\n\nAfter the hostages' videos were released, Netanyahu spoke with their families, telling them that efforts to return all the hostages \"will continue constantly and relentlessly\".\n\nBut an Israeli official - widely quoted by local media - said Netanyahu was working to free the hostages through \"the military defeat of Hamas\".\n\nThe possibility of a new escalation in Gaza may further anger Israel's allies who have been pushing for an immediate ceasefire as reports of Palestinians dying from starvation or malnutrition cause shock around the world.\n\nThe main group supporting hostages' families condemned the idea of a new military offensive saying: \"Netanyahu is leading Israel and the hostages to doom.\"\n\nThat view was pointedly made in a letter by some 600 retired Israeli security officials sent to US President Donald Trump urging him to pressure Israel to immediately end the war in Gaza.\n\n\"Your credibility with the vast majority of Israelis augments your ability to steer Prime Minister [Benjamin] Netanyahu and his government in the right direction: End the war, return the hostages, stop the suffering,\" they wrote.\n\nThe group included former Mossad chief Tamir Pardo, Ami Ayalon, former chief of Shin Bet - Israel's domestic secret service agency - former Prime Minister Ehud Barak, and former Defence Minister Moshe Yaalon among others.\n\n\"It is our professional judgement that Hamas no longer poses a strategic threat to Israel,\" they said.\n\n\"At first this war was a just war, a defensive war, but when we achieved all military objectives, this war ceased to be a just war,\" said Ayalon.\n\nThe former top leaders head the Commanders for Israel's Security (CIS) group, which has urged the government in the past to focus on securing the return of the hostages.\n\n\"Stop the Gaza War! On behalf of CIS, Israel's largest group of former IDF generals and Mossad, Shin Bet, Police, and Diplomatic Corps equivalents, we urge you to end the Gaza war. You did it in Lebanon. Time to do it in Gaza as well,\" they wrote to the US president.\n\nIsrael launched a devastating war in Gaza following Hamas's 7 October attack in which about 1,200 people were killed and 251 taken into Gaza as hostages.\n\nMore than 60,000 people have been killed as a result of Israel's military campaign in Gaza since 7 October, the Hamas-run health ministry says.\n\nOn Monday, the ministry reported that at least 94 people had been killed in Gaza in the past day, including dozens it said had died in Israeli strikes.\n\nThe territory is also experiencing mass deprivation as a result of heavy restrictions imposed by Israel on what is allowed into Gaza. The ministry says 180 people, including 93 children, have died from malnutrition since the start of the war.\n\nSuch reports have become almost daily in recent months but are hard to verify as international journalists, including the BBC, are blocked by Israel from entering Gaza.\n\nUN-backed agencies have said the \"worst-case scenario of famine is currently playing out\" in Gaza.\n\nIsrael said it targeted well known reporter Anas al-Sharif and alleged he was part of Hamas, which Al Jazeera has denied.\n\nIt follows similar moves by the UK, France and Canada.\n\nIn the shadow of the Gaza war, violence is rising in the occupied territories as radical settlers seize land with the backing of the government.\n\nIsrael's Prime Minister also claimed Israeli hostages held in Gaza were \"the only ones being deliberately starved\".\n\nProtesters call for the release of hostages still being held in Gaza as they voice support for Israel.",
        "source_3": "Hamas forced emaciated Israeli hostage Evyatar David to dig his own grave in a sick new propaganda video, as the twisted terror group continued to stall negotiations torelease the remaining living captives.\n\nIn the nearly 5-minute clip  released Friday, the 24-year-old David is seen in a tunnel with a ceiling roughly as high as he is tall, crossing off dates on a calendar and digging a grave.\n\n“I haven’t eaten for a few days in a row,” David says in the footage.\n\nIn the middle of the video, the person behind the camera hands him a can of beans.\n\n“This can is for two days,” David says. “This whole can is for two days so that I don’t die.\n\n“This is the grave I think I’m going to be buried in. Time is running out.”\n\nThe David family, which allowed the release of the video, said in a statement sent to the Hostages Families Forum Headquarters, “We are forced to witness our beloved son and brother, Evyatar David, deliberately and cynically starved in Hamas’s tunnels in Gaza — a living skeleton, buried alive.\n\n“The deliberate starvation of our son as part of a propaganda campaign is one of the most horrifying acts the world has seen.”\n\nThe appalling video sparked outrage in Israel and across the globe.\n\n“Hamas terrorists deliberately starve our hostages, documenting them in a cynical, humiliating, and malicious manner,” said Israeli Prime Minister Benjamin Netanyahu.\n\nNaftali Fürst, a Holocaust survivor, said she watched the images of the hostages with a “heavy heart,” taking her back decades.\n\n“I survived Auschwitz and Buchenwald. I know hunger up close. In the camps, we were given rations of bread and watery soup,” she said. “We were so hungry, we would even eat grass if we could find it.\n\n“I remember the humiliation—the complete stripping of human dignity. I know the fear, the terror.”\n\nLawmakers on Capitol Hill pointed to Hamas’ monstrous treatment of David as a reminder of the terrorist group’s barbarity and role in prolonging the bloody conflict in Gaza.\n\n“The chilling video of Hamas hostage Evyatar David is a grotesque reminder of why America must stand with Israel and demand every hostage’s release,” retiring Rep. Don Bacon (R-Neb.) told The Post.\n\nHe added, “If Hamas released the tortured hostages, this war would end.”\n\n“Iran-backed Hamas terrorists have held innocent people hostage, starving them for 666 days,” Sen. Rick Scott (R-Fla.)said of the horrifying footage.\n\n“Just look at these photos — it’s gut-wrenching. Every day that goes by is a risk to their lives. We cannot stop until every hostage is home and Hamas is destroyed.”\n\nSen. John Fetterman (D-PA.) recounted how he met with David’s family and demanded Hamas release the hostages.\n\n“I cannot even begin to imagine the horror of this video for them. I continue to stand with these families and every last hostage. Hamas: send these poor souls home, disarm, and end this hell on earth in Gaza,” Fetterman said in response to the chilling video.\n\nHudson Valley Rep. Mike Lawler (R-NY) called the imagery “vile” and underscored Hamas’ role in fueling the humanitarian crisis in the Gaza Strip.\n\n“This is vile. Where are all those demanding Israel end this war now? Lawler stressed. “Where are all those decrying the humanitarian crisis now?\n\n“The only entity for the devastation that has been inflicted upon innocent Israelis and Palestinians is Hamas. Period. Full stop.”\n\nRep. Ritchie Torres (D-Bronx) said, “The world’s silence about the deliberate starvation of Israelis and Jews — at the hands of Hamas and Islamic Jihad — is as deafening as its hypocrisy.”\n\n“A humanitarianism that devalues Jewish life is no humanitarianism at all, for it has been hollowed out by antisemitism,” Torres added.\n\nFrench Foreign Minister Jean-Noel Barrot called the images “vile” and “unbearable.”\n\n“The hostage’s hell must end,”he wrote on X Saturday.\n\nIsrael has come under heightened pressure on the world stage over the conditions in Gaza, with countries such as Canada, the UK and France moving to recognize a Palestinian state as soon as next month.\n\nBut top US officials have repeatedly sought to drill home to allies that Hamas is the one preventing peace.\n\n“The fastest way to end the Humanitarian Crises in Gaza is for Hamas to SURRENDER AND RELEASE THE HOSTAGES!!!” President Trump emphasized on Truth Social earlier this week.\n\nHamas is believed to still have 20 living hostages in captivity and 30 who are dead. Despite that, Israel has moved to allow more humanitarian aid to the war-torn enclave, including from airdrops, tactical pauses in key areas, and the opening of new routes for aid to flow through.\n\nThe cruel hostage video marks the second one released by the terror group this week.\n\nOn Thursday, chilling footage showed Israeli hostage Rom Braslavski ghostly and frail as he cried during the six-minute video.\n\nBoth were kidnapped at the Nova music festival during the Oct. 7 terror attack and are among the remaining 20 hostages believed to still be alive.\n\n“They are on the absolute brink of death,” brother Ilay David said Saturday, speaking in English before a crowd of thousands in Tel Aviv gathered for their weekly demonstrations to call for the release of all hostages and an end to the war.\n\nDavid called onTrump to secure the release of the hostages “by any means necessary.”\n\n“To remain silent now is to be complicit in their slow agonizing death,” he said.\n\nUS special envoy Steve Witkoff, meanwhile, told Israeli hostages’ families in a meeting in Tel Aviv earlier Saturday, that he had no news of progress in talks with Hamas, according to Hebrew media.\n\n“I hear your frustration. But the situation is complicated. There are many reasons that I cannot detail,” he said.\n\nWitkoff added that an end to the war was “very close,” according to a statement by the Hostages Families Forum Headquarters.\n\nThe Trump administration envoy said the US was after a deal that would release all hostages from the Palestinian enclave and end the war.\n\n“No piecemeal deals,” he added. “That doesn’t work. We’ve tried everything.”\n\nHamas refuted claims by Witkoff it was ready to lay down arms, vowing not to disarm “as long as the occupation exists” and until there is a fully sovereign Palestinian state."
    }
}