{
    "question": "How might the DOJ’s June 11 directive to prioritize civil denaturalization for naturalized citizens accused of misrepresentation or certain serious crimes affect the balance between national security goals and the principle of equal treatment under the law for all citizens?",
    "content": {
        "source_1": "Memo says those subjected to civil proceedings are not entitled to an attorney like they are in criminal cases\n\nTheTrump administrationhas codified its efforts to strip some Americans of their US citizenship in a recently published justice department memo that directs attorneys to prioritize denaturalization for naturalized citizens who commit certain crimes.\n\nThe memo,published on 11 June, calls on attorneys in the department to institute civil proceedings to revoke a person’s United States citizenship if an individual either “illegally procured” naturalization or procured naturalization by “concealment of a material fact or by willful misrepresentation”.\n\nAt the center of the move are the estimated 25 million US citizens who immigrated to the country after being born abroad, according todata from 2023– and it lists 10 different priority categories for denaturalization.\n\nAccording to the memo, those subjected to civil proceedings are not entitled to an attorney like they are in criminal cases. And the government has a lighter burden of proof in civil cases than they do in criminal ones.\n\nThe memo claims such efforts will focus on those who are involved “in the commission of war crimes, extrajudicial killings, or other serious human rights abuses … [and] naturalized criminals, gang members, or, indeed, any individuals convicted of crimes who pose an ongoing threat to the US”.\n\nThe directive gives justice department attorneys wider discretion on when to pursue denaturalization, including in instances of lying on immigration forms, cases where there is financial fraud or medical fraud against the US or against private individuals; and cases referred by a US attorney’s office or in connection with pending criminal charges.\n\nThe justice department’s civil rights division has been placed at the forefront of Trump’s policy objectives, including ending diversity, equity and inclusion (DEI) programs within the government as well as ending transgender treatments, among other initiatives.\n\nThat comes as the US’s Immigration and Customs Enforcement (Ice) agency registered its 13th in-custody death for the fiscal year beginning in October 2024. There had been 12 such deaths during the entire fiscal year that finished at the end of September 2024.\n\nOn Friday Jim Ryan, president of the University of Virginia, resigned amid an investigation by the justice department’s civil rights division. The investigation took aim at the university’s DEI programs and its continuing to consider race and ethnicity in various programs and scholarships.\n\nThe justice department also took the unusual step in recent days of suing 15 federal district court judges in Maryland over an order blocking the immediate deportation of migrants challenging their removal.\n\nThe justice department’s civil rights division is reportedly in disarray as its traditional mission – to combat racial discrimination after the civil rights movement – is reshaped by priorities stemming from the president’s executive orders. About 250 attorneys – or 70% of the division’s lawyers – were believed to have left the department in the time between January and the end of May,according to a recent National Public Radio (NPR) report.\n\nThe memo’s focus on denaturalization comes as at least one person has been denaturalized in recent weeks.\n\nA deep dive into the policies, controversies and oddities surrounding the Trump administration\n\nOn 13 June, a judgeordered the revocationof the citizenship of Elliott Duke. Duke is a US military veteran originally from the UK who was convicted for distributing child sexual abuse material and had not disclosed the crime during the naturalization process.\n\nImmigration attorneys are concerned that denaturalization cases via civil litigation strip some rights from the individual, including rights to an attorney as well as lowering the threshold of proof, and speeding up the denaturalization process.\n\n“It is kind of, in a way, trying to create a second class of US citizens,” said Sameera Hafiz, policy director of the Immigration Legal Resource Center,to NPR.\n\nThe best public interest journalism relies on first-hand accounts from people in the know.\n\nIf you have something to share on this subject you can contact us confidentially using the following methods.\n\nThe Guardian app has a tool to send tips about stories. Messages are end to end encrypted and concealed within the routine activity that every Guardian mobile app performs. This prevents an observer from knowing that you are communicating with us at all, let alone what is being said.\n\nIf you don't already have the Guardian app, download it (iOS/Android) and go to the menu. Select ‘Secure Messaging’.\n\nSecureDrop, instant messengers, email, telephone and post\n\nSee our guide attheguardian.com/tipsfor alternative methods and the pros and cons of each.\n\nThis article was amended on 1 July 2025. In Maryland, the justice department sued 15 federal district court judges, not “US district attorneys” as an earlier version said.",
        "source_2": "A recent Department of Justice memo laid out a new priority to denaturalize citizens who run afoul of the law, even if they’re not convicted of crimes.\n\nImmigrant advocates call the enhanced denaturalization effort “very shocking and very concerning” as the Trump administration raises the prospect of deportation\n\nSome say naturalized citizens should face consequences when they engage in “reprehensible behavior.”\n\nThe Trump administration plans to aggressively expand efforts to strip some foreign-born Americans of their U.S. citizenship, according to arecent memofrom the Department of Justice (DOJ). Past denaturalization efforts focused on people who fraudulently obtained citizenship. However, under the new initiative, a DOJ official wrote, the government will “maximally pursue” the removal of naturalized citizens who run afoul of the law.\n\nThe government will file civil denaturalization actions against non-native citizens who are accused — but not necessarily convicted — of certain crimes, according to the memo. And while government lawyers will be empowered to target naturalized citizens “who pose a potential danger to national security,” the memo did not specifically say what constitutes a threat.\n\nDownload the SAN app today to stay up-to-date with Unbiased. Straight Facts™.\n\nThose who lose their citizenship may be deported to their countries of origin.\n\nThe emphasis on denaturalization follows the administration’s attempts to deport millions of immigrants illegally in the U.S. and to prevent refugees and others seeking political asylum from entering the United States. The existence of the June 11 DOJ memo wasfirst reportedby NPR.\n\nThe DOJ memo lays out five enforcement priorities for the agency’s civil division. All reflect executive orders that President Donald Trump signed shortly after taking office in January.\n\nAbout25 millionnaturalized citizens live in the United States, with more than 40% became citizens over the past 15 years.\n\nBesides denaturalization, the priorities include suing companies doing business with the federal government over theirdiversity, equity and inclusionprograms; endingantisemitism; “protecting women and children” by targeting doctors, hospitals and pharmaceutical companies engaged ingender-affirming care; and endingsanctuary jurisdictions.\n\nThe memo does not identify a quota for denaturalization cases or set a timetable for deporting more naturalized citizens.\n\nDuring the Red Scare of the late 1940s and early 1950s, the government stripped the citizenship of about 20,000 people a year who had not disclosed previous communist ties on their citizenship applications.\n\nCases dropped to a trickle after Supreme Court decisions greatly limited the practice. However, the number increased under former President Barack Obama, when officials targeted immigration fraud cases possibly linked to terrorist organizations.\n\nAbout 25 million naturalized citizens lived in the United States as of 2023, according to theMigration Policy Institute. More than 40% became citizens after 2010.\n\nThe DOJ says it will seek to denaturalize citizens who represent a “nexus” to terrorism and espionage; those who are affiliated with criminal gangs; those who are engaged in human trafficking, sex offenses or violent crime; and those who committed fraud against government programs like Medicaid or Medicare.\n\nIn addition, naturalized citizens with pending criminal cases could be deported, even before they’re convicted. The memo, written by Assistant Attorney General Brett A. Shumate of the DOJ’s Civil Division, gives government lawyers wide latitude to begin denaturalization proceedings.\n\nThe categories listed in his memo, Shumate wrote, “do not limit the Civil Division from pursuing any particular case. The Civil Division shall prioritize and maximally pursue denaturalization proceedings in all cases permitted by law and supported by evidence.”\n\nNo data is available on the number of denaturalization cases that have already been opened. But on June 13, a federal judge in Louisianarevoked the citizenshipof Elliott Duke, a U.S. military veteran originally from the United Kingdom. He was convicted in 2014 — a year after becoming a citizen — of distributing child sexual abuse material. The DOJ says he did not disclose his criminal activity when immigration officers interviewed him during the naturalization process.\n\nImmigration advocates say the denaturalization process can easily be abused.\n\n“To see that this administration is plotting out how they’re going to expand its use in ways that we have not seen before is very shocking and very concerning,” Sameera Hafiz, policy director of the Immigration Legal Resource Center, told NPR.\n\nOne congressman has already asked Attorney General Pam Bondi to revoke the citizenship ofZohran Mamdani, the Democratic nominee for mayor of New York City, over rap lyrics he wrote in 2017. The lyrics allegedly praised leaders of an organization that supported Hamas, which the United States considers a terrorist group. Mamdani, 33, was born in Uganda and moved to the United States with his family as a child. He became a naturalized citizen in 2018.\n\nOn June 25, the day after the Democratic primary, Rep. Andy Ogles, R-Tenn., told Bondi that Mamdani had lied on his citizenship application and should be denaturalized and deported. Bondi has not publicly responded.\n\nIncreased denaturalization is supported by groups such as the Heritage Foundation, the organization behind Project 2025, the blueprint for a conservative overhaul of the federal government.\n\n“When we extend the opportunity for naturalization to aliens, we are granting them a great privilege – the privilege of becoming a U.S. citizen,” Hans Von Spakovsky, a senior legal fellow at the foundation, told NPR.\n\nHe added, “Anyone who has abused the privilege of the opportunity of becoming a U.S. citizen should have that citizenship revoked when they engage in such reprehensible behavior.”\n\nProposed expansion of denaturalization efforts by the Trump administration raises questions about legal standards, civil rights and the government's authority to revoke citizenship.\n\nA Department of Justice memo signals a shift toward more aggressive and broad efforts to strip citizenship from naturalized citizens, including those accused but not necessarily convicted of crimes.\n\nAdvocates and critics warn, as reported by NPR and sources such as the Immigration Legal Resource Center, that expanding denaturalization could lead to abuses.\n\nThe denaturalization initiative reflects broader political priorities, including executive orders from President Donald Trump and support from conservative groups such as the Heritage Foundation.",
        "source_3": "President Donald Trump discusses his solution to allowing law-abiding, working illegal immigrants to remain in U.S. and pay taxes on 'Sunday Morning Futures.'\n\nTheJustice Departmentissued a memo directing US attorneys to \"prioritize and maximally pursue denaturalization proceedings\" as part of an effort by the Trump administration to crack down on crime.\n\nThe memo from Assistant Attorney General Brett Shumate states that denaturalization cases against \"individuals who pose a potential danger to national security, including those with a nexus to terrorism, espionage, or the unlawful export from the United States of sensitive goods, technology, or information raising national security concerns\" are one of the key priorities.\n\n\"The benefits of civil denaturalization include the government’s ability to revoke the citizenship of individuals who engaged in the commission of war crimes, extrajudicial killings, or other serious human rights abuses; to removenaturalized criminals,gang members, or, indeed, any individuals convicted of crimes who pose an ongoing threat to the United States; and to prevent convicted terrorists from returning to U.S. soil or traveling internationally on a U.S. passport,\" Shumate wrote.\n\n\"The Department of Justice may institute civil proceedings to revoke a person’s United States citizenship if an individual either ‘illegally procured’ naturalization or procured naturalization by ‘concealment of a material fact or by willful misrepresentation,’\" he added in the June 11 directive, as first reported byFox News Digital.\n\nTRUMP APPOINTEE VOWS TO FOCUS DOJ’S LARGEST DIVISION ON DEI, DENATURALIZATION\n\nThe Justice Department logo, left, and President Donald Trump.(Mandel Ngan/AFP via Getty Images; AP/Jacquelyn Martin)\n\nShumate said the Justice Department’s Civil Division should \"prioritize and maximally pursue denaturalization proceedings in all cases permitted by law and supported by the evidence.\"\n\nThe memo said attorneys should pursue denaturalization cases against individuals who \"committed human trafficking, sex offenses, or violent crimes\" and those who \"engaged in various forms of financial fraud against the United States (including Paycheck Protection Program (‘PPP’) loan fraud and Medicaid/Medicare fraud).\"\n\nFEDERAL JUDGE ALLOWS IRS TO SHARE ILLEGAL ALIEN DATA WITH DHS IN COURT WIN FOR TRUMP\n\nShumate wants the Justice Department to \"prioritize and maximally pursue denaturalization proceedings in all cases permitted by law and supported by the evidence.\"(Reuters/Kevin Lamarque)\n\nIt also calls for attorneys to initiate cases against \"individuals who further or furthered the unlawful enterprise of criminal gangs, transnational criminal organizations, anddrug cartels\"and \"individuals who engaged in fraud against private individuals, funds, or corporations.\"\n\nOverall, the memo lists ten priority categories for denaturalization.\n\nThe Justice Department did not immediately respond Tuesday to a request for comment from Fox News Digital.\n\nAssistant Attorney Brett Shumate speaks during the investiture ceremony for U.S. District Judge Trevor N. McFadden April 13, 2018, at the U.S. District Court in Washington, DC.(Alex Wong/Getty Images)\n\nTwo days after issuing the memo, theJustice Department saidit \"secured the denaturalization of a convicted collector and distributor of child sexual abuse material.\"\n\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}