{
    "question": "In what ways could the Trump administration’s Title VI finding and threat to cut all federal funding influence Harvard’s approach to addressing antisemitism and its broader relationship with the federal government?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nThe Trump administration says it’s concluded an investigation of Harvard University and that the school failed to protect Jewish students from harassment. The administration is threatening to cut all federal funding from the Ivy League school if it fails to take action.\n\nThis Nov. 13, 2008 file photo shows the campus of Harvard University in Cambridge, Mass. (AP Photo/Lisa Poole, File)\n\nStudents walk through Harvard Yard, April 27, 2022, on the campus of Harvard University in Cambridge, Mass. (AP Photo/Charles Krupa, File)\n\n▶ Follow live updates onPresident Donald Trump and his administration\n\nWASHINGTON (AP) — President Donald Trump’s administration on Monday intensified its battle withHarvard University, formally finding the school tolerated antisemitism — a step that could jeopardize all of Harvard’s federal funding, including federal student aid.\n\nIn a letter sent to Harvard, a federal task force said its investigation had found the university was a “willful participant” in antisemitic harassment of Jewish students and faculty. The task force threatened to refer the case to the Justice Department to file a civil rights lawsuit “as soon as possible,” unless Harvard comes into compliance.\n\nThe finding escalates the White House’s conflict with Harvard, which has faced mounting sanctions after rejecting a list of federal demands calling for sweeping changes to campus governance, hiring and admissions. Already, the government has slashed more than $2.6 billion in research grants. But the civil rights violation could jeopardize Harvard’s eligibility to accept federal loans or grants for students to attend the university — a penalty often referred to as a “death sentence” in higher education.\n\n“Failure to institute adequate changes immediately will result in the loss of all federal financial resources and continue to affect Harvard’s relationship with the federal government,” officials said in the letter, which was obtained by The Associated Press and first reported by The Wall Street Journal.\n\nThe Trump administration for monthshas accused Harvard of tolerating antisemitismon its campus, but a formal investigative finding gives the administration a channel to block more federal funding.\n\nTrump personally has railed against Harvard, but on June 20 suggested a deal resolving the monthslong conflict could be coming soon. In a post on social media, Trump said Harvard has “acted extremely appropriately” during negotiations. He did not elaborate on the terms of a potential resolution.\n\nHarvard has not commented on whether it is negotiating with the White House. On Monday, Harvard said it strongly disagrees with the government’s findings and is committed to fighting bias.\n\n“Antisemitism is a serious problem and no matter the context, it is unacceptable,” the university said in a statement. “Harvard has taken substantive, proactive steps to address the root causes of antisemitism in its community.”\n\nFederal officials made their case in a 57-page report detailing an investigation by the civil rights office of the Department of Health and Human Services. The agency is among several represented on a federal antisemitism task force.\n\nThe government’s investigation largely relied ona campus antisemitism studycommissioned by Harvard and released in April. Federal officials cited numerous details from that report, including accounts of Jewish students who said they were spit on and faced chants on campus including “Heil Hitler.”\n\nIt focuses heavily on last year’s protests over theIsrael-Hamas war. In the letter to Harvard, federal officials said the campus was “overrun by an impermissible, multiweek encampment” that left Jewish and Israeli students fearful and disrupted their studies.\n\nIt accuses Harvard of imposing lax and inconsistent discipline against students who participated in the encampment, noting that none were suspended.\n\nHarvard President Alan Garber has acknowledged problems with antisemitism and anti-Muslim bias on campus, but he says Harvard has made strides to fight prejudice. He announced new initiatives in April upon release of the antisemitism study.\n\n“Harvard cannot — and will not — abide bigotry,” Garber wrote at the time.\n\nThe Monday letter finds Harvard violated Title VI of the Civil Rights Act of 1964. Such findings have almost always been resolved through voluntary resolutions between schools and the federal government. The Trump administration has taken a much sharper edge than its predecessors, however.\n\nIt has been decades since an administration even attempted to strip a school or college of its federal funding over civil rights violations. Trump officials are seeking that outcome in a Justice Departmentlawsuit against Maineover transgender athletes, and it’s threatening the same action in a similar investigation intoCalifornia.\n\nTrump officials have barraged Harvard with sanctions after it became the first university to defy White House demands addressing accusations of antisemitism and liberal bias. Along with research cuts, the administration has attempted to bar Harvard fromhosting foreign students, and President Donald Trump has said the school should lose itstax-exempt status.\n\nSome of the actions have beenblockedby courts after Harvard sued, accusing the government of illegal retaliation.\n\nHarvard’s previous funding cuts were carried out under a provision allowing the government to end grants and contracts that no longer align with federal priorities. That strategy is believed to be unprecedented and is being challenged in court. But by invoking a civil rights violation, the government has put Harvard on an established path to further penalties.\n\nThe Associated Press’ education coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’sstandardsfor working with philanthropies, alistof supporters and funded coverage areas at AP.org.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "The Trump administration says that Harvard University violated civil-rights laws over its treatment of Israeli and Jewish students, potentially further endangering its federal funding.\n\nIn a letter sent to Harvard, the administration accused the university of deliberate indifference towards the concerns of Jewish students who felt threatened on campus.\n\nThe move is the latest in a series of legal and financial battles between Harvard and the White House - the stakes of which have dramatically escalated over the last few months.\n\nHarvard says it has made \"significant strides\" to combat discrimination and \"strongly disagrees\" with the government's findings.\n\nThe letter - viewed by the BBC - says that \"failure to institute adequate changes immediately will result in the loss of all federal financial resources\" for Harvard.\n\n\"Harvard may of course continue to operate free of federal privileges, and perhaps such an opportunity will spur a commitment to excellence that will help Harvard thrive once again,\" says the letter addressed to Harvard University President Alan Gerber.\n\nAccording to the letter, federal investigators found that a \"majority\" of Jewish students reported discrimination or bias against them, with one quarter having felt physically threatened.\n\nAmong the behaviours detailed in the letter are Jewish students being spat upon or assaulted, and images being widely circulated depicting a dollar sign in the Star of David and antisemitic stickers being distributed, including one showing an Israel flag with a swastika in place of the Star of David.\n\n\"Harvard's inaction in the face of these civil rights violations is a clear example of the demographic hierarchy that has taken hold of the university,\" the letter adds. \"Harvard's commitment to racial hierarchies—where individuals are sorted and judged according to their membership in an oppressed group identity and not individual merit—has enabled anti-Semitism to fester.\"\n\nThe letter is what is known as a \"notice of violation\" that often precedes a lawsuit or a voluntary resolution if corrective measures are taken.\n\nIn a statement, Harvard said that it had taken \"substantive, proactive steps\" to combat antisemitism on campus, and had made \"significant strides to combat bigotry, hate and bias\".\n\n\"We are not alone in confronting this challenge and recognise that this work is ongoing,\" the statement added.\n\nSpeaking at the White House on Monday, Press Secretary Karoline Leavitt said that negotiations between the administration and Harvard are taking place \"behind closed doors\", without elaborating.\n\nLeavitt added that incidents of antisemitism on campus are \"facts that Harvard cannot dispute\".\n\nIn April, Harvard released the findings of an internal investigation which found that the university was deeply polarised by the ongoing war in Gaza, with students on both sides feeling unsafe.\n\nIn a message from Mr Garber which accompanied the report, the university president apologised for \"moments in which we failed to meet the high expectations we rightfully set for our community\".\n\nThe university has also taken a number of steps to address the issue, including facilitating dialogue problems, expanding non-discrimination and anti-bullying policies and enhancing antisemitism training.\n\nThe letter is the latest in a series of clashes between Harvard and the Trump administration, which has ramped up its crackdown on universities it claims have failed to tackle antisemitism amid protests against the war in Gaza.\n\nEarlier, in May, the administration directed US federal agencies to review Harvard University's grants to potentially end or redistribute funding. The administration estimated about 30 contracts, collectively worth $100m (£74m), could be reviewed.\n\nIt already had frozen $2.65bn in federal grants and tried to revoke Harvard's ability to enrol international students.\n\nThe Trump administration also issued Columbia University a similar notice last month accusing it of violation of civil-rights law for allegedly failing to protect Jewish students from harassment. Columbia is also negotiating with the administration over its federal funding and autonomy.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nScientists who analysed fragments that crashed into a roof in Georgia, US, say it likely formed 4.56 billion years ago.\n\nTariffs, oversupply and teetotaling Gen-Zs have all contributed to the downfall of one of America's most iconic liquors.\n\nJen Pawol donated her hat to a baseball museum after her history-making game on Saturday.",
        "source_3": "CAMBRIDGE, MASSACHUSETTS - APRIL 17: Harvard University's motto, \"Veritas,\" meaning \"truth,\" is seen on a gate at Harvard University on April 17, 2025 in Cambridge, Massachusetts. The Trump administration announced that it would block Harvard University from receiving $2.2 billion in federal grants and $60 million in contracts after the school refused demands to adopt new policies relating to student and faculty conduct, admissions, anti-semitism on campus and DEI. (Photo by Sophie Park/Getty Images)\n\nThe Trump administration has concluded that Harvard University failed to protect Jewish students from antisemitic harassment and is threatening to cut all federal funding if immediate corrective action isn’t taken.\n\nIn a letter sent Monday, a federal task force found Harvard in violation of Title VI of the Civil Rights Act of 1964, which requires schools to protect students from discrimination based on race or national origin, according to theAssociated Press.\n\nThe investigators statedHarvardwas at times a “willful participant in anti-Semitic harassment of Jewish students, faculty, and staff,” and allowed antisemitism to fester on its Cambridge, Massachusetts, campus.\n\n“Failure to institute adequate changes immediately will result in the loss of all federal financial resources and continue to affect Harvard’s relationship with the federal government,” the letter warned. The Associated Press obtained the letter, and The Wall Street Journal first reported it.\n\nThisdevelopmentmarks a sharp escalation in tensions between the Trump administration and Harvard, which has already lost more than $2.6 billion in federal research grants after rejecting government demands to reform hiring, admissions, and campus governance.\n\nThe administration has long criticized Harvard for tolerating antisemitism, but the formal finding opens the path for either a resolution agreement or the potential termination of all federal funds.\n\nThe investigation centered on campus protests over the Israel-Hamas war, citing a “multiweek encampment” that allegedly disrupted Jewish and Israeli students’ education and created an unsafe environment. Investigators said students involved in the protests faced inconsistent discipline, and none were suspended.\n\nHarvard President Alan Garber previously acknowledged the presence of antisemitism and Islamophobia on campus. Following internal reports in April confirming such issues, he pledged new initiatives to address them.\n\n“Harvard cannot — and will not — abide bigotry,” Garber stated.\n\nHistorically, Title VI violations have been resolved through voluntary agreements.\n\nHowever, officials emphasized that this administration is adopting a more aggressive stance. It’s been decades since a university faced a full federal funding cutoff over civil rights violations.\n\nWe’re organizing an online community to elevate trusted voices on all sides so that you can be fully informed.\n\nPlease enter your username or email address to reset your password."
    }
}