{
    "question": "How might Canada’s decision to halt its Digital Services Tax shape the leverage, priorities, and timeline of US-Canada trade talks aimed at a July 21 agreement?",
    "content": {
        "source_1": "President Donald Trump played tough with Canada and emerged victorious just 48-hours later.\n\nCanada announced on Sunday night that it was scrapping its Digital Services Tax on American tech firms, which Trump had blasted as “a direct and blatant attack” on the U.S. when he walked away from the negotiating table just two days ago. The announcement from Canada came hours before it was due to come into effect.\n\n“To support those negotiations,” the Canadian Department of Finance said in astatement, “Canada would rescind the Digital Services Tax in anticipation of a mutually beneficial comprehensive trade arrangement with the United States.”\n\nGovernment of Canada rescinds digital services tax to advance broader trade negotiations with the United States.https://t.co/dTb9YDDA7upic.twitter.com/mdFSMKma6L\n\nTrump and Canadian Prime Minister Mark Carney have agreed to resume trade talks with a goal of inking a deal by July 21.\n\n“Canada’s new government will always be guided by the overall contribution of any possible agreement to the best interests of Canadian workers and businesses,” Carney said.\n\nThe concession marks a big win for Trump, whose sprawling trade war has gained notoriety for its on-again, off-again rollout, earning him the nickname “TACO”—Trump Always Chickens Out—among Wall Street stockbrokers.\n\nOn Friday, Trump declared in a Truth Social post that he was canceling talks with Canada, describing it as “a very difficult Country to TRADE with” over the Digital Services Tax that was set to go into effect on Monday.\n\nHe continued his attacks earlier Sunday onFox News. “People don’t realize Canada’s very nasty to deal with,” he told host Maria Bartiromo. “There’s been things going on that we don’t like and things going on where they took advantage.”\n\nLarge American corporations would have had topay taxeson certain revenue earned from engaging with online users in Canada.\n\n“They are obviously copying the European Union, which has done the same thing, and is currently under discussion with us, also,” Trump wrote. “Based on this egregious Tax, we are hereby terminating ALL discussions on Trade with Canada, effective immediately. We will let Canada know the Tariff that they will be paying to do business with the United States of America within the next seven-day period.”\n\nThe Computer and Communications Industry Association earlierestimatedthat U.S. firms would have to pay up to $3 billion in taxes, including retroactive charges dating back to 2022, if the tax were to take effect.\n\nThe group also warned that the Canadian tax could lead to annual losses of up to $2.3 billion for American companies, as well as cut 3,000 jobs.\n\n“We appreciate the administration’s decisive response to Canada’s discriminatory tax on U.S. digital exports,” Matt Schruers, the association’s chief executive, said in a statement.",
        "source_2": "Reporting by Kanjyik Ghosh in Bengaluru, Promit Mukherjee in Ottawa and Doina Chiacu and Andrea Shalal in Washington ; additional reporting by Susan Heavey in Washington and Anna Mehler Paperny in Toronto; Writing by Caroline Stauffer; editing by Christopher Cushing, Michael Perry, Paul Simao, Mark Heinrich and Marguerita Choy\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab",
        "source_3": "Canadian businessman Kevin O’Leary discusses the U.S. and Canada tariff fight and future of the ‘big, beautiful bill’ on ‘The Evening Edit.’\n\nThe Canadian government rescinded a digital services tax that was set to take effect on Monday after PresidentDonald Trumpthreatened to break off trade negotiations between the U.S. and Canada over the tax.\n\nCanada's government adopted its 3% digital services tax a year ago and collections were due to begin on Monday. The tax applied to large tech companies that made more than $20 million a year in revenue from online marketplace services, online advertising, social media services and certain sales of user data involving engagement with users in Canada.\n\nThe digital services tax would apply regardless of whether the company is headquartered in Canada, and also would've applied retroactively to 2022, putting a roughly $2 billion tax burden on major U.S. tech companies that do business in Canada.\n\nCanada's digital services taxelicited pushback from both the Trump administration and the Biden administration, which was in office when it was initially devised and said the proposed tax was inconsistent with an existing trade agreement. Tech companies like Amazon, Meta, Google and Apple opposed the tax.\n\nCANADA TO RESUME TRADE TALKS WITH US AFTER RESCINDING DIGITAL SERVICES TAX\n\nPresident Donald Trump threatened to break off trade talks with Canada over the tax.(Tasos Katopodis/Getty Images / Getty Images)\n\nTrump said Friday that he would halt trade talks between the U.S. and Canada, slamming America's northern neighbor as \"a very difficult Country to TRADE with\" in a post on Truth Social, adding he would inform Canada about itstariff ratein the next seven days.\n\nThe Canadian government announced Sunday that it would rescind the digital services tax, haltingtax collectionsscheduled to begin on Monday while legislation to formally overturn the measure is prepared by parliament. It added that it would prefer to reach an agreement with other countries on digital services taxes.\n\nCANADA RESPONDS AFTER TRUMP HALTS TRADE TALKS OVER DIGITAL SERVICES TAX\n\nPresident Donald Trump and Canadian Prime Minister Mark Carney will resume trade talks after the digital services tax was dropped.(Reuters/Kevin Lamarque / Reuters)\n\n\"The DST was announced in 2020 to address the fact that many large technology companies operating in Canada may not otherwise pay tax on revenues generated from Canadians,\" Canada's finance ministry said in a statement. \"Canada's preference has always been a multilateral agreement related to digital services taxation.\"\n\n\"In our negotiations on a new economic and security agreement between Canada and the United States, Canada's new government will always be guided by the overall contribution of any possible agreement to the best interests of Canadian workers and businesses,\" Prime Minister Mark Carney added.\n\nFormer Bank of Canada governor Mark Carney became Canada’s prime minister after winning the Liberal leadership race in March 2025.(Artur Widak/NurPhoto via Getty Images / Getty Images)\n\nThe U.S. is Canada'slargest trading partner, while Canada is the largest importer of American exports and one of the top three sources of U.S. imports.\n\nThe American and Canadian governments previously agreed to a July 21 deadline for trade negotiations. The U.S.-Mexico-Canada Agreement (USMCA) is due to be renegotiated by next year.\n\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\n\nBy clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time."
    }
}