{
    "question": "How should fire and law enforcement agencies adapt their response protocols to intentional ambush risks, as seen in the Idaho incident where firefighters were attacked during a suspected arson, while still ensuring rapid wildfire suppression and public safety?",
    "content": {
        "source_1": "Firefighters were responding to a blaze in the panhandle of Idaho when the shooting happened, a sheriff said. The body of a suspect was recovered on Sunday evening.\n\n“You can really see the smoke. They have it blocked off all the way down here.”\n\nByMike BakerJack HealyMark WalkerBernard MokamandYan Zhuang\n\nA gunman deliberately started a wildfire in a rugged mountain area of Idaho and then shot at the firefighters who responded, killing two and injuring another on Sunday afternoon, in what the local sheriff described as a “total ambush.”\n\nLaw enforcement officers exchanged fire with the gunman while the wildfire burned. Officials later found the body of a male suspect on the mountain with a firearm nearby, Sheriff Robert Norris of Kootenai County said at a news conference on Sunday night. The authorities said they believed the suspect had acted alone, but they did not release any information about his identity or motives.\n\n“This was a total ambush,” Sheriff Norris said. “These firefighters did not have a chance.”\n\nThe firefighters were dispatched to conduct reconnaissance after the authorities received a phone call about a fire on Canfield Mountain, on the northeastern outskirts of Coeur d’Alene, at about 1:21 p.m., Sheriff Norris said. About 40 minutes later, firefighters said that they were being shot at, he said.\n\nAs the shooting unfolded, firefighters pleaded for help after two of them were shot, according to a feed posted on Broadcastify, a website that provides public access to emergency radio communications. One firefighter reported that they were hiding behind a firefighting rig. One could be heard saying that they thought the fire was set intentionally.\n\nOver 300 law enforcement officers from numerous agencies responded, Sheriff Norris said. The F.B.I. confirmed they were there and helping the local authorities. As evening fell, the authorities used cellphone data to home in on the suspect, and located his body, he said. He added that the body was then moved because the fire was spreading rapidly. The authorities did not disclose the size of the fire.\n\nPreliminary information indicates that the suspect acted alone, Sheriff Norris said, adding that the dead man had not yet been identified. It was unclear how he died. The sheriff said that officials did not believe that the suspect was the same man who called to report the fire.\n\nOne of the firefighters who died worked for the Coeur d’Alene Fire Department and the other was from Kootenai County Fire and Rescue, Sheriff Norris said. The authorities have not released their names. The injured firefighter, from Kootenai County,was in stable condition, the sheriff added.\n\nThe Canfield Mountain area features both public and private land, with a system of trails through steep mountain terrain used by hikers, mountain bikers and motorcyclists. Hikers were still making it off the mountain as the gunfire occurred, Sheriff Norris said.\n\nGraham Christensen, a past president of the Lake City Trail Alliance, said the Coeur d’Alene Fire Department regularly performed brush clearing and fire suppression there, and said he did not know of a naturally caused wildfire there in the past two decades. He said the attack was a shock because the area had always felt so safe.\n\nOn Sunday, Brian Hadley had been riding up the dirt roads around Canfield Mountain to train for a mountain-biking race when a neighbor called him to share the news about the fire. Mr. Hadley turned back, and as he rode down the mountain he heard three gunshots in quick succession. When he reached the parking lot at the base of the mountain, law enforcement officers ordered him out of the area.\n\nHe said he could still see smoke from the fire drifting over his roof on Sunday evening — an unnerving sight because recent dry conditions have increased the wildfire danger in northern Idaho.\n\nMike Baker is a national reporter for The Times, based in Seattle.\n\nJack Healy is a Phoenix-based national correspondent for The Times who focuses on the politics and climate of the Southwest. He has worked in Iraq and Afghanistan and is a graduate of the University of Missouri’s journalism school.\n\nMark Walker is an investigative reporter for The Times focused on transportation. He is based in Washington.\n\nYan Zhuang is a Times reporter in Seoul who covers breaking news.",
        "source_2": "Reporting by Brad Brooks in Colorado and Costas Pitas in Los Angeles; Editing by Humeyra Pamuk, Lincoln Feast and Stephen Coates\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nA prominent Al Jazeera journalist, who had previously been threatened by Israel, was killed along with four colleagues in an Israeli airstrike in an attack condemned by journalists and rights groups.\n\nReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.\n\nAccess unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.\n\nBrowse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.\n\nScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.\n\nAll quotes delayed a minimum of 15 minutes.See here for a complete list of exchanges and delays.",
        "source_3": "'The Big Weekend Show' has updates on a shooting in Coeur d'Alene.\n\nA SWAT team has located a deceased man and a nearby firearm hours after a sniper shot and killed two firefighters and injured another while they were battling a wildfire inIdaho, authorities confirmed late Sunday.\n\nThe Kootenai County Sheriff's office said the deceased male was located on Canfield Mountain. A shelter in place was lifted, but an active wildfire remained, the sheriff's office said.\n\nThe update came hours after the International Association of Fire Fighters confirmed that the two victims who were killed were firefighters. Some 300 law enforcement officers were on scene.\n\n\"While responding to a fire earlier today in Coeur d’Alene, Idaho, IAFF members were ambushed in a heinous act of violence. Two of our brothers were killed by a sniper, and a third brother remains in surgery,\" the association said. \"Please keep them, their families, and law enforcement in your prayers.\"\n\nFBI Deputy Director Dan Bongino said the agency responded to the scene to provide tactical and operational support.\n\n\"FBI technical teams and tactical assets are currently on the scene providing support. It remains an active, and very dangerous scene,\" Bongino said just before 9 p.m.\n\nDuring a news conference, Kootenai County Sheriff Robert Norris said two firefighters were killed and a third was fighting for his life but was in stable condition after undergoing surgery.\n\nCALIFORNIA SHOOTING LEAVES 1 OFFICER DEAD, ANOTHER WOUNDED\n\nAn acitve shooter and wildfire situation unfolded in Coeur d'Alene, Idaho on Sunday.(KHQ)\n\n\"We do believe the suspect started the fire and we do believe that it was an ambush and it was intentional,\" he said, noting that a preliminary investigation suggests there was only one gunman. \"This was a total ambush. These firefighters did not have a chance.\"\n\nThe sheriff said a recommendation was made at about 6:30 p.m. to neutralize the shooter. Law enforcement was able to track a cellphone signal to the suspect's location.\n\nHe added that the fire compromised evidence at the crime scene, saying: \"we felt that as the fire was approaching we needed to scoop up that body.\"\n\nIt is unclear if the suspect had more than one weapon. That determination will not be made until the fire diminishes. The investigation will continue Monday morning, the sheriff said. Crews will continue working through the night.\n\nThe Kootenai County Sheriff’s Officeissued an alert earlier Sunday afternoon stating: \"Active shooter at Canfield Mountain. Injuries have been reported, though the severity remains unknown. Please avoid the area.\"\n\nNorris had said that they were developing a plan to move people out of the mountains as soon as they had the fire under control.\n\nMASS SHOOTING INVESTIGATION UNDERWAY IN SOUTH CAROLINA AS VICTIMS FLOOD LOCAL HOSPITALS\n\nAuthorities said they were taking active sniper fire near Canfield Mountain in Coeur d'Alene, Idaho on Sunday.(KHQ)\n\nOfficials confirmed that the firefighters were responding to a brush fire near East Nettleton Gulch Roadwhen the shooting started.\n\nNorris said earlier that the suspect used what appeared to be \"modern-day, high-powered, sporting rifles.\"\n\nDue to the danger, fire crews had to retreat, and the brush fire continues to pose a threat. Authorities were urging residents in the vicinity to stay vigilant and exercise caution as the situation develops.\n\n\"I would encourage all of you to tell people to stay away from the area, do not come to the area. Stay away from the area,\" Norris said earlier. \"This is going to be if these, individuals are not neutralized quickly, this is going to be a likely a multi-day operation.\"\n\nASPIRING FIREFIGHTER DIES IN SNOWBOARDING ACCIDENT AT POPULAR SKI RESORT\n\nIn this photo provided by Mark Lathrop, a blaze burns in a community near Canfield Mountain where a sniper ambushed firefighters responding to the fire, just north of Coeur d'Alene, Idaho, Sunday, June 29, 2025.(Mark Lathrop via AP)\n\nAttorney General Pam Bondi shared a statement and said more support was heading to Idaho.\n\n\"Thank you to our incredible @FBI agents on the ground assisting local authorities in Idaho. We are praying for all,\" Bondi wrote.\n\nDepartment of Homeland Security Secretary Kristi Noem also said their department is actively monitoring the situation and that \"justice will be served.\"\n\nIdaho Governor Brad Little reacted to the incident in a post on X.\n\n\"Multiple heroic firefighters were attacked today while responding to a fire in North Idaho. This is a heinous direct assault on our brave firefighters. I ask all Idahoans to pray for them and their families as we wait to learn more. Teresa and I are heartbroken,\" Little wrote. \"As this situation is still developing, please stay clear from the area to allow law enforcement and firefighters to do their jobs.\"\n\nIdaho Attorney General Raul Labrador also reacted to the situation, stating that this should never happen.\n\n\"Deeply saddened by reports that firefighters were shot while bravely responding to a fire in North Idaho. These heroes put their lives on the line for us every day; they should never be targets,\" Labrador said. \"Please keep our first responders and their families in your prayers.\"\n\nNorris said the sheriff's office was in communication with the White House, FBI, and governor's office.\n\nRetired FBI Special Agent Jason Pack described the deadly ambush on Canfield Mountain as a \"deliberate act of violence\" against first responders, telling Fox News Digital that the attack was neither random nor accidental.\n\n\"Firefighters responded to a routine call for a brush fire and walked straight into an ambush,\" Pack said. \"This was not a random act or a tragic accident. It was planned. It was targeted. And it cost two brave firefighters their lives.\"\n\nAs investigators work to piece together what happened, Pack said that authorities will work to \"formally identify the shooter.\"\n\nHe explained that while officials likely know who the suspect is, they will wait for forensic confirmation before releasing a name, which is standard procedure in major incidents.\n\n\"During the Nashville Christmas Day bombing, authorities waited for DNA confirmation, even though they had strong indications early on,\" he recalled. Pack said that processing the scene presents unique challenges due to the active wildfire, which forced investigators to quickly recover the suspect’s body before flames destroyed critical evidence.\n\nPack said the investigation will now focus on the suspect’s background and motivations.\n\n\"Investigators will be digging into the suspect’s background, looking at social media,criminal history, mental health records, and any possible signs of anti-government ideology or personal grievance,\" he said.\n\nBallistics experts will get to analyze weapons found at the scene, and an autopsy will help determine whether the suspect died by law enforcement action or [by] suicide.\n\n\"This kind of ambush against firefighters is extremely rare,\" Pack said. \"You do not expect to see firefighter names added to the National Fallen Firefighters Memorial in Emmitsburg, Maryland for that reason.\"\n\nStepheny Price is a writer for Fox News Digital and Fox Business. She covers topics including missing persons, homicides, national crime cases, illegal immigration, and more. Story tips and ideas can be sent to stepheny.price@fox.com\n\nStepheny Price is a Writer atFox Newswith a focus on West Coast and Midwest news, missing persons, national and international crime stories, homicide cases, and border security.\n\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}