{
    "question": "In what ways could revoking the British duo’s visas in response to their “Death to the IDF” chant at Glastonbury set a precedent for how the U.S. handles political speech by foreign performers?",
    "content": {
        "source_1": "English punk duo Bob Vylanstirred up controversyover the weekend for chanting “Death, death to the IDF” during their performance atGlastonbury. Following the set, singer Bobby Vylan, who uses a stage name, defended his onstage remarks in a lengthy Instagram post captioned, “I said what I said.”\n\nVylan shared that he had been “inundated with messages of both support and hatred.” He explained that he was inspired by his daughter responding to a survey on school meals and that “listening to her voice her opinion” reminded him that “we may not be doomed after all.”\n\n“Teaching our children to speak up for the change they want and need is the only way that we make this world a better place,” he wrote. “As we grow older and our fire possibly starts to dim under the suffocation of adult life and all its responsibilities, it is incredibly important that we encourage and inspire future generations to pick up the torch that was passed to us. Let us display to them loudly and visibly the right thing to do when we want and need change. Let them see up marching in the streets, campaigning on ground level, organising online and shouting about it on any and every stage that we are offered. Today it is a change in school dinners, tomorrow it is a change in foreign policy.”\n\nBob Vylan performed on the West Holts Stage of Glastonbury on Saturday afternoon ahead ofKneecap‘s much-discussed set. Vylan, one half of the group alongside drummer Bobbie Vylan, led the audience in chants of “Free, free Palestine” and “Death, death to the IDF,” a reference to the Israeli Defense Forces.\n\nGlastonbury boss Emily Eavis responded on Instagram, saying festival organizers were “appalled by the statements made from the West Holts stage by Bob Vylan yesterday.” She added, “Their chants very much crossed a line and we are urgently reminding everyone involved in the production of the Festival that there is no place at Glastonbury for antisemitism, hate speech or incitement to violence.”Editor’s picksThe 250 Greatest Albums of the 21st Century So FarThe 100 Best TV Episodes of All TimeThe 500 Greatest Albums of All Time100 Best Movies of the 21st Century\n\nA similar statement was issued by the BBC, which live-streamed the set, confirming that it would not be available to watch on demand. “Some of the comments made during Bob Vylan’s set were deeply offensive,” they said. “During this live stream on iPlayer, which reflected what was happening on stage, a warning was issued on screen about the very strong and discriminatory language. We have no plans to make the performance available on demand.” In a second statement released on Monday, the BBC called the chants “antisemitic” and “utterly unacceptable.”\n\nBritish Prime MinisterKeir Starmerresponded to Bob Vylan’s performance in a statement, saying, “There is no excuse for this kind of appalling hate speech.” Starmer, who previously criticized Kneecap being allowed to perform at the festival, added, “I said that Kneecap should not be given a platform and that goes for any other performers making threats or inciting violence. The BBC needs to explain how these scenes came to be broadcast.”\n\nKneecaptook the stagefollowing Bob Vylan’s set, using the opportunity to hit out at Starmer and to express their support for a free Palestine. “The Prime Minister of your country – not ours – said he didn’t want us to play,” band member Mo Chara proclaimed on stage. “So fuck Keir Starmer.” Rod Stewart was alsothe subject of commentfrom the band, with Chara saying: “Anybody going to Rod Stewart tomorrow? The man is older than Israel!”Trending StoriesChatGPT Lured Him Down a Philosophical Rabbit Hole. Then He Had to Find a Way OutTrump Hides Obama, Bush Portraits in Obscure White House StairwellMy Chemical Romance Deliver Electric Homecoming at MetLife StadiumVance Tries to Convince Americans That Trump Wants 'Full Transparency' in Epstein Case\n\nThe band’s set wasn’t live-streamed as planned on the BBC iPlayer, but Kneecaptook to Instagramearlier in the day to confirm that the BBC “WILL put our set from Glastonbury today on the I-player later this evening for your viewing pleasure.”\n\nFollowing their performance, UTA, who represented the band,reportedly droppedthem as clients. Their band page has been scrubbed from the agency’s website.",
        "source_2": "The prime minister has condemned UK punk duo Bob Vylan for urging \"death\" to Israeli troops in what he called \"appalling hate speech\".\n\nGlastonbury Festival organisers have also said they were \"appalled\" after frontman rapper Bobby Vylan led chants of \"free, free Palestine\" and \"death, death to the IDF [Israel Defense Forces]\".\n\nIn a statement, Sir Keir Starmer said the BBC had questions to answer over its live broadcast of the group's performance on Saturday.\n\nA BBC spokesperson previously said some of the comments were \"deeply offensive\", adding it had issued a warning on screen about \"very strong and discriminatory language\". The set will not be available on BBC iPlayer.\n\nSir Keir has also criticised Kneecap saying ahead of the festival thattheir appearance was not \"appropriate\". TheIrish-language rap grouphave previously described Israel's military action in Gaza as a genocide.\n\nHe said: \"There is no excuse for this kind of appalling hate speech.\n\n\"I said that Kneecap should not be given a platform and that goes for any other performers making threats or inciting violence.\"\n\nThe prime minister is the latest in a string of cabinet ministers to denounce Bobby Vylan's comments in the 24 hours since the group appeared at Glastonbury.\n\nDirectly after the set, a government spokesperson said Culture Secretary Lisa Nandy had pressed BBC boss Tim Davie for an urgent explanation of the broadcaster's vetting process.\n\nThe government added that it welcomed the decision not to re-broadcast the performance on BBC iPlayer.\n\nShadow home secretary Chris Philp said it was \"clear\" the rapper was \"inciting violence and hatred\" and should be prosecuted.\n\nIn a post shared on Xon Sunday, he also called on the police to \"urgently investigate and prosecute the BBC\" who he claimed \"appear to have also broken the law\".\n\n\"Our national broadcaster should not be transmitting hateful material designed to incite violence and conflict,\" he said.\n\nSpeaking to the BBC's Sunday with Laura Kuenssberg programme earlier, Health Secretary Wes Streeting said Bob Vylan's comments were \"revolting\".\n\nHe said the \"irony of that music festival is that Israelis were taken from a music festival, killed, raped and in some cases are still being held captive\".\n\nGlastonbury Festival has said Bob Vylan's statements \"very much crossed a line\".\n\nA joint Instagram post from Glastonbury Festival and organiser Emily Eavis on Sunday said the event stood \"against all forms of war and terrorism\", and that with almost 4,000 performances on site \"there will inevitably be artists and speakers appearing on our stages whose views we do not share\".\n\n\"However, we are appalled by the statements made from the West Holts stage by Bob Vylan yesterday,\" it continued.\n\n\"Their chants very much crossed a line and we are urgently reminding everyone involved in the production of the festival that there is no place at Glastonbury for antisemitism, hate speech or incitement to violence.\"\n\nBob Vylan are a London-based English punk-rap duo, who formed in Ipswich in 2017. They have previously performed at Reading and Leeds festivals and toured with the likes of the Offspring, the Hives and Biffy Clyro.\n\nBobby Vylan serves as the singer and guitarist, while Bobbie Vylan is the drummer of the band. Both members use stage names to maintain their privacy and collectively refer to themselves as \"the Bobs\".\n\nPosting on Instagram on Sunday evening, Bobby told fans he had been \"inundated\" with messages of \"support and hatred\", and called for \"a change in foreign policy\", adding underneath his post: \"I said what I said.\"\n\nAntisemitism campaigners said they will formally complain to the BBC over its \"outrageous decision\" to broadcast the act live.\n\nThe Campaign Against Antisemitism group said in a post on X that Glastonbury had \"continued its headlong descent into a pit of extremism and hatred, but it is the behaviour of the BBC that is even more dangerous\".\n\nIt said it would formally complain to the BBC for broadcasting the performance, as well as that of Kneecap.\n\nThe BBC did not run a live broadcast of Kneecap's set due toeditorial concerns around impartiality, but on Sunday announced the set had been made available on iPlayer, with some edits.\n\nIt said the content had been edited to ensure it \"falls within the limits of artistic expression in line with our editorial guidelines\" and any strong language had been signposted with \"appropriate warnings\".\n\nKneecap has made headlines in recent months after rapper Liam Óg Ó hAnnaidh, who performs under the name Mo Chara, was charged with a terrorism offence.\n\nHe is accused of displaying the flag of proscribed terrorist organisation Hezbollah at a gig last year. He has denied the charge.\n\nFollowing sets from both groups, Avon and Somerset Police said it would review footage of comments made by acts on the West Holts Stage.\n\nThe force said footage \"will be assessed by officers to determine whether any offences may have been committed that would require a criminal investigation\".\n\nKneecap's highly-charged performance on Saturday was watched by thousands as they hit back at Sir Keir with expletive-laden chants.\n\nMr Ó hAnnaidh continues to be on bail andwill appear at courtfor the next hearing on 20 August.\n\nSeparately on Sunday, the Met Police said it will not pursue prosecution after videos emerged in April appearing to show Kneecap calling for the death of British MPs.\n\n\"A range of offences were considered as part of the investigation. However, given the time elapsed between the events in the video and the video being brought to police attention, any potential summary only offences were beyond the statutory time limit for prosecution,\" the force said.",
        "source_3": "State Department official: \"The U.S. government will not issue visas to any foreigner who supports terrorists.\"\n\nThe State Department is looking to revoke the visa for Bobby Vylan, a British rap duo whose performance at a festival over the weekend went viral for his virulent anti-Israel lyrics that included a call for death to all Israeli soldiers.\n\nA senior State Department official told The Daily Wire that it is “already looking at revocation” of their visas ahead of a roughly twenty-city tour through the United States, with performances planned in several major cities, including Washington, D.C.\n\n“As a reminder, under the Trump Administration, the U.S. government will not issue visas to any foreigner who supports terrorists,” the senior official said.\n\nVocalist Pascal Robinson-Foster uses the stage name Bobby Vylan for his punk duo Bob Vylan—a name that nods to legendary Jewish singer-songwriter Bob Dylan, who released the pro-Israel song ‘Neighborhood Bully’ in 1983.\n\nWhile performing at England’s annual Glastonbury Music Festival — which was live streamed on the BBC — Vylan incited his crowd of thousands to chant, “Death, death to the IDF.”\n\n“Death, death to the IDF” chanted from the stage by Bob Vylan in front of 200k people at@glastonbury.\n\nThis is coming to NYC#ZohranForMayorpic.twitter.com/t6vtHVhNQa\n\n“Free, Free Palestine,” Vylan chanted with the crowd at Britain’s biggest summer music festival. “But have you heard this one though? Death, death to the IDF! Death, death to the IDF!”\n\nAfter repeating the chant several times, Vylan referenced another violent slogan: “Hell yeah, from the river to the sea, Palestine must be, will be, inshallah, it will be free.”\n\nFollowing his remarks, StopAntisemitismcalled forVylan to have his visa revoked ahead of his upcoming concerts in the United States for his Inertia Tour. He currently has concerts scheduled in New York City. Boston, Los Angeles, and Nashville, Tennessee.\n\nCALIFORNIA EPA EMPLOYEE CHARGED WITH THREATENING JEWS, ATTEMPTING TO PROVIDE GUNS AND MONEY TO ISIS\n\n“The antisemite must have his visa denied/rescinded – his hate is not welcome here,” the StopAntisemitism wrote.\n\nThe chair of the Department of Justice’s Task Force to Combat Antisemitism, Leo Terrell, said his “first call” on Monday morning will be to Secretary of State Marco Rubio to ensure Vylan cannot enter the United States.\n\n“These abhorrent chants, which included calls for the death of members of the Israeli Defense Forces, are abhorrent and have no place in any civil society,” Terrell said in a statement. “We understand that Mr. Vylan is planning to travel to the United States as part of the Inertia Tour. In response, Mr. Terrell’s Task Force will be reaching out to the U.S. Department of State on Monday to determine what measures are available to address the situation and to prevent the promotion of violent antisemitic rhetoric in the United States.”\n\nAvon and Somerset Police in the United Kingdomsaid they are investigatingthe duo’s performance and will determine “whether any offenses may have been committed that would require a criminal investigation.”\n\nTRUMP HAS BEEN CLEAR FOR 14 YEARS THAT IRAN CANNOT HAVE A NUCLEAR WEAPON\n\nA spokesperson for Lisa Nandy, England’s Secretary of State for Culture, Media and Sport,said she“strongly” condemned Vylan’s “threatening comments” and demanded “an urgent explanation” from the BBC regarding its vetting process.\n\nUnited Kingdom Prime Minister Keir Starmer called the chants “appalling hate speech.”\n\nIn a statement, the BBC conceded that “some of the comments made during Bob Vylan’s set were deeply offensive.”\n\n“During this live stream on iPlayer, which reflected what was happening on stage, a warning was issued on screen about the very strong and discriminatory language,” the BBC added.\n\nHAMAS IS PREPARING ATTACKS ON AMERICAN CONTRACTORS HELPING DISTRIBUTE AID IN GAZA\n\nVylan responded to the controversy in an Instagram post on Sunday saying that it is important to “encourage and inspire future generations to pick up the torch that was passed to us.”\n\n“Let us display to them loudly and visibly the right thing to do when we want and need change,” he wrote. “Let them see us marching on the streets, campaigning on the ground level, organising online and shouting about it on any and every stage that we are offered.”\n\nLiora Rez, the executive director of StopAntisemitism, applauded the State Department preparing to take action against the musician who called for violence against the military of one of America’s strongest allies.\n\n“StopAntisemitism is committed to doing everything in our power to ensure the United States does not follow the UK’s dangerous descent into institutionalized antisemitism,” Rez told The Daily Wire. “We are grateful to the State Department for swiftly prioritizing this matter and remain confident they will agree that individuals who promote such hatred have no place on American soil.”\n\nOther songs performed at the festival — which was filled with Palestinian flags in the crowd and one on stage, along with the slogan, “This country was built on the backs of immigrants” — sent the message that the United Kingdom has already been conquered by immigrants.\n\n“I hear you want your country back,” Vylan says. “Well, shut the f*** up.”\n\nThe whole crowd is white. Singing about how they’ve been conquered and need to shut the fuck up.pic.twitter.com/5W8Pebv0ys\n\nAt the music festival, Irish rap group Kneecap,also performedand chanted “free Palestine,” being embroiled in controversy supporting Hezbollah—including one member who was charged under the Terrorism Act for allegedly waving a Hezbollah flag at a concert in London last November, according to theAssociated Press.\n\nYour information could be the missing piece to an important story. Submit your tip today and make a difference."
    }
}