{
    "question": "How might the Supreme Court’s ruling limiting lower courts’ ability to block presidential executive orders affect future legal challenges to executive actions and the balance of power among the branches of government?",
    "content": {
        "source_1": "Washington —The Supreme Court on Friday limited the use of nationwide injunctions, reining in federal judges' ability to issue sweeping orders that have in recent years stymied implementation of policies from Republican and Democratic presidential administrations alike.\n\nIn a widely anticipated decision stemming from President Trump's executive order seeking to endbirthright citizenship, the high court said that universal orders likely exceed the equitable authority that Congress has granted to the federal courts. Justice Amy Coney Barrett authored themajority opinionfor the 6-3 court, with the liberal justices in dissent.\n\nThe court granted the Trump administration request to narrow the reach of the injunctions blocking the president's executive order while proceedings move forward, but \"only to the extent that the injunctions are broader than necessary to provide complete relief\" to plaintiffs who can sue, Barrett wrote. The justices did not address the question of whether Mr. Trump's order is constitutional, and the administration has said agencies have 30 days to issue public guidance about implementation of the policy, allowing time for more challenges to be filed.\n\n\"Some say that the universal injunction 'give[s] the Judiciary a powerful tool to check the Executive Branch.' But federal courts do not exercise general oversight of the Executive Branch; they resolve cases and controversies consistent with the authority Congress has given them,\" Barrett wrote. \"When a court concludes that the Executive Branch has acted unlawfully, the answer is not for the court to exceed its power, too.\"\n\nIn her dissent, Justice Sonia Sotomayor accused the majority of abdicating its role in protecting the rule of law. She read portions of her dissenting opinion from the bench.\n\n\"With the stroke of a pen, the president has made a 'solemn mockery' of our Constitution,\" she wrote. \"Rather than stand firm, the court gives way.\"\n\nAt a White House news conference following the decision, Mr. Trumppraised itas \"a monumental victory for the Constitution, the separation of powers, and the rule of law.\"\n\nThe court's ruling came in a trio of emergency appeals by the Trump administration arising out of the president's executive orderseeking to end the 14th Amendment's guarantee of birthright citizenship, which means that everyone born in the U.S. is a citizen, regardless of their parents' immigration status. The Justice Department hadasked the Supreme Courtto narrow the scope of three separate injunctions that blocked implementation of Mr. Trump's policy nationwide while legal challenges brought by 22 states, immigrants' rights groups and seven individuals moved forward.\n\nBut instead of swiftly deciding whether to grant the Trump administration emergency relief, the Supreme Court held arguments on whether to restrict the use of nationwide, or universal, injunctions, which are judicial orders that prevent the government from enforcing a policy anywhere in the country and against anyone, including individuals who are not involved in the litigation before them.\n\nThe dispute over the president's attempt to unwind birthright citizenship has become intertwined with the administration's battle against nationwide injunctions. These sweeping orders have frustrated both Democratic and Republican presidents seeking to implement their agendas among gridlock in Congress, and the fight over them has been simmering for several years.\n\nThe Congressional Research Serviceidentified86 nationwide injunctions that were issued during Mr. Trump's first term and 28 granted while former President Joe Biden was in office. In Mr. Trump's second term, the Congressional Research Service found 17 nationwide injunctions were issued during the first 100 days, though the Trump administration estimated last month there have been far more — at least 40 of these orders, and most coming from the same five judicial districts.\n\nSome of the justices havesuggestedinpast writingsthat the Supreme Court would have to clarify whether nationwide injunctions are allowed at all, and members on both ideological sides of the bench have been critical of them. The president and his allies haveattacked judgesfor issuing nationwide injunctions in the slew of legal challenges to Mr. Trump's policies, and even called forsome to be impeached.\n\nThe president's birthright citizenship order was one of the first that he signed on his first day back in office. While the 14th Amendment has for more than a century been understood to guarantee citizenship to all people born in the U.S., Mr. Trump's order denied birthright citizenship to children born to a mother who is unlawfully present in the U.S. or who is lawfully present on a temporary basis; or whose father is neither a citizen nor lawful permanent resident. The president directed federal agencies to stop issuing documents recognizing U.S. citizenship to children in those categories born after Feb. 19.\n\nMore than half-a-dozen lawsuits challenging the measure were filed before it took effect, and three federal district courts inWashington, MarylandandMassachusettseach blocked the government from implementing the order. Federal appeals courts in California, Massachusetts and Virginia then refused requests by the Trump administration to partly block the lower court orders.\n\nThe Justice Department filed emergency appeals of the three decisions with the Supreme Court in mid-March and asked it to limit enforcement of the birthright citizenship order to 28 states and individuals who are not involved in the cases. The administration said the Supreme Court should, at a minimum, allow agencies to develop and issue public guidance while proceedings continue, and took aim at thebreadth of the injunctionsissued by the district courts. Government lawyers said in a filing that universal injunctions have reached \"epidemic\" proportions since Mr. Trump returned to the White House in January.\n\n\"Those injunctions thwart the executive branch's crucial policies on matters ranging from border security, to international relations, to national security, to military readiness,\" Solicitor General D. John Sauerwrote. \"They repeatedly disrupt the operations of the Executive Branch up to the Cabinet level.\"\n\nBut the plaintiffs in the cases urged the Supreme Court to leave the district court orders in place. In afilingof their own, officials from 18 states, the District of Columbia and San Francisco called the Trump administration's request \"remarkable,\" since it would allow the government to strip hundreds of thousands of American-born children of their citizenship while the legal challenges move forward and render them \"deportable on birth and at risk of statelessness.\"\n\nThe states argued that the Trump administration seeks to violate binding Supreme Court precedent that recognized birthright citizenship is guaranteed by the 14th Amendment.\n\nWriting for the majority, Barrett looked to the nation's history and said that nationwide injunctions were \"conspicuously nonexistent\" in the 18th, 19th and 20th centuries. If federal courts had such a tool, she said, \"surely they would not have let it lay idle.\"\n\n\"Nothing like a universal injunction was available at the founding, or for that matter, for more than a century thereafter. Thus, under the Judiciary Act, federal courts lack authority to issue them,\" she wrote.\n\nIn her dissent, Sotomayor warned that the Supreme Court's new regime puts all manner of constitutional rights at risk and renders them \"meaningful in name only\" for people who are not parties to a lawsuit.\n\n\"Today, the threat is birthright citizenship,\" she wrote. \"Tomorrow, a different administration may try to seize firearms from law-abiding citizens or prevent people of certain faiths from gathering to worship.\"\n\nSotomayor accused the court's conservative majority of ignoring whether Mr. Trump's plan to end birthright citizenship is constitutional and said its \"patent unlawfulness\" underscores why universal injunctions are appropriate remedies.\n\nWhile the high court agreed to grant Mr. Trump's request for a partial stay of the injunctions, Barrett wrote that there are still issues for the lower courts to decide, including whether narrower relief is appropriate.\n\nThe Supreme Court's decision still allows plaintiffs challenging a policy to file class-action lawsuits and seek certification of a nationwide class. In her dissent, Sotomayor urged individuals who may be impacted by Mr. Trump's birthright citizenship plan, as well as lower courts, to move swiftly.\n\n\"[T]he parents of children covered by the Citizenship Order would be well advised to file promptly class-action suits and to request temporary injunctive relief for the putative class pending class certification,\" she wrote. \"For suits challenging policies as blatantly unlawful and harmful as the Citizenship Order, moreover, lower courts would be wise to act swiftly on such requests for relief and to adjudicate the cases as quickly as they can so as to enable this Court's prompt review.\"\n\nOn the heels of the Supreme Court's decision, CASA, one of the groups that challenged the order, asked the federal district court to allow its lawsuit to proceed on a classwide basis and certify as a class \"all children who have been born or will be born in the United States on or after February 19, 2025, who are designated by Executive Order 14,160 to be ineligible for birthright citizenship, and their parents.\"\n\nMelissa Quinn is a politics reporter for CBSNews.com. She has written for outlets including the Washington Examiner, Daily Signal and Alexandria Times. Melissa covers U.S. politics, with a focus on the Supreme Court and federal courts.",
        "source_2": "The top court in the US has ruled judges in lower courts have limited ability to block presidential orders, giving President Donald Trump what he called a \"giant win\".\n\nThe case surrounded whether Trump's attempt to use an executive order to end birthright citizenship for non-citizens and undocumented migrants was allowed.\n\nIn a 6-3 ruling, the Supreme Court's conservative justices sided with Trump and said they were not addressing Trump's attempt to end birthright citizenship. Rather their ruling addressed presidential actions broadly.\n\nExperts said the ruling will change how executive actions are challenged in the future and noted legal challenges to the Friday ruling are likely to come.\n\nImmigrant rights groups and 22 states sued the Trump administration over an executive order the president signed on his first day back in office. That order was aimed at ending birthright citizenship which gives people born on US territory automatic citizenship rights.\n\nThe lawsuits, filed in Maryland, Massachusetts, Washington state and elsewhere, were aimed at blocking the order from taking effect and temporarily did just that.\n\nBut the Justice Department disagreed and appealed the case to the Supreme Court, arguing those injunctions were not constitutional.\n\nOn Friday, the court agreed with the Trump's administration and introduced limits on how universal injunctions are issued by federal courts.\n\nTrump hailed the ruling as a victory at a surprise press conference on Friday and said the decision was a \"monumental victory for the constitution, the separation of powers and the rule of law\".\n\nHe said \"radical left judges\" have tried to overrule his powers as president and that nationwide injunctions are a \"grave threat to democracy\".\n\nUpon returning to the White House in January, Trump immediately began using executive actions as a means to accomplish his agenda.\n\nAttorney General Pam Bondi, who also spoke at the press conference, said the decision meant judges will not be able to stop Trump's policies.\n\nShe said she expects the Supreme Court to take up the question of birthright citizenship itself, in October when the next session of court begins.\n\nWhile the Friday ruling said courts will still be able to halt presidential actions they deem unconstitutional or illegal, it will happen further along in the judicial process which will give presidents more space to act.\n\nBecause of the ruling to limit injunctions, Trump's birthright citizenship order will be able to take effect, 30 days after the court's opinion was filed, the court said.\n\nHowever, the ruling is likely to see further legal challenges.\n\nSamuel Bray, a Notre Dame Law School professor and expert on nationwide injunctions, said the ruling \"has fundamentally reset the relationship between the federal courts and the executive branch\".\n\nThe Supreme Court's ruling will mean universal injunctions \"will no longer be the default remedy in challenges to executive action\".\n\nJustice Amy Coney Barrett, who authored the majority opinion, said federal courts do not \"exercise general oversight of the Executive Branch\" and instead they \"resolve cases and controversies consistent with the authority Congress has given them\".\n\n\"When a court concludes that the Executive Branch has acted unlawfully, the answer is not for the court to exceed its power, too,\" she wrote.\n\nJustice Brett Kavanaugh, who wrote a concurring opinion, said that the Supreme Court, not the district courts or courts of appeals, \"will often still be the ultimate decisionmaker as to the interim legal status of major new federal statutes and executive actions\".\n\nJustice Sonya Sotomayor penned the dissent for the liberal justices and called the Trump administration's request of the court \"gamesmanship\" and said the court \"plays along\".\n\n\"The Court's decision is nothing less than an open invitation for the Government to bypass the Constitution,\" she wrote.\n\n\"The rule of law is not a given in this Nation, nor any other. It is a precept of our democracy that will endure only if those brave enough in every branch fight for its survival. Today, the Court abdicates its vital role in that effort. With the stroke of a pen, the President has made a 'solemn mockery' of our Constitution.\"\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "President Donald Trump addresses the press after the Supreme Court delivered a major victory in his quest to block lower courts from issuing universal injunctions that upended many of his administration's executive orders and actions.\n\nPresidentDonald Trumpcelebrated after the Supreme Court moved to block lower courts from issuing universal injunctions, something that had impacted his executive orders.\n\nThe president held a news conference just over an hour after the ruling was issued and said theSupreme Courthad stopped a \"colossal abuse of power.\"\n\n\"I was elected on a historic mandate, but in recent months, we've seen a handful of radical left judges effectively try to overrule the rightful powers of the president to stop the American people from getting the policies that they voted for in record numbers,\" Trump said on Friday.\n\nBecause of the ruling, the Department of Justice will \"promptly file to proceed with numerous policies that have been wrongly enjoined on a nationwide basis,\" Trump said.\n\nSCOTUS RULES ON TRUMP'S BIRTHRIGHT CITIZENSHIP ORDER, TESTING LOWER COURT POWERS\n\nPresident Donald Trump addresses reporters in the White House briefing room after the Supreme Court ruled on the birthright citizenship case, June 27, 2025.(REUTERS/Ken Cedeno)\n\nTrump also accused lower court judges of trying to \"dictate the law for the entire nation\" rather than ruling on the cases before them.\n\nOn Friday, Supreme Court justices ruled 6-3 to allow the lower courts to issue injunctions only in limited instances, though the ruling leaves open the question of how the ruling will apply to the birthright citizenship order at the heart of the case.\n\nFacade of the Supreme Court.(Valerie Plesch/picture alliance via Getty Images)\n\nSENATORS SOUND OFF AS SUPREME COURT HEARS CASE ON NATIONWIDE INJUNCTIONS\n\nThe Supreme Court agreed this year to take up a trio of consolidated cases involving so-called universal injunctions handed down byfederal district judgesin Maryland, Massachusetts and Washington state. Judges in those districts had blocked Trump's ban on birthright citizenship from taking force nationwide – which the Trump administration argued in their appeal to the Supreme Court was overly broad.\n\nThe Supreme Court's arguments in May focused little on the merits of those universal injunctions – and on Friday, the court made clear that it is not ruling on whether the birthright citizenship orders are constitutional.\n\nPresident Donald Trump speaks to the media after the U.S. Supreme Court dealt a blow to the power of federal judges by restricting their ability to grant broad legal relief in cases, in the press briefing room at the White House in Washington D.C., June 27, 2025.(REUTERS/Ken Cedeno)\n\nTrump singled out the author of the majority opinion, Justice Amy Coney Barrett, for writing \"brilliantly,\" and also praised Justices SamuelAlito, Neil Gorsuch, Brett Kavanaugh and Clarence Thomas, plus Chief Justice John Roberts, for joining the majority.\n\n\"The applications do not raise – and thus we do not address – the question whether the Executive Order violates the Citizenship Clause or Nationality Act,\" Justice Amy Coney Barrett said, writing for the majority. \"The issue before us is one of remedy: whether, under the Judiciary Act of 1789, federal courts have equitable authority to issue universal injunctions.\"\n\n\"A universal injunction can be justified only as an exercise of equitable authority, yet Congress has granted federal courts no such power,\" she added.\n\nREAD THE SUPREME COURT DECISION –APP USERS, CLICK HERE:\n\nConey Barrett took a swipe at Justice Ketanji Brown Jackson, saying that her argument was \"at odds with more than two centuries’ worth of precedent, not to mention the Constitution itself. We observe only this: [Jackson] decries an imperial Executive while embracing an imperial Judiciary.\"\n\nIn her dissent, Jackson warned that the ruling allowed the president to \"violate the Constitution\" and presented \"an existential threat to the rule of law.\"\n\nRachel Wolf is a breaking news writer for Fox News Digital and FOX Business.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}