{
    "question": "What are the potential legal, political, and media accountability implications of Gov. Gavin Newsom’s $787 million defamation lawsuit against Fox News over its coverage of his phone call with Donald Trump?",
    "content": {
        "source_1": "California Gov. Gavin Newsom is suing Fox News for $787 million, accusing the media outlet of defamation in its coverage of a recent phone call between him and President Donald Trump.\n\nThe legal action comes as Newsom, a potential 2028 presidential contender, has intensified his pushback against Trump.\n\nThe lawsuit stems from a public dispute between Newsom and Trump over the timing of a phone call that occurred as protests took hold in Los Angeles over the Trump administration’s immigration enforcement efforts earlier this month.\n\nIn a lawsuit filed in Delaware Superior Court, Newsom’s attorneys allege Fox News defamed him by airing deceptively edited videos and making false statements claiming the Democratic governor lied about the phone call.\n\n“Why would Newsom lie and claim Trump never called him?” Fox News anchor Jesse Watters said in one segment cited in the lawsuit. Newsom’s attorneys also noted the segment featured a chyron reading, “Gavin Lied About Trump’s Call.”\n\nNewsom’s attorneys argued the network attempted to damage Newsom’s future political prospects. “Individual viewers who heard Fox’s statement that Governor Newsom was ‘lying’ about when he last spoke to President Trump are less likely to support Governor Newsom in future elections and are less likely to support Governor Newsom’s causes or contribute to his political organizations,” the attorneys wrote.\n\nNewsom’s attorneys also sent a letter to Fox News saying the governor will drop the lawsuit if the network retracts the claims and Watters issues an on-air apology.\n\nThe request for $787 million damages mirrors the figure Fox News paid Dominion Voting Systems in a settlement to avert a defamation trial over the media outlet’s 2020 election lies.\n\n“If Fox News wants to lie to the American people on Donald Trump’s behalf, it should face consequences – just like it did in the Dominion case,” Newsom said in a statement. “Until Fox is willing to be truthful, I will keep fighting against their propaganda machine.”\n\n“Gov. Newsom’s transparent publicity stunt is frivolous and designed to chill free speech critical of him,” a Fox News spokesperson said. “We will defend this case vigorously and look forward to it being dismissed.”\n\nNewsom is suing Fox News in his personal capacity. His attorneys include Mark Bankston, who represented the families of the children killed at Sandy Hook Elementary School when they sued InfoWars host Alex Jones over his false claims about the 2012 massacre, and Michael Teeter.\n\nThe California governor has appeared on Fox News in several high-profile moments, including a debate with Florida Gov. Ron DeSantis in 2023.\n\nThe moves come amid speculation about Newsom’s future presidential ambitions. Newsom, who is term-limited, has stepped up his pushback against Trump, a longtime rival, as California has become a target for the Trump administration. In his official capacity, Newsom has sued the Trump administration over tariff policy and the president’s deployment of the National Guard to Los Angeles earlier this month.\n\nShortly after the lawsuit was announced, Newsom sent a fundraising email noting the suit in the subject line and asking for contributions to his political group.",
        "source_2": "Reporting by Jonathan Stempel in New York and Ryan Patrick Jones in Washington; Editing by Doina Chiacu and Matthew Lewis\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nDenmark's Orsted on Monday asked its shareholders for 60 billion crowns ($9.4 billion), sending the stock sharply lower as the wind farm developer seeks to boost its finances amid U.S. President Donald Trump'sopposition to wind power.\n\nReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.\n\nAccess unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.\n\nBrowse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.\n\nScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.\n\nAll quotes delayed a minimum of 15 minutes.See here for a complete list of exchanges and delays.",
        "source_3": "\"Until Fox is willing to be truthful, I will keep fighting against their propaganda machine.\"\n\nCalifornia Democratic Governor Gavin Newsom filed a $787 million defamation lawsuit against Fox News on Friday, alleging the news network deliberately misrepresented the timeline of a phone call between him and President Donald Trump to make it appear the governor lied about their communication.\n\nThe lawsuit, firstreportedby POLITICO, centers on Fox News’ coverage of a June 7 phone call between Trump and Newsom during anti-ICE riots in Los Angeles County. President Trump said hedeployedthousands of National Guard troops and hundreds of Marines to the area to quell the violence despite the governor’s objections, but local officials say they are there to protect federal buildings and federal workers.\n\nThe dispute arose when Trump claimed on June 10 that he had called Newsom “a day ago.” Newsom subsequently denied any recent contact, stating: “There was no call. Not even a voicemail. Americans should be alarmed that a President deploying Marines onto our streets doesn’t even know who he’s talking to.”\n\nI’m suing Fox News for $787 million.https://t.co/L73VUsPsuBpic.twitter.com/qKoRaxHRDW\n\nFox News then ran a segment on Jesse Watters’ program that Newsom’s claims “willfully distorted” the timeline to the network’s viewers. According to the lawsuit, Watters aired a deceptively edited video that juxtaposed Trump’s “day ago” claim with call logs obtained by Fox host John Roberts showing the call occurred on June 7 — three days earlier, not one day as Trump had claimed. Newsom accuses the network of falsely claiming he lied about the phone call and violated California’s Unfair Competition Law, which outlaws “deceptive and unfair business practices.”\n\n“If Fox News wants to lie to the American people on Donald Trump’s behalf, it should face consequences — just like it did in the Dominion case,” Newsom said in a statement to POLITICO, referencing Fox’s $787.5 million settlement with Dominion Voting Systems in 2023.\n\n“I believe the American people should be able to trust the information they receive from a major news outlet. Until Fox is willing to be truthful, I will keep fighting against their propaganda machine,” the governor added.\n\nFox News dismissed the lawsuit in a statement to The Daily Wire, writing, “Gov. Newsom’s transparent publicity stunt is frivolous and designed to chill free speech critical of him. We will defend this case vigorously and look forward to it being dismissed.”\n\nIn Fox News’s initial reporting on the disputed call, headlined “Trump brings receipts he called Newsom amid LA riots as California gov claims there wasn’t ‘even a voicemail,'” the network didincludeNewsom’s clarification that the call was from “3 days ago” rather than the “day ago” Trump had claimed.\n\nPOLITICO notes that defamation cases brought by public officials face a much higher legal standard than those filed by private citizens. Newsom has indicated he would retract the lawsuit if Fox News issues a formal retraction and Jesse Watters delivers an on-air apology.\n\nYour information could be the missing piece to an important story. Submit your tip today and make a difference."
    }
}