{
    "question": "How might the United States halting trade talks and signaling new tariffs over Canada’s 3% digital services tax affect the prospects for a near-term trade deal and the broader economic relationship between the two countries?",
    "content": {
        "source_1": "PresidentDonald Trumpon Friday said the United States is immediately \"terminating ALL discussions on Trade withCanada\" in response to Ottawa's decision to impose adigital services taxon American tech firms.\n\nTrump's surprise announcement onTruth Socialaccused Canada of \"copying the European Union\" with the \"egregious\" tax.\n\n\"We will let Canada know the Tariff that they will be paying to do business with the United States of America within the next seven day period,\" Trump added.\n\n\"We have just been informed that Canada, a very difficult Country to TRADE with, including the fact that they have charged our Farmers as much as 400% Tariffs, for years, on Dairy Products, has just announced that they are putting a Digital Services Tax on our American Technology Companies, which is a direct and blatant attack on our Country. They are obviously copying the European Union, which has done the same thing, and is currently under discussion with us, also. Based on this egregious Tax, we are hereby terminating ALL discussions on Trade with Canada, effective immediately. We will let Canada know the Tariff that they will be paying to do business with the United States of America within the next seven day period. Thank you for your attention to this matter!\"\n\n\"We have such power over Canada,\" Trump said in the Oval Office later Friday.\n\n\"They were foolish\" to go forward with the new tax, Trump said.\n\nHe said the U.S. would \"stop all negotiations with Canada right now until they straighten out their act.\"\n\nThe office of Canadian Prime Minister Mark Carney did not immediately respond to CNBC's request for comment.\n\nThe president's angry declaration suddenly imperils America's trade relationship with a close ally that has long been one of its top two global trading partners.\n\nU.S. goods trade with Canada totaled roughly $762 billion last year, according to the office of theU.S. trade representative.\n\nFollowing Trump's announcement, theS&P 500and theNasdaq Compositeboth turned negative, retreating from therecord highsthey had reached earlier in the day.\n\nThe first payments from Canada's digital services tax, which was enacted last year and applies retroactively to 2022, are set to be collected Monday. The tax would hit both domestic and foreign tech companies, including U.S. giants such asAmazon,GoogleandMeta.\n\nCanadian officials said this month that theywould not pause the digital services tax, despite ferocious opposition from the United States.\n\n\"Obviously, we think it's patently unfair to do it retroactively,\" Treasury Secretary Scott Bessent said later Friday on CNBC's \"Closing Bell: Overtime.\"\n\nBessent said the Trump administration was hoping that Carney's government would \"put a brake on\" the tax \"as a sign of goodwill.\"\n\nHe now expects that Trump trade representative Jamieson Greer will start an unfair trade practice investigation under Section 301 of the Trade Act of 1974 \"to determine the amount of harm\" that the new Canadian taxes pose to the U.S.\n\nGot a confidential news tip? We want to hear from you.\n\nSign up for free newsletters and get more CNBC delivered to your inbox\n\nGet this delivered to your inbox, and more info about our products and services.\n\n©2025CNBC LLC. All Rights Reserved.A Division of NBCUniversal\n\nData is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.",
        "source_2": "US President Donald Trump has said he is cutting off trade talks with Canada \"immediately\" as the country looks to start enforcing a tax policy targeting big tech companies.\n\nThe latest move, which he announced on social media, comes as the neighbouring nations had been working to agree a trade deal by mid-July.\n\nBoth countries have imposed tariffs on each other's goods after Trump sparked a trade war earlier this year and threatened to annex Canada using \"economic force\".\n\nOn Friday, the US president said he was ending talks due to what he called an \"egregious tax\" on tech companies and added he would announce new tariffs on goods crossing the border within the next week.\n\n\"We are hereby terminating ALL discussions on Trade with Canada, effective immediately,\" he wrote on social media.\n\n\"We will let Canada know the Tariff that they will be paying to do business with the United States of America within the next seven day period.\"\n\nLater in the Oval Office, President Trump told reporters that the US has \"all the cards\".\n\n\"Economically, we have such power over Canada. I'd rather not use it,\" he added.\n\nIn brief comments to reporters, Prime Minister Mark Carney suggested that talks would grind on.\n\n\"We will continue to conduct these complex negotiations in the best interest of Canadians,\" he said.\n\nCanada's 3% digital services tax has been a sticking point in its relationship with the US since the law was enacted last year. The first payments are due on Monday.\n\nBusiness groups estimate it will cost American companies, such as Amazon, Apple and Google, more than $2bn a year. Other countries have a similar tax in place, including the UK, France and Italy.\n\nCanadian officials had said they expected to address the issue as part of trade talks with the US.\n\nThere were hopes that the relatively warm relationship that newly elected Carney has forged with Trump might help those negotiations.\n\nThe president's latest move casts doubt on a future deal, though Trump has often used social media threats to try to gain leverage in talks or speed up negotiations he sees as stalling.\n\nLast month, for example, he threatened to ramp up tariffs on goods arriving to US shores from the European Union, only to relenta few days later.\n\nCandace Laing, chief executive of the Canadian Chamber of Commerce, which has been critical of the digital services tax, said that \"last-minute surprises should be expected\" as the deadline for a deal approaches.\n\n\"The tone and tenor of talks has improved in recent months, and we hope to see progress continue,\" she added.\n\nCanadian Senator Hassan Yussuff, who sits on a Canada-US trade advisory council to Prime Minister Carney, told the Globe and Mail that he believes Trump is trying to gain \"leverage\" in the talks by putting pressure on Canada.\n\nMeanwhile, some in Canada's business community have called on Carney to scrap the digital services tax. Goldy Hyder, president of the Business Council of Canada, said on Friday that the tax undermines Canada's relationship with the US, and it should be lifted \"to get trade negotiations back on track\".\n\nAt the G7 in mid-June, Trump and Carney had set a 30-day deadline for a trade deal to be reached. It is unclear whether Trump's latest comments have affected that timeline.\n\nDuring Trump's first term, the White House fought hard as many countries began considering taxes on digital services.\n\nBut Inu Manak, fellow for trade policy at the Council on Foreign Relations, noted that the issue was left unresolved in the trade deal the US and the UK reached earlier this year, suggesting some flexibility.\n\nShe said Trump's threat seemed like a move to ramp up pressure out of his typical negotiating \"playbook - but was also a sign the president had refocused on Canada, which could open the way for a deal.\n\n\"It does provide a bit of an opening - maybe not the one that Prime Minister Carney wanted... but it does provide some space for them to hasten those talks,\" she said.\n\nThe US is Canada's top trade partner, buying more than $400bn in goods last year under a longstanding free trade agreement.\n\nBut Trump hit that trade with a new 25% tariff earlier this year, citing concerns about drug trafficking at the border.\n\nNew US tariffs on cars, steel and aluminium have also scrambled relations. Car parts, for example, cross US, Mexican and Canadian borders multiple times before a vehicle is completely assembled and such import taxes threaten supply chains.\n\nTrump later carved out exemptions for some goods in the face of widespread alarm from businesses in both the US and Canada, which has hit back with tariffs of its own on some American products.\n\nShares in the US fell on Friday after Trump said he was cutting off talks, but later bounced back with the S&P 500 closing at a record high.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "SlateStone Wealth chief market strategist Kenny Polcari discusses where investors are putting their attention on 'The Claman Countdown.'\n\nPresidentDonald Trumpsaid on Friday that the U.S. is terminating all trade discussions with Canada.\n\nTrump cited Canada’s digital services tax on American tech companies as the reason for ending trade talks.\n\n\"They are obviously copying the European Union, which has done the same thing, and is currently under discussion with us, also. Based on this egregious Tax, we are hereby terminating ALL discussions on Trade with Canada, effective immediately,\" Trump wrote in a post on Truth Social.\n\nTREASURY SECRETARY REVEALS 'PEACE DEALS' WITH CHINA AS RARE EARTH SUPPLIES SET TO FLOW\n\nTrump said the administration will inform Canada within the \"next seven day period\" of whattariff it will payto do business with the U.S.\n\nThe president added in his post that Canada is \"a very difficult Country to TRADE with\" and claimed that Canada has levied tariffs of up to 400% on U.S. dairy products.\n\nPresident Donald Trump meets with Canadian Prime Minister Mark Carney at the G7 summit in Kananaskis, Alberta, Canada, on June 16, 2025.(Reuters/Kevin Lamarque / Reuters)\n\nFollowing Trump's announcement, the U.S. dollar gained 0.7% against the Canadian dollar.\n\nStocks pared their earlier gains on the news. Thebenchmark S&P 500 indexreached an all-time high after rising 0.59% as of early afternoon, though it sank on the president's announcement to a gain of about 0.21% as the market neared the end of this week's trading.\n\nStocks pared their earlier gains on the news.(Adam Gray for Fox News Digital / Fox News)\n\nCanada's digital services tax took effect in June 2024 and requires large businesses, whether they're headquartered in Canada or elsewhere, to pay a 3% tax on revenue earned from engaging with online users in Canada if they meet certain conditions.\n\nTRUMP WARNS SPAIN: PAY UP FOR DEFENSE OR PAY 'TWICE AS MUCH' IN TRADE NEGOTIATIONS\n\nPayments on the tax are due to be collected on Monday, and the tax applies to revenue from online marketplace services, online advertising, social media services and certain sales of user data.\n\nTheCanadian government and the Trump administrationhave clashed over tariffs after the president slapped a series of levies on Canadian goods after his return to the White House earlier this year, prompting Canada to retaliate with tariffs on American exports.\n\nCanadian Prime Minister Mark Carney and President Donald Trump had previously set a deadline of July 21, 2025, to reach a deal on a new trade agreement between the two countries.(Artur Widak/NurPhoto via Getty Images / Getty Images)\n\nMany of those tariffs remain in effect as the two sides seek to compromise on a new trade framework. The U.S.-Mexico-Canada Agreement (USMCA), which Trump negotiated during his first term, is due to be renegotiated by next year – though the two governments have sought to conclude negotiations earlier.\n\nCanadian Prime Minister Mark Carney and President Trump had previously set a deadline of July 21, 2025, to reach a deal on a new trade agreement between the two countries – which engage in a significant amount of bilateral trade.\n\nThe U.S. is Canada's largest trading partner, while Canada is the largest importer of American exports and one of the top three sources of U.S. imports.\n\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\n\nBy clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time."
    }
}