{
    "question": "How might the Supreme Court’s 6-3 decision limiting nationwide injunctions shape the immediate and longer-term legal battles over President Trump’s birthright citizenship executive order and other presidential actions?",
    "content": {
        "source_1": "TheSupreme Courtsided with the Trump administration in curbing nationwide injunctions granted against his birthright citizenship order,in a 6-3 rulingwith the court’s Republican appointees in the majority and the Democratic appointees dissenting.\n\n“These injunctions — known as ‘universal injunctions’ — likely exceed the equitable authority that Congress has granted to federal courts,” Justice Amy Coney Barrett wrote in a decision that didn’t decide the underlying legality of President Donald Trump’s attempt to restrict birthright citizenship. Litigation will continue on the issue in the lower courts and people can still bring additional challenges against the order, which Barrett said will take effect in 30 days.\n\nThe court also left open the possibility of plaintiffs bringing class action lawsuits, but whether any such actions would succeed remains to be seen.\n\nOn that note, Justice Samuel Alito wrote a separate concurring opinion, joined by Justice Clarence Thomas, in which he stressed the need for courts to police strict requirements for class actions and for granting any relief to third parties, like states, seeking to benefit from injunctions. “Lax enforcement of the requirements for third-party standing and class certification would create a potentially significant loophole to today’s decision,” he wrote, instructing the federal courts to “be vigilant against such potential abuses of these tools.”\n\nThe Democratic appointees were concerned with different abuses.\n\nIn her dissent for the court’s three Democratic appointees, Justice Sonia Sotomayor called out the court’s rewarding of the administration’s “gamesmanship.”\n\nShe noted that the administration didn’t ask the justices to fully block the lower court rulings against Trump’s policy. “Why? The answer is obvious: To get such relief, the Government would have to show that the Order is likely constitutional, an impossible task in light of the Constitution’s text, history, this Court’s precedents, federal law, and Executive Branch practice,” Sotomayor wrote.\n\n“So the Government instead tries its hand at a different game. It asks this Court to hold that, no matter how illegal a law or policy, courts can never simply tell the Executive to stop enforcing it against anyone. Instead, the Government says, it should be able to apply the Citizenship Order (whose legality it does not defend) to everyone except the plaintiffs who filed this lawsuit,” she continued, adding that the “gamesmanship in this request is apparent and the Government makes no attempt to hide it. Yet, shamefully, this Court plays along.”\n\nIn her own separate dissent, Justice Ketanji Brown Jackson said the court’s “decision to permit the Executive to violate the Constitution with respect to anyone who has not yet sued is an existential threat to the rule of law.”\n\nThe administrationappealed to the justicesafter several lower court judges blocked Trump’sexecutive orderattempting to restrict birthright citizenship. Those judges did not consider the legality of Trump’s order to be a close question; “blatantly unconstitutional” was what one of themcalled it.\n\nBut the administration didn’t ask the justices to affirm the legality of Trump’s order. Rather, it asked them to curb the nationwide relief granted by those lower court judges, insisting that the judges should’ve stuck to granting relief to the parties who brought the lawsuits in Washington state, Maryland and Massachusetts. In that respect,this appealwasn’t about the legality of birthright citizenship but about the general propriety of nationwide injunctions, an issue that has long bothered justices in all manner of cases having nothing to do with birthright citizenship.\n\nYet several justices raised the merits of the birthright citizenship issue during therare May 15 hearing, quizzing Trump’s solicitor general, John Sauer, about when and how the court can get to the heart of the matter. Justice Elena KaganpressedSauer about his plea for the justices to let litigation over Trump’s order “percolate” in the lower courts; she told him it could take years to reach the justices under his approach, all while “an untold number of people who, according to all the law that this Court has ever made, ought to be citizens who are not being treated as such.”\n\nThe 14th Amendment’s citizenship clausesays: “All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the state wherein they reside.”\n\nTrump’s order cites the “subject to the jurisdiction thereof” language in an attempt to deny automatic citizenship to babies born in these two circumstances:\n\n(1) when that person’s mother was unlawfully present in the United States and the father was not a United States citizen or lawful permanent resident at the time of said person’s birth, or (2) when that person’s mother’s presence in the United States at the time of said person’s birth was lawful but temporary . . . and the father was not a United States citizen or lawful permanent resident at the time of said person’s birth.\n\nBut “subject to the jurisdiction thereof” has long been understood to apply in narrow circumstances not at issue in this case. As a brief to the justices from constitutional and immigration law scholarsexplained, the jurisdictional requirement “exempted a narrow category of persons who, despite being born on U.S. soil, were not required to fully obey U.S. law. These included the children of foreign diplomats and hostile occupying forces, as well as the members of Indian tribes, who were viewed as members of distinct political communities.”\n\nThe scholars cited the 1898 Supreme Court case ofWong Kim Arkfor the proposition that “[a]ll other noncitizens were subject to the jurisdiction of the United States while they were in the country.” That’s one of the cases Sotomayor mentioned at the May hearing, when she told Sauer that Trump’s order violates “not just one but, by my count, four established Supreme Court precedents.”\n\nSubscribe to theDeadline: Legal Newsletterfor expert analysis on the top legal stories of the week, including updates from the Supreme Court and developments in the Trump administration’s legal cases.\n\nJordan Rubin is the Deadline: Legal Blog writer. He was a prosecutor for the New York County District Attorney’s Office in Manhattan and is the author of “Bizarro,\" a book about the secret war on synthetic drugs. Before he joined MSNBC, he was a legal reporter for Bloomberg Law.",
        "source_2": "Reporting by Andrew Chung; Additional reporting by John Kruzel, Trevor Hunnicutt, Jan Wolfe, Nate Raymond and Doina Chiacu; Editing by Will Dunham\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab",
        "source_3": "Fox News' Shannon Bream breaks down the latest details on the ruling. Fox News contributors Jonathan Turley and Andy McCarthy also weigh in on the highly-anticipated decision during 'America's Newsroom.'\n\nThe Supreme Court on Friday delivered a major victory in PresidentDonald Trump'squest to block lower courts from issuing universal injunctions that had upended many of his administration's executive orders and actions.\n\nJustices ruled 6-3 to allow the lower courts to issue injunctions only in limited instances, though the ruling leaves open the question of how the ruling will apply to the birthright citizenship order at the heart of the case.\n\nThe Supreme Court agreed this year to take up a trio of consolidated cases involving so-called universal injunctions handed down by federal district judges in Maryland, Massachusetts and Washington state. Judges in those districts had blocked Trump's ban on birthright citizenship from taking force nationwide – which the Trump administration argued in their appeal to the Supreme Court was overly broad.\n\nThe Supreme Court's arguments in May focused little on the merits of those universal injunctions – and on Friday, the court made clear that it is not ruling on whether the birthright citizenship orders are constitutional.\n\n100 DAYS OF INJUNCTIONS, TRIALS AND 'TEFLON DON': TRUMP SECOND TERM MEETS ITS BIGGEST TESTS IN COURT\n\nPresident Donald Trump speaks to reporters in the Oval Office of the White House, after signing a series of executive orders and proclamations.(Anna Moneymaker/Getty Images)\n\nInstead, it instructed the lower courts to \"move expeditiously to ensure that, with respect to each plaintiff, the injunctions comport with this rule and otherwise comply with principles of equity.\"\n\nThey also stayed any enforcement of the orders from taking effect for 30 days.\n\n\"The applications do not raise – and thus we do not address – the question whether the Executive Order violates the Citizenship Clause or Nationality Act,\" Justice Amy Coney Barrett said, writing for the majority. \"The issue before us is one of remedy: whether, under the Judiciary Act of 1789, federal courts have equitable authority to issue universal injunctions.\"\n\n\"A universal injunction can be justified only as an exercise of equitable authority, yet Congress has granted federal courts no such power,\" she added.\n\nJustices Sonia Sotomayor, Elana Kagan and Ketanji Brown Jackson dissented in the case.\n\nSotomayor, in a scathing dissent, characterized the decision as \"nothing less than an open invitation for the Government to bypass the Constitution.\"\n\n\"The Executive Branch can now enforce policies that flout settled law and violate countless individuals’ constitutional rights, and the federal courts will be hamstrung to stop its actions fully. Until the day that every affected person manages to become party to a lawsuit and secures for himself injunctive relief, the Government may act lawlessly indefinitely. Not even a decision from this Court would necessarily,\" she said.\n\nIn a separate dissent, Jackson wrote that the decision from the majority \"will disproportionately impact the poor, the uneducated, and the unpopular – i.e., those who may not have the wherewithal to lawyer up, and will all too often find themselves beholden to the Executive’s whims.\"\n\nTheSupreme Court agreed in Aprilto hear the consolidated cases, which focused on three lower court judges in Maryland, Massachusetts and Washington state who issued \"universal\" injunctions against Trump's birthright citizenship executive order.\n\nBut that wasn't the main focus of the appeal, or the May 15 oral arguments before the high court.\n\nNINTH CIRCUIT REJECTS TRUMP'S BID TO REINSTATE BIRTHRIGHT CITIZENSHIP ORDER\n\nPresident Trump gestures to the media before boarding Marine One at the White House on April 3, 2025.(Andrew Harnik/Getty Images)\n\nRather, the justices weighed whether lower courts should have the authority to issue nationwide injunctions at all, or whether doing so exceeds their authority, as argued by Trump officials.\n\nThe ruling is expected to have sweeping implications for U.S. district courts, and comes at a time when presidents, including both Democrat and Republican administrations, have sought to use executive orders as a means of sidestepping a clunky, slow-moving Congress.\n\nTrump praised the statement on social media Friday, which he described as a \"GIANT WIN\" in the Supreme Court. He also said he plans to hold a press conference on the decision at 11:30 a.m.\n\n\"Even the Birthright Citizenship Hoax has been, indirectly, hit hard. It had to do with the babies of slaves (same year!), not the SCAMMING of our Immigration process,\" he said on Truth Social. \"Congratulations to Attorney General Pam Bondi, Solicitor General John Sauer, and the entire DOJ.\"\n\nFederal judges across the country haveblocked Trump's banon transgender persons serving in the U.S. military, ordered the reinstatement of core functions of the U.S. Agency for International Development (USAID), and halted Elon Musk's government efficiency organization, DOGE, from oversight and access to government agencies, among other things.\n\nJustices across the ideological spectrum appeared to agree during oral arguments this month that the use of universal injunctions has surged in recent years – but after more than two hours, remained split on how to proceed.\n\nNo easy solution emerged to the thorny legal problem, as the justices wrestled with a tangle of procedural questions over whether to scale back the use of universal injunctions and what legal standard should govern them.\n\nSauer argued that lower court judges have used universal injunctions to act beyond their authority and block the lawful powers of a sitting president.\n\nBut Sotomayor noted that blocking or limiting lower court injunctions could invite hundreds or thousands of new individual lawsuits.\n\n\"Your theory here is arguing that Article III and principles of equity [clause] both prohibit federal courts from issuing universal injunctions to have your argument,\" she said later, adding: \"If that's true, that means even theSupreme Courtdoesn't have that power.\"\n\nKagan, meanwhile, pointed out the practical challenge of expecting the Supreme Court to weigh in on every issue now handled by lower courts, which have already faced hundreds of federal lawsuits during Trump’s second term.\n\nAPPEALS COURT BLOCKS TRUMP ADMIN'S DEPORTATION FLIGHTS IN ALIEN ENEMIES ACT IMMIGRATION SUIT\n\nSupreme Court Justices Sonia Sotomayor, Elena Kagan and Ketanji Brown Jackson(Getty Images)\n\nShe also noted to Sauer that the Trump administration has lost every federal lawsuit challenging the birthright citizenship executive order, including under judges Trump appointed during his first term.\n\nAs expected, several conservative justices on the court, including Justice Clarence Thomas, expressed criticism of universal injunctions.\n\nNew Jersey Solicitor General Jeremy Feigenbaum, representing the states, acknowledged that there could be alternative remedies for federal courts other than nationwide injunctions – though he suggested that in certain cases, the class action alternative presented by the Trump administration may not move fast enough to grant relief in certain cases.\n\n\"We are sympathetic to some of the concerns the United States has about percolation, about running the table in particular cases,\" he said. \"We just don't think that that supports a bright line rule that says they're never available.\"\n\nRoberts and Sotomayor questioned Feigenbaum more in depth on how to determine in what cases universal injunctions should not be the preferred remedy and how to ensure district courts are following that.\n\nLawyers for the Trump administration asked the high court to review the case earlier this year, arguing that the three lower courts, each of which blocked Trump's birthright citizenship order from taking force nationwide, acted beyond the scope of their authority.\n\nSolicitor General Sauer stressed this point during oral arguments earlier this month, telling justices that universal injunctions \"require judges to make rushed, high-stakes, low-information decisions.\"\n\n\"They operate asymmetrically, forcing the government to win everywhere,\" he said, and \"invert,\" in the Trump administration’s view, the ordinary hierarchy of appellate review.\n\nThe Supreme Court decision will have sweeping implications, both in the near and longer term, with knock-down effects onthe more than 300 federal lawsuitsthat have challenged White House actions since Trump's second presidency began on Jan. 20, 2025.\n\nBondi praised the high court's ruling on social media Friday.\n\n\"Today, theSupreme Courtinstructed district courts to STOP the endless barrage of nationwide injunctions against President Trump,\" she said, adding that the ruling \"would not have been possible without tireless work from our excellent lawyers\" at the Justice Department and Sauer.\n\n\"This Department of Justice will continue to zealously defend @POTUS’s policies and his authority to implement them,\" she added.\n\nBreanne Deppisch is a national politics reporter for Fox News Digital covering the Trump administration, with a focus on the Justice Department, FBI, and other national news.\n\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content.\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}