{
    "question": "In what ways could announcing a “signed” U.S.–China trade deal without releasing details influence tariff negotiations, business planning, and the strategic leverage around rare earths?",
    "content": {
        "source_1": "Trucks loaded with containers move through a port in Shanghai, China Monday, June 9, 2025.CHINATOPIX/APhide caption\n\nThe U.S. is terminating all trade talks with Canada as Canada proceeds with a digital services tax that would apply to several major U.S. tech companies, the president said in a Friday social media post.\n\n\"Based on this egregious Tax, we are hereby terminating ALL discussions on Trade with Canada, effective immediately,\" Trump wrote onTruth Social. \"We will let Canada know the Tariff that they will be paying to do business with the United States of America within the next seven day period.\"\n\nThe news that the U.S. is ending trade talks with Canada comes after 24 hours of various tariff updates from the White House, including the announcement of a new agreement with China and an acknowledgement that a July 8 tariff deadline may be pushed back.\n\nThe flurry of news is the latest in several chaotic months of back-and-forth tariff announcements followed by subsequent adjustments. Imposing higher tariffs on goods from other countries was a major campaign promise of Trump's, which he framed as an effort to bring manufacturing back to the U.S. and raise revenue. However, those goals conflict with each other, and tariffs also often burden consumers with higher prices.\n\nThe president's Canada post refers to a digital services tax set to go into effect on June 30. That measure would tax multinational tech companies for revenue collected — for example from advertising — from providing services to Canadian users. Several European countries have imposed similar taxes.\n\nEarlier this month, Canada's Finance Minister François-Philippe Champagnesaid the country would move forwardwith the tax, despite U.S. opposition. The prime minister's office did not immediately respond to a request for comment on Trump's announcement Friday.\n\nAt the G7 summit in Canada last week, Trump and Canadian Prime Minister Mark Carney had said they wanted to negotiate a tariff deal in the next 30 days. That came after months of tension between the two countries, kicked off when Trump on his first day in office announced that he wanted to put 25% tariffs on Canadian goods. Months of retaliations and animosity followed, including Trump repeatedly suggesting that Canada become the 51st state.\n\nThe post about Canada came hours after Trump told reporters that a self-imposed July 9 deadline for establishing tariff levels for most countries might be delayed.\n\n\"We can do whatever we want. We can extend it, we can make it shorter. I'd like to make it shorter,\" he said of the deadline. \"I'd like to just send letters out to everybody – 'Congratulations. You're paying 25 percent.' \"\n\nThat deadline applies to tariffs on goods from nearly every country, which Trump announced on April 2, with some of those tariffs exceeding 40%. Days later, he announced a 90-day \"pause,\" bringing the tariffs down to 10%.\n\nThat \"pause\" is set to end on July 9, raising questions about what happens after that. Trump said he would reach longer-term individual tariff deals with countries during the 90-day period, but the only deal announced so far has been with the UK, signed last week at the G7 summit.\n\nOn Thursday, Trump also announced a trade agreement with China, which officials later said was an agreement on a framework for a deal and not a finalized agreement on tariffs and other trade issues like rare earth minerals.\n\nCommerce Secretary Howard Lutnick confirmed Thursday evening on Bloomberg TV that China would \"deliver rare earths to us.\" He added that subsequently, \"we'll take down our countermeasures.\"\n\nIn a statement, China's Ministry of Commerce also acknowledged that \"further details of the framework\" have been established.\n\n\"China will, in accordance with the law, review and approve eligible export applications for controlled items,\" they wrote. \"In turn, the United States will lift a series of restrictive measures it had imposed on China.\"\n\nThe base tariffs on Chinese goods have the potential to be globally destabilizing, and at one point reached 145%.\n\nAt a meeting in Geneva last month, U.S. and Chinese officials announced they had reached a temporary deal that would bring U.S. tariffs on Chinese goods to 30%, with an Aug. 12 deadline to reach a more permanent agreement.\n\nThe high tariffs China and the U.S. imposed on each other's goods rattled markets as American consumers faced higher prices on a wide array of products, like car seats and clothing, while American farmers feared Chinese consumers would buy fewer of their now more expensive food exports.",
        "source_2": "Amanda M. Castro is a Newsweek Live Blog Editor based in New York. Her focus is reporting on U.S. politics, breaking news, consumer topics, and entertainment. She specializes in delivering in-depth news and live blog reporting and has experience covering U.S. presidential debates, awards shows, and more. Amanda joined Newsweek in 2024 from the The U.S. Sun and is a graduate of the University of New Haven.\n\nYou can get in touch with Amanda by emailing a.castro@newsweek.com.\n\nHannah Parry is a Newsweek Live Blog Editor based in New York. Her focus is reporting on U.S. politics and society. She has covered politics, tech and crime extensively.Hannah joined Newsweek in 2024 and previously worked as an assistant editor at The U.S. Sun and as a senior reporter and assistant news editor at The Daily Mail. She is a graduate of the University of Nottingham. You can get in touch with Hannah by emailing h.parry@newsweek.com. Languages: English.\n\nContinuous updates; facts and sources are still being cross-checked.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nPresident Donald Trump announced on Thursday, that he has signed a trade deal with China.\n\n\"We just signed with China yesterday,\" he said at a White House event focused on the Republican spending bill. Trump did not provide further details about the deal, but he said it was going to \"open up China.\"\n\nThe president also teased a new big deal with India.\n\n\"We have one coming up maybe with India. A very big one where we're going to open up India,\" he added.\n\nMayor Eric Adams has repeatedly attacked mayoral candidate Zohan Mamdani and his affordability platform, claiming New York is a \"city of hands up, not handouts\" and painting the race as \"a choice between dirty fingernails and manicured nails.\"\n\nHowever, on Thursday, Mamdani said that Adams' attacks were him simply trying to \"distract from his own record.\"\n\n\"His is a record where he raised rents... is raising the water bill to the highest its been in 13 years, of supporting Con Edison when they wanted to increase New Yorkers' gas and electric bill by $65 a month,\" Mamdani said on CNN.\n\n\"I would much rather talk about me talk about his record, if I was him,\" he added.\n\nZohran Mamdani was asked on CNN Thursday if he was a fan of capitalism.\n\n\"No,\" he told Erin Burnett, \"I have many critiques of capitalism.\n\n\"And I think ultimately, the definition for me of why I call myself a democratic socialist, is the words of Dr. King, 'Call it democracy, call it democratic socialism, there must be a better distribution of wealth for all of god's children in this country.'\n\n\"And that's what I'm focused on taking on income inequality,\" he continued. \"For too long politicians have pretended that we're spectators to that crisis of affordability. We're actually actors.\n\n\"We have the choice to exacerbate it as Mayor Adams has done or respond to it.\"\n\nZohran Mamdani has said he is not worried about reports that Andrew Cuomo has decided to stay on the ballot for the New York City mayoral race, despite the former governor conceding in the Democratic primary.\n\n\"Ultimately, Andrew's decision or my decision matters less than the decision the voters made on Tuesday night,\" Mamdani said during an appearance on CNN on Thursday. \"Where we won from Bay Ridge, to Dyker Heights, to Harlem...\"\n\nWhen asked by CNN's Erin Burnett if he was \"worried\" about a potential redo, Mamdani responded, \"No, not at all, I mean we did it once, and it turned out pretty well.\"\n\nThe United States hassigned new agreementswith Honduras and Guatemala that could allow migrants from other nations to seek refuge there instead of applying for asylum in the U.S., Homeland Security SecretaryKristi Noemannounced at the end of her trip to Central America.\n\nThe deals broadenthe Trump administration's strategy of deporting migrants not just to their home countries but to third countries willing to offer them protection.Noem said the arrangements had been in development for months, with the U.S. pressuring both governments to finalize the terms.\n\n\"Honduras and now Guatemala after today will be countries that will take those individuals and give them refugee status as well,\" Noem said. \"We've never believed that the United States should be the only option... The guarantee for a refugee is that they go somewhere to be safe and protected—it doesn't necessarily have to be the United States.\"\n\nPresident Donald Trump has threatened to sue The New York Times and CNN over their coverage of an intelligence report that contradicted his claims that Iran's nuclear sites had been \"obliterated\" in the U.S. air strikes.\n\nIn a letter to The Times, a lawyer for the president demanded a retraction and apology for the article, which they claimed was \"defamatory\" and \"unpatriotic\" and had damaged Trump's reputation.\n\nIn the paper's response, their lawyer David McCraw said that no such response would be coming as he said that several Trump administration officials had subsequently confirmed the existence of the intelligence report.\n\n\"No retraction is needed. No apology will be forthcoming,\" he said. \"We told the truth to the best of our ability. We will continue to do so.\"\n\nSpanish Prime Minister Pedro Sánchez is standing by his decision not to increase defense spending, despite President Donald Trump's threats to impose higher tariffs on any country that didn't meet his 5 percent minimum.\n\nAt Wednesday's summit, Sánchez secured a last-minute exemption from the 5 percent rate, saying that Spain would only spend 2.1 percent, which he called \"sufficient and realistic.\"\n\nSanchez told reporters on Thursday that the European Commission, and not Spain as an individual country, sets its trade policy, but insisted Spain remains a \"friend\" of the U.S.\n\nThe United States deal with China that President Donald Trump signed on Wednesday, followed the framework that the countries had agreed upon in London, according to multiple media reports.\n\nThe deal also includes an agreement on how China \"can expedite rare earths shipments to the U.S. again,\" a USA Today reporter wrote.\n\nPresident Trump said the U.S. and China \"signed\" a deal this week. An official said he was referring to an additional understanding around the framework the two countries previously agreed on. Specifically, how  they can expedite rare earths shipments to the U.S. again.\n\nCanadian citizen has died while in U.S. Immigration and Customs Enforcement (ICE) custody in Miami, the agency announced Thursday.\n\nJohnny Noviello, 49, was found unresponsive at the Bureau of Prisons Federal Detention Center on June 23 and pronounced dead at the scene.\n\nNoviello first entered the United States on January 2, 1988, with a legal visa, ICE said. He became a lawful permanent resident, or a green card holder, in October 1991.\n\nIn October 2023, the Canadian was convicted of racketeering, trafficking in oxycodone 7-14 grams, trafficking in illegal drugs 4 to 14 grams, trafficking in hydrocodone, and unlawful use of a two-way communication device to facilitate the commission of a crime in Volusia County on the eastern Florida coast. He was handed a 12-month prison sentence.\n\nAround a hundred members of the Florida National Guard are being deployed to help secure \"Alligator Alcatraz.\"\n\nThe immigration detention center, located in the Everglades, is set to open July 1.\n\nBrittianie Funderburk, a spokesperson for the Florida National Guard, told the Miami Herald that he did not have a timeline for how long the troops would be stationed at the detention center.\n\nHowever, Florida Highway Patrol troopers, who have also been called in to man the gates at the facility, were told they'd be needed for at least 30 days.\n\nThe National Guardsmen will help secure the facility perimeter and entry points.\n\nThe center is being build to house hundreds of detained immigrants in heavy-duty tents and trailers.\n\nPresident Donald Trump has vowed to deport a minimum of one million people every year going forward.\n\nTrump said he plans to \"dramatically increase\" deportations, during his speech at a White House event on his spending bill, Thursday.\n\n\"We will dramatically increase deportations to a minimum of 1 million illegal aliens per year,\" he said. \"What we're doing is really going after the criminal aliens, with which we have plenty to work with.\n\n\"People say 'Well that's a lot.' These countries are very smart.... They're not sending the good people, they're sending the bad people.\"\n\nTrump: We will dramatically increase deportations to a minimum of 1 million illegal aliens per year. What we're doing is really going after the criminal aliens, with which we have plenty to work with. People say \"It's a lot.\" These countries are very smart. They’re not sending…pic.twitter.com/Q2bp3crrNu\n\nThe Department of Justice is planning to try Kilmar Abrego Garcia on federal smuggling charges, spokesperson Chad Gilmartin told The Associated Press.\n\nAbrego Garcia wasamong the 230 migrantswho were deported to El Salvador's notorious supervision Terrorism Confinement Center, known as CECOT, in March this year.\n\nThe Trump administration later called his deportation an \"administrative error.\"\n\nHe was returned to the United States after huge public outcry about his detention, but now faces federal crimes.\n\n\"This defendant has been charged with horrific crimes, including trafficking children, and will not walk free in our country again,\" Gilmartin said.\n\nThe Rrump administration plans to deport Abrego Garcia to a country that is not his native El Salvador after he's released from jail in Tennessee, Justice Department attorney Jonathan Guynn said.\n\nRepublican Rep. Andy Ogles has called for New York City mayoral candidate Zohran Mamdani to be deported.\n\n\"Zohran \"little muhammad\" Mamdani is an antisemitic, socialist, communist who will destroy the great City of New York,\" Ogles said in a post on X.\n\n\"He needs to be DEPORTED. Which is why I am calling for him to be subject to denaturalization proceedings. Attached is my letter to@AGPamBondi.\"\n\nZohran \"little muhammad\" Mamdani is an antisemitic, socialist, communist who will destroy the great City of New York. He needs to be DEPORTED. Which is why I am calling for him to be subject to denaturalization proceedings.Attached is my letter to@AGPamBondi.pic.twitter.com/RWCZm67VOr\n\nPresidentDonald Trump's approval rating on immigration has dipped to its lowest mark amid his second term in the White House, a new poll from Quinnipiac University finds.\n\nIn the new poll released on Thursday,the president has a 41 percent approval rating on immigration, with a 57 percent disapproval mark.\n\nThe survey shows that 56 percent of voters also disapprove of the tactics employed by Immigration and Customs Enforcement (ICE), compared to 39 percent who approve.\n\nThe poll was conducted from June 22 to June 24 among 979 \"self-identified registered voters\" across the country. The poll's margin of error is 3.1 percent.\n\nTrump's border czarTom Homan appeared frustrated as he took to the podium at the White House event on the spending bill, telling the crowd he couldn't understand the delay.\n\n\"I get irritated. I get p*ssed off, because I'm sick of meeting angel moms and dads,\" Homan said, referring to the parents of children killed by illegal migrants.\n\n\"You want to talk about family separation. They bury their children.\"\n\nHoman said the bill was a\"no-brainer\" for national security and public safety because it had funding for more agents, beds and deportation flights to deport migrants. Without it, he said making the country safer will be a \"hard road.\"\n\nPresident Trump joked during a White House event Thursday that border czar Tom Homan \"got so angry\" during his speech about immigration, that \"he didn't even shake my hand or look at me.\"\n\nHoman, who had been speaking about United States Immigration and Customs Enforcement raids and mass deportations, then sheepishly returned to the podium to shake a grinning Trump's hand.\n\nPresident Trump said that his no taxes on tips campaign was inspired by his conversation with a Las Vegas waitress.\n\nTrump said she came over when he was at a dinner at his hotel in the city. He asked how she was doing, and she told him the government was \"killing me on tips.\"\n\n\"She said, 'sir, there should be no tax on tips,'\" Trump said.\n\nTrump said he said, \"that's the coolest thing I've ever heard.\"\n\nHe said he later walked outside to hundreds of waiting journalists and said, \"Ladies and gentlemen, please announce tonight, there will be no tax on tips. And a legend was made.\"\n\nPresident Trump has announced he signed a trade deal with China on Wednesday.\n\n\"Everybody wants to make a deal,\" he said. \"We just signed with China yesterday.\n\n\"We're not going to make deals with everybody. Some we're just going to send them a letter and say thank you very much.\"\n\nPresident Trump referred to his favorite fictional serial killer, Hannibal Lecter, during his White House event to discuss his spending bill.\n\nTrump has a habit of bringing up the notorious cannibal during his speeches, as he claims that migrants crossing the border into the U.S. are coming from foreign \"insane asylums.\"\n\nPresident Trump is holding a White House press briefing on his spending bill.\n\nHe was joined by several key Cabinet members and Republican lawmakers in a final push to pass the bill, ahead of the July 4 deadline.\n\nPresident Donald Trump has claimed that the Democrats were behind the intelligence report leak on the Iran strikes - as he called for them to be prosecuted.\n\n\"The Democrats are the ones who leaked the information on the PERFECT FLIGHT to the Nuclear Sites in Iran. They should be prosecuted!\" he posted on Truth Social.\n\nHouse Speaker Mike Johnson and a group of Republican lawmakers are heading to the White House on Thursday as Trump hosts a high-profile event to press Congress to pass his sweeping tax cuts and spending bill.\n\nThe gathering comes as GOP leaders scramble to secure enough votes amid internal divisions over the bill's deep Medicaid cuts, rising deficit projections, and controversial provisions.\n\nSen Lindsey Graham has warned that the \"problem\" in Iran is not over.\n\nThe Republican senator told reporters that he was not disagreeing with President Donald Trump's assessment than Iran's nuclear sites had been destroyed, but he said that didn't mean that Iran wouldn't keep trying to build a nuclear weapon.\n\n\"I don't want people to think that the site wasn't severely damaged or obliterated, it was,\" he said in the Capitol, Thursday.\n\n\"But, having said that, I don't want people to think the problem is over, because it's not. They're going to keep trying this...\"\n\nSen.@LindseyGrahamSC: \"I don't want people to think that the site wasn't severely damaged or obliterated, it was. But, having said that, I don't want people to think the problem is over, because it's not. They're going to keep trying this...\"pic.twitter.com/jdDXee3XXf\n\nIsraeli Defense Minister Israel Katz said Thursday that the United States and Israel have jointly demanded that Iran hand over its enriched uranium stockpiles, following recent airstrikes on Iranian nuclear facilities.\n\nIn an interview with Channel 13, Katz acknowledged that the strikes were designed to cripple infrastructure, not destroy the nuclear material itself. \"It was clear from the beginning that the strike would neutralize the surrounding infrastructure,\" he said.\n\nKatz claimed that Iran now lacks the ability to produce a nuclear weapon, citing the destruction of a conversion facility essential for processing uranium.\n\nThe remarks come amid ongoing debate over whether Iran moved key materials before the strikes. While U.S. and Israeli officials insist the program has been severely damaged, some intelligence reports suggest enriched uranium may remain unaccounted for.\n\nHouse Republicans escalated their investigation into former President Joe Biden's mental fitness by issuing a subpoena Thursday to Anthony Bernal, a longtime aide to former First Lady Jill Biden.\n\nThe subpoena, signed by Oversight Committee Chair James Comer, compels Bernal to testify on July 16 after weeks of failed negotiations over a voluntary interview. Comer cited Bernal's close ties to the Bidens and questioned whether he played a role in concealing the president's cognitive state.\n\nBernal is the second former Biden staffer subpoenaed in the probe, which also includes former White House physician Kevin O'Connor, who is scheduled to testify on July 9. The investigation, backed by President Donald Trump, has expanded to include eight former Biden officials following Trump's decision to waive executive privilege for their testimony.\n\nDemocrats have dismissed the inquiry as politically motivated. Rep. Wesley Bell called it a \"waste of time\" that yielded \"no new evidence\" after the committee interviewed Neera Tanden, another former Biden adviser.\n\nRepublicans argue that Biden's use of the autopen to sign official documents raises constitutional concerns if he was not fully aware of his actions. Trump and his allies have claimed, without evidence, that Biden's aides concealed his condition and made decisions on his behalf.\n\nWhite House press secretary Karoline Leavitt was asked on Thursday if PresidentDonald Trumpwould sign the \"big, beautiful bill\" currently working its way throughCongress,if the final version includes cuts to Medicaid.\n\nRepublicans in Congress have drawn sharp scrutiny over the Trump-backed One Big Beautiful Bill Act, which aims to deliver on the president's biggest priorities.\n\nHowever, it has sparked widespread blowback overRepublicans' proposed cuts to key programs, such as Medicaid, which would be used to pay for tax cuts that disproportionately benefit wealthy Americans, as well as additional funding for border security and immigration enforcement.\n\nA reporter asked Leavitt about the possible Medicaid cuts on Thursday, saying: \"There's conversations on the Hill right now about the Medicaid cuts. I'm curious, if the final bill that the president's been talking about comes to him and it has Medicaid cuts in it, will he sign it would he rather Congress just do away with those cuts?\"\n\nLeavitt did not directly answer the question, saying instead, \"I think our friends in both theSenateand the House know exactly where the president stands on Medicaid.\"\n\n\"He wants to get rid of the waste, fraud and abuse and they are working to do that in the Senate right now,\" the press secretary added.\n\nSecretary of State Marco Rubio announced a new visa restriction policy Thursday aimed at curbing the flow of fentanyl and other illicit drugs into the United States.\n\nRubio said the move is part of a broader strategy to deter and dismantle trafficking networks, citing fentanyl as the leading cause of death for Americans aged 18 to 44.\n\n\"These restrictions will prevent traffickers and their enablers from entering the U.S. and send a clear message that we will use every tool available to protect our communities,\" he said.\n\nI am announcing a new visa restriction policy for family members and close personal and business associates of individuals sanctioned under Executive Order 14059. We will use all necessary tools to deter and dismantle the flow of fentanyl and other deadly drugs from entering our...\n\nThe White House declined Thursday to detail how it will restrict classified information shared with Congress, following the leak of an early intelligence assessment on U.S. strikes against Iran's nuclear facilities.\n\nPress secretary Karoline Leavitt said the administration is focused on ensuring that top-secret material doesn't fall into \"irresponsible hands,\" citing the leak of a Defense Intelligence Agency report that suggested the strikes only set Iran's nuclear program back by months.\n\nLeavitt emphasized that only a few officials had access to the report and called the leak \"irresponsible.\"\n\nA senior official confirmed the administration plans to limit postings on CAPNET, the classified system used to share intelligence with lawmakers.\n\nThe move has drawn criticism from Democrats, who argue it undermines congressional oversight and transparency. The FBI is investigating the source of the leak.\n\nEuropean Union leaders have vowed to intensify diplomatic efforts to de-escalate tensions surrounding Iran's nuclear program, emphasizing that a lasting solution can only come through negotiations.\n\nIn a joint statement, the EU welcomed the recently brokered ceasefire between Iran and Israel, calling it a critical step toward regional stability. The bloc urged all parties to exercise restraint and avoid actions that could reignite conflict.\n\n\"The EU will continue to contribute to all diplomatic efforts to reduce tensions,\" the statement read, reaffirming the long-standing position that Iran must never be allowed to acquire a nuclear weapon.\n\nMexican President Claudia Sheinbaum sharply criticized Thursday's U.S. Treasury Department's sanctions on three Mexican financial institutions, accusing Washington of failing to provide evidence for its money laundering allegations.\n\nThe sanctions target CIBanco, Intercam Banco, and Vector Casa de Bolsa, which U.S. officials claim facilitated millions in transfers for drug cartels and Chinese firms linked to fentanyl production.\n\nSheinbaum said the Trump administration had not presented \"a single piece of evidence\" and insisted that Mexican regulators found only minor administrative infractions during their own review.\n\nThe accused institutions also denied wrongdoing. Vector called the claims baseless, while CIBanco said it was blindsided by the announcement and welcomed a formal investigation.\n\nSheinbaum defended the banks' ties to Chinese clients as part of a legitimate trade relationship and warned the U.S. against treating Mexico as a subordinate. \"We're no one's piñata,\" she said.\n\nThe dispute adds new strain to U.S.-Mexico relations amid broader tensions over drug trafficking, trade, and sovereignty.\n\nWhite House Press Secretary Karoline Leavitt said during her Thursday briefing that she believes there is an concerted effort to try and undermine President Donald Trump, and divide his security team through the series of recent leaks.\n\nLeavitt said that she believes the leaked intelligence report on the American strikes on Iranian nuclear facilities, which suggested that the attack had only delayed the nuclear program by a matter of months, was \"done to undermine the president.\"\n\nThe press secretary was also asked about other leaks including about Vice President JD Vance and Director of National Intelligence Tulsi Gabbard.\n\n\"I do believe there's an effort on the outside this building to try and divide the president's team on the inside,\" Leavitt said. \"Sometimes you have to look at these headlines and laugh because I've been in meetings where I know these things are absolutely not true. And we do out best to try and push back and correct the record with all of you.\n\n\"But I can assure you the president's team is strong especially the national security team.\"\n\nIsraeli Defense Minister Israel Katz said there was no opportunity to assassinate Iranian Supreme Leader Ayatollah Ali Khamenei during the recent 12-day conflict between the two nations.\n\n\"If [Khamenei] had been in our sights, we would have taken him out,\" Katz told Channel 13, underscoring the seriousness of Israel's intent during Operation Rising Lion. This sweeping military campaign targeted Iran's nuclear and military infrastructure.\n\nWhile Israel successfully eliminated several top Iranian commanders during the operation, including Ali Shadmani, a close aide to Khamenei2, the supreme leader himself was reportedly moved to a secure underground location in Tehran shortly after the strikes began.\n\nKatz's remarks reflect Israel's increasingly aggressive posture toward Iran's leadership, with officials previously stating that Khamenei's elimination is now considered a strategic objective\n\nWhite House Press Secretary Karoline Leavitt launched into a lengthy attack on CNN reporter Natasha Bertrand during her Thursday press briefing.\n\nLeavitt's criticisms come after Donald Trump said the journalist should be \"thrown out like a dog\" over her coverage of an intelligence report that stated that the U.S. strikes on Iranian nuclear targets had not \"obliterated\" as the president had claimed.\n\nLeavitt told he gathered media Thursday, that the report had been a \"low confidence preliminary intelligence assessment and the entirety of that assessment was not leaked to the media. Only tidbits of that assessment were leaked to CNN.\n\n\"And we have seen this playbook run before, where you have people in the intelligence community or perhaps on Capitol Hill - we don't know, but I believe the FBI are investigating to find that leaker because it's illegal and they should be held held accountable for that - leaked bits and pieces of an intel assessment to push a false narrative.\n\n\"I will add Natasha Bertrand of CNN who has done this in the past... This is a reporter who has been unfortunately used by people who dislike Donald Trump in this government to push fake and false narratives. She should be ashamed of herself.\"\n\nPresident Donald Trump is still adamant he wants the big, beautiful bill on his desk to sign by July 4, despite the setbacks in Congress, White House Press Secretary Karoline Leavitt said Thursday.\n\nLeavitt was asked if there was \"still enough time to work through\" the bill before next week's deadline, as the Senate struggles to find middle ground over Medicaid cuts.\n\n\"We expect that bill to the on the president's desk for signature by July 4,\" Leavitt said, adding that \"The president is adamant about seeing the bill on his desk here at the White House by Independence Day.\"\n\nWhen asked if Trump was prepared to sign the bill with Medicaid cuts, something that the president has previously said he would not do, Leavitt appeared to skirt the question, replying that he wanted to \"get rid of waste, fraud and abuse.\"\n\nWhite House Press Secretary Karoline Leavitt said that there was \"no indication\" that any enriched uranium had been removed from Iran's nuclear facilities before the U.S. strikes last weekend.\n\nLeavitt told the briefing that, as part of \"one of the most secretive and successful\" operations in U.S. history, the military had been closely observing the locations for weekends and there had been \"no indication that any of uranium has been moved.\"\n\nWhite House Press Secretary Karoline Leavitt claimed that former presidents Barack Obama and Joe Biden sent Iran \"pallets of cash\" to end its nuclear program, while she said President Donald Trump had sent \"a fleet of American war planes.\"\n\nLeavitt added that the strikes had \"destroyed\" Iran's capabilities to create a nuclear weapon.\n\nBenjamin Netanyahu said Thursday that he was \"deeply moved\" byDonald Trump's support after the president demanded that Israel drop its ongoing legal case against its prime minister.\n\n\"I was deeply moved by your heartfelt support for me and your incredible support for Israel and the Jewish people,\" Netanyahu said in a post on X, formerlyTwitter, on Thursday. \"I look forward to continue working with you to defeat our common enemies, liberate our hostages and quickly expand the circle of peace.\"\n\nOn Wednesday evening, Trump said on Truth Social he was \"shocked\" to hear that Israel was continuing its trial of Netanyahu, which he branded \"politically motivated\" and a \"Witch Hunt against their Great War Time Prime\n\nThe Israeli leader faces charges of fraud, breach of trust, and accepting bribes in three separate cases. Netanyahu, who has denied all allegations, is due to return to court on Monday.\n\nTrump's demand that Israel cancel Prime Minister Benjamin Netanyahu's corruption trial has stirred political tensions in Jerusalem, just days after Israeli leaders praised Trump's military strikes on Iran.\n\nIn a Truth Social post, Trump called the trial a \"ridiculous Witch Hunt\" and urged Israel to either cancel the proceedings or issue a pardon, declaring that the U.S. would \"save\" Netanyahu as it had \"saved\" Israel.\n\nThe comments drew swift criticism from Israeli opposition leader Yair Lapid, who said Trump had no place interfering in the legal affairs of a sovereign nation. Still, some of Netanyahu's allies welcomed the support, with Foreign Minister Gideon Saar suggesting Trump's view was valid.\n\nNetanyahu, who faces charges of fraud, breach of trust, and bribery, responded by thanking Trump for his \"heartfelt support.\" His trial, which began in 2020, has been repeatedly delayed amid ongoing conflict with Hamas and political unrest.\n\nWhile Trump remains popular among many Israelis for his past support of Israel, including the Abraham Accords and recent strikes on Iran, his intervention in Netanyahu's legal troubles has unsettled even some of his staunchest admirers.\n\nThe House Oversight Committee has issued a subpoena to Anthony Bernal, a former senior advisor to First Lady Jill Biden, as part of its investigation into President Joe Biden's mental acuity and the use of the autopen. This device allows staff to sign documents on the president's behalf.\n\nBernal had been scheduled to testify Thursday morning but informed the committee a day earlier that he would not appear. The move prompted Chairman James Comer to compel his testimony, citing the White House's decision to waive executive privilege.\n\nRepublicans allege that Bernal played a role in concealing Biden's cognitive decline and question who authorized the use of the autopen for major executive actions.\n\nDemocrats have dismissed the probe as a partisan effort aimed at deflecting attention from Trump-era controversies, calling the investigation politically motivated and lacking substance.\n\nThe committee has also interviewed other former Biden aides, including Neera Tanden, who testified that she had minimal direct contact with the president despite overseeing autopen operations.\n\nRep. Jim Himes, the top Democrat on the House Intelligence Committee, pushed back Thursday on claims that U.S. airstrikes \"obliterated\" Iran's nuclear program, arguing that the real concern is whether Tehran still possesses the materials needed to build a bomb.\n\nIn a social media post, Himes said the public debate over physical destruction misses the point. \"The only question that matters is whether the Iranian regime has the stuff necessary to build a bomb, and if so, how fast,\" he wrote.\n\nHe warned that if uranium, centrifuges, or other key equipment were moved before the strikes, the program may have suffered only a minor setback. \"Obliteration means nothing\" if the core components were relocated, he added.\n\n\"If the answer to these questions is yes,\" Himes said, \"the Iranians will be thrilled to abide by Trump's 'ceasefire.' The Israelis probably less so.\"\n\nHis comments reflect growing skepticism among lawmakers about the long-term impact of the strikes and the intelligence used to justify them.\n\nA central piece of Trump's tax and spending package suffered a major setback Thursday after the Senate parliamentarian ruled that a proposed overhaul of the Medicaid provider tax violates chamber rules. The decision threatens Republican efforts to finalize the bill before Trump's Fourth of July deadline.\n\nThe rejected provision was expected to generate billions in savings to help offset trillions in tax cuts. Still, it now faces removal or a 60-vote hurdle, unlikely in a narrowly divided Senate.\n\nRepublican leaders, already struggling to unify their caucus, were counting on deep Medicaid cuts to fund the bill. The Congressional Budget Office estimated that over 10.9 million Americans could lose coverage under the House version.\n\nDemocrats hailed the ruling, warning the proposed cuts would devastate care for children, seniors, and people with disabilities. Some Republicans, including Sen. Josh Hawley, voiced concern over the impact on rural hospitals, which rely heavily on provider tax revenue.\n\nThe parliamentarian also struck down GOP provisions targeting immigrant access to health care, food stamps, and the Consumer Financial Protection Bureau, further complicating the bill's path forward.\n\nSenators are set to receive a classified briefing Thursday from top national security officials on the recent U.S. airstrikes targeting Iranian nuclear sites, as bipartisan concerns mount over the legality and effectiveness of the operation.\n\nThe session—delayed from its original Tuesday schedule—comes ahead of a Senate vote on a resolution that would require congressional approval for any future military action against Iran.\n\nCIA Director John Ratcliffe, Secretary of State Marco Rubio, and Defense Secretary Pete Hegseth are expected to lead the briefing. Lawmakers are seeking clarity on the intelligence used to justify the strikes, especially after early assessments suggested Iran's nuclear program may have only been temporarily disrupted.\n\nSeveral Democrats and some Republicans have criticized the White House for bypassing Congress, arguing that the administration overstepped its authority by not consulting lawmakers before launching the attacks.\n\nPresident Donald Trump is embracing the viral \"Daddy\" nickname with a new line of $35 orange T-shirts featuring his image and the word emblazoned across the front. The merchandise is part of a broader fundraising push benefiting Trump's and Vice President JD Vance's leadership PACs and the Republican National Committee.\n\nThe nickname took off after NATO Secretary General Mark Rutte quipped during a press conference that \"daddy has to sometimes use strong language,\" referring to Trump's blunt remarks about the Israel-Iran conflict.\n\nThe White House quickly leaned into the moment, posting a highlight reel from the NATO summit set to Usher's \"Hey Daddy (Daddy's Home)\" on social media.\n\nThe shirts mark the latest example of Trump's team turning viral moments into campaign branding—and cash.\n\n🎶 Daddy's home... Hey, hey, hey, Daddy.President Donald J. Trump attended the NATO Summit in The Hague, Netherlands.pic.twitter.com/asJb5FD2Ii\n\nOn Thursday, the Commerce Department's Census Bureau reported that the international trade in goods increased by about 11 percent in May as exports decreased while imports remained relatively unchanged.\n\nNewsweek reached out to the White House by email on Thursday morning for comment.\n\nThe bureau reported a gap of around $96.6 billion, up 11.1 percent compared to the $87 billion reported in April. May exports dropped to $179.2 billion, dropping about five percent (or $9.7 billion) from April, while imports were about $0.1 billion less at around $275.8 billion.\n\nThis was accompanied by offsetting changes in wholesale and retail inventories, which saw the former decrease by .3 percent while the latter increased at the same rate. In real dollars, that translates to end-of-month Advanced Wholesale Inventories of $905.4 billion and Advanced Retail inventories of around $806.6 billion. Both were up compared to the same month one year earlier.\n\nOne theory is that imports increased as businesses tried to buy more goods before the tariffs took effect.\n\nThe Supreme Court ruled 6–3 on Thursday that states have the authority to exclude Planned Parenthood from Medicaid programs. This decision could reshape access to reproductive health care for low-income Americans.\n\nThe case stemmed from South Carolina's effort to block Medicaid funds from going to Planned Parenthood for non-abortion services like cancer screenings, contraception, and pregnancy testing. The court's conservative majority held that Medicaid patients cannot sue to enforce their right to choose a qualified provider, effectively allowing states to cut funding without legal challenge.\n\nThe ruling aligns with a broader Republican-led push to defund the nation's largest abortion provider. Although Medicaid funds cannot be used for abortions, critics argue that any public funding indirectly supports abortion services.\n\nPlanned Parenthood warned the decision could lead to the closure of up to 200 clinics, particularly in states where abortion remains legal and demand for services is high.\n\nThe ruling is expected to embolden other GOP-led states to pursue similar restrictions.\n\nAccording to officials familiar with the planning, Israeli Prime Minister Benjamin Netanyahu is expected to travel to Washington in the second week of July for a brief but high-stakes meeting with Trump.\n\n🚨 מסתמן: ראש הממשלה נתניהו ימריא לביקור בזק בוושינגטון לפגישה עם הנשיא טראמפ כבר בשבוע השני של חודש יולי.  השר דרמר מוביל את המגעים מאחורי הקלעים.@i24NEWS_HE\n\nTrump is once again at odds with the U.S. intelligence community, this time over the impact of recent airstrikes on Iran's nuclear program.\n\nAn early intelligence assessment concluded the strikes set Iran back by only a few months, contradicting Trump's claim that the program was \"completely and fully obliterated.\" The president has dismissed the report and accused the media of amplifying what he calls a \"preliminary\" and misleading analysis.\n\nDefense Secretary Pete Hegseth echoed Trump's stance at a Pentagon briefing, criticizing the press for \"breathlessly\" reporting on the leaked assessment.\n\nThe White House is now limiting access to classified details as it prepares to brief lawmakers, signaling that the dispute over the operation's effectiveness is far from over.\n\nTrump expressed strong approval of Thursday's Pentagon news conference on the recent U.S. strikes against Iranian nuclear sites, calling it \"one of the greatest, most professional, and most 'confirming'\" briefings he had ever seen.\n\nIn a post on Truth Social, Trump renewed his criticism of media outlets that reported on early intelligence assessments suggesting limited damage from the strikes. He urged those organizations to \"fire everyone involved in this Witch Hunt\" and apologize to U.S. military personnel.\n\nTrump also reiterated his belief that Iran did not remove any nuclear material before the attacks, writing that doing so would have been \"too long, too dangerous, and very heavy and hard to move.\"\n\nThe comments follow a coordinated push by the administration to counter skepticism about the operation's effectiveness and defend the military's execution of the mission.\n\nTrump insisted Thursday that Iran did not remove any enriched uranium from its nuclear facilities before last weekend's U.S. airstrikes, pushing back on speculation that Tehran may have relocated key materials ahead of the attack.\n\nGen. Dan Caine, chairman of the Joint Chiefs of Staff, said Thursday he has never been pressured by President Donald Trump or Defense Secretary Pete Hegseth to alter intelligence assessments related to the recent U.S. strikes on Iran's nuclear facilities.\n\n\"No, no, I have not. And no, I would not,\" Caine said when asked directly about political influence on his reporting.\n\nHe emphasized that his role is to present a full range of military options and associated risks to the National Command Authority, and to execute orders based on those discussions.\n\n\"I've never been pressured by the president or the secretary to do anything other than tell him exactly what I'm thinking,\" Caine added.\n\nA senior Chinese defense official on Thursday accused the U.S. of betraying Beijing's trust by continuing to sell arms to self-ruled Taiwan.\n\nThe remarks at the Chinese Defense Ministry's month-end press conference were a direct response to recent testimony given by U.S. Defense SecretaryPete Hegseth, who had described China as America's \"pacing threat.\"\n\nChinaclaims democratically governed Taiwan as its own, although the Chinese Communist Party has never ruled there. Taipei is a key U.S. security partner in the center of the so-called first island chain in the Western Pacific.\n\nThe U.S. is Taiwan's biggest arms supplier, allowing the island push back against Beijing's sovereignty claims for decades. However, Taipei may soon find itself overwhelmed by China's growing hard power across theTaiwan Strait.\n\nAt aPentagonbudget hearingearlier in June, Hegseth told theSenateAppropriations Committee that recent Chinese military exercises around Taiwan point to Beijing's preparations to attack before the end of the decade.\n\nAccording to revised data from the Commerce Department, the U.S. economy shrank at a 0.5% annual rate from January through March, marking its first contraction in three years. A 37.9% import surge largely drove the downturn, as businesses rushed to stockpile goods ahead of anticipated tariffs tied to President Donald Trump's trade policies.\n\nThe updated figure is a downgrade from the department's earlier estimate of a 0.2% decline. The import spike shaved nearly 4.7 percentage points off gross domestic product (GDP), which reversed a 2.4% gain in the final quarter of 2024.\n\nConsumer spending slowed sharply to just 0.5%, while federal government spending dropped 4.6%, the steepest decline since 2022. A core measure of economic strength—excluding exports, inventories, and government spending—rose at a modest 1.9% pace, down from 2.9% in the previous quarter.\n\nEconomists expect the downturn to be temporary. Second-quarter growth is projected at 3%, buoyed by a likely normalization of import activity. The first estimate for April–June GDP is due July 30.\n\nAt a Pentagon briefing, Gen. Dan Caine, chairman of the Joint Chiefs of Staff, focused on the strategic planning behind the U.S. strike on Iran's Fordo nuclear facility, rather than the contested damage assessments.\n\nCaine revealed that U.S. intelligence had studied Fordo for years, leading to the development of specialized weapons capable of penetrating the deeply buried site. He presented a graphic showing ventilation shafts targeted by six precision-guided bombs designed to breach the underground complex.\n\nHe also recounted the tense hours before Iran's retaliatory missile strike on Al Udeid Air Base in Qatar, where just 44 U.S. soldiers remained to defend the installation. Caine said the response marked the largest Patriot missile engagement in U.S. history and credited both American and Qatari forces for their swift action.\n\nGen. Dan Caine, chairman of the Joint Chiefs of Staff, revealed new details Thursday about the U.S. strike on Iran's Fordo nuclear facility and Iran's retaliatory attack on Al Udeid Air Base in Qatar.\n\nCaine said the U.S. had been monitoring the Fordo site, buried deep in Iran's mountains, for years. A Defense Threat Reduction Agency officer had studied the facility for over a decade, leading to the development of a \"bunker-buster\" bomb used in the June 22 strike.\n\nTurning to Iran's missile attack on Al Udeid, Caine said it began at 7:30 a.m. local time and triggered what he called the largest Patriot missile engagement in U.S. military history. Only 44 American soldiers remained on base at the time, supported by Qatari forces, who helped intercept the incoming missiles.\n\nCaine praised the rapid response of both U.S. and Qatari troops, calling their actions a testament to the strength of joint air defense capabilities.\n\nTrump has said that reporters of CNN andNew York Timeswill be fired for making \"up the FAKE stories on the Iran Nuclear sites.\"\n\nUkrainian President Volodymyr Zelensky has formally approved the creation of a special international tribunal to prosecute senior Russian officials for the crime of aggression tied to the 2022 invasion of Ukraine.\n\nThe court will be established through an agreement with the Council of Europe, marking Zelensky's first visit to the Strasbourg-based human rights body. The tribunal is designed to fill a legal gap left by the International Criminal Court, which lacks jurisdiction to try Russian nationals for initiating the war.\n\nKyiv has long advocated for a tribunal that goes beyond war crimes to hold top Russian leaders accountable for launching the invasion. The court's location is still undecided, though The Hague is under consideration.\n\nLegal hurdles remain, including Russia's refusal to extradite citizens and the immunity of sitting officials like President Vladimir Putin, which would only lapse if they leave office.\n\nThe tribunal will be funded by a coalition of backers known as the Core Group, including Canada, Japan, and the Netherlands. The U.S. supported the initiative under President Biden, but not under President Trump.\n\nDefense Secretary Pete Hegseth began Thursday's Pentagon news conference by accusing the media of prioritizing scandal over substance.\n\nHegseth, a former Fox News host, criticized reporters for ignoring \"historic moments,\" including improved military recruitment and increased European defense spending by U.S. allies.\n\nHe also condemned coverage of a leaked preliminary intelligence assessment suggesting that recent U.S. strikes on Iran may have caused only limited damage. Hegseth dismissed the report as \"low confidence\" and accused the press of undermining the military's success.\n\nThe briefing was part of a broader push by the Trump administration to defend the strikes and counter skepticism about their effectiveness.\n\nDefense Secretary Pete Hegseth held a high-profile news conference at the Pentagon Thursday morning to defend the U.S. airstrikes on Iranian nuclear sites carried out over the weekend.\n\nThe briefing, announced by Trump on social media, was framed as a response to media reports questioning the effectiveness of the strikes. Trump said the event would \"fight for the dignity of our great American pilots\" and called it \"irrefutable.\"\n\nHegseth, joined by top military officials, reiterated the administration's claim that the strikes caused \"extremely severe damage\" to Iran's nuclear infrastructure, despite early intelligence assessments suggesting only a limited setback.\n\nThe news conference comes amid growing scrutiny over the operation's impact and the administration's handling of post-strike intelligence.\n\nIran's Supreme Leader Ayatollah Ali Khamenei accused the United States of seeking the Islamic Republic's total defeat, citing a recent social media post by Trump demanding Iran's \"unconditional surrender.\"\n\nIn remarks aired on Iranian state media, Khamenei said Trump's blunt language exposed what he called Washington's long-standing but veiled hostility toward Iran since the 1979 Islamic Revolution.\n\n\"Trump showed the truth,\" Khamenei said. \"Americans will only be satisfied with the surrender and defeat of Iran and nothing else.\"\n\nHe criticized past U.S. administrations for masking their intentions behind human rights and nuclear concerns, but said Trump had \"shown his hand.\"\n\nKhamenei called the demand for surrender \"unacceptable and illogical,\" and warned that Iran would not yield to pressure.\n\nHealth Secretary Robert F. Kennedy Jr. announced that the U.S. will suspend contributions to Gavi, the global vaccine alliance, accusing the organization of ignoring scientific evidence and eroding public trust.\n\nIn a video message played at Gavi's pledging summit in Brussels, Kennedy criticized the group's pandemic-era partnerships with social media platforms and questioned its vaccine recommendations, particularly for pregnant women and children in low-income countries.\n\nGavi, a coalition that includes WHO, UNICEF, the Gates Foundation, and the World Bank, has helped vaccinate over 1 billion children, saving an estimated 18 million lives. The U.S. had previously pledged $1 billion through 2030.\n\nIn response, Gavi defended its practices, saying all vaccine decisions are based on WHO expert guidance and rigorous scientific review. The UK pledged $1.7 billion to Gavi through 2030, reaffirming international support for the alliance.\n\nTurkish PresidentRecep Tayyip Erdogansaid he had made progress on the long sought acquisition of F-35 fighter jets in talks with U.S. PresidentDonald Trumpduring theNATOsummit.\n\nNewsweekhas contacted the U.S. Defense Department and Turkish Foreign Ministry for comment.\n\nTurkey'sdelivery of F‑35 jetshas been halted since 2019 after Ankara acquired the Russian S‑400 air defense system.\n\nErdogan has cultivated close ties with Trump yet remains one of the most vocal critics of Israeli Prime MinisterBenjamin Netanyahu, a major U.S. ally in the Middle East. If Turkey acquires F-35s it would bring them closer to parity with the air force that conducted the massive recent air campaign against Iran.\n\nAnkara has also intensified efforts to develop anindependent defense industry, aiming to reduce reliance on foreign arms suppliers amid persistent restrictions from Western allies.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nTo read how Newsweek uses AI as a newsroom tool,Click here.",
        "source_3": "There was a burst of confusion late in the day when Donald Trump said that the US and China had signed a trade deal two weeks after saying they had reached an understanding in London about how to implement a ceasefire in the countries’ dispute.\n\n“We just signed with China yesterday,” the president said at the White House on Thursday, without providing any details.\n\nTrump: We just signed with China yesterdaypic.twitter.com/U1FreLcE46\n\nThe reality turned out to be far less exciting than what Trump represented.\n\nShortly after, a White House official said the US and China had\"agreed to an additional understanding for a framework to implement the Geneva agreement\",in a reference to the trade talks that the nations held in May, when they first negotiated a truce, which was really just an agreement to continue negotiating. And since there was still leftover confusion, Trump's Commerce Secretary Howard Lutnick, said that the US and China sign a \"finalized a trade understanding\" reached last month in Geneva adding that the White House has imminent plans to reach agreements with a set of 10 major trading partners.\n\nThe China deal, which Lutnick said had been signed two days ago, codified the terms laid out in trade talks between Beijing and Washington, including a commitment from China to deliver rare earths used in everything from wind turbines to jet planes.\n\nIn other words, the \"deal\" that was just signed was merely another reaffirmation that the two sides continue to talk about eventually sitting down to negotiate.\n\nLutnick told Bloomberg Television that President Donald Trump was also prepared to finalize a slate of trade deals in the coming two weeks in connection with the president’s July 9 deadline to reinstate higher tariffs he paused in April.“We’re going to do top 10 deals, put them in the right category, and then these other countries will fit behind,” he said. Lutnick did not specify which nations would be part of that first wave of trade pacts, though earlier Thursday Trump suggested the US was nearing an agreement with India.\n\nAs a reminder, the \"China accord\" Lutnick described is far from a comprehensive trade deal that addresses thorny questions about fentanyl trafficking and American exporters’ access to Chinese markets.\n\nAfter an initial round of negotiations in Geneva resulted in a reduction in tariffs imposed by both countries, the US and China accused each other of violating their agreement. After subsequent talks in London this month, negotiators from the US and China announced they had arrived at an understanding, pending approval from Trump and Chinese President Xi Jinping.\n\nLutnick said that under the agreement inked two days ago, US “countermeasures” imposed ahead of the London talks would be lifted,but only once rare earth materials start flowing from China.\n\nWhich is a problem: asdiscussed previously, China's biggest point of leverage in the trade war negotiations is its control of rare earth exports to the US; it's also why the ceasefire deal announced in early June was mostly meant to restart exports of Chinese rare earths to the US.\n\nThat never happened.As theWSJ reported overnight, two weeks after China promised the U.S. it would ease the exports of rare-earth magnets,Chinese authorities have been dragging out approval of Western companies’ requests for the critical components,a situation that is bound to reignite trade tensions between Washington and Beijing.\n\nWestern companies say they are receiving barely enough magnets for their factories and have little visibility of future supplies. Firms are waiting weeks as Chinese authorities scrutinize their applications, only to be rejected in some cases. And applications for raw rare earths, which are used to make magnets, are rarely granted.\n\nAs a result, Western companies are concerned that the shortages could soon affect manufacturing.Companies are so desperate for magnets that they are opting for expensive airfreight whenever licenses are granted to prevent costly production shutdowns.Some manufacturers are experimenting with workarounds that would allow them to make their products without the most powerful magnets.\n\n“It’s hand to mouth—the normal supply-chain scrambling that you have to do,” said Lisa Drake, a vice president overseeing Ford’s industrial planning for batteries and electric vehicles, earlier this week. Although she said the situation had improved, the scarcity of the rare-earth magnets is forcing Ford to “move things around” to avoid factory shutdowns, she said.\n\nAs a result,contrary to White House assertions that the flow of the critical components would return to normal,manufacturers have taken the continuing challenges as a sign that new Chinese rare-earth export restrictions, introduced in April after President Trump raised tariffs on China, arehere to stay.\n\n“Yes, the export restrictions have been paused on paper. However, ground reality is completely different,”said Neha Mukherjee, a rare-earths analyst at Benchmark Mineral Intelligence. The licensing process is plagued by “bureaucratic drag.”\n\nOn Thursday, China’s Ministry of Commerce issued a token statement that it has been accelerating the review of rare-earth export license applications and has approved “a certain number.”\n\nThe restrictions illustrate thepower Beijing holds through its formidable supply chains and how it can use them to inflict pain on Western businesses and exact concessions from the US.China makes 90% of the world’s most powerful rare-earth magnets, a key component in everything from cars to jet fighters. In April, after Trump heaped stiff tariffs on Chinese products, Beijing established an export-control system for rare earths. While it said the license system was set up to regulate the export of materials for military use, the regime has in effect allowed China to clamp down on rare-earths supplies as it wishes.\n\nAfter April, the supply of magnets to Western businesses slowed to a trickle, causing shock waves for global car, defense and electronics makers. Exports of rare-earth magnets to the U.S. declined 93% in May from a year earlier. Ford stopped production of its Explorer SUV at its Chicago plant for a week in May.\n\nThe U.S. accused China of slow-walking the approval of export licenses, which China denied. The shortage drove both sides back to the bargaining table earlier this month, where China agreed to free up the flow of rare earths in exchange for the U.S. easing its own restrictions on certain U.S. exports to China.\n\nFollowing the deal, Trump wrote that “full magnets, and any necessary rare earths, will be supplied up front by China.”\n\nHowever,China put only asix-month limit on any new licenses,we later learned as Beijing seeks to keep DC on a tight leash. Now, in the applications for export licenses, Chinese authorities are asking Western companies for sensitive details such as contact information of those buying their magnets and even designs of how their magnets are integrated into components like motors.\n\nBeijing also appears to be trying to prevent stockpiling by Western businesses. One Chinese magnet maker has warned clients seeking to import more magnets than usual that they may have to explain to government officials the “business drivers” behind such large orders, according to an advisory note the magnet maker shared with clients.\n\nFearful of shortages, many Western businesses are complying with the information requests—but are still facing long delays. The success of their application also depends on their supplier. Big state-connected magnet companies are getting export licenses faster than smaller private ones, according to many in the industry.\n\n“The export policy for magnet[s] is still very strict,” said a representative for one Chinese magnet maker. Now, some Western businesses say they are resigned to the fact that the restrictions may remain in place indefinitely.\n\nFor a detailed analysis of the leverage China has with its supply chain of Rare Earths, please read Morgan Stanley's key report on the topic \"How China Is Playing Its Rare Earth Card\" (available topro subscribers).\n\nAnd while China is clearly dominating the rare earth supply chain (for now, as it is only a matter of time before the Trump admin subsidizes domestic producers such as MP Materials to ramp up production as an alternative to China), the US is doing the same with ethane (a relationship we described in \"China's Need For US Chemicals Greater Than US Need For Rare Earths\".)\n\nChina imported more than 565,000 barrels per day of petrochemical feedstocks from the US in 2024 according to the Energy Information Administration, with avalue of over $4.7 billion. That dwarfed the$170 million of rare earths the US imported last year, about 70% of which came from China, according to the US Geological Survey.\n\nThe figures show the dependence the US and China have developed on each other by ever tightening trade links over the past few decades. While China has a tight grip on refining many metals crucial for industry, it also takes in niche chemicals from the US that are difficult to buy elsewhere.\n\nChina leans on naphtha to produce most base chemicals, which are processed further to end up in everyday items like electronics and clothing. However, some plants can switch to cheaper propane when the economics make sense, which they do regularly. Propane dehydrogenation plants however can’t process alternatives like naphtha.The US accounted for over half of all China’s propane imports in 2024.\n\nAnd so, with China refusing to comply with the terms of the recent ceasefire and unlock rare earth exports to the US, Washington is doing the same, and asReuters reported yesterday, the US sent letters to Enterprise Products and Energy Transfer on Wednesdayinforming the companies they could load ethane on vessels destined for China but could not unload the ethane in China without authorization.\n\nThe letters from the U.S. Department of Commerce follow a licensing requirement imposed several weeks ago on the companies' exports of ethane to China, which halted shipments and led to vessels anchoring in or hovering around the US Gulf Coast\n\nA copy of the letter seen by Reuters and later released by Enterprise Products said,\"This letter authorizes Enterprise Products to load vessels with ethane, transport and anchor in foreign ports, even if... to a party located in China,\"the letter said. \"However, Enterprise Products may not complete such export... to a party that is located in China,\"without further authorization.\n\nThe letters, Reuters muses, may signal the US preparing to lift restrictions imposed on exports to China in late May and early June, as the U.S.-China trade war shifted from retaliatory tariffs, to curbs on each others supply chains. With China granting rare earth export licenses to some firms and saying it would speed up the approval process, the U.S. now appears close to permitting ethane exports to China.\n\nHowever, the decision to limit unloading of ethane is more likely another form of negotiation, one which signals that the cargo will not be released unless China complies with its own terms, and resumes shipments of rare earths.\n\nAbout half of all US ethane exports go to China, where it is used by the petrochemical industry. China’s ethane cracking capacity is dwarfed by its capacity to process naphtha and propane,but almost all of its ethane imports come from the US.The restrictions will have a significant impact on the Lianyungang and Tianjin plants, owned by Satellite Chemical, Sinopec and INEOS. SP Chemicals, a Singapore-based producer, sources most of its feedstock from Enterprise Products Partners.\n\nThe ability to load and begin transporting ethane could relieve congestion at ports along the U.S. Gulf coast, where vessels have been stalled, although that now appears to be dependent on China complying with the terms of the London ceasefire.\n\nSince May 23, the U.S. imposed new restrictions on exports to China of everything from ethane and chip design software to jet engines and nuclear plant parts.\n\nAs the trade war continues, it appears commodities are now leading the confrontation, with players on both sides set to feel the pain.\n\nMore in the Morgan Stanley report \"How China Is Playing Its Rare Earth Card\", available topro subscribers."
    }
}