{
    "question": "What are the potential legal and political consequences, both immediate and long-term, of Texas officials seeking arrests and court rulings to declare vacant the seats of Democratic lawmakers who left the state to break quorum?",
    "content": {
        "source_1": "Legal experts say it’s “inconsistent with the Texas Constitution” to argue that leaving the state to halt legislative action qualifies as abandoning an office.\n\nSign up for The Brief, The Texas Tribune’s daily newsletter that keeps readers up to speed on the most essential Texas news.\n\nGov.Greg Abbotton Tuesdayasked the Texas Supreme Courtto remove Houston Rep.Gene Wu, chair of the House Democratic Caucus, from office, an unprecedented escalation in Republicans’ efforts to resume business in the Legislature and advance new congressional maps.\n\nAt least 50 House Democrats have left the state to prevent the chamber from obtaining a quorum — the minimum number of members necessary to undertake legislative business — in an effort to delay the passage of new congressional lines that could net five more seats for Republicans. The unusual mid-decade redistricting effort comes at the behest of President Donald Trump and his political team, despiteinitial reluctancefrom Abbott and the majority of Texas’ GOP congressional delegation.\n\nDemocrats left the state Sunday afternoon, ahead of a Monday vote to advance the bill. Wu, as leader of the House Democrats, announced that “this corrupt special session is over” and vowed to stay out of the state long enough to allow the session's remaining two weeks to run out.\n\nIn his legal filing, Abbott argued that amounts to an abandonment of office and is sufficient grounds to have Wu’s seat vacated.\n\n“What is at stake here? Nothing less than the future of Texas,” Abbott wrote. “If a small fraction of recalcitrant lawmakers choose to run out the clock today, they can do so for any, and every, Regular or Special Session, potentially bankrupting the State in an attempt to get their way.”\n\nIn a response filed with the court Friday, Wu said he had not abandoned his office and argued the entire lawsuit against him should be thrown out.\n\n“To the contrary, he continues to carry out his legislative duties as his judgment dictates,” lawyers for Wu wrote in the filing. In asking for the case to be dismissed, they noted that Wu had not died, nor had he been expelled by the House by a two-thirds vote or voluntarily resigned — all of which would be grounds for removal from office under state law.\n\nThis site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply.\n\nAttorney GeneralKen Paxton, who threatened to file similar legal actions earlier in the day against multiple House Democrats, followed Abbott's emergency petition by sending his own letter to the state Supreme Court hours later, in which he argued that Abbott lacked the authority to request the removal.\n\nPaxton wrote that while he \"appreciates the Governor’s passion\" for restoring a quorum, state law permits only the attorney general or a local county or district attorney to bring what's known asa quo warranto proceeding, which seeks a member's removal on the grounds that they have abandoned their office.\n\nIn the letter, Paxton said he would take action against the absent legislators if the House continued to lack a quorum on Friday, the deadline set by House SpeakerDustin Burrows. He followed through on the threat,asking the Supreme CourtFriday afternoon to expel 13 Democrats from the chamber while echoing Abbott's argument that the lawmakers had effectively abandoned their offices.\n\nAbbott later clarified in asocial media postthat his filing sought quo warranto through a provision in the Texas Constitution and a separate portion of government code, which he said would give his office the proper authority. He also attached a letter addressed to the state Supreme Court in the post that stated \"at least 500 years of common law\" made it clear the governor's office could make the filing.\n\nPaxton previously acknowledged that this would likely be a lengthy and complicated process, telling conservative podcaster Benny Johnson that his office would have to bring individual lawsuits in each member's district. But in Friday’s filing, he argued that the Texas Supreme Court has the right to rule directly on the matter, especially when there is a need to swiftly resolve the situation.\n\nIf a judge were to find that the seats were vacant, they would be filled through a special election.\n\nThe Supreme Court of Texas is entirely Republican, and Chief Justice Jimmy Blacklock,appointed in January, was formerly Abbott’s general counsel. When he appointed Blacklock to the bench in 2018,Abbott saidhe “wanted to make sure that the person I appointed was going to make decisions that I know how they are going to decide.” Blacklock has said that was more a reflection of their shared judicial philosophy.\n\nIn 2021, Blacklockauthored an opinionfor the court that said the Texas Constitution enables the possibility of a so-called “quorum break,” although it also allows for consequences to bring members back.\n\nLegal experts say it would be difficult to argue that engaging in a quorum break qualifies as abandonment of office.\n\n“I am aware of absolutely no authority that says breaking quorum is the same as the intent to abandon a seat,” said Charles “Rocky” Rhodes, a constitutional law expert at the University of Missouri law school. “That would require the courts extending the premise to the breaking point. It’s inconsistent with the very text of the Texas Constitution.”\n\nChad Dunn, a former attorney for the Texas Democratic Party who is now representing Wu, said proving abandonment of office would require showing that the member had failed to perform the duty of their office and intended to relinquish the seat, both of which he argues are not evident in a quorum break.\n\n“It is not just an option, but one of the features of elected office to decide whether to appear and help establish quorum,” Dunn said, speaking generally about state law before the case was filed. “Each member as part of their duty of office must make that decision.”\n\nIn the filing, Abbott disagreed, reiterating the idea that leaving to deny the House the votes it needs to proceed is tantamount to relinquishing the office.\n\n“It is no answer for Wu to say that he plans to continue serving as a representative,” Abbott wrote. “His own statements and actions show a refusal to actually serve as a representative in fact. That’s because what representatives do is represent their constituents in the legislative chamber. They appear for a quorum. They meet with other legislators in hearings. They speak with their constituents. They debate bills. And, in the end, they vote their district.”\n\nDunn condemned the lawsuit in Friday’s response, saying that the Supreme Court was not the proper venue, the governor was not the proper litigant and the entire suit is based on hearsay and speculation.\n\n“Given that the Governor has included no proper statement of facts or record to respond to — itself a grave due process problem — Respondent generally disputes the factual allegations that are scattered throughout the petition, such as they are,” the filing says.\n\nThe lineup for The Texas Tribune Festival continues to grow! Be there when all-star leaders, innovators and newsmakers take the stage in downtown Austin, Nov. 13–15. The newest additions include comedian, actor and writerJohn Mulaney; Dallas mayorEric Johnson; U.S. Sen.Amy Klobuchar, D-Minnesota; New York Media Editor-at-LargeKara Swisher; and U.S. Rep.Veronica Escobar, D-El Paso.Get your tickets today!\n\nIndependent Texas reporting needs your support. The Texas Tribune delivers fact-based journalism for Texans, by Texans — and our community of members, the readers who donate, make our work possible. Help us bring you and millions of others in-depth news and information. Will you support our nonprofit newsroom with a donation of any amount?\n\nLearn about The Texas Tribune’s policies, including our partnership withThe Trust Projectto increase transparency in news.\n\nCongressPoliticsState government2026 electionsRedistricting",
        "source_2": "Jenna Sundel is a Newsweek reporter based in New Jersey. Her focus is reporting on breaking news. She has in-depth knowledge of crime and courts. Jenna joined Newsweek in 2024. She previously worked at The Messenger. She is a graduate of Montclair State University. You can find her on X @jennajournalist. You can get in touch with Jenna by emailing j.sundel@newsweek.com. Languages: English.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nTexas Attorney GeneralKen Paxtonsaid the ongoing refusal byTexas House Democrats who broke quorumand left the state to block a vote on redrawing the state's congressional map amounts to abandonment of office. TheRepublicansaid he will seek a court ruling to have their seats declared vacant if they don't return by the end of the week.\n\nRepublican House Speaker Dustin Burrows hasgiven the absent lawmakers until Fridayto return to Texas and appear before the House. The Texas House also passed a motion to issuearrest warrants for Democratswho fled the state.\n\nLawmakers outside of Texas' borders are beyond the jurisdiction of state authorities.\n\nThose who fail to return by the deadline—and are not arrested and brought back beforehand—will face \"aggressive\" legal action from Paxton, according to a news release from the Texas Office of the Attorney General.\n\n🚨BREAKING: I will seek judicial orders declaring that runaway Democrats who fail to appear by the Speaker’s deadline have vacated their office.The people of Texas elected lawmakers, not jet-setting runaways looking for headlines. If you don’t show up to work, you get fired.pic.twitter.com/yyPWavY38P\n\nPaxton wrote on X, formerly Twitter, \"BREAKING: I will seek judicial orders declaring that runawayDemocratswho fail to appear by the Speaker's deadline have vacated their office. The people of Texas elected lawmakers, not jet-setting runaways looking for headlines. If you don't show up to work, you get fired.\"\n\nTexas is among several states planning to redraw congressional maps ahead of the 2026 midterm elections. Other states that could initiate redistricting include Ohio, New York and California,Newsweekpreviously reported.\n\nRepublicans hold a slim majority in the House of Representatives, with 219 seats compared to the Democrats' 212. There are currently four vacancies.\n\nTexas Republican state lawmakers unveiled the first draft of a new congressional map last week. Under the new map, the Lone Star State's four Democratic-leaning major metropolitan areas would be divided among at least four congressional districts apiece.\n\nNearly all of the redrawn districts would have a Republican majority, according to the Associated Press.\n\nRepublicans hold 25 of the state's 38 seats in the House, and the new map could raise the total seats won in the 2026 midterms to 30 if passed.\n\n\"We are entitled to five more seats,\" President Donald Trump said Tuesday in a CNBC interview.\n\nOn Sunday,Texas House Democratsannounced they will breaking quorum to prevent a vote on the new map.\n\nIn the Texas House of Representatives, two-thirds of its 150 members must be present to reach a quorum. Without a quorum, \"no business shall be transacted, except to compel the attendance of absent members or to adjourn,\" according to the Texas House Rules of Procedure.\n\nDuring Tuesday's session of the Texas House, 54 Democrats broke quorum,KXANreported, two fewer than on Monday.\n\nThe following representatives were not present on Tuesday, according to the outlet:\n\nRepresentatives Philip Cortez and Eddie Morales were not present on Monday, but returned to the House on Tuesday.\n\nThe term \"gerrymandering\" dates to 1812, when then-Massachusetts Governor Elbridge Gerry signed a bill redrawing state Senate districts to benefit the Democratic-Republican Party. A newspaper illustration called one district \"The Gerry-mander,\" due to its resemblance to a salamander.\n\nThe term later evolved to describe any district drawn for political advantage.\n\nDemocratic Texas State Representative Ramon Romero Jr., at a news conference:\"Right now, there's folks saying that we walked out. I think everyone behind me will say we're standing up, and as Texans would say, we're standing tall. There's others that are saying and warning us that they're going to arrest us or make us pay fines. I'll pay that price for America.\"\n\nPaxton, in a statement:\"Democrats have abandoned their offices by fleeing Texas, and a failure to respond to a call of the House constitutes a dereliction of their duty as elected officials.\"\n\nThe Democrats who were not present on Tuesday were given until Friday to appear before the House before facing legal action.\n\nThis article includes reporting by the Associated Press.\n\nDoyou have a story thatNewsweekshouldbe covering? Do you have any questions about this story? Contact LiveNews@newsweek.com.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nJenna Sundel is a Newsweek reporter based in New Jersey. Her focus is reporting on breaking news. She has in-depth knowledge of crime and courts. Jenna joined Newsweek in 2024. She previously worked at The Messenger. She is a graduate of Montclair State University. You can find her on X @jennajournalist. You can get in touch with Jenna by emailing j.sundel@newsweek.com. Languages: English.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nJenna Sundel is a Newsweek reporter based in New Jersey. Her focus is reporting on breaking news. She has in-depth knowledge of crime and courts. Jenna joined Newsweek in 2024. She previously worked at The Messenger. She is a graduate of Montclair State University. You can find her on X @jennajournalist. You can get in touch with Jenna by emailing j.sundel@newsweek.com. Languages: English.\n\nJenna Sundel is a Newsweek reporter based in New Jersey. Her focus is reporting on breaking news. She has in-depth                                    ...Read more",
        "source_3": "Republican Texas Attorney General Ken Paxton said Monday on Fox Business’ “The Bottom Line” that Democrats fleeing the state to avoid a vote on redistricting will face consequences either from the state House or from the state’s Supreme Court.\n\nReportsof Democrats fleeing Texas for blue states like Illinois in hopes of blocking a vote on the proposed redistricting map broke Sunday evening. Paxton said he favors arresting Democrat lawmakers who fled. He was asked how he would handle each individual lawmaker.(RELATED: ‘It’s A Bad Look’: Chuck Todd Blasts Texas Dems For Protesting Gerrymandering By Fleeing To Gerrymandered Illinois)\n\n“So the Speaker sets the consequences. So he can find them. He can have other consequences inside of the House as far as committee assignments and what they end up getting to do inside the House. That typically does not happen. This has happened in Texas history when I was in the House,” Paxton said.\n\n“Typically what we’ve done is we have the governors, the Republican governors, have just kept calling special sessions because, ultimately, these people don’t want to typically live in the state they’ve gone to. And they ultimately come back, and they’re forced to vote. So that’s been typical,” Paxton added. “We’re looking at other options. If we can’t arrest them, we want to have the opportunity to potentially take them out of office, at least force them back in for a court hearing.”\n\nIn response to the 51 Democrats leaving for Illinois, Paxtontookto X on Sunday, saying he supports the “immediate arrest of these rogue lawmakers who’ve fled their duties.”\n\n“These radical Democrats are spitting in the face of every Texan they swore to represent. This is cowardice and dereliction of duty, and they should face the full force of the law without apology,” Paxton wrote.\n\nBy Monday, the Texas Housepasseda motion to issue arrestwarrantsfor the lawmakers who fled following their failure to appear at the chamber to vote on redistricting the state’s congressional maps.\n\nThe Fox Business guest host said the court hearings “are really crucial” due to taking place in “certain districts that are not favorable to the governor’s cause of redistricting.” While there was potential for an outcome unfavorable to Republicans, Paxton addressed how he saw the rulings playing out.\n\n“That’s true. I mean, we will be in Democratic districts. However, this is a state issue. So, ultimately, this case will likely go to the Texas Supreme Court, which isn’t necessarily unfavorable,” Paxton said.\n\n“They’re a strong Republican body that tends to follow the Constitution and follows the law,” Paxton said. “So I’m confident that when they get this case, they’ll make an appropriate and good ruling.”\n\nAccordingto the Texas Tribune, the motion passed by the state’s House will not have the absent Democrat members face civil or criminal charges, as the warrant only applies within Texas state lines.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contactlicensing@dailycallernewsfoundation.org."
    }
}