{
    "question": "In what ways could the tariff-driven import surge that contributed to the 0.5% Q1 contraction distort perceptions of the economy’s underlying strength, and what indicators should be watched to gauge whether a rebound will materialize in Q2?",
    "content": {
        "source_1": "A deluge of economic data released Thursday should have provided a clearer picture of how the US economy is faring in the face of President Donald Trump’s massive policy shifts. But the latest numbers were a mixed bag, leaving economists still scratching their heads.\n\nGross domestic product, the broadest measure of economic output, registered an annualized rate of -0.5% from January through March, the Commerce Department said Thursday in its third and final estimate. That’s worse than the 0.2% decline reported in the second estimate. GDP is adjusted for seasonal swings and inflation.\n\nRelated articleAmericans cut back sharply on their spending last month amid tariffs\n\nThe latest estimate showed that consumer spending — the lifeblood of the US economy —was tepid in the beginning of the year.Spending in the first quarter grew at a rate of just 0.5%, down from 1.2% in an earlier estimate. That’s the weakest rate in more than four years.\n\nSeparately, new data showed that unemployed Americans are having an increasingly harder time finding work. A deteriorating job market — if that turns out to be the case — would not bode well for consumer spending, which already seems to be on shaky ground.\n\nStill, in a shred of good news, other figures showed that businesses are still investing, despite the persistent uncertainty over Trump’s on-again, off-again tariffs and the potential impact of his massive tax and spending bill currently being reviewed by the US Senate.\n\n“Thursday’s GDP is backward looking and stocks already priced in the economic weakness caused by the tariffs during their decline in early April,” Paul Stanley, chief investment officer, Granite Bay Wealth Management, wrote in commentary issued Thursday. “Now, with stocks back at record highs, the market is looking ahead and pricing in an environment where tariffs are lower and that companies will be able to adapt and navigate tariffs.”\n\nOverall, the latest economic numbers continue to show how tariff fears are weighing on the world’s largest economy as key drivers of growth — the labor market and spending — have lost some momentum.\n\nDespite spending being revised much lower, the main driver of the decline in first-quarter GDP was a massive trade deficit, as American businesses rushed to stock up on imports to get ahead of Trump’s stiff tariffs. The third estimate revised imports down, but they still greatly exceeded exports, which subtracted from GDP.\n\nFresh data released Thursday morning by the Labor Department showed the number of people receiving jobless benefits for at least one week rose by 37,000 to 1.974 million, marking the highest total since November 6, 2021. Some Fed officials don’t believe that development is concerning.\n\n“The data today confirmed that continuing claims are going up because it takes a little longer to find a job. That’s consistent with the hiring numbers just being slower as the economy comes to a more sustainable pace,” San Francisco Federal Reserve President Mary Daly said Thursday in an interview with Bloomberg. “But when I look at the labor market, there are really no warning signs that it’s weakening.”\n\nRelated articleTrump calls Fed Chair Powell an ‘average mentally person’ and says he’s working on replacements\n\nThe Commerce Department separately reported on Thursday that new orders for US durable goods surged 16.4% last month, as business demand for transportation equipment ramped up sharply. The overall boost in orders last month came as China lowered tariffs on American exports from 125% to 10%, while the US lowered tariffs on Chinese exports from 145% to 30%.\n\nNew orders for non-defense capital goods excluding aircraft — a closely watched proxy for business investment — grew at a rate of 1.7% in May from the prior month, rebounding sharply from a 1.4% decline in April. That bodes well for economic growth in the second quarter, which will be reported next month.\n\nBut the latest figures likely don’t have much bearing for Fed officials, who are divided on whether the central bank shouldresume lowering interest rates next month.\n\n“The revisions to GDP won’t have significant implications for the Federal Reserve as it’s backward looking. The Fed is focused on the inflation risks stemming from tariffs and the labor market,” Ryan Sweet, chief US economist at Oxford Economics, said in an analyst note Thursday. “If the Fed pivots and signals that it will cut rates earlier than we anticipate, with the next occurring in December, it will be because of the labor market, not GDP.”\n\nCNN’s Alicia Wallace and Elisabeth Buchwald contributed to this report.",
        "source_2": "Reporting by Lucia Mutikani; Editing by Chizu Nomiyama\n\nOur Standards:The Thomson Reuters Trust Principles., opens new tab\n\nA prominent Al Jazeera journalist, who had previously been threatened by Israel, was killed along with four colleagues in an Israeli airstrike in an attack condemned by journalists and rights groups.\n\nReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.\n\nAccess unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.\n\nBrowse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.\n\nScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.\n\nAll quotes delayed a minimum of 15 minutes.See here for a complete list of exchanges and delays.",
        "source_3": "Apollo chief economist Torsten Slok elaborates on risks facing the U.S. economy on ‘Barron’s Roundtable.’\n\nThe U.S. economy contracted in the first quarter as tariffs caused importers to surge shipments before higher levies took effect.\n\nThe Commerce Department's Bureau of Economic Analysis (BEA) released its third estimate for first quartergross domestic product(GDP), which found the U.S. economy contracted at an annual rate of 0.5% in the first quarter, which runs from January through March.\n\nEconomists surveyed by LSEG had expected the economy to contract at a 0.2% rate in the quarter, in line with the second preliminary reading. The contraction comes after 2.4% GDP growth was recorded in the fourth quarter.\n\nThe 0.5%GDP contractionshown in the final first-quarter GDP figures is the first quarterly contraction since the first quarter of 2022.\n\nJOB SEEKERS IN LIMBO AS LONG-TERM UNEMPLOYMENT PERSISTS\n\nThe decline in GDP was attributed primarily to anincrease in importsalong with a decrease in government spending. Those shifts were partly offset by increases in investment and consumer spending.\n\nImports surged 37.9% in the first quarter and accounted for a contraction of 4.66% in GDP, as firms ramped up imports in an effort to minimize the impact of PresidentDonald Trump'stariffs, which are taxes on imported goods. In the GDP calculation, imports are subtracted because the metric is meant to measure domestic production.\n\nGovernment spendingwas down 0.6% compared with the prior quarter, with a decline of 4.6% in federal spending partially offset by a 2% gain by state and local governments.\n\nINFLATION INCREASED SLIGHTLY ON AN ANNUAL BASIS IN MAY\n\nGDP contracted by more than expected in the first quarter of 2025.((Photo by STEFANI REYNOLDS/AFP via Getty Images) / Getty Images)\n\nConsumer spendingwas up 0.5% in the first quarter, with spending on goods up 0.1% and services spending rising by 0.6%, compared with the prior quarter.\n\nPrivate investment rose 23.8% in the first quarter, following a contraction of 5.6% in the fourth quarter.\n\nDisposable personal income was 2.5% in the first quarter, unchanged from the fourth quarter.Personal savingsas a percentage of disposable income was 4.3%, up from 3.8% at the end of last year.\n\nJPMORGAN CEO JAMIE DIMON WARNS ECONOMIC CONDITIONS MAY DETERIORATE SOON\n\n\"The data confirm that tariff anxiety spurred a front-loading of activity early in the year – businesses rushed to import goods ahead of new duties, while consumers accelerated purchases of some items to avoid looming price hikes,\" said EY chief economist Gregory Daco.\n\nImports surged 37.9% in the first quarter and accounted for a contraction of 4.66% in GDP.(Photo by Joe Raedle/Getty Images / Getty Images)\n\n\"The timing of these wild swings in demand and supply was spread across quarters so that the Q1 and Q2 GDP print are more reflective of the tariff mist than a clear-cut read on economic flows,\" Daco added.\n\n\"The decline in Q1 GDP was a touch more than previously thought, but the details are more troubling because of the downward revision to real final sales to domestic purchasers, the engine of the economy,\" said Ryan Sweet, chief U.S. economist at Oxford Economics.\n\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\n\nBy clicking subscribe, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time."
    }
}