{
    "question": "How might Zohran Mamdani’s upset win over Andrew Cuomo in New York City’s Democratic mayoral primary signal changing voter priorities, and what are the potential implications for the November election and for advancing his affordability-focused agenda within city and state politics?",
    "content": {
        "source_1": "Zohran Mamdani appears poised to be the Democratic nominee for mayor, where he could face a contested race that will include Eric Adams and perhaps Andrew Cuomo.\n\nZohran Mamdani, a little-known state lawmaker whose progressive platform and campaign trail charisma electrified younger voters, stunned former Gov. Andrew M. Cuomo in the Democratic primary for mayor of New York City on Tuesday night, building a lead so commanding that Mr. Cuomo conceded.\n\nMr. Mamdani, a 33-year-old democratic socialist from Queens, tapped into a current of anxiety around New York City’s growing affordability crisis. His joyful campaign brought new voters into the fold who rejected the scandal-scarred Mr. Cuomo’s ominous characterizations of the city and embraced an economic platform that included everything from free bus service and child care to publicly owned grocery stores.\n\nThe outcome was not official, and even assuming Mr. Mamdani gains the nomination, he faces an unusually competitive general election in November.\n\nStill, Mr. Mamdani declared victory at a rally early Wednesday in Queens, pledging to be a “mayor for every New Yorker” and framing his win as part of a movement powered by volunteers.\n\n“Tonight we made history,” he said. “In the words of Nelson Mandela, it always seems impossible until it is done. My friends, we have done it.”\n\nThe decisiveness of New Yorkers’ swing toward Mr. Mamdani reverberated across the party and the country, at a time when Democrats nationally are searching for an answer to President Trump and are disillusioned with their own leaders.\n\nMr. Cuomo acknowledged his apparent defeat in a concession speech. “He won,” Mr. Cuomo told his supporters roughly 80 minutes after polls had closed and said he had congratulated Mr. Mamdani.\n\n“Tonight was not our night,” he said, appearing deflated. “Tonight was Assemblyman Zohran Mamdani’s night.”\n\nWith 93 percent of the results in, Mr. Mamdani was the first choice of 43.5 percent of voters. Mr. Cuomo was in second place as the first choice of 36.4 percent of voters.\n\nMr. Mamdani said he would use his “power to reject Donald Trump’s fascism” and struck a note of unity after a contentious primary.\n\n“Whether you voted for me, for Governor Cuomo or felt too disillusioned by a long broken political system to vote at all, I will fight for a city that works for you,” he said. “That is affordable for you. That is safe for you. I will work to be a mayor you will be proud to call your own.”\n\nThe official outcome still awaits the tabulation next Tuesday of ranked choices under the city’srelatively new voting system. Mr. Cuomo, who has collected signatures to run on a third-party line in November, conspicuously did not vow to carry on his campaign in the general election.\n\n“I wanted to look at the numbers and the ranked-choice voting to decide about what to do in the future, because I’m also on an independent line,” he said in an interview with The New York Times. “And that’s the decision.”\n\nA candidate must clear 50 percent of the vote on primary night to be declared winner;the final resultis not expected until July 1, when voters’ alternative choices are taken into account.\n\nIt is expected to be exceedingly difficult for Mr. Cuomo to narrow the gap in the ranked-choice elimination rounds. Several candidatesencouraged their supporters to list Mr. Mamdani on their ballotsand to leave Mr. Cuomo’s name off, as did the Working Families Party and other left-leaning groups.\n\nPolitical strategists agreed with Mr. Cuomo that he could not overcome Mr. Mamdani’s lead.\n\n“This is the biggest upset in modern New York City history,” said Trip Yang, a Democratic strategist.\n\nThe race had been volatile and bitter, with the two leading Democrats offering starkly different visions for the city and reflecting a generational divide in their party. Mr. Mamdani embodiedenergy and charisma, attracting droves of young, left-leaning New Yorkers; Mr. Cuomo represented the party’s older guard and ran a conservative rose-garden campaign, limiting his public appearances to churches and synagogues and supportive union halls.\n\nThe contest seemed to invigorate voters, with more than twice as many New Yorkers casting their ballots early in this year’s mayoral primary compared with the last mayoral primary in 2021, and high turnout on Primary Day that approached 1 million voters.\n\nIn his concession speech, Mr. Cuomo congratulated Mr. Mamdani for running “a great campaign.”\n\n“He touched young people and inspired them and moved them and got them to come out and vote, and he really ran a highly impactful campaign,” Mr. Cuomo said. “I called him, I congratulated him. I applaud him sincerely for his effort.”\n\nMr. Mamdani and Mr. Cuomo, 67, both pledged to stand up to President Trump and to alleviate voters’ concerns over affordability and public safety. But they have diverged over how to accomplish those goals and fiercely attacked one another over theirexperience,character,donorsand theconflict in the Middle East. Millions of dollars in negative television advertisement have filled the airwaves this month.\n\nMr. Mamdani’s left-leaning policies and open socialist affiliation would represent a sharp directional change for New York City, and some of his proposals would be likely to face opposition from Gov. Kathy Hochul and state lawmakers. Mr. Mamdani has proposed paying for his proposals, which also include freezing rent on rent-stabilized apartments and publicly financing vast amounts of new housing, by raising $10 billion in new revenue through taxes on businesses and the wealthy.\n\nThe race has captured national attention as a battle between the left wing of the Democratic Party and more traditional moderates. Mr. Mamdani, who would be the city’s first Muslim mayor and the youngest in a century, was endorsed by Senator Bernie Sanders of Vermont and Representative Alexandria Ocasio-Cortez of New York; Mr. Cuomo was endorsed by former President Bill Clinton and much of the local party establishment.\n\nThe former governor also benefited from a $30 million crush in outside spending fromwealthy business interests, including formerMayor Michael R. Bloomberg, which buried Mr. Mamdani in attack ads. Mr. Mamdani, in contrast, had the highest number of individual donors in the race.\n\nMr. Cuomo, who resigned as governor in 2021 following allegations of sexual harassment that he denies,led in the polls for months. But Mr. Mamdani gained momentum with younger voters byfocusing on a message that the city was unaffordable, spreading it through viral social media videos.\n\nBrad Lander, the city comptroller, was in third place on Tuesday night with 11.3 percent; Adrienne Adams, the City Council speaker, was in fourth place with 4.1 percent.\n\nIf Mr. Mamdani wins the primary, he will be positioned as the de facto front-runner in the general election in November. Other candidates include Mayor Eric Adams, who has record low approval ratings and is running as an independent. Curtis Sliwa, the founder of the Guardian Angels, is the Republican candidate. Mr. Cuomo may run on an independent ballot line; Jim Walden is also running as an independent.\n\nVoters seemed deeply divided as they visited the polls in sweltering weather on Tuesday. Many younger New Yorkers expressed enthusiasm for Mr. Mamdani.\n\nYadelis Avila, 22, a daughter of Dominican immigrants in Washington Heights, in Manhattan, said she ranked Mr. Mamdani first and was worried about housing costs.\n\n“I just feel like he’s someone that I could identify with,” she said, adding, “His parents are immigrants, so it’s just like I see myself in him, and I trust him.”\n\nHakeem Shaheed, 49, a health care worker who voted in Harlem, said he liked Mr. Mamdani’s proposal to freeze rents on nearly one million rent-stabilized units.\n\n“The rent is really important to me because everything else means nothing if you can’t live here,” he said.\n\nOther voters praised Mr. Cuomo’s experience. Elise Fernandez, 45, who lives in Jamaica, Queens, said she wants to the next mayor to address homelessness and traffic woes.\n\n“No one is perfect, but he managed a whole state, so I can see he has the experience to manage and to do good for New York City,” she said.\n\nThe primary is the second time New York City has used ranked-choice voting in a mayoral primary. The campaigns scrambled to educate voters about the system, which almost led to an upset against Mr. Adams in 2021. He won the Democratic primary by less than 8,000 votes over Kathryn Garcia, a city sanitation commissioner who was endorsed by another candidate, Andrew Yang.\n\nMr. Adams, the city’s second Black mayor, has had a turbulent first term. He was indicted last year on federal corruption charges that were later dropped by the Trump administration after he struck an alliance with President Trump. Many of the mayor’s advisers were investigated and resigned; others resigned in protest over his cooperation with Mr. Trump.\n\nMr. Adams said on Tuesday night that he was ready to fight Mr. Mamdani in November, arguing that Mr. Mamdani “has no record.”\n\n“It’s time to unite,” he said. “We have a city to save.”\n\nReporting was contributed byDana Rubinstein,Samantha Latson,Sean Piccoli,Molly Longman,Nate SchweberandAmogh Vaz.\n\nEmma G. Fitzsimmons is the City Hall bureau chief for The Times, covering Mayor Eric Adams and his administration.\n\nNicholas Fandos is a Times reporter covering New York politics and government.",
        "source_2": "A young left-wing candidate, Zohran Mamdani, is poised to become the Democratic nominee for New York mayor after delivering a stunning political upset.\n\nThe 33-year-old democratic socialist declared victory in the party's primary on Tuesday, defeating his main rival and political veteran Andrew Cuomo who previously served as state governor.\n\n\"Tonight we made history,\" Mamdani said in his victory speech. If elected, he would be the first Muslim and Indian American to lead the nation's largest city.\n\nCuomo, 67, was attempting to pull off a comeback after resigning from office in 2021 over a sexual harassment scandal. He congratulated his opponent for a \"really smart and great campaign\".\n\nThe primary in staunchly liberal New York is likely to determine who becomes mayor in November's election.\n\nThe contest was being watched as a litmus test for the Democratic Party as it seeks to hone its messaging after election losses last November that saw President Donald Trump's Republicans win the White House and both chambers in Congress.\n\nResults on Tuesday night showed Mamdani with a commanding lead, but falling short of the 50% threshold needed to win outright.\n\nCuomo's concession was unexpected because counting looks likely to continue next week under the ranked choice system, which allowed New Yorkers to pick up to five candidates in order of preference.\n\nThe former governor's loss marks the \"biggest upset in modern NYC history,\" Trip Yang, a political strategist, told the BBC.\n\n\"A massive win for Zohran Mamdani that shows that when Donald Trump is President, New York Democrats want to see their leaders fight with enthusiasm and courage, and that's what Zohran showed voters.\"\n\nIn an interview with the New York Times, Cuomo said he was still examining whether he would run in the general election in November on the independent line.\n\n\"I said he won the primary election,\" Cuomo told the outlet. \"I said I wanted to look at the numbers and the ranked-choice voting to decide about what to do in the future, because I'm also on an independent line.\"\n\nCuomo was seen as a moderate and the establishment favourite, known across the country after his governorship during the Covid pandemic.\n\nMamdani is a millennial outsider who was fairly unknown until recently.\n\nBorn in Uganda, his family moved to New York City when he was seven. He has posted one campaign video entirely in Urdu and mixed in Bollywood film clips. In another, he speaks Spanish.\n\nMamdani's strong support of Palestinians and criticism of Israel put him at odds with most of the Democratic establishment.\n\nHe went viral during his campaign for videos where he talked to New York voters who swung for Trump in the November election.\n\nHe asked what issues led them to cast their ballots for the Republican candidate and what it would take for them to swing Democrat.\n\nMamdani's platform includes free public buses, universal childcare, freezing rent in subsidised units, and city-run grocery stores - all paid for by new taxes on the rich.\n\n\"This is a city where one in four of its people are living in poverty, a city where 500,000 kids go to sleep hungry every night,\" he told the BBC at a recent event.\n\n\"And ultimately, it's a city that is in danger of losing that which it makes it so special.\"\n\nCongresswoman Alexandria Ocasio Cortez and Senator Bernie Sanders, also democratic socialists, endorsed Mamdani during his campaign.\n\nFollow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weeklyUS Politics Unspunnewsletter. Readers in the UK cansign up here. Those outside the UK cansign up here.\n\nThe chip giants will hand revenues to the US government in exchange for licences to export to China.\n\nTrump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.\n\nNo one was injured and no inmates escaped as the storm hit Nebraska State Penitentiary, the prison said.\n\nThe Canyon Fire, which began on Thursday afternoon, has blazed through nearly 5,000 acres in less than 24 hours.\n\nTrump says he will meet with the Russian leader in the \"great state of Alaska\".",
        "source_3": "Dark-horse socialist candidateZohran Mamdanistaged a stunning upset Tuesday night by knocking off formerGov. Andrew Cuomoin the Democratic mayoral primary.\n\n“Tonight we made history,” Mamdani told supporters at his victory party after midnight. “In the words of Nelson Mandela, ‘It always seems impossible until it is done.’ My friends, we have done it. I will be your Democratic nominee for the mayor of New York City.”\n\nThe 33-year-old Queens assemblyman defied polls and expectations as he notched a likely insurmountable 7-point lead over Cuomo, the three-term governor who hoped to make a political comeback after resigning in disgrace in 2021.\n\n“Tonight is his night. He deserved it, he won,” a seemingly shell-shocked Cuomo, 67, said as he conceded to Mamdani.\n\nThe first round of the ranked-choice voting contest had Mamdani ahead with 43.51% of votes, followed by Cuomo’s 36.42% and city Comptroller Brad Lander’s 11.31%, Board of Elections unofficial results show. Mamdani carried roughly 432,000 votes to Cuomo’s 362,000, the results show.\n\nThe state lawmaker didn’t crack 50% of votes, so the contest will still be decided July 1 once the other rounds of ranked-choice votes are calculated.\n\nBut the first-round totals still put the avowed Democratic socialist within sight of becoming New York City’s next mayor.\n\nCuomo concededhe lost the primary as he addressed his campaign’s watch party — and signaled he may not run in the November general election on an independent line, as widely assumed.\n\n“Tonight was not our night,” Cuomo said, as he praised Mamdani’s grassroots campaign, which mobilized young, far-left voters with catchy campaign promises and slogans focusing on affordability.\n\n“It’s affordability, stupid,” quipped longtime New York City political operative Kevin McCabe, in a reference to Bill Clinton, about the issue that decided the race.\n\nA win by Mamdani is bound to have sweeping impacts beyond the Big Apple and signal the rising power of the Democrats’ progressive wing, especially over aging party stalwarts such as Cuomo.\n\nHis near-insurmountable lead hints he could be replicating what his backer and fellow progressiveRep. Alexandria Ocasio-Cortezdid in 2018, when she ran as a charismatic outsider to topple entrenched Democrat Joe Crowley — only he did it across the whole city, a political veteran told The Post.\n\nCuomo could barely be seen actually on the campaign trail as he relied on his name recognition, backing of powerful unions and attacks against Mamdani’s thin legislative record and ample history of criticizing Israel.\n\nThe scandal-scarred ex-governor entered the race in March as the clear front-runner, but saw his polling lead steadily chipped away by Mamdani, who waged a social media-friendly campaign heavy on proposed freebies — which he plans to pay for by hiking taxes on billionaires and businesses.\n\n“He should’ve learned a lesson from the terrible, Rose Garden race that Joe Crowley ran against AOC. Like Crowley, Cuomo was arrogant and grossly underestimated his opponent,” said Democratic operative Ken Frydman.\n\nZohran’s parents gush over their son’s apparent victory. “He always ran for every election since middle school,” his dad said “We always knew he had something to say.”pic.twitter.com/sEuVMul2pE\n\nSources were baffled that Cuomo squandered a 40-point polling lead and that he only launched his field operation last week despite more than $25 million on hand between his own war chest and super PACs.\n\n“All the money in the world and you don’t know how to spend it,” said one Dem source close to the campaign.\n\nBillionaire former Mayor Michael Bloombergandhis allies, along with a swath of business leaders, funneled money into Cuomo’s campaign and a powerful super PAC — Fix the City — that bombarded New Yorkers with anti-Mamdani ads in the runup to the primary.\n\nCuomo’s comeback was also imperiled by progressives urging voters to “Don’t Rank Evil Andrew” — or DREAM — on their ballots.\n\nEven some moderate New Yorkers were wary about Cuomo — whose governorship was marked by bullying, cynical politicking and his utter inability to own up to mistakes, such as his handling of nursing home residents during the COVID-19 pandemic — and sought to elevate City Council Speaker Adrienne Adams instead.\n\nMamdani supporters sing “Goodbye” to Cuomo while waiting for Mamdani to take the stage.pic.twitter.com/9WPB1ZrOsa\n\nWhile Cuomo remained cloistered and aloof from voters, Mamdani closed his campaign by walking the length of Manhattan and making chummy joint appearances with Lander, his cross-endorser.\n\nHe ran an energetic campaign that regularly churned out slick videos and distilled his message into easy-to-digest proposals like a rent freeze and free buses.\n\nYounger voters who heavily skewed toward Mamdani came out in droves during early voting, while Cuomo appeared to bank on older voters turning up on Election Day itself.\n\nBut the weather didn’t cooperate as the hottest June day in New York City faced voters.\n\n“Andrew may be a victim of heat stroke,” quipped Bill Cunningham, a former staffer for Cuomo’s father, ex-Gov. Mario Cuomo.\n\nFor all the surprise, polls showed Mamdani’s sunny campaign creeping forward and gaining ground on Cuomo.\n\nHis positive polling prospects culminated in an Emerson College Polling/Pix 11/The Hill survey released Monday that showed him besting Cuomo after eight rounds of ranked-choice voting.\n\nMamdani still likely faces a tough general election in November. He’ll face incumbentMayor Eric Adams, who is running as an independent, along with Republican nominee Curtis Sliwa and independent Jim Walden.\n\nCuomo is also expected to potentially run as an independent.\n\nBut the Democratic source said Cuomo’s potential independent general election run is likely dead on arrival.\n\n“You can’t run a loser against a winner,” the source said.\n\nCuomo campaign adviser Frank Seddio, former chairman of the Brooklyn Democratic Party, acknowledged the former governor’s camp didn’t envision this vote.\n\n“I don’t believe we are winning this primary election,” he said, though he noted ranked-choice tabulations remain.\n\nSeddio said Cuomo will run in the general election on the Fight & Deliver ballot line.\n\n“We’re just transferring the race to the general election,” he told The Post.\n\nMamdani’s showing reignited hopes in Eric Adams’ camp that the incumbent mayor can mount a comeback of his own after his mayoralty was imperiled by a federal corruption case.\n\nAdams insiders believe the mayor carries a better chance for re-election against the socialist Mamdani than Cuomo.\n\n“He can,” an insider said of Adams’ prospects. “But it will have to be a perfect effort. And Cuomo will have to bow out.”\n\nAdditional reporting by Vaughn Golden and Carl Campanile"
    }
}