{
    "question": "How did messaging, coalition-building across neighborhoods, and ranked-choice dynamics shape Zohran Mamdani’s primary victory, and what might this signal about the future of Democratic politics in New York City?",
    "content": {
        "source_1": "Overnight, the political landscape of America’s largest city has been turned on its head.\n\nFor the Democratic establishment, waking up to the victory of Zohran Mamdani, a 33-year-old democratic socialist who defeated Andrew Cuomo in New York City’s mayoral primary on Tuesday, may be something of a shock.\n\nIt was also a vivid display of Democrats building power outside the traditional party establishment.\n\nMamdani, a Queens assemblyman, ran a welcoming campaign relentlessly focused on making the city more affordable for working- and middle-class people. He was cast by critics in the city’s establishment as too far left and without enough experience to be taken seriously. Voters felt differently. Tuesday night, Mamdani won not only in areas of the city like Brooklyn’s Park Slope known to be progressive strongholds. He also won in Harlem and in the Staten Island neighborhood of Port Richmond; in working-class areas of Queens like Ozone Park; he won even in some areas of the city with little progressive tradition to speak of, like Dyker Heights deep in south Brooklyn, in the Norwood area of the Bronx and way out in Jamaica Hills, near the Long Island border. “We have won because New Yorkers have stood up for a city they can afford,” Mamdani said. “A city where they can do more than just struggle.”\n\nThis coalition would once have been unthinkable. Mamdani appears to have built it by doing something too many Democrats in Washington seem to struggle with: telling voters what he believes and is willing to fight for, in asmany venuesas possible. He campaigned unapologetically on promises like freezing the rent for stabilized apartments and providing free buses and free child care. One turning point in the race, though, may have come when Mamdani, who is Muslim and of the left, and the city’s comptroller, Brad Lander, who is Jewish and of the city’s liberal base, struck a deal to endorse each other in the city’s ranked-choice primary. Other Democratic candidates followed.\n\nIt was a startlingly hopeful vision for Democratic voters, who are looking for reasons to hope.\n\nLander won upward of 11 percent of the first-choice primary vote; his endorsement of Mamdani will almost certainly help the assemblyman edge over the 50 percent threshold to victory in the final ranked-choice tally. Tuesday night, Lander, who had long hoped to be mayor himself, watched the returns with supporters at Atolye Venue & Bar, a club in an industrial area of Park Slope. When his campaign manager brought him the news of Mamdani’s victory, Lander shared it with those in the room, who broke out into cheers. Mamdani later gave his victory speech with Lander standing beside him, lifting his hand into the air. “I want to thank Brad Lander,” he said. “Together we have shown the power of the politics of the future.”\n\nWe are having trouble retrieving the article content.\n\nThank you for your patience while we verify access. If you are in Reader mode please exit andlog intoyour Times account, orsubscribefor all of The Times.\n\nThank you for your patience while we verify access.",
        "source_2": "Khaleda Rahman is Newsweek's National Correspondent based in London, UK. Her focus is reporting on education and national news. Khaleda joined Newsweek in 2019 and had previously worked at the MailOnline in London, New York and Sydney. She is a graduate of University College London. Languages: English. You can get in touch with Khaleda by emailingk.rahman@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nZohran Mamdani's win in New York City's Democratic mayoral primary is more than just a stunning political upset.\n\nA self-described democratic socialist who ran on taxing the rich and making the city affordable, Mamdani defeated disgraced former governorAndrew Cuomo, a well-funded, familiar and powerful figure backed by billionaire donors and establishmentDemocratsalike.\n\nMamdani took such a commanding lead over Cuomo on Tuesday that the former governor, who was seeking a comeback after resigning in disgrace over a sexual harassment scandal, conceded the race early. The ultimate outcome may not be known for days due to the city's ranked choice voting system.\n\nHe will now face off against incumbent mayor Eric Adams, who is running as an independent in November's election—and Cuomo could still reenter the race.\n\nStill, Mamdani, a progressive upstart with a history of pro-Palestinian activism, is on course to become the first Muslim mayor of the nation's largest city.\n\nHis victory is sure to reverberate through theDemocratic Partyat a time when it remains ideologically divided about its future after losing the White House in November.\n\n\"Even though it's a Democratic primary in New York City, with a very progressive base and an even more progressive primary electorate, I'm still struck by how far left Democrats seem willing to go at the ballot box,\" Grant Davis Reeher, a professor of political science at Syracuse University, toldNewsweek.\n\n\"If this is where the energy of the party is, it leaves me questioning how Democrats will re-establish dominance at the national level. I would expect Democrats to retake the House in 2026, almost as an automatic, but this result suggests a real question for the presidential election cycle in 2028.\"\n\nCostas Panagopoulos, a professor of political science at Northeastern University, toldNewsweekthat Mamdani's victory \"shows just how influential voters at the outer edges of the ideological spectrum are in contemporary American primary elections.\"\n\nHe added that while the mayoral race is far from over, progressives \"have made their voices heard in New York City, reminding everyone it can be perilous to overlook or dismiss these voters too easily.\"\n\nMamdani's triumph is \"a confirmation that progressive politics, when pursued with discipline, vision and vigor, can resonate broadly – even in a city known for its entrenched power structures,\" said Bhaskar Sunkara, president of progressive politics magazineThe Nation, in an opinion piece forThe Guardian.\n\nNational Democrats will also likely look to Mamdani's winning strategy as they try to win back younger voters who abandoned them in November's election.\n\nPollsterNate Silverwrote in a post on his Silver Bulletin website that it shows how the \"aging Democratic establishment should probably be put out to pasture.\"\n\nHe wrote: \"If you want to inspire younger voters, nominate younger candidates. Mamdani, at age 33, is literally half Cuomo's age: the former governor is 67.\"\n\nMamdani \"thoroughly earned the win, and Cuomo and the Democratic establishment thoroughly earned the loss,\" Silver added. \"And even if they finally take the hint, generational turnover in the Democratic Party is coming whether they like it or not.\"\n\nDavid Hogg,who has clashed with Democratic National Committee leadershipover his plan to raise money for young progressive candidates challenging Democratic incumbents, said on X that Mamdani's campaign \"constantly grows in size in person and virtually bc people believe the message so much this share it for free and get others to join in. People want something to believe in & for many Zohran was the first Democrat who gave them that, post 2024.\"\n\nHis victory shows \"what can happen when a candidate runs on a platform filled with policy proposals to improve the lives of voters in tangible ways,\" Jonathan Nagler, a professor in the Department of Politics at New York University, toldNewsweek.\n\nHis platform focused on freezing rent, building affordable housing, free buses, free child care, a higher minimum wage and more, mostly paid for by new taxes on the rich.\n\nPablo O'Hana, a political advisor and campaign strategist who worked on former vice presidentKamala Harris' failed presidential campaign last year, said Mamdani's win \"is proof\" that progressive ideas can win elections.\n\nMamdani \"speaks the language of renters, immigrants and low-income workers – not in abstract policy terms, but with urgency and clarity,\" O'Hana wrote in an opinion piece forThe Independentnewspaper.\n\n\"Voters can understand how something as basic as free buses or a rent-freeze will provide a direct benefit to them,\" Nagler said.\n\nHe added that Mamdani's win \"could motivate the Democratic Party to campaign more on core economic issues. But they will have to decide whether to campaign on issues that are basic economic transfers or subsidies (such as free buses) or issues that involve heavier-handed regulation (such as rent-freezes).\"\n\nBut Thomas Gift, the director of the Centre on U.S. Politics at University College London, said Mamdani's victory could prove to be short-lived.\n\n\"Mamdani's politics resonate with a relatively narrow segment of Democratic elites, which may be enough to win a New York City primary but is likely to face stiffer competition in a general election,\" he toldNewsweek.\"Self-styled socialists always have a ceiling of support.\"\n\nGift added that Mamdani was also \"fortunate to face a scandal-plagued primary challenger whom many New Yorkers were eager to cast aside—yet again.\"\n\nMamdani's success also came despite his defiant stance against Israel, which led toaccusations of antisemitismthat he refuted.\n\n\"In a city with more Jewish residents than Tel Aviv, this would typically be politically suicidal,\" O'Hana wrote. \"But Mamdani has made a sharp distinction between opposing Israeli government policy and antisemitism – a feat that seems to have eluded practically every left-wing politician on the planet.\"\n\nMargaret DeReus, the executive director of the nonprofit IMEU Policy Project, said in a statement toNewsweekthat not only did Mamdani \"run a progressive campaign to lift up working-class New Yorkers of every race and in every borough, he stood up for Palestinian rights despite relentless attacks.\n\n\"He understands that voters want to see their tax dollars go toward making housing, transportation, healthcare, and education affordable — not sending weapons for Israel to kill Palestinians. This is a winning message for Democrats—in New York City and around the country.\"\n\nUpdate 6/26/25, 4 a.m ET: This article has been update to add additional comments.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nNewsweek is committed to journalism that's factual and fair.\n\nHold us accountable and submit your rating of this article on the meter.\n\nKhaleda Rahman is Newsweek's National Correspondent based in London, UK. Her focus is reporting on education and national news. Khaleda joined Newsweek in 2019 and had previously worked at the MailOnline in London, New York and Sydney. She is a graduate of University College London. Languages: English. You can get in touch with Khaleda by emailingk.rahman@newsweek.com\n\nKhaleda Rahman is Newsweek's National Correspondent based in London, UK. Her focus is reporting on education and national news. Khaleda joined Newsweek in 2019 and had previously worked at the MailOnline in London, New York and Sydney. She is a graduate of University College London. Languages: English. You can get in touch with Khaleda by emailingk.rahman@newsweek.com\n\nKhaleda Rahman is Newsweek's National Correspondent based in London, UK. Her focus is reporting on education and national news. Khaleda                                    ...Read more",
        "source_3": "A Democratic primary election for mayorthat offered no good optionsmanaged to deliver the worst of all possible outcomes.\n\nA nepo baby who is a socialist antisemitecame storming from behindto grab the inside track to City Hall.\n\nWhen the final tally comes in, Zohran Mamdani’s all-but-certain win will mark a comeback for the ages.\n\nA poll had him at 1% in February and no poll had him in first place.\n\nHe rose by capturing the imagination and expressing the grievances of young people who feel they are being priced out of New York.\n\nHe was up against a large, lackluster field and delivered a strong social media presence where he often seemed to be having fun.\n\nHe said from the beginning his campaign was about affordability, and he’s right — but not in the way he intended.\n\nSimilarly, his refusal to acknowledge that Israel is the rightful homeland of Jews is a key plank in what can fairly be deemed a hostile view of the lone Jewish state.\n\nHe supports the BDS movement and refuses to condemn the “Globalize the intifada” movement, which is abouttargeting Jews around the world.\n\nOn the way to his stunning victory, Mamdani hasput a dagger in the political career of Andrew Cuomo, whose results so far have dramatically underperformed expectations and poll predictions.\n\nBy clicking above you agree to theTerms of UseandPrivacy Policy.\n\nThe former governor offered himself as a pragmatic progressive, but it was his history and personality that sank him more than his policies.\n\nCuomo ducked most candidate forums and his public appearances were often described as perfunctory: Give a speech, shake a few hands, get back in the car.\n\nHis failure to connect was self-inflicted. The fact that he never expressed any sense of regret for the nursing home deaths during COVID and the sexual harassment allegations from a dozen women added to the sense that he was not fully committed to winning back those whom he had disappointed.\n\nThe outcome, although not yet final because of the ranked-choice process, is already sending shock waves through the national Democratic Party.\n\nIt proves beyond doubt that the far left remains not only alive, but dominant. So much for any moderation in the Age of Trump.\n\nAOC and Bernie Sanders, who backed Mamdani aspart of their anti-oligarch tour, emerge as big winners and agenda setters for the party.\n\nMamdani is a kindred soul, and his promise of free stuff — buses, child care, etc. — is consistent with the socialist playbook of eating the rich.\n\nBreaking news: The rich are already leaving the city because of policies not nearly as radical as his, along with the downward spiral of the quality of life.\n\nAlthough the ranked-choice process still has to play out in the coming week, there’s little chance that Cuomo turns the tables. He’s trailing by 7 points in the straight-up voting, and Mamdani has secured most of the second and third choices of the other top candidates in the complicated counting process.\n\nHe’s almost certain to come away with a solid majority when the process concludes next week, making the two-term, 33-year-old Queens assemblyman the party’s official nominee.\n\nThere’s still a general election in November, of course, wherethe incumbent, Eric Adams, will be on the ballot as an independent, as will Republican Curtis Sliwa and other candidates.\n\nOne question is whether ­Cuomo will mount an outsider run on a ballot line he created just for this situation.\n\nAs it stands now, that seems unlikely. Four years after he left Albany in disgrace, the former governor looks to be out of gas and out of favor.\n\nEven before the polls opened Tuesday, insiders were whispering about a campaign that lacked energy and conviction.\n\nCuomo never got in the groove, seemingly viewing the mayoralty as a consolation prize. He was the loudest voice in pledging to fight President Trump, which didn’t catch fire as a theme.\n\nHe even promised in one interview to “spend eight years in Washington” fighting the president.\n\nIt looks now as if he’ll have all the free time in the world to do that."
    }
}