{
    "question": "What are the possible short- and long-term consequences for Syria’s security and its religious communities after an ISIS splinter cell claimed responsibility for the church bombing that killed 25 and injured 63?",
    "content": {
        "source_1": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nA suicide bomber in Syria opened fire then detonated an explosive vest inside a Greek Orthodox church filled with people praying on Sunday, killing at least 22 and wounding 63 others, state media reported. (AP Video: Ghaith Alsayed/Abdel Rahman Shaheen)\n\nSyrian citizens and security forces inspect the damage inside Mar Elias church where a suicide bomber detonated himself in Dweil’a in the outskirts of Damascus, Syria, Sunday June 22, 2025. (AP Photo/Omar Sanadiki)\n\nSyrian gather inside Mar Elias church where a suicide bomber detonated himself in Dweil’a in the outskirts of Damascus, Syria, June 22, 2025. (AP Photo/Omar Sanadiki)\n\nIn this photo released by the Syrian official news agency SANA, a Civil Defence worker inspects the damage inside Mar Elias church where a suicide bomber detonated himself in Dweil’a in the outskirts of Damascus, Syria, Sunday June 22, 2025. (SANA via AP)\n\nIn this photo released by the Syrian official news agency SANA, journalists and Civil Defence workers inspect the damage inside Mar Elias church where a suicide bomber detonated himself in Dweil’a in the outskirts of Damascus, Syria, Sunday June 22, 2025. (SANA via AP)\n\nThis is a locator map for Syria with its capital, Damascus. (AP Photo)\n\nDWEIL’A, Syria (AP) — A suicide bomber in Syria opened fire then detonated an explosive vest inside a Greek Orthodox church filled with people praying on Sunday, killing at least 22 and wounding 63 others, state media reported.\n\nThe attack took place in Dweil’a on the outskirts of Damascus inside the Mar Elias Church, according to state media SANA, citing the Health Ministry for the toll of dead and wounded. Britain-based war monitor the Syrian Observatory for Human Rights said there were at least 19 peopled killed and dozens wounded, but did not give exact numbers. Some local media reported that children were among the casualties.\n\nSyrian gather inside Mar Elias church where a suicide bomber detonated himself in Dweil’a in the outskirts of Damascus, Syria, June 22, 2025. (AP Photo/Omar Sanadiki)\n\nThe attack on the church was the first of its kind in Syria in years, and comes as Damascus under its de facto Islamist rule is trying to win the support of minorities. As President Ahmad al-Sharaa struggles to exert authority across the country, there have been concerns about the presence of sleeper cells of extremist groups in the war-torn country.\n\nNo group immediately claimed responsibility Sunday. Syrian Interior Ministry spokesman Noureddine Al-Baba said in a news conference that their preliminary investigation points to the extremist Islamic State group. The ministry said one gunmen entered the church, fired at the people there before detonating himself with an explosives vest, echoing some witness testimonies.\n\n“The security of places of worship is a red line,” he said, adding that IS and remaining members of the ousted Assad government are trying to destabilize Syria.\n\nSyrian Information Minister Hamza Mostafa condemned the attack, calling it a terrorist attack.\n\n“This cowardly act goes against the civic values that brings us together,” he said on X. “We will not back down from our commitment to equal citizenship … and we also affirm the state’s pledge to exert all its efforts to combat criminal organizations and to protect society from all attacks threatening its safety.”\n\nWitnesses said the gunman with his face covered entered and fired at the people. When a crowd charged at him to remove him from the church, he detonated his explosives at the entrance.\n\nSyria’s Social Affairs and Labor Minister Hind Kabawat, the country’s Christian and female minister, met with the clergy at the church in the evening to express her condolences.\n\nThis is a locator map for Syria with its capital, Damascus. (AP Photo)\n\n“People were praying safely under the eyes of God,” said Father Fadi Ghattas, who said he saw at least 20 people killed with his own eyes. “There were 350 people praying at the church.”\n\nHowever, Meletius Shahati, a church priest, said there was a second gunman who shot at the church door before the other person detonated himself.\n\nIssam Nasr who was praying at the church said he saw people “blown to bits.”\n\n“We have never held a knife in our lives. All we ever carried were our prayers,” he said.\n\nSecurity forces and first-responders rushed to the church. Panicked survivors wailed, as one lady fell to her knees and burst into tears. A photo circulated by Syrian state media SANA showed the church’s pews covered in debris and blood.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "source_2": "A little-known Islamist group has claimed responsibility for a Sunday bombing that killed 25 Christians and injured 63 more. It also disputes government arrest claims.\n\nOn Tuesday, theIslamic State (IS)splinter group Saraya Ansar al-Sunna (Brigade of Sunni Supporters) claimed responsibility for thedeadly Sunday bombing of a Greek Orthodox Church in the Syrian capital, Damascus.\n\nThe incident happened when a member of the group blew himself up at the doors of the Saint Elias Church in the Christian-Sunni Muslim neighborhood of al-Dweilaa during Sunday mass, killing 25 people and injuring another 63.\n\nThe groupreleased a social media post claiming the attack was triggered by unspecified \"provocations by Christians in Damascus.\"\n\nIn March, a dispute took place at the church when residents complained about Islamic chants being blasted from a car in front of the building.\n\nThe group is said to have been behindvarious sectarian threats and attackstargeting Alawites, Christians, Druze and Shiite Muslims. It is also accused of involvement in March massacres that rights groups say killed as many as 1,700 mostly Alawite civilians.\n\nOn Monday,Syria'snew governmentclaimed that IS had been behind the attack and announced that it had \"dismantled\" the cell responsible for it. Authorities said they seized explosives, suicide vests, mines and ammunition during raids that resulted in six arrests and two suspects being shot dead.\n\nSyria's Interior Ministry said its investigation into the matter was ongoing and that all perpetrators would be brought to justice.\n\nSaraya Ansar al-Sunna promptly took to the messaging app Telegram to reject the government's claim, calling it, \"untrue, fabricated.\"\n\nSaraya Ansar al-Sunna, which was formed after the fall of Syrian PresidentBashar Assad, warned, \"What is coming will not give you respite… our soldiers... are fully prepared.\"\n\nSunday's attack was the first in a Christian church since the start of Syria's civil war in 2011, according to the UK-based group Syrian Observatory for Human Rights, which has also been targeted by the group.\n\nPope Leo XIV, the head of the Roman Catholic Church, expressed his deep sorrow over the incident on Tuesday. A statement issued by the Vatican called for peace in Syria.\n\nFurther, the statement said Leo was praying for those injured, as well as for the souls of those killed in the attack. Prayers were also offered to God that he provide hope and healing for the Syrian people.\n\nThough10% of Syria's population was once Christian, that number has dropped considerably as a result of war and persecution. Those Christians who remain tend to live in mixed communities in the major cities of Damascus and Aleppo.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 video",
        "source_3": "'The Big Weekend Show' discusses an ISIS suicide bomber reportedly killing churchgoers in Damascus, Syria.\n\nTheIslamic Stateis believed to be behind a deadly suicide bombing that happened at a Greek Orthodox church in Syria on Sunday.\n\nAt least 22 people were killed, and 63 others were injured in the attack that took place at the Mar Elias Church in Dweil'a, located on the outskirts of Damascus. It reportedly began while people were praying. The perpetrator first opened fire on the worshipers, before detonating himself.\n\nWhile no group immediately claimed responsibility for the attack, Syrian Interior Ministry spokesman Noureddine Al-Baba suggested ISIS as a likely culprit following a preliminary investigation.\n\n\"The security of places of worship is a red line,\" Al-Baba said further, castigating ISIS and what remains of the former government of Ba'athist dictator Bashar al-Assad as actors trying todestabilize Syria.\n\nSUICIDE BOMBER STRIKES SYRIAN CHURCH NEAR DAMASCUS DURING MASS\n\nCivilians and security forces inspect bombing damage inside Mar Elias church in Dweil'a, on the outskirts of Damascus, Syria, on June 22, 2025.(AP Photo/Omar Sanadiki)\n\nThe country's foreign ministry echoed Al-Baba, describing the attack as \"a desperate attempt to undermine national coexistence and to destabilize the country.\"\n\nSTATE DEPARTMENT ISSUES WORLDWIDE CAUTION FOR US TRAVELERS FOLLOWING TRUMP'S IRAN STRIKES\n\nA Civil Defence worker inspects damage inside the Mar Elias church in Dweil'a on June 22, 2025.(SANA via AP)\n\nThe attack drew international condemnation. \"These terrible acts of cowardice have no place in the new tapestry of integrated tolerance and inclusion that Syrians are weaving,\" U.S. Ambassador to Turkey and Special Envoy for Syria Tom Barrack wrote on X.\"We continue to support the Syrian government as it fights against those who are seeking to create instability and fear in their country and the broader region,\" the post concluded.\n\nPeople gather outside the Mar Elias church in Dweil'a following the suicide bombing on June 22, 2025.(BAKR ALKASEM/AFP via Getty Images)\n\nThe attack comes amid a time of heightened political unrest in the notoriously volatileMiddle East– less than 24 hours after the U.S. launched airstrikes on three of Iran's top nuclear facilities.\n\nIsrael launched a series of similar attacks, including attacks on the Iranian capital, Tehran, in the weeks prior.\n\nKyle Schmidbauer is a production assistant for Fox News Digital. A graduate of Montclair State University inNew Jersey, he joined Fox in 2022.\n\nFox News' Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.\"\n\nBy entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time."
    }
}