{
    "question": "How might the House’s 344-79 vote to halt impeachment over President Trump’s Iran strikes without prior congressional approval shape future efforts by Congress to assert its war powers and check executive military action?",
    "content": {
        "source_1": "PresidentDonald Trumplet it fly in a wild rant about Rep.Alexandria Ocasio-Cortez(D-NY) on Tuesday that also targeted “Cryin’Chuck Schumer,” Rep.Jasmine Crockett(D-TX), and Rep.Ilhan Omar(D-MN).\n\n“Stupid AOC, Alexandria Ocasio-Cortez, one of the ‘dumbest’ people in Congress, is now calling for my Impeachment, despite the fact that the Crooked and Corrupt Democrats have already done that twice before. The reason for her ‘rantings’ is all of the Victories that the U.S.A. has had under the Trump Administration,” began Trump in aposton Truth Social. “The Democrats aren’t used to WINNING, and she can’t stand the concept of our Country being successful again. When we examine her Test Scores, we will find out that she is NOT qualified for office but, nevertheless, far more qualified than Crockett, who is a seriously Low IQ individual, or Ilhan Omar, who does nothing but complain about our Country, yet the Failed Country that she comes from doesn’t have a Government, is drenched in Crime and Poverty, and is rated one of the WORST in the World, if it’s even rated at all.”\n\n“How dare ‘The Mouse’ tells us how to run the United States of America! We’re just now coming back from that Radical Left experiment with Sleepy Joe, Kamala, and ‘THE AUTOPEN,’ in charge. What a disaster it was! AOC should be forced to take the Cognitive Test that I just completed at Walter Reed Medical Center, as part of my Physical,” continued the commander-in-chief. “As the Doctor in charge said, ‘President Trump ACED it,’ meaning, I got every answer right. Instead of her constant complaining, Alexandria should go back home to Queens, where I was also brought up, and straighten out her filthy, disgusting, crime ridden streets, in the District she ‘represents,’ and which she never goes to anymore.”\n\n“She better start worrying about her own Primary, before she thinks about beating our Great Palestinian Senator, Cryin’ Chuck Schumer, whose career is definitely on very thin ice! She and her Democrat friends have just hit the Lowest Poll Numbers in Congressional History, so go ahead and try Impeaching me, again, MAKE MY DAY!” he concluded.\n\nOcasio-Cortezsubmitted on Saturday that Trump’s decision to bomb three Iranian nuclear sites was ground for impeachment,arguingthat his “disastrous decision to bomb Iran without authorization is a grave violation of the Constitution and Congressional War Powers.”",
        "source_2": "Gabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nU.S. PresidentDonald Trumpchallenged Rep. Alexandria Ocasio-Cortez (D-NY) to try impeaching him, and said the democratic socialist should be more focused on keeping hold of her seat instead.\n\nOcasio-Cortez, also known as AOC, had saidTrump's ordering of strikes on Iran without congressional approval was grounds for his impeachment.\n\n\"She better start worrying about her own Primary, before she thinks about beating our Great Palestinian Senator, Cryin'Chuck Schumer, whose career is definitely on very thin ice!\" Trump said in a post on Truth Social.\n\n\"She and her Democrat friends have just hit the Lowest Poll Numbers in Congressional History, so go ahead and try Impeaching me, again, MAKE MY DAY!\"\n\nAOC fired back at Trump on X, formerly Twitter, on Tuesday afternoon saying, \"Mr. President, don't take your anger out on me - I'm just a silly girl. Take it out on whoever convinced you to betray the American people and our Constitution by illegally bombing Iran and dragging us into war. It only took you 5 months to break almost every promise you made.\"\n\nOn Saturday, the president announced strikes on Iran's nuclear facilities in Fordow, Natanz and Isfahan in response to the escalating conflict between Iran and Israel, a U.S. ally. On June 13,Israel struck Tehran, Iran's capital, and other cities to disrupt its nuclear capabilities, and Iran retaliated with strikes of its own, the majority of which were intercepted by Israeli defense systems.\n\nOver the past 24 hours, a U.S.-brokered ceasefirebetween Israel and Iran was announced by President Trump, following a 12-day conflict marked by U.S. airstrikes on Iranian nuclear sites and Iranian missile attacks on Israel and a U.S. base in Qatar. Despite the ceasefire, both nations have accused each other of violations, withcontinued missile exchanges and airstrikes casting doubt on the truce's stability.\n\nThe U.S. House voted decisively on Tuesday to halt an attempt to impeach President Trumpon a single charge of abuse of power,stemming from his decision to launch military strikes on Iran without prior congressional approval.\n\nThe unexpected move, initiated by Rep. Al Green of Texas, a Democrat, sparked minimal debate but revealed divisions within his party. While most Democrats sided withRepublicansto table the resolution, dozens supported Green's push. The final vote was 344-79.\n\nDemocratshave been split on Trump's response since Saturday's strikes. Ocasio-Cortezsaid this weekend's attack was \"disastrous,\"writing on X, formerlyTwitter, that it was \"a grave violation of the Constitution and Congressional War Powers.\"\n\nAOC wrote on X, \"The President's disastrous decision to bomb Iran without authorization is a grave violation of the Constitution and Congressional War Powers. He has impulsively risked launching a war that may ensnare us for generations. It is absolutely and clearly grounds for impeachment.\"\n\nKhanna, along withRepublicanRep.Thomas Massieof Kentucky, introduced a bipartisanWar Powers Resolutionlast Tuesday in a bid to curb Trump's ability to escalate tensions with Iran.\n\nRepresentativeRo Khanna, a California Democrat, also ripped Trump on X, writing that he \"struck Iran without any authorization ofCongress. We need to immediately return to DC and vote on @RepThomasMassie and my War Powers Resolution to prevent America from being dragged into another endless Middle East war.\"\n\nMassie, a longtime thorn in the president's side,and Trump continue to trade barbs on social media over his use of military action.\n\nSenatorJohn Fetterman, a Pennsylvania Democrat, came to Trump's side and wrote on X, \"As I've long maintained, this was the correct move by @POTUS. Iran is the world's leading sponsor of terrorism and cannot have nuclear capabilities. I'm grateful for and salute the finest military in the world.\"\n\nFetterman has been a strong supporter of Israel amid the ongoing war in Gaza and hasrecently called for the U.S.to provide the country with weaponry, intelligence and military assistance to strike Iran.\n\nGreen said ahead of Tuesday's vote,\"I take no delight in what I'm doing. I do this because no one person should have the power to take over 300 million people to walk without consulting with the Congress of the United States of America. I do this because I understand that the Constitution is going to be meaningful or it's going to be meaningless.\"\n\nRepresentative Marjorie Taylor Greene, a Republican from Georgia, also criticized Ocasio-Cortez, writing on X on Saturday: \"Shut up you pathetic little hypocrite. YOU fully supported our military and IC running the proxy war against Russia in Ukraine. And you VOTED to fund the Ukraine war under your President with dementia. You don't get to play anti-war and moral outrage anymore.\"\n\nOcasio-Cortezwrote on X on Saturday: \"The President's disastrous decision to bomb Iran without authorization is a grave violation of the Constitution and Congressional War Powers. He has impulsively risked launching a war that may ensnare us for generations. It is absolutely and clearly grounds for impeachment.\"\n\nHouse Speaker Mike Johnson, a Louisiana Republican, said Tuesday:\"Many respected constitutional experts argue that the War Powers Act is itself unconstitutional. I'm persuaded by that argument. They think it's a violation of the Article 2 powers of the commander in chief. I think that's right.\"\n\nDemocratic Rep. Ilhan Omar of Minnesota reposted a video of Johnson's remarks on X, and said,\"Imagine being in Congress and arguing against Congressional authority. They're ready to throw away their own war powers just so Trump can bomb whoever he wants with zero oversight. We've truly lost the plot.\"\n\nIt remains to be seen whether both sides willstick to the ceasefireas urged by Trump, paving the way for possible negotiations. Qatar is also discussing how to respond to what it described as abreach of its sovereigntyby Iran.\n\nUpdate: 6/24/25, 11:37 a.m. ET: This article was updated with new information and remarks.\n\nUpdate: 6/24/25, 12:12 p.m. ET: This article was updated with new information and remarks.\n\nUpdate: 6/24/25, 1:11 p.m. ET: This article was updated with new remarks.\n\nUpdate: 6/24/25, 2:45 p.m. ET: This article was updated with new information and remarks.\n\nUpdate: 6/24/25, 5:34 p.m. ET: This article was updated with new information and remarks.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nShane Croucher is a Breaking News Editor based in London, UK. He has previously overseen the My Turn, Fact Check and News teams, and was a Senior Reporter before that, mostly covering U.S. news and politics. Shane joined Newsweek in February 2018 from IBT UK where he held various editorial roles covering different beats, including general news, politics, economics, business, and property. He is a graduate of the University of Lincoln, England. Languages: English. You can reach Shane by emailing s.croucher@newsweek.com\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he directed daily publications in North and South Carolina. As an executive editor, Gabe led award-winning coverage of Charleston church shooter Dylan Roof's capture in 2015, along with coverage of the Alex Murdaugh double murder trial. He is a graduate of the University of North Carolina-Wilmington. You can get in touch with Gabe by emailing g.whisnant@newsweek.com. Find him on Twitter @GabeWhisnant.\n\nGabe Whisnant is a Breaking News Editor atNewsweekbased in North Carolina. Prior to joiningNewsweekin 2023, he                                    ...Read more",
        "source_3": "President Trump unloaded on his congressional rivals in a scathing social media post Tuesday morning, daring them to initiate impeachment proceedings against him for a third time.\n\n“So go ahead and try impeaching me again, MAKE MY DAY!” Trump seethed in a Truth Social tirade primarily targeting far-left “Squad” memberRep. Alexandria Ocasio-Cortez(D-NY), who called for the president to be impeached over US airstrikes in Iran last weekend.\n\nCalling the Queens rep “one of the ‘dumbest’ people in Congress,”Trump blasted Democrats as being unaccustomedto “WINNING,” and claimed the congresswoman “can’t stand the concept of our Country being successful again.”\n\nFor good measure, he took pointed swipes at other lefty Dems including Rep. Jasmine Crockett (D-Texas), “seriously a Low IQ individual,” and Rep. Ilhan Omar (D-Minn.), “who does nothing but complain about our country, yet the failed country she comes from doesn’t have a Government, is drenched in Crime and Poverty, and is rated one of the WORST in the world, if it’s even rated at all,” he said in a jab at her Somali background.\n\nHe took particular issue with AOC, whom he dubbed “The Mouse,” for her critique of the president’sbombing campaign against Iranian nuclear sites, which she called “a grave violation of the Constitution and Congressional War Powers” in her call for impeachment.\n\n“We’re just now coming back from that Radical Left experiment with Sleepy Joe, Kamala, and ‘THE AUTOPEN,’ in charge. What a disaster it was!” Trump fumed, suggesting she should be “forced” to take the same cognitive test he completed at Walter Reed National Military Medical Center as part of his physical, which he noted the doctor in charge said he “ACED.”\n\nHe also took aim at reports that AOCcould challenge Senate Minority Leader Chuck Schumer(D-NY) in the Democratic primary.\n\n“She better start worrying about her own Primary, before she thinks about beating our Great Palestinian Senator, Cryin’ Chuck Schumer, whose career is definitely on very thin ice!”\n\nTrump was in rare form Tuesday morning after thefragile cease-fire agreement he touted between Israel and Iranapparently fell apart, raging at both sides in the conflict to reporters, saying, “They don’t know what the f–k they’re doing.”"
    }
}