{
    "question": "What implications does Mamdani’s surge to a narrow ranked-choice lead—powered by Lander supporters’ second-choice rankings—have for campaign strategy and voter behavior in the NYC mayoral primary?",
    "content": {
        "source_1": "Nearly three thousand New Yorkers have contributed to multiple left-leaning candidates in a nod to ranked-choice voting.\n\nProgressive voters have donated to multiple left-leaning candidates in the Democratic primary.  | Cris Seda Chabrier/POLITICO\n\nNEW YORK — The campaign against ranking Andrew Cuomo for mayor — and supporting Mayor Eric Adams, in general — has been quietly playing out for months in New York City.\n\nA POLITICO analysis of campaign finance data shows progressive voters have been hedging their bets since the early days of the Democratic mayoral primary by donating to multiple left-leaning candidates. Their hope? Deny the moderate frontrunner Cuomo the Democratic primary and avoid the MAGA-curious incumbent Adams, who dropped out of the contest to run in the general election as an independent.\n\nPOLITICO pored over donations to top contenders in the primary, including contributions before the mayor exited the race, through early-June. The findings show nearly 3,000 New Yorkers gave to candidates like City Comptroller Brad Lander, state Assemblymember Zohran Mamdani, state Sen. Zellnor Myrie and City Council Speaker Adrienne Adams — but not to Cuomo or Eric Adams.\n\nThe contribution pattern is reminiscent of a strategy for ranked-choice voting that was initially popularized by the “Don’t Rank Eric or Andrew for Mayor” or DREAM campaign. In New York City primaries, voters are able to rank up to five candidates. The idea behind the slogan was to maximize the chances of left-leaning hopefuls, while minimizing the number of second-place votes going to Cuomo and Adams.\n\n“If you’re Brad, Zellnor, Zohran or Adrienne, the theory is: The more of us there are, the more energy people will feel and the more they will turn out to vote,” said Democratic strategist Jon Paul Lupo, who is not affiliated with any of the mayoral campaigns. “But the risk is that you have candidates who are too similar splitting votes and not amplifying them.”\n\nWith the mayor out of the race, New Yorkers for a Better New York Today,a super-PAC opposing Cuomo,changed the slogan to “Don’t Rank Evil Andrew for Mayor.”\n\nCuomo has maintained a solid lead with less than a week until the Tuesday primary, according to thelatest Marist surveyreleased Tuesday. And the field opposing him has only begun to embrace ranked choice voting. Adrienne Adams has resisted —urging supporters to rank a slate of candidates backed by the Working Families Party but declining to cross endorse— making efforts to win over her base of Black voters in Queens more difficult for the likes of Mamdani and Lander.\n\nMarist noted, however, that Mamdani has gained ground on Cuomo as the clear second-choice. And neighborhoods with the highest concentrations of multi-donors — progressive and vote-rich enclaves in Brooklyn and Manhattan — will play a deciding role in the race.\n\nOut of almost 72,150 donations from January 2024 to June 2025, POLITICO found 2,944 donors contributed to more than one candidate, excluding the mayor and the former governor, according to contribution data from the Campaign Finance Board. To figure out how many unique individual donors there were, POLITICO looked at each donor’s name and ZIP code.\n\nThe results showed multi-donors clustered in Park Slope, Gowanus and Prospect Heights in Brooklyn and on the Upper West Side and in Morningside Heights in Manhattan.\n\n“We need better people in charge, and I think just about anyone that isn’t one of those two schmucks would be better,” said Daniel Rothblatt, who lives on the Upper West Side and has donated to five candidates. Rothblatt has also printed roughly a thousand stickers for the DREAM campaign.\n\nIn interviews with POLITICO, multi-donors frequently cited Adams’ now-defunct criminal case and his cozying up to President Trump as the primary reasons for not supporting him. For Cuomo, donors felt his pandemic-era directive allowing Covid-positive patients into nursing homes, his handling of the MTA and his resignation as governor after 11 women accused him of sexual harassment disqualified him.\n\nAdams has maintained he committed no crime. And Cuomo’s team has said its Covid orders were consistent with federal guidelines. They have touted projects like the Second Avenue subway extension as proof of the former governor’s management chops. And Cuomo himself has denied allegations of sexual harassment.\n\nThe most common candidate to benefit from these multi-donors was Lander, who got money from 1,654 contributors. The longtime progressive has moderated some of his more left-leaning positions in the hopes of building a coalition broad enough to send him to Gracie Mansion — something ranked-choice voting encourages by incentivizing candidates to seek support in neighborhoods that might rank them second or third.\n\n“This is just further proof that Brad Lander has by far the widest coalition of support in the city — and he’s going to win on Tuesday,” spokesperson Dora Pekec said. “The reason is simple: Brad brings people together.”\n\nSo far, it hasn’t been paying off. The recent Marist poll found Lander ending the race in third place. And in the seventh round of voting, just under half of the comptroller’s support goes to Cuomo, whom he has spent months relentlessly attacking.\n\nBut since that poll was in the field, Lander has had a series of energizing moments that included a breakout debate performance and a dramatic showdown with federal immigration agents that resulted in his arrest. And earlier this month, he cross-endorsed Mamdani — potentially steering more votes to the democratic socialist.\n\nMamdani is much further ahead in the polls and received the second-highest share of multi-donors, with 1,296 contributions. He’s banking on expanding the electorate to include younger and Muslim voters, and has received endorsements from progressive standard bearers Rep. Alexandria Ocasio-Cortez and Sen. Bernie Sanders.\n\n“He’s also been clear that defeating the disgraced ex-governor requires a ranked choice strategy, so it’s heartening that so many of our donors have also contributed to other campaigns,” spokesperson Andrew Epstein said in a statement. “This is how you build a coalition to win.”\n\nMyrie, the state senator, received the third highest number of contributions from multi-donors at 1,294. He came in just ahead of Council Speaker Adrienne Adams — a sign that multi-donors do not necessarily translate to first-place rankings. Both candidates have been consistently polling in the low, single digits.\n\nMeanwhile, only 367 people donated to Adams or Cuomo along with one other candidate. The low number of multi-donors reflects that Democratic voters who rank Cuomo do not commonly rank a second-choice candidate, according to Marist.\n\nDespite POLITICO’s analysis showing an appetite for supporting multiple campaigns, the field chasing Cuomo has been unable to parlay that force into denying the former governor the ranked votes he needs to cross the 50 percent threshold. When Lander is eliminated after the sixth round of ranked-choice voting in the Marist poll, for example, almost half of his votes go to Cuomo despite the comptroller relentlessly attacking the former governor and cross endorsing Mamdani.\n\nBut the New York Working Families Party, which endorsed a ranked slate of candidates in the hopes of stopping Cuomo, said the multi-donor trend identified by POLITICO shows voters in the party’s strongholds are warming to the relatively new ranked-choice system.\n\n“We’ve specifically told donors that by donating to multiple campaigns you are resourcing the candidates who are aligned,” co-director Ana María Archila said. “And obviously this demonstrates to some extent that adaptation.”\n\nTo assess unique donors, POLITICO inspected unique pairings of a donor’s name and ZIP code. If a name differed slightly from a previous iteration, POLITICO programmatically assessed names’ similarity, including those with a similarity score of 90 or above, which had a 94 percent accuracy rate, on average. Any individuals who moved from one ZIP code to another during the contribution period are considered separate donors under this rubric.",
        "source_2": "Andrew Stanton is a Newsweek weekend reporter based in Maine. His role is reporting on U.S. politics and social issues. Andrew joined Newsweek in 2021 from The Boston Globe. He is a graduate of Emerson College. You can get in touch with Andrew by emailinga.stanton@newsweek.com. Languages: English.\n\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nZohran Mamdani's chances of beating former GovernorAndrew Cuomoin the New York City Democratic mayoral primary surged on Monday, just one day before primary day and after many New Yorkers voted early.\n\nMamdani, a state Assembly member, and Cuomo are viewed as the front-runners heading into Tuesday's primary to lead the country's largest city. Whoever wins the primary will be favored to win the general election in November, as New York remains a Democratic stronghold. Cuomo hasled most polls in the race, but Mamdani, a favorite among progressive voters, has gained traction in recent weeks.\n\nTwo betting markets—Polymarket and Kalshi—had Mamdani's chances of winning jump on Monday after Emerson College released a poll showing the progressive lawmaker with a slight lead. But the betting markets still gave the two leading candidates roughly an even shot at victory on Tuesday.\n\nMamdani briefly overtook Cuomo as the favorite in both markets at about 10 a.m. ET on Monday, but later in the morning, Cuomo regained a slight advantage. Traders were split on who they view as the candidate most likely to prevail on Tuesday.\n\nAs of noon ET, Polymarket favored Cuomo 53 percent to 47 percent compared to 76 percent to 23 percent on Sunday.\n\nKalshi favored Cuomo 52-46 compared to 77-24 on Sunday. The percentages are based on individual markets per candidate, so they may not equate to 100 percent.\n\nRich Azzopardi, a spokesperson for Cuomo, toldNewsweekthat the jump was driven by the Emerson poll, which he said was an \"outlier.\"\n\n\"Every other credible poll in this election, including two released last week, has shown Governor Cuomo with a double-digit lead, which is exactly where this election will end tomorrow. Between now and then, we will continue to fight for every vote like he will fight for every New Yorker as mayor,\" Azzopardi said.\n\nNewsweekreached out to the Mamdani campaign for comment via email.\n\nThe Emerson poll showed Cuomo with a slight lead on the first round of voting—36.4 percent to Mamdani's 33.7 percent. But after eight rounds of ranked choice, Mamdani consolidated support from other candidates to have a slight lead, 51.8 percent to Cuomo's 48.2 percent.\n\nThe poll surveyed 833 Democratic primary voters from June 18-20 and had a margin of error of plus or minus 3.3 percentage points.\n\nMitchell Moss, Henry Hart Rice Professor of Urban Policy and Planning at New York University, toldNewsweekon Monday he believes the election is \"too complicated for betting odds to predict,\" as there are \"too many unknowns.\"\n\nPolitical commentator Chuck Todd, on X, formerly Twitter:\"I'm not a big believer in trying to predict news events/elections via these betting markets as they feel like nothing more than folks taking one new piece of info and over-betting its meaning. If I thought there was good public polling, I might think differently, but the biggest concern I have in these news betting markets is the flawed public data that influences them. Doesn't mean this doesn't turn out right, but it's simply more wishing or guessing or gambling than actual insight imo.\"\n\nLakshya Jain of Split Ticket, about the Emerson poll on X:\"On balance, with no other evidence, that's enough new data to say the NYC Dem mayoral nomination is a pure tossup. Wow.\"\n\nSenator Bernie Sanders, a Vermont independent, endorsed Mamdani last week:\"At this dangerous moment in history, status quo politics isn't good enough. We need new leadership that is prepared to stand up to powerful corporate interests & fight for the working class. @ZohranKMamdani is providing that vision. He is the best choice for NYC mayor.\"\n\nFormer New York City Mayor Michael Bloomberg, who endorsed Cuomo on X this month:\"I care deeply about the future of our city, and since leaving office, it has been difficult to watch its struggles, especially since the pandemic. In sizing up the field in the race for mayor, there is one candidate whose management experience and government know-how stand above the others: @andrewcuomo.\"\n\nWhile many New Yorkers voted early, others will head to the polls on Tuesday. Whichever candidate prevails will face off against aRepublicanand independent Mayor Eric Adams in November.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nNewsweek is committed to journalism that is factual and fair\n\nWe value your input and encourage you to rate this article.\n\nAndrew Stanton is a Newsweek weekend reporter based in Maine. His role is reporting on U.S. politics and social issues. Andrew joined Newsweek in 2021 from The Boston Globe. He is a graduate of Emerson College. You can get in touch with Andrew by emailinga.stanton@newsweek.com. Languages: English.\n\nAndrew Stanton is a Newsweek weekend reporter based in Maine. His role is reporting on U.S. politics and social issues. Andrew joined Newsweek in 2021 from The Boston Globe. He is a graduate of Emerson College. You can get in touch with Andrew by emailinga.stanton@newsweek.com. Languages: English.\n\nAndrew Stanton is a Newsweek weekend reporter based in Maine. His role is reporting on U.S. politics and social issues.                                    ...Read more",
        "source_3": "Lefty upstart Zohran Mamdani has leapfrogged over former Gov. Andrew Cuomo in the city’s ranked choice Democratic primary for mayor, according to a stunning new poll released Monday.\n\nIn its hypothetical initial round of voting, Cuomo’s lead shrinks to 3 percentage points, with 35% of likely Democratic voters supporting him compared to 32% for Mamdani and 13% for city Comptroller Brad Lander, the Emerson College Polling/Pix 11/The Hill survey found.\n\nCity Council Speaker Adrienne Adams follows with 8%, Scott Stringer 3% and 5% split between candidates Zellnor Myrie, Whitney Tilson, Jessica Ramos and Michael Blake, with another 4% undecided.\n\nBut since no one garners the more than 50% of the vote needed to win outright, the ranked choice system kicks in. That means that even if a voter’s first choice is eliminated in successive rounds of calculations, their other picks could still be in the mix and emerge as the eventual overall winner.\n\nMamdani finally surpasses Cuomo in the eighth round of the simulated ranked choice voting — 51.8% to 48.2% — in the latest poll conducted June 18-20.\n\n“Over five months, Mamdani’s support has surged from 1% to 32%, while Cuomo finishes near where he began,” said Spencer Kimball, executive director of Emerson College Polling.\n\n“In the ranked-choice simulation, Mamdani gains 18 points compared to Cuomo’s 12, putting him ahead in the final round for the first time in an Emerson poll.”\n\nCuomo had led Mamdani by 12 points in the initial ballot in the Emersonpoll last monthand still finished up 8 points ahead of Mamdani in the 10th round of ranked choice voting at the time — 54% to 46%.\n\nMamdani has Lander’s voters to thank for his surge in the new poll.\n\nCuomo has a 1 percentage-point lead — 40.5% to 39.4% in the seventh round — when Lander is eliminated with 20% of the vote.\n\nMost of Lander’s voters then switch to Mamdani instead of Cuomo in round eight — putting the Democratic socialist Queens assemblyman up by 3.6 percentage points.\n\nLandercross-endorsedMamdani as his preferred candidate if he himself does not prevail. The left-wing Working Families Party also urged voters not to rank Cuomo.\n\nOther polls, including a Marist College Institute for Public Opinionsurvey released last week, show Cuomo winning but Mamdani closing ground.\n\nThe Emerson College poll asked voters if they have already cast their ballots during early voting or are waiting to vote on primary day, Tuesday.\n\nVoters who have already cast their ballots during the early voting period have broken for Mamdani,who holds a 10-point lead over Cuomo, 41% to 31%.\n\nCuomo leads Mamdani 36% to 31% among voters who plan to vote Tuesday.\n\nThere are big differences between the men by age and race.\n\nVoters under 50 back Mamdani by a 2-to-1 margin, while Cuomo leads among Dems ages 50 to 59 by 63% to 37% and those over age 60 by 56% to 44%.\n\nBut Mamdani leads among white voters 61% to 39% and among Asian voters 79% to 21%. The Uganda-born Mamdani is Indian-American or of South Asian descent.\n\nCuomo leads Mamdani among voters without a four-year college degree 61% to 39%, whileMamdani leads Cuomo among college-educated voters 62% to 38%.\n\nMen support Mamdani 56% to 44%, while women lean toward Cuomo 52% to 48%.\n\nThe new ranked choice poll of 729 likely Dem voters has a margin of error of plus or minus 3.6 percentage points, which means the race is up for grabs.\n\nEmerson College conducted the survey by contacting voters by text on their mobile phones and by landline robocalls along with an online panel of voters.\n\nIn the last poll before the 2021 Democratic primary for mayor, the Emerson College poll hadEric Adams leadingKathryn Garcia 52% to 48%. Adams won by less than 1 percentage point.\n\nThe Cuomo camp dismissed the Emerson College survey as off the mark.\n\n“This is an outlier: Every other credible poll in this election — including two released last week — has shown Governor Cuomo with a double digit lead, which is exactly where this election will end tomorrow,” said Cuomo campaign spokesman Rich Azzopardi.\n\n“Between now and then we will continue to fight for every vote like he will fight for every New Yorker as Mayor.”\n\nMeanwhile, the group Fix The City, a pro-Cuomo Super PAC, released its own poll claiming the ex-governor easily wins the ranked choice primary, capturing 52% of the vote in the 7th round to 28% for Mamdani and 20% for Adrienne Adams."
    }
}