{
    "question": "Based on the provided evidence, answer the following question: A 17-year-old boy comes to the emergency department because of a 3-day history of pain in his left wrist. That morning the pain increased and he started to have chills and malaise. Last week he had self-resolving left knee pain. He is otherwise healthy and has not had any trauma to the wrist. He recently returned from a camping trip to Minnesota. He is sexually active with one female partner, who uses a diaphragm for contraception. His temperature is 37.7В°C (99.9В°F). Examination shows several painless violaceous vesiculopustular lesions on the dorsum of both wrists and hands; two lesions are present on the left palm. There is swelling and erythema of the left wrist with severe tenderness to palpation and passive movement. What is the most likely diagnosis?. If there are multiple answers, separate them with commas. In your explanation, point out what is correct and incorrect in the evidence.",
    "content": {
        "source_1": "The clinical presentation in this 17-year-old boy—3-day history of left wrist pain that acutely intensified with the onset of chills and malaise, antecedent self-resolving left knee pain one week prior, absence of trauma, and low-grade fever of 37.7°C (99.9°F)—is characteristic of an evolving septic monoarthritis following migratory arthralgia. Examination demonstrating swelling and erythema of the left wrist with severe tenderness to palpation and passive movement localizes inflammation to the joint, supporting purulent synovitis typical of gonococcal septic arthritis. Concurrent cutaneous findings of several painless violaceous vesiculopustular lesions on the dorsum of both wrists and hands, with two lesions on the left palm, further align with the dermatologic manifestations commonly observed in gonococcal disease. Although recent camping in Minnesota raises consideration of tick-borne illness, the absence of trauma and the combination of migratory joint symptoms and vesiculopustular lesions in a sexually active adolescent whose partner uses a diaphragm—an approach that does not protect against sexually transmitted infections—more strongly supports gonococcal joint infection. The most likely diagnosis is gonococcal arthritis.",
        "source_2": "This case aligns with the syndrome-level construct of disseminated gonococcal infection (DGI), defined by a constellation of systemic symptoms and characteristic dermatologic and musculoskeletal involvement. A 17-year-old boy presents with a 3-day history of left wrist pain that escalated that morning coincident with chills and malaise; he had self-resolving left knee pain last week, is otherwise healthy without wrist trauma, and is sexually active with a female partner who uses a diaphragm for contraception. His temperature is 37.7°C (99.9°F). Physical examination shows several painless violaceous vesiculopustular lesions on the dorsum of both wrists and hands, with two lesions on the left palm, alongside swelling and erythema of the left wrist with severe tenderness to palpation and passive movement. The migratory pattern of arthralgia (knee followed by wrist), low-grade systemic symptoms, and the distribution and morphology of the cutaneous lesions are classic for the dermatitis–arthralgia–arthritis spectrum of DGI, with the current monoarticular wrist findings representing the purulent arthritis phase. Although recent camping in Minnesota suggests potential exposure to tick-borne pathogens, the clinical phenotype—particularly the vesiculopustular lesions and acute monoarthritis—favors DGI over alternative etiologies. The most likely diagnosis is disseminated gonococcal infection."
    }
}