{
    "question": "Based on the provided evidence, answer the following question: A 23-year-old man is brought to the emergency department by police at 2:00 AM. They picked him up from a local nightclub, where he was yelling and threatening to fight the staff. A review of his medical record is unremarkable. At the hospital, his behavior continues to be agitated and bizarre. His temperature is 37.0В°C (98.6В°F), the blood pressure is 162/98 mm Hg, the heart rate is 120/min, the respiratory rate is 18/min, and the oxygen saturation is 99% on room air. The physical exam is notable for agitation, but otherwise, he appears healthy. His thin nasal mucosa oozes blood and his pupils are 2mm, equal, and reactive to light. His speech is pressured and bizarre. He insists the hospital should let him go because вЂњI am in the FBIвЂќ. Urine toxicology is sent to the laboratory for analysis. What is the most likely cause of this patient's presentation?. If there are multiple answers, separate them with commas. In your explanation, point out what is correct and incorrect in the evidence.",
    "content": {
        "source_1": "A 23-year-old man was brought to the emergency department at 2:00 AM from a nightclub after yelling and threatening to fight the staff; his past medical record is unremarkable. In the hospital he remained agitated with bizarre behavior. Vital signs demonstrated an adrenergic pattern with blood pressure 162/98 mm Hg and heart rate 120/min, while temperature was 37.0В°C (98.6В°F), respiratory rate 18/min, and oxygen saturation 99% on room air. Physical examination revealed marked agitation but was otherwise normal, with thin nasal mucosa oozing blood, pupils 2mm equal and reactive to light, and pressured, bizarre speech with grandiose content (“the hospital should let him go because вЂњI am in the FBIвЂќ”); urine toxicology was sent for analysis. The constellation of acute psychomotor agitation, hypertension, tachycardia, and disinhibited, grandiose speech in a late-night, nightclub context, together with traumatic/irritative nasal findings, is most consistent with a sympathomimetic toxidrome from a recreational agent, and pupil size variability does not exclude this diagnosis in acute presentations. Stimulant drug use.",
        "source_2": "A 23-year-old man with no recorded comorbidities was brought by police from a nightclub at 2:00 AM for yelling and threatening to fight staff; in the emergency department he remained agitated and bizarre. His vital signs were: temperature 37.0В°C (98.6В°F), blood pressure 162/98 mm Hg, heart rate 120/min, respiratory rate 18/min, and oxygen saturation 99% on room air. Examination showed agitation with otherwise healthy appearance, thin nasal mucosa oozing blood, and pupils 2mm equal and reactive to light; his speech was pressured and bizarre, and he insisted “the hospital should let him go because вЂњI am in the FBIвЂќ.” Urine toxicology was sent. The presentation of acute grandiosity and disorganized, pressured speech with paranoia-like behavior, coupled with sympathetic overactivity (hypertension and tachycardia) and signs of intranasal irritation, is diagnostic of an acute stimulant-induced psychosis most classically associated with cocaine; pupil constriction does not preclude this diagnosis in real-world lighting and mixed-substance settings. Cocaine intoxication",
        "source_3": "A 23-year-old man was escorted by police to the emergency department at 2:00 AM after disruptive, aggressive behavior at a nightclub, with an unremarkable prior medical record. He remained agitated and bizarre in the hospital, with temperature 37.0В°C (98.6В°F), blood pressure 162/98 mm Hg, heart rate 120/min, respiratory rate 18/min, and oxygen saturation 99% on room air. Physical examination revealed agitation, thin nasal mucosa oozing blood, and pupils 2mm equal and reactive to light; his speech was pressured and bizarre, including the assertion that “the hospital should let him go because вЂњI am in the FBIвЂќ,” and urine toxicology was sent for analysis. In the epidemiologic context of late-night club attendance in a young adult, the combination of psychomotor agitation, hypertensive tachycardia, disinhibited/grandiose speech, and evidence of nasal mucosal trauma is most consistent with recreational sympathomimetic exposure, supporting a diagnosis of Stimulant Abuse."
    }
}