{
    "question": "Based on the provided evidence, answer the following question: A 17-year-old boy comes to the emergency department because of a 3-day history of pain in his left wrist. That morning the pain increased and he started to have chills and malaise. Last week he had self-resolving left knee pain. He is otherwise healthy and has not had any trauma to the wrist. He recently returned from a camping trip to Minnesota. He is sexually active with one female partner, who uses a diaphragm for contraception. His temperature is 37.7В°C (99.9В°F). Examination shows several painless violaceous vesiculopustular lesions on the dorsum of both wrists and hands; two lesions are present on the left palm. There is swelling and erythema of the left wrist with severe tenderness to palpation and passive movement. What is the most likely diagnosis?. If there are multiple answers, separate them with commas. In your explanation, point out what is correct and incorrect in the evidence.",
    "content": {
        "source_1": "The clinical presentation in a 17-year-old boy with a 3-day history of left wrist pain that acutely worsened that morning with chills and malaise, preceded by self-resolving left knee pain last week, in the absence of wrist trauma and in the context of sexual activity with one female partner who uses a diaphragm for contraception, is most consistent with an acute septic monoarthritis of gonococcal origin. On examination, the left wrist demonstrates swelling and erythema with severe tenderness to palpation and passive movement, indicating an intra-articular inflammatory process characteristic of septic arthritis. The low-grade fever (temperature 37.7В°C [99.9В°F]) and systemic symptoms support infection, and the presence of several painless violaceous vesiculopustular lesions on the dorsum of both wrists and hands, with two lesions on the left palm, provides cutaneous corroboration frequently observed in gonococcal joint disease. The prior migratory arthralgia (left knee to wrist) suggests hematogenous seeding culminating in purulent monoarthritis, a recognized pattern in Neisseria gonorrhoeae joint involvement. Although he recently returned from a camping trip to Minnesota, the dermatologic morphology and acute monoarticular purulence are not typical of alternative tick-borne arthritides, and the epidemiologic profile favors a sexually transmitted etiology. Collectively, these findings support the diagnosis of Gonococcal arthritis.",
        "source_2": "This case exemplifies the arthritis-dermatitis syndrome of disseminated Neisseria gonorrhoeae infection in an otherwise healthy 17-year-old boy presenting with a 3-day history of left wrist pain that acutely intensified with chills and malaise, following a self-resolving episode of left knee pain one week earlier. The pattern of migratory arthralgia (knee to wrist), systemic symptoms with a temperature of 37.7В°C (99.9В°F), and striking dermatologic findings—several painless violaceous vesiculopustular lesions on the dorsum of both wrists and hands, including two on the left palm—aligns with the characteristic triad of dermatitis, migratory polyarthralgia, and tenosynovitis/arthritis seen in disseminated gonococcal infection. The left wrist swelling and erythema with severe tenderness to palpation and passive movement indicate active synovial inflammation consistent with the joint involvement of dissemination. The absence of trauma, sexual activity with one female partner who uses a diaphragm for contraception, and lack of alternative explanatory features despite recent camping in Minnesota further focus the differential toward a sexually transmitted invasive pathogen. In aggregate, the presentation most strongly supports the diagnosis of Disseminated gonococcal infection."
    }
}