{
    "question": "Based on the provided evidence, answer the following question: A 17-year-old boy comes to the emergency department because of a 3-day history of pain in his left wrist. That morning the pain increased and he started to have chills and malaise. Last week he had self-resolving left knee pain. He is otherwise healthy and has not had any trauma to the wrist. He recently returned from a camping trip to Minnesota. He is sexually active with one female partner, who uses a diaphragm for contraception. His temperature is 37.7В°C (99.9В°F). Examination shows several painless violaceous vesiculopustular lesions on the dorsum of both wrists and hands; two lesions are present on the left palm. There is swelling and erythema of the left wrist with severe tenderness to palpation and passive movement. What is the most likely diagnosis?. If there are multiple answers, separate them with commas. In your explanation, point out what is correct and incorrect in the evidence.",
    "content": {
        "source_1": "The clinical presentation in this otherwise healthy 17-year-old boy is dominated by a 3-day history of left wrist pain that acutely intensified that morning, accompanied by chills and malaise, and physical findings of swelling and erythema of the left wrist with severe tenderness to palpation and passive movement, all features consistent with an acute monoarticular septic arthritis of the wrist. A history of self-resolving left knee pain one week prior suggests a migratory arthralgia that commonly precedes focal joint involvement in gonococcal arthritis, and the presence of several painless violaceous vesiculopustular lesions on the dorsum of both wrists and hands, with two lesions on the left palm, further supports a gonococcal dermatosis accompanying joint infection. The patient denies trauma to the wrist, is sexually active with one female partner who uses a diaphragm for contraception, and exhibits low-grade fever (temperature 37.7В°C [99.9В°F]), all of which align with a sexually transmitted etiology rather than post-traumatic or purely inflammatory causes, while the recent camping trip to Minnesota is less compatible with alternative tick-borne explanations given the lesion morphology and joint pattern. Taken together, these temporally linked systemic and localized findings strongly favor a diagnosis of gonococcal arthritis.",
        "source_2": "This case exemplifies the dermatitis–tenosynovitis–arthralgia syndrome characteristic of disseminated gonococcal infection in an adolescent: the patient reports a 3-day history of pain in the left wrist that escalated with chills and malaise, preceded by self-resolving left knee pain last week, consistent with migratory arthralgia; examination reveals swelling and erythema of the left wrist with severe tenderness to palpation and passive movement, indicating synovial and tendon sheath involvement typical of tenosynovitis; and there are several painless violaceous vesiculopustular lesions on the dorsum of both wrists and hands, with two lesions on the left palm, representing the classic gonococcal dermatitis. The absence of wrist trauma, sexual activity with one female partner who uses a diaphragm for contraception, and low-grade fever (temperature 37.7В°C [99.9В°F]) further support hematogenous dissemination of a sexually transmitted pathogen, while recent camping in Minnesota does not account for the observed vesiculopustular rash pattern. In aggregate, the migratory joint symptoms, cutaneous lesions, and tenosynovitis amid systemic malaise and chills most strongly indicate disseminated gonococcal infection."
    }
}