{
    "question": "Based on the provided evidence, answer the following question: A 30-year-old woman comes to the physician because she has been unable to conceive for 3 years. Analysis of her husband's semen has shown normal sperm counts during this time. The patient also reports episodic pelvic and back pain accompanied by painful diarrhea for 5 years. She has about one such episode on average per month for 4вЂ“6 days. She has taken ibuprofen for the pain, which has provided some relief. Menses have occurred at regular 29-day intervals since menarche at the age of 14 years and last for 7 days. She is sexually active with her husband and does not use contraception. Vital signs are within normal limits. Pelvic and bimanual examinations are normal; rectal examination is unremarkable. A hysterosalpingogram 6 months prior showed normal results. What is the most likely underlying mechanism of this patient's symptoms?. If there are multiple answers, separate them with commas. In your explanation, point out what is correct and incorrect in the evidence.",
    "content": {
        "source_1": "A 30-year-old woman with 3 years of infertility despite her husband's normal semen counts reports 5 years of episodic pelvic and back pain accompanied by painful diarrhea, occurring approximately once per month for 4–6 days, with partial relief from ibuprofen. Her menses are regular at 29-day intervals since menarche at age 14 years and last 7 days; she is sexually active with her husband without contraception. Vital signs, pelvic and bimanual examinations, and rectal examination are normal, and a hysterosalpingogram 6 months prior was normal. The cyclicity of pain and gastrointestinal symptoms in the context of infertility is characteristic of endometriosis, in which endometrial tissue outside the uterus undergoes hormonally driven proliferation and bleeding, inciting localized inflammation and pain. While multiple pathogenic models exist, the predominant explanatory framework is that menstrual effluent containing viable endometrial cells refluxes through the fallopian tubes into the peritoneal cavity, where these cells adhere, survive, and cyclically respond to ovarian steroids. This pathophysiologic construct most plausibly accounts for the patient’s presentation and normal structural testing. Retrograde menstruation.",
        "source_2": "This 30-year-old woman presents with 3 years of infertility (partner with normal sperm counts) and a 5-year history of monthly pelvic and back pain with painful diarrhea lasting 4–6 days, partially relieved by ibuprofen, in the setting of regular 29-day menses since menarche at 14 years that last 7 days, normal vital signs, normal pelvic/bimanual and rectal examinations, and a normal hysterosalpingogram 6 months prior; she is sexually active with her husband and uses no contraception. In the differential diagnosis, pelvic inflammatory disease typically features lower abdominal pain with abnormal vaginal discharge and does not fit this cyclic pain pattern or the gastrointestinal symptom constellation; polycystic ovary syndrome is more often associated with irregular menses, hirsutism, and obesity, which are not suggested in this case; and uterine fibroids frequently cause heavy, prolonged bleeding, which is not reported here. By contrast, endometriosis—ectopic endometrial tissue responsive to cyclical hormonal changes—accounts for cyclic pelvic pain and gastrointestinal symptoms and is a well-established cause of infertility via inflammation and adhesions, often with a normal pelvic examination and normal hysterosalpingogram. Endometriosis.",
        "source_3": "The patient is a 30-year-old woman with 3 years of infertility (husband with normal sperm counts) and a 5-year history of episodic pelvic and back pain with painful diarrhea that recurs approximately monthly for 4–6 days and responds partially to ibuprofen. She reports regular 29-day cycles since menarche at age 14 years with menses lasting 7 days; she is sexually active with her husband without contraception. Vital signs, pelvic and bimanual examinations, and rectal examination are unremarkable, and a hysterosalpingogram performed 6 months ago was normal. The cyclic exacerbation of pelvic and gastrointestinal symptoms, together with infertility, strongly implicates endometriosis, wherein endometrial-like glands and stroma located outside the uterine cavity undergo coordinated, hormonally mediated proliferation and shedding, leading to localized inflammation, pain, and impaired fecundity. The normal hysterosalpingogram, which primarily assesses uterine cavity contour and tubal patency, would not exclude peritoneal or ovarian disease, consistent with the normal examinations observed here. Endometrial tissue implantation.",
        "source_4": "In a 30-year-old woman with 3 years of infertility despite a partner’s normal sperm counts, recurrent pelvic and back pain with painful diarrhea over 5 years occurring about monthly for 4–6 days, partial response to ibuprofen, regular 29-day menses since menarche at age 14 years with 7-day duration, normal vital signs, normal pelvic/bimanual and rectal examinations, and a normal hysterosalpingogram at 6 months, the pretest probability of endometriosis in the context of infertility alone is approximately 20–50%. The addition of cyclic pelvic pain and gastrointestinal symptoms typical of endometriosis reasonably increases the posterior probability to around 70%, and the tight temporal association with the menstrual cycle further raises it to around 90%. Normal pelvic examination and hysterosalpingogram do not exclude disease, as peritoneal and ovarian foci frequently elude these assessments. The most parsimonious mechanism integrating these findings is hormonally responsive endometrial mucosa located outside the uterus that cyclically bleeds and inflames adjacent tissues, producing pain and contributing to infertility. Ectopic endometrial tissue."
    }
}